000100200829       IDENTIFICATION DIVISION.
000200200829       PROGRAM-ID.    ACCLIF2.
000300200829       AUTHOR.        Angela Nguyen.
000400200829       INSTALLATION.  CITIGROUP.
000500210807       DATE-WRITTEN.  September 2006.
000600210807       DATE-COMPILED.
000700200829      ******************************************************************
000800200829      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
000900200829      ******************************************************************
001000200829      * Angela N.  * 2006/09/07   * RFS 35267 - New program            *
001100200829      * Bharti M   * 2006/10/26   * RFS34838 - Recompile.              *
001200200829      *            *              * MFAACLIFP & MFAACRIFP expanded.    *
001300200829      * Frank Hong * 2006/11/03   * RFS 32931                          *
001400200829      *            *              * 1) Introduce new formula for BC, MB*
001500200829      *            *              *    Max Withdrawal Amt calculation. *
001600200829      *            *              * 2) Introduce new formula for NS    *
001700200829      *            *              *    Temp Income calculation.        *
001800200829      *            *              * 3) All withdraw up to Max Withdraw *
001900200829      *            *              *    Amt + Temp Income (if not 0).   *
002000200829      * A. Q. Mufti* 2006/12/06   * RFS 38651 - Fix LIF Income Factor, *
002100200829      *            *              * Ref Temp Income & Market Value Date*
002200200829      * Marek T    * 2006/12/11   * Defect# 32931.6                    *
002300200829      *            *              * Values are displayed in wrong order*
002400200829      *            *              * in ACCLIFA. This is legacy         *
002500200829      *            *              * caused by 35267.                   *
002600200829      * Raymond Mui* 2007/10/10   * RFS 41252                          *
002700200829      *            *              * Alberta and Ontario LIF regulatory *
002800200829      *            *              * changes.                           *
002900200829      * Lev O      * 2008/06/16   * RFS47476 - Change the program to   *
003000200829      *            *              *   replace calculated field         *
003100200829      *            *              *   reference temp income with zero  *
003200200829      *            *              *   for NS province if it become     *
003300200829      *            *              *   negative.                        *
003400200829      * Lev O      * 2008/07/03   * RFS47476 - retrofited for acc      *
003500200829      *            *              *   install.                         *
003600200829      * Shu Y      * 2008/08/20   * RFS52785 - Include account created *
003700200829      *            *              *   in the current year (account age *
003800200829      *            *              *   is 0) in the calculation of the  *
003900200829      *            *              *   maximum payment of LIF account   *
004000200829      *            *              *   for province AB.                 *
004100200829      * John O'Callaghan          * RFS57189 - Recompile.
004200200829      *            * 2008/09/24   *  ACCOUNT-LIF expanded
004300200829      * John O'Callaghan          * RFS 44202 - New calculation for    *
004400200829      *            * 2008/09/16   *  new LIF fields.                   *
004500200829      * Shu Y      * 2008/10/28   * 44202.7 - Use current year start/  *
004600200829      *            *              * end date to calculate daily        *
004700200829      *            *              * investment returns relinquished    *
004800200829      *            *              * amount.                            *
004900200829      * Shu Y      * 2008/10/29   * 44202.9 & 10 -                     *
005000200829      *            *              * Exclude account attribute OLDLF    *
005100200829      *            *              * for daily calculation of           *
005200200829      *            *              * investment returns relinquished    *
005300200829      *            *              * amount and year end LIF maximum    *
005400200829      *            *              * withdrawal amount.                 *
005500200829      * Meynard B  * 2008/11/11   * 53401                              *
005600200829      *            *              * Set GWA Current Year amt to        *
005700200829      *            *              * calculated LIF Minimum Withdrawal  *
005800200829      *            *              * amt                                *
005900200829      * Sanjeev P  * 2009/02/06   * 58577 - Manitoba LIF calculation   *
006000200829      *            *              * should not apply to Non GIC        *
006100200829      *            *              * product.                           *
006200200829      * Waldi R.   * 2009/03/26   * 54661 - Calculate max amount for   *
006300200829      *            *              * locked-in RLIF accounts (subrule 2)*
006400200829      * Bathuu L   * 2009/06/08   * 59853 - Not to check market value  *
006500200829      *            *              * of account to calculate investment *
006600200829      *            *              * return relinquished for rollover   *
006700200829      *            *              * transaction.                       *
006800200829      * Andy Chan  * 2009/06/22   * 67029 - Add carry over from last   *
006900200829      *            *              * year`s max to this year max for ON *
007000200829      * Waldi R.   * 2009/11/03   * 73715 - Include contribution redem-*
007100200829      *            *              * ption rule "88".                   *
007200200829      * Emma. Yala * 2010/02/16   * 78607 - Incorrect Temp Inc. for NS *
007300200829      * Lev O      * 2010/05/10   * RFS73628 - Change the program for  *
007400200829      *            *              *   Legislative changes for Ontario  *
007500200829      *            *              *   LIF and LRIF maximum             *
007600200829      *            *              *   calculations.                    *
007700200829      * Emmanuel Y * 2010/07/15   * RFS84339 - Remove the check of     *
007800200829      *            *              * account attribute OLDLF            *
007900200829      * Lev O      * 2010/06/07   * RFS80602 - use proportional        *
008000200829      *            *              *   calculation if applicable.       *
008100200829      *            *              *                                    *
008200200829      * SANKARAN R * 2010/10/08   * RFS85276 - RIF/LIF Calculator      *
008300200829      * Sridharan  * 2010/11/15   * RFS88522 - Max LIF calculation for *
008400200829      *            *              *                         AB and MB  *
008500200829      *            *              *                                    *
008600200829      * SANKARAN R * 2010/12/13   * RFS89935 - Include DateforCalc for *
008700200829      *            *              *            calculating Investor Age*
008800200829      * Emman. Yala* 2011/02/23   * RFS91599 - Recompile for 80605     *
008900200829      * Prince     * 2011/06/30   * RFS88038 - Calculate AWD Amounts   *
009000200829      * Nasra F    * 2011/09/22   * RFS100978- Rollback 88038 - code is*
009100200829      *            *              * in RFS100978/PHKQSRC               *
009200200829      * Emman. Yala* 2011/09/26   * RFS101037- Reinstate 88038         *
009300200829      * Pawel A    * 2011/10/04   * RFS100853- Update Excess amount    *
009400200829      *            *              * if GLWB amount > Requested          *
009500200829      * Lev O      * 2011/10/07   * RFS100853.A-set up current account *
009600200829      *            *              *   before CalcGLWBAmt.              *
009700200829      * SARAVANAN R* 2011/09/28   * RFS 95958 - LIF Max Amt forecast
009800200829      *Alan Andrade* 2012/01/10   * RFS92818 - Ensure LIF accounts     *
009900200829      *            *              * on workfile are deleted from file  *
010000200829      *            *              * MFAACWATP. Fix implicit joins.     *
010100200829      *            *              *
010200200829      * Lev O      * 2012/02/27   * RFS105383 -                        *
010300200829      *            *              * #1 - Make changes to ensure        *
010400200829      *            *              *   GLWB Contract does not exceeds   *
010500200829      *            *              *   the maximum allowed.             *
010600200829      *            *              * #2,#3 -  Withdrawal amount fix     *
010700200829      *            *              *                                    *
010800200829      *            *              * #4 -  fix number of payments.      *
010900200829      * Pawel A    * 2012/05/23   * RFS 109552 Incorrect AWD paid and  *
011000200829      *            *              * IFPAY TAXSEL split                 *
011100200829      *            *              *                                    *
011200200829      * Venkatesh C* 2012/05/30   * RFS109551 - Fix to determine       *
011300200829      *            *              * AWD restart date                   *
011400200829      * Pawel A    * 2012/07/31   * RFS 112498 Incorrect AWD Split if  *
011500200829      *            *              * no AWD option selected             *
011600200829      * Thilaga K  * 2012/08/28   * RFS112468 - AWD number of pymts in *
011700200829      *            *              * error when Active status           *
011800200829      * Thilaga K  * 2012/08/13   * RFS107585- Recompile for MFASGSTOP *
011900200829      * Venkatesh C* 2012/10/19   * RFS117298- Recompile for MFAACCONP *
012000200829      * Ambikapathy* 2012/12/14   * RFS112135- Recompile for MFASGSTOP *
012100200829      * Ganbold L  * 2013/03/11   * RFS119993 - Recompile only         *
012200200829      * Nagamani S * 2013/04/22   * RFS122007- Recompile for MFAGDTHCSP*
012300200829      * Callista N * 2013/05/10   * RFS108944 - Recompile.             *
012400200829      * Andy Chan  * 2013/08/30   * RFS127401 - Recompile for CPFXSGMTVA
012500200829      *            *              *                                    *
012600200829      * Sairam     * 2013/09/13   * RFS127038 - Re-compile
012700200829      * Deepika    * 2013/09/18   * RFS121426 - Recompile.
012800200829      * Rupesh Kr  * 2013/12/13   * RFS113892 - Closed the file,       *
012900200829      *            *              * before returning to the job        *
013000200829      *            *              * to avoid the existing Open File    *
013100200829      *            *              * Issue.                             *
013200200829      *Thilaga K  * 2014/01/21   * RFS133150 - Recompile for MFATRCODP
013300200829      *Abhisek M   * 2014/02/12   * RFS129784 - Recompile for MFAALWRST
013400200829      *Thilaga K   * 2014/02/18   * RFS132733 - Recompile for MFAGDTHVP
013500200829      * Abhisek M  * 2014/03/19   * RFS129478 - GLWB enhancements
013600200829      *Siddharth N* 2014/06/11   * RFS130316 -  Changing the DELETE    *
013700200829      *            *              *    from MFAACWATP SQL clause       *
013800200829      *Abhisek M   * 2014/06/18   * RFS138028 - Recompile for MFAACCONP
013900200829      * Manjusha V * 2014/04/01   * RFS129902 - Recompile for CPGLWBRULE
014000200829      * Vinsfy J   * 2014/06/13   * RFS136634 -Recompile for MFAACCATP
014100200829      * Nagamnai S * 2014/08/13   * RFS139007 -Recompile for CPGLWBRULE
014200200829      * Waldi R.   * 2014/09/08   * RFS137082 - GLWB Enhancements
014300200829      *            *              * Original GWA/LWA
014400200829      *Arthy K     * 2014/10/31   * RFS140137 - LIF maximum payment
014500200829      *            *              * calculation changes for province AB:
014600200829      *            *              * age threshold 85 is changed to 90.
014700200829      * Abhisek M  * 2014/12/03   * RFS142596 - JOBLIFGEN going in MSGW
014800200829      *            *              * due to decimal data error caused by
014900200829      *            *              * use of unreached variable
015000200829      *Thilaga K   * 2015/05/12   * RFS145136 - Recompile for MFAACCNNP
015100200829      * Thaju SK   * 2015/09/02   * RFS148093 - LIF Calculation changes
015200200829      *            *              * for BC - 2015 Budget - Unitrax
015300200829      * MALLESH H  * 2016/01/04   * RFS143761 - YE15 - LIF TEMP INCOME
015400200829      *            *              * CALCULATION FOR NOVA SCOTIA
015500200829      * Muthu      * 2016/06/27   * RFS156153 - YE16 - LIF Withdrawal
015600200829      * lakshmi M  *              * Formula by Account Sub-Type.
015700200829      * Arthy K    * 2017/08/11   * RFS173685 Fix for Minimum amt being
015800200829      *            *              * paid out incorrectly in RRIF account
015900200829      * Ragavi S   * 2018/03/22   * RFS177195 - AWD amount was incorrectly
016000200829      *            *              * updated 
016100200829      * Kavya K    *  2019/02/25  * RFS181057 - Recompile for MFAACMDP  *
016200200829      * Bathuu L   *  2019/10/08  * RFS184855 - Populate tax file.
016300200829      * Chaya SP   *  2020/03/25  * RFS185170 - Recompile for MFAGDTHCSP *
016400200829      * SasiKumar  *  2020/02/25  * RFS185169 - Account level GLWB
016500200829      *            *              * enhancements
016600200829      * SasiKumar  *  2020/04/14  * RFS185170 - Optional Riders
016700200829      * Kirthigaa S*  2020/04/17  * RFS186069 - Recompile for MFAACMDP *
016800200829      * Vignesh    * 2020/06/10   * RFS185171 - Recompile for MFAACLBENP
016900200829      * Ashwini B  * 2020/06/25   * RFS184676 - Recompile for MFAGDTHVP*
017000200829      * Chaya SP   * 2020/07/06   * RFS185172 - Recompile for mfaacconp*
017100200829      * Vignesh    *  2020/06/25  * RFS183812 - Recompile for MFASGSTOP
017200200829      * Bagathsingh*  2020/06/02  * RFS185171 - To Calculate LIF maximum *
017300200829      *            *              * amount for when GWA amont >LIF max   *
017400200829      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
017500200829      *                           * MFAGDTHCSP and MFAGDTHVP
017600200829      * Niranjan   * 2020/07/28   * RFS186053 - Use the investment       *
017700200829      *            *              * determined by Withdrawal Hierarchy   *
017800200829      *            *              * for accounts without investment      *
017900200915      * Gomathi S  * 2020/09/14   * RFS1103875 - YE20: RRIF & LIF details*
018000201127      *            *              * screen not updated after YE batch run*
018100201127      * Bagathsingh* 2020/10/15   * RFS1105579 - To recalculate Account  *
018200201127      *            *              * AWD investment for GLWB LIF account  *
018300201127      * Sasikumar  * 2020/11/4    * RFS1105650 - ACCGWDT- RRIF Minimum   *
018400201127      *            *              * Amount is not updated.               *
018500201127      *            *              * Changes are also tagged as 105650    *
018600201016      * Kavya K    * 2020/10/13   * RFS186497 - Recompile for MFAACMDP   *
018700201221      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP, *
018800201221      *                           * MFAACLBENP                           *
018900210226      * Ashwini B  * 2021/02/08   * RFS187046 - Recompile for MFAACLBENP *
019000210713      * Kavin      * 2021/02/17   * RFS186290 - Recompile only
019100210713      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
019200210713      * M K SINDHU * 2021/07/13   * RFS186771 - RECOMPILE MFAACPREVP     *
019300210623      *                           * MFAACLIF, MFAFRMATRP
019400210615      * Jason      * 2021/06/21   * RFS186771 - Tax NR4 Issue with PPPA  *
019500200829      *     Joshua *              *                                      *
019600210807      * Kavin K    * 2021/08/07   * RFS187471 - Recompile for MFAGDTHVP  *
019700211008      * Swathi J   * 2021/10/08   * RFS1121738- PPPA warranty issues     *
019800211008      *            *              * from RFS: 186771 testing
019900200829      ********************************************************************
020000200829      *===============================================================*
020100200829       ENVIRONMENT DIVISION.
020200200829       CONFIGURATION SECTION.
020300200829       SOURCE-COMPUTER. IBM-AS400.
020400200829       OBJECT-COMPUTER. IBM-AS400.
020500200829       SPECIAL-NAMES. LOCAL-DATA IS WS-LOCAL
02060020082932931                 DATA-AREA  IS lc_DataArea
020700200829185169                DATA-AREA  IS WS-DTAARA-MFASEGPARM
020800200829                      LINKAGE TYPE IS PROCEDURE FOR "FXREMPAY"
020900200829      * RFS80602 - Begin
021000200829                      LINKAGE TYPE IS PROCEDURE FOR "FXSEGMATVA".
021100200829      * RFS80602 - End
021200200829      *
021300200829       INPUT-OUTPUT SECTION.
021400200829       FILE-CONTROL.
021500200829
021600200829R58577     SELECT  Lif-Withdrawal-Formula
021700200829|                  ASSIGN TO DATABASE-MFALIFWTFP
021800200829|                  ORGANIZATION IS INDEXED
021900200829|                  ACCESS IS DYNAMIC
022000200829R58577             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022100200829
022200200829       DATA DIVISION.
022300200829       FILE SECTION.
022400200829
022500200829R58577 FD  Lif-Withdrawal-Formula
022600200829|          LABEL RECORDS ARE STANDARD.
022700200829|      01  Lif-Withdrawal-Formula-Rec.
022800200829|              COPY DD-ALL-FORMATS OF MFALIFWTFP.
022900200829|     /
023000200829R58577
023100200829
023200200829      * ---------------------------------
023300200829       WORKING-STORAGE SECTION.
023400200829      * ---------------------------------
023500200829          COPY Cpysqlfld
023600200829               REPLACING == "CURRENT_PROGRAM" == BY == "ACCLIF2" ==.
023700200829      *
023800200829           EXEC SQL
023900200829             INCLUDE SQLCA
024000200829           END-EXEC.
024100200829
024200200829      * Error Codes, Uniquely Identify where the error happened
024300200829       01 Ws-Err-Code                 PIC X(02) VALUE SPACES.
024400200829          88 Ws-Err-Ok                          VALUE "00".
024500200829          88 Ws-Err-01                          VALUE "01".
024600200829          88 Ws-Err-02                          VALUE "02".
024700200829          88 Ws-Err-03                          VALUE "03".
024800200829          88 Ws-Err-04                          VALUE "04".
024900200829          88 Ws-Err-05                          VALUE "05".
025000200829          88 Ws-Err-06                          VALUE "06".
025100200829          88 Ws-Err-07                          VALUE "07".
025200200829          88 Ws-Err-08                          VALUE "08".
025300200829          88 Ws-Err-09                          VALUE "09".
025400200829          88 Ws-Err-10                          VALUE "10".
025500200829          88 Ws-Err-11                          VALUE "11".
025600200829          88 Ws-Err-12                          VALUE "12".
025700200829          88 Ws-Err-13                          VALUE "13".
025800200829          88 Ws-Err-14                          VALUE "14".
025900200829          88 Ws-Err-15                          VALUE "15".
02600020082932931     88 Ws-Err-16                          VALUE "16".
02610020082932931     88 Ws-Err-17                          VALUE "17".
02620020082941252     88 Ws-Err-18                          VALUE "18".
02630020082941252     88 Ws-Err-19                          VALUE "19".
02640020082944202     88 Ws-Err-20                          VALUE "20".
02650020082944202     88 Ws-Err-21                          VALUE "21".
02660020082944202     88 Ws-Err-22                          VALUE "22".
02670020082954661     88 Ws-Err-23                          VALUE "23".
02680020082954661     88 Ws-Err-24                          VALUE "24".
02690020082954661     88 Ws-Err-25                          VALUE "25".
02700020082954661     88 Ws-Err-26                          VALUE "26".
02710020082954661     88 Ws-Err-27                          VALUE "27".
027200200829      * RFS80602 - Begin: added new error codes
027300200829          88 Ws-Err-28                          VALUE "18".
027400200829129478    88 Ws-Err-29                          VALUE "29".
027500200829      *RFS184855 - Start
027600200829          88 Ws-Err-30                          VALUE "30".
027700200829      *RFS184855 - End
027800200829185169    88 Ws-Err-31                          VALUE "31".
027900200829185169    88 Ws-Err-32                          VALUE "32".
028000200829185169    88 Ws-Err-33                          VALUE "33".
028100200829185169    88 Ws-Err-34                          VALUE "34".
028200200829185171    88 Ws-Err-35                          VALUE "35".
028300200829185171    88 Ws-Err-36                          VALUE "36".
028400200829185171    88 Ws-Err-37                          VALUE "37".
028500200829185171    88 Ws-Err-38                          VALUE "38".
028600200829185171    88 Ws-Err-39                          VALUE "39".
028700200829185171    88 Ws-Err-40                          VALUE "40".
028800200829185171    88 Ws-Err-41                          VALUE "41".
028900200829185171    88 Ws-Err-42                          VALUE "42".
029000200829185171    88 Ws-Err-43                          VALUE "43".
029100200829
029200200829      * Flag to check end of the cursor/read
029300200829       01 lc_lifMinFlag                  PIC X(1) VALUE SPACES.
029400200829         88 lncc_lifMinStart             VALUE SPACES.
029500200829         88 lncc_lifMinEnd               VALUE "9".
029600200829      * RFS80602 - End
029700200829
029800200829       01 lc_ErrorCodeDescr           PIC X(50) VALUE SPACES.
029900200829          88 lncc_ErrCodeDescr01                VALUE
030000200829             "Error in create table Sbacclif".
030100200829          88 lncc_ErrCodeDescr02                VALUE
030200200829             "Error in declare cursor c_Lif".
030300200829          88 lncc_ErrCodeDescr03                VALUE
030400200829             "Unable to open cursor c_Lif".
030500200829          88 lncc_ErrCodeDescr04                VALUE
030600200829             "Error in doing INSERT Sbacclif".
030700200829          88 lncc_ErrCodeDescr05                VALUE
030800200829             "Error in UPDATE Mfaivrapip".
030900200829          88 lncc_ErrCodeDescr06                VALUE
031000200829             "Error in DELETE Mfaacwatp".
031100200829          88 lncc_ErrCodeDescr07                VALUE
031200200829             "Error in DELETE Mfaaccaip".
031300200829          88 lncc_ErrCodeDescr08                VALUE
031400200829             "Error in declare cursor c_LifDtls".
031500200829          88 lncc_ErrCodeDescr09                VALUE
031600200829             "Error in open cursor c_LifDtls".
031700200829          88 lncc_ErrCodeDescr10                VALUE
031800200829             "Error in INSERT Mfaaccaip".
031900200829          88 lncc_ErrCodeDescr11                VALUE
032000200829             "Error in INSERT Mfaaccwatp".
032100200829          88 lncc_ErrCodeDescr12                VALUE
032200200829             "Error in UPDATE Mfaaccawp".
032300200829          88 lncc_ErrCodeDescr13                VALUE
032400200829             "Error in UPDATE Mfaacladp".
032500200829          88 lncc_ErrCodeDescr14                VALUE
032600200829             "Error in INSERT Mfaacladp".
032700200829          88 lncc_ErrCodeDescr15                VALUE
032800200829             "Error in INSERT Mfalifclp".
03290020082932931     88 lncc_ErrCodeDescr16                VALUE
03300020082932931        "Error in calculating SUM of Gross Amt in MFATRNP".
03310020082941252     88 lncc_ErrCodeDescr18                VALUE
03320020082941252        "Error in retrieving MFALIFWTFP".
03330020082944202     88 lncc_ErrCodeDescr20                VALUE
03340020082944202        "Error in retrieving SQACCLIF Market Value".
03350020082944202     88 lncc_ErrCodeDescr21                VALUE
03360020082944202        "Error in retrieving MFALIFWTFP flag values".
03370020082944202     88 lncc_ErrCodeDescr22                VALUE
03380020082944202        "Error in updating the relinquishing amount!".
03390020082954661     88 lncc_ErrCodeDescr23                VALUE
03400020082954661        "Error in retrieving the initial trade".
034100200829      * RFS80602 - Begin: added new error codes
034200200829          88 lncc_ErrCodeDescr28                VALUE
034300200829             "Error opening lcu_lifMin cursor".
034400200829129478    88 lncc_ErrCodeDescr29                VALUE
034500200829129478       "Error updating lifetime withdrawal amount".
034600200829      *RFS184855 - Start
034700200829          88 lncc_ErrCodeDescr30                VALUE
034800200829             "Error in INSERT Mfaacprevp".
034900200829      *RFS184855 - End
035000200829185169    88 lncc_ErrCodeDescr31                VALUE
035100200829185169       "Error while selecting Acct level Market Value".
035200200829185169    88 lncc_ErrCodeDescr32                VALUE
035300200829185169       "Error opening lcu_lifMinAclbenp cursor".
035400200829185169    88 lncc_ErrCodeDescr33                VALUE
035500200829185169       "Error while Fetch lcu_lifMinAclbenp cursor".
035600200829185169    88 lncc_ErrCodeDescr34                VALUE
035700200829185169       "Error while updating Mfaaclbenp".
035800200829185171    88 lncc_ErrCodeDescr35                VALUE
035900200829185171       "Error while Selecting AWD MFAACCAIP".
036000200829185171    88 lncc_ErrCodeDescr36                VALUE
036100200829185171       "Error while Deleting AWD MFAACCAIP".
036200200829185171    88 lncc_ErrCodeDescr37                VALUE
036300200829185171       "Error while Inserting AWD MFAACCAIP".
036400200829185171    88 lncc_ErrCodeDescr38                VALUE
036500200829185171       "Error while Selecting LIF MFAACLIVP".
036600200829185171    88 lncc_ErrCodeDescr39                VALUE
036700200829185171       "Error while Deleting LIF MFAACLIVP".
036800200829185171    88 lncc_ErrCodeDescr40                VALUE
036900200829185171       "Error while Inserting LIF MFAACLIVP".
037000200829185171    88 lncc_ErrOpenAWDSPLIT               VALUE
037100200829185171       "Error while Opening AWDSplit cursor".
037200200829185171    88 lncc_ErrFetchAWDSPLIT              VALUE
037300200829185171       "Error while Fetching AWDSplit cursor".
037400200829185171    88 lncc_ErrCloseAWDSPLIT              VALUE
037500200829185171       "Error while Closing AWDSplit cursor".
037600200829       01 lc_GLWAminFlag             PIC X(01)  VALUE " ".
037700200829          88  lb_GLWAMinimum               VALUE "Y".
037800200829          88  lb_NoGLWAMinimum             VALUE "N".
037900200829      * RFS80602 - End
038000200829
038100200829       01 lt_literals.
038200200829          03 lt_AuditUser             PIC X(10) VALUE "ACCLIFIV".
038300200829          03 lt_ScreenCode            PIC X(08) VALUE "ACCLIF".
038400200829
038500200829       01 li_SystemDateTime.
038600200829          03 li_ParmSysdate           PIC 9(8)   VALUE 0.
038700200829          03 li_Sysdate               PIC S9(9)  COMP-3 VALUE 0.
038800200829          03 li_ParmSystime           PIC S9(09) COMP-3 VALUE 0.
038900200829          03 li_Systime               PIC S9(09) COMP-3 VALUE 0.
039000200829      * RFS80602 - Begin
039100200829      *
039200200829       01 lc_UpdateGWAFlag              PIC X(01) VALUE SPACE.
039300200829         88 lncc_UpdateGWAYes                     VALUE "Y".
039400200829         88 lncc_UpdateGWANo                      VALUE SPACE.
039500200829
039600200829137082 01 lc_UpdateLWAFlag              PIC X(01) VALUE SPACE.
039700200829137082   88 lncc_UpdateLWAYes                     VALUE "Y".
039800200829137082   88 lncc_UpdateLWANo                      VALUE SPACE.
039900200829185171 01 lncc_GLWBacctFlag              PIC X(1) VALUE SPACE.
040000200829185171   88 lncc_GLWBAcctno              VALUE "N".
040100200829185171   88 lncc_GLWBAcctYes             VALUE "Y".
040200200829
040300200829       01 lc_changeCategory         PIC X(20).
040400200829       01 ln_contractRrifMin        PIC S9(13)V9(02).
040500200829185169 01 ln_accountRrifMin        PIC S9(13)V9(02).
040600200829       01 ln_segmatvaContractMV     PIC S9(11)V9(02) COMP-3.
040700200829      *RFS185171-STARTS
040800200829       01 lc_FXAWD_Parms.
040900200829           03 pi_AccountNo2         PIC S9(09) COMP-3.
041000200829           03 pc_Mode2              PIC X(01).
041100200829           03 pc_FrequencyCode2     PIC X(02).
041200200829           03 pn_IFPayAmount2       PIC S9(11)V9(02) COMP-3.
041300200829           03 pn_TaxselAmount2      PIC S9(11)V9(02) COMP-3.
041400200829           03 pc_RejectCode2        PIC X(02).
041500200829      *RFS185171-ENDS
041600200829       01 lc_sysDateTimeForLogs.
041700200829           03 ln_logSysDate             PIC S9(9) COMP-3.
041800200829           03 ln_logSysTime             PIC S9(9) COMP-3.
041900200829      *
042000200829           03 lc_dateTimeOfQuote.
042100200829             05 ln_dateOfQuote               PIC 9(09).
042200200829             05 lc_dateOfQuote PIC X(09) REDEFINES ln_dateOfQuote.
042300200829             05 ln_systime                   PIC 9(08).
042400200829             05 lc_systime     REDEFINES ln_systime.
042500200829               07 lc_timeOfQuote               PIC X(06).
042600200829               07 ln_timeOfQuote REDEFINES lc_timeOfQuote  PIC 9(06).
042700200829               07 lc_timeOfQuoteCC             PIC X(02).
042800200829      * RFS80602 - End
042900200829
043000200829       01  li_MaxRows                 PIC S9(07) BINARY VALUE 300.
043100200829
043200200829       01  ltb_FetchRec.
043300200829           04 ltb_AcctArray                OCCURS 300 TIMES.
043400200829              06 li_ArrAccountNo           PIC S9(09).
043500200829              06 lc_ArrPayTypeCode         PIC  X(01).
043600200829              06 li_ArrMinWithdrawalAmt    PIC S9(11)V9(02) COMP-3.
043700200829              06 li_ArrMaxWithdrawalAmt    PIC S9(09)V9(02) COMP-3.
04380020082932931         06 li_ArrLastMaxWithdrawalAmt PIC S9(09)V9(02) COMP-3.
043900200829              06 li_ArrSpecifiedPayAmt     PIC S9(11)V9(02) COMP-3.
044000200829              06 li_ArrReqAnnualPayment    PIC S9(11)V9(02) COMP-3.
04410020082932931         06 ln_ArrLastYearMV          PIC S9(11)V9(02) COMP-3.
04420020082944202         06 ln_ArrInvReturnRecv       PIC S9(11)V9(02) COMP-3.
044300200829              06 li_ArrInvestorNo          PIC S9(09).
044400200829              06 lc_ArrDealerCode          PIC  X(04).
044500200829              06 lc_ArrDealerRepCode       PIC  X(06).
044600200829              06 lc_ArrAccountTypeCode     PIC  X(05).
044700200829              06 li_ArrLifMinPayFactor     PIC S9(03)V9(04) COMP-3.
044800200829              06 li_ArrLifMaxPayFactor     PIC S9(03)V9(04) COMP-3.
044900200829              06 lc_ArrPayInstrType        PIC  X(01).
045000200829              06 li_ArrIvrapipIvrNo        PIC S9(09).
045100200829              06 li_ArrPrevCalculatedAmt   PIC S9(11)V9(02) COMP-3.
045200200829              06 li_ArrPercentIncrease     PIC S9(03)V9(02) COMP-3.
045300200829              06 li_ArrAccountMV           PIC S9(11)V9(02) COMP-3.
045400200829
045500200829              06 lc_ArrCountryOfAgree      PIC  X(03).
045600200829              06 lc_ArrProvinceOfAgree     PIC  X(02).
04570020082932931         06 li_ArrAcctAge             PIC  S9(03).
045800200829              06 lc_ArrAcctTypeSubRule     PIC  X(01).
045900200829              06 li_ArrAcladpAcctNo        PIC S9(09).
046000200829              06 li_ArrLifIncomeFactor     PIC S9(03)V9(04) COMP-3.
046100200829              06 li_ArrInvestorAge         PIC S9(03).
046200200829              06 lc_ArrCountryCode         PIC  X(03).
046300200829              06 li_ArrInvestorMinAge      PIC S9(03).
046400200829              06 li_ArrInvestorMaxAge      PIC S9(03).
046500200829              06 li_ArrMpeAmt              PIC S9(11)V9(02) COMP-3.
046600210616              06 li_ArrMpePercent          PIC S9(03)V9(02) COMP-3.
046700210707      *RFS186771 - Starts
046800210707              06 lc_ArrTaxCountryCode      PIC  X(03).
046900210616              06 li_ArrPppaEligibleMonth   PIC S9(02).
047000200829      *RFS186771 - Ends
047100200829
047200210617       01  ltb_FetchDtlRec.
047300200829           04 ltb_DtlArray                 OCCURS 300 TIMES.
047400200829              06 li_DtlArrAccountNo        PIC S9(09).
047500200829              06 li_DtlArrMinWithdrawalAmt PIC S9(11)V9(02) COMP-3.
047600200829              06 li_DtlArrExcessPayAmt     PIC S9(11)V9(02) COMP-3.
047700200829              06 lc_DtlArrFedTaxOpt        PIC  X(01).
047800200829              06 lc_DtlArrSplitOptCode     PIC  X(01).
047900200829              06 lc_DtlArrContrRedemCode   PIC  X(06).
048000200829
048100200829              06 li_DtlArrStartDate        PIC S9(08).
048200200829              06 li_DtlArrHoldUntilDate    PIC S9(08).
048300200829
048400200829              06 lc_DtlArrInvCode          PIC  X(05).
048500200829              06 lc_DtlArrConfirm          PIC  X(01).
048600200829              06 lc_DtlArrGrossOrNet       PIC  X(01).
048700200829              06 li_DtlArrAnnualAmt        PIC S9(11)V9(02) COMP-3.
048800200829              06 lc_DtlArrWaiveDsc         PIC  X(01).
048900200829              06 lc_DtlArrWaiveReasonCode  PIC  X(04).
049000200829
049100200829              06 lc_DtlArrNxtYrFreqCode    PIC  X(02).
049200200829              06 li_DtlArrPayPerAnnumLif  PIC S9(03).
049300200829              06 lc_DtlArrFrequencyCode    PIC  X(02).
049400200829              06 li_DtlArrPayPerAnnumAwd   PIC S9(03).
049500200829
049600200829              06 lc_DtlArrContrRedemCdRule PIC  X(02).
049700200829
049800200829              06 lc_DtlArrPayTaxOnB        PIC  X(01).
049900200829              06 lc_DtlArrSplitOptCodeRegB PIC  X(01).
050000200829              06 lc_DtlArrAddReplceTaxRegB PIC  X(01).
050100200829              06 li_DtlArrFedTaxAmtRegB    PIC S9(11)V9(02) COMP-3.
050200200829              06 li_DtlArrFedTaxPrcntRegB  PIC S9(03)V9(02) COMP-3.
050300200829              06 li_DtlArrProvTaxAmtRegB   PIC S9(11)V9(02) COMP-3.
050400200829              06 li_DtlArrProvTaxPrcntRegB PIC S9(03)V9(02) COMP-3.
050500200829
050600200829              06 lc_DtlArrPayTaxOnE        PIC  X(01).
050700200829              06 lc_DtlArrSplitOptCodeRegE PIC  X(01).
050800200829              06 lc_DtlArrAddReplceTaxRegE PIC  X(01).
050900200829              06 li_DtlArrFedTaxAmtRegE    PIC S9(11)V9(02) COMP-3.
051000200829              06 li_DtlArrFedTaxPrcntRegE  PIC S9(03)V9(02) COMP-3.
051100200829              06 li_DtlArrProvTaxAmtRegE   PIC S9(11)V9(02) COMP-3.
051200200829              06 li_DtlArrProvTaxPrcntRegE PIC S9(03)V9(02) COMP-3.
051300200829
051400200829              06 lc_DtlArrPayTaxOnM        PIC  X(01).
051500200829              06 lc_DtlArrSplitOptCodeRegM PIC  X(01).
051600200829              06 lc_DtlArrAddReplceTaxRegM PIC  X(01).
051700200829              06 li_DtlArrFedTaxAmtRegM    PIC S9(11)V9(02) COMP-3.
051800200829              06 li_DtlArrFedTaxPrcntRegM  PIC S9(03)V9(02) COMP-3.
051900200829              06 li_DtlArrProvTaxAmtRegM   PIC S9(11)V9(02) COMP-3.
052000200829              06 li_DtlArrProvTaxPrcntRegM PIC S9(03)V9(02) COMP-3.
052100200829112468        06 li_DtlArrNextPayDate      PIC S9(08).
052200210616177195        06 lc_DtlArrAWDStatus        PIC X(02).
052300210623      *RFS186771 - Starts
052400210616              06 li_DtlArrPPPAEntitlement  PIC S9(13)V9(02) COMP-3.
052500211008112173        06 li_DtlArrRequestedAmt     PIC S9(13)V9(02) COMP-3.
052600200829      *RFS186771 - Ends
052700200829
052800200829       01  ltb_DtlRecord.
052900200829           04 ltb_DtlRec.
053000200829              06 li_DtlAccountNo           PIC S9(09).
053100200829              06 li_DtlMinWithdrawalAmt    PIC S9(11)V9(02) COMP-3.
053200200829              06 li_DtlExcessPayAmt        PIC S9(11)V9(02) COMP-3.
053300200829              06 lc_DtlFedTaxOpt           PIC  X(01).
053400200829              06 lc_DtlSplitOptCode        PIC  X(01).
053500200829              06 lc_DtlContrRedemCode      PIC  X(06).
053600200829
053700200829              06 li_DtlStartDate           PIC S9(08).
053800200829              06 li_DtlHoldUntilDate       PIC S9(08).
053900200829
054000200829              06 lc_DtlInvCode             PIC  X(05).
054100200829              06 lc_DtlConfirm             PIC  X(01).
054200200829              06 lc_DtlGrossOrNet          PIC  X(01).
054300200829              06 li_DtlAnnualAmt           PIC S9(11)V9(02) COMP-3.
054400200829              06 lc_DtlWaiveDsc            PIC  X(01).
054500200829              06 lc_DtlWaiveReasonCode     PIC  X(04).
054600200829
054700200829              06 lc_DtlNxtYrFreqCode       PIC  X(02).
054800200829              06 li_DtlPayPerAnnumLif      PIC S9(03).
054900200829              06 lc_DtlFrequencyCode       PIC  X(02).
055000200829              06 li_DtlPayPerAnnumAwd      PIC S9(03).
055100200829
055200200829              06 lc_DtlContrRedemCdRule    PIC  X(02).
055300200829
055400200829              06 lc_DtlPayTaxOnB           PIC  X(01).
055500200829              06 lc_DtlSplitOptCodeRegB    PIC  X(01).
055600200829              06 lc_DtlAddReplceTaxRegB    PIC  X(01).
055700200829              06 li_DtlFedTaxAmtRegB       PIC S9(11)V9(02) COMP-3.
055800200829              06 li_DtlFedTaxPrcntRegB     PIC S9(03)V9(02) COMP-3.
055900200829              06 li_DtlProvTaxAmtRegB      PIC S9(11)V9(02) COMP-3.
056000200829              06 li_DtlProvTaxPrcntRegB    PIC S9(03)V9(02) COMP-3.
056100200829
056200200829              06 lc_DtlPayTaxOnE           PIC  X(01).
056300200829              06 lc_DtlSplitOptCodeRegE    PIC  X(01).
056400200829              06 lc_DtlAddReplceTaxRegE    PIC  X(01).
056500200829              06 li_DtlFedTaxAmtRegE       PIC S9(11)V9(02) COMP-3.
056600200829              06 li_DtlFedTaxPrcntRegE     PIC S9(03)V9(02) COMP-3.
056700200829              06 li_DtlProvTaxAmtRegE      PIC S9(11)V9(02) COMP-3.
056800200829              06 li_DtlProvTaxPrcntRegE    PIC S9(03)V9(02) COMP-3.
056900200829
057000200829              06 lc_DtlPayTaxOnM           PIC  X(01).
057100200829              06 lc_DtlSplitOptCodeRegM    PIC  X(01).
057200200829              06 lc_DtlAddReplceTaxRegM    PIC  X(01).
057300200829              06 li_DtlFedTaxAmtRegM       PIC S9(11)V9(02) COMP-3.
057400200829              06 li_DtlFedTaxPrcntRegM     PIC S9(03)V9(02) COMP-3.
057500200829              06 li_DtlProvTaxAmtRegM      PIC S9(11)V9(02) COMP-3.
057600200829              06 li_DtlProvTaxPrcntRegM    PIC S9(03)V9(02) COMP-3.
057700200829112468        06 li_DtlNextPayDate         PIC S9(08).
057800210617177195        06 lc_AWDStatus              PIC X(02).
057900210623      *RFS186771 - Starts
058000210617              06 li_DtlPPPAEntitlement     PIC S9(13)V9(02) COMP-3.
058100211008112173        06 li_DtlRequestedAmt        PIC S9(13)V9(02) COMP-3.
058200200829      *RFS186771 - Ends
058300200829
058400200829      * RFS185171 - Begin
058500200829       01  ltb_LifRecord.
058600200829           04 ltb_LifAwdRec.
058700200829              06 li_LifAccountNo           PIC  S9(09).
058800200829              06 li_LifAwdSeqNo            PIC  S9(03).
058900200829              06 lc_LifInvCode             PIC  X(05).
059000200829              06 li_LifAwdAmt              PIC  S9(13)V9(2).
059100200829              06 li_LifAwdPercent          PIC  S9(07)V9(2).
059200200829              06 li_LifAwdUnit             PIC  S9(13)V9(3).
059300200829              06 lc_LifSplitOptCode        PIC  X(01).
059400200829              06 lc_LifConfirm             PIC  X(01).
059500200829              06 lc_LifGrossOrNet          PIC  X(01).
059600200829              06 lc_LifContrRedemCode      PIC  X(06).
059700200829              06 lc_LifIntConfirm          PIC  X(01).
059800200829              06 lc_LifWaiveDsc            PIC  X(01).
059900200829              06 lc_LifWaiveReasonCode     PIC  X(04).
060000200829
060100200829       01  ltb_InvLifRecord.
060200200829           04 ltb_InvLifAwdRec.
060300200829              06 li_InvLifAccountNo        PIC  S9(09).
060400200829              06 lc_InvLifInvCode          PIC  X(05).
060500200829              06 li_InvLifAnnualAmt        PIC  S9(13)V9(2).
060600200829              06 lc_InvLifGrossOrNet       PIC  X(01).
060700200829              06 lc_InvLifConfirm          PIC  X(01).
060800200829              06 lc_InvLifWaiveDsc         PIC  X(01).
060900200829              06 lc_InvLifWaiveReasonCode  PIC  X(04).
061000200829
061100200829       01  ltb_AWDSplit.
061200200829           03 ltb_AWDTable.
061300200829              05 ltb_SpArray               OCCURS 50 TIMES
061400200829                                           INDEXED BY li_CountA.
061500200829                 07 li_SpAccNo             PIC S9(09).
061600200829                 07 lc_SpContCode          PIC  X(06).
061700200829                 07 lc_SpSplitCode         PIC  X(1).
061800200829                 07 li_SpAWDAmt            PIC S9(13)V9(3).
061900200829                 07 li_SpAWDPerc           PIC S9(07)V9(2).
062000200829
062100200829       01  ltb_IndiAwdSplit.
062200200829           03 ltb_IndAWDSplitA             OCCURS 50 TIMES.
062300200829              07 ltb_IndiA                 PIC S9(04) BINARY
062400200829                                           OCCURS 5 TIMES.
062500200829
062600200829      * RFS185171 - End
062700200829
062800200829      * RFS80602 - Begin
062900200829       01 lc_minGurValues.
063000200829         03 ln_RRIFminimum             PIC S9(13)V9(02)  VALUE 0.
063100200829         03 ln_OriginalGWA             PIC S9(13)V9(02)  Value 0.
063200200829         03 ln_GWAAmount               PIC S9(13)V9(02)  Value 0.
063300200829137082   03 ln_OriginalLWA             PIC S9(13)V9(02)  Value 0.
063400200829137082   03 ln_LWAAmount               PIC S9(13)V9(02)  Value 0.
063500200829
063600200829      * RFS80602 - End
063700200829       01  lc_Constants.
063800200829      * RFS80602 - Begin
063900200829           03 lncc_LIFGEN                PIC X(08) VALUE "LIFGEN".
064000200829           03 lncc_AuditUser             PIC X(10) VALUE "ACCLIF2".
064100200829      *RFS85276 - Begin
064200200829           03 lncc_Acclif                PIC X(10) VALUE "ACCLIF    ".
06430020082995958      03 lncc_Lifrtn                PIC X(10) VALUE "LIFRTN    ".
064400200829      *RFS85276 - End
064500200829      *RFS129478 - Begin
064600200829           03 lnc_Rule5                  PIC X(01) VALUE "5".
064700200829      *RFS129478 - END
064800200829           03 lncc_glwaRRIFMinCategory   PIC X(20) VALUE
064900200829              "GLWA RRIF MIN".
065000200829           03 lncc_originalGLWACategory  PIC X(20) VALUE
065100200829              "Original GLWA (RRIF)".
065200200829      * RFS80602 - End
065300200829           03 lc_EndOfProcess            PIC X(1) VALUE Space.
065400200829              88 lncc_EndOfProcess                VALUE "Y".
065500200829              88 lncc_NotEndOfProcess             VALUE "N".
065600200829           03 lc_CursorOpened            PIC X(1) VALUE Space.
065700200829              88 lncc_CursorOpenedYes             VALUE "Y".
065800200829              88 lncc_CursorOpenedNo              VALUE "N".
065900200829           03 lc_Cursor2Opened           PIC X(1) VALUE Space.
066000200829              88 lncc_Cursor2OpenedYes            VALUE "Y".
066100200829              88 lncc_Cursor2OpenedNo             VALUE "N".
066200200829           03 lc_EndOfFetch              PIC X(1) VALUE Space.
066300200829              88 lncc_EndOfFetchYes               VALUE "Y".
066400200829              88 lncc_EndOfFetchNo                VALUE "N".
066500200829           03 lc_ArrayMaxReached         PIC X(1) VALUE Space.
066600200829              88 lncc_ArrayMaxReachedYes          VALUE "Y".
066700200829              88 lncc_ArrayMaxReachedNo           VALUE "N".
066800200829           03 lc_PaymentTypeCode         PIC X(01).
066900200829              88 lncc_PaymentTypeCodeA            VALUE "A".
067000200829              88 lncc_PaymentTypeCodeM            VALUE "M".
067100200829              88 lncc_PaymentTypeCodeX            VALUE "X".
067200200829              88 lncc_PaymentTypeCodeS            VALUE "S".
067300200829              88 lncc_PaymentTypeCodeP            VALUE "P".
067400200829              88 lncc_PaymentTypeCodeBlank        VALUE " ".
067500200829           03 lc_PayInstruction          PIC X(01).
067600200829              88 lncc_PayInstructionBlank         VALUE " ".
067700200829           03 lc_CalcOption              PIC X(01).
067800200829              88 lncc_CalcOptionMin               VALUE "M".
067900200829              88 lncc_CalcOptionExc               VALUE "E".
068000200829           03 lc_NewLifAcct              PIC X(01).
068100200829              88 lncc_NewLifAcctYes               VALUE "Y".
068200200829              88 lncc_NewLifAcctNo                VALUE "N".
068300200829
068400200829           03 lc_MaxPensionEarnBlank     PIC X(01).
068500200829              88 lncc_MaxPensionEarnBlank         VALUE " ".
068600200829
06870020082958577      03 lb_EOF_MFALIFWTFP          PIC X(01).
068800200829|             88 lb_EOF_MFALIFWTFP_Yes            VALUE "Y".
06890020082958577         88 lb_EOF_MFALIFWTFP_No             VALUE "N".
069000200829      *RFS184855 - Start
069100200829           03 lncc_JOBLIFGEN             PIC X(10) VALUE "JOBLIFGEN".
069200200829      *RFS184855 - End
069300200829
069400200829      * lc_Variables
069500200829       01  lc_Variables.
069600200829           03 lc_ProcessDate.
069700200829              05 lc_AsAtDate             PIC X(08).
069800200829              05 li_AsAtDate REDEFINES lc_AsAtDate
069900200829                                         PIC S9(08).
070000200829173685*       05 FILLER                  PIC X(37).
070100200829173685        05 FILLER                  PIC X(04).
070200200829173685        05 YEAR-END                PIC X(01).
070300200829173685        05 FILLER                  PIC X(32).
070400200829              05 lc_YearStartDate        PIC X(08).
070500200829              05 li_YearStartDate REDEFINES lc_YearStartDate
070600200829                                         PIC S9(08).
070700200829              05 FILLER                  PIC X(40).
070800200829              05 lc_YearEndDate          PIC X(08).
070900200829              05 li_YearEndDate REDEFINES lc_YearEndDate
071000200829                                         PIC S9(08).
07110020082954661         05 li_YearEndYear REDEFINES lc_YearEndDate.
07120020082954661            10 li_YearEndDate_CCYY  PIC S9(04).
07130020082954661            10 FILLER               PIC S9(04).
071400200829              05 FILLER                  PIC X(68).
071500200829           03 lc_ExchangeRateType        PIC X(01).
071600200829           03 lc_CurrentVars.
071700200829              05 li_CurrAccountNo        PIC S9(09).
071800200829              05 li_CurrInvestorNo       PIC S9(09).
071900200829              05 lc_CurrInvestmentCode   PIC X(05).
072000200829              05 lc_CurrAccountTypeCode  PIC X(05).
072100200829              05 lc_CurrDealerCode       PIC X(04).
072200200829              05 lc_CurrDealerRepCode    PIC X(06).
072300200829              05 lc_CurrCurrency         PIC X(03).
072400200829185171        05 li_GLWBaccounttNo     PIC S9(09).
072500200829
072600200829           03 lc_AcctTypeSubRule         PIC X(01).
072700200829           03 lc_CountryOfAgree          PIC X(03).
072800200829           03 lc_ProvinceOfAgree         PIC X(02).
072900200829           03 lc_CountryCode             PIC X(03).
07300020082944202      03 lc_Include_First_Year_Flag PIC X(01).
07310020082944202      03 lc_Include_Returns_Transferred  PIC X(01).
07320020082958577      03 lc_ProductTypeCode         PIC X(03).
07330020082958577      03 lc_Lif_Max_Calc_Rule       PIC X(01).
073400200829      *44202.7 - start
073500200829           03 lc_CurrYearStart.
073600200829              05 lc_CurrYearStrYYYY      PIC X(04).
073700200829              05 lc_CurrYearStrMMDD      PIC X(04).
073800200829           03 lc_CurrYearEnd.
073900200829              05 lc_CurrYearEndYYYY      PIC X(04).
074000200829              05 lc_CurrYearEndMMDD      PIC X(04).
074100200829      *44202.7 - end
074200200829      *RFS184855 - Start
074300200829           03 lc_JobKey.
074400200829              05 lc_Job                  PIC X(10).
074500200829              05 lc_User                 PIC X(10).
074600200829              05 lc_Number               PIC X(06).
074700200829      *RFS184855 - End
074800200829
074900200829      *RFS173685 Begin
075000200829       01  lc_Date1.
075100200829              05 li_Date1YYYYMM          PIC 9(06).
075200200829              05 li_Date1DD              PIC 9(2).
075300200829
075400200829       01  lc_Date2.
075500200829              05 li_Date2YYYYMM          PIC 9(06).
075600200829              05 li_Date2DD              PIC 9(02).
075700200829      *RFS177195 STARTS
075800200829       01 lc_Date2a  REDEFINES lc_Date2.
075900200829              05 li_Date2YYYY       PIC 9(4).
076000200829              05 li_Date2MM         PIC 9(2).
076100200829              05 li_Date2DDA        PIC 9(2).
076200200829      *RFS177195 ENDS
076300200829      *RFS173685 End
076400200829
076500200829      * li_Variables
076600200829       01  li_Variables.
076700200829           03 li_NoOfRowsFetched         PIC S9(03).
076800200829           03 li_Cntr                    PIC S9(03).
076900200829           03 li_Ctr1                    PIC S9(03).
077000200829           03 li_Ctr2                    PIC S9(03).
077100200829185171     03 li_NoOfRowsA               PIC S9(03) VALUE 0.
077200200829           03 li_ExchangeRate            PIC S9(2)V9(07) COMP-3.
077300200829           03 li_CurrUnitBal             PIC S9(09)V9(03) COMP-3.
077400200829           03 li_AccInvMarketV           PIC S9(11)V9(02) COMP-3.
077500200829           03 li_AccTotalMarketV         PIC S9(11)V9(02) COMP-3.
077600200829           03 li_UnitPrice               PIC S9(04)V9(04) COMP-3.
077700200829      * RFS 38651 Starts
077800200829      *    03 li_TradeDate               PIC S9(08).
077900200829      * RFS 38651 Starts
078000200829           03 li_PrevMinWithdrawalAmt    PIC S9(11)V9(02) COMP-3.
078100200829           03 li_PrevMaxWithdrawalAmt    PIC S9(11)V9(02) COMP-3.
07820020082932931      03 li_LastMaxWithdrawalAmt    PIC S9(11)V9(02) COMP-3.
078300200829           03 li_SpecifiedPayAmt         PIC S9(11)V9(02) COMP-3.
078400200829           03 li_MarketValue             PIC S9(11)V9(02) COMP-3.
07850020082932931      03 ln_LastYearMV              PIC S9(11)V9(02) COMP-3.
078600200829           03 li_PrevCalculatedAmt       PIC S9(11)V9(02) COMP-3.
078700200829           03 li_MinWithdrawalAmt        PIC S9(11)V9(02) COMP-3.
078800200829           03 li_MaxWithdrawalAmt        PIC S9(11)V9(02) COMP-3.
07890020082932931      03 li_MaxWithdrawalAmtTemp    PIC S9(11)V9(02) COMP-3.
079000200829           03 li_MaxWithdrawalAmt9       PIC S9(09)V9(02) COMP-3.
079100200829           03 li_RequestedTotal          PIC S9(11)V9(02) COMP-3.
079200200829           03 li_ReqAnnualPayment        PIC S9(11)V9(02) COMP-3.
079300200829           03 li_NewReqAnnualPayment     PIC S9(11)V9(02) COMP-3.
079400200829           03 li_ExcessPayAmt            PIC S9(11)V9(02) COMP-3.
079500200829           03 li_PercentIncrease         PIC S9(03)V9(02) COMP-3.
079600200829           03 li_LifMinPayFactor         PIC S9(03)V9(04) COMP-3.
079700200829           03 li_LifMaxPayFactor         PIC S9(03)V9(04) COMP-3.
079800200829           03 li_NewPrevCalcAmt          PIC S9(11)V9(02) COMP-3.
079900200829           03 li_PayPerAnnum             PIC S9(03).
080000210401           03 li_TotalPayout             PIC S9(11)V9(02) COMP-3.
080100210401           03 li_PercentMin              PIC S9(02)V9(05) COMP-3.
080200200829           03 li_PercentExc              PIC S9(02)V9(05) COMP-3.
080300200829           03 li_InvCtr                  PIC S9(03).
080400200829           03 li_TotalInv                PIC S9(03).
080500200829           03 li_StartDate.
080600200829              05 li_StartDateYr          PIC S9(04).
080700200829              05 li_StartDateMmDd        PIC S9(04).
080800200829           03 li_ProcessDate.
080900200829              05 li_ProcessDateYr        PIC S9(04).
081000200829              05 li_ProcessDateMmDd      PIC S9(04).
081100200829           03 li_PrevAccountNo           PIC S9(09).
081200200829           03 li_AwdAmount               PIC S9(11)V9(02) COMP-3.
081300200829           03 li_TotAwdAmountMin         PIC S9(11)V9(02) COMP-3.
081400200829           03 li_TotAwdAmountExc         PIC S9(11)V9(02) COMP-3.
081500200829           03 li_MinDifference           PIC S9(03)V9(02) COMP-3.
081600200829           03 li_ExcDifference           PIC S9(03)V9(02) COMP-3.
081700200829           03 li_Rows                    PIC S9(9) comp-3.
081800200829
081900200829           03 li_LifIncomeFactor         PIC S9(03)V9(04) COMP-3.
082000200829           03 li_InvestorAge             PIC S9(03).
082100200829           03 li_InvestorMinAge          PIC S9(03).
082200200829           03 li_InvestorMaxAge          PIC S9(03).
082300200829           03 li_MpeAmt                  PIC S9(11)V9(02) COMP-3.
082400200829           03 li_MpePercent              PIC S9(03)V9(02) COMP-3.
082500200829           03 li_MpeAmtOne               PIC S9(11)V9(02) COMP-3.
082600200829           03 li_MpeAmtTwo               PIC S9(11)V9(02) COMP-3.
082700200829           03 li_NewRefTempIncome        PIC S9(11)V9(02) COMP-3.
08280020082932931      03 ln_NewRefTempIncomeExtra   PIC S9(11)V9(02) COMP-3.
08290020082932931      03 li_AcctAge                 PIC S9(03).
08300020082932931      03 ln_GrossAmtPaidOut         PIC S9(15)V9(02) COMP-3.
08310020082932931      03 ln_GrossAmtCameInto        PIC S9(15)V9(02) COMP-3.
08320020082932931      03 ln_ReferenceBalance        PIC S9(11)V9(02) COMP-3.
08330020082944202      03 ln_InvReturnRecv           PIC S9(11)V9(02) COMP-3.
08340020082944202      03 ln_InvReturnRelq           PIC S9(11)V9(02) COMP-3.
083500200829           03 li_OLDLF_Cnt               PIC S9(03).                    44202.9
08360020082958577      03 ln_Cnt_PrdType             PIC S9(03).
08370020082978607      03 ln_MaxMinusNewRef          PIC S9(11)V9(02) COMP-3.
08380020082978607      03 li_MinMpe1MV               PIC S9(11)V9(02) COMP-3.
08390020082985276      03 li_RemainAmt               PIC S9(11)V9(02) COMP-3.
08400020082985276      03 li_MinAmt                  PIC S9(11)V9(02) COMP-3.
08410020082985276      03 li_ExcAmt                  PIC S9(11)V9(02) COMP-3.
08420020082985276      03 li_GrossYTD                PIC S9(11)V9(02) COMP-3.
084300200829129478     03 lc_GwaCalcRule             PIC X(01).
084400200829129478     03 lc_GwaCalcRule1            PIC X(01).
084500200829      *RFS 185171 STARTS
084600200829           03 li_LifMaxFactor            PIC S9(03)V9(04) COMP-3.
084700200829           03 ln_GuarWithAmount          PIC S9(13)V9(02)  Value 0.
084800200829           03 lc_AWDOption               PIC X(01) value space.
084900200829           03 lc_PaymtTypeCode           PIC X(01) value space.
085000200829           03 lc_GPPInvCode              PIC X(5)  VALUE SPACES.
085100201127      *RFS 185171 ENDS
085200201127      *RFS 1105579 - Begins
085300201127           03 lc_LIFGlwbInvCode          PIC X(5)  VALUE SPACES.
085400201127      *RFS 1105579 - Ends
085500200829105650     03 li_LifMinFactor            PIC S9(03)V9(04) COMP-3.
085600200829
085700200829      * RFS 54661 - begins.
085800200829           03 li_AcctAge_lk              PIC S9(04).
085900200829           03 li_TradeDateInit           PIC S9(08).
086000200829           03 li_TradeDateYear REDEFINES li_TradeDateInit.
086100200829              05 li_TradeDateInit_CCYY   PIC S9(04).
086200200829              05 FILLER                  PIC S9(04).
086300200829           03 ln_GrossAmtPaidOut_LTD     PIC S9(15)V9(02) COMP-3.
086400200829           03 ln_GrossAmtCameInto_LTD    PIC S9(15)V9(02) COMP-3.
086500200829           03 ln_AccumInvReturn          PIC S9(15)V9(02) COMP-3.
086600200829           03 ln_PrevYearInvReturn       PIC S9(15)V9(02) COMP-3.
086700200829           03 ln_PrevYearInvReturnYear2  PIC S9(15)V9(02) COMP-3.
086800200829           03 ln_ReferenceBalance_lk     PIC S9(11)V9(02) COMP-3.
086900200829      * RFS 54661 - ends.
087000200829      * RFS186053 Starts
087100200829           03 lc_InvUpdCalledBy          PIC X(10).
087200200829           03 li_InvUpdAccountNo         PIC S9(9)  COMP-3.
087300200829           03 lc_InvUpdRC                PIC X(1).
087400200829      * RFS186053 Ends
087500200829
08760020082932931  01  WorkingStorageVariables.
087700200829      * RFS 38651 Starts
087800200829      * RFS105383 - Begin: make sure the value is initialized
087900200829      *   otherwise it could come to MSGW in testing env.
088000200829      *    03 li_TradeDate               PIC S9(08).
088100200829           03 li_TradeDate               PIC S9(08) VALUE 0.
088200200829      * RFS105383 - End
088300200829      * RFS 38651 Ends
08840020082932931      03 ln_ReferenceRateNum6Dec    PIC  9(02)V9(06).
088500200829      * RFS 41252 Start
088600200829           03 lc_CalRule                 PIC  X(01).
088700200829           03 ln_FormulaAmt              PIC  S9(11)V9(02) COMP-3.
088800200829           03 li_VarT                    PIC  S9(03).
088900200829           03 ln_P1                      PIC  S9(11)V9(08) COMP-3.
089000200829           03 ln_P2                      PIC  S9(11)V9(08) COMP-3.
089100200829           03 ln_P3                      PIC  S9(11)V9(08) COMP-3.
089200200829           03 ln_RR                      PIC  9(02)V9(06).
089300200829           03 ln_R1                      PIC  9(03)V9(06).
089400200829           03 ln_Entries                 PIC  S9(05).
089500200829      * RFS 41252 End
089600200829      * RFS 53401 Begin
089700200829           03 ln_AcconAccountNumber      PIC S9(09).
089800200829           03 ln_AcconContractNumber     PIC S9(09).
089900200829      * RFS80602 - Begin: changed the name
090000200829      *    03 ln_AcconGuarWithdrawalAmt  PIC S9(14)V9(02) COMP-3.
090100200829      * RFS80602 - End
090200200829           03 lc_ModuleSegGLWB           PIC X(10) VALUE "SEGGLWB".
090300200829           03 lc_SegGLWB                 PIC X(01).
090400200829              88  lc_SegGLWBYes          VALUE "Y".
090500200829              88  lc_SegGLWBNo           VALUE "N".
09060020082980602      03 li_SaveContractNo          PIC S9(09).
090700200829      * RFS 53401 End
09080020082967029      03 ln-CarryOverAmt            PIC S9(13)V9(2) COMP-3.
090900200829
091000200829       01  lf_MfaaccaipRecord.
091100200829           04 lf_MfaaccaipRec            OCCURS 600 TIMES.
091200200829                                         COPY DD-ALL-FORMATS
091300200829                                           OF Mfaaccaip.
091400200829       01  lf_MfaacwatpRecord.
091500200829           04 lf_MfaacwatpRec            OCCURS 600 TIMES.
091600200829                                         COPY DD-ALL-FORMATS
091700200829                                           OF Mfaacwatp.
091800200829       01 pc_Parameters.
091900200829          03 lc_ActivityCode             PIC  X(08) VALUE "LIFRECLC".
092000200829          03 li_ActivityDate1            PIC S9(08) VALUE 0.
092100200829          03 li_ActivityDate2            PIC S9(08) VALUE 0.
092200200829
09230020082932931  01  lc_MFASYSPARM.
09240020082932931      03  FILLER                    PIC  X(102).
09250020082932931      03  lc_ReferenceRateChar      PIC  X(06).
09260020082932931      03  ln_ReferenceRateNum       REDEFINES
09270020082932931          lc_ReferenceRateChar      PIC  9(02)V9(04).
092800200829
092900200829      * RFS88038 Start
093000200829
093100200829        01  ln_Guar-Withdrawal-Amount       PIC S9(11)V9(02) COMP-3.
093200200829        01  ln_Gwa-Rif-Minimum              PIC S9(11)V9(02) COMP-3.
093300200829        01  ln_Original-Gwa                 PIC S9(11)V9(02) COMP-3.
093400200829        01  ln_Ytd-Guar-Withdrawal-Amount   PIC S9(11)V9(02) COMP-3.
093500200829        01  ln_Ytd-Excess-Withdrawal        PIC S9(11)V9(02) COMP-3.
093600200829        01  ln_Awd-Amount                   PIC S9(11)V9(02) COMP-3.
093700200829        01  lc_Awd-Option                   PIC  X(01).
093800200829        01  li_NoOfGLWBCont                 PIC S9(03).
093900200829        01  ln_RemainingPerCont             PIC S9(11)V9(02) COMP-3.
094000200829        01  ln_ExcessAmt                    PIC S9(11)V9(02) COMP-3.
094100200829      *
094200200829        01  ln_G-Ytd-Guar-Withdrawal-Amt    PIC S9(11)V9(02) COMP-3.
094300200829        01  ln_O-Ytd-Guar-Withdrawal-Amt    PIC S9(11)V9(02) COMP-3.
094400200829        01  ln_C-Ytd-Guar-Withdrawal-Amt    PIC S9(11)V9(02) COMP-3.
094500200829        01  ln_F-Ytd-Guar-Withdrawal-Amt    PIC S9(11)V9(02) COMP-3.
094600200829        01  ln_G-Ytd-Excess-Withdrawal      PIC S9(11)V9(02) COMP-3.
094700200829        01  ln_O-Ytd-Excess-Withdrawal      PIC S9(11)V9(02) COMP-3.
094800200829        01  ln_C-Ytd-Excess-Withdrawal      PIC S9(11)V9(02) COMP-3.
094900200829        01  ln_F-Ytd-Excess-Withdrawal      PIC S9(11)V9(02) COMP-3.
095000200829        01  ln_G-Guar-Withdrawal-Amount     PIC S9(11)V9(02) COMP-3.
095100200829        01  ln_O-Original-Gwa               PIC S9(11)V9(02) COMP-3.
095200200829        01  ln_C-Gwa-Rif-Minimum            PIC S9(11)V9(02) COMP-3.
095300200829        01  ln_F-Awd-Amount                 PIC S9(11)V9(02) COMP-3.
095400200829
095500200829        01  ln_GLWB-Contract-Amt-Total      PIC S9(11)V9(02) COMP-3.
095600200829        01  ln_Eligible-Amount              PIC S9(11)V9(02) COMP-3.
095700200829        01  ln_Deductibles                  PIC S9(11)V9(02) COMP-3.
095800200829        01  ln_AmtRemain                    PIC S9(11)V9(02) COMP-3.
095900200829        01  ln_IFPAYAWDAmt                  PIC S9(11)V9(02) COMP-3.
096000200829
096100200829
096200200829        01  ln_TAXSELAWDAmt                 PIC S9(11)V9(02) COMP-3.
096300200829        01  ln_AWDSplitRatio                PIC S9(07)V9(06) COMP-3.
096400200829
096500200829      * RFS105383 - Begin
096600200829       01  lc_nonGLWBFundExists             PIC X(1) VALUE SPACE.
096700200829       01  lc_BASEOnly                      PIC X(1) VALUE SPACE.
096800200829       01  lc_GLWBOnly                      PIC X(1) VALUE SPACE.
096900200829       01  lc_AllowMultContFlag             PIC X(1) VALUE SPACE.
097000200829       01  li_tmpDate                FORMAT DATE "@Y%m%d".
097100200829       01  ln_PeriodicAmt                   PIC S9(11)V9(02) COMP-3.
097200200829       01  ln_GLWBAmtToBeTaken              PIC S9(11)V9(02) COMP-3.
097300200829       01  ln_totalPaid                     PIC S9(11)V9(02) COMP-3.
097400200829      * RFS105383 - End
097500200829        01  lncc_Is-It-A-GLWB-Calculation   PIC  X(1) VALUE SPACE.
097600200829            88  lncc_GLWB-Calculation                 VALUE "Y".
097700200829            88  lncc_No-GLWB-Calculation              VALUE SPACE.
097800200829      * RFS105383 - Begin: change the name to more descriptive one
097900200829      * ---------------------------------------------------------------
098000200829      * 01  lncc_OptBlankExists             PIC  X(1) VALUE SPACE.
098100200829      *     88  lncc_OptBlankExistsYes                VALUE "Y".
098200200829      *     88  lncc_OptBlankExistsNo                 VALUE SPACE.
098300200829      * ---------------------------------------------------------------
098400200829        01  lncc_GLWBFund                   PIC  X(1) VALUE SPACE.
098500200829            88  lncc_GLWBFundYes                      VALUE "Y".
098600200829            88  lncc_GLWBFundNo                       VALUE SPACE.
098700200829      * RFS105383 - End
098800200829
098900200829      * RFS88038 End
099000200829129478*
099100200829  |     01  ln_Lifetime-Withdrawal-Amt      PIC S9(11)V9(02) COMP-3.
099200200829  |     01  ln_L-Lifetime-Withdrawal-Amt    PIC S9(11)V9(02) COMP-3.
099300200829  |     01  ln_L-Ytd-Guar-Withdrawal-Amt    PIC S9(11)V9(02) COMP-3.
099400200829  |     01  ln_L-Ytd-Excess-Withdrawal      PIC S9(11)V9(02) COMP-3.
099500200829129478*
099600200829      * RFS185171 starts
099700200829        01 li_LIFMaxAmt                     PIC S9(13)V9(02)  Value 0.
099800200829      * RFS185171 ends
099900200829       COPY Cpyrempay.
100000210616
100100210707      *RFS186771 - Starts
100200210707        01 li_PppaEligibleMonth      PIC S9(02).
100300210623        01 lc_InvestorCountry        PIC  X(03).
100400210623        01 li_PPPAAnn                PIC S9(13)V9(02) COMP-3.
100500210708        01 li_PPPAEntitlement        PIC S9(13)V9(02) COMP-3.
100600210708        01 li_PPPA10Amt              PIC S9(13)V9(02) COMP-3.
100700210616        01 li_PPPA2XAmt              PIC S9(13)V9(02) COMP-3.
100800210623        01 lc_PPPANR                 PIC X(01).
100900210623        01 li_PPPA10                 PIC S9(12)V9(04) COMP-3.
101000210707        01 li_PPPA2X                 PIC S9(12)V9(04) COMP-3.
101100210623        01 lncc_CAN                  PIC X(03)  Value "CAN".
101200210707        01 lnci_12                   PIC S9(02) Value 12.
101300210707        01 lncc_FormNR4B             PIC X(04)  Value "NR4B".
101400210707        01 lncc_PPPANRAttr           PIC X(06)  Value "PPPANR".
101500210707        01 lncc_PPPA10Attr           PIC X(06)  Value "PPPA10".
101600210616        01 lncc_PPPA2XAttr           PIC X(06)  Value "PPPA2X".
101700210616      *RFS186771 - Ends
101800200829
101900200829      * Constants
102000200829       77 lnci_0                         PIC S9(01) VALUE 0.
102100200829       77 lnci_1                         PIC S9(01) VALUE 1.
102200200829185171 77 lnci_MaxFetchRec               PIC S9(03) VALUE 50.
102300200829       77 lncc_ProgramCode               PIC  X(08) VALUE "ACCLIFIV".
102400200829       77 lncc_ProgramAction             PIC  X(10) VALUE "DEFAULT".
102500200829       77 lncc_ActivityCode              PIC  X(08) VALUE "LIFRECLC".
102600200829       77 lncc_Yes                       PIC  X(01) VALUE "Y".
102700200829       77 lncc_No                        PIC  X(01) VALUE "N".
102800200829       77 lncc_Space                     PIC  X(01) VALUE " ".
102900200829       77 lncc_BaseCurrency              PIC  X(03) VALUE "CAD".
103000200829       77 lncc_Lif                       PIC  X(03) VALUE "LIF".
103100200829       77 lncc_E                         PIC  X(01) VALUE "E".
103200200829       77 lncc_M                         PIC  X(01) VALUE "M".
103300200829       77 lncc_B                         PIC  X(01) VALUE "B".
103400200829       77 lncc_X                         PIC  X(01) VALUE "X".
103500200829       77 lncc_Y                         PIC  X(01) VALUE "Y".
103600200829       77 lncc_N                         PIC  X(01) VALUE "N".
103700200829       77 lncc_W                         PIC  X(01) VALUE "W".
103800200829       77 lncc_Dollar                    PIC  X(01) VALUE "$".
103900200829       77 lncc_Percent                   PIC  X(01) VALUE "%".
104000200829       77 lncc_Variable                  PIC  X(02) VALUE "VR".
104100200829105383 77 lncc_WK                        PIC  X(02) VALUE "WK".
104200200829105383 77 lncc_BW                        PIC  X(02) VALUE "BW".
104300200829       77 lncc_27                        PIC  X(02) VALUE "27".
10440020082954661  77 lncc_26                        PIC  X(02) VALUE "26".
10450020082954661  77 lncc_28                        PIC  X(02) VALUE "28".
10460020082973715  77 lncc_88                        PIC  X(02) VALUE "88".
10470020082954661  77 lncc_43                        PIC  X(02) VALUE "43".
104800200829       77 lncc_Taxsel                    PIC  X(06) VALUE "TAXSEL".
104900200829       77 lncc_Ifpay                     PIC  X(05) VALUE "IFPAY".
105000200829
105100200829       77 lncc_1                         PIC  X(01) VALUE "1".
105200200829       77 lncc_Country                   PIC  X(03) VALUE "CAN".
105300200829      * RFS 38651 Starts
10540020082932931 *77 lncc_Province                  PIC  X(02) VALUE "QC".
10550020082932931  77 lncc_ProvinceQC                PIC  X(02) VALUE "QC".
105600200829      * RFS 38651 Starts
10570020082932931  77 lncc_ProvinceBC                PIC  X(02) VALUE "BC".
10580020082932931  77 lncc_ProvinceMB                PIC  X(02) VALUE "MB".
10590020082932931  77 lncc_ProvinceNS                PIC  X(02) VALUE "NS".
10600020082952785  77 lncc_ProvinceAB                PIC  X(02) VALUE "AB".
10610020082932931  77 lncc_BUY                       PIC  X(03) VALUE "BUY".
10620020082932931  77 lncc_SWI                       PIC  X(03) VALUE "SWI".
10630020082932931  77 lncc_TRI                       PIC  X(03) VALUE "TRI".
10640020082932931  77 lncc_SEL                       PIC  X(03) VALUE "SEL".
10650020082932931  77 lncc_SWO                       PIC  X(03) VALUE "SWO".
10660020082932931  77 lncc_TRO                       PIC  X(03) VALUE "TRO".
10670020082932931  77 lncc_HST                       PIC  X(03) VALUE "HST".
10680020082932931  77 lncc_HSC                       PIC  X(03) VALUE "HSC".
106900200829      * RFS41252 Start
107000200829       77 lnci_15                        PIC S9(02) VALUE 15.
107100200829       77 lnci_85                        PIC S9(02) VALUE 85.
107200200829       77 lncc_2                         PIC  X(01) VALUE "2".
107300200829       77 lncc_3                         PIC  X(01) VALUE "3".
107400200829      * RFS41252 End
107500200829 88038 77  lncc_GLWB                      PIC  X(04) VALUE "GLWB".
107600200829   |   77  lncc_C                         PIC  X(01) VALUE "C".
107700200829   |   77  lncc_O                         PIC  X(01) VALUE "O".
107800200829   |   77  lncc_F                         PIC  X(01) VALUE "F".
107900200829 88038 77  lncc_G                         PIC  X(01) VALUE "G".
108000200829 88308 77  lncc_Blank                     PIC  X(01) VALUE " ".
108100200829101037 77  lncc_BASE                      PIC X(04) VALUE "BASE".
108200200829129478 77  lncc_L                         PIC X(01) VALUE "L".
108300200829185169 77  lncc_T                         PIC X(01) VALUE "T".
108400200829
108500200829      * RFS185169 - Start
108600200829        01 lc_Mfasegparm.
108700200829          05 FILLER                    PIC X(50).
108800200829          05 Lc_AccountLevelGLWB       PIC X(1) VALUE SPACES.
108900200829            88  Lb_AccountLevelGlwbYes VALUE "Y".
109000200829            88  Lb_AccountLevelGlwbNo  VALUE "N".
109100200829
109200200829        01 li_AccountNo2             PIC S9(09) COMP-3 VALUE ZERO.
109300200829        01 ln_AccountMarketValue     PIC S9(11)V9(2) COMP-3 VALUE ZERO.
109400200829
109500200829        01 ln_AclbenpAccountNumber     PIC S9(09) VALUE ZERO.
109600200829      *Parms to call MKTVALTD
109700200829        01 COMM-DATE                      PIC S9(08).
109800200829        01 COMM-ACCOUNT-NO                PIC S9(09).
109900200829        01 COMM-INVESTMENT-CODE           PIC X(05).
110000200829        01 COMM-VALUE-INVESTMENT-CURRENCY PIC S9(11)V9(02).
110100200829        01 COMM-MARKET-VALUE-BASE         PIC S9(11)V9(02).
110200200829        01 COMM-BOOK-VALUE-BASE           PIC S9(11)V9(02).
110300200829        01 COMM-BOOK-VALUE-EXCHANGE       PIC S9(02)V9(07).
110400200829        01 COMM-TRAN-CLOS-UNIT-BAL        PIC S9(10)V9(03).
110500200829        01 COMM-BASE-UNIT-PRICE           PIC S9(05)V9(04).
110600200829        01 COMM-VALUE-BASE-CURRENCY       PIC S9(11)V9(02).
110700200829        01 COMM-ERROR-CODE                PIC X(01).
110800200829        01 COMM-DATE-IND                  PIC X(01).
110900200829      *RFS 185169 - End
111000200829
111100200829      *RFS185170 -Begin
111200200829           EXEC SQL
111300200829             INCLUDE CPACCGLWBD
111400200829           END-EXEC.
111500200829      *RFS185170 - End
111600200829
111700200829      * RFS80602 - Begin
111800200829      * ---------------------------------------------------------------
111900200829      * Copybook - start
112000200829      * ---------------------------------------------------------------
112100200829       COPY Cpscedtal1.
112200200829       COPY CPFXSGMTVA.
112300200829      * RFS80602 - End
112400200829      *----------------------------------
112500200829       LINKAGE SECTION.
112600200829      *----------------------------------
112700200829      *RFS44202 - Start
112800200829       01 WS-COMMAREA.
112900200829      *RFS85276 - Begin
113000200829      *   03 Pass-Account-no           PIC S9(09).
113100200829      *   03 Pass-Return-code          PIC  99.
113200200829          03 pi_AccountNum             PIC S9(09).
113300200829          03 pc_ReturnCode             PIC  99.
113400200829          03 pi_DateforCalc            PIC S9(08).
113500200829          03 pi_MinWithdrawalAmt       PIC S9(11)V9(02).
113600200829          03 pc_CalledFrom             PIC  X(10).
11370020082995958     03 pi_FromDate               PIC S9(08).
11380020082995958     03 pi_ToDate                 PIC S9(08).
11390020082995958     03 pi_InvReturnRelq          PIC S9(11)V9(02).
114000200829      *RFS85276 - End
114100200829
114200200829      * =================================
114300200829      *PROCEDURE DIVISION.
114400200829       PROCEDURE DIVISION USING WS-COMMAREA.
114500200829      *RFS44202 - End
114600200829
114700200829
114800200829      * ---------------------------------
114900200829       Mainline.
115000200829      * ---------------------------------
115100200829      ********************************
115200200829      * This code should be in every *
115300200829      * SQL program                  *
115400200829      ********************************
115500200829           EXEC SQL
115600200829              WHENEVER SQLERROR CONTINUE
115700200829           END-EXEC.
115800200829
115900200829           PERFORM Initial-Logic.
116000200829           PERFORM Detail-Processing UNTIL lncc_EndOfProcess.
116100200829           PERFORM End-Job.
116200200829
116300200829       Initial-logic.
116400200829      * RFS185169 - Start
116500200829           INITIALIZE Lc_AccountLevelGLWB.
116600200829           ACCEPT lc_MfaSegParm FROM WS-DTAARA-MFASEGPARM
116700200829                                 FOR "MFASEGPARM".
116800200829      * RFS185169 - End
116900200829           SET Ws-Err-Ok TO TRUE.
117000200829           INITIALIZE lc_Variables.
117100200829           MOVE lncc_No TO lc_EndOfProcess.
117200200829           CALL "RTVPRCDTP" USING lc_ProcessDate.
117300200829           CANCEL "RTVPRCDTP".
117400200829
117500200829R58577     OPEN INPUT LIF-WITHDRAWAL-FORMULA.
117600200829
117700200829      *Get System Date
117800200829           CALL "GETDAT" USING li_ParmSysdate.
117900200829           CANCEL "GETDAT".
118000200829           MOVE li_ParmSysdate to li_Sysdate.
118100200829      *Get System Time
118200200829           ACCEPT li_ParmSystime FROM TIME.
118300200829      *    COMPUTE li_ParmSystime = li_ParmSystime / 10000.
118400200829           MOVE li_ParmSystime TO li_Systime.
118500200829
11860020082932931      ACCEPT lc_MFASYSPARM FROM lc_DataArea FOR "MFASYSPARM".
11870020082932931      COMPUTE ln_ReferenceRateNum6Dec = ln_ReferenceRateNum.
118800200829
118900200829      * RFS 53401 Begin
119000200829      * Get Special Module SEGGLWB
119100200829           CALL "RTVMODAUTH"  USING
119200200829                             lc_ModuleSegGLWB   lc_SegGLWB
119300200829      * RFS 53401 End
119400200829
119500200829      * RFS80602 - Begin
119600200829      * Get system date,time for logs
119700200829           ACCEPT ln_dateOfQuote FROM DATE YYYYMMDD.
119800200829           MOVE   ln_dateOfQuote TO ln_logSysDate.
119900200829           ACCEPT ln_systime     FROM TIME.
120000200829           MOVE   ln_systime     TO ln_logSysTime.
120100210616      *
120200210616      *RFS186771 - Starts
120300210616           INITIALIZE lc_PPPANR
120400210616                      li_PPPA10
120500210616                      li_PPPA2X
120600210615
120700210615           EXEC SQL
120800210615            SELECT COALESCE("Y", "N")
120900210615            INTO :lc_PPPANR
121000210707            FROM MFAFRMATRP FRMATRP
121100210707            WHERE FORM_CODE    =  :lncc_FormNR4B
121200210615            AND ATTRIBUTE_CD   =  :lncc_PPPANRAttr
121300210615            AND EFFECTIVE_DATE <= :li_AsAtDate
121400210615            ORDER BY EFFECTIVE_DATE DESC
121500210615            FETCH FIRST ROW ONLY
121600210615           END-EXEC.
121700210615
121800210623           EXEC SQL
121900210616           SELECT COALESCE(FRMATRP.FORM_ATT_NUM_VAL, 0)
122000210615           INTO :li_PPPA10
122100210707           FROM MFAFRMATRP FRMATRP
122200210707           WHERE FORM_CODE = :lncc_FormNR4B
122300210615           AND ATTRIBUTE_CD   = :lncc_PPPA10Attr
122400210615           AND EFFECTIVE_DATE <= :li_AsAtDate
122500210615           ORDER BY EFFECTIVE_DATE DESC
122600210615           FETCH FIRST ROW ONLY
122700210615           END-EXEC.
122800210615
122900210623           EXEC SQL
123000210616           SELECT COALESCE(FRMATRP.FORM_ATT_NUM_VAL, 0)
123100210615           INTO :li_PPPA2X
123200210707           FROM MFAFRMATRP FRMATRP
123300210707           WHERE FORM_CODE = :lncc_FormNR4B
123400210615           AND ATTRIBUTE_CD   = :lncc_PPPA2XAttr
123500210615           AND EFFECTIVE_DATE <= :li_AsAtDate
123600210615           ORDER BY EFFECTIVE_DATE DESC
123700210615           FETCH FIRST ROW ONLY
123800210616           END-EXEC.
123900210615      *RFS186771 - Ends
124000200829
124100200829           Set lb_NoGLWAMinimum to True.
124200200829
124300200829           If lc_SegGlwbYes
124400200829              MOVE "ACCCGWDT"    to Pass-Screen-Code
124500200829              MOVE "RIFGLW  "    to Pass-Edit-Code
124600200829              MOVE "A"           to Pass-Level-Code
124700200829
124800200829              CALL "FXSCEDTAL1" USING Pass-Screen-Code
124900200829                                      Pass-Edit-Code
125000200829                                      Pass-Level-Code
125100200829                                      Retn-Edit-Allowed-Flag
125200200829              If Retn-Edit-Allowed
125300200829                 SET lb_GLWAMinimum   TO TRUE
125400200829              End-If
125500200829           End-If.
125600200829      * RFS80602 - End
125700200829
125800200829           EXEC SQL
125900200829                SELECT COALESCE(Exchange_Rate_Type, " ")
126000200829                  INTO :lc_ExchangeRateType
126100200829                  FROM Mfaprgerp
126200200829                 WHERE Program_Code   = :lncc_ProgramCode
126300200829                   AND Program_Action = :lncc_ProgramAction
126400200829           END-EXEC.
126500200829
126600200829      *RFS44202 - Start
126700200829      *RFS85276 - Begin
126800200829      *RFS89935 - Begin
126900200829           IF pi_AccountNum NOT = 0 AND
12700020082995958         ( pc_CalledFrom = lncc_Acclif OR
12710020082995958           pc_CalledFrom = lncc_Lifrtn )
127200200829              MOVE pi_DateForCalc TO li_YearEndDate
127300200829           END-IF
127400200829      *RFS89935 - End
127500200829
127600200829      *    if pass-account-no not = 0
127700200829           if pi_AccountNum NOT = 0 AND
12780020082995958         ( pc_CalledFrom NOT = lncc_Acclif OR
12790020082995958           pc_CalledFrom     = lncc_Lifrtn )
128000200829      *44202.9 - calculate if not OLDLF account
128100200829      *      MOVE Pass-Account-No TO li_CurrAccountNo
128200200829             MOVE pi_AccountNum   TO li_CurrAccountNo
128300200829      *RFS85276 - End
128400200829R84339*      PERFORM Check-Account-Attribute
128500200829R84339*      IF li_OLDLF_Cnt = 0
128600200829               Perform Get-Acct-Market-Value
128700200829R59853*        if li_MarketValue  = 0   and lncc_sqlSuccessful
128800200829R59853         if lncc_sqlSuccessful
128900200829                   Perform Calc-Inv-Return-Relq
129000200829               end-if
129100200829R84339*      END-IF
129200200829113892*        goback
129300200829113892       PERFORM End-Job
129400200829           end-if.
129500200829
129600200829      *RFS44202 - End
129700200829
129800200829           EXEC SQL
129900200829                SELECT COALESCE(Activity_Date_1, 0)
130000200829                  INTO :li_TradeDate
130100200829                  FROM Mfabusacp
130200200829                 WHERE Business_Day  = :li_AsAtDate
130300200829                   AND Activity_Code = :lncc_ActivityCode
130400200829           END-EXEC.
130500200829
130600200829      *RFS184855 - Start
130700200829           CALL "RTVJOBA" USING lc_Job, lc_User, lc_Number.
130800200829           CANCEL "RTVJOBA".
130900200829      *RFS184855 - End
131000200829
131100200829      *RFS85276 - Begin
131200200829           IF  pi_AccountNum = 0
131300200829              PERFORM Create-Table
131400200829           END-IF
131500200829      *RFS85276 - End
131600200829           .
131700200829
131800200829      *RFS44202 - Start
131900200829       Get-Acct-Market-Value.
132000200829
132100200829           MOVE 0                      to li_MarketValue.
132200200829           EXEC SQL
132300200829                SELECT COALESCE(ACCT_MV, 0)
132400200829                INTO :li_MarketValue
132500200829                FROM SQACCLIF
132600200829      *RFS85276 - Begin
132700200829      *         WHERE Account_No = :Pass-Account-no
132800200829                WHERE Account_No = :pi_AccountNum
132900200829      *RFS85276 - End
133000200829           END-EXEC.
133100200829
133200200829           MOVE SQLSTATE               TO WS-SQL-STATES.
133300200829
133400200829       Calc-Inv-Return-Relq.
133500200829
133600200829           INITIALIZE ln_LastYearMV
133700200829                      ln_InvReturnRecv.
133800200829
133900200829           EXEC SQL
134000200829                SELECT COALESCE(MARKET_VALUE, 0),
134100200829                       COALESCE(INVESTMENT_RETURN_RECV, 0)
134200200829                INTO :ln_LastYearMV,  :ln_InvReturnRecv
134300200829                FROM MFAACLIFP
134400200829      *RFS85276 - Begin
134500200829      *         WHERE Account_No = :Pass-Account-no
134600200829                WHERE Account_No = :pi_AccountNum
134700200829      *RFS85276 - End
134800200829           END-EXEC.
134900200829
135000200829      *RFS85276 - Begin
135100200829      *    MOVE Pass-Account-no        to  li_CurrAccountNo.
135200200829           MOVE pi_AccountNum          to  li_CurrAccountNo.
135300200829      *RFS85276 - End
135400200829
135500200829      *44202.7 - start
135600200829      *Format year start date and year end date
135700200829      *for daily calculation of account investment
135800200829      *relinquished returns within current year.
135900200829
136000200829           INITIALIZE lc_CurrYearStart
136100200829                      lc_CurrYearEnd.
136200200829
136300200829           MOVE lc_AsAtDate(1:4) TO lc_CurrYearStrYYYY
136400200829                                    lc_CurrYearEndYYYY.
136500200829
136600200829           MOVE "0101" TO lc_CurrYearStrMMDD.
136700200829           MOVE "1231" TO lc_CurrYearEndMMDD.
136800200829
136900200829           MOVE lc_CurrYearStart TO lc_YearStartDate.
137000200829           MOVE lc_CurrYearEnd   TO lc_YearEndDate.
137100200829
13720020082995958      IF pi_FromDate NOT = 0 AND pi_ToDate NOT = 0
13730020082995958         MOVE pi_FromDate TO li_YearStartDate
13740020082995958         MOVE pi_ToDate   TO li_YearEndDate
13750020082995958      END-IF
137600200829      *44202.7 - end
137700200829
137800200829           PERFORM Get-Amt-Paid-Out-LIF-Acct.
137900200829           PERFORM Get-Amt-Came-Into-LIF-Acct.
138000200829
138100200829           INITIALIZE ln_InvReturnRelq.
138200200829
138300200829           compute ln_InvReturnRelq         =
138400200829                   li_MarketValue           -
138500200829                   ln_LastYearMV            +
138600200829                   ln_GrossAmtPaidOut       -
138700200829                   ln_GrossAmtCameInto      +
138800200829                   ln_InvReturnRecv
138900200829           end-compute.
139000200829
13910020082995958      MOVE ln_InvReturnRelq TO pi_InvReturnRelq
139200200829
13930020082995958      IF ( ln_InvReturnRelq NOT = 0 AND
13940020082995958          pc_CalledFrom NOT = lncc_Lifrtn )
139500200829
139600200829                EXEC SQL
139700200829      *RFS59853 - Start
139800200829      *            UPDATE MFAACLIFP
139900200829      *            SET INVESTMENT_RETURN_RELQ = : ln_InvReturnRelq
140000200829                   UPDATE WKACCLIF
140100200829                   SET INV_RTN_BF = : ln_InvReturnRelq
140200200829      *RFS59853 - Start
140300200829      *RFS85276 - Begin
140400200829      *            WHERE Account_No = :Pass-Account-no
140500200829                   WHERE Account_No = :pi_AccountNum
140600200829      *RFS85276 - End
140700200829                END-EXEC
140800200829
140900200829                MOVE SQLSTATE   TO WS-SQL-STATES
141000200829                IF NOT lncc_sqlSuccessful
141100200829                AND NOT lncc_sqlTblCrtedNotJrned
141200200829                    SET Ws-Err-22 TO TRUE
141300200829                    SET lncc_ErrCodeDescr22 TO TRUE
141400200829                    PERFORM Set-Internal-Error
141500200829                    PERFORM Dsp-Error
141600200829      *RFS85276 - Begin
141700200829      *             move 99                 to pass-return-code
141800200829                    move 99                 to pc_ReturnCode
141900200829      *RFS85276 - End
142000200829                end-if
142100200829           end-if.
142200200829
142300200829      *RFS44202 - end
142400200829       Create-Table.
142500200829
142600200829           EXEC SQL
142700200829                CREATE TABLE Sbacclif
142800200829                      (Account_No      FOR COLUMN F0000 NUMERIC (9)
142900200829                                       NOT NULL WITH DEFAULT,
143000200829                       Investor_No     FOR COLUMN F0001 NUMERIC (9)
143100200829                                       NOT NULL WITH DEFAULT,
143200200829                       Acct_Type_Code  FOR COLUMN F0002 CHAR (5)
143300200829                                       NOT NULL WITH DEFAULT,
143400200829                       Dealer_Code     FOR COLUMN F0003 CHAR (4)
143500200829                                       NOT NULL WITH DEFAULT,
143600200829                       Dealer_Rep_Code FOR COLUMN F0004 CHAR (6)
143700200829                                       NOT NULL WITH DEFAULT,
143800200829                       Pay_Type_Code   FOR COLUMN F0005 CHAR (1)
143900200829                                       NOT NULL WITH DEFAULT,
144000200829                       Min_Withdrl_Amt FOR COLUMN F0006 DECIMAL (13,2)
144100200829                                       NOT NULL WITH DEFAULT,
144200200829                       Max_Withdrl_Amt FOR COLUMN F0007 DECIMAL (13,2)
144300200829                                       NOT NULL WITH DEFAULT,
144400200829                       Spec_Pay_Amt    FOR COLUMN F0008 DECIMAL (13,2)
144500200829                                       NOT NULL WITH DEFAULT,
144600200829                       Req_Annual_Pay  FOR COLUMN F0009 DECIMAL (13,2)
144700200829                                       NOT NULL WITH DEFAULT,
144800200829                       Requested_Total FOR COLUMN F0010 DECIMAL (13,2)
144900200829                                       NOT NULL WITH DEFAULT)
145000200829           END-EXEC.
145100200829
145200200829           MOVE SQLSTATE TO Ws-Sql-States.
145300200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlTblCrtedNotJrned
145400200829              SET Ws-Err-01 TO TRUE
145500200829              SET lncc_ErrCodeDescr01 TO TRUE
145600200829              PERFORM Set-Internal-Error
145700200829              PERFORM Dsp-Error
145800200829              PERFORM Force-Msgw
145900200829           END-IF.
146000200829
146100200829       Detail-Processing.
146200200829
146300200829      *RFS184855 - Start
146400200829           IF lc_Job = lncc_JOBLIFGEN
146500200829              PERFORM Insert-Acct-RLIF-Prev-Val
146600200829           END-IF.
146700200829      *RFS184855 - End
146800200829
146900200829           PERFORM Declare-Cursor.
147000200829
147100200829           PERFORM Open-Cursor-c_Lif.
147200200829
147300200829           MOVE lncc_No TO lc_EndOfFetch.
147400200829           IF lncc_CursorOpenedYes
147500200829              PERFORM Fetch-Detail-Records
147600200829                UNTIL lncc_EndOfFetchYes
147700200829           ELSE
147800200829              MOVE lncc_Yes TO lc_EndOfProcess
147900200829           END-IF.
148000200829
148100200829           IF lncc_NotEndOfProcess
148200200829              PERFORM Delete-Acc-Awd-Add-Tax
148300200829           END-IF.
148400200829
148500200829      *RFS185171 - starts
148600200829           INITIALIZE SQLSTATE,
148700200829                      li_GLWBaccounttNo
148800200829
148900200829           SET   lncc_GLWBAcctno TO TRUE
149000200829           EXEC SQL
149100200829              SELECT COALESCE(ACCOUNT_NO,0)
149200200829               INTO :li_GLWBaccounttNo
149300200829               FROM MFAACLBENP
149400200829               WHERE ACCOUNT_NO = :li_CurrAccountNo
149500200829           END-EXEC.
149600200829           MOVE SQLSTATE TO lc_sqlStates
149700200829           EVALUATE TRUE
149800200829               WHEN lncc_sqlSuccessful
149900200829                    SET lncc_GLWBAcctYes TO TRUE
150000200829               WHEN OTHER
150100200829                    CONTINUE
150200200829           END-EVALUATE.
150300200829      *RFS185171 - ends
150400200829185171     IF lncc_GLWBAcctno
150500200829           IF lncc_NotEndOfProcess
150600200829              PERFORM Delete-Acc-Awd-Inv
150700200829185171     END-IF
150800200829           END-IF.
150900200829
151000200829185171     IF lncc_GLWBAcctno
151100200829           IF lncc_NotEndOfProcess
151200200829              PERFORM Recreate-Lif-Details
151300200829185171     END-IF
151400200829           END-IF.
151500200829
151600200829           MOVE lncc_Y TO lc_EndOfProcess.
151700200829
151800200829       Declare-Cursor.
151900200829
152000200829           EXEC SQL
152100200829                DECLARE c_Lif CURSOR FOR
152200200829                 SELECT Aclifp.Account_No,
152300200829                        Aclifp.Payment_Type_Code,
152400200829                        Aclifp.Min_Withdrawal_Amt,
152500200829                        Aclifp.Max_Withdrawal_Amt,
15260020082932931                   Aclifp.Prev_Max_Withdrawal_Amt,
152700200829                        Aclifp.Specified_Payment_Amt,
152800200829                        Aclifp.Requested_Annual_Payment,
15290020082932931                   Aclifp.Market_Value,
15300020082944202                   Aclifp.Investment_Return_Recv,
153100200829                          Ivrp.Investor_No,
153200200829                        Accntp.Dealer_Code,
153300200829                        Accntp.Dealer_Rep_Code,
153400200829                        Accntp.Account_Type_Code,
153500200829                       COALESCE(LifpfpM.Lif_Minimum_Payment_Factor, 0),
153600200829                       COALESCE(LifpfpX.Lif_Maximum_Payment_Factor, 0),
153700200829                        COALESCE(Pmityp.Payment_Instruction_Type, " "),
153800200829                        COALESCE(Ivrapip.Investor_No, 0),
153900200829                        COALESCE(Ivrapip.Previous_Calculated_Amount, 0),
154000200829                        COALESCE(Ivrapip.Percentage_Increase, 0),
154100200829                        Sqaclif.Acct_Mv,
154200200829                        Accntp.Country_Of_Agreement,
154300200829                        Accntp.Province_Of_Agreement,
15440020082932931                   COALESCE(dec(substr(char(:li_YearEndDate)
15450020082932931                            ,1,4),4,0) -
15460020082932931                            dec(substr(char(Accntp.Creation_Date)
15470020082932931                            ,1,4),4,0), 0),
154800200829                        COALESCE(Accsrp.Account_Type_Sub_Rule, " "),
154900200829                        COALESCE(Acladp.Account_No, 0),
155000200829                        COALESCE(Lififp.Lif_Income_Factor, 0),
155100200829                        COALESCE(LifpfpX.Investor_Age, 0),
155200200829                        COALESCE(Maxpep.Country_Code, " "),
155300200829                        COALESCE(Maxpep.Investor_Min_Age, 0),
155400200829                        COALESCE(Maxpep.Investor_Max_Age, 0),
155500200829                        COALESCE(Maxpep.Mpe_Amount, 0),
155600210615                        COALESCE(Maxpep.Mpe_Percent, 0)
155700210623      *RFS186771 - Starts
155800210616                       ,Ivrp.Country_Code
155900210615                       ,Aclifp.PPPA_Eligible_Month
156000200829      *RFS186771 - Ends
156100200829                   FROM Sqacclif Sqaclif
156200200829                        INNER JOIN Mfaaclifp Aclifp
156300200829                           ON Sqaclif.Account_No = Aclifp.Account_No
156400200829                        INNER JOIN Mfaaccntp Accntp
156500200829                           ON Aclifp.Account_no = Accntp.Account_No
156600200829                        INNER JOIN Mfaacctyp Acctyp
156700200829                           ON Accntp.Account_Type_Code =
156800200829                              Acctyp.Account_type_Code
156900200829                        INNER JOIN Mfaivrp Ivrp
157000200829                           ON Accntp.Investor_No = Ivrp.Investor_No
157100200829                         LEFT OUTER JOIN Mfaivrapip Ivrapip
157200200829                           ON Ivrapip.Investor_No = Ivrp.Investor_No AND
157300200829                              Ivrapip.Account_No = Accntp.Account_No AND
157400200829                              Ivrapip.Plan_Code = :lncc_Lif AND
157500200829                              Ivrapip.Plan_Seq_No = :lnci_0
157600200829                         LEFT OUTER JOIN Mfapmityp Pmityp
157700200829                           ON Pmityp.Account_Type_Code =
157800200829                              Acctyp.Account_Type_Code AND
157900200829                              Pmityp.Payment_Instruction_Type =
158000200829                              Aclifp.Payment_Type_Code
158100200829                         LEFT OUTER JOIN Mfalifpfp LifpfpX
158200200829                           ON LifpfpX.Country_Code =
158300200829                              Accntp.Country_Of_Agreement AND
158400200829                              LifpfpX.Province_Code =
158500200829                              Accntp.Province_Of_Agreement AND
158600200829                              LifpfpX.Qualifying_Flag =
158700200829                              Aclifp.Qualifying_Flag AND
158800200829                              LifpfpX.Investor_Age =
158900200829                              dec(substr(char(:li_YearEndDate)
159000200829                                  ,1,4),4,0) -
159100200829                              dec(substr(char(Ivrp.Date_Of_Birth)
159200200829                                  ,1,4),4,0)
159300200829                         LEFT OUTER JOIN Mfalifpfp LifpfpM
159400200829                           ON LifpfpM.Country_Code =
159500200829                              Accntp.Country_Of_Agreement AND
159600200829                              LifpfpM.Province_Code =
159700200829                              Accntp.Province_Of_Agreement AND
159800200829                              LifpfpM.Qualifying_Flag =
159900200829                              Aclifp.Qualifying_Flag AND
160000200829                              LifpfpM.Investor_Age =
160100200829                              CASE WHEN Aclifp.Calc_Date_Of_Birth > 0
160200200829                                   THEN dec(substr(char(:li_YearEndDate)
160300200829                                            ,1,4),4,0) -
160400200829                                        dec(substr(char(
160500200829                                            Aclifp.Calc_Date_Of_Birth)
160600200829                                            ,1,4),4,0)
160700200829                                   ELSE dec(substr(char(:li_YearEndDate)
160800200829                                            ,1,4),4,0) -
160900200829                                        dec(substr(char(
161000200829                                            Ivrp.Date_Of_Birth)
161100200829                                            ,1,4),4,0)
161200200829                                   END
161300200829                         LEFT OUTER JOIN Mfaaccsrp Accsrp
161400200829                           ON Accsrp.Account_Type_Code =
161500200829                              Acctyp.Account_Type_Code
161600200829                         LEFT OUTER JOIN Mfamaxpep Maxpep
161700200829                           ON Maxpep.Country_Code =
161800200829                              Accntp.Country_Of_Agreement AND
161900200829                              Maxpep.Province_Code =
162000200829                              Accntp.Province_Of_Agreement AND
162100200829                              Maxpep.Tax_Year =
162200200829                              dec(substr(char(:li_YearEndDate)
162300200829                                  ,1,4),4,0) + 1
162400200829                         LEFT OUTER JOIN Mfalififp Lififp
162500200829                           ON Lififp.Country_Code =
162600200829                              Accntp.Country_Of_Agreement AND
162700200829                              Lififp.Province_Code =
162800200829                              Accntp.Province_Of_Agreement AND
162900200829                              Lififp.Investor_Age =
163000200829                              dec(substr(char(:li_YearEndDate)
163100200829                                  ,1,4),4,0) -
163200200829                              dec(substr(char(Ivrp.Date_Of_Birth)
163300200829                                  ,1,4),4,0)
163400200829                         LEFT OUTER JOIN Mfaacladp Acladp
163500200829                           ON Acladp.Account_No = Aclifp.Account_No
163600200829                  ORDER BY Aclifp.Account_No
163700200829                  FOR FETCH ONLY
163800200829           END-EXEC.
163900200829
164000200829      *RFS44202 - Start  : this code should not be here on a
164100200829      *              declare cursor commented out
164200200829      *
164300200829      *    MOVE SQLSTATE TO Ws-Sql-States.
164400200829      *    IF NOT lncc_sqlSuccessful AND NOT lncc_sqlTblCrtedNotJrned
164500200829      *       SET Ws-Err-02 TO TRUE
164600200829      *       SET lncc_ErrCodeDescr02 TO TRUE
164700200829      *       PERFORM Set-Internal-Error
164800200829      *       PERFORM Dsp-Error
164900200829      *       PERFORM Force-Msgw
165000200829      *    END-IF.
165100200829      *
165200200829      *RFS44202 - end
165300200829
165400200829       Open-Cursor-c_Lif.
165500200829
165600200829           MOVE lncc_No TO lc_CursorOpened.
165700200829
165800200829           EXEC SQL
165900200829                OPEN c_Lif
166000200829           END-EXEC.
166100200829
166200200829           MOVE SQLSTATE TO Ws-Sql-States.
166300200829           IF NOT lncc_sqlSuccessful
166400200829              SET Ws-Err-03 TO TRUE
166500200829              SET lncc_ErrCodeDescr03 TO TRUE
166600200829              PERFORM Set-Internal-Error
166700200829              PERFORM Dsp-Error
166800200829              PERFORM Force-Msgw
166900200829           ELSE
167000200829              MOVE lncc_Yes TO lc_CursorOpened
167100200829           END-IF.
167200200829
167300200829       Fetch-Detail-Records.
167400200829           INITIALIZE ltb_FetchRec
167500200829                      li_Variables.
167600200829
167700200829           EXEC SQL
167800200829                FETCH c_Lif FOR :li_MaxRows ROWS
167900200829                 INTO :ltb_AcctArray
168000200829           END-EXEC.
168100200829
168200200829           MOVE SQLSTATE TO Ws-Sql-States.
168300200829           IF lncc_sqlEnd
168400200829              MOVE lncc_Yes TO lc_EndOfFetch
168500200829      *                        lc_EndOfProcess
168600200829           ELSE
168700200829              COMPUTE li_NoOfRowsFetched = SQLERRD(3)
168800200829185171        IF li_NoOfRowsFetched = 0
168900200829185171        MOVE lncc_Yes TO lc_EndOfFetch
169000200829185171        END-IF
169100200829           END-IF.
169200200829
169300200829           MOVE 0 TO li_Cntr.
169400200829           MOVE lncc_No TO lc_ArrayMaxReached.
169500200829           IF lncc_EndOfFetchNo
169600200829              PERFORM Process-Detail-Records
169700200829                UNTIL lncc_ArrayMaxReachedYes
169800200829           END-IF.
169900200829
170000200829       Process-Detail-Records.
170100200829           COMPUTE li_Cntr = li_Cntr + 1.
170200200829
170300200829           MOVE li_ArrAccountNo(li_Cntr) TO li_CurrAccountNo.
170400200829           MOVE li_ArrInvestorNo(li_Cntr) TO li_CurrInvestorNo.
170500200829           MOVE lc_ArrDealerCode(li_Cntr) TO lc_CurrDealerCode.
170600200829           MOVE lc_ArrDealerRepCode(li_Cntr) TO lc_CurrDealerRepCode.
170700200829           MOVE lc_ArrAccountTypeCode(li_Cntr)
170800200829             TO lc_CurrAccountTypeCode.
170900200829
171000200829           MOVE li_ArrMinWithdrawalAmt(li_Cntr)
171100200829             TO li_PrevMinWithdrawalAmt.
171200200829           MOVE li_ArrMaxWithdrawalAmt(li_Cntr)
171300200829             TO li_PrevMaxWithdrawalAmt.
17140020082932931      MOVE li_ArrLastMaxWithdrawalAmt(li_Cntr)
17150020082932931        TO li_LastMaxWithdrawalAmt.
171600200829           MOVE li_ArrAccountMV(li_Cntr) TO li_MarketValue.
17170020082944202      MOVE ln_ArrInvReturnRecv(li_Cntr)
17180020082944202        TO ln_InvReturnRecv.
171900200829           MOVE li_ArrSpecifiedPayAmt(li_Cntr) TO li_SpecifiedPayAmt.
172000200829           MOVE li_ArrPrevCalculatedAmt(li_Cntr)
172100200829             TO li_PrevCalculatedAmt.
172200200829           MOVE li_ArrPercentIncrease(li_Cntr) TO li_PercentIncrease.
172300200829           MOVE lc_ArrPayInstrType(li_Cntr) TO lc_PayInstruction.
172400200829           MOVE li_ArrLifMinPayFactor(li_Cntr) TO li_LifMinPayFactor.
172500200829           MOVE li_ArrLifMaxPayFactor(li_Cntr) TO li_LifMaxPayFactor.
172600200829           MOVE li_ArrReqAnnualPayment(li_Cntr) TO li_ReqAnnualPayment.
172700200829
172800200829           MOVE lc_ArrCountryOfAgree(li_Cntr) TO lc_CountryOfAgree.
172900200829           MOVE lc_ArrProvinceOfAgree(li_Cntr) TO lc_ProvinceOfAgree.
17300020082932931      MOVE li_ArrAcctAge(li_Cntr) TO li_AcctAge.
173100200829           MOVE lc_ArrAcctTypeSubRule(li_Cntr) TO lc_AcctTypeSubRule.
173200200829           MOVE li_ArrLifIncomeFactor(li_Cntr) TO li_LifIncomeFactor.
173300200829           MOVE li_ArrInvestorAge(li_Cntr) TO li_InvestorAge.
173400200829           MOVE lc_ArrCountryCode(li_Cntr) TO lc_CountryCode.
173500200829           MOVE li_ArrInvestorMinAge(li_Cntr) TO li_InvestorMinAge.
173600200829           MOVE li_ArrInvestorMaxAge(li_Cntr) TO li_InvestorMaxAge.
173700200829           MOVE li_ArrMpeAmt(li_Cntr) TO li_MpeAmt.
173800200829           MOVE li_ArrMpePercent(li_Cntr) TO li_MpePercent.
17390020082932931      MOVE ln_ArrLastYearMV(li_Cntr) TO ln_LastYearMV.
174000200829
174100200829           COMPUTE li_MinWithdrawalAmt ROUNDED =
174200210615                   li_MarketValue * li_LifMinPayFactor / 100.
174300210615
174400210616      *RFS186771 - Starts
174500210707
174600210707           INITIALIZE lc_InvestorCountry
174700210616                      li_PppaEligibleMonth
174800210616                      li_PPPAAnn
174900210616                      li_PPPA10Amt
175000210616                      li_PPPA2XAmt
175100210616                      li_PPPAEntitlement
175200210707
175300210707           MOVE lc_ArrTaxCountryCode(li_Cntr) TO lc_InvestorCountry.
175400211019      *RFS1121738 Begins
175500211018           IF lc_PPPANR = lncc_Y
175600211018              MOVE li_ArrPppaEligibleMonth(li_Cntr)
175700211018                                           TO li_PppaEligibleMonth
175800211018           ELSE
175900211018              MOVE 0 TO li_PppaEligibleMonth
176000211018           END-IF.
176100211018      *    MOVE li_ArrPppaEligibleMonth(li_Cntr)
176200211018      *                                    TO li_PppaEligibleMonth.
176300211019      *RFS1121738 Ends
176400210616           IF lc_PPPANR = lncc_Y
176500210616              COMPUTE li_PPPA10Amt ROUNDED = li_MarketValue * li_PPPA10
176600210616              COMPUTE li_PPPA2XAmt ROUNDED = li_MinWithdrawalAmt *
176700210615                                             li_PPPA2X
176800210615                IF li_PPPA10Amt > li_PPPA2XAmt
176900210615                   COMPUTE li_PPPAAnn = li_PPPA10Amt
177000210615                ELSE
177100210615                   COMPUTE li_PPPAAnn = li_PPPA2XAmt
177200210617                END-IF
177300210707                IF lc_Job = lncc_JOBLIFGEN
177400210707                   IF lc_InvestorCountry not = lncc_CAN
177500210722                      MOVE lnci_12 TO li_PppaEligibleMonth
177600210707                   ELSE
177700210615                      MOVE 0 TO li_PppaEligibleMonth
177800210615                   END-IF
177900210615                END-IF
178000210723                IF li_PppaEligibleMonth = lnci_12
178100210723                   MOVE li_PPPAAnn TO li_PPPAEntitlement
178200210723                END-IF
178300210720           END-IF
178400200829      *RFS186771 - Ends
178500200829
178600200829      *RFS85276 - Begin
178700200829             IF  pi_AccountNum NOT = 0
178800200829                 PERFORM Get-YTD-Payout
178900200829                 COMPUTE li_MarketValue = li_MarketValue - li_RemainAmt
179000200829                 COMPUTE li_MinWithdrawalAmt ROUNDED =
179100200829                         li_MarketValue * li_LifMinPayFactor / 100
179200200829                 COMPUTE pi_MinWithdrawalAmt = li_MinWithdrawalAmt
179300200829                 MOVE lncc_Yes  TO lc_ArrayMaxReached
179400200829                                   lc_EndOfFetch
179500200829                                   lc_EndOfProcess
179600200829             ELSE
179700200829      *RFS186053 Start
179800200829                 MOVE li_CurrAccountNo   TO  li_InvUpdAccountNo
179900200829                 PERFORM SetupAwdInvWdHier
180000200829      *RFS186053 End
180100200829186053           IF lc_InvUpdRC NOT = lncc_X
180200200829                 PERFORM Process-Detail-Records2
180300200829186053           PERFORM RemoveAwdInvWdHier
180400200829186053           END-IF
180500200829             END-IF
180600200829             .
180700200829       Process-Detail-Records2.
180800200829      *RFS85276 - End
180900200829           COMPUTE li_MaxWithdrawalAmt ROUNDED =
181000200829                   li_MarketValue * li_LifMaxPayFactor / 100.
181100200829
181200200829      * RFS73628 - Begin: make sure to get the Rule before using it
181300200829           PERFORM Get-Calc-Rule-For-Prd-Type
181400200829      * RFS73628 - End
181500200829      * RFS80602 - Begin: execute the update only if RIFGLW not exists
181600200829           IF lc_SegGlwbYes      AND
181700200829              lb_NoGLWAMinimum
181800200829             PERFORM Update-Mfaacconp-main
181900200829185169*      IF Lb_AccountLevelGLWBYes
182000200829185169*         PERFORM Update-Mfaaclbenp-main
182100200829185169*      END-IF
182200200829           END-IF.
182300200829185171     IF Lb_AccountLevelGLWBYes
182400200829185171        PERFORM Update-Mfaaclbenp-main
182500200829185171     END-IF
182600200829
18270020082953401 *    PERFORM Update-Mfaacconp.
182800200829      * RFS80602 - End
182900200829
18300020082954661      IF lc_AcctTypeSubRule = lncc_2
183100200829      * RFS73628 - Begin: for "Ontario" rule use new method calculation
183200200829              AND lc_Lif_Max_Calc_Rule NOT = "4"
183300200829      * RFS73628 - End
18340020082954661         PERFORM Calc-Max-For-Locked-In-Acct
18350020082954661      ELSE
183600200829      * RFS73628 - Begin: move the code above to get and use the rule
18370020082958577 *       PERFORM Get-Calc-Rule-For-Prd-Type
183800200829      * RFS73628 - End
18390020082944202         PERFORM Find-Calculation-Flags
184000200829              PERFORM Check-Account-Attribute                           44202.9
184100200829
18420020082932931         IF li_AcctAge > 0
18430020082952785 *       OR (li_AcctAge = 0 AND
18440020082944202 *           lc_ProvinceOfAgree = lncc_ProvinceAB)
18450020082952785         OR (li_AcctAge = 0 AND lc_Include_first_year_flag = "Y")
18460020082932931            PERFORM Recalc-Max-Withdrawal-Amt
18470020082932931         END-IF
18480020082954661      END-IF.
184900200829
18500020082932931 * Move logic that calculates Temp Income from the bottom of the
18510020082932931 * paragraph to here since Temp Income is needed when calculating
18520020082932931 * requested annual payment.
185300200829
18540020082932931      COMPUTE li_MpeAmtOne ROUNDED =
18550020082932931              (li_MpeAmt * li_MpePercent / 100).
185600200829
185700200829           COMPUTE li_MpeAmtTwo ROUNDED =
185800200829      * RFS38651 Starts
185900200829      *               (li_MaxWithdrawalAmt * li_LifIncomeFactor / 100)
186000200829                      (li_MaxWithdrawalAmt * li_LifIncomeFactor).
186100200829      * RFS38651 End
186200200829
186300200829      * Update Account-Lif-Add-Details (Mfaacladp) if record exists,
186400200829      * otherwise insert new records
186500200829      *
186600200829      * RFS 38651 Starts
186700200829      *
18680020082932931 *    IF lc_AcctTypeSubRule = lncc_1 and
18690020082932931 *       lc_CountryOfAgree = lncc_Country and
18700020082932931 *       lc_ProvinceOfAgree = lncc_Province
187100200829
18720020082932931      INITIALIZE li_NewRefTempIncome.
18730020082932931      IF lc_CountryCode NOT = SPACE
18740020082932931       IF lc_ProvinceOfAgree NOT = lncc_ProvinceQC           OR
18750020082954661 *        (lc_AcctTypeSubRule = lncc_1 and
18760020082954661          ((lc_AcctTypeSubRule = lncc_1 OR lncc_2) and
18770020082932931           lc_CountryOfAgree = lncc_Country and
18780020082932931           lc_ProvinceOfAgree = lncc_ProvinceQC)
18790020082932931        PERFORM Calc-Temp-Income
188000200829      *
188100200829      * RFS 38651 Ends
188200200829      *
188300200829             IF li_ArrAcladpAcctNo(li_Cntr) NOT = 0
188400200829                PERFORM Update-Mfaacladp
188500200829                PERFORM Insert-Mfalifclp
188600200829             ELSE
188700200829                PERFORM Insert-Mfaacladp
188800200829                PERFORM Insert-Mfalifclp
188900200829             END-IF
18900020082932931       END-IF
189100200829           END-IF.
189200200829
189300200829           MOVE lc_ArrPayTypeCode(li_Cntr) TO lc_PaymentTypeCode.
189400200829           EVALUATE TRUE
189500200829               WHEN lncc_PaymentTypeCodeA
189600200829                    COMPUTE li_RequestedTotal = li_MinWithdrawalAmt +
189700200829                            li_SpecifiedPayAmt
189800200829               WHEN lncc_PaymentTypeCodeS
189900200829                    COMPUTE li_RequestedTotal = li_SpecifiedPayAmt
190000200829               WHEN lncc_PaymentTypeCodeM
190100200829                    COMPUTE li_RequestedTotal = li_MinWithdrawalAmt
190200200829               WHEN lncc_PaymentTypeCodeX
190300200829                    COMPUTE li_RequestedTotal = li_MaxWithdrawalAmt
190400200829               WHEN lncc_PaymentTypeCodeP AND li_PrevCalculatedAmt > 0
190500200829                    COMPUTE li_RequestedTotal ROUNDED =
190600200829                            li_PrevCalculatedAmt +
190700200829                           (li_PrevCalculatedAmt * li_PercentIncrease /
190800200829                            100)
190900200829               WHEN lncc_PaymentTypeCodeP AND li_PrevCalculatedAmt = 0
191000200829                    COMPUTE li_RequestedTotal ROUNDED =
191100200829                            li_ReqAnnualPayment +
191200200829                           (li_ReqAnnualPayment * li_PercentIncrease /
191300200829                            100)
191400200829               WHEN OTHER
191500200829                    COMPUTE li_RequestedTotal = li_ReqAnnualPayment
191600200829           END-EVALUATE.
191700200829
191800200829           IF li_RequestedTotal < li_MinWithdrawalAmt OR
191900200829             (lncc_PaymentTypeCodeP AND li_ReqAnnualPayment = 0)
192000200829              MOVE li_MinWithdrawalAmt TO li_NewReqAnnualPayment
192100200829           ELSE IF li_RequestedTotal > li_MaxWithdrawalAmt
192200200829              MOVE li_MaxWithdrawalAmt TO li_NewReqAnnualPayment
192300200829           ELSE
192400200829              MOVE li_RequestedTotal TO li_NewReqAnnualPayment
192500200829           END-IF.
192600200829
192700200829100853     If lc_SegGlwbYes
192800200829      * RFS100853.A - Begin
192900200829             MOVE li_CurrAccountNo    TO li_DtlAccountNo
193000200829129478       PERFORM Get-Series-Rules
193100200829      * RFS100853.A - End
193200200829  |          PERFORM CalcGLWBAmt
193300200829  |   * RFS129478 - Start
193400200829  |          PERFORM UpdateAccContractLGWAOnce
193500200829  |   * RFS129478 - End
193600200829  |          If ln_GLWB-Contract-Amt-Total > li_NewReqAnnualPayment
193700200829  |          Compute li_NewReqAnnualPayment
193800200829  |                               = ln_GLWB-Contract-Amt-Total
193900200829      * RFS105383 #1 - Begin: make sure GLWB contract amount does not
194000200829      *  exceeds the maximum Allowed.
194100200829             IF li_MaxWithdrawalAmt > 0
194200200829               COMPUTE li_NewReqAnnualPayment = FUNCTION
194300200829                   MIN(li_NewReqAnnualPayment li_MaxWithdrawalAmt)
194400200829             END-IF
194500200829      * RFS105383 #1 - End
194600200829  |          End-If
194700200829100853     End-If.
194800200829
194900200829           IF (li_NewReqAnnualPayment >= li_MinWithdrawalAmt AND
195000200829               li_NewReqAnnualPayment <= li_MaxWithdrawalAmt)
195100200829              COMPUTE li_ExcessPayAmt = li_NewReqAnnualPayment -
195200200829                                        li_MinWithdrawalAmt
195300200829           ELSE IF (li_NewReqAnnualPayment >= li_MinWithdrawalAmt AND
195400200829               li_NewReqAnnualPayment > li_MaxWithdrawalAmt)
195500200829              COMPUTE li_ExcessPayAmt = li_MaxWithdrawalAmt -
195600200829                                        li_MinWithdrawalAmt
195700200829           ELSE
195800200829              MOVE lnci_0 TO li_ExcessPayAmt
195900210615           END-IF.
196000210615
196100210616      *RFS186771 - Starts
196200210616              IF lc_PPPANR = lncc_Y AND li_ExcessPayAmt > 0 and
196300211008      *RFS1121738 Begins
196400211008      *          li_PPPAEntitlement >= 0
196500211008                 li_PPPAEntitlement >  0
196600210615                 IF li_PPPAEntitlement >= li_NewReqAnnualPayment
196700210615                    COMPUTE li_ExcessPayAmt = 0
196800210615                 ELSE
196900210615                    COMPUTE li_ExcessPayAmt = li_NewReqAnnualPayment -
197000210615                                              li_PPPAEntitlement
197100210615                 END-IF
197200210615              END-IF
197300200829      *RFS186771 - Ends
197400200829
197500200829           IF li_RequestedTotal < li_MinWithdrawalAmt OR
197600200829              li_RequestedTotal > li_MaxWithdrawalAmt OR
197700200829              lncc_PaymentTypeCodeBlank OR
197800200829              lncc_PayInstructionBlank
197900200829              PERFORM Create-Exception-Recs
198000200829           END-IF.
198100200829
198200200829           PERFORM Update-Mfaaclifp.
198300200829
198400200829      * Update Investor-Account-Plan-Increase (Mfaivrapip),
198500200829      * if record exists.
198600200829           IF li_ArrIvrapipIvrNo(li_Cntr) NOT = 0
198700200829              PERFORM Update-Mfaivrapip
198800200829           END-IF.
198900200829
199000200829           IF li_NoOfRowsFetched = li_Cntr
199100200829              MOVE lncc_Yes TO lc_ArrayMaxReached
199200200829           END-IF.
199300200829      * RFS80602 - Begin: rewrite the logic to process multiple
199400200829      *RFS129478 Start
199500200829       Get-Series-Rules.
199600200829
199700200829           INITIALIZE   lc_GwaCalcRule.
199800200829
199900200829           EXEC SQL
200000200829           SELECT Coalesce(SUBSTR(SERRLP.Series_Rules, 61, 1)," ")
200100200829           INTO   :lc_GwaCalcRule
200200200829           FROM   MFAACCONP ACCONP
200300200829           INNER JOIN MFASERRLP SERRLP ON
200400200829           ACCONP.INVESTMENT_SERIES = SERRLP.INVESTMENT_SERIES
200500200829           WHERE  ACCOUNT_NO = :li_CurrAccountNo
200600200829      *RFS142596 - Start
200700200829      *    AND    CONTRACT_NO = :ln_AcconContractNumber
200800200829           AND    CONTRACT_STATUS <> :lncc_C
200900200829           AND    SUBSTR(SERRLP.Series_Rules, 70, 4) = :lncc_GLWB
201000200829           FETCH FIRST ROW ONLY
201100200829      *RFS142596 - End
201200200829           END-EXEC.
201300200829
201400200829       Get-Inv-Series-Rules.
201500200829           INITIALIZE   lc_GwaCalcRule1.
201600200829      *RFS185170 - Start.
201700200829           MOVE li_DtlAccountNo TO pi_ACCGLWBD_AccNo.
201800200829           MOVE lc_DtlInvCode   TO pc_ACCGLWBD_InvCode.
201900200829           MOVE Lc_AccountLevelGLWB TO pc_ACCGLWBD_AccLvlGLWB.
202000200829           PERFORM GetAccGLWBDetails.
202100200829           IF pc_ACCGLWBD_AccLvlGLWB = "Y"
202200200829              IF pc_ACCGLWBD_Series NOT = SPACES
202300200829               EXEC SQL
202400200829               SELECT Coalesce(SUBSTR(SERRLP.Series_Rules, 61, 1)," ")
202500200829               INTO :lc_GwaCalcRule1
202600200829               FROM MFASERRLP
202700200829               WHERE INVESTMENT_SERIES = :pc_ACCGLWBD_Series
202800200829               END-EXEC
202900200829              END-IF
203000200829           ELSE
203100200829      *RFS185170- End.
203200200829            EXEC SQL
203300200829              SELECT Coalesce(SUBSTR(SERRLP.Series_Rules, 61, 1)," ")
203400200829              INTO   :lc_GwaCalcRule1
203500200829              FROM   MFAACCCIP ACCCIP
203600200829              INNER JOIN MFAINVSGP ISG ON
203700200829              ACCCIP.INVESTMENT_CODE = ISG.INVESTMENT_CODE
203800200829              INNER JOIN MFASERRLP SERRLP ON
203900200829              ISG.INVESTMENT_SERIES = SERRLP.INVESTMENT_SERIES
204000200829              WHERE  ACCCIP.ACCOUNT_NO = :li_DtlAccountNo
204100200829              AND    ACCCIP.INVESTMENT_CODE = :lc_DtlInvCode
204200200829            END-EXEC
204300200829185170     END-IF.
204400200829      *RFS129478 End
204500200829      *  Contracts.
204600200829      * ---------------------------------
204700200829       Update-Mfaacconp-main.
204800200829      * ---------------------------------
204900200829      * Initialization
205000200829           INITIALIZE ln_AcconContractNumber
205100200829                      ln_GWAAmount
205200200829                      li_SaveContractNo
205300200829           MOVE li_CurrAccountNo   TO ln_AcconAccountNumber
205400200829      * Declare Cursor
205500200829           EXEC SQL
205600200829            DECLARE lcu_lifMin CURSOR FOR
205700200829              SELECT coalesce(accon.Contract_No,0),
205800200829                     coalesce(accon.Guar_Withdrawal_Amount,0)
205900200829137082             , coalesce(accon.lifetime_Withdrawal_Amount,0)
206000200829              FROM Mfaacconp accon JOIN Mfaserrlp serrl   ON
206100200829                 accon.Investment_Series = serrl.Investment_Series
206200200829              WHERE accon.Account_No     = :li_CurrAccountNo   AND
206300200829                    accon.Contract_Status  <> "C"              AND
206400200829                    accon.Eligible_date    <> 0                AND
206500200829                    substr(serrl.Series_Rules,11,3) > "0"
206600200829             ORDER BY accon.Contract_No
206700200829           END-EXEC.
206800200829      * Open the Cursor
206900200829           EXEC SQL
207000200829             OPEN lcu_lifMin
207100200829           END-EXEC
207200200829
207300200829           MOVE SQLSTATE TO lc_sqlStates
207400200829           IF lncc_sqlSuccessful
207500200829              SET lncc_lifMinStart    TO TRUE
207600200829              PERFORM UNTIL lncc_lifMinEnd
207700200829                EXEC SQL
207800200829                  FETCH NEXT
207900200829                    FROM lcu_lifMin
208000200829                    INTO :ln_AcconContractNumber,
208100200829                         :ln_GWAAmount
208200200829137082                 , :ln_LWAAmount
208300200829                END-EXEC
208400200829                MOVE SQLSTATE TO lc_sqlStates
208500200829                IF lncc_sqlEnd
208600200829                  SET lncc_lifMinEnd     TO TRUE
208700200829                ELSE
208800200829                  PERFORM apply-new-Lif-formula
208900200829                  IF lncc_UpdateGWAYes
209000200829                    PERFORM update-account-contract
209100200829                  END-IF
209200200829137082            IF lncc_UpdateLWAYes
209300200829137082               PERFORM update-account-contract-LWA
209400200829137082            END-IF
209500200829                  If li_SaveContractNo not = ln_AcconContractNumber
209600200829                     PERFORM create-audit-log
209700200829                     Move ln_AcconContractNumber TO li_SaveContractNo
209800200829                  End-If
209900200829                END-IF
210000200829              END-PERFORM
210100200829           ELSE
210200200829              SET Ws-Err-28           TO TRUE
210300200829              SET lncc_ErrCodeDescr28 TO TRUE
210400200829              PERFORM Set-Internal-Error
210500200829              PERFORM Dsp-Error
210600200829           END-IF
210700200829
210800200829      * Close the Cursor
210900200829           EXEC SQL
211000200829             CLOSE lcu_lifMin
211100200829           END-EXEC.
211200200829      * ---------------------------------------------------------------
211300200829      *RFS53401 - Beg
211400200829      *Update-Mfaacconp.
211500200829      *    INITIALIZE ln_AcconAccountNumber
211600200829      *               ln_AcconContractNumber
211700200829      *               ln_AcconGuarWithdrawalAmt.
211800200829      *
211900200829      *       EXEC SQL
212000200829      *          SELECT coalesce(accon.Account_No, 0),
212100200829      *                 coalesce(accon.Contract_No,0),
212200200829      *                 coalesce(accon.Guar_Withdrawal_Amount,0)
212300200829      *           FROM Mfaacconp accon JOIN Mfaserrlp serrl   ON
212400200829      *             accon.Investment_Series = serrl.Investment_Series
212500200829      *           WHERE accon.Account_No    = :li_CurrAccountNo   AND
212600200829      *                 accon.Contract_Status  <> "C"             AND
212700200829      *                 substr(serrl.Series_Rules,11,3) > "0"
212800200829      *       END-EXEC
212900200829      *    IF lc_SegGLWBYes
213000200829      *       EXEC SQL
213100200829      *          SELECT coalesce(accon.Account_No, 0),
213200200829      *                 coalesce(accon.Contract_No,0),
213300200829      *                 coalesce(accon.Guar_Withdrawal_Amount,0)
213400200829      *            INTO :ln_AcconAccountNumber,
213500200829      *                 :ln_AcconContractNumber,
213600200829      *                 :ln_AcconGuarWithdrawalAmt
213700200829      *            FROM Mfaacconp accon INNER JOIN Mfaserrlp serrl
213800200829      *            ON  accon.Investment_Series = serrl.Investment_Series
213900200829      *            WHERE accon.Account_No = :li_CurrAccountNo and
214000200829      *                  accon.Contract_Status <> "C" and
214100200829      *                  substr(serrl.Series_Rules,11,3) > "0"
214200200829      *            FETCH FIRST ROW ONLY
214300200829      *       END-EXEC
214400200829      *       IF ln_AcconAccountNumber > 0 and
214500200829      *          ln_AcconContractNumber > 0 and
214600200829      *          ln_AcconGuarWithdrawalAmt > 0 and
214700200829      *          ln_AcconGuarWithdrawalAmt < li_MinWithdrawalAmt
214800200829      *          EXEC SQL
214900200829      *               UPDATE Mfaacconp
215000200829      *                  SET Guar_Withdrawal_Amount =
215100200829      *                     :li_MinWithdrawalAmt
215200200829      *                WHERE Account_No  = :ln_AcconAccountNumber and
215300200829      *                      Contract_No = :ln_AcconContractNumber
215400200829      *          END-EXEC
215500200829      *       END-IF
215600200829      *    END-IF.
215700200829      *RFS53401 - End
215800200829      *
215900200829      * ---------------------------------
216000200829       apply-new-lif-formula.
216100200829      * ---------------------------------
216200200829      * Check, if GWAAmount = 0 then initialize variables and just
216300200829      *   create audit Log in calling Paragraph.
216400200829      *
216500200829             IF ln_GWAAmount = 0.0
216600200829               INITIALIZE ln_contractRrifMin
216700200829                          ln_OriginalGWA
216800200829               SET lncc_UpdateGWANo              TO TRUE
216900200829             ELSE
217000200829               SET lncc_UpdateGWAYes               TO TRUE
217100200829      * Get Contract Market Value
217200200829               PERFORM get-contract-market-value
217300200829
217400200829      * Do the calculations
217500200829               COMPUTE ln_contractRRIFMin ROUNDED =
217600200829                  li_MinWithdrawalAmt *
217700200829                  ln_segmatvaContractMV / li_MarketValue
217800200829               MOVE ln_GWAAmount     TO ln_OriginalGWA
217900200829
218000200829      * Set up to a greater amount
218100200829               IF ln_OriginalGWA > 0 AND
218200200829                  ln_contractRRIFMin > ln_OriginalGWA
218300200829                   MOVE ln_contractRRIFMin    TO ln_GWAAmount
218400200829               END-IF
218500200829             END-IF.
218600200829
218700200829      * RFS 137082 - begins.
218800200829             IF ln_LWAAmount = 0
218900200829                INITIALIZE ln_OriginalLWA
219000200829                SET lncc_UpdateLWANo              TO TRUE
219100200829             ELSE
219200200829                SET lncc_UpdateLWAYes             TO TRUE
219300200829                MOVE ln_LWAAmount     TO ln_OriginalLWA
219400200829                IF ln_OriginalLWA > 0 AND
219500200829                   ln_contractRRIFMin > ln_OriginalLWA
219600200829                   MOVE ln_contractRRIFMin    TO ln_LWAAmount
219700200829                END-IF
219800200829             END-IF.
219900200829      * RFS 137082 - ends.
220000200829
220100200829      * ---------------------------------
220200200829       get-contract-market-value.
220300200829      * ---------------------------------
220400200829             MOVE ZEROES TO       pi_SegMatValGMV
220500200829                                  pi_CurrMarketValue
220600200829             COMPUTE pi_SegMatValAccountNo  = li_CurrAccountNo
220700200829             COMPUTE pi_SegMatValContractNo = ln_AcconContractNumber
220800200829             SET     pb_CurrentMarketValueC TO TRUE
220900200829             COMPUTE pi_TradeDate           = li_AsAtDate
221000200829121426       MOVE  SPACES      TO    pc_SegMatValInvCode
221100200829             CALL "FXSEGMATVA" USING pi_SegMatValAccountNo
221200200829                                     pi_SegMatValContractNo
221300200829                                     pc_SegMatValMode
221400200829121426                              pc_SegMatValInvCode
221500200829                                     pi_SegMatValGMV
221600200829                                     pi_SegMatValGDV
221700200829                                     pi_GMPercent
221800200829                                     pi_GDPercent
221900200829                                     pi_CurrMarketValue
222000200829                                     pi_TradeDate
222100200829                                     pc_SegMatValReturn
222200200829             COMPUTE ln_segmatvaContractMV = pi_CurrMarketValue.
222300200829      * ---------------------------------
222400200829       update-account-contract.
222500200829      * ---------------------------------
222600200829      * Update Account contract, RRIFMin, GWAAmount
222700200829             EXEC SQL
222800200829               UPDATE Mfaacconp
222900200829                 SET Guar_Withdrawal_Amount = :ln_GWAAmount,
223000200829                     GWA_RIF_MINIMUM        = :ln_contractRRIFMin,
223100200829                     Original_GWA           = :ln_OriginalGWA
223200200829               WHERE Account_No  = :li_CurrAccountNo AND
223300200829                     Contract_No = :ln_AcconContractNumber
223400200829             END-EXEC.
223500200829
223600200829      * RFS 137082 - begins.
223700200829      * ---------------------------------
223800200829       update-account-contract-LWA.
223900200829      * ---------------------------------
224000200829             EXEC SQL
224100200829               UPDATE Mfaacconp
224200200829                 SET Lifetime_withdrawal_amount = :ln_LWAAmount,
224300200829                     Prev_Guar_withdrawal_amount = :ln_OriginalLWA
224400200829               WHERE Account_No  = :li_CurrAccountNo
224500200829                 AND Contract_No = :ln_AcconContractNumber
224600200829             END-EXEC.
224700200829      * RFS 137082 - ends.
224800200829
224900200829      * ---------------------------------
225000200829       create-audit-log.
225100200829      * ---------------------------------
225200200829      * Create audit log
225300200829           PERFORM log-contract-change
225400200829           PERFORM log-investor-change.
225500200829      * ---------------------------------
225600200829       log-contract-change.
225700200829      * ---------------------------------
225800200829      * Log RRIF Minimum
225900200829           MOVE lncc_glwaRRIFMinCategory  TO lc_changeCategory
226000200829           PERFORM upd-contract-change
226100200829
226200200829      * Original GLWA  (RRIF)
226300200829           MOVE lncc_originalGLWACategory TO lc_changeCategory
226400200829           PERFORM upd-contract-change.
226500200829      * ---------------------------------
226600200829       upd-contract-change.
226700200829      * ---------------------------------
226800200829           exec sql
226900200829            insert into mfactclp
227000200829              values (
227100200829                :li_CurrInvestorNo,
227200200829                :ln_AcconContractNumber,
227300200829                :ln_logSysDate,
227400200829                :ln_logSysTime,
227500200829                :lncc_AuditUser,
227600200829                :lncc_LIFGEN,
227700200829                :li_CurrAccountNo,
227800200829                :lncc_space,
227900200829                :lc_changeCategory
228000200829                )
228100200829           end-exec.
228200200829      * ---------------------------------
228300200829       log-investor-change.
228400200829      * ---------------------------------
228500200829      * Log RRIF Minimum
228600200829           MOVE lncc_glwaRRIFMinCategory  TO lc_changeCategory
228700200829           PERFORM upd-investor-change
228800200829
228900200829      * Original GLWA  (RRIF)
229000200829           MOVE lncc_originalGLWACategory TO lc_changeCategory
229100200829           PERFORM upd-investor-change.
229200200829      * ---------------------------------
229300200829       upd-investor-change.
229400200829      * ---------------------------------
229500200829      * Log RRIF Minimum
229600200829           exec sql
229700200829            insert into mfaivrclp
229800200829              values (
229900200829                :li_CurrInvestorNo,
230000200829                :ln_logSysDate,
230100200829                :ln_logSysTime,
230200200829                :lncc_AuditUser,
230300200829                :lncc_LIFGEN,
230400200829                :li_CurrAccountNo,
230500200829                :lncc_space,
230600200829                :lc_changeCategory
230700200829                )
230800200829           end-exec.
230900200829      * ---------------------------------------------------------------
231000200829      * RFS80602 - End
231100200829
231200200829       Update-Mfaaclifp.
231300200829
231400200829           MOVE li_MaxWithdrawalAmt TO li_MaxWithdrawalAmt9
231500200829           EXEC SQL
231600200829                UPDATE Mfaaclifp
231700200829                   SET Prev_Withdrawal_Amt = :li_PrevMinWithdrawalAmt,
231800200829                       Prev_Max_Withdrawal_Amt =
231900200829                         :li_PrevMaxWithdrawalAmt,
232000200829                       Market_Value_Date   = :li_TradeDate,
232100200829                       Market_Value        = :li_MarketValue,
232200200829                       Min_Withdrawal_Amt  = :li_MinWithdrawalAmt,
232300200829                       Max_Withdrawal_Amt  = :li_MaxWithdrawalAmt9,
232400200829                       Mid_Year_Taxable    = :lncc_No,
232500200829                       Ytd_Minimum_Paid    = :lnci_0,
232600200829                       Ytd_Total_Paid      = :lnci_0,
232700200829                       Gross_Ytd_Minimum_Paid   = :lnci_0,
232800200829                       Gross_Ytd_Total_Paid     = :lnci_0,
232900200829                       Requested_Annual_Payment =
233000200829                         :li_NewReqAnnualPayment,
233100200829                       Excess_Payment_Amt  = :li_ExcessPayAmt,
23320020082944202                  Investment_Return_Recv = :lnci_0,
23330020082954661 *                Investment_Return_Relq = :lnci_0
23340020082954661                  Investment_Return_Relq = :lnci_0,
23350020082954661                  Net_YTD_Excess_Paid           = :lnci_0,
23360020082954661                  Gross_YTD_Excess_Paid         = :lnci_0,
23370020082954661                  YTD_Total_Federal_Tax         = :lnci_0,
23380020082954661                  YTD_Total_Provincial_Tax      = :lnci_0,
23390020082954661                  YTD_Total_Non_Resident_Tax    = :lnci_0,
23400020082954661                  Additional_Requested_Fed_Tax  = :lnci_0,
23410021061654661                  Additional_Requested_Prov_Tax = :lnci_0
234200210616      *RFS186771 - Starts
234300210707                      ,PPPA_Annual = :li_PPPAAnn
234400210616                      ,PPPA_Eligible_Month = :li_PppaEligibleMonth
234500210616                      ,PPPA_Entitlement = :li_PPPAEntitlement
234600210616                      ,Gross_YTD_PPPA_Paid = :lnci_0
234700210616                      ,Net_YTD_PPPA_Paid = :lnci_0
234800200829      *RFS186771 - Ends
234900200829                 WHERE Account_No = :li_CurrAccountNo
235000200829           END-EXEC.
235100201127
235200201127      *RFS1105579 - Begins
235300201127           INITIALIZE lc_LIFGlwbInvCode
235400201127           EXEC SQL
235500201127             SELECT COALESCE(SUBSTR(SERRLP.Series_Rules,164,5), " ")
235600201127             INTO :lc_LIFGlwbInvCode
235700201127             FROM MFASERRLP SERRLP
235800201127             INNER JOIN  MFAACLBENP BENP ON
235900201127             BENP.Investment_Series = SERRLP.Investment_Series
236000201127             WHERE BENP.ACCOUNT_NO = :li_CurrAccountNo   AND
236100201127             SUBSTR(SERRLP.SERIES_RULES, 70, 4) = "GLWB" AND
236200201127             SUBSTR(SERRLP.Series_Rules, 149, 1)= "Y"
236300201127             FETCH FIRST ROW ONLY
236400201127           END-EXEC.
236500201127
236600201127           IF (lc_LIFGlwbInvCode NOT = SPACES )
236700201127              PERFORM LIFAcct-AWD-Invest-Recalc
236800201127           END-IF.
236900201127
237000201127       LIFAcct-AWD-Invest-Recalc.
237100201127           INITIALIZE lc_FXAWD_Parms
237200201127           MOVE li_CurrAccountNo    TO pi_AccountNo2
237300201127           MOVE "S"                 TO pc_Mode2
237400201127           MOVE "00"                TO pc_RejectCode2
237500201127
237600201127           CALL "FXAWDRLIF" USING pi_AccountNo2
237700201127                                  pc_Mode2
237800201127                                  pc_FrequencyCode2
237900201127                                  pn_IFPayAmount2
238000201127                                  pn_TaxselAmount2
238100201127                                  pc_RejectCode2.
238200201127
238300200829      *RFS1105579 - Ends
238400200829       Create-Exception-Recs.
238500200829
238600200829           EXEC SQL
238700200829                INSERT INTO Sbacclif
238800200829                VALUES (:li_CurrAccountNo,
238900200829                        :li_CurrInvestorNo,
239000200829                        :lc_CurrAccountTypeCode,
239100200829                        :lc_CurrDealerCode,
239200200829                        :lc_CurrDealerRepCode,
239300200829                        :lc_PaymentTypeCode,
239400200829                        :li_MinWithdrawalAmt,
239500200829                        :li_MaxWithdrawalAmt,
239600200829                        :li_SpecifiedPayAmt,
239700200829                        :li_NewReqAnnualPayment,
239800200829                        :li_RequestedTotal)
239900200829           END-EXEC.
240000200829
240100200829           MOVE SQLSTATE TO Ws-Sql-States.
240200200829           IF NOT lncc_sqlSuccessful
240300200829              SET Ws-Err-04 TO TRUE
240400200829              SET lncc_ErrCodeDescr04 TO TRUE
240500200829              PERFORM Set-Internal-Error
240600200829              PERFORM Dsp-Error
240700200829      *       PERFORM Force-Msgw
240800200829           END-IF.
240900200829
241000200829       Update-Mfaivrapip.
241100200829
241200200829           IF li_RequestedTotal < li_MinWithdrawalAmt OR
241300200829              li_RequestedTotal > li_MaxWithdrawalAmt
241400200829              COMPUTE li_NewPrevCalcAmt = li_RequestedTotal
241500200829           ELSE
241600200829              COMPUTE li_NewPrevCalcAmt = 0
241700200829           END-IF.
241800200829
241900200829           EXEC SQL
242000200829                UPDATE Mfaivrapip
242100200829                   SET Previous_Calculated_Amount = :li_NewPrevCalcAmt
242200200829                 WHERE Investor_No = :li_CurrInvestorNo AND
242300200829                       Account_No  = :li_CurrAccountNo  AND
242400200829                       Plan_Code   = :lncc_Lif          AND
242500200829                       Plan_Seq_No = :lnci_0
242600200829           END-EXEC.
242700200829
242800200829           MOVE SQLSTATE TO Ws-Sql-States.
242900200829           IF NOT lncc_sqlSuccessful
243000200829              SET Ws-Err-05 TO TRUE
243100200829              SET lncc_ErrCodeDescr05 TO TRUE
243200200829              PERFORM Set-Internal-Error
243300200829              PERFORM Dsp-Error
243400200829              PERFORM Force-Msgw
243500200829           END-IF.
243600200829      *
243700200829      * RFS 38651 Starts
243800200829      *
24390020082932931  Calc-Temp-Income.
244000200829
24410020082932931      IF li_InvestorAge >= li_InvestorMinAge and
24420020082932931         li_InvestorAge <= li_InvestorMaxAge
24430020082932931         IF li_MpeAmtOne < li_MpeAmtTwo
24440020082932931            COMPUTE li_NewRefTempIncome = li_MpeAmtOne
24450020082932931         ELSE
24460020082932931            COMPUTE li_NewRefTempIncome = li_MpeAmtTwo
24470020082932931         END-IF
24480020082932931 * NS has extra logic to calculate Temp Income.
24490020082932931         IF lc_ProvinceOfAgree = lncc_ProvinceNS
24500020082932931            PERFORM Calc-Temp-Income-NS
24510020082932931         END-IF
24520020082932931      ELSE
24530020082932931         MOVE lnci_0 TO li_NewRefTempIncome
24540020082932931      END-IF.
245500200829      *
245600200829      * RFS 38651 Ends
245700200829      *
245800200829
245900200829      *78607 Changed below to use the minimun between Mpe1 & MV
246000200829      *to calculate the IncomeExtra as reported by client
24610020082932931  Calc-Temp-Income-NS.
246200200829
24630020082978607      INITIALIZE ln_NewRefTempIncomeExtra li_MinMpe1MV.
246400200829143761*On the NS formula, value A is li_MpeAmtOne,
246500200829143761*                   value B is li_MpeAmtTwo
246600200829143761     IF li_MpeAmtTwo >= li_MpeAmtOne
246700200829143761      COMPUTE li_MinMpe1MV = li_MpeAmtOne
246800200829143761     END-IF.
246900200829143761     IF li_MpeAmtTwo < li_MpeAmtOne
24700020082978607      IF li_MpeAmtOne < li_MarketValue
247100200829  |           COMPUTE li_MinMpe1MV = li_MpeAmtOne
247200200829  |        ELSE
24730020082978607         COMPUTE li_MinMpe1MV = li_MarketValue
247400200829143761     END-IF
24750020082978607      END-IF.
247600200829
24770020082932931      IF li_LifIncomeFactor NOT = 0
24780020082932931         COMPUTE ln_NewRefTempIncomeExtra ROUNDED =
24790020082978607 ****143761      li_MinMpe1MV / li_LifIncomeFactor
24800020082978607 ****            li_MpeAmtOne / li_LifIncomeFactor
248100200829143761                li_MpeAmtOne / li_LifIncomeFactor
24820020082932931      END-IF.
248300200829
24840020082978607b     COMPUTE ln_MaxMinusNewRef = li_MaxWithdrawalAmt -
248500200829  |                                    ln_NewRefTempIncomeExtra.
248600200829  |        IF ln_MaxMinusNewRef < 0
248700200829  |           MOVE lnci_0  TO ln_MaxMinusNewRef
24880020082978607e     END-IF.
248900200829
24900020082932931      COMPUTE li_NewRefTempIncome =
24910020082978607b             li_MinMpe1MV + ln_MaxMinusNewRef.
249200200829  |   ****         li_NewRefTempIncome       +
249300200829  |   ****         li_MaxWithdrawalAmt       -
24940020082978607e****         ln_NewRefTempIncomeExtra.
249500200829
249600200829      * RFS47476 - Begin
249700200829           IF li_NewRefTempIncome < 0
249800200829             MOVE lnci_0   TO li_NewRefTempIncome
249900200829           END-IF.
250000200829      * RFS47476 - End
250100200829       Update-Mfaacladp.
250200200829
250300200829      * RFS 38651 Starts
25040020082932931 * Move this part to Calc-Temp-Income.
25050020082932931 *    IF (NOT lncc_MaxPensionEarnBlank)
25060020082932931 *      IF (li_InvestorAge >= li_InvestorMinAge and
25070020082932931 *          li_InvestorAge <= li_InvestorMaxAge) and
25080020082932931 *          li_MpeAmtOne < li_MpeAmtTwo
25090020082932931 *         COMPUTE li_NewRefTempIncome = li_MpeAmtOne
25100020082932931 *      ELSE IF (li_InvestorAge >= li_InvestorMinAge and
25110020082932931 *               li_InvestorAge <= li_InvestorMaxAge)
25120020082932931 *              COMPUTE li_NewRefTempIncome = li_MpeAmtTwo
25130020082932931 *      ELSE
25140020082932931 *         MOVE lnci_0 TO li_NewRefTempIncome
25150020082932931 *      END-IF
25160020082932931 *    END-IF.
251700200829      * RFS 38651 Ends
251800200829
251900200829           EXEC SQL
252000200829                UPDATE Mfaacladp
252100200829                   SET New_Market_Value      = :li_MarketValue,
252200200829                       Maximum_Payment       = :li_MaxWithdrawalAmt,
252300200829                       Reference_Temp_Income = :li_NewRefTempIncome
252400200829                 WHERE Account_No = :li_CurrAccountNo
252500200829           END-EXEC.
252600200829
252700200829           MOVE SQLSTATE TO Ws-Sql-States.
252800200829           IF NOT lncc_sqlSuccessful
252900200829              SET Ws-Err-13 TO TRUE
253000200829              SET lncc_ErrCodeDescr13 TO TRUE
253100200829              PERFORM Set-Internal-Error
253200200829              PERFORM Dsp-Error
253300200829              PERFORM Force-Msgw
253400200829           END-IF.
253500200829
253600200829       Insert-Mfaacladp.
253700200829
25380020082932931 * Move this part to Calc-Temp-Income.
25390020082932931 *    IF (NOT lncc_MaxPensionEarnBlank)
25400020082932931 *      IF (li_InvestorAge >= li_InvestorMinAge and
25410020082932931 *          li_InvestorAge <= li_InvestorMaxAge) and
25420020082932931 *          li_MpeAmtOne < li_MpeAmtTwo
25430020082932931 *         COMPUTE li_NewRefTempIncome = li_MpeAmtOne
25440020082932931 *      ELSE IF (li_InvestorAge >= li_InvestorMinAge and
25450020082932931 *               li_InvestorAge <= li_InvestorMaxAge)
25460020082932931 *              COMPUTE li_NewRefTempIncome = li_MpeAmtTwo
25470020082932931 *      ELSE
25480020082932931 *         MOVE lnci_0 TO li_NewRefTempIncome
25490020082932931 *      END-IF
25500020082932931 *    END-IF.
255100200829
255200200829           EXEC SQL
255300200829                INSERT INTO Mfaacladp
255400200829                VALUES (:li_CurrAccountNo,
255500200829      *** RFS32931.6 - Start
255600200829                        :li_NewRefTempIncome,
255700200829                        :li_MarketValue,
255800200829                        :li_MaxWithdrawalAmt)
255900200829      ***               :li_MarketValue,
256000200829      ***               :li_MaxWithdrawalAmt,
256100200829      ***               :li_NewRefTempIncome)
256200200829      *** RFS32931.6 - End
256300200829           END-EXEC.
256400200829
256500200829           MOVE SQLSTATE TO Ws-Sql-States.
256600200829           IF NOT lncc_sqlSuccessful
256700200829              SET Ws-Err-14 TO TRUE
256800200829              SET lncc_ErrCodeDescr14 TO TRUE
256900200829              PERFORM Set-Internal-Error
257000200829              PERFORM Dsp-Error
257100200829              PERFORM Force-Msgw
257200200829           END-IF.
257300200829
257400200829       Insert-Mfalifclp.
257500200829
257600200829           EXEC SQL
257700200829                INSERT INTO Mfalifclp
257800200829                VALUES (:li_CurrAccountNo,
257900200829                        :li_Sysdate,
258000200829                        :li_Systime,
258100200829                        :lt_AuditUser,
258200200829                        :li_CurrInvestorNo,
258300200829                        :lt_ScreenCode,
258400200829                        :li_NewRefTempIncome,
258500200829                        :li_MarketValue,
258600200829                        :li_MaxWithdrawalAmt)
258700200829           END-EXEC.
258800200829
258900200829           MOVE SQLSTATE TO Ws-Sql-States.
259000200829           IF NOT lncc_sqlSuccessful
259100200829              SET Ws-Err-15 TO TRUE
259200200829              SET lncc_ErrCodeDescr15 TO TRUE
259300200829              PERFORM Set-Internal-Error
259400200829              PERFORM Dsp-Error
259500200829              PERFORM Force-Msgw
259600200829           END-IF.
259700200829
259800200829       Delete-Acc-Awd-Add-Tax.
259900200829
260000200829           EXEC SQL
260100200829      *RFS130316 - Begins *
260200200829      *         DELETE FROM Mfaacwatp Acwatp
260300200829      *          WHERE EXISTS
260400200829      *               (SELECT Sqaclif.Account_No
260500200829      *RFS130316 - Ends   *
26060020082992818 *                  FROM Sqacclif  Sqaclif,
260700200829  |   *                       Mfaaccaip Accaip,
260800200829  |   *                       Mfaacwatp Acwatp2
260900200829  |   *                 WHERE Accaip.Account_No = Sqaclif.Account_No
261000200829  |   *                   AND Accaip.Awd_Seq_No  = :lnci_1
261100200829  |   *                   AND Acwatp2.Account_No  = Accaip.Account_No
261200200829  |   *                   AND Acwatp2.Awd_Seq_No  = Accaip.Awd_Seq_No
261300200829  |   *                   AND Acwatp2.Investment_Code =
261400200829  |   *                       Accaip.Investment_Code
261500200829  |   *                   AND Acwatp2.Contr_Redem_Code =
261600200829  |   *                       Accaip.Contr_Redem_Code)
261700200829  |
261800200829      *RFS130316 - Begins *
261900200829  |   *                  FROM Sqacclif  Sqaclif
262000200829  |   *                   INNER JOIN Mfaaccaip Accaip ON
262100200829  |   *                       Accaip.Account_No = Sqaclif.Account_No
262200200829  |   *                   INNER JOIN Mfaacwatp Acwatp2 ON
262300200829  |   *                       Acwatp2.Account_No  = Accaip.Account_No
262400200829  |   *                   AND Acwatp2.Awd_Seq_No  = Accaip.Awd_Seq_No
262500200829  |   *                   AND Acwatp2.Investment_Code =
262600200829  |   *                                        Accaip.Investment_Code
262700200829  |   *                   AND Acwatp2.Contr_Redem_Code =
262800200829  |   *                                        Accaip.Contr_Redem_Code
262900200829  |   *                 WHERE Accaip.Awd_Seq_No  = :lnci_1
263000200829  |   *                   AND Acwatp.Account_No  = Accaip.Account_No
263100200829  |   *                   AND Acwatp.Awd_Seq_No  = Accaip.Awd_Seq_No
263200200829  |   *                   AND Acwatp.Investment_Code =
263300200829  |   *                                        Accaip.Investment_Code
263400200829  |   *                   AND Acwatp.Contr_Redem_Code =
26350020082992818 *                                        Accaip.Contr_Redem_Code)
263600200829                DELETE FROM Mfaacwatp Acwatp
263700200829                 WHERE Acwatp.Account_no  IN
263800200829                      (SELECT Sqaclif.Account_No
263900200829                         FROM Sqacclif  Sqaclif
264000200829                         WHERE Acwatp.Account_No = Sqaclif.Account_No)
264100200829                 AND   Acwatp.Awd_Seq_No  = :lnci_1
264200200829      *RFS130316 - Ends   *
264300200829           END-EXEC.
264400200829
264500200829           COMPUTE li_Rows = SQLERRD(3).
264600200829           MOVE SQLSTATE TO Ws-Sql-States.
264700200829           IF NOT lncc_sqlSuccessful AND NOT lncc_SqlEnd
264800200829              MOVE lncc_Yes TO lc_EndOfProcess
264900200829              SET Ws-Err-06 TO TRUE
265000200829              SET lncc_ErrCodeDescr06 TO TRUE
265100200829              PERFORM Set-Internal-Error
265200200829              PERFORM Dsp-Error
265300200829           END-IF.
265400200829           DISPLAY "Total rows deleted in Mfaacwatp..." li_Rows.
265500200829
265600200829       Delete-Acc-Awd-Inv.
265700200829
265800200829           EXEC SQL
265900200829                DELETE FROM Mfaaccaip Accaip
266000200829                 WHERE Accaip.Account_No IN
266100200829                      (SELECT Sqaclif.Account_No
266200200829                         FROM Sqacclif Sqaclif)
266300200829                   AND Accaip.Awd_Seq_No = :lnci_1
266400200829           END-EXEC.
266500200829
266600200829           COMPUTE li_Rows = SQLERRD(3).
266700200829           MOVE SQLSTATE TO Ws-Sql-States.
266800200829           IF NOT lncc_sqlSuccessful AND NOT lncc_SqlEnd
266900200829              MOVE lncc_Yes TO lc_EndOfProcess
267000200829              SET Ws-Err-07 TO TRUE
267100200829              SET lncc_ErrCodeDescr07 TO TRUE
267200200829              PERFORM Set-Internal-Error
267300200829              PERFORM Dsp-Error
267400200829           END-IF.
267500200829           DISPLAY "Total rows deleted in Mfaaccaip..." li_Rows.
267600200829
267700200829       Recreate-Lif-Details.
267800200829
267900200829           PERFORM Declare-Cursor-c_LifDtls.
268000200829
268100200829           IF lncc_NotEndOfProcess
268200200829              PERFORM Open-Cursor-c_LifDtls
268300200829           END-IF.
268400200829
268500200829           MOVE lncc_No TO lc_EndOfFetch.
268600200829           IF lncc_Cursor2OpenedYes
268700200829              PERFORM Fetch-Lif-Inv-Details
268800200829                UNTIL lncc_EndOfFetchYes
268900200829           END-IF.
269000200829
269100200829       Declare-Cursor-c_LifDtls.
269200200829
269300200829           EXEC SQL
269400200829                DECLARE c_LifDtls CURSOR FOR
269500200829                SELECT Aclifp.Account_No,
269600200829                       Aclifp.Min_Withdrawal_Amt,
269700200829                       Aclifp.Excess_Payment_Amt,
269800200829                       Aclifp.Federal_Tax_Option,
269900200829                       Aclifp.Split_Option_Code,
270000200829                       Aclifp.Contr_Redem_Code,
270100200829                       Accawp.Start_Date,
270200200829                       Accawp.Hold_Until_Date,
270300200829                       Aclivp.Investment_Code,
270400200829                       Aclivp.Confirm,
270500200829                       Aclivp.Gross_Or_Net,
270600200829                       Aclivp.Annual_Amount,
270700200829                       Aclivp.Waive_Dsc,
270800200829                       Aclivp.Dsc_Waive_Reason_Code,
270900200829                       COALESCE(Frecdp2.Frequency_Code, " "),
271000200829                       COALESCE(Frecdp2.Payments_Per_Annum, 0),
271100200829                       COALESCE(Frecdp.Frequency_Code, " "),
271200200829                       COALESCE(Frecdp.Payments_Per_Annum, 0),
271300200829                       COALESCE(Cntrrp.Contr_Redem_Code_Rule, " "),
271400200829                       COALESCE(AccrtpB.Pay_Tax_On, " "),
271500200829                       COALESCE(AccrtpB.Split_Option_Code, " "),
271600200829                       COALESCE(AccrtpB.Add_Replace_Tax, " "),
271700200829                       COALESCE(AccrtpB.Federal_Tax_Amt, 0),
271800200829                       COALESCE(AccrtpB.Federal_Tax_Percent, 0),
271900200829                       COALESCE(AccrtpB.Provincial_Tax_Amt, 0),
272000200829                       COALESCE(AccrtpB.Provincial_Tax_Percent, 0),
272100200829                       COALESCE(AccrtpE.Pay_Tax_On, " "),
272200200829                       COALESCE(AccrtpE.Split_Option_Code, " "),
272300200829                       COALESCE(AccrtpE.Add_Replace_Tax, " "),
272400200829                       COALESCE(AccrtpE.Federal_Tax_Amt, 0),
272500200829                       COALESCE(AccrtpE.Federal_Tax_Percent, 0),
272600200829                       COALESCE(AccrtpE.Provincial_Tax_Amt, 0),
272700200829                       COALESCE(AccrtpE.Provincial_Tax_Percent, 0),
272800200829                       COALESCE(AccrtpM.Pay_Tax_On, " "),
272900200829                       COALESCE(AccrtpM.Split_Option_Code, " "),
273000200829                       COALESCE(AccrtpM.Add_Replace_Tax, " "),
273100200829                       COALESCE(AccrtpM.Federal_Tax_Amt, 0),
273200200829                       COALESCE(AccrtpM.Federal_Tax_Percent, 0),
273300200829                       COALESCE(AccrtpM.Provincial_Tax_Amt, 0),
273400200829      *RFS112468 - Start
273500200829      *                COALESCE(AccrtpM.Provincial_Tax_Percent, 0)
273600200829                       COALESCE(AccrtpM.Provincial_Tax_Percent, 0),
273700200829      * RFS177195 - Start
273800200829      *                Accawp.Next_Payment_Date
273900200829                       Accawp.Next_Payment_Date,
274000200829                       Accawp.AWD_STATUS
274100200829      * RFS177195 - Ends
274200210616      *RFS112468 - End
274300210616      *RFS186771 - Starts
274400210616                      ,Aclifp.PPPA_Entitlement
274500211008112173                ,Aclifp.REQUESTED_ANNUAL_PAYMENT
274600200829      *RFS186771 - Ends
274700200829                  FROM Sqacclif  Sqaclif
274800200829                       JOIN Mfaaclifp Aclifp
274900200829                         ON Aclifp.Account_No = Sqaclif.Account_No
275000200829                       JOIN Mfaaccawp Accawp
275100200829                         ON Accawp.Account_No = Aclifp.Account_No AND
275200200829                            Accawp.Awd_Seq_No = :lnci_1
275300200829                       JOIN Mfaaclivp Aclivp
275400200829                         ON Aclivp.Account_No = Aclifp.Account_No
275500200829                       LEFT OUTER JOIN Mfaaccrtp AccrtpB
275600200829                         ON AccrtpB.Account_No = Aclifp.Account_No AND
275700200829                            AccrtpB.Investment_Code =
275800200829                             Aclivp.Investment_Code AND
275900200829                            AccrtpB.Pay_Tax_On = :lncc_B
276000200829                       LEFT OUTER JOIN Mfaaccrtp AccrtpE
276100200829                         ON AccrtpE.Account_No = Aclifp.Account_No AND
276200200829                            AccrtpE.Investment_Code =
276300200829                             Aclivp.Investment_Code AND
276400200829                            AccrtpE.Pay_Tax_On = :lncc_E
276500200829                       LEFT OUTER JOIN Mfaaccrtp AccrtpM
276600200829                         ON AccrtpM.Account_No = Aclifp.Account_No AND
276700200829                            AccrtpM.Investment_Code =
276800200829                             Aclivp.Investment_Code AND
276900200829                            AccrtpM.Pay_Tax_On = :lncc_M
277000200829                       LEFT OUTER JOIN Mfafrecdp Frecdp
277100200829                         ON Frecdp.Frequency_Code =
277200200829                            Accawp.Frequency_Code
277300200829                       LEFT OUTER JOIN Mfafrecdp Frecdp2
277400200829                         ON Frecdp2.Frequency_Code =
277500200829                             Aclifp.Next_Yr_Freq_Code
277600200829                       LEFT OUTER JOIN Mfacntrrp Cntrrp
277700200829                         ON Cntrrp.Account_Type_Code =
277800200829                            Sqaclif.AccTypeCd AND
277900200829                            Cntrrp.Contr_Redem_Code =
278000200829                            Aclifp.Contr_Redem_Code
278100200829
278200200829                 ORDER BY Aclivp.Account_No,
278300200829                          Aclivp.Investment_Code
278400200829           END-EXEC.
278500200829
278600200829      * RFS105383 - Begin: no need to check the satus after cursor
278700200829      *   declare because it does not change the sql status.
278800200829      * ---------------------------------------------------------------
278900200829      *    MOVE SQLSTATE TO Ws-Sql-States.
279000200829      *    IF NOT lncc_sqlSuccessful AND NOT lncc_sqlTblCrtedNotJrned
279100200829      *       MOVE lncc_Yes TO lc_EndOfProcess
279200200829      *       SET Ws-Err-08 TO TRUE
279300200829      *       SET lncc_ErrCodeDescr08 TO TRUE
279400200829      *       PERFORM Set-Internal-Error
279500200829      *       PERFORM Dsp-Error
279600200829      *    END-IF.
279700200829      * ---------------------------------------------------------------
279800200829
279900200829       Open-Cursor-c_LifDtls.
280000200829           MOVE lncc_No TO lc_Cursor2Opened.
280100200829           INITIALIZE li_Variables.
280200200829
280300200829           EXEC SQL
280400200829                OPEN c_LifDtls
280500200829           END-EXEC.
280600200829
280700200829           MOVE SQLSTATE TO Ws-Sql-States.
280800200829           IF NOT lncc_sqlSuccessful
280900200829              SET Ws-Err-09 TO TRUE
281000200829              SET lncc_ErrCodeDescr09 TO TRUE
281100200829              PERFORM Set-Internal-Error
281200200829              PERFORM Dsp-Error
281300200829              PERFORM Force-Msgw
281400200829           ELSE
281500200829              MOVE lncc_Yes TO lc_Cursor2Opened
281600200829           END-IF.
281700200829
281800200829       Fetch-Lif-Inv-Details.
281900200829           EXEC SQL
282000200829                FETCH c_LifDtls FOR :li_MaxRows ROWS
282100200829                 INTO :ltb_DtlArray
282200200829           END-EXEC.
282300200829
282400200829           MOVE SQLSTATE TO Ws-Sql-States.
282500200829           IF lncc_sqlEnd
282600200829              MOVE lncc_Yes TO lc_EndOfFetch
282700200829                               lc_EndOfProcess
282800200829           ELSE
282900200829              COMPUTE li_NoOfRowsFetched = SQLERRD(3)
283000200829           END-IF.
283100200829
283200200829           MOVE 0 TO li_Cntr li_Ctr1 li_Ctr2.
283300200829           MOVE lncc_No TO lc_ArrayMaxReached.
283400200829           INITIALIZE ltb_DtlRecord lf_MfaaccaipRecord
283500200829                      lf_MfaacwatpRecord.
283600200829           IF lncc_EndOfFetchNo
283700200829              PERFORM Process-Lif-Inv-Details
283800200829                UNTIL lncc_ArrayMaxReachedYes
283900200829           END-IF.
284000200829
284100200829           IF lncc_ArrayMaxReachedYes
284200200829              PERFORM Insert-Acc-Awd-Inv-Tax
284300200829           END-IF.
284400200829
284500200829       Process-Lif-Inv-Details.
284600200829           COMPUTE li_Cntr = li_Cntr + 1.
284700200829
284800200829           MOVE ltb_DtlArray(li_Cntr) TO ltb_DtlRecord.
284900200829      *RFS186053 Start
285000200829           MOVE li_DtlAccountNo    TO  li_InvUpdAccountNo.
285100200829           PERFORM SetupAwdInvWdHier.
285200200829           IF lc_InvUpdRC NOT = lncc_X
285300200831              PERFORM Process-Detail-Records3
285400200829              PERFORM RemoveAwdInvWdHier
285500200829           END-IF.
285600200829      *RFS186053 End
285700200829
285800200829186053 Process-Detail-Records3.
285900200829           IF li_DtlAccountNo NOT = li_PrevAccountNo
286000200829              PERFORM Get-Payments-Per-Annum
286100200829           END-IF.
286200200829
286300200829           COMPUTE li_TotalPayout = li_DtlMinWithdrawalAmt +
286400200829                                    li_DtlExcessPayAmt.
286500210616
286600210616      *RFS186771 - Starts
286700210616           IF  li_DtlPPPAEntitlement > 0
286800211008112173         COMPUTE li_TotalPayout = li_DtlRequestedAmt
286900210616               IF  li_DtlPPPAEntitlement >= li_TotalPayout
287000210616                   COMPUTE li_DtlMinWithdrawalAmt = li_TotalPayout
287100210616               ELSE
287200210616                   COMPUTE li_DtlMinWithdrawalAmt =
287300210616                                               li_DtlPPPAEntitlement
287400210616               END-IF
287500210616           END-IF.
287600210616      *RFS186771 - Ends
287700210616
287800210616      * RFS105383 - Begin
287900200829      * Check if Multiple contracts are allowed
28800020082988038 *    PERFORM GetGLWBInfo.
288100200829           PERFORM GetAllowMultContractFlag.
288200200829           PERFORM InitforGLWBSplit.
288300200829           IF lc_AllowMultContFlag = lncc_Yes
288400200829129478       PERFORM Get-Inv-Series-Rules
288500200829             PERFORM GetGLWBInfo
288600200829           END-IF.
288700200829      * RFS105383 - End
288800200829
288900200829           MOVE lnci_0 TO li_PercentMin.
289000200829
28910020082988038      IF NOT lncc_GLWB-Calculation
289200200829
289300200829           IF lc_DtlFedTaxOpt NOT = lncc_X AND
289400200829              lc_DtlFedTaxOpt NOT = lncc_Percent
289500200829              IF li_TotalPayout NOT = lnci_0 AND
289600200829                 li_PayPerAnnum NOT = lnci_0
289700200829                 COMPUTE li_PercentMin ROUNDED =
289800200829                         li_DtlMinWithdrawalAmt /
289900200829                         li_TotalPayout / li_PayPerAnnum
290000200829              END-IF
290100200829           ELSE
290200200829              IF li_PayPerAnnum NOT = lnci_0
290300200829                 COMPUTE li_PercentMin ROUNDED = 1 / li_PayPerAnnum
290400200829              END-IF
290500200829           END-IF
290600200829
290700200829           MOVE lnci_0 TO li_PercentExc
290800200829           IF li_TotalPayout NOT = lnci_0 AND
290900200829              li_PayPerAnnum NOT = lnci_0
291000200829              COMPUTE li_PercentExc ROUNDED = li_DtlExcessPayAmt /
291100200829                      li_TotalPayout / li_PayPerAnnum
291200200829           END-IF
29130020082988038      END-IF.
291400200829
291500200829
291600200829           MOVE lncc_Space TO lc_CalcOption.
291700200829           IF li_DtlMinWithdrawalAmt > lnci_0 OR
291800200829              lc_DtlFedTaxOpt = lncc_X OR
291900200829              lc_DtlFedTaxOpt = lncc_Percent  OR
292000200829              li_TotalPayout = lnci_0
292100200829              MOVE lncc_M TO lc_CalcOption
292200200829              PERFORM Create-Acc-Awd-Inv-Min
292300200829           END-IF.
292400200829
292500200829           IF li_DtlExcessPayAmt > lnci_0 AND
292600200829              lc_DtlFedTaxOpt NOT = lncc_X AND
292700200829              lc_DtlFedTaxOpt NOT = lncc_Percent
292800200829              MOVE lncc_E TO lc_CalcOption
292900200829              PERFORM Create-Acc-Awd-Inv-Exc
293000200829           END-IF.
293100200829
293200200829           IF lc_DtlNxtYrFreqCode NOT = lncc_Space AND
293300200829              lc_DtlNxtYrFreqCode NOT = lc_DtlFrequencyCode
293400200829              PERFORM Update-Next-Year-Freq-Code
293500200829           END-IF.
293600200829
293700200829           IF li_NoOfRowsFetched = li_Cntr
293800200829              MOVE lncc_Yes TO lc_ArrayMaxReached
293900200829           END-IF.
294000200829
294100200829       Create-Acc-Awd-Inv-Min.
294200200829
294300200829           PERFORM Setup-Acc-Awd-Inv.
294400200829           IF lc_DtlPayTaxOnM NOT = lncc_Space OR
294500200829              lc_DtlPayTaxOnB NOT = lncc_Space
294600200829              PERFORM Setup-Acc-Awd-Add-Tax
294700200829           END-IF.
294800200829
294900200829       Create-Acc-Awd-Inv-Exc.
295000200829
295100200829           PERFORM Setup-Acc-Awd-Inv.
295200200829           IF lc_DtlPayTaxOnE NOT = lncc_Space OR
295300200829              lc_DtlPayTaxOnB NOT = lncc_Space
295400200829              PERFORM Setup-Acc-Awd-Add-Tax
295500200829           END-IF.
295600200829
295700200829       Setup-Acc-Awd-Inv.
295800200829
295900200829           COMPUTE li_Ctr1 = li_Ctr1 + 1.
296000200829
296100200829           MOVE li_DtlAccountNo TO Account-No
296200200829                                OF lf_MfaaccaipRec(li_Ctr1).
296300200829           MOVE lnci_1          TO Awd-Seq-No
296400200829                                OF lf_MfaaccaipRec(li_Ctr1).
296500200829           MOVE lc_DtlInvCode   TO Investment-Code
296600200829                                OF lf_MfaaccaipRec(li_Ctr1).
296700200829           MOVE lncc_dollar     TO Split-Option-Code
296800200829                                OF lf_MfaaccaipRec(li_Ctr1).
296900200829           MOVE lc_DtlConfirm   TO Confirm OF lf_MfaaccaipRec(li_Ctr1).
297000200829           MOVE lc_DtlGrossOrNet TO Gross-Or-Net
297100200829                                 OF lf_MfaaccaipRec(li_Ctr1).
297200200829
297300200829           IF li_DtlAccountNo NOT = li_PrevAccountNo
297400200829              MOVE lnci_0 TO li_InvCtr
297500200829      *       PERFORM Get-Number-Of-Investments
297600200829           END-IF.
297700200829           COMPUTE li_InvCtr = li_InvCtr + 1.
297800200829
297900200829           MOVE lnci_0 TO li_AwdAmount.
298000200829           IF lncc_CalcOptionMin
298100200829
29820020082988038       IF lncc_GLWB-Calculation
29830020082988038         MOVE ln_IFPAYAWDAmt TO li_AwdAmount
29840020082988038       ELSE
298500200829
298600200829              IF lc_DtlSplitOptCode = lncc_Dollar
298700200829                 COMPUTE li_AwdAmount ROUNDED =
298800200829                         li_DtlAnnualAmt * li_PercentMin
298900200829              ELSE
299000200829                 IF lc_DtlSplitOptCode = lncc_Percent AND
299100200829                   (lc_DtlFedTaxOpt = lncc_X OR
299200200829                    lc_DtlFedTaxOpt = lncc_percent)
299300200829                    COMPUTE li_AwdAmount ROUNDED =
299400200829                            li_TotalPayout / li_PayPerAnnum *
299500200829                            li_DtlAnnualAmt / 100
299600200829                 ELSE
299700200829                    IF lc_DtlSplitOptCode = lncc_Percent
299800200829                       COMPUTE li_AwdAmount ROUNDED =
299900200829                               li_DtlMinWithdrawalAmt / li_PayPerAnnum
300000200829                               * li_DtlAnnualAmt / 100
300100200829                    END-IF
300200200829                 END-IF
300300200829              END-IF
30040020082988038       END-IF
300500200829           END-IF.
300600200829
300700200829           IF lncc_CalcOptionExc
300800200829
30090020082988038       IF lncc_GLWB-Calculation
30100020082988038         MOVE ln_TAXSELAWDAmt TO li_AwdAmount
30110020082988038       ELSE
301200200829
301300200829              IF lc_DtlSplitOptCode = lncc_Dollar
301400200829                 COMPUTE li_AwdAmount ROUNDED =
301500200829                         li_DtlAnnualAmt * li_PercentExc
301600200829              ELSE
301700200829                 IF lc_DtlSplitOptCode = lncc_Percent
301800200829                    COMPUTE li_AwdAmount ROUNDED = li_DtlExcessPayAmt /
301900200829                            li_PayPerAnnum * li_DtlAnnualAmt / 100
302000200829                 END-IF
302100200829              END-IF
30220020082988038       END-IF
302300200829           END-IF.
302400200829
302500200829           MOVE li_AwdAmount TO Awd-Amount OF lf_MfaaccaipRec(li_Ctr1).
302600200829
302700200829           IF lncc_CalcOptionMin
302800200829              IF lc_DtlFedTaxOpt = lncc_Percent
302900200829                 MOVE lc_DtlContrRedemCode TO Contr-Redem-Code
303000200829                                           OF lf_MfaaccaipRec(li_Ctr1)
303100200829              ELSE
303200200829                 MOVE lncc_Ifpay TO Contr-Redem-Code
303300200829                                 OF lf_MfaaccaipRec(li_Ctr1)
303400200829              END-IF
303500200829           ELSE
303600200829              IF lncc_CalcOptionExc
303700200829                 MOVE lncc_Taxsel TO Contr-Redem-Code
303800200829                                 OF lf_MfaaccaipRec(li_Ctr1)
303900200829              END-IF
304000200829           END-IF.
304100200829
304200200829           IF lc_DtlWaiveDsc = lncc_Y OR
304300200829             (lc_DtlWaiveDsc = lncc_M AND
304400200829              lc_DtlContrRedemCdRule = lncc_27)
304500200829              MOVE lncc_Y TO Waive-Dsc OF lf_MfaaccaipRec(li_Ctr1)
304600200829           ELSE
304700200829              MOVE lncc_N TO Waive-Dsc OF lf_MfaaccaipRec(li_Ctr1)
304800200829           END-IF.
304900200829
305000200829           IF lc_DtlWaiveDsc = lncc_Y
305100200829              MOVE lc_DtlWaiveReasonCode TO Dsc-Waive-Reason-Code
305200200829                                         OF lf_MfaaccaipRec(li_Ctr1)
305300200829           ELSE
305400200829              MOVE lncc_Space TO Dsc-Waive-Reason-Code
305500200829                              OF lf_MfaaccaipRec(li_Ctr1)
305600200829           END-IF.
305700200829           MOVE ZEROES TO Awd-Percent OF lf_MfaaccaipRec(li_Ctr1)
305800200829                          Awd-Units OF lf_MfaaccaipRec(li_Ctr1).
305900200829
306000200829      *Get-Number-Of-Investments.
306100200829      *
306200200829      *    MOVE lnci_0 TO li_TotalInv.
306300200829      *    MOVE li_DtlAccountNo TO li_PrevAccountNo.
306400200829      *
306500200829      *    EXEC SQL
306600200829      *         SELECT COUNT(*)
306700200829      *           INTO :li_TotalInv
306800200829      *           FROM Mfaaclivp
306900200829      *          WHERE Account_No = :li_DtlAccountNo
307000200829      *    END-EXEC.
307100200829      *
307200200829      *    MOVE SQLSTATE TO Ws-Sql-States.
307300200829      *    IF lncc_SqlEnd
307400200829      *       CONTINUE
307500200829      *    END-IF.
307600200829
307700200829       Setup-Acc-Awd-Add-Tax.
307800200829
307900200829           COMPUTE li_Ctr2 = li_Ctr2 + 1.
308000200829
308100200829           IF lc_DtlPayTaxOnB NOT = lncc_Space
308200200829              MOVE li_DtlAccountNo TO Account-No
308300200829                                   OF lf_MfaacwatpRec(li_Ctr2)
308400200829              MOVE lnci_1          TO Awd-Seq-No
308500200829                                   OF lf_MfaacwatpRec(li_Ctr2)
308600200829              MOVE lc_DtlInvCode   TO Investment-Code
308700200829                                   OF lf_MfaacwatpRec(li_Ctr2)
308800200829              MOVE lc_DtlSplitOptCodeRegB TO Split-Option-Code
308900200829                                          OF lf_MfaacwatpRec(li_Ctr2)
309000200829              MOVE lc_DtlAddReplceTaxRegB TO Add-Replace-Tax
309100200829                                          OF lf_MfaacwatpRec(li_Ctr2)
309200200829              MOVE li_DtlFedTaxAmtRegB TO Federal-Tax-Amt
309300200829                                       OF lf_MfaacwatpRec(li_Ctr2)
309400200829              MOVE li_DtlFedTaxPrcntRegB TO Federal-Tax-Percent
309500200829                                       OF lf_MfaacwatpRec(li_Ctr2)
309600200829              MOVE li_DtlProvTaxAmtRegB TO Provincial-Tax-Amt
309700200829                                       OF lf_MfaacwatpRec(li_Ctr2)
309800200829              MOVE li_DtlProvTaxPrcntRegB TO Provincial-Tax-Percent
309900200829                                       OF lf_MfaacwatpRec(li_Ctr2)
310000200829           END-IF.
310100200829
310200200829           IF lc_DtlPayTaxOnM NOT = lncc_Space AND lncc_CalcOptionMin
310300200829              MOVE li_DtlAccountNo TO Account-No
310400200829                                   OF lf_MfaacwatpRec(li_Ctr2)
310500200829              MOVE lnci_1          TO Awd-Seq-No
310600200829                                   OF lf_MfaacwatpRec(li_Ctr2)
310700200829              MOVE lc_DtlInvCode   TO Investment-Code
310800200829                                   OF lf_MfaacwatpRec(li_Ctr2)
310900200829              MOVE lc_DtlSplitOptCodeRegM TO Split-Option-Code
311000200829                                          OF lf_MfaacwatpRec(li_Ctr2)
311100200829              MOVE lc_DtlAddReplceTaxRegM TO Add-Replace-Tax
311200200829                                          OF lf_MfaacwatpRec(li_Ctr2)
311300200829              MOVE li_DtlFedTaxAmtRegM TO Federal-Tax-Amt
311400200829                                       OF lf_MfaacwatpRec(li_Ctr2)
311500200829              MOVE li_DtlFedTaxPrcntRegM TO Federal-Tax-Percent
311600200829                                         OF lf_MfaacwatpRec(li_Ctr2)
311700200829              MOVE li_DtlProvTaxAmtRegM TO Provincial-Tax-Amt
311800200829                                        OF lf_MfaacwatpRec(li_Ctr2)
311900200829              MOVE li_DtlProvTaxPrcntRegM TO Provincial-Tax-Percent
312000200829                                          OF lf_MfaacwatpRec(li_Ctr2)
312100200829           END-IF.
312200200829
312300200829           IF lc_DtlPayTaxOnE NOT = lncc_Space AND lncc_CalcOptionExc
312400200829              MOVE li_DtlAccountNo TO Account-No
312500200829                                   OF lf_MfaacwatpRec(li_Ctr2)
312600200829              MOVE lnci_1          TO Awd-Seq-No
312700200829                                   OF lf_MfaacwatpRec(li_Ctr2)
312800200829              MOVE lc_DtlInvCode   TO Investment-Code
312900200829                                   OF lf_MfaacwatpRec(li_Ctr2)
313000200829              MOVE lc_DtlSplitOptCodeRegE TO Split-Option-Code
313100200829                                          OF lf_MfaacwatpRec(li_Ctr2)
313200200829              MOVE lc_DtlAddReplceTaxRegE TO Add-Replace-Tax
313300200829                                          OF lf_MfaacwatpRec(li_Ctr2)
313400200829              MOVE li_DtlFedTaxAmtRegE TO Federal-Tax-Amt
313500200829                                       OF lf_MfaacwatpRec(li_Ctr2)
313600200829              MOVE li_DtlFedTaxPrcntRegE TO Federal-Tax-Percent
313700200829                                         OF lf_MfaacwatpRec(li_Ctr2)
313800200829              MOVE li_DtlProvTaxAmtRegE TO Provincial-Tax-Amt
313900200829                                        OF lf_MfaacwatpRec(li_Ctr2)
314000200829              MOVE li_DtlProvTaxPrcntRegE TO Provincial-Tax-Percent
314100200829                                          OF lf_MfaacwatpRec(li_Ctr2)
314200200829           END-IF.
314300200829
314400200829           IF lncc_CalcOptionMin
314500200829              IF lc_DtlFedTaxOpt = lncc_Percent
314600200829                 MOVE lc_DtlContrRedemCode TO Contr-Redem-Code
314700200829                                           OF lf_MfaacwatpRec(li_Ctr2)
314800200829              ELSE
314900200829                 MOVE lncc_Ifpay TO Contr-Redem-Code
315000200829                                 OF lf_MfaacwatpRec(li_Ctr2)
315100200829              END-IF
315200200829           ELSE
315300200829              MOVE lncc_Taxsel TO Contr-Redem-Code
315400200829                               OF lf_MfaacwatpRec(li_Ctr2)
315500200829           END-IF.
315600200829
315700200829       Insert-Acc-Awd-Inv-Tax.
315800200829
315900200829           IF li_Ctr1 > 0
316000200829              EXEC SQL
316100200829                   INSERT INTO Mfaaccaip :li_Ctr1 ROWS
316200200829                   VALUES (:Mfaaccaip)
316300200829              END-EXEC
316400200829           END-IF.
316500200829           MOVE SQLSTATE TO Ws-Sql-States.
316600200829           IF NOT lncc_sqlSuccessful
316700200829              SET Ws-Err-10 TO TRUE
316800200829              SET lncc_ErrCodeDescr10 TO TRUE
316900200829              PERFORM Set-Internal-Error
317000200829              PERFORM Dsp-Error
317100200829              PERFORM Force-Msgw
317200200829           END-IF.
317300200829
317400200829           IF li_Ctr2 > 0
317500200829              EXEC SQL
317600200829                   INSERT INTO Mfaacwatp :li_Ctr2 ROWS
317700200829                   VALUES (:Mfaacwatp)
317800200829              END-EXEC
317900200829           END-IF.
318000200829           MOVE SQLSTATE TO Ws-Sql-States.
318100200829           IF NOT lncc_sqlSuccessful
318200200829              SET Ws-Err-11 TO TRUE
318300200829              SET lncc_ErrCodeDescr11 TO TRUE
318400200829              PERFORM Set-Internal-Error
318500200829              PERFORM Dsp-Error
318600200829              PERFORM Force-Msgw
318700200829           END-IF.
318800200829
318900200829       Get-Payments-Per-Annum.
319000200829
319100200829           MOVE li_DtlStartDate TO li_StartDate.
319200200829           MOVE li_AsAtDate TO li_ProcessDate.
319300200829
319400200829           MOVE lncc_N TO lc_NewLifAcct.
319500200829           IF li_StartDateYr > li_ProcessDateYr AND
319600200829              li_StartDateYr NOT = lnci_0 AND
319700200829              li_ProcessDateYr NOT = lnci_0
319800200829              MOVE lncc_Y TO lc_NewLifAcct
319900200829           END-IF.
320000200829
320100200829      * RFS105383 - Begin : initialize parameter
320200200829           INITIALIZE pi_PayPerAnnum
320300200829      * RFS105383 - End
320400200829           IF lncc_NewLifAcctYes OR lc_DtlNxtYrFreqCode = lncc_Variable
320500200829      * RFS105383 - Begin: call FXREMPAY for the Weekly frequency
320600200829      * RFS109551 - Start
320700200829      *     OR lc_DtlFrequencyCode = lncc_WK
320800200829      *     OR lc_DtlNxtYrFreqCode = lncc_WK
320900200829      *     OR lc_DtlFrequencyCode = lncc_BW
321000200829      *     OR lc_DtlNxtYrFreqCode = lncc_BW
321100200829            OR lc_DtlFrequencyCode NOT = SPACES
321200200829            OR lc_DtlNxtYrFreqCode NOT = SPACES
321300200829      * RFS109551 - End
321400200829      * RFS105383 - End
321500200829              IF li_DtlHoldUntilDate NOT = 0 AND
321600200829                 li_DtlHoldUntilDate > li_DtlStartDate AND
321700200829                 li_DtlHoldUntilDate > li_AsAtDate
321800200829177195           AND lc_AWDStatus  = "HD"
321900200829                 MOVE li_DtlHoldUntilDate TO pi_StartPayDate
322000200829              ELSE
322100200829                 IF li_DtlStartDate NOT = 0
322200200829      * RFS105383 - Begin: Start Date  greater than current proces date
322300200829                   IF li_DtlStartDate > li_AsAtDate
322400200829      * RFS105383 - End
322500200829                    MOVE li_DtlStartDate TO pi_StartPayDate
322600200829      *RFS177195 STARTS
322700200829      *RFS173685 Begin
322800200829      *             IF YEAR-END = 'Y'
322900200829      *                MOVE lc_AsAtDate  TO lc_Date1
323000200829      *                MOVE li_StartDate TO lc_Date2
323100200829      *                IF li_Date1YYYYMM = li_Date2YYYYMM
323200200829      *                   MOVE 0101 to li_StartDateMmDd
323300200829      *                   MOVE li_StartDate TO pi_StartPayDate
323400200829      *                END-IF
323500200829      *             END-IF
323600200829      *RFS173685 End
323700200829      *RFS177195 ENDS
323800200829
323900200829      * RFS105383 - Begin: set up start date to the next Year
324000200829                   ELSE
324100200829      * RFS112468 - Start
324200200829                     IF li_DtlNextPayDate > 0
324300200829                        MOVE li_DtlNextPayDate To pi_StartPayDate
324400200829                     ELSE
324500200829      *RFS 112468 - End
324600200829                        MOVE li_DtlStartDate TO li_tmpDate
324700200829                        MOVE FUNCTION ADD-DURATION (li_tmpDate YEARS 1)
324800200829                                           TO      pi_StartPayDate
324900200829112468               END-IF
325000200829                   END-IF
325100200829      * RFS105383 - End
325200200829                 END-IF
325300200829              END-IF
325400200829
325500200829              IF lc_DtlNxtYrFreqCode NOT = lncc_Space
325600200829                 MOVE lc_DtlNxtYrFreqCode TO pc_Frequency
325700200829              ELSE
325800200829                 MOVE lc_DtlFrequencyCode TO pc_Frequency
325900200829              END-IF
326000200829
326100200829              IF pc_Frequency = lncc_Variable
326200200829                 MOVE li_DtlAccountNo TO pi_AccountNo
326300200829              ELSE
326400200829                 MOVE ZEROES TO pi_AccountNo
326500200829              END-IF
326600200829
326700200829      *RFS177195 STARTS
326800200829              IF YEAR-END = 'Y'
326900200829                 MOVE lc_AsAtDate  TO lc_Date1
327000200829                 MOVE pi_StartPayDate TO lc_Date2
327100200829                 IF li_Date1YYYYMM = li_Date2YYYYMM
327200200829                    MOVE 01  to li_Date2MM
327300200829                    MOVE 01  to li_Date2DDA
327400200829                    MOVE lc_Date2a  TO pi_StartPayDate
327500200829                 END-IF
327600200829              END-IF
327700200829      *RFS177195 ENDS
327800200829
327900200829              MOVE ZEROES to pi_PayPerAnnum
328000200829              CALL "FXREMPAY" USING pi_StartPayDate,
328100200829                                    pi_AccountNo,
328200200829                                    pc_Frequency,
328300200829                                    pi_PayPerAnnum
328400200829           END-IF.
328500200829
328600200829           IF lncc_NewLifAcctNo AND
328700200829              lc_DtlNxtYrFreqCode NOT = lncc_Variable
328800200829      * RFS105383 - Begin: make sure payment frequency stays same
328900200829      *   as it was calculated by FXREMPAY
329000200829              AND pi_PayPerAnnum   = 0
329100200829      * RFS105383 - End
329200200829              IF li_DtlPayPerAnnumLif NOT = lnci_0
329300200829                 MOVE li_DtlPayPerAnnumLif TO pi_PayPerAnnum
329400200829              ELSE
329500200829                 IF li_DtlPayPerAnnumAwd NOT = lnci_0
329600200829                    MOVE li_DtlPayPerAnnumAwd TO pi_PayPerAnnum
329700200829                 END-IF
329800200829              END-IF
329900200829           END-IF
330000200829
330100200829           MOVE pi_PayPerAnnum TO li_PayPerAnnum.
330200200829
330300200829       Update-Next-Year-Freq-Code.
330400200829           EXEC SQL
330500200829                UPDATE Mfaaccawp
330600200829                   SET Frequency_Code = :lc_DtlNxtYrFreqCode
330700200829                 WHERE Account_No = :li_DtlAccountNo AND
330800200829                       Awd_Seq_No = :lnci_1
330900200829           END-EXEC.
331000200829
331100200829           IF NOT lncc_sqlSuccessful
331200200829              SET Ws-Err-12 TO TRUE
331300200829              SET lncc_ErrCodeDescr12 TO TRUE
331400200829              PERFORM Set-Internal-Error
331500200829              PERFORM Dsp-Error
331600200829           END-IF.
331700200829
33180020082932931  Recalc-Max-Withdrawal-Amt.
331900200829
33200020082932931 * This paragraph is used to use new formula to calculate Max
33210020082932931 * Withdrawal Amt for BC and MB.
332200200829
33230020082932931 *    IF lc_ProvinceOfAgree = lncc_ProvinceBC                      58577
33240020082958577      IF ln_cnt_PrdType = 0  AND lc_Lif_Max_Calc_Rule = "5"
33250020082932931         PERFORM Recalc-Max-Withdrawal-Amt-BC
33260020082932931      END-IF.
332700200829
33280020082932931 *    IF lc_ProvinceOfAgree = lncc_ProvinceMB                      58577
33290020082958577      IF ln_cnt_PrdType NOT = 0  AND lc_Lif_Max_Calc_Rule = "7"
33300020082932931         PERFORM Recalc-Max-Withdrawal-Amt-MB
33310020082932931      END-IF.
333200200829
33330020082944202 *    IF lc_Include_Returns_Transferred = "Y"                      58577
33340020082958577      IF ln_cnt_PrdType = 0  AND lc_Lif_Max_Calc_Rule = "4"
333500200829              AND li_OLDLF_Cnt = 0                                      44202.9
33360020082944202         PERFORM Recalc-Max-Withdrawal-Amt-TBL
33370020082944202      END-IF.
333800200829      *
333900200829      *RFS41252 Start
334000200829      *Calculate Max. withdrawal amount.
334100200829      *Rcalc-Max-withdrawal-Amt-Fml will be called when a formula
334200200829      *is found from table MFALIFWTFP.
334300200829      *
334400200829           PERFORM Get-Calculation-Rule.
33450020082958577 *    IF lc_CalRule  NOT = SPACE
33460020082958577      IF lc_CalRule  = lncc_1   OR
334700200829|             lc_CalRule  = lncc_2   OR
33480020082958577         lc_CalRule  = lncc_3
334900200829              PERFORM Recalc-Max-Withdrawal-Amt-Fml
335000200829           END-IF.
335100200829      *RFS41252 End
335200200829
33530020082932931  Recalc-Max-Withdrawal-Amt-BC.
335400200829
33550020082932931      PERFORM Get-Amt-Paid-Out-LIF-Acct.
33560020082932931      PERFORM Get-Amt-Came-Into-LIF-Acct.
33570020082932931      PERFORM Decide-Max-Withdrawal-Amt-BC.
335800200829
33590020082932931  Get-Amt-Paid-Out-LIF-Acct.
336000200829
33610020082932931      COMPUTE ln_GrossAmtPaidOut = 0.
336200200829
33630020082932931      EXEC SQL
33640020082985276        With Mfatrnp_subset as
336500200829  |              (Select * from Mfatrnp
336600200829  |                Where Account_no = :li_CurrAccountNo AND
336700200829  |                      Trade_date BETWEEN
336800200829  |                        :li_YearStartDate AND :li_YearEndDate AND
336900200829  |                      Trans_type_code IN
337000200829  |                       (:lncc_SEL, :lncc_SWO, :lncc_TRO)      AND
337100200829  |                      Trans_status_code IN
337200200829  |                       (:lncc_HST, :lncc_HSC)                 AND
337300200829  |                      Reverse <> :lncc_Yes
33740020082985276            )
33750020082932931        SELECT COALESCE(
33760020082932931               SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
33770020082932931                        THEN DECIMAL(ROUND(Trnp.Gross_Amt /
33780020082932931                             COALESCE(Exrhmp.Exchange_Rate,1)
33790020082932931                             ,2),13,2)
33800020082932931                        ELSE Trnp.Gross_Amt
33810020082932931                   END), 0)
33820020082932931          INTO :ln_GrossAmtPaidOut
33830020082985276 *        FROM Mfatrnp Trnp,
33840020082985276          FROM Mfatrnp_subset Trnp INNER JOIN Mfainvp Invp
33850020082985276               ON Trnp.Investment_code = Invp.Investment_code
33860020082932931               LEFT OUTER JOIN Mfaexrhmp Exrhmp
33870020082932931                 ON Exrhmp.Currency = Invp.Currency AND
33880020082932931                    Exrhmp.Trade_Date = Trnp.Trade_Date AND
33890020082932931                    Exrhmp.Exchange_Rate_Type =
33900020082932931                    :lc_ExchangeRateType
33910020082985276 * Commented below lines
33920020082985276 *       WHERE Trnp.Account_No = :li_CurrAccountNo           AND
33930020082985276 *             Trnp.Trans_Type_Code IN
33940020082985276 *             (:lncc_SEL, :lncc_SWO, :lncc_TRO)             AND
33950020082985276 *             Trnp.Trans_Status_Code IN
33960020082985276 *             (:lncc_HST, :lncc_HSC)                        AND
33970020082985276 *             Trnp.Reverse <> :lncc_Yes                     AND
33980020082985276 *             Trnp.Trade_Date BETWEEN
33990020082985276 *             :li_YearStartDate AND :li_YearEndDate         AND
34000020082985276 *             Trnp.Investment_Code = Invp.Investment_Code
34010020082932931      END-EXEC.
340200200829
34030020082932931      MOVE SQLSTATE TO Ws-Sql-States.
34040020082932931      IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
34050020082932931         SET Ws-Err-16 TO TRUE
34060020082932931         SET lncc_ErrCodeDescr16 TO TRUE
34070020082932931         PERFORM Set-Internal-Error
34080020082932931         PERFORM Dsp-Error
34090020082932931      END-IF.
341000200829
34110020082932931  Get-Amt-Came-Into-LIF-Acct.
341200200829
34130020082932931      COMPUTE ln_GrossAmtCameInto = 0.
341400200829
34150020082932931      EXEC SQL
34160020082985276        With Mfatrnp_subset as
341700200829  |              (Select * from Mfatrnp
341800200829  |                Where Account_no = :li_CurrAccountNo AND
341900200829  |                      Trade_date BETWEEN
342000200829  |                        :li_YearStartDate AND :li_YearEndDate AND
342100200829  |                      Trans_type_code IN
342200200829  |                       (:lncc_BUY, :lncc_SWI, :lncc_TRI)      AND
342300200829  |                      Trans_status_code IN
342400200829  |                       (:lncc_HST, :lncc_HSC)                 AND
342500200829  |                      Reverse <> :lncc_Yes
34260020082985276            )
34270020082932931        SELECT COALESCE(
34280020082932931               SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
34290020082932931                        THEN DECIMAL(ROUND(Trnp.Gross_Amt /
34300020082932931                             COALESCE(Exrhmp.Exchange_Rate,1)
34310020082932931                             ,2),13,2)
34320020082932931                        ELSE Trnp.Gross_Amt
34330020082932931                   END), 0)
34340020082932931          INTO :ln_GrossAmtCameInto
34350020082985276 *        FROM Mfatrnp Trnp,
34360020082985276          FROM Mfatrnp_subset Trnp INNER JOIN Mfainvp Invp
34370020082985276               ON Trnp.Investment_code = Invp.Investment_code
34380020082932931               LEFT OUTER JOIN Mfaexrhmp Exrhmp
34390020082932931                 ON Exrhmp.Currency = Invp.Currency AND
34400020082932931                    Exrhmp.Trade_Date = Trnp.Trade_Date AND
34410020082932931                    Exrhmp.Exchange_Rate_Type =
34420020082932931                    :lc_ExchangeRateType
34430020082985276 * Commented below lines
34440020082985276 *       WHERE Trnp.Account_No = :li_CurrAccountNo           AND
34450020082985276 *             Trnp.Trans_Type_Code IN
34460020082985276 *             (:lncc_BUY, :lncc_SWI, :lncc_TRI)             AND
34470020082985276 *             Trnp.Trans_Status_Code IN
34480020082985276 *             (:lncc_HST, :lncc_HSC)                        AND
34490020082985276 *             Trnp.Reverse <> :lncc_Yes                     AND
34500020082985276 *             Trnp.Trade_Date BETWEEN
34510020082985276 *             :li_YearStartDate AND :li_YearEndDate         AND
34520020082985276 *             Trnp.Investment_Code = Invp.Investment_Code
34530020082932931      END-EXEC.
345400200829
34550020082932931      MOVE SQLSTATE TO Ws-Sql-States.
34560020082932931      IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
34570020082932931         SET Ws-Err-17 TO TRUE
34580020082932931         SET lncc_ErrCodeDescr16 TO TRUE
34590020082932931         PERFORM Set-Internal-Error
34600020082932931         PERFORM Dsp-Error
34610020082932931      END-IF.
346200200829
34630020082932931  Decide-Max-Withdrawal-Amt-BC.
346400200829
346500200829      *   RFS 88522 Begins -  Comment out the Formula Calculation and
346600200829      *                       add the same with new routine
34670020082988522 *
34680020082932931 *    INITIALIZE li_MaxWithdrawalAmtTemp.
346900200829
34700020082932931 *    COMPUTE li_MaxWithdrawalAmtTemp =
34710020082932931 *            li_MarketValue                       -
34720020082932931 *            ln_LastYearMV                        +
34730020082932931 *            ln_GrossAmtPaidOut                   -
34740020082932931 *            ln_GrossAmtCameInto.
34750020082988522 *
34760020082988522      PERFORM Recalc-Max-Withdrawal-Amt-Temp.
347700200829      *   RFS 88522 - ends.
347800200829
34790020082932931      IF li_MaxWithdrawalAmtTemp > li_MaxWithdrawalAmt
34800020082932931         COMPUTE li_MaxWithdrawalAmt = li_MaxWithdrawalAmtTemp
34810020082932931      END-IF.
348200200829
348300200829148093     IF li_MinWithdrawalAmt > li_MaxWithdrawalAmt
348400200829148093         COMPUTE li_MaxWithdrawalAmt = li_MinWithdrawalAmt
348500200829148093     END-IF.
348600200829
34870020082932931  Recalc-Max-Withdrawal-Amt-MB.
348800200829
34890020082932931      PERFORM Get-Reference-Balance.
349000200829
34910020082932931      IF li_MaxWithdrawalAmtTemp < li_MaxWithdrawalAmt
34920020082932931         COMPUTE li_MaxWithdrawalAmt = li_MaxWithdrawalAmtTemp
34930020082932931      END-IF.
349400200829
34950020082958577      IF li_MaxWithdrawalAmt     < li_MinWithdrawalAmt
349600200829|             COMPUTE li_MaxWithdrawalAmt  = li_MinWithdrawalAmt
34970020082958577      END-IF.
349800200829
34990020082932931  Get-Reference-Balance.
350000200829
35010020082932931      INITIALIZE ln_ReferenceBalance,
35020020082932931                 li_MaxWithdrawalAmtTemp.
350300200829
35040020082932931      COMPUTE ln_ReferenceBalance ROUNDED =
350500200829      * 32931.11 begin li_LastMaxWithdrawalAmt has not been updated
35060020082932931 *            (ln_LastYearMV - li_LastMaxWithdrawalAmt) *
35070020082932931              (ln_LastYearMV - li_PrevMaxWithdrawalAmt) *
350800200829      * 32931.11 end
35090020082932931              (1 +  ln_ReferenceRateNum6Dec / 100).
351000200829
35110020082932931      IF ln_ReferenceBalance NOT = 0
35120020082932931         COMPUTE li_MaxWithdrawalAmtTemp ROUNDED =
35130020082932931 *               (li_LastMaxWithdrawalAmt * li_MarketValue) /
35140020082932931                 (li_PrevMaxWithdrawalAmt * li_MarketValue) /
35150020082932931                  ln_ReferenceBalance
35160020082932931      END-IF.
351700200829
351800200829      *RFS44202 - Start
351900200829       Recalc-Max-Withdrawal-Amt-TBL.
352000200829
352100200829           PERFORM Get-Amt-Paid-Out-LIF-Acct.
352200200829           PERFORM Get-Amt-Came-Into-LIF-Acct.
352300200829           PERFORM Decide-Max-Withdrawl-Amt-TBL.
352400200829
352500200829       Decide-Max-Withdrawl-Amt-TBL.
352600200829
352700200829      *   RFS 88522 Begins -  Comment out the Formula Calculation and
352800200829      *                       add the same with new routine
35290020082988522 *    compute li_MaxWithdrawalAmtTemp   =
35300020082988522 *            li_MarketValue           -
35310020082988522 *            ln_LastYearMV            +
35320020082988522 *            ln_GrossAmtPaidOut       -
35330020082988522 *            ln_GrossAmtCameInto      +
35340020082988522 *            ln_InvReturnRecv.
35350020082988522      PERFORM Recalc-Max-Withdrawal-Amt-Temp.
353600200829      *   RFS 88522 - ends.
353700200829
353800200829           IF li_MaxWithdrawalAmtTemp > li_MaxWithdrawalAmt
353900200829              COMPUTE li_MaxWithdrawalAmt = li_MaxWithdrawalAmtTemp
354000200829           END-IF.
354100200829
354200200829       Find-Calculation-Flags.
354300200829
354400200829           MOVE SPACES TO lc_Include_First_Year_Flag,
354500200829                          lc_Include_Returns_Transferred.
354600200829
354700200829           EXEC SQL
354800200829                SELECT INCLUDE_FIRST_YEAR_RETURNS,
354900200829                       INCLUDE_TRANSFER_RETURNS
355000200829                INTO :lc_Include_First_Year_Flag,
355100200829                     :lc_Include_Returns_Transferred
355200200829                FROM mfalifwtfp
355300200829                WHERE PROVINCE_CODE = :lc_ProvinceOfAgree
355400200829                 and  AGE_THRESHOLD = 999
35550020082958577            and  PRODUCT_TYPE_CODE = :lc_ProductTypeCode
355600200829           END-EXEC.
355700200829      *
355800200829           MOVE SQLSTATE TO Ws-Sql-States.
355900200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
356000200829              SET Ws-Err-21 TO TRUE
356100200829              SET lncc_ErrCodeDescr21 TO TRUE
356200200829              PERFORM Set-Internal-Error
356300200829              PERFORM Dsp-Error
356400200829           END-IF.
356500200829      *
356600200829      *RFS44202 - End
356700200829
356800200829      *RFS58577 - Start
356900200829       Get-Calc-Rule-For-Prd-Type.
357000200829
357100200829           INITIALIZE MFALIFWTFP OF Lif-Withdrawal-Formula-Rec.
357200200829           INITIALIZE lc_ProductTypeCode
357300200829                      lc_Lif_Max_Calc_Rule.
357400200829           SET lb_EOF_MFALIFWTFP_No To TRUE.
357500200829           MOVE lc_ProvinceOfAgree to
357600200829                PROVINCE-CODE OF LIF-WITHDRAWAL-FORMULA.
357700200829           START Lif-Withdrawal-Formula
357800200829           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
357900200829           INVALID KEY
358000200829               SET lb_EOF_MFALIFWTFP_Yes To TRUE
358100200829           NOT INVALID KEY
358200200829               CONTINUE
358300200829           END-START
358400200829           PERFORM READ-Lif-Withdrawal-Formula
358500200829                UNTIL lb_EOF_MFALIFWTFP_Yes.
358600200829
358700200829       READ-Lif-Withdrawal-Formula.
358800200829           INITIALIZE ln_Cnt_PrdType.
358900200829           READ Lif-Withdrawal-Formula  NEXT RECORD
359000200829                AT END
359100200829                SET lb_EOF_MFALIFWTFP_Yes to TRUE.
359200200829           IF lb_EOF_MFALIFWTFP_No
359300200829              IF PROVINCE-CODE of LIF-WITHDRAWAL-FORMULA
359400200829                 NOT = lc_ProvinceOfAgree
359500200829                 SET lb_EOF_MFALIFWTFP_Yes to TRUE
359600200829              ELSE
359700200829                 IF AGE-THRESHOLD OF LIF-WITHDRAWAL-FORMULA  >
359800200829                      li_InvestorAge
359900200829156153              AND
360000200829156153              ACCOUNT-TYPE-SUB-RULE OF LIF-WITHDRAWAL-FORMULA
360100200829156153                  = lc_AcctTypeSubRule
360200200829                  MOVE PRODUCT-TYPE-CODE of LIF-WITHDRAWAL-FORMULA
360300200829                           to lc_ProductTypeCode
360400200829                  MOVE CALCULATION-RULE of LIF-WITHDRAWAL-FORMULA
360500200829                           to lc_Lif_Max_Calc_Rule
360600200829                 END-IF
360700200829                 IF lc_ProductTypeCode  NOT  = "  "
360800200829                   EXEC SQL
360900200829                     SELECT COUNT(*)
361000200829                     INTO :ln_Cnt_PrdType
361100200829                     FROM mfaaccivp accivp
361200200829                     JOIN mfainvp   invp
361300200829                       on invp.investment_code = accivp.investment_code
361400200829                     WHERE accivp.Account_No    = :li_CurrAccountNo
361500200829                     AND   invp.product_type_code = :lc_ProductTypeCode
361600200829                     AND   accivp.curr_unit_bal > 0
361700200829                   END-EXEC
361800200829                 END-IF
361900200829                 IF ln_Cnt_PrdType   NOT = 0
362000200829                    SET lb_EOF_MFALIFWTFP_Yes TO TRUE
362100200829                 END-IF
362200200829              END-IF
362300200829           END-IF.
362400200829
362500200829      *RFS58577 - End
362600200829
362700200829      *RFS41252 Start
362800200829      *
362900200829      *    Retrieve formula from MFALIFWTFP.
363000200829      *    First check to make sure the table MFALIFWTFP contains
363100200829      *    entries for the province that matches with ProvinceOfAgree.
363200200829      *    Then compare investor's age to retrieve the appropriate
363300200829      *    entry.
363400200829      *    To keep the table entries flexible, this program does not
363500200829      *    hardcode the age when searching for rule.
363600200829      *
363700200829      *    Current assumption in MFALIFWTFP:
363800200829      *         Province   Age    Formule/Rule
363900200829      *         AB          70    1
364000200829140137*         AB          90    2
364100200829      *         AB          85    2
364200200829      *         AB          999   3
364300200829      *
364400200829      *         If  Investor's age < 70 , then retrieves Formula 1
364500200829140137*         If  70 <= Investor's age < 90, then retrieves Formula 2
364600200829140137*         If  90 <= Investor's age, then retrieves Formula 3
364700200829      *
364800200829       Get-Calculation-Rule.
364900200829           MOVE SPACE  TO lc_CalRule.
365000200829           COMPUTE ln_Entries = 0.
365100200829           EXEC SQL
365200200829                SELECT COUNT(*)
365300200829                INTO :ln_Entries
365400200829                FROM mfalifwtfp
365500200829                WHERE PROVINCE_CODE = :lc_ProvinceOfAgree
365600200829           END-EXEC.
365700200829      *
365800200829           MOVE SQLSTATE TO Ws-Sql-States.
365900200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
366000200829              SET Ws-Err-18 TO TRUE
366100200829              SET lncc_ErrCodeDescr18 TO TRUE
366200200829              PERFORM Set-Internal-Error
366300200829              PERFORM Dsp-Error
366400200829           END-IF.
366500200829      *
366600200829           IF ln_Entries > 0
366700200829           EXEC SQL
366800200829                SELECT CALCULATION_RULE
366900200829                INTO :lc_CalRule
367000200829                FROM mfalifwtfp
367100200829                WHERE PROVINCE_CODE = :lc_ProvinceOfAgree
367200200829                  and AGE_THRESHOLD > :li_Investorage
36730020082958577             and PRODUCT_TYPE_CODE = :lc_ProductTypeCode
367400200829156153            AND ACCOUNT_TYPE_SUB_RULE = : lc_AcctTypeSubRule
367500200829                ORDER BY PROVINCE_CODE, AGE_THRESHOLD
367600200829                FETCH FIRST ROW ONLY
367700200829           END-EXEC
367800200829      *
367900200829           MOVE SQLSTATE TO Ws-Sql-States
368000200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
368100200829              SET Ws-Err-19 TO TRUE
368200200829              SET lncc_ErrCodeDescr18 TO TRUE
368300200829              PERFORM Set-Internal-Error
368400200829              PERFORM Dsp-Error
368500200829           END-IF
368600200829      *
368700200829           END-IF.
368800200829
368900200829       Recalc-Max-Withdrawal-Amt-Fml.
369000200829           PERFORM Get-Amt-Paid-Out-LIF-Acct.
369100200829           PERFORM Get-Amt-Came-Into-LIF-Acct.
369200200829           PERFORM Cal-Max-From-Formula.
369300200829           PERFORM Decide-Max-Withdrawal-Amt-Frm.
369400200829
369500200829      *************************************************************
369600200829      *  Calculate M = C/F        where
369700200829      *
369800200829      *  M is the maximum withdrawal amount based on formula.
369900200829      *  C is market value of year end when JOBLIFGEN is running.
370000200829140137*  T is  90 - owner's age.
370100200829      *  R is  LIF Reference Rate from System Parameters RFSYPARM.
370200200829      *
370300200829      *  If owner's age is < 70, use long formula. ie formula '1'.
370400200829      *
370500200829      *      (1+R)x[1- 1/(1+R)**15] + (1+R)x[1- 1/(1+R)**(T-15)]
370600200829      *  F = ----------------------   --------------------------
370700200829      *              R                      R x (1+R)**15
370800200829      *
370900200829      *
371000200829140137*  If 70 <= owner's age < 90, use short formula. ie formula '2'.
371100200829      *
371200200829      *      (1+R)x[1- 1/(1+R)**T]
371300200829      *    = ---------------------
371400200829      *              R
371500200829      *
371600200829140137*  If owner's age >= 90, use formula '3' which default M to
371700200829      *     Market Value.
371800200829      *************************************************************
371900200829       Cal-Max-From-Formula.
372000200829           INITIALIZE ln_FormulaAmt.
372100200829           COMPUTE ln_RR  = ln_ReferenceRateNum6Dec / 100.
372200200829           COMPUTE ln_R1  = 1 + ln_RR.
372300200829           EVALUATE  lc_CalRule
372400200829             WHEN  lncc_1
372500200829140137*       COMPUTE li_VarT = lnci_85 - li_InvestorAge
372600200829140137        COMPUTE li_VarT = 90 - li_InvestorAge
372700200829              COMPUTE ln_P1 =
372800200829                   (ln_R1 * (1 - 1 / (ln_R1 ** lnci_15))) / ln_RR
372900200829              COMPUTE ln_P2 =
373000200829                    ln_R1 * (1 - 1 / (ln_R1 ** (li_VarT - lnci_15)))
373100200829              COMPUTE ln_P3 =
373200200829                    ln_P2 / (ln_RR * (ln_R1 ** lnci_15))
373300200829              COMPUTE ln_FormulaAmt ROUNDED =
373400200829                    li_MarketValue / (ln_P1 + ln_P3)
373500200829
373600200829             WHEN  lncc_2
373700200829140137*       COMPUTE li_VarT  = lnci_85 - li_InvestorAge
373800200829140137        COMPUTE li_VarT  = 90 - li_InvestorAge
373900200829              COMPUTE ln_P1 =
374000200829                    (ln_R1 * (1 - 1 / (ln_R1 ** li_VarT))) / ln_RR
374100200829              COMPUTE ln_FormulaAmt ROUNDED =
374200200829                    li_MarketValue / ln_P1
374300200829
374400200829             WHEN  lncc_3
374500200829              COMPUTE ln_FormulaAmt = li_MarketValue
374600200829
374700200829           END-EVALUATE.
374800200829      *************************************************************
374900200829      *To determine LIF maximum withdrawal amount for Alberta.
375000200829      * It is the greater of Previous year's investment return or
375100200829      * M.  M was calculated in Cal-Max-From-Formula.
375200200829140137*Exception: if investor's age is >= 90, ie, formula =3 then
375300200829      *the maximum withdrawal amount is the market value when this
375400200829      *program runs.
375500200829      *************************************************************
375600200829       Decide-Max-Withdrawal-Amt-Frm.
375700200829
375800200829      *   RFS 88522 Begins -  Comment out the Formula Calculation and
375900200829      *                       add the same with new routine
37600020082988522 *    INITIALIZE li_MaxWithdrawalAmtTemp.
376100200829
37620020082988522 *    COMPUTE li_MaxWithdrawalAmtTemp =
37630020082988522 *            li_MarketValue                       -
37640020082988522 *            ln_LastYearMV                        +
37650020082988522 *            ln_GrossAmtPaidOut                   -
37660020082988522 *            ln_GrossAmtCameInto.
37670020082988522      PERFORM Recalc-Max-Withdrawal-Amt-Temp.
376800200829      *   RFS 88522 - ends.
376900200829
377000200829           IF lc_CalRule = lncc_3
377100200829              COMPUTE li_MaxWithdrawalAmt = li_MarketValue
377200200829           ELSE
377300200829           IF li_MaxWithdrawalAmtTemp > ln_FormulaAmt
377400200829              COMPUTE li_MaxWithdrawalAmt = li_MaxWithdrawalAmtTemp
377500200829           ELSE
377600200829              COMPUTE li_MaxWithdrawalAmt = ln_FormulaAmt
377700200829           END-IF
377800200829           END-IF.
377900200829
378000200829      *RFS41252 End
378100200829
378200200829      *44202.9 - start
378300200829       Check-Account-Attribute.
378400200829           COMPUTE li_OLDLF_Cnt = 0.
378500200829
378600200829      * RFS73628 - Begin: make sure "Ontario" rule do not use OLDLF
378700200829      *  method calculation.
378800200829      *  For "Ontario" li_OLDLF_Cnt stays equal to 0.
378900200829           IF lc_Lif_Max_Calc_Rule NOT = "4"
379000200829      * RFS73628 - End
379100200829            EXEC SQL
379200200829             SELECT COUNT(*)
379300200829             INTO :li_OLDLF_Cnt
379400200829             FROM MFAACCATP
379500200829             WHERE Account_No = :li_CurrAccountNo
379600200829               AND Account_Attribute_Code = "OLDLF"
379700200829            END-EXEC.
379800200829
379900200829      *44202.9 - end
380000200829
380100200829      * 54661 - begins.
380200200829
380300200829       Calc-Max-For-Locked-In-Acct.
380400200829
380500200829           INITIALIZE li_MaxWithdrawalAmt
380600200829                      li_AcctAge_Lk.
380700200829
380800200829           PERFORM Get-LRIF-Initial-Trade.
380900200829           PERFORM Get-Amt-Paid-Out-LIF-Acct-lk.
38100020082967029      PERFORM Calculate-Carry-Over.
381100200829           PERFORM Get-Amt-Came-Into-LIF-Acct-lk.
381200200829           PERFORM Calc-Prev-Year-Inv-Return.
381300200829           PERFORM Get-Amt-Paid-Out-LTD.
381400200829           PERFORM Get-Amt-Came-Into-LTD.
381500200829           PERFORM Calc-Accumulated-Inv-Return.
381600200829           PERFORM Calc-Reference-Rate-lk.
381700200829
381800200829           COMPUTE li_AcctAge_Lk =
381900200829                   li_YearEndDate_CCYY - li_TradeDateInit_CCYY
382000200829           END-COMPUTE.
382100200829
382200200829           IF li_AcctAge_lk = 0
382300200829              COMPUTE li_MaxWithdrawalAmt   = li_MinWithdrawalAmt
382400200829              IF ln_PrevYearInvReturnYear2  > li_MaxWithdrawalAmt
382500200829                COMPUTE li_MaxWithdrawalAmt = ln_PrevYearInvReturnYear2
382600200829              END-IF
382700200829              IF ln_AccumInvReturn          > li_MaxWithdrawalAmt
382800200829                COMPUTE li_MaxWithdrawalAmt = ln_AccumInvReturn
382900200829              END-IF
383000200829              IF ln_ReferenceBalance_lk     > li_MaxWithdrawalAmt
383100200829                COMPUTE li_MaxWithdrawalAmt = ln_ReferenceBalance_lk
383200200829              END-IF
383300200829           END-IF.
383400200829
383500200829           IF li_AcctAge_lk >= 1
383600200829              COMPUTE li_MaxWithdrawalAmt   = li_MinWithdrawalAmt
383700200829              IF ln_PrevYearInvReturn       > li_MaxWithdrawalAmt
383800200829                COMPUTE li_MaxWithdrawalAmt = ln_PrevYearInvReturn
383900200829              END-IF
384000200829              IF ln_AccumInvReturn          > li_MaxWithdrawalAmt
384100200829                COMPUTE li_MaxWithdrawalAmt = ln_AccumInvReturn
384200200829              END-IF
384300200829           END-IF.
384400200829
38450020082967029  Calculate-Carry-Over.
384600200829
38470020082967929      Initialize ln-CarryOverAmt.
384800200829
38490020082967029      Perform Get-Calculation-Rule.
385000200829
38510020082967029      If lc_CalRule = '4'
38520020082967929         Compute ln-CarryOverAmt = li_PrevMaxWithdrawalAmt
38530020082967029                                 - ln_GrossAmtPaidOut
38540020082967029         If ln-CarryOverAmt < 0
38550020082967029            Move 0 to ln-CarryOverAmt
38560020082967029         End-If
38570020082967029      End-If.
385800200829
385900200829       Get-LRIF-Initial-Trade.
386000200829
386100200829           INITIALIZE li_TradeDateInit.
386200200829
386300200829           EXEC SQL
38640020082985276        With Mfatrnp_subset as
386500200829  |              (Select * from Mfatrnp
386600200829  |                Where Account_no = :li_CurrAccountNo AND
386700200829  |                      Trans_type_code IN
386800200829  |                       (:lncc_BUY, :lncc_SWI, :lncc_TRI)      AND
386900200829  |                      Trans_status_code IN
387000200829  |                       (:lncc_HST, :lncc_HSC)                 AND
387100200829  |                      Reverse <> :lncc_Yes
38720020082985276            )
387300200829            SELECT COALESCE(MIN(A.Trade_Date), 0)
387400200829              INTO :li_TradeDateInit
38750020082985276 *       FROM MFATRNP A, MFACNTRRP B
38760020082985276         FROM Mfatrnp_subset A INNER JOIN Mfacntrrp B
38770020082985276              ON B.Account_type_code = :lc_CurrAccountTypeCode AND
38780020082985276                 B.Contr_redem_code = A.Contr_redem_code
38790020082985276 *      WHERE A.Account_No = :li_CurrAccountNo
38800020082985276 *        AND A.Trans_Type_Code IN (:lncc_BUY,:lncc_SWI,:lncc_TRI)
38810020082985276 *        AND A.Trans_Status_Code IN (:lncc_HST,:lncc_HSC)
38820020082985276 *        AND A.Reverse <> :lncc_Y
38830020082985276 *        AND A.Contr_Redem_Code  = B.Contr_Redem_Code
38840020082985276        WHERE
38850020082985276 *            B.Account_Type_Code = :lc_CurrAccountTypeCode
38860020082973715 *        AND B.Contr_Redem_Code_Rule IN (:lncc_28,:lncc_43)
38870020082985276              B.Contr_Redem_Code_Rule IN
38880020082973715              (:lncc_28, :lncc_43, :lncc_88)
388900200829           END-EXEC.
389000200829
389100200829           MOVE SQLSTATE TO Ws-Sql-States.
389200200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
389300200829              SET Ws-Err-23 TO TRUE
389400200829              SET lncc_ErrCodeDescr23 TO TRUE
389500200829              PERFORM Set-Internal-Error
389600200829              PERFORM Dsp-Error
389700200829           END-IF.
389800200829
389900200829       Get-Amt-Paid-Out-LIF-Acct-lk.
390000200829
390100200829           INITIALIZE ln_GrossAmtPaidOut.
390200200829
39030020082985276 * Commented lines below and replaced
390400200829  |   *    EXEC SQL
390500200829  |   *      SELECT COALESCE(
390600200829  |   *             SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
390700200829  |   *                      THEN DECIMAL(ROUND(Trnp.Gross_Amt /
390800200829  |   *                           COALESCE(Exrhmp.Exchange_Rate,1)
390900200829  |   *                           ,2),13,2)
391000200829  |   *                      ELSE Trnp.Gross_Amt
391100200829  |   *                 END), 0)
391200200829  |   *        INTO :ln_GrossAmtPaidOut
391300200829  |   *        FROM Mfatrnp Trnp,
391400200829  |   *             Mfainvp Invp
391500200829  |   *             LEFT OUTER JOIN Mfaexrhmp Exrhmp
391600200829  |   *               ON Exrhmp.Currency = Invp.Currency AND
391700200829  |   *                  Exrhmp.Trade_Date = Trnp.Trade_Date AND
391800200829  |   *                  Exrhmp.Exchange_Rate_Type =
391900200829  |   *                  :lc_ExchangeRateType
392000200829  |   *             LEFT OUTER JOIN MFACNTRRP cntrrp
392100200829  |   *               ON cntrrp.Account_Type_Code =
392200200829  |   *                  :lc_CurrAccountTypeCode  AND
392300200829  |   *                  cntrrp.Contr_Redem_Code  =
392400200829  |   *                  trnp.Contr_Redem_Code
392500200829  |   *       WHERE Trnp.Account_No = :li_CurrAccountNo           AND
392600200829  |   *             Trnp.Trans_Type_Code IN
392700200829  |   *             (:lncc_SEL, :lncc_SWO, :lncc_TRO)             AND
392800200829  |   *             Trnp.Trans_Status_Code IN
392900200829  |   *             (:lncc_HST, :lncc_HSC)                        AND
393000200829  |   *             Trnp.Reverse <> :lncc_Yes                     AND
393100200829  |   *             Trnp.Trade_Date BETWEEN
393200200829  |   *             :li_YearStartDate AND :li_YearEndDate         AND
393300200829  |   *             Trnp.Investment_Code = Invp.Investment_Code   AND
393400200829  |   *             cntrrp.Contr_Redem_Code_Rule  IN
39350020082973715 *             (:lncc_26, :lncc_27, :lncc_28, :lncc_43)
393600200829  |   *             (:lncc_26, :lncc_27, :lncc_28, :lncc_43, :lncc_88)
393700200829  |   *    END-EXEC.
393800200829
39390020082985276      Exec Sql
394000200829  |          With Mfatrnp_subset as
394100200829  |              (Select * from Mfatrnp
394200200829  |                Where Account_no = :li_CurrAccountNo AND
394300200829  |                      Trade_date BETWEEN
394400200829  |                        :li_YearStartDate AND :li_YearEndDate AND
394500200829  |                      Trans_type_code IN
394600200829  |                       (:lncc_SEL, :lncc_SWO, :lncc_TRO)      AND
394700200829  |                      Trans_status_code IN
394800200829  |                       (:lncc_HST, :lncc_HSC)                 AND
394900200829  |                      Reverse <> :lncc_Yes
395000200829  |              )
395100200829  |          Select Coalesce(
395200200829  |                 SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
395300200829  |                          THEN DECIMAL(ROUND(Trnp.Gross_Amt /
395400200829  |                               COALESCE(Exrhmp.Exchange_Rate,1)
395500200829  |                               ,2),13,2)
395600200829  |                          ELSE Trnp.Gross_Amt
395700200829  |                     END), 0)
395800200829  |            INTO :ln_GrossAmtPaidOut
395900200829  |            FROM Mfatrnp_subset Trnp
396000200829  |                 INNER JOIN Mfainvp Invp
396100200829  |                 ON Trnp.Investment_code = Invp.Investment_code
396200200829  |                 LEFT OUTER JOIN Mfaexrhmp Exrhmp
396300200829  |                   ON Exrhmp.Currency = Invp.Currency AND
396400200829  |                      Exrhmp.Trade_Date = Trnp.Trade_Date AND
396500200829  |                      Exrhmp.Exchange_Rate_Type =
396600200829  |                      :lc_ExchangeRateType
396700200829  |                 LEFT OUTER JOIN MFACNTRRP cntrrp
396800200829  |                   ON cntrrp.Account_Type_Code =
396900200829  |                      :lc_CurrAccountTypeCode  AND
397000200829  |                      cntrrp.Contr_Redem_Code  =
397100200829  |                      trnp.Contr_Redem_Code
397200200829  |           WHERE cntrrp.Contr_Redem_Code_Rule  IN
397300200829  |                 (:lncc_26, :lncc_27, :lncc_28, :lncc_43, :lncc_88)
39740020082985276      End-exec.
397500200829
397600200829           MOVE SQLSTATE TO Ws-Sql-States.
397700200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
397800200829              SET Ws-Err-24 TO TRUE
397900200829              SET lncc_ErrCodeDescr16 TO TRUE
398000200829              PERFORM Set-Internal-Error
398100200829              PERFORM Dsp-Error
398200200829           END-IF.
398300200829
398400200829       Get-Amt-Came-Into-LIF-Acct-lk.
398500200829
398600200829           INITIALIZE ln_GrossAmtCameInto.
398700200829
39880020082985276 * Commented lines below and replaced
398900200829  |   *    EXEC SQL
399000200829  |   *      SELECT COALESCE(
399100200829  |   *             SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
399200200829  |   *                      THEN DECIMAL(ROUND(Trnp.Gross_Amt /
399300200829  |   *                           COALESCE(Exrhmp.Exchange_Rate,1)
399400200829  |   *                           ,2),13,2)
399500200829  |   *                      ELSE Trnp.Gross_Amt
399600200829  |   *                 END), 0)
399700200829  |   *        INTO :ln_GrossAmtCameInto
399800200829  |   *        FROM Mfatrnp Trnp,
399900200829  |   *             Mfainvp Invp
400000200829  |   *             LEFT OUTER JOIN Mfaexrhmp Exrhmp
400100200829  |   *               ON Exrhmp.Currency = Invp.Currency AND
400200200829  |   *                  Exrhmp.Trade_Date = Trnp.Trade_Date AND
400300200829  |   *                  Exrhmp.Exchange_Rate_Type =
400400200829  |   *                  :lc_ExchangeRateType
400500200829  |   *             LEFT OUTER JOIN MFACNTRRP cntrrp
400600200829  |   *               ON cntrrp.Account_Type_Code =
400700200829  |   *                  :lc_CurrAccountTypeCode  AND
400800200829  |   *                  cntrrp.Contr_Redem_Code  =
400900200829  |   *                  trnp.Contr_Redem_Code
401000200829  |   *       WHERE Trnp.Account_No = :li_CurrAccountNo           AND
401100200829  |   *             Trnp.Trans_Type_Code IN
401200200829  |   *             (:lncc_BUY, :lncc_SWI, :lncc_TRI)             AND
401300200829  |   *             Trnp.Trans_Status_Code IN
401400200829  |   *             (:lncc_HST, :lncc_HSC)                        AND
401500200829  |   *             Trnp.Reverse <> :lncc_Yes                     AND
401600200829  |   *             Trnp.Trade_Date BETWEEN
401700200829  |   *             :li_YearStartDate AND :li_YearEndDate         AND
401800200829  |   *             Trnp.Investment_Code = Invp.Investment_Code   AND
401900200829  |   *             cntrrp.Contr_Redem_Code_Rule  IN
40200020082973715 *             (:lncc_28, :lncc_43)
402100200829  |   *             (:lncc_28, :lncc_43, :lncc_88)
40220020082985276 *    END-EXEC.
402300200829
40240020082985276      Exec Sql
402500200829  |          With Mfatrnp_subset as
402600200829  |              (Select * from Mfatrnp
402700200829  |                Where Account_no = :li_CurrAccountNo AND
402800200829  |                      Trade_date BETWEEN
402900200829  |                        :li_YearStartDate AND :li_YearEndDate AND
403000200829  |                      Trans_type_code IN
403100200829  |                       (:lncc_BUY, :lncc_SWI, :lncc_TRI)      AND
403200200829  |                      Trans_status_code IN
403300200829  |                       (:lncc_HST, :lncc_HSC)                 AND
403400200829  |                      Reverse <> :lncc_Yes
403500200829  |              )
403600200829  |          Select Coalesce(
403700200829  |                 SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
403800200829  |                          THEN DECIMAL(ROUND(Trnp.Gross_Amt /
403900200829  |                               COALESCE(Exrhmp.Exchange_Rate,1)
404000200829  |                               ,2),13,2)
404100200829  |                          ELSE Trnp.Gross_Amt
404200200829  |                     END), 0)
404300200829  |            INTO :ln_GrossAmtCameInto
404400200829  |            FROM Mfatrnp_subset Trnp
404500200829  |                 INNER JOIN Mfainvp Invp
404600200829  |                 ON Trnp.Investment_code = Invp.Investment_code
404700200829  |                 LEFT OUTER JOIN Mfaexrhmp Exrhmp
404800200829  |                   ON Exrhmp.Currency = Invp.Currency AND
404900200829  |                      Exrhmp.Trade_Date = Trnp.Trade_Date AND
405000200829  |                      Exrhmp.Exchange_Rate_Type =
405100200829  |                      :lc_ExchangeRateType
405200200829  |                 LEFT OUTER JOIN MFACNTRRP cntrrp
405300200829  |                   ON cntrrp.Account_Type_Code =
405400200829  |                      :lc_CurrAccountTypeCode  AND
405500200829  |                      cntrrp.Contr_Redem_Code  =
405600200829  |                      trnp.Contr_Redem_Code
405700200829  |           WHERE cntrrp.Contr_Redem_Code_Rule  IN
405800200829  |                 (:lncc_28, :lncc_43, :lncc_88)
40590020082985276      End-exec.
406000200829
406100200829           MOVE SQLSTATE TO Ws-Sql-States.
406200200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
406300200829              SET Ws-Err-25 TO TRUE
406400200829              SET lncc_ErrCodeDescr16 TO TRUE
406500200829              PERFORM Set-Internal-Error
406600200829              PERFORM Dsp-Error
406700200829           END-IF.
406800200829
406900200829       Get-Amt-Paid-Out-LTD.
407000200829
407100200829           INITIALIZE ln_GrossAmtPaidOut_LTD.
407200200829
40730020082985276 * Commented lines below and replaced
407400200829  |   *    EXEC SQL
407500200829  |   *      SELECT COALESCE(
407600200829  |   *             SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
407700200829  |   *                      THEN DECIMAL(ROUND(Trnp.Gross_Amt /
407800200829  |   *                           COALESCE(Exrhmp.Exchange_Rate,1)
407900200829  |   *                           ,2),13,2)
408000200829  |   *                      ELSE Trnp.Gross_Amt
408100200829  |   *                 END), 0)
408200200829  |   *        INTO :ln_GrossAmtPaidOut_LTD
408300200829  |   *        FROM Mfatrnp Trnp,
408400200829  |   *             Mfainvp Invp
408500200829  |   *             LEFT OUTER JOIN Mfaexrhmp Exrhmp
408600200829  |   *               ON Exrhmp.Currency = Invp.Currency AND
408700200829  |   *                  Exrhmp.Trade_Date = Trnp.Trade_Date AND
408800200829  |   *                  Exrhmp.Exchange_Rate_Type =
408900200829  |   *                  :lc_ExchangeRateType
409000200829  |   *             LEFT OUTER JOIN MFACNTRRP cntrrp
409100200829  |   *               ON cntrrp.Account_Type_Code =
409200200829  |   *                  :lc_CurrAccountTypeCode  AND
409300200829  |   *                  cntrrp.Contr_Redem_Code  =
409400200829  |   *                  trnp.Contr_Redem_Code
409500200829  |   *       WHERE Trnp.Account_No = :li_CurrAccountNo           AND
409600200829  |   *             Trnp.Trans_Type_Code IN
409700200829  |   *             (:lncc_SEL, :lncc_SWO, :lncc_TRO)             AND
409800200829  |   *             Trnp.Trans_Status_Code IN
409900200829  |   *             (:lncc_HST, :lncc_HSC)                        AND
410000200829  |   *             Trnp.Reverse <> :lncc_Yes                     AND
410100200829  |   *             Trnp.Investment_Code = Invp.Investment_Code   AND
410200200829  |   *             cntrrp.Contr_Redem_Code_Rule  IN
41030020082973715 *             (:lncc_28, :lncc_43)
410400200829  |   *             (:lncc_28, :lncc_43, :lncc_88)
41050020082985276 *    END-EXEC.
410600200829
41070020082985276      Exec Sql
410800200829  |          With Mfatrnp_subset as
410900200829  |              (Select * from Mfatrnp
411000200829  |                Where Account_no = :li_CurrAccountNo AND
411100200829  |                      Trans_type_code IN
411200200829  |                       (:lncc_SEL, :lncc_SWO, :lncc_TRO)      AND
411300200829  |                      Trans_status_code IN
411400200829  |                       (:lncc_HST, :lncc_HSC)                 AND
411500200829  |                      Reverse <> :lncc_Yes
411600200829  |              )
411700200829  |          Select Coalesce(
411800200829  |                 SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
411900200829  |                          THEN DECIMAL(ROUND(Trnp.Gross_Amt /
412000200829  |                               COALESCE(Exrhmp.Exchange_Rate,1)
412100200829  |                               ,2),13,2)
412200200829  |                          ELSE Trnp.Gross_Amt
412300200829  |                     END), 0)
412400200829  |            INTO :ln_GrossAmtPaidOut_LTD
412500200829  |            FROM Mfatrnp_subset Trnp
412600200829  |                 INNER JOIN Mfainvp Invp
412700200829  |                 ON Trnp.Investment_code = Invp.Investment_code
412800200829  |                 LEFT OUTER JOIN Mfaexrhmp Exrhmp
412900200829  |                   ON Exrhmp.Currency = Invp.Currency AND
413000200829  |                      Exrhmp.Trade_Date = Trnp.Trade_Date AND
413100200829  |                      Exrhmp.Exchange_Rate_Type =
413200200829  |                      :lc_ExchangeRateType
413300200829  |                 LEFT OUTER JOIN MFACNTRRP cntrrp
413400200829  |                   ON cntrrp.Account_Type_Code =
413500200829  |                      :lc_CurrAccountTypeCode  AND
413600200829  |                      cntrrp.Contr_Redem_Code  =
413700200829  |                      trnp.Contr_Redem_Code
413800200829  |           WHERE cntrrp.Contr_Redem_Code_Rule  IN
413900200829  |                 (:lncc_28, :lncc_43, :lncc_88)
41400020082985276      End-exec.
414100200829
414200200829           MOVE SQLSTATE TO Ws-Sql-States.
414300200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
414400200829              SET Ws-Err-26 TO TRUE
414500200829              SET lncc_ErrCodeDescr16 TO TRUE
414600200829              PERFORM Set-Internal-Error
414700200829              PERFORM Dsp-Error
414800200829           END-IF.
414900200829
415000200829       Get-Amt-Came-Into-LTD.
415100200829
415200200829           INITIALIZE ln_GrossAmtCameInto_LTD.
415300200829
41540020082985276 * Commented lines below and replaced
415500200829  |   *    EXEC SQL
415600200829  |   *      SELECT COALESCE(
415700200829  |   *             SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
415800200829  |   *                      THEN DECIMAL(ROUND(Trnp.Gross_Amt /
415900200829  |   *                           COALESCE(Exrhmp.Exchange_Rate,1)
416000200829  |   *                           ,2),13,2)
416100200829  |   *                      ELSE Trnp.Gross_Amt
416200200829  |   *                 END), 0)
416300200829  |   *        INTO :ln_GrossAmtCameInto_LTD
416400200829  |   *        FROM Mfatrnp Trnp,
416500200829  |   *             Mfainvp Invp
416600200829  |   *             LEFT OUTER JOIN Mfaexrhmp Exrhmp
416700200829  |   *               ON Exrhmp.Currency = Invp.Currency AND
416800200829  |   *                  Exrhmp.Trade_Date = Trnp.Trade_Date AND
416900200829  |   *                  Exrhmp.Exchange_Rate_Type =
417000200829  |   *                  :lc_ExchangeRateType
417100200829  |   *             LEFT OUTER JOIN MFACNTRRP cntrrp
417200200829  |   *               ON cntrrp.Account_Type_Code =
417300200829  |   *                  :lc_CurrAccountTypeCode  AND
417400200829  |   *                  cntrrp.Contr_Redem_Code  =
417500200829  |   *                  trnp.Contr_Redem_Code
417600200829  |   *       WHERE Trnp.Account_No = :li_CurrAccountNo           AND
417700200829  |   *             Trnp.Trans_Type_Code IN
417800200829  |   *             (:lncc_BUY, :lncc_SWI, :lncc_TRI)             AND
417900200829  |   *             Trnp.Trans_Status_Code IN
418000200829  |   *             (:lncc_HST, :lncc_HSC)                        AND
418100200829  |   *             Trnp.Reverse <> :lncc_Yes                     AND
418200200829  |   *             Trnp.Investment_Code = Invp.Investment_Code   AND
418300200829  |   *             cntrrp.Contr_Redem_Code_Rule  IN
41840020082973715 *             (:lncc_28, :lncc_43)
418500200829  |   *             (:lncc_28, :lncc_43, :lncc_88)
41860020082985276 *    END-EXEC.
418700200829
41880020082985276      Exec Sql
418900200829  |          With Mfatrnp_subset as
419000200829  |              (Select * from Mfatrnp
419100200829  |                Where Account_no = :li_CurrAccountNo AND
419200200829  |                      Trans_type_code IN
419300200829  |                       (:lncc_BUY, :lncc_SWI, :lncc_TRI)      AND
419400200829  |                      Trans_status_code IN
419500200829  |                       (:lncc_HST, :lncc_HSC)                 AND
419600200829  |                      Reverse <> :lncc_Yes
419700200829  |              )
419800200829  |          Select Coalesce(
419900200829  |                 SUM(CASE WHEN Invp.Currency <> :lncc_BaseCurrency
420000200829  |                          THEN DECIMAL(ROUND(Trnp.Gross_Amt /
420100200829  |                               COALESCE(Exrhmp.Exchange_Rate,1)
420200200829  |                               ,2),13,2)
420300200829  |                          ELSE Trnp.Gross_Amt
420400200829  |                     END), 0)
420500200829  |            INTO :ln_GrossAmtCameInto_LTD
420600200829  |            FROM Mfatrnp_subset Trnp
420700200829  |                 INNER JOIN Mfainvp Invp
420800200829  |                 ON Trnp.Investment_code = Invp.Investment_code
420900200829  |                 LEFT OUTER JOIN Mfaexrhmp Exrhmp
421000200829  |                   ON Exrhmp.Currency = Invp.Currency AND
421100200829  |                      Exrhmp.Trade_Date = Trnp.Trade_Date AND
421200200829  |                      Exrhmp.Exchange_Rate_Type =
421300200829  |                      :lc_ExchangeRateType
421400200829  |                 LEFT OUTER JOIN MFACNTRRP cntrrp
421500200829  |                   ON cntrrp.Account_Type_Code =
421600200829  |                      :lc_CurrAccountTypeCode  AND
421700200829  |                      cntrrp.Contr_Redem_Code  =
421800200829  |                      trnp.Contr_Redem_Code
421900200829  |           WHERE cntrrp.Contr_Redem_Code_Rule  IN
422000200829  |                 (:lncc_28, :lncc_43, :lncc_88)
42210020082985276      End-exec.
422200200829
422300200829           MOVE SQLSTATE TO Ws-Sql-States.
422400200829           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
422500200829              SET Ws-Err-27 TO TRUE
422600200829              SET lncc_ErrCodeDescr16 TO TRUE
422700200829              PERFORM Set-Internal-Error
422800200829              PERFORM Dsp-Error
422900200829           END-IF.
423000200829
423100200829       Calc-Accumulated-Inv-Return.
423200200829
423300200829           INITIALIZE ln_AccumInvReturn.
423400200829
423500200829           COMPUTE ln_AccumInvReturn =
42360020082967029              ln-CarryOverAmt           +
423700200829                   li_MarketValue            +
423800200829                   ln_GrossAmtPaidOut_LTD    -
423900200829                   ln_GrossAmtCameInto_LTD
424000200829           END-COMPUTE.
424100200829
42420020082967029      Move 0 to ln-CarryOverAmt.
424300200829
424400200829       Calc-Prev-Year-Inv-Return.
424500200829
424600200829           INITIALIZE ln_PrevYearInvReturn
424700200829                      ln_PrevYearInvReturnYear2.
424800200829
424900200829           COMPUTE ln_PrevYearInvReturnYear2 =
425000200829                   li_MarketValue -
425100200829                   ln_GrossAmtCameInto  +  ln_GrossAmtPaidOut
425200200829           END-COMPUTE.
425300200829
425400200829           COMPUTE ln_PrevYearInvReturn =
425500200829                   li_MarketValue - ln_LastYearMV -
425600200829                   ln_GrossAmtCameInto  +  ln_GrossAmtPaidOut
425700200829           END-COMPUTE.
425800200829
425900200829       Calc-Reference-Rate-lk.
426000200829
426100200829           INITIALIZE ln_ReferenceBalance_lk.
426200200829
426300200829           COMPUTE ln_ReferenceBalance_lk =
426400200829                   li_MarketValue * (ln_ReferenceRateNum6Dec / 100)
426500200829           END-COMPUTE.
426600200829
426700200829      * 54661 - ends.
426800200829
426900200829       Set-Internal-Error.
427000200829           MOVE lc_ErrorCodeDescr TO Ws-Sql-Err-Short-Descr.
427100200829           MOVE SQLSTATE TO Ws-Sqlstate.
427200200829
427300200829       End-Job.
427400200829           IF lncc_CursorOpenedYes
427500200829              EXEC SQL
427600200829                   CLOSE c_Lif
427700200829              END-EXEC
427800200829           END-IF.
427900200829
428000200829R58577     CLOSE LIF-WITHDRAWAL-FORMULA
428100200829
428200200829           GOBACK.
428300200829
428400200829      *   RFS 88522 Begins -  New routine for Formula Calculation
428500200829        Recalc-Max-Withdrawal-Amt-Temp.
428600200829           INITIALIZE li_MaxWithdrawalAmtTemp.
428700200829           COMPUTE li_MaxWithdrawalAmtTemp =
428800200829                   li_MarketValue                       -
428900200829                   ln_LastYearMV                        +
429000200829                   ln_GrossAmtPaidOut                   -
429100200829                   ln_GrossAmtCameInto                  +
429200200829                   ln_InvReturnRecv.
429300200829      *   RFS 88522 Ends.
429400200829
42950020082985276  Get-YTD-Payout.
429600200829  |        INITIALIZE li_MinAmt li_ExcAmt li_GrossYTD.
429700200829  |
429800200829  |        Exec Sql
429900200829  |             Select Coalesce(Min_withdrawal_amt, 0),
430000200829  |                    Coalesce(Excess_payment_amt, 0),
430100200829  |                    Coalesce(Gross_ytd_total_paid, 0)
430200200829  |               Into :li_MinAmt,
430300200829  |                    :li_ExcAmt,
430400200829  |                    :li_GrossYTD
430500200829  |               From Mfaaclifp
430600200829  |              Where Account_no = :pi_AccountNum
430700200829  |        End-exec.
430800200829  |
430900200829  |        MOVE SQLSTATE TO Ws-Sql-States.
431000200829  |        IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
431100200829  |           CONTINUE
43120020082985276      END-IF.
431300200829
431400200829           COMPUTE li_RemainAmt = li_MinAmt + li_ExcAmt - li_GrossYTD.
431500200829           IF li_RemainAmt < 0
431600200829              COMPUTE li_RemainAmt = 0
431700200829           END-IF.
431800200829
431900200829      * Start - RFS88038
432000200829      *************************************************************
432100200829       GetGLWBInfo.
432200200829      *************************************************************
432300200829
432400200829           PERFORM CheckGLWBSplitOption
432500200829           IF  lncc_GLWB-Calculation
432600200829      * RFS105383 - Begin: get li_MaxWithdrawalAmt  for the account
432700200829                PERFORM getMaxWithdrawalAmt
432800200829      * RFS105383 - End
432900200829                PERFORM CalcGLWBAmt
433000200829                PERFORM GetAWDValues
433100200829                PERFORM CalcAWDAmtDetail
433200200829           END-IF.
433300200829
433400200829      * RFS105383 - Initialization
433500200829      * ---------------------------------
433600200829       InitforGLWBSplit.
433700200829      * ---------------------------------
433800200829           Initialize
433900200829                      lncc_GLWBFund
434000200829                      li_NoOfGLWBCont.
434100200829           MOVE lncc_N   TO lc_nonGLWBFundExists
434200200829                            lncc_Is-It-A-GLWB-Calculation,
434300200829                            lc_GLWBOnly
434400200829                            lc_BASEOnly.
434500200829
434600200829      * Get li_MaxWithdrawalAmt, which is used in calulations,
434700200829      *   from Lif file.
434800200829      * ---------------------------------
434900200829       getMaxWithdrawalAmt.
435000200829      * ---------------------------------
435100200829           INITIALIZE li_MaxWithdrawalAmt
435200200829      *
435300200829           EXEC SQL
435400200829             SELECT Max_Withdrawal_Amt
435500200829             INTO  :li_MaxWithdrawalAmt
435600200829             FROM MFAACLIFP
435700200829             WHERE Account_No = :li_DtlAccountNo
435800200829           END-EXEC.
435900200829      * RFS105383 - End
436000200829
436100200829      *************************************************************
436200200829        CheckGLWBSplitOption.
436300200829      *************************************************************
436400200829      * RFS105383 - Begin: move the intitialization to seperate
436500200829      *   paragraph.
436600200829      * ---------------------------------------------------------------
436700200829      *    Initialize lncc_Is-It-A-GLWB-Calculation,
436800200829      *               lncc_OptBlankExists,
436900200829      *               li_NoOfGLWBCont.
437000200829      *
437100200829      * ---------------------------------------------------------------
437200200829      * Change the code below to be the same as in ACCRIF2
437300200829      * ---------------------------------------------------------------
437400200829      *
437500200829      *    EXEC SQL
437600200829      *         SELECT :lncc_YES INTO : lncc_Is-It-A-GLWB-Calculation
437700200829      *         FROM MFAACCONP ACCONP
437800200829      *         INNER JOIN MFASERRLP SERRLP ON
437900200829      *         ACCONP.INVESTMENT_SERIES = SERRLP.INVESTMENT_SERIES
438000200829      *         WHERE ACCONP.ACCOUNT_NO  = :li_DtlAccountNo AND
438100200829      *               ACCONP.Investment_Series <> :lncc_Space AND
438200200829      *               ACCONP.AWD_Option in ("F", "G", "O", "C") AND
438300200829      *               ACCONP.Contract_Status <> :lncc_C AND
438400200829      *               SUBSTR(SERRLP.SERIES_RULES, 70, 4) = :lncc_GLWB
438500200829      *         FETCH FIRST ROW ONLY
438600200829      *    END-EXEC.
438700200829      * ---------------------------------------------------------------
438800200829           EXEC SQL
438900200829             SELECT :lncc_YES INTO : lncc_Is-It-A-GLWB-Calculation
439000200829               FROM MFAACLIVP ACLIVP
439100200829      *RFS185170 - Begin
439200200829      *            JOIN MFAINVSGP INVSGP ON
439300200829      *         ACLIVP.INVESTMENT_CODE   = INVSGP.INVESTMENT_CODE
439400200829      *            JOIN MFASERRLP SERRLP ON
439500200829      *         INVSGP.INVESTMENT_SERIES = SERRLP.INVESTMENT_SERIES
439600200829112498*           INNER JOIN MFAACCONP ACCONP ON
439700200829112498*            SERRLP.INVESTMENT_SERIES = ACCONP.INVESTMENT_SERIES
439800200829                  INNER JOIN MFAACCONP ACCONP ON
439900200829                   ACLIVP.ACCOUNT_NO = ACCONP.ACCOUNT_NO
440000200829                  INNER JOIN MFASERRLP SERRLP ON
440100200829                   ACCONP.INVESTMENT_SERIES = SERRLP.INVESTMENT_SERIES
440200200829                  LEFT JOIN MFAINVSGP INVSGP ON
440300200829                   ACLIVP.INVESTMENT_CODE = INVSGP.INVESTMENT_CODE AND
440400200829                   SERRLP.INVESTMENT_SERIES = INVSGP.INVESTMENT_SERIES
440500200829                  LEFT JOIN MFAINVSRP INVSRP ON
440600200829                   ACLIVP.INVESTMENT_CODE = INVSRP.INVESTMENT_CODE AND
440700200829                   SERRLP.INVESTMENT_SERIES = INVSRP.INVESTMENT_SERIES
440800200829      *RFS185170 - End
440900200829             WHERE ACLIVP.ACCOUNT_NO         = :li_DtlAccountNo AND
441000200829      *RFS185170 - Begin
441100200829      *            INVSGP.INVESTMENT_SERIES <> :lncc_Blank      AND
441200200829                    (INVSGP.INVESTMENT_SERIES <> :lncc_Blank OR
441300200829                     INVSRP.INVESTMENT_SERIES <> :lncc_Blank) AND
441400200829      *RFS185170 - End
441500200829                   SUBSTR(SERRLP.Series_Rules, 70, 4) = :lncc_GLWB
441600200829112498             AND ACCONP.ACCOUNT_NO = :li_DtlAccountNo
441700200829  |                AND ACCONP.AWD_OPTION <> " "
441800200829112498             AND ACCONP.CONTRACT_STATUS <> :lncc_C
441900200829             FETCH FIRST ROW ONLY
442000200829           END-EXEC.
442100200829
442200200829      * Select non-GLWB: Blank or BASE
442300200829           EXEC SQL
442400200829             SELECT :lncc_YES
442500200829                        INTO :lc_nonGLWBFundExists
442600200829             FROM MFAACLIVP AClIVP
442700200829               JOIN MFAINVSGP INVSGP ON
442800200829                 ACLIVP.INVESTMENT_CODE     = INVSGP.INVESTMENT_CODE
442900200829               LEFT OUTER JOIN MFASERRLP SERRLP ON
443000200829                 INVSGP.INVESTMENT_SERIES   = SERRLP.INVESTMENT_SERIES
443100200829             WHERE ACLIVP.ACCOUNT_NO        = :li_DtlAccountNo AND
443200200829                   INVSGP.INVESTMENT_SERIES <> :lncc_Blank     AND
443300200829                 ( SUBSTR(SERRLP.Series_Rules, 70, 4) IN
443400200829                               (:lncc_BASE, :lncc_Blank) )
443500200829             FETCH FIRST ROW ONLY
443600200829           END-EXEC.
443700200829      * RFS105383 - End
443800200829
443900200829           If lncc_GLWB-Calculation
444000200829             EXEC SQL
444100200829      * RFS105383 - Begin
444200200829      *           SELECT :lncc_YES INTO :lncc_OptBlankExists
444300200829               SELECT :lncc_YES      INTO :lncc_GLWBFund
444400200829      * RFS105383 - End
444500200829101037            FROM MFAACLIVP ACLIVP
444600200829  |               INNER JOIN MFAINVSGP INVSGP ON
444700200829  |                ACLIVP.INVESTMENT_CODE = INVSGP.INVESTMENT_CODE
444800200829      * RFS105383 - Begin
444900200829      *           INNER JOIN MFASERRLP SERRLP ON
445000200829                  LEFT OUTER JOIN MFASERRLP SERRLP ON
445100200829      * RFS105383 - End
445200200829  |                INVSGP.INVESTMENT_SERIES = SERRLP.INVESTMENT_SERIES
445300200829      *RFS185170 - Begin
445400200829               LEFT JOIN MFAINVSRP INVSRP ON
445500200829                   INVSRP.INVESTMENT_CODE = ACRIVP.INVESTMENT_CODE
445600200829               LEFT JOIN MFASERRLP SERRLP2 ON
445700200829                   SERRLP2.INVESTMENT_SERIES = INVSRP.INVESTMENT_SERIES
445800200829      *RFS185170 - End
445900200829  |               WHERE ACLIVP.ACCOUNT_NO = :li_DtlAccountNo     AND
446000200829105383               ACLIVP.INVESTMENT_CODE   = :lc_DtlInvCode   AND
446100200829185170*                 INVSGP.INVESTMENT_SERIES <> :lncc_Blank  AND
446200200829      * RFS105383 - Begin
446300200829  |   *                 SUBSTR(SERRLP.Series_Rules, 70, 4) = :lncc_BASE
446400200829185170*                 SUBSTR(SERRLP.Series_Rules, 70, 4) = :lncc_GLWB
446500200829185170              (SUBSTR(SERRLP.Series_Rules, 70, 4) = :lncc_GLWB OR
446600200829185170               SUBSTR(SERRLP2.Series_Rules, 70, 4) = :lncc_GLWB)
446700200829      * RFS105383 - End
446800200829  |   *           FROM MFAACCONP ACCONP
446900200829  |   *           WHERE ACCONP.ACCOUNT_NO = :li_DtlAccountNo AND
447000200829  |   *                 ACCONP.INVESTMENT_SERIES <> :lncc_Blank  AND
447100200829  |   *                 ACCONP.AWD_OPTION = " " AND
447200200829101037*                 ACCONP.CONTRACT_STATUS <> :lncc_C
447300200829                        FETCH FIRST ROW ONLY
447400200829             END-EXEC
447500200829      * RFS105383 - Begin
447600200829      *      If lncc_OptBlankExistsNo
447700200829             If lncc_GLWBFundNo
447800200829      * RFS105383 - End
447900200829               EXEC SQL
448000200829                   SELECT count (*) INTO :li_NoOfGLWBCont
448100200829                   FROM MFAACCONP ACCONP
448200200829                   INNER JOIN MFASERRLP SERRLP ON
448300200829                   ACCONP.INVESTMENT_SERIES = SERRLP.INVESTMENT_SERIES
448400200829                   WHERE ACCONP.ACCOUNT_NO = :li_DtlAccountNo AND
448500200829                       ACCONP.INVESTMENT_SERIES <> :lncc_Blank  AND
448600200829129478*                ACCONP.AWD_OPTION IN ("F", "G", "O", "C") AND
448700200829129478                 ACCONP.AWD_OPTION IN ("F", "G", "O", "C","L") AND
448800200829                       ACCONP.CONTRACT_STATUS <> :lncc_C AND
448900200829                       SUBSTR(SERRLP.SERIES_RULES, 70, 4) = :lncc_GLWB
449000200829                END-EXEC
449100200829101037          If li_NoOfGLWBCont = 0
449200200829  |                Move 1    To  li_NoOfGLWBCont
449300200829101037          End-If
449400200829             End-If
449500200829           End-If.
449600200829
449700200829      * RFS105383 - Begin: evaluate the flags
449800200829           IF lncc_Is-It-A-GLWB-Calculation = lncc_Yes AND
449900200829              lc_nonGLWBFundExists          = lncc_No
450000200829             MOVE lncc_Yes         TO lc_GLWBOnly
450100200829           END-IF.
450200200829
450300200829           IF lncc_Is-It-A-GLWB-Calculation = lncc_No  AND
450400200829              lc_nonGLWBFundExists          = lncc_Yes
450500200829             MOVE lncc_Yes         TO lc_BASEOnly
450600200829           END-IF.
450700200829      * RFS105383 - End
450800200829
450900200829      *************************************************************
451000200829       CalcGLWBAmt.
451100200829      *************************************************************
451200200829
451300200829           INITIALIZE ln_G-Guar-Withdrawal-Amount,
451400200829                      ln_G-Ytd-Guar-Withdrawal-Amt,
451500200829                      ln_G-Ytd-Excess-Withdrawal,
451600200829                      ln_O-Original-Gwa,
451700200829                      ln_O-Ytd-Guar-Withdrawal-Amt,
451800200829                      ln_O-Ytd-Excess-Withdrawal,
451900200829                      ln_C-Gwa-Rif-Minimum,
452000200829                      ln_C-Ytd-Guar-Withdrawal-Amt,
452100200829                      ln_C-Ytd-Excess-Withdrawal,
452200200829                      ln_F-Awd-Amount,
452300200829                      ln_F-Ytd-Guar-Withdrawal-Amt,
452400200829                      ln_F-Ytd-Excess-Withdrawal,
452500200829                      ln_Eligible-Amount,
452600200829                      ln_Deductibles,
452700200829129478*               ln_GLWB-Contract-Amt-Total
452800200829  |                   ln_GLWB-Contract-Amt-Total,
452900200829  |                   ln_L-Lifetime-Withdrawal-Amt ,
453000200829  |                   ln_L-Ytd-Guar-Withdrawal-Amt ,
453100200829  |                   ln_L-Ytd-Excess-Withdrawal
453200200829129478
453300200829           EXEC SQL
453400200829                SELECT SUM(ACCONP.GUAR_WITHDRAWAL_AMOUNT),
453500200829                       SUM(ACCONP.YTD_GUAR_WITHDRAWAL_AMOUNT),
453600200829                       SUM(ACCONP.YTD_EXCESS_WITHDRAWAL)
453700200829                INTO   : ln_G-Guar-Withdrawal-Amount,
453800200829                       : ln_G-Ytd-Guar-Withdrawal-Amt,
453900200829                       : ln_G-Ytd-Excess-Withdrawal
454000200829                FROM   MFAACCONP ACCONP
454100200829                WHERE  ACCONP.ACCOUNT_NO  = :li_DtlAccountNo AND
454200200829129478*                ACCONP.AWD_OPTION = :lncc_G
454300200829129478                 (ACCONP.AWD_OPTION = :lncc_G
454400200829129478                 OR (ACCONP.AWD_OPTION = :lncc_L
454500200829129478                     AND :lc_GwaCalcRule = :lnc_Rule5
454600200829129478                     AND :lc_AllowMultContFlag <> :lncc_Yes)
454700200829129478                 OR (ACCONP.AWD_OPTION = :lncc_L
454800200829129478                     AND :lc_GwaCalcRule1 = :lnc_Rule5
454900200829129478                     AND :lc_AllowMultContFlag = :lncc_Yes))
455000200829           END-EXEC.
455100200829      *RFS129478 - START
455200200829           EXEC SQL
455300200829               SELECT SUM(ACCONP.LIFETIME_WITHDRAWAL_AMOUNT),
455400200829                      SUM(ACCONP.YTD_GUAR_WITHDRAWAL_AMOUNT),
455500200829                      SUM(ACCONP.YTD_EXCESS_WITHDRAWAL)
455600200829               INTO   : ln_L-Lifetime-Withdrawal-Amt,
455700200829                      : ln_L-Ytd-Guar-Withdrawal-Amt,
455800200829                      : ln_L-Ytd-Excess-Withdrawal
455900200829               FROM   MFAACCONP ACCONP
456000200829               WHERE  ACCONP.ACCOUNT_NO  = :li_DtlAccountNo AND
456100200829                      ACCONP.AWD_OPTION = :lncc_L
456200200829                      AND ((:lc_GwaCalcRule <> :lnc_Rule5
456300200829                           AND :lc_AllowMultContFlag <> :lncc_Yes)
456400200829                       OR  (:lc_GwaCalcRule1 <> :lnc_Rule5
456500200829                           AND :lc_AllowMultContFlag = :lncc_Yes))
456600200829           END-EXEC.
456700200829      * RFS129478 - END
456800200829      *
456900200829           EXEC SQL
457000200829                SELECT SUM(ACCONP.ORIGINAL_GWA),
457100200829                       SUM(ACCONP.YTD_GUAR_WITHDRAWAL_AMOUNT),
457200200829                       SUM(ACCONP.YTD_EXCESS_WITHDRAWAL)
457300200829                INTO   : ln_O-Original-Gwa,
457400200829                       : ln_O-Ytd-Guar-Withdrawal-Amt,
457500200829                       : ln_O-Ytd-Excess-Withdrawal
457600200829                FROM   MFAACCONP ACCONP
457700200829                WHERE  ACCONP.ACCOUNT_NO  = :li_DtlAccountNo AND
457800200829                       ACCONP.AWD_OPTION = :lncc_O
457900200829           END-EXEC.
458000200829      *
458100200829           EXEC SQL
458200200829                SELECT SUM(ACCONP.GWA_RIF_MINIMUM),
458300200829                       SUM(ACCONP.YTD_GUAR_WITHDRAWAL_AMOUNT),
458400200829                       SUM(ACCONP.YTD_EXCESS_WITHDRAWAL)
458500200829                INTO   : ln_C-Gwa-Rif-Minimum,
458600200829                       : ln_C-Ytd-Guar-Withdrawal-Amt,
458700200829                       : ln_C-Ytd-Excess-Withdrawal
458800200829                FROM   MFAACCONP ACCONP
458900200829                WHERE  ACCONP.ACCOUNT_NO  = :li_DtlAccountNo AND
459000200829                       ACCONP.AWD_OPTION = :lncc_C
459100200829           END-EXEC.
459200200829      *
459300200829           EXEC SQL
459400200829                SELECT SUM(ACCONP.AWD_AMOUNT),
459500200829                       SUM(ACCONP.YTD_GUAR_WITHDRAWAL_AMOUNT),
459600200829                       SUM(ACCONP.YTD_EXCESS_WITHDRAWAL)
459700200829                INTO   : ln_F-Awd-Amount,
459800200829                       : ln_F-Ytd-Guar-Withdrawal-Amt,
459900200829                       : ln_F-Ytd-Excess-Withdrawal
460000200829                FROM   MFAACCONP ACCONP
460100200829                WHERE  ACCONP.ACCOUNT_NO  = :li_DtlAccountNo AND
460200200829                       ACCONP.AWD_OPTION = :lncc_F
460300200829           END-EXEC.
460400200829      *
460500200829           EXEC SQL
460600200829                SELECT SUM(ACCONP.GUAR_WITHDRAWAL_AMOUNT),
460700200829                       SUM(ACCONP.YTD_GUAR_WITHDRAWAL_AMOUNT),
460800200829                       SUM(ACCONP.YTD_EXCESS_WITHDRAWAL)
460900200829                INTO   : ln_G-Guar-Withdrawal-Amount,
461000200829                       : ln_G-Ytd-Guar-Withdrawal-Amt,
461100200829                       : ln_G-Ytd-Excess-Withdrawal
461200200829                FROM   MFAACCONP ACCONP
461300200829                WHERE  ACCONP.ACCOUNT_NO  = :li_DtlAccountNo AND
461400200829                       ACCONP.AWD_OPTION = :lncc_G
461500200829           END-EXEC.
461600200829           COMPUTE ln_Eligible-Amount = ln_G-Guar-Withdrawal-Amount +
461700200829                   ln_O-Original-Gwa + ln_C-Gwa-Rif-Minimum +
461800200829                   ln_F-Awd-Amount
461900200829129478           + ln_L-Lifetime-Withdrawal-Amt
462000200829
462100200829           COMPUTE ln_Deductibles = ln_G-Ytd-Guar-Withdrawal-Amt +
462200200829                                    ln_O-Ytd-Guar-Withdrawal-Amt +
462300200829                                    ln_C-Ytd-Guar-Withdrawal-Amt +
462400200829                                    ln_F-Ytd-Guar-Withdrawal-Amt +
462500200829                                    ln_G-Ytd-Excess-Withdrawal   +
462600200829                                    ln_O-Ytd-Excess-Withdrawal   +
462700200829                                    ln_C-Ytd-Excess-Withdrawal   +
462800200829                                    ln_F-Ytd-Excess-Withdrawal
462900200829129478                            + ln_L-Ytd-Guar-Withdrawal-Amt
463000200829129478                            + ln_L-Ytd-Excess-Withdrawal
463100200829
463200200829           COMPUTE ln_GLWB-Contract-Amt-Total = ln_Eligible-Amount -
463300200829                                                ln_Deductibles.
463400200829
463500200829
463600200829      *************************************************************
463700200829        GetAWDValues.
463800200829      *************************************************************
463900200829
464000200829           INITIALIZE lc_Awd-Option,
464100200829                      ln_Guar-Withdrawal-Amount,
464200200829                      ln_Original-GWA,
464300200829                      ln_GWA-RIF-Minimum,
464400200829                      ln_AWD-Amount,
464500200829                      ln_YTD-Guar-Withdrawal-Amount,
464600200829                      ln_YTD-Excess-Withdrawal.
464700200829
464800200829           EXEC SQL
464900200829                SELECT ACCONP.AWD_Option,
465000200829                       ACCONP.Guar_Withdrawal_Amount,
465100200829                       ACCONP.Original_GWA,
465200200829                       ACCONP.GWA_RIF_Minimum,
465300200829                       ACCONP.AWD_Amount,
465400200829                       ACCONP.YTD_Guar_Withdrawal_Amount,
465500200829129478*                ACCONP.YTD_Excess_Withdrawal
465600200829  |                    ACCONP.YTD_Excess_Withdrawal ,
465700200829129478                 ACCONP.Lifetime_Withdrawal_Amount
465800200829                INTO   :lc_Awd-Option,
465900200829                       :ln_Guar-Withdrawal-Amount,
466000200829                       :ln_Original-GWA,
466100200829                       :ln_GWA-RIF-Minimum,
466200200829                       :ln_AWD-Amount,
466300200829                       :ln_YTD-Guar-Withdrawal-Amount,
466400200829129478*                :ln_YTD-Excess-Withdrawal
466500200829  |                    :ln_YTD-Excess-Withdrawal,
466600200829129478                 :ln_Lifetime-Withdrawal-Amt
466700200829                FROM   MFAACCONP ACCONP
466800200829                INNER JOIN MFAACCCIP ACCCIP
466900200829                      ON ACCCIP.Account_No  = ACCONP.Account_No AND
467000200829                         ACCCIP.Contract_No = ACCONP.Contract_No
467100200829                WHERE ACCCIP.Account_No     = :li_DtlAccountNo AND
467200200829                      ACCCIP.Investment_code = :lc_DtlInvCode
467300200829           END-EXEC.
467400200829
467500200829      *************************************************************
467600200829        CalcAWDAmtDetail.
467700200829      *************************************************************
467800200829
467900200829           INITIALIZE ln_AmtRemain,
468000200829                      ln_RemainingPerCont,
468100200829                      ln_ExcessAmt,
468200200829                      ln_IFPAYAWDAmt,
468300200829                      ln_TAXSELAWDAmt.
468400200829
468500200829      * RFS105383 - Begin
468600200829      *    COMPUTE ln_AWDSplitRatio = li_DtlMinWithdrawalAmt /
468700200829      *                               li_TotalPayout
468800200829           COMPUTE ln_GLWBAmtToBeTaken = ln_GLWB-Contract-Amt-Total
468900200829109552     If lc_GLWBOnly = lncc_Yes
469000200829  |         If li_MaxWithdrawalAmt > 0
469100200829  |          COMPUTE ln_totalPaid = FUNCTION
469200200829  |              MIN(ln_GLWBAmtToBeTaken li_MaxWithdrawalAmt)
469300200829  |         Else
469400200829  |           COMPUTE ln_totalPaid = ln_GLWBAmtToBeTaken
469500200829  |         End-If
469600200829  |        Else
469700200829  |         If li_MaxWithdrawalAmt > 0
469800200829  |          COMPUTE ln_totalPaid = FUNCTION
469900200829  |              MIN(li_totalPayout li_MaxWithdrawalAmt)
470000200829  |         Else
470100200829  |          COMPUTE ln_totalPaid = li_totalPayout
470200200829  |         End-If
470300200829109552     End-If.
470400200829
470500200829      * Change the way Ratio is calculated
470600200829
470700200829           IF ln_totalPaid > li_DtlMinWithdrawalAmt
470800200829             COMPUTE ln_AWDSplitRatio =
470900200829                          li_DtlMinWithdrawalAmt / ln_totalPaid
471000200829           ELSE
471100200829             COMPUTE ln_AWDSplitRatio = 1
471200200829           END-IF
471300200829      *
471400200829      * RFS105383 - End
471500200829
471600200829100853     If ln_GLWB-Contract-Amt-Total > li_TotalPayout
471700200829  |           Compute ln_GLWB-Contract-Amt-Total = li_TotalPayout
471800200829100853     End-If.
471900200829
472000200829      * RFS105383 - Begin
472100200829      *    If lncc_OptBlankExistsNo
472200200829           IF lncc_GLWBFundNo
472300200829      * RFS105383 - End
472400200829                 COMPUTE ln_ExcessAmt = li_TotalPayout -
472500200829                                        ln_GLWB-Contract-Amt-Total
472600200829                 If ln_ExcessAmt > 0
472700200829                   COMPUTE ln_RemainingPerCont Rounded =
472800200829                           ln_ExcessAmt / li_NoOfGLWBCont
472900200829                 Else
473000200829                   Move 0 to ln_RemainingPerCont
473100200829                 End-If
473200200829           End-If.
473300200829
473400200829           IF  lc_Awd-Option = lncc_G
473500200829129478     OR (lc_Awd-Option = lncc_L AND lc_GwaCalcRule1 = lnc_Rule5)
473600200829                COMPUTE ln_AmtRemain = ln_Guar-Withdrawal-Amount +
473700200829                                       ln_RemainingPerCont  -
473800200829                                       ln_YTD-Guar-Withdrawal-Amount -
473900200829                                       ln_YTD-Excess-Withdrawal
474000200829                PERFORM CalcAWDandTax
474100200829           END-IF.
474200200829
474300200829           IF  lc_Awd-Option = lncc_C
474400200829                COMPUTE ln_AmtRemain = ln_GWA-RIF-Minimum   +
474500200829                                       ln_RemainingPerCont  -
474600200829                                       ln_YTD-Guar-Withdrawal-Amount -
474700200829                                       ln_YTD-Excess-Withdrawal
474800200829                PERFORM CalcAWDandTax
474900200829           END-IF.
475000200829
475100200829           IF  lc_Awd-Option = lncc_O
475200200829                COMPUTE ln_AmtRemain = ln_Original-GWA      +
475300200829                                       ln_RemainingPerCont  -
475400200829                                       ln_YTD-Guar-Withdrawal-Amount -
475500200829                                       ln_YTD-Excess-Withdrawal
475600200829                PERFORM CalcAWDandTax
475700200829           END-IF.
475800200829
475900200829           IF  lc_Awd-Option = lncc_F
476000200829                COMPUTE ln_AmtRemain = ln_AWD-Amount                 +
476100200829                                       ln_RemainingPerCont           -
476200200829                                       ln_YTD-Guar-Withdrawal-Amount -
476300200829                                       ln_YTD-Excess-Withdrawal
476400200829                PERFORM CalcAWDandTax
476500200829           END-IF.
476600200829
476700200829      *RFS129478 - Start
476800200829           IF  lc_Awd-Option = lncc_L
476900200829           AND lc_GwaCalcRule1 NOT= lnc_Rule5
477000200829                COMPUTE ln_AmtRemain = ln_Lifetime-Withdrawal-Amt    +
477100200829                                       ln_RemainingPerCont           -
477200200829                                       ln_YTD-Guar-Withdrawal-Amount -
477300200829                                       ln_YTD-Excess-Withdrawal
477400200829                PERFORM CalcAWDandTax
477500200829           END-IF.
477600200829      *RFS129478 - End
477700200829
477800200829           IF  lc_Awd-Option = lncc_Space
477900200829               and li_TotalPayout > ln_GLWB-Contract-Amt-Total
478000200829                COMPUTE ln_AmtRemain = li_TotalPayout                -
478100200829                                       ln_GLWB-Contract-Amt-Total
478200200829                PERFORM CalcAWDandTax
478300200829           END-IF.
478400200829
478500200829129478     PERFORM UpdateAccContractLGWA.
478600200829
478700200829      *************************************************************
478800200829        CalcAWDandTax.
478900200829      *************************************************************
479000200829      *
479100200829      * RFS105383 - Begin
479200200829      *
479300200829      * Set Remaining Amount
479400200829109552*    IF lc_Awd-Option = lncc_F
479500200829      * RFS129478 - Start
479600200829109552*    IF (lc_Awd-Option = lncc_F OR lncc_G OR lncc_C OR lncc_O)
479700200829           IF (lc_Awd-Option = lncc_F OR lncc_G OR lncc_C OR lncc_O
479800200829               OR lncc_L )
479900200829      * RFS129478 - End
480000200829109552        AND li_MaxWithdrawalAmt > 0
480100200829             COMPUTE ln_AmtRemain = FUNCTION
480200200829                 MIN(ln_AmtRemain li_MaxWithdrawalAmt)
480300200829           END-IF
480400200829
480500200829109552     IF lc_Awd-Option = lncc_F OR lncc_G OR lncc_C OR lncc_O
480600200829129478        OR lncc_L
480700200829  |          IF lc_GLWBOnly = Lncc_Yes   AND
480800200829  |             ln_GLWBAmtToBeTaken < li_DtlMinWithdrawalAmt
480900200829  |            COMPUTE ln_AmtRemain = FUNCTION
481000200829  |                MAX(ln_AmtRemain li_DtlMinWithdrawalAmt)
481100200829  |          END-IF
481200200829109552     END-IF
481300200829      *
481400200829           COMPUTE ln_PeriodicAmt ROUNDED =
481500200829               ln_AmtRemain * li_DtlAnnualAmt / li_PayPerAnnum / 100
481600200829
481700200829           COMPUTE ln_IFPAYAWDAmt  ROUNDED =
481800200829               ln_AWDSplitRatio * ln_PeriodicAmt
481900200829
482000200829           COMPUTE ln_TAXSELAWDAmt ROUNDED =
482100200829               ln_PeriodicAmt - ln_IFPAYAWDAmt.
482200200829
482300200829      * ---------------------------------------------------------------
482400200829      *    COMPUTE ln_IFPAYAWDAmt  ROUNDED =
482500200829      *                              ln_AWDSplitRatio *
482600200829      *                              ln_AmtRemain     *
482700200829      *                              (li_DtlAnnualAmt  / 100) /
482800200829      *                              Pi_PayPerAnnum
482900200829      *
483000200829      *    COMPUTE ln_TAXSELAWDAmt ROUNDED =
483100200829      *                              ((ln_AmtRemain *
483200200829      *                               (li_DtlAnnualAmt  / 100)) -
483300200829      *                               (ln_IFPAYAWDAmt *
483400200829      *                                Pi_PayPerAnnum) )/
483500200829      *                                Pi_PayPerAnnum.
483600200829      * ---------------------------------------------------------------
483700200829      * RFS105383 - End
483800200829
483900200829           If ln_IFPAYAWDAmt < 0
484000200829               COMPUTE ln_IFPAYAWDAmt = 0
484100200829           End-If
484200200829
484300200829           If ln_TAXSELAWDAmt < 0
484400200829               COMPUTE ln_TAXSELAWDAmt = 0
484500200829           End-If
484600200829           .
484700200829      *End RFS88038
484800200829      * RFS105383 - Begin: new paragraph to get allow maulti-contract
484900200829      *   information
485000200829      * ---------------------------------
485100200829       GetAllowMultContractFlag.
485200200829      * ---------------------------------
485300200829            INITIALIZE lc_AllowMultContFlag
485400200829
485500200829            EXEC SQL
485600200829              SELECT SUBSTR(SERRLP.SERIES_RULES, 1, 1)
485700200829                              INTO :lc_AllowMultContFlag
485800200829              FROM MFAACLIVP ACLIVP
485900200829                JOIN MFAINVSGP INVSGP ON
486000200829                  ACLIVP.INVESTMENT_CODE   = INVSGP.INVESTMENT_CODE
486100200829                JOIN MFASERRLP SERRLP ON
486200200829                  INVSGP.INVESTMENT_SERIES = SERRLP.INVESTMENT_SERIES
486300200829              WHERE
486400200829                ACLIVP.ACCOUNT_NO          = :li_DtlAccountNo   AND
486500200829                INVSGP.INVESTMENT_SERIES  <> :lncc_Blank        AND
486600200829                SUBSTR(SERRLP.Series_Rules, 70, 4) = :lncc_GLWB
486700200829              FETCH FIRST ROW ONLY
486800200829           END-EXEC.
486900200829      * RFS105383 - End
487000200829
487100200829
487200200829      *RFS129478 - Start
487300200829
487400200829       UpdateAccContractLGWA.
487500200829
487600200829           EXEC SQL
487700200829               UPDATE MFAACCONP
487800200829               SET LGWA_IND      = :lc_Awd-Option
487900200829               WHERE Account_No  = :li_DtlAccountNo
488000200829           END-EXEC.
488100200829
488200200829           IF NOT lncc_sqlSuccessful
488300200829              SET Ws-Err-29 TO TRUE
488400200829              SET lncc_ErrCodeDescr29 TO TRUE
488500200829              PERFORM Set-Internal-Error
488600200829              PERFORM Dsp-Error
488700200829           END-IF.
488800200829
488900200829       UpdateAccContractLGWAOnce.
489000200829
489100200829           EXEC SQL
489200200829               UPDATE MFAACCONP
489300200829               SET LGWA_IND      =
489400200829               ( SELECT AWD_OPTION
489500200829                        FROM MFAACCONP
489600200829                 WHERE  ACCOUNT_NO = :li_DtlAccountNo
489700200829                 FETCH FIRST ROW ONLY
489800200829               )
489900200829               WHERE Account_No  = :li_DtlAccountNo
490000200829           END-EXEC.
490100200829
490200200829           IF NOT lncc_sqlSuccessful
490300200829              SET Ws-Err-29 TO TRUE
490400200829              SET lncc_ErrCodeDescr29 TO TRUE
490500200829              PERFORM Set-Internal-Error
490600200829              PERFORM Dsp-Error
490700200829           END-IF.
490800200829      *RFS129478 - END
490900200829      *RFS184855 - Start
491000200829      *-------------------------------*
491100200829       Insert-Acct-RLIF-Prev-Val.
491200200829      *-------------------------------*
491300200829           EXEC SQL
491400200829             INSERT INTO MFAACPREVP
491500200915             SELECT  Aclifp.Account_No
491600200915      * RFS1103875 -Starts.
491700200915      *             ,DECIMAL(MAX(CASE WHEN Aclifp.Market_Value_Date <> 0
491800200915      *               THEN ZONED(Aclifp.Market_Value_Date/10000,4,0) + 1
491900200915      *               ELSE :li_YearEndDate_CCYY
492000200915      *               END),5,0) AS TAXYEAR
492100200915                    ,:li_YearEndDate_CCYY AS TAXYEAR
492200200829      * RFS1103875 -Ends.
492300200829                    ,ZONED(MAX(Aclifp.Market_Value_Date),8,0)
492400200829                    ,DECIMAL(MAX(Aclifp.Market_Value),13,2)
492500200829                    ,DECIMAL(MAX(Aclifp.Min_Withdrawal_Amt),11,2)
492600200829                    ,DECIMAL(MAX(Aclifp.Max_Withdrawal_Amt),11,2)
492700200829                    ,DECIMAL(MAX(:ln_logSysDate),9,0)
492800200829                    ,DECIMAL(MAX(ZONED(:ln_logSysTime/10000,4,0)),5,0)
492900210615                    ,MAX(:lncc_AuditUser)
493000210707      *RFS186771 - Starts
493100210617                    ,DECIMAL(MAX(Aclifp.PPPA_Annual),15,2)
493200210617                    ,ZONED(MAX(Aclifp.PPPA_Eligible_Month),2,0)
493300210615                    ,DECIMAL(MAX(Aclifp.PPPA_Entitlement),15,2)
493400200829      *RFS186771 - Ends
493500200829
493600200829               FROM Sqacclif Sqaclif
493700200829               INNER JOIN Mfaaclifp Aclifp ON
493800200829                 Sqaclif.Account_No = Aclifp.Account_No
493900200829               GROUP BY Aclifp.Account_No
494000200829               ORDER BY Aclifp.Account_No
494100200829           END-EXEC.
494200200829
494300200829           MOVE SQLSTATE TO Ws-Sql-States.
494400200829           IF NOT lncc_sqlSuccessful AND NOT lncc_SqlEnd
494500200829              SET Ws-Err-30 TO TRUE
494600200829              SET lncc_ErrCodeDescr30 TO TRUE
494700200829              PERFORM Set-Internal-Error
494800200829              PERFORM Dsp-Error
494900200829              PERFORM Force-Msgw
495000200829           END-IF.
495100200829      *RFS184855 - End
495200200829
495300200829      *RFS185169 - Begin
495400200829      * ---------------------------------
495500200829       Update-Mfaaclbenp-main.
495600200829      * ---------------------------------
495700200829      * Initialization
495800200829           INITIALIZE
495900200829                      ln_GWAAmount
496000200829
496100200829           MOVE li_CurrAccountNo   TO ln_AclbenpAccountNumber
496200200829      * Declare Cursor
496300200829           EXEC SQL
496400200829            DECLARE lcu_lifMinAclbenp CURSOR FOR
496500200829              SELECT
496600200829                     coalesce(aclbenp.Guar_Withdrawal_Amount,0)
496700200829
496800200829              FROM Mfaaclbenp aclbenp JOIN Mfaserrlp serrl   ON
496900200829                 aclbenp.Investment_Series = serrl.Investment_Series
497000200829      *RFS185170 START
497100200829              EXCEPTION JOIN MFAIVRCLP IVRCLP ON
497200200829                IVRCLP.ACCOUNT_NO = ACLBENP.ACCOUNT_NO AND
497300200829                IVRCLP.SCREEN_CODE = "ACCGWDT" AND
497400200829                IVRCLP.CHANGE_CATEGORY = "RIDER CANCELLED"
497500200829      *RFS185170 END
497600200829              WHERE aclbenp.Account_No     = :li_CurrAccountNo   AND
497700200829                    aclbenp.Eligible_date    <> 0                AND
497800200829185171*             substr(serrl.Series_Rules,11,3) > :lnci_0
497900200829185171              dec(substr(serrl.Series_Rules,11,3)) > :lnci_0
498000200829           END-EXEC.
498100200829      * Open the Cursor
498200200829           EXEC SQL
498300200829             OPEN lcu_lifMinAclbenp
498400200829           END-EXEC
498500200829
498600200829           MOVE SQLSTATE TO lc_sqlStates
498700200829           IF lncc_sqlSuccessful
498800200829              SET lncc_lifMinStart    TO TRUE
498900200829              PERFORM UNTIL lncc_lifMinEnd
499000200829                EXEC SQL
499100200829                  FETCH NEXT
499200200829                    FROM lcu_lifMinAclbenp
499300200829                    INTO
499400200829                         :ln_GWAAmount
499500200829                END-EXEC
499600200829                MOVE SQLSTATE TO lc_sqlStates
499700200829                EVALUATE TRUE
499800200829                    WHEN lncc_sqlSuccessful
499900201127                         PERFORM apply-new-lif-formula-Aclbenp
500000200829105650*                  IF lncc_UpdateGWAYes
500100201127                           PERFORM update-account-benp
500200200829105650*                  END-IF
500300200829                    WHEN lncc_sqlEnd
500400200829                         SET lncc_lifMinEnd     TO TRUE
500500200829                    WHEN OTHER
500600200829                         SET Ws-Err-33           TO TRUE
500700200829                         SET lncc_ErrCodeDescr33 TO TRUE
500800200829                         PERFORM Set-Internal-Error
500900200829                         PERFORM Dsp-Error
501000200829                END-EVALUATE
501100200829              END-PERFORM
501200200829           ELSE
501300200829              SET Ws-Err-32           TO TRUE
501400200829              SET lncc_ErrCodeDescr32 TO TRUE
501500200829              PERFORM Set-Internal-Error
501600200829              PERFORM Dsp-Error
501700200829           END-IF
501800200829
501900200829      * Close the Cursor
502000200829           EXEC SQL
502100200829             CLOSE lcu_lifMinAclbenp
502200200829           END-EXEC.
502300200829
502400200829      * ---------------------------------
502500200829       apply-new-lif-formula-Aclbenp.
502600200829      * ---------------------------------
502700200829      * Check, if GWAAmount = 0 then initialize variables and just
502800201127      *
502900201127      * RFS 1105650 - Start
503000200829      *      IF ln_GWAAmount = lnci_0
503100200829               INITIALIZE ln_accountRrifMin
503200201127                          ln_OriginalGWA
503300201127      *        SET lncc_UpdateGWANo              TO TRUE
503400201127      *      ELSE
503500200829      *        SET lncc_UpdateGWAYes               TO TRUE
503600200829      * Get Account Market Value
503700200829               PERFORM get-account-market-value
503800200829
503900201127      * Do the calculations
504000201127           EXEC SQL
504100201127           SELECT COALESCE(LifpfpM.Lif_Minimum_Payment_Factor, 0)
504200201127             Into :li_LifMinFactor
504300201127           FROM Mfaaclifp Aclifp
504400201127                INNER JOIN Mfaaccntp Accntp
504500201127                   ON Aclifp.Account_no = Accntp.Account_No
504600201127                INNER JOIN Mfaivrp Ivrp
504700201127                   ON Accntp.INVESTOR_NO = Ivrp.INVESTOR_NO
504800201127                INNER JOIN Mfaacctyp Acctyp
504900201127                   ON Accntp.Account_Type_Code =
505000201127                      Acctyp.Account_type_Code
505100201127                LEFT OUTER JOIN Mfalifpfp LifpfpM
505200201127                   ON LifpfpM.Country_Code =
505300201127                       Accntp.Country_Of_Agreement AND
505400201127                      LifpfpM.Province_Code =
505500201127                       Accntp.Province_Of_Agreement AND
505600201127                      LifpfpM.Qualifying_Flag =
505700201127                       Aclifp.Qualifying_Flag AND
505800201127                      LifpfpM.Investor_Age =
505900201127                        CASE WHEN Aclifp.Calc_Date_Of_Birth > 0
506000201127                             THEN dec(substr(char(:li_YearEndDate)
506100201127                                       ,1,4),4,0) -
506200201127                                  dec(substr(char(
506300201127                                    Aclifp.Calc_Date_Of_Birth)
506400201127                                       ,1,4),4,0)
506500201127                             ELSE dec(substr(char(:li_YearEndDate)
506600201127                                       ,1,4),4,0) -
506700201127                                  dec(substr(char(
506800201127                                     Ivrp.Date_Of_Birth)
506900201127                                       ,1,4),4,0)
507000201127                             END
507100201127           WHERE Accntp.ACCOUNT_NO = :li_CurrAccountNo
507200200829           END-EXEC
507300201127               COMPUTE ln_accountRrifMin ROUNDED =
507400201127                       li_MarketValue * li_LifMinFactor / 100
507500201127      *           li_MinWithdrawalAmt *
507600200829      *           ln_AccountMarketValue / li_MarketValue
507700200829               MOVE ln_GWAAmount     TO ln_OriginalGWA
507800200829
507900200829      * Set up to a greater amount
508000200829               IF ln_OriginalGWA > 0 AND
508100200829                  ln_accountRrifMin > ln_OriginalGWA
508200200829                   MOVE ln_accountRrifMin    TO ln_GWAAmount
508300201127               END-IF
508400201127      *      END-IF.
508500200829      * RFS1105650 - End
508600200829
508700200829      * RFS185171  - starts
508800200829           PERFORM CalculateLIFMax.
508900200829      * ---------------------------------
509000200829       CalculateLIFMax.
509100200829      * ---------------------------------
509200200829           INITIALIZE li_LIFMaxAmt
509300200829
509400200829           EXEC SQL
509500200829           SELECT COALESCE(LifpfpX.Lif_Maximum_Payment_Factor, 0)
509600200829             Into :li_LifMaxFactor
509700200829           FROM Mfaaclifp Aclifp
509800200829                INNER JOIN Mfaaccntp Accntp
509900200829                   ON Aclifp.Account_no = Accntp.Account_No
510000200829                INNER JOIN Mfaivrp Ivrp
510100200829                   ON Accntp.INVESTOR_NO = Ivrp.INVESTOR_NO
510200200829                INNER JOIN Mfaacctyp Acctyp
510300200829                   ON Accntp.Account_Type_Code =
510400200829                      Acctyp.Account_type_Code
510500200829             LEFT OUTER JOIN Mfalifpfp LifpfpX
510600200829               ON LifpfpX.Country_Code =
510700200829                  Accntp.Country_Of_Agreement AND
510800200829                  LifpfpX.Province_Code =
510900200829                  Accntp.Province_Of_Agreement AND
511000200829                  LifpfpX.Qualifying_Flag =
511100200829                  Aclifp.Qualifying_Flag AND
511200200829                  LifpfpX.Investor_Age =
511300200829                  dec(substr(char(:li_YearEndDate)
511400200829                      ,1,4),4,0) -
511500200829                  dec(substr(char(Ivrp.Date_Of_Birth)
511600200829                      ,1,4),4,0)
511700200829           WHERE Accntp.ACCOUNT_NO = : li_CurrAccountNo
511800200829           END-EXEC.
511900200829           COMPUTE li_LIFMaxAmt ROUNDED =
512000200829                li_MarketValue * li_LifMaxFactor / 100.
512100200829
512200200829           EXEC SQL
512300200829               UPDATE MFAACLBENP
512400200829                 SET LIF_Maximum = :li_LIFMaxAmt
512500200829               WHERE Account_No  = :li_CurrAccountNo
512600200829           END-EXEC.
512700200829
512800200829           IF ln_GWAAmount > li_LIFMaxAmt
512900200829              MOVE li_LIFMaxAmt TO ln_GWAAmount
513000200831           END-IF.
513100200831           INITIALIZE lc_GPPInvCode
513200200831           EXEC SQL
513300200831             SELECT COALESCE(SUBSTR(SERRLP.Series_Rules,164,5), " ")
513400200831             INTO :lc_GPPInvCode
513500200831             FROM MFASERRLP SERRLP
513600200831             INNER JOIN  MFAACLBENP BENP ON
513700200831             BENP.Investment_Series = SERRLP.Investment_Series
513800200831             WHERE BENP.ACCOUNT_NO = :li_CurrAccountNo   AND
513900200831             SUBSTR(SERRLP.SERIES_RULES, 70, 4) = "GLWB" AND
514000200831             SUBSTR(SERRLP.Series_Rules, 149, 1)= "Y"
514100200831             FETCH FIRST ROW ONLY
514200200829           END-EXEC.
514300200829           EXEC SQL
514400200829                SELECT COALESCE(GUAR_WITHDRAWAL_AMOUNT,0),
514500200829                       COALESCE(AWD_OPTION," ")
514600200829                  INTO :ln_GuarWithAmount,:lc_AWDOption
514700200829                  FROM MFAACLBENP
514800200829                 WHERE Account_No  = :li_CurrAccountNo
514900200829           END-EXEC.
515000200829
515100200829           EXEC SQL
515200200829             SELECT COALESCE(PAYMENT_TYPE_CODE," ")
515300200829             INTO  :lc_PaymtTypeCode
515400200829             FROM MFAACLIFP
515500200829             WHERE Account_No = :li_CurrAccountNo
515600200829           END-EXEC.
515700200831
515800200829           IF lc_GPPInvCode NOT = SPACES
515900200829           IF ln_GWAAmount > ln_AccountMarketValue AND
516000200829               lc_AWDOption not equal to lncc_G AND
516100200829               lc_PaymtTypeCode   not equal to lncc_M
516200200829                   PERFORM update-aclbenp-awd-option
516300200829           ELSE
516400200829            IF ln_GWAAmount > lnci_0 AND
516500200829               ln_AccountMarketValue = lnci_0 AND
516600200829               lc_AWDOption not equal to lncc_G AND
516700200829               lc_PaymtTypeCode   equal to lncc_M
516800200829                   PERFORM update-aclbenp-awd-option
516900200831            END-IF
517000200829           END-IF
517100200829           END-IF.
517200200829
517300200829
517400200829           IF ln_GWAAmount > lnci_0 AND
517500200829               ln_AccountMarketValue = lnci_0
517600200829              IF lc_GPPInvCode NOT = SPACES
517700200829               PERFORM GLWB-ACCOUNT-AWD-INVESTMENT
517800200829              END-IF
517900200829           END-IF.
518000200829
518100200829           IF ln_GWAAmount > lnci_0 AND
518200200829               ln_AccountMarketValue = lnci_0
518300200829              IF lc_GPPInvCode NOT = SPACES
518400200829               PERFORM GLWB-ACCOUNT-LIF-INV-DTL
518500200829              END-IF
518600200829           END-IF.
518700200829
518800200829      * ---------------------------------
518900200829       update-aclbenp-awd-option.
519000200829      * ---------------------------------
519100200829           EXEC SQL
519200200829               UPDATE MFAACLBENP
519300200829                 SET AWD_OPTION = :lncc_G,
519400200829                 AWD_SPLIT_OPTION = :lncc_Percent,
519500200829                 AWD_AMOUNT = 0
519600200829               WHERE Account_No  = :li_CurrAccountNo
519700200829           END-EXEC.
519800200829
519900200829      * ---------------------------------
520000200829       GLWB-ACCOUNT-AWD-INVESTMENT.
520100200829      * ---------------------------------
520200200829             INITIALIZE ltb_LifAwdRec, SQLSTATE.
520300200829           EXEC SQL
520400200829                SELECT ACCOUNT_NO,
520500200829                       COALESCE(AWD_SEQ_NO,0),
520600200829                       COALESCE(INVESTMENT_CODE," "),
520700200829                       COALESCE(AWD_AMOUNT,0),
520800200829                       COALESCE(AWD_PERCENT,0),
520900200829                       COALESCE(AWD_UNITS,0),
521000200829                       COALESCE(SPLIT_OPTION_CODE," "),
521100200829                       COALESCE(CONFIRM," "),
521200200829                       COALESCE(GROSS_OR_NET," "),
521300200829                       COALESCE(CONTR_REDEM_CODE," "),
521400200829                       COALESCE(INITIAL_CONFIRM," "),
521500200829                       COALESCE(WAIVE_DSC," "),
521600200829                       COALESCE(DSC_WAIVE_REASON_CODE," ")
521700200829                  INTO :li_LifAccountNo,
521800200829                  :li_LifAwdSeqNo,
521900200829                  :lc_LifInvCode,
522000200829                  :li_LifAwdAmt,
522100200829                  :li_LifAwdPercent,
522200200829                  :li_LifAwdUnit,
522300200829                  :lc_LifSplitOptCode,
522400200829                  :lc_LifConfirm,
522500200829                  :lc_LifGrossOrNet,
522600200829                  :lc_LifContrRedemCode,
522700200829                  :lc_LifIntConfirm,
522800200829                  :lc_LifWaiveDsc,
522900200829                  :lc_LifWaiveReasonCode
523000200829                 FROM MFAACCAIP
523100200829                 WHERE Account_No  = :li_CurrAccountNo
523200200829                 AND AWD_SEQ_NO = 1
523300200829                 FETCH FIRST ROW ONLY
523400200829           END-EXEC.
523500200829
523600200829           MOVE SQLSTATE TO Ws-Sql-States
523700200829           EVALUATE TRUE
523800200829           WHEN lncc_sqlSuccessful
523900200829              PERFORM Gpp-Fund-Awd-Record-Insert
524000200829           CONTINUE
524100200829           WHEN OTHER
524200200829                SET Ws-Err-35           TO TRUE
524300200829                SET lncc_ErrCodeDescr35 TO TRUE
524400200829                PERFORM Set-Internal-Error
524500200829                PERFORM Dsp-Error
524600200829            END-EVALUATE.
524700200829
524800200829      * ---------------------------------
524900200829       Gpp-Fund-Awd-Record-Insert.
525000200829      * ---------------------------------
525100200829           PERFORM GetAWDsplit.
525200200829
525300200829      * ---------------------------------
525400200829       GetAWDsplit.
525500200829      * ---------------------------------
525600200829           EXEC SQL
525700200829           DECLARE AWDSPLIT CURSOR FOR
525800200829           SELECT
525900200829           COALESCE(ACCOUNT_NO,0),
526000200829           COALESCE(CONTR_REDEM_CODE, " "),
526100200829           COALESCE(SPLIT_OPTION_CODE, " "),
526200200829           SUM(CASE WHEN SPLIT_OPTION_CODE = "$"
526300200829           THEN AWD_AMOUNT
526400200829           ELSE 0
526500200829           END),
526600200829           SUM(CASE WHEN SPLIT_OPTION_CODE = "%"
526700200829           THEN AWD_PERCENT
526800200829           ELSE 0
526900200829           END)
527000200829           FROM MFAACCAIP
527100200829           WHERE ACCOUNT_NO = :li_CurrAccountNo
527200200829           And AWD_SEQ_NO   = 1
527300200829           GROUP BY ACCOUNT_NO,SPLIT_OPTION_CODE,CONTR_REDEM_CODE
527400200829           ORDER BY ACCOUNT_NO,SPLIT_OPTION_CODE,CONTR_REDEM_CODE
527500200829           END-EXEC.
527600200829
527700200829           EXEC SQL
527800200829              OPEN AWDSPLIT
527900200829           END-EXEC.
528000200829
528100200829           MOVE SQLSTATE TO lc_sqlStates.
528200200829           EVALUATE TRUE
528300200829           WHEN lncc_sqlSuccessful
528400200829           CONTINUE
528500200829           WHEN OTHER
528600200829           SET Ws-Err-41 TO TRUE
528700200829           SET lncc_ErrOpenAWDSPLIT
528800200829                TO TRUE
528900200829           PERFORM Set-Internal-Error
529000200829           PERFORM Dsp-Error
529100200829           PERFORM Force-Msgw
529200200829           END-EVALUATE.
529300200829
529400200829           INITIALIZE ltb_AWDTable,
529500200829                      SQLSTATE,
529600200829                      li_NoOfRowsA
529700200829
529800200829           EXEC SQL
529900200829           FETCH NEXT FROM AWDSPLIT
530000200829           FOR :lnci_MaxFetchRec ROWS
530100200829           INTO  :ltb_SpArray:ltb_IndAWDSplitA
530200200829           END-EXEC.
530300200829
530400200829           MOVE SQLSTATE TO lc_sqlStates
530500200829           EVALUATE TRUE
530600200829           WHEN lncc_sqlSuccessful
530700200829           COMPUTE li_NoOfRowsA = SQLERRD(3)
530800200829           WHEN lncc_sqlEnd
530900200829           COMPUTE li_NoOfRowsA = SQLERRD(3)
531000200829           WHEN OTHER
531100200829           SET Ws-Err-42 TO TRUE
531200200829           SET lncc_ErrFetchAWDSPLIT
531300200829                TO TRUE
531400200829           PERFORM Set-Internal-Error
531500200829           PERFORM Dsp-Error
531600200829           PERFORM Force-Msgw
531700200829           END-EVALUATE.
531800200829
531900200829           IF li_NoOfRowsA > 0
532000200829              PERFORM Remove-Original-Awd-Record
532100200829           END-IF
532200200829
532300200829           SET li_CountA TO 1
532400200829
532500200829           PERFORM AWDSPLITFetch TEST BEFORE
532600200829                   UNTIL li_CountA > li_NoOfRowsA.
532700200829
532800200829           PERFORM CloseAWDSPLIT.
532900200829
533000200829      * ---------------------------------
533100200829       Remove-Original-Awd-Record.
533200200829      * ---------------------------------
533300200829             INITIALIZE SQLSTATE
533400200829
533500200829           EXEC SQL
533600200829                DELETE FROM Mfaaccaip
533700200829                 WHERE Account_No  = :li_CurrAccountNo
533800200829                 AND AWD_SEQ_NO = 1
533900200829           END-EXEC.
534000200829
534100200829           MOVE SQLSTATE TO Ws-Sql-States
534200200829           EVALUATE TRUE
534300200829           WHEN lncc_sqlSuccessful
534400200829           CONTINUE
534500200829           WHEN OTHER
534600200829                SET Ws-Err-36           TO TRUE
534700200829                SET lncc_ErrCodeDescr36 TO TRUE
534800200829                PERFORM Set-Internal-Error
534900200829                PERFORM Dsp-Error
535000200829                PERFORM Force-Msgw
535100200829            END-EVALUATE.
535200200829
535300200829      * ---------------------------------
535400200829       AWDSPLITFetch.
535500200829      * ---------------------------------
535600200829           INITIALIZE SQLSTATE
535700200829           IF  li_SpAccNo (li_CountA)      =    li_CurrAccountNo
535800200829           MOVE lc_SpContCode(li_CountA)   TO   lc_LifContrRedemCode
535900200829           MOVE lc_SpSplitCode (li_CountA) TO   lc_LifSplitOptCode
536000200829           MOVE li_SpAWDAmt (li_CountA)    TO   li_LifAwdAmt
536100200829           MOVE li_SpAWDPerc (li_CountA)   TO   li_LifAwdPercent
536200200829           MOVE lc_GPPInvCode              TO   lc_LifInvCode
536300200829
536400200829              EXEC SQL
536500200829                   INSERT INTO Mfaaccaip
536600200829                   VALUES (:ltb_LifAwdRec)
536700200829              END-EXEC
536800200829           MOVE SQLSTATE TO Ws-Sql-States
536900200829           IF NOT lncc_sqlSuccessful
537000200829              SET Ws-Err-37 TO TRUE
537100200829              SET lncc_ErrCodeDescr37 TO TRUE
537200200829              PERFORM Set-Internal-Error
537300200829              PERFORM Dsp-Error
537400200829              PERFORM Force-Msgw
537500200829           END-IF
537600200829           END-IF.
537700200829
537800200829            SET li_CountA UP BY 1.
537900200829
538000200829      * ---------------------------------
538100200829       CloseAWDSPLIT.
538200200829      * ---------------------------------
538300200829           INITIALIZE SQLSTATE
538400200829           EXEC SQL
538500200829             CLOSE AWDSPLIT
538600200829           END-EXEC.
538700200829           MOVE SQLSTATE TO Ws-Sql-States
538800200829           IF NOT lncc_sqlSuccessful
538900200829              SET Ws-Err-43 TO TRUE
539000200829              SET lncc_ErrCloseAWDSPLIT TO TRUE
539100200829              PERFORM Set-Internal-Error
539200200829              PERFORM Dsp-Error
539300200829              PERFORM Force-Msgw
539400200829           END-IF.
539500200829
539600200829      * ---------------------------------
539700200829       GLWB-ACCOUNT-LIF-INV-DTL.
539800200829      * ---------------------------------
539900200829             INITIALIZE ltb_InvLifAwdRec, SQLSTATE.
540000200829           EXEC SQL
540100200829                SELECT ACCOUNT_NO,
540200200829                       COALESCE(INVESTMENT_CODE," "),
540300200829                       COALESCE(ANNUAL_AMOUNT,0),
540400200829                       COALESCE(GROSS_OR_NET," "),
540500200829                       COALESCE(CONFIRM," "),
540600200829                       COALESCE(WAIVE_DSC," "),
540700200829                       COALESCE(DSC_WAIVE_REASON_CODE," ")
540800200829                  INTO :li_InvLifAccountNo,
540900200829                  :lc_InvLifInvCode,
541000200829                  :li_InvLifAnnualAmt,
541100200829                  :lc_InvLifGrossOrNet,
541200200829                  :lc_InvLifConfirm,
541300200829                  :lc_InvLifWaiveDsc,
541400200829                  :lc_InvLifWaiveReasonCode
541500200829                  FROM MFAACLIVP
541600200829                 WHERE Account_No  = :li_CurrAccountNo
541700200829                 FETCH FIRST ROW ONLY
541800200829           END-EXEC.
541900200829
542000200829           MOVE SQLSTATE TO Ws-Sql-States
542100200829           EVALUATE TRUE
542200200829           WHEN lncc_sqlSuccessful
542300200829              PERFORM Remove-Orig-Acct-Lif-Record
542400200829           CONTINUE
542500200829           WHEN OTHER
542600200829                SET Ws-Err-38           TO TRUE
542700200829                SET lncc_ErrCodeDescr38 TO TRUE
542800200829                PERFORM Set-Internal-Error
542900200829                PERFORM Dsp-Error
543000200829            END-EVALUATE.
543100200829
543200200829      * ---------------------------------
543300200829       Remove-Orig-Acct-Lif-Record.
543400200829      * ---------------------------------
543500200829
543600200829           EXEC SQL
543700200829                DELETE FROM MFAACLIVP
543800200829                 WHERE Account_No  = :li_CurrAccountNo
543900200829           END-EXEC.
544000200829
544100200829           MOVE SQLSTATE TO Ws-Sql-States
544200200829           EVALUATE TRUE
544300200829           WHEN lncc_sqlSuccessful
544400200829              PERFORM Gpp-Fund-Lif-InvRec-Insert
544500200829           CONTINUE
544600200829           WHEN OTHER
544700200829                SET Ws-Err-39           TO TRUE
544800200829                SET lncc_ErrCodeDescr39 TO TRUE
544900200829                PERFORM Set-Internal-Error
545000200829                PERFORM Dsp-Error
545100200829                PERFORM Force-Msgw
545200200829            END-EVALUATE.
545300200829
545400200829      * ---------------------------------
545500200829       Gpp-Fund-Lif-InvRec-Insert.
545600200829      * ---------------------------------
545700200829              MOVE lc_GPPInvCode TO lc_InvLifInvCode.
545800200829              MOVE  100          TO li_InvLifAnnualAmt
545900200829
546000200829              EXEC SQL
546100200829                   INSERT INTO MFAACLIVP
546200200829                   VALUES (:ltb_InvLifAwdRec)
546300200829              END-EXEC
546400200829           MOVE SQLSTATE TO Ws-Sql-States
546500200829           IF NOT lncc_sqlSuccessful
546600200829              SET Ws-Err-40 TO TRUE
546700200829              SET lncc_ErrCodeDescr40 TO TRUE
546800200829              PERFORM Set-Internal-Error
546900200829              PERFORM Dsp-Error
547000200829              PERFORM Force-Msgw
547100200829           END-IF.
547200200829
547300200829      * RFS185171  - ends
547400200829      * ---------------------------------
547500200829       get-account-market-value.
547600200829      * ---------------------------------
547700200829             INITIALIZE ln_AccountMarketValue.
547800200829
547900200829           MOVE li_TradeDate       TO COMM-DATE.
548000200829           MOVE li_CurrAccountNo   TO COMM-ACCOUNT-NO.
548100200829           MOVE lncc_Space         TO COMM-INVESTMENT-CODE.
548200200829           MOVE lnci_0             TO COMM-VALUE-INVESTMENT-CURRENCY.
548300200829           MOVE lnci_0             TO COMM-MARKET-VALUE-BASE.
548400200829           MOVE lnci_0             TO COMM-BOOK-VALUE-BASE
548500200829           MOVE lnci_0             TO COMM-BOOK-VALUE-EXCHANGE.
548600200829           MOVE lnci_0             TO COMM-TRAN-CLOS-UNIT-BAL.
548700200829           MOVE lnci_0             TO COMM-BASE-UNIT-PRICE.
548800200829           MOVE lnci_0             TO COMM-VALUE-BASE-CURRENCY.
548900200829           MOVE lnci_0             TO COMM-ERROR-CODE.
549000200829           MOVE lncc_T             TO COMM-DATE-IND.
549100200829
549200200829           CALL "MKTVALTD" USING COMM-DATE
549300200829                                 COMM-ACCOUNT-NO
549400200829                                 COMM-INVESTMENT-CODE
549500200829                                 COMM-VALUE-INVESTMENT-CURRENCY
549600200829                                 COMM-MARKET-VALUE-BASE
549700200829                                 COMM-BOOK-VALUE-BASE
549800200829                                 COMM-BOOK-VALUE-EXCHANGE
549900200829                                 COMM-TRAN-CLOS-UNIT-BAL
550000200829                                 COMM-BASE-UNIT-PRICE
550100200829                                 COMM-VALUE-BASE-CURRENCY
550200200829                                 COMM-ERROR-CODE
550300200829                                 COMM-DATE-IND
550400200829           COMPUTE ln_AccountMarketValue =
550500200829                                   COMM-VALUE-INVESTMENT-CURRENCY.
550600200829      * ---------------------------------
550700200829       update-account-benp.
550800200829      * ---------------------------------
550900200829      * Update Account Benp, RRIFMin, GWAAmount
551000200829             EXEC SQL
551100200829               UPDATE Mfaaclbenp
551200200829                 SET Guar_Withdrawal_Amount = :ln_GWAAmount,
551300200829                     GWA_RIF_MINIMUM        = :ln_accountRrifMin,
551400200829                     Original_GWA           = :ln_OriginalGWA
551500200829               WHERE Account_No  = :li_CurrAccountNo
551600200829             END-EXEC.
551700200829
551800200829            MOVE SQLSTATE TO lc_sqlStates
551900200829            IF NOT lncc_sqlSuccessful
552000200829              SET Ws-Err-34 TO TRUE
552100200829              SET lncc_ErrCodeDescr34 TO TRUE
552200200829              PERFORM Set-Internal-Error
552300200829              PERFORM Dsp-Error
552400200829              PERFORM Force-Msgw
552500200829           END-IF.
552600201127      *RFS185171 - STARTS
552700201127      *RFS1105579 - STARTS
552800201127      *    INITIALIZE lc_FXAWD_Parms
552900201127      *    MOVE li_CurrAccountNo    TO pi_AccountNo2
553000201127      *    MOVE "S"                 TO pc_Mode2
553100200829      *    MOVE "00"                TO pc_RejectCode2
553200201127
553300201127      *    CALL "FXAWDRLIF" USING pi_AccountNo2
553400201127      *                           pc_Mode2
553500201127      *                           pc_FrequencyCode2
553600201127      *                           pn_IFPayAmount2
553700201127      *                           pn_TaxselAmount2
553800201127      *                           pc_RejectCode2
553900200831      *RFS1105579 - ENDS
554000200831
554100200831             EXEC SQL
554200200831               DELETE FROM SQACCLIF SQACCLIF
554300200831               WHERE SQACCLIF.ACCOUNT_NO= :li_CurrAccountNo
554400200831             END-EXEC.
554500200829
554600200829      *RFS185171 - END
554700200829
554800200829      *RFS185169 - End
554900200829
555000200829      *RFS185170 START
555100200829       GetAccGLWBDetails.
555200200829           INITIALIZE pc_ACCGLWBD_Series
555300200829                      pc_ACCGLWBD_RiderApplicable.
555400200829           EXEC SQL
555500200829            CALL SPACCGLWBD(:pi_ACCGLWBD_AccNo,
555600200829                            :pc_ACCGLWBD_InvCode,
555700200829                            :pc_ACCGLWBD_AccLvlGLWB,
555800200829                            :pc_ACCGLWBD_Series,
555900200829                            :pc_ACCGLWBD_RiderApplicable)
556000200829           END-EXEC.
556100200829      *RFS185170 END
556200200829
556300200829      *RFS186053 Start
556400200829      * ---------------------------------
556500200829       SetupAwdInvWdHier.
556600200829      * ---------------------------------
556700200829           INITIALIZE lc_InvUpdRC.
556800200829           MOVE lncc_AuditUser     TO  lc_InvUpdCalledBy.
556900200829           CALL "AWDINVUPDP" USING lc_InvUpdCalledBy,
557000200829                                   li_InvUpdAccountNo,
557100200829                                   lc_InvUpdRC.
557200200829
557300200829      * ---------------------------------
557400200829       RemoveAwdInvWdHier.
557500200829      * ---------------------------------
557600200829           IF lc_InvUpdRC = lncc_Y
557700200829              CALL "AWDINVUPDR"
557800200829           END-IF.
557900200829      *RFS186053 End
558000200829
558100200829      * ---------------------------------
558200200829      * DSP-ERROR and FORCE-MSGW Routines
558300200829      * ---------------------------------
558400999999          COPY Cpysqlrtn.
