000100000000       IDENTIFICATION DIVISION.
000110000000       PROGRAM-ID.     CNFMPRT.
000120000000       INSTALLATION.   Jewelstone Systems Inc.
000130000000       AUTHOR.         Jewelstone Systems Inc.
000140190722       DATE-WRITTEN.   November 25, 1996.
000150000000       DATE-COMPILED.
000160991015
000170000000      ******************************************************************
000180000000      *                                                                *
000190000000      *    CNFMPRT:    Confirmation - Standard Form                    *
000200000000      *                                                                *
000210000000      *    PURPOSE:    To format and print confirmations using the     *
000220000000      *                standard format and the Jewelstone Statement    *
000230000000      *                File (MFASTMTFP).                               *
000240000000      *                                                                *
000250000000      *    LEVELS:      1. INVESTOR-NO                                 *
000260000000      *                 2. ACCOUNT                                     *
000270980130      *                                                                *
000280980323      *    FILES:      (I) MFAACOJLA   Investor Join
000290980323      *                (I) MFACURP     Currency Code                   *
000300980130      *                (I) MFADEAMIP   Dealer Mailing Instruction      *
000310000000      *                (I) MFADEAP     Dealer                          *
000320000000      *                (I) MFADEAREP   Dealer Representative           *
000330000000      *                (I) MFADERMIP   Dealer Representative Mailing   *
000340000000      *                                Instruction                     *
000350000000      *                (I) MFADRADRP   Dealer Representative Address   *
000360000000      *                (I) MFAINADDP   Institution Address             *
000370190328      *                (I) MFAINSBRP   Institution Branch              *
000380980213      *                (I) MFAINVP     Investment                      *
000390980323      *                (I) MFANMTPYP   Nominee Account Type Descr
000400991104991103*                (I) MFAACCTYP   Account Type BK
000410000000      *                (I) MFANOMMIP   Nominee Mailing Instruction     *
000420000000      *                (I) MFASTMMSP   Statement Message               *
000430000000      *                (O) MFASTMPDP   Statement Print Header          *
000440000000      *                (O) MFASTMPHP   Statement Print Detail          *
000450000000      *                (I) MFASTMEXP   Statement Extract Data          *
000460000000      *                (O) PRINTER     Control Report                  *
000470000000      *                                                                *
000480000000      *    CREATED:    21/NOV/97 (HS)                                  *
000490980213      *    CHANGED:    13/FEB/98 (MFH)                                 *
000500980213      *                                                                *
000510000000      ******************************************************************
000520000000      /
000530000000      ******************************************************************
000540000000      *                                                                *
000550000000      *    C H A N G E   H I S T O R Y                                 *
000560000000      *                                                                *
000570000000      ******************************************************************
000580000000      ******************************************************************
000590000000      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
000600000000      ******************************************************************
000610971211      * H.SHENG    *  1997/12/02  * RE-FORMAT THE HEADING PART AND     *
000620971212      *            *              * SUMMARY PART OF CONFIRMATION       *
000630030515      ******************************************************************
000640971212      * H.SHENG    *  1997/12/12  * RFS LOG #1850                      *
000650971212      *            *              * - MODIFICATIONS TO FORMAT ADDRESSES*
000660971212      *            *              *   FOR QUEBEC AS STREET NUMBER,     *
000670971212      *            *              *   STREET TYPE CODE, STREET NAME    *
000680971212      *            *              *   INSTEAD OF STREET NO, STREET     *
000690971212      *            *              *   NAME, STREET TYPE CODE.          *
000700030515      ******************************************************************
000710980130      * H.SHENG    *  1997/12/18  * RFS LOG #1872                      *
000720980130      *            *              * - ADD SUMMARY SUPPRESSION FLAG     *
000730030515      ******************************************************************
000740980128      * H.SHENG    *  1998/01/28  * RFS# 1871                          *
000750980128      *            *              * - Modifications to handle duplicate*
000760980128      *            *              *   confirmations and statements to  *
000770980128      *            *              *   the new JSI standard confirmation*
000780980128      *            *              *   and old statement                *
000790030515      ******************************************************************
000800980130      * H.SHENG    *  1998/01/30  * RFS# 1904                          *
000810980130      *            *              * - Print USD after the investment   *
000820980130      *            *              *   description if an investment is  *
000830980130      *            *              *   for US currency                  *
000840030515      ******************************************************************
000850980213      * M.Howorth  *  1998/02/13  * RFS #2142                          *
000860980213      *            *              * - Modifications to report the      *
000870980213      *            *              *   correct dealer account number.   *
000880030515      ******************************************************************
000890980320      * H.SHENG    *  1998/03/20  * RFS #2220                          *
000900980320      *            *              * - Modifications to correctly print *
000910980320      *            *              *   detailed account type and base   *
000920980320      *            *              *   the language of the 'Account     *
000930980320      *            *              *   Type'on the language code from   *
000940980320      *            *              *   NOMDTL screen for nominee account*
000950030515      ******************************************************************
000960980417      * H.SHENG    *  1998/04/17  * RFS #1853                          *
000970980417      *            *              * - Add WS-LDA-BRANCH-ADDRESS to     *
000980980417      *            *              *   *LDA and do the corresponding    *
000990980417      *            *              *   change to the CBL program        *
001000030515      ******************************************************************
001010980420      * H.SHENG    * 1998/04/20   * RFS #2482                          *
001020980420      *            *              * -Infinity would like to remove the *
001030980420      *            *              *  c/o attn line for the rep         *
001040980420      *            *              *  address                           *
001050030515      ******************************************************************
001060980910      * H.SHENG    *  1998/09/08  * RFS #2571                          *
001070980910      *            *              * -Modifications to print the right  *
001080980910      *            *              *  address for each account of the   *
001090980910      *            *              *  same investor when an investor    *
001100980910      *            *              *  has multiple accounts             *
001110030515      ******************************************************************
001120990312      * H.SHENG    *  1999/03/12  * RFS #4116                          *
001130990312      *            *              * -Modifications to print branch     *
001140990312      *            *              *  phone no and modify some of the   *
001150990312      *            *              *  wording of the confirm.           *
001160030515      ******************************************************************
001170990329      * H.SHENG    * 1999/03/26   * RFS 4064                           *
001180990329      *            *              * -Remove the dealer/rep address     *
001190990329      *            *              *  and add the number portion of the *
001200990329      *            *              *  PLacement User ID to the bottom   *
001210990329      *            *              *  left hand corner of the confirm   *
001220990329      *            *              *  page.                             *
001230030515      ******************************************************************
001240990630      * H.SHENG    * 1999/06/30   * RFS 4748                           *
001250990630      *            *              * -Modifications to remove the hard  *
001260990630      *            *              *  code of the centry and link to the*
001270990630      *            *              *  system default century.           *
001280030515      ******************************************************************
001290990705      * H.SHENG    * 1999/07/05   * RFS 4786                           *
001300990705      *            *              * -Modifications to put area code of *
001310990705      *            *              *  branch phone into brackets and    *
001320990705      *            *              *  correctly populate the branch     *
001330990705      *            *              *  phone and to change the French    *
001340990705      *            *              *  literal.                          *
001350030515      ******************************************************************
001360990820      * H.SHENG    * 1999/08/20   * RFS 5228                           *
001370990820      *            *              * -Modifications to move the up right*
001380990820      *            *              *  heading part 3 chars left in order*
001390990820      *            *              *  to print out full 35 chars dealer *
001400990820      *            *              *  name.                             *
001410030515      ******************************************************************
001420990930      * B.LU       * 1999/09/30   * RFS 5464                           *
001430991001      *            *              * -Create a new version for UBS. A   *
001440991001      *            *              *  new layout form was created for   *
001450991001      *            *              *  UBS: dealer/rep information,      *
001460991001      *            *              *  account position information,     *
001470991001      *            *              *  account type, deduction aand net  *
001480991001      *            *              *  invested proceeds columns were    *
001490991001      *            *              *  removed from the standard form.   *
001500991001      *            *              *  Column headings were also changed *
001510991001      *            *              *  in accordance with UBS            *
001520991001      *            *              *  requirements.                     *
001530030515      ******************************************************************
001540991012      * B.LU       * 1999/10/12   * RFS 5010                           *
001550991012      *            *              * -Modifications were made to produce*
001560991012      *            *              *  the RESP beneficiaries for every  *
001570991012      *            *              *  transaction with a transaction
001580991012      *            *              *  type of "BUY" or "SEL" or "TRI"
001590991012      *            *              *  or "TRO". The RESP Account
001600991012      *            *              *  Beneficiary Summary was also      *
001610991012      *            *              *  created on the Confirm Report.    *
001620030515      ******************************************************************
001630991104      * B.LU       * 1999/11/03   * RFS 5763                           *
001640991104      *            *              * -Modifications were made for CND to*
001650991104      *            *              *  override the transaction          *
001660991104      *            *              *  description with the contribution/
001670991104      *            *              *  redemption code description if the
001680991104      *            *              *  contribution/redemption code for
001690991104      *            *              *  the transaction was "MFCCNV".     *
001700030515      ******************************************************************
001710991126      * B.LU       * 1999/11/26   * RFS 5148                           *
001720991126      *            *              * -Bypass Section-30 and Section-35. *
001730030515      ******************************************************************
001740000225      * B.LU       * 2000/02/24   * RFS 6532                           *
001750000225      *            *     TO  25   * -Increase field size for AMOUNT,   *
001760000225      *            *              *  UNIT-PRICE, and MARKET_VALUE.     *
001770000225      *            *              *  Changes apply only to  UBS.       *
001780030515      ******************************************************************
001790000308      * B.LU       * 2000/02/26   * RFS 6532                           *
001800000308      *            *     TO  27   * -Increase field size for AMOUNT,   *
001810000308      *            *              *  UNIT-PRICE, and MARKET_VALUE.     *
001820000308      *            *              *  Changes apply to other clients.   *
001830030515      ******************************************************************
001840000309      * H.Sheng    * 2000/03/09   * RFS 6364                           *
001850000309      *            *              * -Modifications to correctly report *
001860000309      *            *              *  US Dollar Unit Balance at the     *
001870000309      *            *              *  summary portion.                  *
001880030515      ******************************************************************
001890000420      * B.LU       * 2000/04/14   * RFS 6365                           *
001900000420      *            *              * -The 6 digit rep code was printed  *
001910000420      *            *              *  on both Statement and Confirm     *
001920000420      *            *              *  for MLA.                          *
001930030515      ******************************************************************
001940000524      * B.LU       * 2000/05/24   * RFS 7063                           *
001950000524      *            *              * -For nominee account, "SPOUSAL"    *
001960000525      *            *              *  OR "DE CONJOINT" was reported     *
001970000525      *            *              *  for Account Type field if it      *
001980000525      *            *              *  was a spousal account.            *
001990030515      ******************************************************************
002000000607      * B.LU       * 2000/06/07   * RFS 7201                           *
002010000607      *            *              * -Move IS-ENTERED-BY to Statement   *
002020000607      *            *              *  Account Table. If investor has    *
002030000607      *            *              *  mult accounts, each account will  *
002040000607      *            *              *  get the right Code Placement. It  *
002050000607      *            *              *  works only for version 2.         *
002060030515      ******************************************************************
002070000627      * B.LU       * 2000/06/07   * RFS 6725                           *
002080000627      *            *              * -For Nominee account, if Generate  *
002090000627      *            *              *  Confirm was set to "N", nominee   *
002100000627      *            *              *  registration was used. All others *
002110000627      *            *              *  still using investor registration.*
002120030515      ******************************************************************
002130000825      * B.LU       * 2000/08/25   * RFS 7395                           *
002140000825      *            *              * -A new parameter - SIN on Confirm  *
002150000825      *            *              *  table was created, which was used *
002160000825      *            *              *  to either report SIN or not.      *
002170030515      ******************************************************************
002180000914      * B.LU       * 2000/09/14   * RFS 7813                           *
002190000914      *            *              * -The SHEX-INVESTOR-ADDRESS1 was    *
002200000914      *            *              *  populated with spaces if Nominee  *
002210001003      *            *              *  address was required.             *
002220030515      ******************************************************************
002230001002      * B.LU       * 2000/10/02   * RFS 7869                           *
002240001002      *            *              * -The SHEX-INVESTOR-ADDRESS1 was    *
002250001002      *            *              *  populated with II-INVESTOR-NAME   *
002260001002      *            *              *  if Nominee address was required.  *
002270030515      ******************************************************************
002280001003      * B.LU       * 2000/10/02   * RFS 7633                           *
002290001003      *            *              * -IS-EBTERED-BY was moved to        *
002300001003      *            *              *  STMT-PRT-HDR-FILE(MFASTMPHP) and  *
002310001003      *            *              *  used as the key for MLA' spool    *
002320001003      *            *              *  files.                            *
002330030515      ******************************************************************
002340010122      * B.LU       * 2001/01/22   * RFS 9184                           *
002350010122      *            *              * - AT-ADMIN-FEES was added to       *
002360010122      *            *              *  DEDUCTION that was missed before. *
002370030515      ******************************************************************
002380010123      * B.LU       * 2001/01/23   * RFS 8476                           *
002390010123      *            *              * -IS-EBTERED-BY was populated       *
002400010123      *            *              *  correctly.                        *
002410030515      ******************************************************************
002420010130      * B.LU       * 2001/01/22   * RFS 9298                           *
002430010130      *            *              * - AT-GST and AT-PST were added to  *
002440010130      *            *              *  DEDUCTION that was missed before. *
002450030515      ******************************************************************
002460010221      * B.LU       * 2001/02/21   * RFS 8307                           *
002470010221      *            *              * - GIC transactions not be reported *
002480010221      *            *              *  in details section.               *
002490030515      ******************************************************************
002500010308      * K.LIU      * 2001/03/08   * RFS 8633
002510010321      *            *              * -Bypass Section 12 25
002520010308      *            *              * RFS 4638
002530010308      *            *              * -Bypass Section 40, 43, 45, 90
002540010412      *            * 2001/04/12   * -Record length increased to 1100.
002550030515      ******************************************************************
002560010517      * K.LIU      * 2001/05/01   * RFS 10081
002570010517      *            *              * -Populate the GIC section.
002580030515      ******************************************************************
002590010530      * K.LIU      * 2001/05/30   * RFS 10383
002600010530      *            *              * -Populate DII after transactions
002610010530      *            *              *  of all other product types
002620030515      ******************************************************************
002630010627      * B.LU       * 2001/06/27   * RFS10700
002640010627      *            *              * -WS-CURRENCY-TBL was changed to get
002650010627      *            *              *  back the lost USD funds.
002660030515      ******************************************************************
002670010726      * B.LU       * 2001/07/26   * RFS10992
002680010726      *            *              * -Mispelling words are corrected.
002690010726      *            *              * -Section headings be reported or
002700010726      *            *              *  not depend on account investments.
002710030515      ******************************************************************
002720010807      * K.LIU      * 2001/08/07   * RFS9983
002730010807      *            *              * -When a confirmation form report
002740010807      *            *              *  a nominee address only this
002750010807      *            *              *  nominee's post code should appear.
002760010807      *            *              * -An incorrect investor post code
002770010807      *            *              *  has been removed from a form which
002780010807      *            *              *  has lenthy nominee address.
002790030515      ******************************************************************
002800010828      * B.LU       * 2001/08/28   * RFS11280
002810010828      *            *              * -Mispelling words are corrected.
002820010828      *            *              * -Section headings be reported or
002830010828      *            *              *  not depend on account investments.
002840030515      ******************************************************************
002850010918      * B.LU       * 2001/09/18   * RFS11406
002860010918      *            *              * -Mispelling words werecorrected;
002870010918      *            *              * -Hard coded Section Heading words
002880010918      *            *              *  were changed;
002890010918      *            *              * -DII/GIC rate were reported to
002900010918      *            *              *  three decimal places and Price
002910010918      *            *              *  to four decimal places.
002920030515      ******************************************************************
002930010928      * B.LU       * 2001/09/28   * RFS11648
002940010928      *            *              * -WS-SPL-HDGFST was changed to 16
002950010928      *            *              * -WS-SPL-DTLFST was changed to 30
002960010928      *            *              *  for Version 4.
002970030515      ******************************************************************
002980011010      * B.LU       * 2001/10/09   * RFS11747
002990011010      *            *              * -Transaction Header was reported
003000011010      *            *              *  correctly on the second page.
003010011010      *            *              * -Note: the changes for this RFS
003020011010      *            *              *  were in the same Version for both
003030011010      *            *              *  ACC and PRD.
003040030515      ******************************************************************
003050011022      * B.Lu       * 2001/10/22   * RFS10901, 11127, 10605
003060011022      *            *              * -Recompile only.
003070030515      ******************************************************************
003080011204      * B.LU       * 2001/12/04   * RFS11972
003090011204      *            *              * -Closing balance for mutual fund
003100011204      *            *              *  was cut off by the DII Header.
003110030515      ******************************************************************
003120011213      * A.ALNEMER  * 2001/11/23   * RFS12150
003130011213      *            *              * -Recompile only.
003140030515      ******************************************************************
003150020402      * B.LU       * 2002/01/30   * RFS12102
003160020402      *            *              * -Recompile only.
003170030515      ******************************************************************
003180020401      * R MIGUEL   * 2002/03/25   * RFS 13374 - INCREASE ARRAY SIZE
003190020401      *            *              * OF INVESTMENT TO 1000.
003200030515      ******************************************************************
003210020326      * A.ALNEMER  * 2002/03/26   * RFS12173
003220020326      *            *              * -Recompile only.
003230030515      ******************************************************************
003240020404      * A.ALNEMER  * 2002/04/04   * RFS13184
003250020404      *            *              * -Recompile only.
003260030515      ******************************************************************
003270020405      * B.LU       * 2002/04/04   * RFS13466 Modified RFS13374
003280020405      *            *              * -Investment Code Tabl size was
003290020405      *            *              *  increased to 999 instead of 1000.
003300030515      ******************************************************************
003310020416      * A.ALNEMER  * 2002/04/16   * RFS13211
003320020416      *            *              * -Recompile only.
003330030515      ******************************************************************
003340020614      * A.ALNEMER  * 2002/06/14   * RFS13756
003350020614      *            *              * -Recompile only.
003360030515      ******************************************************************
003370020729      * Fatema Haji*  2002/07/29  * rfs 14470 - recompile for
003380020729      *            *              * Institution-branch file change.
003390030515      ******************************************************************
003400020821      * A.ALNEMER  * 2002/08/21   * RFS13955
003410020821      *            *              * -Recompile only.
003420030515      ******************************************************************
003430020821      * A.ALNEMER  * 2002/08/21   * RFS14136
003440020821      *            *              * -Recompile only.
003450030515      ******************************************************************
003460020925      * B.LU       * 2002/09/25   * RFS14556  Recompile.
003470030515      ******************************************************************
003480021202      * A.ALNEMER  * 2002/12/02   * RFS15022
003490021202      *            *              * -Recompile only.
003500030515      ******************************************************************
003510021218      * A.ALNEMER  * 2002/12/18   * RFS15810
003520021218      *            *              * -Report more detailed transactions
003530021218      *            *              *  deduction information.
003540030515      ******************************************************************
003550030326      * B.LU       * 2003/03/19   * RFS16256  Recompile.
003560030515      ******************************************************************
003570030326      * A.ALNEMER  * 2003/03/26   * RFS16804
003580030326      *            *              * -Add the french accents to the
003590030326      *            *              *  header for version5.
003600030515      ******************************************************************
003610030327      * B.LU       * 2003/03/27   * RFS16633  Recompile.
003620021218      ******************************************************************
003630030623      * O.McMillan * 2003/06/17   * RFS17217  Recompile.
003640030623      ******************************************************************
003650030623      * Odette     * 2003/05/15   * RFS17165  MFASTMEXP expanding from
003660030623      * McMillan   *              * 1100 to 1350. Change work areas.
003670030515      ******************************************************************
003680030624      * O.McMillan * 2003/06/04   * RFS16881  Recompile.
003690030624      ******************************************************************
003700030822      * Odette     * 2003/08/22   * RFS18091  Recompile for addition
003710030822      * McMillan   *              * of Section 17 to CPYJSISTMT.
003720030822      ******************************************************************
003730030825      * Odette     * 2003/08/25   * RFS17380  Recompile for additional
003740030825      * McMillan   *              * fields in Section 05 of CPYJSISTMT.
003750030825      ******************************************************************
003760031003      * Odette     * 2003/09/22   * RFS 18653 - Recompile.
003770031003      * McMillan   *              * Moved Section 17 rec counter field
003780031003      *            *              * in Section 99 to bottom of rec.
003790031003      ******************************************************************
003800031002      * B.LU       * 2003/10/02   * RFS17527  Recompile.
003810031002      ******************************************************************
003820031015      * ALI.A      * 2003/10/15   * RFS17626  Recompile.
003830031015      ******************************************************************
003840031020      * ALI.A      * 2003/10/20   * RFS18667  Recompile.
003850031020      ******************************************************************
003860031021      * ALI.A      * 2003/10/21   * RFS18312  Recompile.
003870031021      ******************************************************************
003880031121      * ALI.A      * 2003/11/21   * RFS18515  Recompile.
003890031121      ******************************************************************
003900031125      * ALI.A      * 2003/11/21   * RFS18814  Recompile.
003910031125      ******************************************************************
003920040217      * ALI.A      * 2004/02/17   * RFS19444  Recompile.
003930040217      ******************************************************************
003940040308      * ALI.A      * 2004/02/23   * RFS20769.
003950040308      *            *              * The "Co/Or Attention" line is not
003960040308      *            *              * being reported in the Nominee
003970040308      *            *              * confirms. This is becuase of a
003980040308      *            *              * new field that was added to the
003990040308      *            *              * Stmt Extract that was not being
004000040308      *            *              * used in the CNFMPRT program.
004010040308      ******************************************************************
004020040324      * Odette     * 2004/03/24   * RFS21587.
004030040324      * McMillan   *              * Bug Fix for incorrect address and
004040040324      *            *              * dealer info being reported.
004050040324      ******************************************************************
004060040514      * ALI.A      * 2004/05/14   * RFS20870
004070040514      *            *              * Validate sections 17-33-38
004080040514      ******************************************************************
004090040414      * ALI.A      * 2004/02/14   * RFS20758  Recompile.
004100040414      ******************************************************************
004110040526      * Odette     *  2004/04/27  * RFS21714 - Recompile
004120040526      * Aguinaldo- *              * Add new fields to Section 10 to
004130040526      * McMillan   *              * indicate if Dealer, Rep or Nominee
004140040526      *            *              * is/isn't suppressed.
004150040526      ******************************************************************
004160040514      * B.LU       * 2004/05/14   * RFS22291
004170040514      *            *              * -Delete changes in RFS20769, 21587
004180040514      *            *              * -Restore the original C/O line.
004190040514      *            *              * -Restrucure the heading lines.
004200040514      *            *              * -Fix a bug in RFS15810.
004210040629      ******************************************************************
004220040629      * Reece Tam  * 2004/05/31   * RFS20804  Recompile - CPYLADASTMT.
004230040514      ******************************************************************
004240040909      * ALI.A      * 2004/09/09   * RFS22740
004250040909      *            *              * -Remove the Dealer/Rep code from
004260040909      *            *              *  Confirm spool if the flag value
004270040909      *            *              *  for field WS-DEALER-REP-SUPPRESS
004280040909      *            *              *  is set to "Y".
004290040909      ******************************************************************
004300040928      * B.LU       * 2004/09/28   * RFS18924 -RECOMPILE - CPYJSISTMT.
004310040928      ******************************************************************
004320041012      * B.LU       * 2004/10/12   * RFS22856 -RECOMPILE - CPYJSISTMT.
004330041012      ******************************************************************
004340041025      * ALI.A      * 2004/10/25   * RFS18780 -RECOMPILE - CPYJSISTMT.
004350041025      ******************************************************************
004360041028      * ALI.A      * 2004/10/28   * RFS21715 -RECOMPILE - CPYJSISTMT.
004370041028      ******************************************************************
004380041215      * Odette A.  * 2004/10/15   * RFS23390 - Remove blank line before
004390041215      * McMillan   *              * XREF or SIN line is printed.
004400041215      ******************************************************************
004410041224      * B.LU       * 2004/12/24   * RFS24514 -RECOMPILE - CPYJSISTMT
004420041224      ******************************************************************
004430050411      * B.LU       * 2005/04/11   * RFS26894 - Added AT-ERF to
004440050411      *            *              *            WS-DEDUCTIONS
004450050429      ******************************************************************
004460050429      * Chandana R * 2005/03/09   * RFS26213 -RECOMPILE - CPYJSISTMT
004470050411      ******************************************************************
004480051002      * ADE ADEYEMI* 2005/09/08   * RFS29550 -RECOMPILE - CPYJSISTMT
004490051002      ******************************************************************
004500051002      * ADE ADEYEMI* 2005/09/28   * RFS30065 -RECOMPILE - CPYJSISTMT
004510051002      ******************************************************************
004520050920      * Ali.A      * 2005/09/18   * RFS28931 -RECOMPILE - CPYJSISTMT
004530050920      ******************************************************************
004540050926      * C.LENTINI  * 2005/09/26   * RFS28692 -RECOMPILE - CPYJSISTMT
004550050926      ******************************************************************
004560050926      * Geeta S.   * 2005/09/15   * RFS 28107: Recompile for CPYJSISTMT
004570050926      ******************************************************************
004580060818      * Raymond Mui* 2006/08/18   * RFS34848 : Recompile for CPYJSISTMT
004590060821      *            *              *            and CPYLDASTMT.
004600060824      *            *              *            Validates section 81.
004610060818      ******************************************************************
004620061024      * L. Wong    * 2006/10/24   * RFS36342 - Recompile - CPYJSISTMT,
004630061024      *            *              *                        CPYLDASTMT.
004640080620      ******************************************************************
004650080620      * Bathuu L   * 2008/06/20   * RFS50993 -RECOMPILE - CPYJSISTMT
004660061024      ******************************************************************
004670090302      * R. Gill    * 2009/02/18   * RFS 64527 - Variable size array
004680090914      * R. Gill    * 2009/08/13   * RFS 72304 - INITIALIZE VAR ARRAY
004690091111      ******************************************************************
004700091124      * Andy Lo    * 2009/11/24   * RFS69515  Recompile - CPYLADASTMT.
004710091124      *            *              *           ADD SECTION 63.
004720090302      *******************************************************************
004730100308      * A. Lo      * 2010/03/08   * RFS78161 -Recompile - CPYJSISTMT.
004740100308      *******************************************************************
004750100308      * A. Lo      * 2010/03/08   * RFS74626 -Recompile - CPYJSISTMT.
004760100308      *******************************************************************
004770120127      * Rekha S    * 2012/01/27   * RFS93662 -Recompile - CPYJSISTMT.
004780120127      *******************************************************************
004790120912      * Suresh G.  * 2012/09/12   * RFS112003-Recompile for CPYJSISTMT.
004800120912      *******************************************************************
004810130408      * Andy Chan  * 2013/04/08   * RFS117038 Add Section 22
004820130408      *******************************************************************
004830130529      * NOBLE T    * 2013/05/29   * RFS12116
004840130529      *            *              * -RECOMPILE ONLY.
004850130905      *******************************************************************
004860130905      * PRAVEEN E  * 2013/09/05   * RFS123925 RECOMPIL ONLY - CPYJSISTMT*
004870140519      * NOBLE T    * 2014/05/02   * RFS130239 - RECOMPILE - CPYJSISTMT. *
004880140725      *SANGEETHA V  * 2014/03/25 * RFS129378 - RECOMPILE FOR CPYJSISTMT*
004890140624      * JEYARAJAN  * 2014/06/24   * RFS132121 - INTRODUCE A NEW FIELD   *
004900140624      *            *              * TO HANDLE THE ERROR ON SEC 16       *
004910140925      * NAGAMNAI S * 2014/08/13   * RFS139007 - RECOMPILE FOR CPGLWBRULE
004920140814      * Suresh G.  * 2014/08/14   * RFS133489-Recompile for CPYJSISTMT.
004930141007      * JEYARAJAN  * 2014/10/07   * RFS141165 - Jobconfrim MSW
004940190905      * POOJA K    * 2015/02/16   * RFS 143392 - RECOMPILE FOR CPYJSISTMT
004950150416      * POOJA K    * 2015/03/27   * RFS 144030 - RECOMPILE FOR CPYJSISTMT
004960150423      * POOJA K    * 2015/04/21   * RFS 142884 - RECOMPILE FOR CPYJSISTMT
004970150511      * POOJA K    * 2015/05/08   * RFS144587 - RECOMPILE FOR CPYJSISTMT
004980190619      * MAYILSAMY D* 2019/06/18   * RFS183449 - Populate account type  *
004990190619      *            *              * code based upon investor language  *
005000190619      *            *              * in statement extract               *
005001190924      * Arthy K    * 2019/09/03   * RFS1018431 - Rollback changes done *
005006190924      *            *              * in RFS: 183449                     *
005007190924      * Arthy K    * 2019/09/24   * RFS184715 - Put back changes in RFS*
005008190924      *            *              * 183449 with additional logic of    *
005009190924      *            *              * new edit code 'STMATL'             *
005010211019      * Surendran C* 2021/10/19   * RFS186592 -RECOMPILE FOR CPYJSISTMT*
005011130529      *******************************************************************
005020000000      /
005030000000       ENVIRONMENT DIVISION.
005040000000
005050000000      ******************************************************************
005060000000      *                                                                *
005070000000      *    E N V I R O N M E N T   D I V I S I O N                     *
005080000000      *                                                                *
005090000000      ******************************************************************
005100000000
005110000000       CONFIGURATION SECTION.
005120000000
005130000000      ******************************************************************
005140000000      *                                                                *
005150000000      *    C O N F I G U R A T I O N   S E C T I O N                   *
005160000000      *                                                                *
005170000000      ******************************************************************
005180000000
005190000000       SOURCE-COMPUTER.    AS-400.
005200000000       OBJECT-COMPUTER.    AS-400.
005210000000
005220000000       SPECIAL-NAMES.
005230000000
005240000000      *****
005250000000      *****    Special Names.
005260000000      *****
005270000000
005280000000           LOCAL-DATA          IS  WS-LOCAL.
005290000000      /
005300000000       INPUT-OUTPUT SECTION.
005310000000
005320000000      ******************************************************************
005330000000      *                                                                *
005340000000      *    I N P U T   /   O U T P U T   S E C T I O N                 *
005350000000      *                                                                *
005360000000      ******************************************************************
005370000000
005380000000       FILE-CONTROL.
005390000000
005400000000      *****
005410000000      *****    FILE CONTROL.
005420000000      *****
005430000000      /
005440000000           SELECT DEALER-MAILING-INSTR
005450000000               ASSIGN          TO  DATABASE-MFADEAMIP
005460000000               ORGANIZATION    IS  INDEXED
005470000000               ACCESS          IS  DYNAMIC
005480000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
005490000000               FILE STATUS     IS  WS-FILSTAT.
005500000000
005510000000           SELECT DEALER-FILE
005520000000               ASSIGN          TO  DATABASE-MFADEAP
005530000000               ORGANIZATION    IS  INDEXED
005540000000               ACCESS          IS  RANDOM
005550000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
005560000000               FILE STATUS     IS  WS-FILSTAT.
005570000000
005580000000           SELECT DEALER-REP-FILE
005590000000               ASSIGN          TO  DATABASE-MFADEAREP
005600000000               ORGANIZATION    IS  INDEXED
005610000000               ACCESS          IS  RANDOM
005620000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
005630000000               FILE STATUS     IS  WS-FILSTAT.
005640000000
005650000000           SELECT DEALER-REP-MAILING-INSTR
005660000000               ASSIGN          TO  DATABASE-MFADERMIP
005670000000               ORGANIZATION    IS  INDEXED
005680000000               ACCESS          IS  DYNAMIC
005690000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
005700000000               FILE STATUS     IS  WS-FILSTAT.
005710000000
005720980323           SELECT  INVESTOR-JOIN
005730980323                   ASSIGN          TO  DATABASE-MFAACOJLA
005740980323                   ORGANIZATION    IS  INDEXED
005750980323                   ACCESS          IS  DYNAMIC
005760980323                   RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
005770980323                                 WITH  DUPLICATES.
005780980323
005790000000           SELECT DEALER-REP-ADDRESS
005800000000               ASSIGN          TO  DATABASE-MFADRADRP
005810000000               ORGANIZATION    IS  INDEXED
005820000000               ACCESS          IS  RANDOM
005830000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
005840000000               FILE STATUS     IS  WS-FILSTAT.
005850000000
005860000000           SELECT INSTITUTION-ADDRESS
005870000000               ASSIGN          TO  DATABASE-MFAINADDP
005880000000               ORGANIZATION    IS  INDEXED
005890000000               ACCESS          IS  RANDOM
005900000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
005910000000               FILE STATUS     IS  WS-FILSTAT.
005920000000
005930000000           SELECT INSTITUTION-BRANCH
005940000000               ASSIGN          TO  DATABASE-MFAINSBRP
005950000000               ORGANIZATION    IS  INDEXED
005960000000               ACCESS          IS  RANDOM
005970000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
005980000000               FILE STATUS     IS  WS-FILSTAT.
005990000000
006000980323           SELECT NOMINEE-ACCOUNT-TYPE-DESCR
006010980323               ASSIGN          TO  DATABASE-MFANMTPYP
006020980323               ORGANIZATION    IS  INDEXED
006030980323               ACCESS          IS  DYNAMIC
006040980323               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
006050190614
006060190618      *RFS183449-Starts
006070190614           SELECT  ACCOUNT-FILE-2
006080190614                   ASSIGN          TO  DATABASE-MFAACCNTP
006090190614                   ORGANIZATION    IS  INDEXED
006100190614                   ACCESS          IS  DYNAMIC
006110190614                   RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
006120190614      *RFS183449-Ends
006130190614
006140991102           SELECT ACCOUNT-TYPE-BK
006150991102               ASSIGN          TO  DATABASE-MFAACCTYP
006160991102               ORGANIZATION    IS  INDEXED
006170991102               ACCESS          IS  SEQUENTIAL
006180991102               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
006190991102
006200000000           SELECT NOMINEE-MAILING-INSTRUCTIONS
006210000000               ASSIGN          TO  DATABASE-MFANOMMIP
006220000000               ORGANIZATION    IS  INDEXED
006230000000               ACCESS          IS  DYNAMIC
006240000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
006250000000               FILE STATUS     IS  WS-FILSTAT.
006260000000
006270000000           SELECT STMT-MSG-FILE
006280000000               ASSIGN          TO  DATABASE-MFASTMMSP
006290000000               ORGANIZATION    IS  INDEXED
006300000000               ACCESS          IS  DYNAMIC
006310000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
006320000000               FILE STATUS     IS  WS-FILSTAT.
006330000000
006340000000           SELECT STMT-PRT-DTL-FILE
006350000000               ASSIGN          TO  DATABASE-MFASTMPDP
006360000000               ORGANIZATION    IS  INDEXED
006370000000               ACCESS          IS  DYNAMIC
006380000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
006390000000               FILE STATUS     IS  WS-FILSTAT.
006400000000
006410000000           SELECT STMT-PRT-HDR-FILE
006420000000               ASSIGN          TO  DATABASE-MFASTMPHP
006430000000               ORGANIZATION    IS  INDEXED
006440000000               ACCESS          IS  DYNAMIC
006450000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
006460000000               FILE STATUS     IS  WS-FILSTAT.
006470000000
006480000000           SELECT STMT-DTA-FILE
006490000000               ASSIGN          TO  DATABASE-MFASTMEXP
006500000000               ORGANIZATION    IS  INDEXED
006510980130               ACCESS          IS  SEQUENTIAL
006520000000               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
006530000000               FILE STATUS     IS  WS-FILSTAT.
006540980130
006550980130           SELECT CURRENCY-FILE
006560980130               ASSIGN          TO  DATABASE-MFACURP
006570980130               ORGANIZATION    IS  INDEXED
006580980202               ACCESS          IS  SEQUENTIAL
006590980130               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
006600980130               FILE STATUS     IS  WS-FILSTAT.
006610980130
006620980130           SELECT INVESTMENT-FILE
006630010222               ASSIGN          TO  DATABASE-MFAINVP
006640980130               ORGANIZATION    IS  INDEXED
006650010221               ACCESS          IS  SEQUENTIAL
006660980130               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
006670980130               FILE STATUS     IS  WS-FILSTAT.
006680000000
006690010222RF8307     SELECT PRODUCT-TYPE-CODES
006700010221               ASSIGN          TO  DATABASE-MFAPRTCDP
006710010221               ORGANIZATION    IS  INDEXED
006720010222               ACCESS          IS  DYNAMIC
006730010221               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
006740010221
006750021219R15810     SELECT TRANS-DEDUCTION-DESCR
006760021219  ¦            ASSIGN          TO  DATABASE-MFATRNDEP
006770021219  ¦            ORGANIZATION    IS  INDEXED
006780021219  ¦            ACCESS          IS  DYNAMIC
006790021219R15810         RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
006800021219
006810000000           SELECT PRINT-FILE
006820000000               ASSIGN          TO  PRINTER-QPRINT.
006830000000      /
006840000000       DATA DIVISION.
006850000000
006860000000      ******************************************************************
006870000000      *                                                                *
006880000000      *    D A T A   D I V I S I O N                                   *
006890000000      *                                                                *
006900000000      ******************************************************************
006910000000
006920000000       FILE SECTION.
006930000000
006940000000      ******************************************************************
006950000000      *                                                                *
006960000000      *    F I L E   S E C T I O N                                     *
006970000000      *                                                                *
006980000000      ******************************************************************
006990000000      /
007000000000      ******************************************************************
007010000000      *                                                                *
007020000000      *    MFADEAMIP:  Dealer Mailing Instruction                      *
007030000000      *                                                                *
007040000000      ******************************************************************
007050000000
007060000000       FD  DEALER-MAILING-INSTR
007070000000           LABEL RECORDS      ARE  OMITTED.
007080000000
007090000000       01  DEALER-MAILING-INSTR-RECD.  COPY DD-ALL-FORMATS
007100000000                                           OF  MFADEAMIP.
007110000000      /
007120000000      ******************************************************************
007130000000      *                                                                *
007140000000      *    MFADEAP:    Dealer                                          *
007150000000      *                                                                *
007160000000      ******************************************************************
007170000000
007180000000       FD  DEALER-FILE
007190000000           LABEL RECORDS      ARE  OMITTED.
007200000000
007210000000       01  DEALER-RECD.                COPY DD-ALL-FORMATS
007220000000                                           OF  MFADEAP.
007230000000      /
007240000000      ******************************************************************
007250000000      *                                                                *
007260000000      *    MFADEAREP:  Dealer Representative                           *
007270000000      *                                                                *
007280000000      ******************************************************************
007290000000
007300000000       FD  DEALER-REP-FILE
007310000000           LABEL RECORDS      ARE  OMITTED.
007320000000
007330000000       01  DEALER-REP-RECD.            COPY DD-ALL-FORMATS
007340000000                                           OF  MFADEAREP.
007350000000      /
007360000000      ******************************************************************
007370000000      *                                                                *
007380000000      *    MFADERMIP:  Dealer Representative Mailing Instruction       *
007390000000      *                                                                *
007400000000      ******************************************************************
007410000000
007420000000       FD  DEALER-REP-MAILING-INSTR
007430000000           LABEL RECORDS      ARE  OMITTED.
007440000000
007450000000       01  DLRREP-MAILING-INSTR-RECD.  COPY DD-ALL-FORMATS
007460000000                                           OF  MFADERMIP.
007470000000      /
007480000000      ******************************************************************
007490000000      *                                                                *
007500000000      *    MFADRADRP:  Dealer Representative Address                   *
007510000000      *                                                                *
007520000000      ******************************************************************
007530000000
007540000000       FD  DEALER-REP-ADDRESS
007550000000           LABEL RECORDS      ARE  OMITTED.
007560000000
007570000000       01  DEALER-REP-ADDRESS-RECD.    COPY DD-ALL-FORMATS
007580000000                                           OF  MFADRADRP.
007590000000      /
007600000000      ******************************************************************
007610000000      *                                                                *
007620000000      *    MFAINADDP:  Institution Address                             *
007630000000      *                                                                *
007640000000      ******************************************************************
007650000000
007660000000       FD  INSTITUTION-ADDRESS
007670000000           LABEL RECORDS      ARE  OMITTED.
007680000000
007690000000       01  INSTITUTION-ADDRESS-RECD.   COPY DD-ALL-FORMATS
007700000000                                           OF  MFAINADDP.
007710000000      /
007720000000      ******************************************************************
007730000000      *                                                                *
007740000000      *    MFAINSBRP:  Institution Branch                              *
007750000000      *                                                                *
007760000000      ******************************************************************
007770000000
007780000000       FD  INSTITUTION-BRANCH
007790000000           LABEL RECORDS      ARE  OMITTED.
007800000000
007810000000       01  INSTITUTION-BRANCH-RECD.    COPY DD-ALL-FORMATS
007820000000                                           OF  MFAINSBRP.
007830980323      /
007840980323      ****************************************************************
007850980323      *                                                              *
007860980323      *  MFAACOJLA:    Investor Join                                 *
007870980323      *                                                              *
007880980323      ****************************************************************
007890980323
007900980323       FD  INVESTOR-JOIN
007910980323           LABEL RECORDS      ARE  STANDARD.
007920980323
007930980323       01  INVESTOR-J-REC.             COPY DD-ALL-FORMATS
007940980323                                            OF MFAACOJLA.
007950000000      /
007960980323      *****************************************************************
007970980323      *                                                               *
007980980323      *    MFANMTPYP:  Nominee Account Type Descr                     *
007990980323      *                                                               *
008000980323      *****************************************************************
008010980323
008020980323       FD  NOMINEE-ACCOUNT-TYPE-DESCR
008030980323           LABEL RECORDS ARE STANDARD.
008040980323
008050980323       01  NOMINEE-ACCOUNT-TYPE-DESCR-REC.
008060980323                               COPY DD-ALL-FORMATS OF MFANMTPYP.
008070190614
008080190614      *RFS183449-Starts
008090190614       FD  ACCOUNT-FILE-2
008100190614           LABEL RECORDS      ARE  STANDARD.
008110190614
008120190619       01  ACCOUNT-REC-2.
008130190619       COPY DD-ALL-FORMATS OF MFAACCNTP.
008140190614      *RFS183449-Ends
008150991102
008160991102      ******************************************************************
008170991102      *                                                                *
008180991102      *    MFAACTYLP:  Account Type File                               *
008190991102      *                                                                *
008200991102      ******************************************************************
008210980323      /
008220991102       FD  ACCOUNT-TYPE-BK
008230991102           LABEL RECORDS      ARE  STANDARD.
008240991102
008250991102       01  ACCOUNT-TYPE-BK-REC.        COPY DD-ALL-FORMATS
008260991102                                            OF MFAACCTYP.
008270000000      ******************************************************************
008280000000      *                                                                *
008290000000      *    MFANOMMIP:  Nominee Mailing Instruction                     *
008300000000      *                                                                *
008310000000      ******************************************************************
008320000000
008330000000       FD  NOMINEE-MAILING-INSTRUCTIONS
008340000000           LABEL RECORDS      ARE  OMITTED.
008350000000
008360000000       01  NOMINEE-MAILING-INST-RECD.  COPY DD-ALL-FORMATS
008370000000                                           OF  MFANOMMIP.
008380000000      /
008390000000      ******************************************************************
008400000000      *                                                                *
008410000000      *    MFASTMMSP:  Statement Message                               *
008420000000      *                                                                *
008430000000      ******************************************************************
008440000000
008450000000       FD  STMT-MSG-FILE
008460000000           LABEL RECORDS      ARE  OMITTED.
008470000000
008480000000       01  STMT-MSG-RECD.              COPY DD-ALL-FORMATS
008490000000                                           OF  MFASTMMSP.
008500000000      /
008510000000      ******************************************************************
008520000000      *                                                                *
008530000000      *    MFASTMPDP:  Statement Print Detail                          *
008540000000      *                                                                *
008550000000      ******************************************************************
008560000000
008570000000       FD  STMT-PRT-DTL-FILE
008580000000           LABEL RECORDS      ARE  OMITTED.
008590000000
008600000000       01  STMT-PRT-DTL-RECD.          COPY DD-ALL-FORMATS
008610000000                                           OF  MFASTMPDP.
008620000000      /
008630000000      ******************************************************************
008640000000      *                                                                *
008650000000      *    MFASTMPHP:  Statement Print Header                          *
008660000000      *                                                                *
008670000000      ******************************************************************
008680000000
008690000000       FD  STMT-PRT-HDR-FILE
008700000000           LABEL RECORDS      ARE  OMITTED.
008710000000
008720980130       01  STMT-PRT-HDR-RECD.          COPY DD-ALL-FORMATS
008730000000                                           OF  MFASTMPHP.
008740000000      /
008750000000      ******************************************************************
008760000000      *                                                                *
008770000000      *    MFASTMEXP:  Statement Extract Data                          *
008780000000      *                                                                *
008790000000      ******************************************************************
008800000000
008810000000       FD  STMT-DTA-FILE
008820000000           LABEL RECORDS      ARE  OMITTED.
008830000000
008840000000       01  STMT-DTA-RECD.              COPY DD-ALL-FORMATS
008850000000                                       OF MFASTMEXP.
008860980130      /
008870980130      ******************************************************************
008880980130      *                                                                *
008890980130      *    MFACURP:    Currency                                        *
008900980130      *                                                                *
008910980130      ******************************************************************
008920980130
008930980130       FD  CURRENCY-FILE
008940980130           LABEL RECORDS      ARE  OMITTED.
008950980130
008960980130       01  CURRENCY-RECD.              COPY DD-ALL-FORMATS
008970980130                                       OF MFACURP.
008980980130      /
008990980130      ******************************************************************
009000980130      *                                                                *
009010980130      *    MFAINVP:    Investment                                      *
009020980130      *                                                                *
009030980130      ******************************************************************
009040980130
009050980130       FD  INVESTMENT-FILE
009060980130           LABEL RECORDS      ARE  OMITTED.
009070980130
009080010222       01  INVESTMENT-REC.             COPY DD-ALL-FORMATS
009090010222                                       OF MFAINVP.
009100010221      /
009110010222RF8307 FD  PRODUCT-TYPE-CODES
009120010221           LABEL RECORDS      ARE  STANDARD.
009130010221
009140010221       01  PRODUCT-TYPE-CODES-REC.     COPY DD-ALL-FORMATS
009150010221                                            OF MFAPRTCDP.
009160000000      /
009170021219      ******************************************************************
009180021219      *                                                                *
009190021219      *    MFATRNDEP   Trans-Deduction-Descr                           *
009200021219      *                                                                *
009210021219      ******************************************************************
009220021219R15810 FD  TRANS-DEDUCTION-DESCR
009230021219  ¦        LABEL RECORDS      ARE  STANDARD.
009240021219  ¦
009250021219R15810 01  TRANS-DEDUCTION-DESCR-REC.     COPY DD-ALL-FORMATS
009260021219                                            OF MFATRNDEP.
009270000000      ******************************************************************
009280000000      *                                                                *
009290000000      *    QPRINT:     Control Report                                  *
009300000000      *                                                                *
009310000000      ******************************************************************
009320000000
009330000000       FD  PRINT-FILE
009340000000           LABEL RECORDS      ARE  OMITTED.
009350000000
009360000000       01  PRINT-RECD                  PICTURE X(150).
009370000000      /
009380000000       WORKING-STORAGE SECTION.
009390000000
009400000000      ******************************************************************
009410000000      *                                                                *
009420000000      *    W O R K I N G   S T O R A G E   S E C T I O N               *
009430000000      *                                                                *
009440000000      ******************************************************************
009450000000      /
009460000000       01  WS-LOCAL-DATA-AREA.         COPY CPYLDASTMT.
009470000000      /
009480000000       01  WS-DEAMLGINS-REC.           COPY DD-ALL-FORMATS
009490000000                                           OF  MFADEAMIP.
009500000000      /
009510000000       01  WS-DERMLGINS-REC.           COPY DD-ALL-FORMATS
009520000000                                           OF  MFADERMIP.
009530000000      /
009540000000       01  WS-NOMMLGINS-REC.           COPY DD-ALL-FORMATS
009550000000                                           OF  MFANOMMIP.
009560000000      /
009570000000                                       COPY CPYJSISTMT.
009580000000      /
009590021219      ******************************************************************
009600021219      *                                                                *
009610021219      *    D E D U C T I O N   C O D E   D E S C R I P T I O N         *
009620021219      *                                                                *
009630021219      ******************************************************************
009640021219R15810 01  WS-DEDUCTION-CODE-DESCRIPTION.
009650021225  ¦        03  WS-CDSC           PIC X(4)   VALUE "CDSC".
009660021225  ¦        03  WS-COMM           PIC X(4)   VALUE "COMM".
009670021225  ¦        03  WS-GST            PIC X(4)   VALUE "GST ".
009680021225  ¦        03  WS-PST            PIC X(4)   VALUE "PST ".
009690021225  ¦        03  WS-FEDT           PIC X(4)   VALUE "FEDT".
009700021225  ¦        03  WS-PRVT           PIC X(4)   VALUE "PRVT".
009710030102  ¦        03  WS-NONT           PIC X(4)   VALUE "NONT".
009720021225R15810     03  WS-ADMN           PIC X(4)   VALUE "ADMN".
009730980910      ******************************************************************
009740980910      *                                                                *
009750980910      *    I N V E S T O R   I N F O R M A T I O N   T A B L E         *
009760980910      *                                                                *
009770980910      ******************************************************************
009780021219       01  WS-INVESTOR-INFO-TBL.
009790000816      *    03  WS-INVESTOR-INFO   PIC X(750)     OCCURS 50 TIMES
009800010412RF7503*    03  WS-INVESTOR-INFO   PIC X(850)     OCCURS 50 TIMES
009810090302R17165     03  WS-INVESTOR-INFO   PIC X(1350)    OCCURS 50 TIMES
009820090302                                                 INDEXED BY II.
009830000626RF6725/
009840000626      ******************************************************************
009850000626      *                                                                *
009860000626      *    D E A L E R       I N F O R M A T I O N   T A B L E         *
009870000626      *                                                                *
009880000626      ******************************************************************
009890000626       01  WS-DEALER-INFO-TBL.
009900000816      *    03  WS-DEALER-INFO     PIC X(750)     OCCURS 50 TIMES
009910010412      *    03  WS-DEALER-INFO     PIC X(850)     OCCURS 50 TIMES
009920030528R17165     03  WS-DEALER-INFO     PIC X(1350)    OCCURS 50 TIMES
009930000626                                                 INDEXED BY DI.
009940010517
009950010517R10081*****************************************************************
009960010517      *
009970010517      *    G   I   C        I N F O R M A T I O N   T A B L E
009980010517      *
009990010517      *****************************************************************
010000010517       01  WS-GIC-INFO-TBL.
010010030528R17165     03  WS-GIC-INFO     PIC X(1350)       OCCURS 100 TIMES
010020010517                                                 INDEXED BY GIC.
010030010517
010040010517      *****************************************************************
010050010517      * A C C O U N T   F U N D   D E T A I L S   T A B L E
010060010517      *****************************************************************
010070010517       01  WS-ACCOUNT-FUND-TABLE.
010080030528R17165     03  WS-ACCOUNT-FUND-DETAILS  PIC X(1350) OCCURS 100 TIMES
010090010517                                                    INDEXED BY AFD.
010100010517
010110010517      *****************************************************************
010120010517      * A C C O U N T   G I C     D E T A I L S   T A B L E
010130010517      *****************************************************************
010140010517       01  WS-ACCOUNT-GIC-TABLE.
010150030528R17165     03  WS-ACCOUNT-GIC-DETAILS  PIC X(1350) OCCURS 100 TIMES
010160010517                                                    INDEXED BY AGD.
010170010517
010180010517      *****************************************************************
010190010517      * A C C O U N T   D I I     D E T A I L S   T A B L E
010200010517      *****************************************************************
010210010517       01  WS-ACCOUNT-DII-TABLE.
010220030528R17165     03  WS-ACCOUNT-DII-DETAILS  PIC X(1350) OCCURS 100 TIMES
010230010517R10081                                              INDEXED BY ADID.
010240010517
010250030528R17165 01  WS-ACCOUNT-FUND-DETAILS-TEMP  PIC X(1350).
010260010619
010270000000      ******************************************************************
010280000000      *                                                                *
010290000000      *    S T A T E M E N T   S A V E   P A G E                       *
010300000000      *                                                                *
010310000000      ******************************************************************
010320000000
010330000000       01  WS-STATEMENT-PAGE.
010340000000           03  WS-STMTPGE-LNE          OCCURS  88  TIMES
010350000000                                       INDEXED BY  SPL
010360000000                                       PICTURE X(150).
010370000000
010380000000      *****
010390000000      *****    Standard Version
010400000000      *****
010410000000
010420000000       01  WS-STATEMENT-PAGE-R         REDEFINES WS-STATEMENT-PAGE.
010430971202           03  FILLER                  PICTURE X(5400).
010440990331           03  WS-STMTPGE-DTL          PICTURE X(6600).
010450990331           03  WS-STMTPGE-MSG          PICTURE X(1050).
010460990331           03  FILLER                  PICTURE X(150).
010470000000
010480990928      *****
010490990928      *****    VERSION 6:  USED BY UBS.
010500990928      *****
010510990928
010520990928       01  WS-STATEMENT-PAGE-V3-R      REDEFINES WS-STATEMENT-PAGE.
010530990930           03  FILLER                  PICTURE X(4650).
010540990930           03  WS-STMTPGE-DTL-V3       PICTURE X(5850).
010550990930           03  FILLER                  PICTURE X(150).
010560011009R11747*    03  WS-STMTPGE-MSG-V4       PICTURE X(1800).
010570011009R11747     03  WS-STMTPGE-MSG-V3       PICTURE X(1800).
010580990930           03  FILLER                  PICTURE X(750).
010590011009
010600011009R11747*****
010610011009      *****    GIC/DII  Version
010620011009      *****
010630011009
010640011009       01  WS-STATEMENT-PAGE-V4-R      REDEFINES WS-STATEMENT-PAGE.
010650011009           03  FILLER                  PICTURE X(4650).
010660011009           03  WS-STMTPGE-DTL-V4       PICTURE X(6350).
010670011009           03  WS-STMTPGE-MSG-V4       PICTURE X(1050).
010680011009           03  FILLER                  PICTURE X(150).
010690011009
010700000000      /
010710000000      ******************************************************************
010720000000      *                                                                *
010730000000      *    S T A T E M E N T   M E S S A G E   S A V E   A R E A       *
010740000000      *                                                                *
010750000000      ******************************************************************
010760000000
010770000000       01  WS-STATEMENT-PAGE-MESSAGE.
010780990331           03  WS-STMTPGE-MSGLNE       OCCURS  7 TIMES
010790000000                                       INDEXED BY  SPML
010800000000                                       PICTURE X(150).
010810000000      /
010820000000      ******************************************************************
010830000000      *                                                                *
010840000000      *    S T A T E M E N T   H E A D I N G   P R I N T   L I N E S   *
010850000000      *                                                                *
010860000000      ******************************************************************
010870000000
010880000000      *****
010890971203      *****    The statement heading lines will be re-defined
010900000000      *****
010910000000      /
010920000000       01  STMT-HDG-01.
010930980213           03  FILLER                  PICTURE X(78).
010940000000           03  SH01-LIT1               PICTURE X(20).
010950000000           03  FILLER                  PICTURE X(1).
010960991004           03  SH01-START-DATE         PICTURE XXXX/XX/XX.
010970000000           03  FILLER                  PICTURE X(1).
010980000000           03  SH01-LIT2               PICTURE X(2).
010990000000           03  FILLER                  PICTURE X(1).
011000991004           03  SH01-END-DATE           PICTURE XXXX/XX/XX.
011010991004           03  FILLER                  PICTURE X(27).
011020990927
011030990820       01  STMT-HDG-01-V1-R            REDEFINES STMT-HDG-01.
011040990820           03  FILLER                  PICTURE X(75).
011050990820           03  SH01V1-LIT1             PICTURE X(20).
011060990820           03  FILLER                  PICTURE X(1).
011070991015           03  SH01V1-START-DATE       PICTURE XXXX/XX/XX.
011080990820           03  FILLER                  PICTURE X(1).
011090990820           03  SH01V1-LIT2             PICTURE X(2).
011100990820           03  FILLER                  PICTURE X(1).
011110991015           03  SH01V1-END-DATE         PICTURE XXXX/XX/XX.
011120991015           03  FILLER                  PICTURE X(30).
011130990927
011140990927       01  STMT-HDG-01-V3-R            REDEFINES STMT-HDG-01.
011150990927           03  FILLER                  PICTURE X(130).
011160010517
011170010517R10081 01  STMT-HDG-01-V4-R            REDEFINES STMT-HDG-01.
011180010522           03  FILLER                  PICTURE X(73).
011190010517           03  SH01V4-LIT1             PICTURE X(20).
011200010607           03  FILLER                  PICTURE X(4).
011210010517           03  SH01V4-START-DATE       PICTURE XXXX/XX/XX.
011220010607           03  FILLER                  PICTURE X(4).
011230010517           03  SH01V4-LIT2             PICTURE X(2).
011240010607           03  FILLER                  PICTURE X(4).
011250010517           03  SH01V4-END-DATE         PICTURE XXXX/XX/XX.
011260010607R10081     03  FILLER                  PICTURE X(23).
011270990928
011280000000      /
011290000000       01  STMT-HDG-02.
011300971204           03  FILLER                  PICTURE X(8).
011310971204           03  SH02-INVESTOR-NAME      PICTURE X(45).
011320980220           03  FILLER                  PICTURE X(15).
011330980213           03  SH02-LIT                PICTURE X(15).
011340980213           03  FILLER                  PICTURE X(27).
011350971202           03  SH02-PGE-LIT1           PICTURE X(4).
011360971202           03  FILLER                  PICTURE X(3).
011370000000           03  SH02-PGENO              PICTURE ZZ9.
011380980220           03  FILLER                  PICTURE X(30).
011390990927
011400990927       01  STMT-HDG-02-V3-R            REDEFINES STMT-HDG-02.
011410990927           03  FILLER                  PICTURE X(10).
011420990928           03  SH02V3-INVESTOR-NAME    PICTURE X(45).
011430990927           03  FILLER                  PICTURE X(20).
011440990928           03  SH02V3-LIT1             PICTURE X(20).
011450990928           03  SH02V3-START-DATE       PICTURE XXXX/XX/XX.
011460990927           03  FILLER                  PICTURE X(1).
011470990928           03  SH02V3-LIT2             PICTURE X(2).
011480990927           03  FILLER                  PICTURE X(1).
011490990928           03  SH02V3-END-DATE         PICTURE XXXX/XX/XX.
011500000224           03  FILLER                  PICTURE X(11).
011510990927
011520010519R10081 01  STMT-HDG-02-V4-R            REDEFINES STMT-HDG-02.
011530010522           03  FILLER                  PICTURE X(6).
011540010519           03  SH02V4-INVESTOR-NAME    PICTURE X(45).
011550010522R10081     03  FILLER                  PICTURE X(99).
011560010517
011570971204      /
011580971204       01  STMT-HDG-EXTRA.
011590971204           03  FILLER                  PICTURE X(8).
011600971204           03  SHEX-INVESTOR-ADDRESS1  PICTURE X(40).
011610971204           03  FILLER                  PICTURE X(102).
011620990928
011630990927       01  STMT-HDG-EXTRA-V3-R         REDEFINES STMT-HDG-EXTRA.
011640990927           03  FILLER                  PICTURE X(10).
011650990928           03  SHEXV3-INVESTOR-ADDRESS1  PICTURE X(40).
011660990929           03  FILLER                  PICTURE X(60).
011670990928           03  SHEXV3-PGE-LIT1         PICTURE X(4).
011680000224           03  FILLER                  PICTURE X(1).
011690990928           03  SHEXV3-PGENO            PICTURE ZZ9.
011700000224           03  FILLER                  PICTURE X(12).
011710010519
011720010519R10081 01  STMT-HDG-EXTRA-V4-R         REDEFINES STMT-HDG-EXTRA.
011730010522           03  FILLER                  PICTURE X(6).
011740010519           03  SHEXV4-INVESTOR-ADDRESS1  PICTURE X(40).
011750010519           03  FILLER                  PICTURE X(60).
011760010519           03  SHEXV4-PGE-LIT1         PICTURE X(4).
011770010519           03  FILLER                  PICTURE X(1).
011780010519           03  SHEXV4-PGENO            PICTURE ZZ9.
011790010522R10081     03  FILLER                  PICTURE X(36).
011800010517
011810000000      /
011820000000       01  STMT-HDG-03.
011830000000           03  FILLER                  PICTURE X(8).
011840971204           03  SH03-INVESTOR-ADDRESS2  PICTURE X(40).
011850971209           03  FILLER                  PICTURE X(30).
011860990317           03  SH03-LIT1               PICTURE X(17).
011870990317           03  FILLER                  PICTURE X(1).
011880971202           03  SH03-DEALER             PICTURE X(4).
011890971202           03  FILLER                  PICTURE X(2).
011900971204           03  SH03-DEALER-NAMES       PICTURE X(35).
011910990317           03  FILLER                  PICTURE X(13).
011920990928
011930990820       01  STMT-HDG-03-V1-R            REDEFINES STMT-HDG-03.
011940990820           03  FILLER                    PICTURE X(8).
011950990820           03  SH03V1-INVESTOR-ADDRESS2  PICTURE X(40).
011960990820           03  FILLER                    PICTURE X(27).
011970990820           03  SH03V1-LIT1               PICTURE X(17).
011980990820           03  FILLER                    PICTURE X(1).
011990990820           03  SH03V1-DEALER             PICTURE X(4).
012000990820           03  FILLER                    PICTURE X(2).
012010990820           03  SH03V1-DEALER-NAMES       PICTURE X(35).
012020990820           03  FILLER                    PICTURE X(16).
012030990928
012040990927       01  STMT-HDG-03-V3-R            REDEFINES STMT-HDG-03.
012050990927           03  FILLER                    PICTURE X(10).
012060990928           03  SH03V3-INVESTOR-ADDRESS2  PICTURE X(40).
012070990927           03  FILLER                    PICTURE X(80).
012080010519
012090010519R10081 01  STMT-HDG-03-V4-R            REDEFINES STMT-HDG-03.
012100010522           03  FILLER                    PICTURE X(6).
012110010519           03  SH03V4-INVESTOR-ADDRESS2  PICTURE X(40).
012120010522R10081     03  FILLER                    PICTURE X(104).
012130000000      /
012140000000       01  STMT-HDG-04.
012150000000           03  FILLER                  PICTURE X(8).
012160971204           03  SH04-INVESTOR-ADDRESS3  PICTURE X(40).
012170971209           03  FILLER                  PICTURE X(30).
012180990316           03  SH04-LIT1               PICTURE X(17).
012190990316           03  FILLER                  PICTURE X(1).
012200000414           03  SH04-REPNO              PICTURE X(6).
012210971210           03  FILLER                  PICTURE X(1).
012220971204           03  SH04-REP-NAME           PICTURE X(40).
012230000414           03  FILLER                  PICTURE X(7).
012240000000
012250990820       01  STMT-HDG-04-V1-R            REDEFINES STMT-HDG-04.
012260990820           03  FILLER                    PICTURE X(8).
012270990820           03  SH04V1-INVESTOR-ADDRESS3  PICTURE X(40).
012280990820           03  FILLER                    PICTURE X(27).
012290990820           03  SH04V1-LIT1               PICTURE X(17).
012300990820           03  FILLER                    PICTURE X(1).
012310000414           03  SH04V1-REPNO              PICTURE X(6).
012320990820           03  FILLER                    PICTURE X(1).
012330990820           03  SH04V1-REP-NAME           PICTURE X(40).
012340000414           03  FILLER                    PICTURE X(10).
012350990928
012360990927       01  STMT-HDG-04-V3-R            REDEFINES STMT-HDG-04.
012370990927           03  FILLER                    PICTURE X(10).
012380990928           03  SH04V3-INVESTOR-ADDRESS3  PICTURE X(40).
012390990927           03  FILLER                    PICTURE X(80).
012400010519
012410010519R10081 01  STMT-HDG-04-V4-R            REDEFINES STMT-HDG-04.
012420010522           03  FILLER                    PICTURE X(6).
012430010519           03  SH04V4-INVESTOR-ADDRESS3  PICTURE X(40).
012440010519           03  FILLER                    PICTURE X(27).
012450010519           03  SH04V4-LIT1               PICTURE X(17).
012460010519           03  FILLER                    PICTURE X(1).
012470010519           03  SH04V4-DEALER             PICTURE X(4).
012480010519           03  FILLER                    PICTURE X(2).
012490010519           03  SH04V4-DEALER-NAMES       PICTURE X(35).
012500010522R10081     03  FILLER                    PICTURE X(18).
012510010517
012520000000      /
012530000000       01  STMT-HDG-05.
012540000000           03  FILLER                  PICTURE X(8).
012550971204           03  SH05-INVESTOR-ADDRESS4  PICTURE X(40).
012560971209           03  FILLER                  PICTURE X(30).
012570990316           03  SH05-LIT1               PICTURE X(17).
012580990316           03  FILLER                  PICTURE X(1).
012590971202           03  SH05-BRANCH-ADDR1       PICTURE X(40).
012600971209           03  FILLER                  PICTURE X(14).
012610000000
012620990820       01  STMT-HDG-05-V1-R            REDEFINES STMT-HDG-05.
012630990820           03  FILLER                    PICTURE X(8).
012640990820           03  SH05V1-INVESTOR-ADDRESS4  PICTURE X(40).
012650990820           03  FILLER                    PICTURE X(27).
012660990820           03  SH05V1-LIT1               PICTURE X(17).
012670990820           03  FILLER                    PICTURE X(1).
012680990820           03  SH05V1-BRANCH-ADDR1       PICTURE X(40).
012690990820           03  FILLER                    PICTURE X(17).
012700990928
012710990927       01  STMT-HDG-05-V3-R            REDEFINES STMT-HDG-05.
012720990927           03  FILLER                    PICTURE X(10).
012730990928           03  SH05V3-INVESTOR-ADDRESS4  PICTURE X(40).
012740990927           03  FILLER                    PICTURE X(80).
012750010519
012760010519R10081 01  STMT-HDG-05-V4-R            REDEFINES STMT-HDG-05.
012770010522           03  FILLER                    PICTURE X(6).
012780010519           03  SH05V4-INVESTOR-ADDRESS4  PICTURE X(40).
012790010519           03  FILLER                    PICTURE X(27).
012800010519           03  SH05V4-LIT1               PICTURE X(17).
012810010519           03  FILLER                    PICTURE X(1).
012820010519           03  SH05V4-REPNO              PICTURE X(6).
012830010519           03  FILLER                    PICTURE X(1).
012840010519           03  SH05V4-REP-NAME           PICTURE X(40).
012850010522R10081     03  FILLER                    PICTURE X(12).
012860010517
012870000000      /
012880000000       01  STMT-HDG-06.
012890000000           03  FILLER                  PICTURE X(8).
012900971204           03  SH06-INVESTOR-ADDRESS5  PICTURE X(40).
012910971209           03  FILLER                  PICTURE X(48).
012920971202           03  SH06-BRANCH-ADDR2       PICTURE X(40).
012930971209           03  FILLER                  PICTURE X(14).
012940000000
012950990820       01  STMT-HDG-06-V1-R            REDEFINES STMT-HDG-06.
012960990820           03  FILLER                    PICTURE X(8).
012970990820           03  SH06V1-INVESTOR-ADDRESS5  PICTURE X(40).
012980990820           03  FILLER                    PICTURE X(45).
012990990820           03  SH06V1-BRANCH-ADDR2       PICTURE X(40).
013000990820           03  FILLER                    PICTURE X(17).
013010990928
013020990927       01  STMT-HDG-06-V3-R            REDEFINES STMT-HDG-06.
013030990927           03  FILLER                    PICTURE X(10).
013040990928           03  SH06V3-INVESTOR-ADDRESS5  PICTURE X(40).
013050990927           03  FILLER                    PICTURE X(80).
013060010519
013070010519R10081 01  STMT-HDG-06-V4-R            REDEFINES STMT-HDG-06.
013080010522           03  FILLER                    PICTURE X(6).
013090010519           03  SH06V4-INVESTOR-ADDRESS5  PICTURE X(40).
013100010519           03  FILLER                    PICTURE X(27).
013110010519           03  SH06V4-LIT1               PICTURE X(17).
013120010519           03  FILLER                    PICTURE X(1).
013130010519           03  SH06V4-BRANCH-ADDR1       PICTURE X(40).
013140010522R10081     03  FILLER                    PICTURE X(19).
013150010517
013160000000      /
013170000000       01  STMT-HDG-07.
013180971205           03  FILLER                  PICTURE X(8).
013190971205           03  SH07-POSTAL-CODE        PICTURE X(10).
013200971209           03  FILLER                  PICTURE X(78).
013210971202           03  SH07-BRANCH-ADDR3       PICTURE X(40).
013220971209           03  FILLER                  PICTURE X(14).
013230990928
013240990820       01  STMT-HDG-07-V1-R            REDEFINES STMT-HDG-07.
013250990820           03  FILLER                    PICTURE X(8).
013260990820           03  SH07V1-POSTAL-CODE        PICTURE X(10).
013270990820           03  FILLER                    PICTURE X(75).
013280990820           03  SH07V1-BRANCH-ADDR3       PICTURE X(40).
013290990820           03  FILLER                    PICTURE X(17).
013300990928
013310990927       01  STMT-HDG-07-V3-R            REDEFINES STMT-HDG-07.
013320990927           03  FILLER                    PICTURE X(10).
013330990927           03  SH07V3-POSTAL-CODE        PICTURE X(10).
013340990927           03  FILLER                    PICTURE X(80).
013350010519
013360010519R10081 01  STMT-HDG-07-V4-R            REDEFINES STMT-HDG-07.
013370010522           03  FILLER                    PICTURE X(6).
013380010519           03  SH07V4-POSTAL-CODE        PICTURE X(40).
013390010519           03  FILLER                    PICTURE X(45).
013400010519           03  SH07V4-BRANCH-ADDR2       PICTURE X(40).
013410010522R10081     03  FILLER                    PICTURE X(19).
013420990927
013430000000      /
013440000000       01  STMT-HDG-08.
013450971209           03  FILLER                  PICTURE X(96).
013460971202           03  SH08-BRANCH-ADDR4       PICTURE X(40).
013470971209           03  FILLER                  PICTURE X(14).
013480990928
013490990824       01  STMT-HDG-08-V1-R            REDEFINES STMT-HDG-08.
013500990824           03  FILLER                  PICTURE X(93).
013510990824           03  SH08V1-BRANCH-ADDR4     PICTURE X(40).
013520990824           03  FILLER                  PICTURE X(17).
013530010517
013540010517R10081 01  STMT-HDG-08-V4-R            REDEFINES STMT-HDG-08.
013550010522           03  FILLER                  PICTURE X(91).
013560010519           03  SH08V4-BRANCH-ADDR3     PICTURE X(40).
013570010522R10081     03  FILLER                  PICTURE X(19).
013580010519
013590010519R10081/
013600010519       01  STMT-HDG-09.
013610010522           03  FILLER                  PICTURE X(94).
013620010519           03  SH09-BRANCH-ADDR4       PICTURE X(40).
013630010522R10081     03  FILLER                  PICTURE X(16).
013640010517
013650000000      /
013660000000       01  STMT-HDG-10.
013670000000           03  FILLER                  PICTURE X(8).
013680000000           03  SH10-LIT1               PICTURE X(47).
013690971209           03  FILLER                  PICTURE X(23).
013700990316           03  SH10-LIT2               PICTURE X(17).
013710990316           03  FILLER                  PICTURE X(1).
013720000000           03  SH10-PHONE              PICTURE X(14).
013730971209           03  FILLER                  PICTURE X(40).
013740990928
013750990928       01  STMT-HDG-10-V1-R            REDEFINES STMT-HDG-10.
013760990928           03  FILLER                  PICTURE X(8).
013770990928           03  SH10V1-LIT1             PICTURE X(47).
013780990928           03  FILLER                  PICTURE X(20).
013790990928           03  SH10V1-LIT2             PICTURE X(17).
013800990928           03  FILLER                  PICTURE X(1).
013810990928           03  SH10V1-PHONE            PICTURE X(14).
013820990928           03  FILLER                  PICTURE X(2).
013830990928           03  SH10V1-PHONE-2          PICTURE X(14).
013840990928           03  FILLER                  PICTURE X(27).
013850010517
013860010519R10081 01  STMT-HDG-10-V4-R            REDEFINES STMT-HDG-10.
013870010522           03  FILLER                  PICTURE X(6).
013880010519           03  SH10V4-LIT1             PICTURE X(47).
013890010519           03  FILLER                  PICTURE X(20).
013900010519           03  SH10V4-LIT2             PICTURE X(17).
013910010519           03  FILLER                  PICTURE X(1).
013920010519           03  SH10V4-PHONE            PICTURE X(14).
013930010522R10081     03  FILLER                  PICTURE X(45).
013940010517
013950000000      /
013960000000       01  STMT-HDG-11.
013970000000           03  FILLER                  PICTURE X(8).
013980000000           03  SH11-NOMINEE            PICTURE X(53).
013990971209           03  FILLER                  PICTURE X(17).
014000990316           03  SH11-LIT1               PICTURE X(17).
014010990316           03  FILLER                  PICTURE X(1).
014020000000           03  SH11-FAX                PICTURE X(14).
014030990317           03  FILLER                  PICTURE X(40).
014040000000
014050990820       01  STMT-HDG-11-V1-R            REDEFINES STMT-HDG-11.
014060990820           03  FILLER                    PICTURE X(8).
014070990820           03  SH11V1-NOMINEE            PICTURE X(53).
014080990820           03  FILLER                    PICTURE X(14).
014090990820           03  SH11V1-LIT1               PICTURE X(17).
014100990820           03  FILLER                    PICTURE X(1).
014110990820           03  SH11V1-FAX                PICTURE X(14).
014120990820           03  FILLER                    PICTURE X(43).
014130990928
014140990927       01  STMT-HDG-11-V3-R            REDEFINES STMT-HDG-11.
014150990928           03  FILLER                  PICTURE X(10).
014160990928           03  FILLER                  PICTURE X(40).
014170990928           03  SH11V3-LIT1             PICTURE X(30).
014180990928           03  FILLER                  PICTURE X(40).
014190990928           03  FILLER                  PICTURE X(10).
014200010517
014210010517R10081 01  STMT-HDG-11-V4-R            REDEFINES STMT-HDG-11.
014220010522           03  FILLER                    PICTURE X(6).
014230010517           03  SH11V4-NOMINEE            PICTURE X(53).
014240010517           03  FILLER                    PICTURE X(14).
014250010517           03  SH11V4-LIT1               PICTURE X(17).
014260010517           03  FILLER                    PICTURE X(1).
014270010517           03  SH11V4-FAX                PICTURE X(14).
014280010522R10081     03  FILLER                    PICTURE X(45).
014290010517
014300971203      /
014310971202       01  STMT-HDG-12.
014320971202           03  FILLER                  PICTURE X(8).
014330971215           03  SH12-LIT1               PICTURE X(17).
014340971202           03  FILLER                  PICTURE X(2).
014350971205           03  SH12-ACCNO              PICTURE 999999999.
014360971215           03  FILLER                  PICTURE X(42).
014370990316           03  SH12-LIT2               PICTURE X(17).
014380990316           03  FILLER                  PICTURE X(1).
014390971204           03  SH12-D-OR-N-NO          PICTURE X(15).
014400971209           03  FILLER                  PICTURE X(39).
014410971202
014420990824       01  STMT-HDG-12-V1-R            REDEFINES STMT-HDG-12.
014430990824           03  FILLER                  PICTURE X(8).
014440990824           03  SH12V1-LIT1             PICTURE X(17).
014450990824           03  FILLER                  PICTURE X(2).
014460990824           03  SH12V1-ACCNO            PICTURE 999999999.
014470990824           03  FILLER                  PICTURE X(42).
014480990824           03  SH12V1-LIT2             PICTURE X(17).
014490990824           03  FILLER                  PICTURE X(1).
014500990824           03  SH12V1-D-OR-N-NO        PICTURE X(15).
014510990824           03  FILLER                  PICTURE X(39).
014520010517
014530010517R10081 01  STMT-HDG-12-V4-R            REDEFINES STMT-HDG-12.
014540010522           03  FILLER                  PICTURE X(6).
014550010517           03  SH12V4-LIT1             PICTURE X(17).
014560010517           03  FILLER                  PICTURE X(2).
014570010517           03  SH12V4-ACCNO            PICTURE 999999999.
014580010517           03  FILLER                  PICTURE X(42).
014590010517           03  SH12V4-LIT2             PICTURE X(17).
014600010517           03  FILLER                  PICTURE X(1).
014610010517           03  SH12V4-D-OR-N-NO        PICTURE X(15).
014620010522R10081     03  FILLER                  PICTURE X(41).
014630010517
014640990316      /
014650971202       01  STMT-HDG-13.
014660971202           03  FILLER                  PICTURE X(8).
014670971215           03  SH13-LIT1               PICTURE X(17).
014680971202           03  FILLER                  PICTURE X(2).
014690980213           03  SH13-ACCTTYPE           PICTURE X(50).
014700980213           03  FILLER                  PICTURE X(1).
014710990316           03  SH13-LIT2               PICTURE X(17).
014720990316           03  FILLER                  PICTURE X(1).
014730971205           03  SH13-SIN-NO             PICTURE X(11).
014740971209           03  FILLER                  PICTURE X(43).
014750990820
014760990820       01  STMT-HDG-13-V1-R            REDEFINES STMT-HDG-13.
014770990820           03  FILLER                    PICTURE X(8).
014780990820           03  SH13V1-LIT1               PICTURE X(17).
014790990820           03  FILLER                    PICTURE X(2).
014800990820           03  SH13V1-ACCTTYPE           PICTURE X(47).
014810990820           03  FILLER                    PICTURE X(1).
014820990820           03  SH13V1-LIT2               PICTURE X(17).
014830990820           03  FILLER                    PICTURE X(1).
014840990820           03  SH13V1-SIN-NO             PICTURE X(11).
014850990820           03  FILLER                    PICTURE X(46).
014860990928
014870990928       01  STMT-HDG-13-V3-R            REDEFINES STMT-HDG-13.
014880990928           03  FILLER                  PICTURE X(10).
014890990928           03  SH13V3-LIT1             PICTURE X(12).
014900990928           03  FILLER                  PICTURE X(1).
014910990928           03  SH13V3-ACCNO            PICTURE 999999999.
014920990928           03  FILLER                  PICTURE X(98).
014930010517
014940010517R10081 01  STMT-HDG-13-V4-R            REDEFINES STMT-HDG-13.
014950010522           03  FILLER                    PICTURE X(6).
014960010517           03  SH13V4-LIT1               PICTURE X(17).
014970010517           03  FILLER                    PICTURE X(2).
014980010517           03  SH13V4-ACCTTYPE           PICTURE X(47).
014990010517           03  FILLER                    PICTURE X(1).
015000010519           03  SH13V4-LIT2               PICTURE X(5).
015010010517           03  FILLER                    PICTURE X(1).
015020010517           03  SH13V4-SIN-NO             PICTURE X(11).
015030010522R10081     03  FILLER                    PICTURE X(60).
015040010517
015050000000      /
015060000000      ******************************************************************
015070000000      *                                                                *
015080000000      *    S T A T E M E N T   D E T A I L   P R I N T   L I N E S     *
015090000000      *                                                                *
015100000000      ******************************************************************
015110000000
015120000000      *****
015130971203      *****    The statement detail lines will be re-defined
015140000000      *****
015150991001
015160000000       01  STMT-DTL-01.
015170971203           03  FILLER                  PICTURE X(12).
015180000000           03  SD01-INVESTMENT-NAME    PICTURE X(35).
015190980130           03  FILLER                  PICTURE X(2).
015200980130           03  SD01-CURRENCY           PICTURE X(3).
015210980130           03  FILLER                  PICTURE X(98).
015220990928
015230990927       01  STMT-DTL-01-V3-R          REDEFINES STMT-DTL-01.
015240990927           03  FILLER                  PICTURE X(10).
015250990927           03  FILLER                  PICTURE X(12).
015260990928           03  SD01V3-INVESTMENT-NAME  PICTURE X(35).
015270990927           03  FILLER                  PICTURE X(63).
015280990927           03  FILLER                  PICTURE X(10).
015290010517
015300010517R10081 01  STMT-DTL-01-V4-R          REDEFINES STMT-DTL-01.
015310010522           03  FILLER                  PICTURE X(18).
015320010517           03  SD01V4-INVESTMENT-NAME  PICTURE X(35).
015330010517           03  FILLER                  PICTURE X(2).
015340010517           03  SD01V4-CURRENCY         PICTURE X(3).
015350010522R10081     03  FILLER                  PICTURE X(92).
015360000000
015370000000      /
015380000000       01  STMT-DTL-02.
015390000000           03  SD02-LIT1.
015400991004               05  SD02-TRADE-DATE     PICTURE XXXX/XX/XX.
015410000000           03  FILLER                  PICTURE X(2).
015420000000           03  SD02-TRANS-TYPE         PICTURE X(25).
015430000303      *    03  FILLER                  PICTURE X(3).
015440000303           03  SD02-GROSS              PICTURE $$$,$$$,$$$,$$9.99.
015450000000           03  SD02-GROSS-SIGN         PICTURE X(1).
015460971127           03  SD02-DEDUCTIONS         PICTURE $$$,$$$,$$$.99
015470971127                                       BLANK WHEN ZERO.
015480000000           03  SD02-DEDUCTIONS-SIGN    PICTURE X(1).
015490971215           03  FILLER                  PICTURE X(2).
015500971127           03  SD02-NET                PICTURE $$$$,$$$,$$9.99.
015510000000           03  SD02-NET-SIGN           PICTURE X(1).
015520000303           03  FILLER                  PICTURE X(3).
015530000303           03  SD02-UNIT-PRICE         PICTURE ZZ,ZZZ.9999.
015540000000           03  SD02-UNIT-PRICE-SIGN    PICTURE X(1).
015550971215           03  FILLER                  PICTURE X(2).
015560971127           03  SD02-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZ9.999.
015570000000           03  SD02-NO-OF-UNITS-SIGN   PICTURE X(1).
015580971215           03  FILLER                  PICTURE X(28).
015590021218
015600030102R15810 01  SD02-DEDUCTIONS-EX      PICTURE $$$,$$$,$$$.99
015610030102                                       BLANK WHEN ZERO.
015620030103
015630030103R15810 01  NON-RESEDINTIAL-TAX     PICTURE 9(11)V9(2).
015640030102
015650021219R15810 01  STMT-DTL-DEDUCTION.
015660021219  ¦        03  FILLER                  PICTURE X(15).
015670021219  ¦        03  SD022-DEDUCTION-DESC    PICTURE X(25).
015680021219  ¦        03  FILLER                  PICTURE X(16).
015690021219  ¦        03  SD022-DEDUCTIONS        PICTURE $$$,$$$,$$$.99
015700021219  ¦                                       BLANK WHEN ZERO.
015710021219R15810     03  SD022-DEDUCTIONS-SIGN   PICTURE X(1).
015720021218
015730990927       01  STMT-DTL-02-V3-R          REDEFINES STMT-DTL-02.
015740990927           03  FILLER                  PICTURE X(10).
015750990927           03  SD02V3-LIT1.
015760990928               05  SD02V3-TRADE-DATE   PICTURE XXXX/XX/XX.
015770990927           03  FILLER                  PICTURE X(2).
015780990927           03  SD02V3-TRANS-TYPE       PICTURE X(25).
015790000224           03  FILLER                  PICTURE X(4).
015800000224           03  SD02V3-GROSS            PICTURE $$$,$$$,$$$,$$9.99.
015810990927           03  SD02V3-GROSS-SIGN       PICTURE X(1).
015820990927           03  FILLER                  PICTURE X(1).
015830000224           03  SD02V3-UNIT-PRICE       PICTURE ZZ,ZZZ.9999.
015840990927           03  SD02V3-UNIT-PRICE-SIGN  PICTURE X(1).
015850990927           03  FILLER                  PICTURE X(1).
015860990927           03  SD02V3-NO-OF-UNITS      PICTURE ZZZ,ZZZ,ZZ9.999.
015870990927           03  SD02V3-NO-OF-UNITS-SIGN PICTURE X(1).
015880000224           03  FILLER                  PICTURE X(2).
015890000224           03  SD02V3-MKT-VALUE        PICTURE ZZ,ZZZ,ZZZ,ZZ9.99.
015900990927           03  SD02V3-MKT-VALUE-SIGN   PICTURE X(1).
015910000224           03  FILLER                  PICTURE X(10).
015920010517
015930010517R10081 01  STMT-DTL-02-V4-R          REDEFINES STMT-DTL-02.
015940010522           03  FILLER                    PICTURE X(6).
015950010517           03  SD02V4-LIT1.
015960010517               05  SD02V4-TRADE-DATE     PICTURE XXXX/XX/XX.
015970010517           03  FILLER                    PICTURE X(2).
015980010517           03  SD02V4-TRANS-TYPE         PICTURE X(25).
015990010517      *    03  FILLER                    PICTURE X(3).
016000010517           03  SD02V4-GROSS              PICTURE $$$,$$$,$$$,$$9.99.
016010010517           03  SD02V4-GROSS-SIGN         PICTURE X(1).
016020010517           03  SD02V4-DEDUCTIONS         PICTURE $$$,$$$,$$$.99
016030010517                                         BLANK WHEN ZERO.
016040010517           03  SD02V4-DEDUCTIONS-SIGN    PICTURE X(1).
016050010517           03  FILLER                    PICTURE X(2).
016060010517           03  SD02V4-NET                PICTURE $$$$,$$$,$$9.99.
016070010517           03  SD02V4-NET-SIGN           PICTURE X(1).
016080010917R11406     03  FILLER                    PICTURE X(3).
016090010917R11406     03  SD02V4-UNIT-PRICE         PICTURE $$,$$9.9999.
016100010517           03  SD02V4-UNIT-PRICE-SIGN    PICTURE X(1).
016110010517           03  FILLER                    PICTURE X(2).
016120010802R10992     03  SD02V4-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZ9.999.
016130010517           03  SD02V4-NO-OF-UNITS-SIGN   PICTURE X(1).
016140010522R10081     03  FILLER                    PICTURE X(22).
016150010517
016160991001      /
016170991001       01  STMT-DTL-03.
016180991001           03  FILLER                  PICTURE X(12).
016190991012           03  FILLER                  PICTURE X(4).
016200991014           03  SD03-BENEFICIARY1       PICTURE X(45).
016210991008           03  SD03-PERCENT1           PICTURE ZZZ.99.
016220991008           03  SD03-PERCENTAGE1        PICTURE X(1).
016230991014           03  FILLER                  PICTURE X(1).
016240991008           03  SD03-AMOUNT1            PICTURE $$$$,$$$,$$9.99.
016250991008           03  SD03-AMOUNT-SIGN1       PICTURE X(1).
016260991014           03  FILLER                  PICTURE X(65).
016270991001
016280991001       01  STMT-DTL-03-V3-R            REDEFINES STMT-DTL-03.
016290991001           03  FILLER                  PICTURE X(22).
016300991012           03  FILLER                  PICTURE X(4).
016310991014           03  SD03V3-BENEFICIARY1     PICTURE X(45).
016320991008           03  SD03V3-PERCENT1         PICTURE ZZZ.99.
016330991008           03  SD03V3-PERCENTAGE1      PICTURE X(1).
016340991012           03  FILLER                  PICTURE X(1).
016350991008           03  SD03V3-AMOUNT1          PICTURE $$$$,$$$,$$9.99.
016360991008           03  SD03V3-AMOUNT-SIGN1     PICTURE X(1).
016370991014           03  FILLER                  PICTURE X(35).
016380010517
016390010517R10081 01  STMT-DTL-03-V4-R            REDEFINES STMT-DTL-03.
016400010522           03  FILLER                  PICTURE X(18).
016410010517           03  FILLER                  PICTURE X(4).
016420010517           03  SD03V4-BENEFICIARY1     PICTURE X(45).
016430010517           03  SD03V4-PERCENT1         PICTURE ZZZ.99.
016440010517           03  SD03V4-PERCENTAGE1      PICTURE X(1).
016450010517           03  FILLER                  PICTURE X(1).
016460010517           03  SD03V4-AMOUNT1          PICTURE $$$$,$$$,$$9.99.
016470010517           03  SD03V4-AMOUNT-SIGN1     PICTURE X(1).
016480010522R10081     03  FILLER                  PICTURE X(59).
016490010517
016500991008      /
016510991008       01  STMT-DTL-04.
016520991008           03  FILLER                  PICTURE X(12).
016530991012           03  FILLER                  PICTURE X(4).
016540991014           03  SD04-BENEFICIARY2       PICTURE X(45).
016550991008           03  SD04-PERCENT2           PICTURE ZZZ.99.
016560991008           03  SD04-PERCENTAGE2        PICTURE X(1).
016570991012           03  FILLER                  PICTURE X(1).
016580991008           03  SD04-AMOUNT2            PICTURE $$$$,$$$,$$9.99.
016590991008           03  SD04-AMOUNT-SIGN2       PICTURE X(1).
016600991014           03  FILLER                  PICTURE X(65).
016610991008
016620991008       01  STMT-DTL-04-V3-R            REDEFINES STMT-DTL-04.
016630991008           03  FILLER                  PICTURE X(22).
016640991012           03  FILLER                  PICTURE X(4).
016650991014           03  SD04V3-BENEFICIARY2     PICTURE X(45).
016660991008           03  SD04V3-PERCENT2         PICTURE ZZZ.99.
016670991008           03  SD04V3-PERCENTAGE2      PICTURE X(1).
016680991012           03  FILLER                  PICTURE X(1).
016690991008           03  SD04V3-AMOUNT2          PICTURE $$$$,$$$,$$9.99.
016700991008           03  SD04V3-AMOUNT-SIGN2     PICTURE X(1).
016710991014           03  FILLER                  PICTURE X(35).
016720991008
016730010517R10081 01  STMT-DTL-04-V4-R            REDEFINES STMT-DTL-04.
016740010522           03  FILLER                  PICTURE X(18).
016750010517           03  FILLER                  PICTURE X(4).
016760010517           03  SD04V4-BENEFICIARY2     PICTURE X(45).
016770010517           03  SD04V4-PERCENT2         PICTURE ZZZ.99.
016780010517           03  SD04V4-PERCENTAGE2      PICTURE X(1).
016790010517           03  FILLER                  PICTURE X(1).
016800010517           03  SD04V4-AMOUNT2          PICTURE $$$$,$$$,$$9.99.
016810010517           03  SD04V4-AMOUNT-SIGN2     PICTURE X(1).
016820010522R10081     03  FILLER                  PICTURE X(59).
016830010517
016840991008      /
016850991008       01  STMT-DTL-05.
016860991008           03  FILLER                  PICTURE X(12).
016870991012           03  FILLER                  PICTURE X(4).
016880991014           03  SD05-BENEFICIARY3       PICTURE X(45).
016890991008           03  SD05-PERCENT3           PICTURE ZZZ.99.
016900991008           03  SD05-PERCENTAGE3        PICTURE X(1).
016910991012           03  FILLER                  PICTURE X(1).
016920991008           03  SD05-AMOUNT3            PICTURE $$$$,$$$,$$9.99.
016930991008           03  SD05-AMOUNT-SIGN3       PICTURE X(1).
016940991014           03  FILLER                  PICTURE X(65).
016950991008
016960991008       01  STMT-DTL-05-V3-R            REDEFINES STMT-DTL-05.
016970991008           03  FILLER                  PICTURE X(22).
016980991012           03  FILLER                  PICTURE X(4).
016990991014           03  SD05V3-BENEFICIARY3     PICTURE X(45).
017000991008           03  SD05V3-PERCENT3         PICTURE ZZZ.99.
017010991008           03  SD05V3-PERCENTAGE3      PICTURE X(1).
017020991012           03  FILLER                  PICTURE X(1).
017030991008           03  SD05V3-AMOUNT3          PICTURE $$$$,$$$,$$9.99.
017040991008           03  SD05V3-AMOUNT-SIGN3     PICTURE X(1).
017050991014           03  FILLER                  PICTURE X(35).
017060991008
017070010517R10081 01  STMT-DTL-05-V4-R            REDEFINES STMT-DTL-05.
017080010522           03  FILLER                  PICTURE X(18).
017090010517           03  FILLER                  PICTURE X(4).
017100010517           03  SD05V4-BENEFICIARY3     PICTURE X(45).
017110010517           03  SD05V4-PERCENT3         PICTURE ZZZ.99.
017120010517           03  SD05V4-PERCENTAGE3      PICTURE X(1).
017130010517           03  FILLER                  PICTURE X(1).
017140010517           03  SD05V4-AMOUNT3          PICTURE $$$$,$$$,$$9.99.
017150010517           03  SD05V4-AMOUNT-SIGN3     PICTURE X(1).
017160010522R10081     03  FILLER                  PICTURE X(59).
017170010517
017180991008      /
017190991008       01  STMT-DTL-06.
017200991008           03  FILLER                  PICTURE X(12).
017210991012           03  FILLER                  PICTURE X(4).
017220991014           03  SD06-BENEFICIARY4       PICTURE X(45).
017230991008           03  SD06-PERCENT4           PICTURE ZZZ.99.
017240991008           03  SD06-PERCENTAGE4        PICTURE X(1).
017250991012           03  FILLER                  PICTURE X(1).
017260991008           03  SD06-AMOUNT4            PICTURE $$$$,$$$,$$9.99.
017270991008           03  SD06-AMOUNT-SIGN4       PICTURE X(1).
017280991014           03  FILLER                  PICTURE X(65).
017290991008
017300991008       01  STMT-DTL-06-V3-R            REDEFINES STMT-DTL-06.
017310991008           03  FILLER                  PICTURE X(22).
017320991012           03  FILLER                  PICTURE X(4).
017330991014           03  SD06V3-BENEFICIARY4     PICTURE X(45).
017340991008           03  SD06V3-PERCENT4         PICTURE ZZZ.99.
017350991008           03  SD06V3-PERCENTAGE4      PICTURE X(1).
017360991012           03  FILLER                  PICTURE X(1).
017370991008           03  SD06V3-AMOUNT4          PICTURE $$$$,$$$,$$9.99.
017380991008           03  SD06V3-AMOUNT-SIGN4     PICTURE X(1).
017390991014           03  FILLER                  PICTURE X(35).
017400991012
017410010517R10081 01  STMT-DTL-06-V4-R            REDEFINES STMT-DTL-06.
017420010522           03  FILLER                  PICTURE X(18).
017430010517           03  FILLER                  PICTURE X(4).
017440010517           03  SD06V4-BENEFICIARY4     PICTURE X(45).
017450010517           03  SD06V4-PERCENT4         PICTURE ZZZ.99.
017460010517           03  SD06V4-PERCENTAGE4      PICTURE X(1).
017470010517           03  FILLER                  PICTURE X(1).
017480010517           03  SD06V4-AMOUNT4          PICTURE $$$$,$$$,$$9.99.
017490010517           03  SD06V4-AMOUNT-SIGN4     PICTURE X(1).
017500010522R10081     03  FILLER                  PICTURE X(59).
017510010517
017520991012      /
017530991012       01  STMT-DTL-07.
017540991012           03  FILLER                  PICTURE X(12).
017550991012           03  FILLER                  PICTURE X(4).
017560991014           03  SD07-BENEFICIARY5       PICTURE X(45).
017570991012           03  SD07-PERCENT5           PICTURE ZZZ.99.
017580991012           03  SD07-PERCENTAGE5        PICTURE X(1).
017590991012           03  FILLER                  PICTURE X(1).
017600991012           03  SD07-AMOUNT5            PICTURE $$$$,$$$,$$9.99.
017610991012           03  SD07-AMOUNT-SIGN5       PICTURE X(1).
017620991014           03  FILLER                  PICTURE X(65).
017630991012
017640991012       01  STMT-DTL-07-V3-R            REDEFINES STMT-DTL-07.
017650991012           03  FILLER                  PICTURE X(22).
017660991012           03  FILLER                  PICTURE X(4).
017670991014           03  SD07V3-BENEFICIARY5     PICTURE X(45).
017680991012           03  SD07V3-PERCENT5         PICTURE ZZZ.99.
017690991012           03  SD07V3-PERCENTAGE5      PICTURE X(1).
017700991012           03  FILLER                  PICTURE X(1).
017710991012           03  SD07V3-AMOUNT5          PICTURE $$$$,$$$,$$9.99.
017720991012           03  SD07V3-AMOUNT-SIGN5     PICTURE X(1).
017730991014           03  FILLER                  PICTURE X(35).
017740991012
017750010517R10081 01  STMT-DTL-07-V4-R            REDEFINES STMT-DTL-07.
017760010522           03  FILLER                  PICTURE X(18).
017770010517           03  FILLER                  PICTURE X(4).
017780010517           03  SD07V4-BENEFICIARY5     PICTURE X(45).
017790010517           03  SD07V4-PERCENT5         PICTURE ZZZ.99.
017800010517           03  SD07V4-PERCENTAGE5      PICTURE X(1).
017810010517           03  FILLER                  PICTURE X(1).
017820010517           03  SD07V4-AMOUNT5          PICTURE $$$$,$$$,$$9.99.
017830010517           03  SD07V4-AMOUNT-SIGN5     PICTURE X(1).
017840010522R10081     03  FILLER                  PICTURE X(59).
017850010517
017860991012      /
017870991012       01  STMT-DTL-08.
017880991012           03  FILLER                  PICTURE X(12).
017890991012           03  FILLER                  PICTURE X(4).
017900991014           03  SD08-BENEFICIARY6       PICTURE X(45).
017910991012           03  SD08-PERCENT6           PICTURE ZZZ.99.
017920991012           03  SD08-PERCENTAGE6        PICTURE X(1).
017930991012           03  FILLER                  PICTURE X(1).
017940991012           03  SD08-AMOUNT6            PICTURE $$$$,$$$,$$9.99.
017950991012           03  SD08-AMOUNT-SIGN6       PICTURE X(1).
017960991014           03  FILLER                  PICTURE X(65).
017970991012
017980991012       01  STMT-DTL-08-V3-R            REDEFINES STMT-DTL-08.
017990991012           03  FILLER                  PICTURE X(22).
018000991012           03  FILLER                  PICTURE X(4).
018010991014           03  SD08V3-BENEFICIARY6     PICTURE X(45).
018020991012           03  SD08V3-PERCENT6         PICTURE ZZZ.99.
018030991012           03  SD08V3-PERCENTAGE6      PICTURE X(1).
018040991012           03  FILLER                  PICTURE X(1).
018050991012           03  SD08V3-AMOUNT6          PICTURE $$$$,$$$,$$9.99.
018060991012           03  SD08V3-AMOUNT-SIGN6     PICTURE X(1).
018070991014           03  FILLER                  PICTURE X(35).
018080010517
018090010517R10081 01  STMT-DTL-08-V4-R            REDEFINES STMT-DTL-08.
018100010522           03  FILLER                  PICTURE X(18).
018110010517           03  FILLER                  PICTURE X(4).
018120010517           03  SD08V4-BENEFICIARY6     PICTURE X(45).
018130010517           03  SD08V4-PERCENT6         PICTURE ZZZ.99.
018140010517           03  SD08V4-PERCENTAGE6      PICTURE X(1).
018150010517           03  FILLER                  PICTURE X(1).
018160010517           03  SD08V4-AMOUNT6          PICTURE $$$$,$$$,$$9.99.
018170010517           03  SD08V4-AMOUNT-SIGN6     PICTURE X(1).
018180010522R10081     03  FILLER                  PICTURE X(59).
018190010525
018200010531R10383 01  STMT-DTL-15.
018210010528           03  FILLER                    PICTURE X(6).
018220010528           03  SD15-LIT1.
018230010528               05  SD15-TRADE-DATE       PICTURE XXXX/XX/XX.
018240010528           03  FILLER                    PICTURE X(2).
018250010528           03  SD15-TRANS-TYPE           PICTURE X(25).
018260010528      *    03  FILLER                    PICTURE X(3).
018270010528           03  SD15-GROSS                PICTURE $$$,$$$,$$$,$$9.99.
018280010528           03  SD15-GROSS-SIGN           PICTURE X(1).
018290010802           03  SD15-DEDUCTIONS           PICTURE $$$,$$$,$$$.99
018300010802                                         BLANK WHEN ZERO.
018310010528           03  SD15-DEDUCTIONS-SIGN      PICTURE X(1).
018320010528           03  FILLER                    PICTURE X(2).
018330010528           03  SD15-NET                  PICTURE $$$$,$$$,$$9.99.
018340010528           03  SD15-NET-SIGN             PICTURE X(1).
018350010801           03  FILLER                    PICTURE X(17).
018360010801           03  SD15-UNIT-BALANCE         PICTURE $$$$,$$$,$$9.99.
018370010531           03  SD15-UNIT-BALANCE-SIGN    PICTURE X(1).
018380010528R10383     03  FILLER                    PICTURE X(22).
018390010525
018400000000      /
018410000000      ******************************************************************
018420000000      *                                                                *
018430000000      *    S T A T E M E N T   S U M M A R Y   P R I N T   L I N E S   *
018440000000      *                                                                *
018450000000      ******************************************************************
018460000000
018470000000      *****
018480990928      *****    The confirm summary lines will be re-defined for each
018490990928      *****    version of the confirm.
018500990928      *****         Version 3:  Used by UBS.
018510990928      *****
018520990928
018530000000      /
018540000000       01  STMT-SUM-01.
018550000000           03  SS01-LIT1               PICTURE X(137).
018560000000           03  FILLER                  PICTURE X(13).
018570000000
018580990928       01  STMT-SUM-01-V3-R            REDEFINES STMT-SUM-01.
018590000225           03  FILLER                  PICTURE X(9).
018600000225           03  SS01V3-LIT1             PICTURE X(111).
018610990929           03  FILLER                  PICTURE X(10).
018620990928
018630010517R10081 01  STMT-SUM-01-V4-R            REDEFINES STMT-SUM-01.
018640010517           03  SS01V4-LIT1             PICTURE X(138).
018650010517R10081     03  FILLER                  PICTURE X(12).
018660010517
018670000000      /
018680000000       01  STMT-SUM-02.
018690000303           03  FILLER                  PICTURE X(83).
018700000000           03  SS02-LIT1               PICTURE X(8).
018710000000           03  FILLER                  PICTURE X(3).
018720000000           03  SS02-LIT2               PICTURE X(13).
018730000303           03  FILLER                  PICTURE X(6).
018740000000           03  SS02-LIT3               PICTURE X(13).
018750000000           03  FILLER                  PICTURE X(24).
018760990315
018770990928       01  STMT-SUM-02-V1-R            REDEFINES STMT-SUM-02.
018780000303           03  FILLER                  PICTURE X(66).
018790990928           03  SS02V1-LIT0             PICTURE X(13).
018800000303           03  FILLER                  PICTURE X(4).
018810990928           03  SS02V1-LIT1             PICTURE X(8).
018820990928           03  FILLER                  PICTURE X(3).
018830990928           03  SS02V1-LIT2             PICTURE X(13).
018840000303           03  FILLER                  PICTURE X(6).
018850990928           03  SS02V1-LIT3             PICTURE X(13).
018860990928           03  FILLER                  PICTURE X(24).
018870990928
018880990928       01  STMT-SUM-02-V3-R            REDEFINES STMT-SUM-02.
018890990928           03  FILLER                  PICTURE X(50).
018900000224           03  FILLER                  PICTURE X(24).
018910990928           03  SS02V3-LIT1             PICTURE X(8).
018920990929           03  FILLER                  PICTURE X(4).
018930990929           03  SS02V3-LIT2             PICTURE X(13).
018940000224           03  FILLER                  PICTURE X(7).
018950990929           03  SS02V3-LIT3             PICTURE X(13).
018960990928           03  FILLER                  PICTURE X(11).
018970000000
018980010517R10081 01  STMT-SUM-02-V4-R            REDEFINES STMT-SUM-02.
018990010522           03  FILLER                  PICTURE X(6).
019000010517           03  SS02V4-LIT00            PICTURE X(35).
019010010519           03  FILLER                  PICTURE X(23).
019020010517           03  SS02V4-LIT0             PICTURE X(13).
019030010517           03  FILLER                  PICTURE X(4).
019040010517           03  SS02V4-LIT1             PICTURE X(8).
019050010517           03  FILLER                  PICTURE X(3).
019060010517           03  SS02V4-LIT2             PICTURE X(13).
019070010522           03  FILLER                  PICTURE X(9).
019080010517           03  SS02V4-LIT3             PICTURE X(13).
019090010522R10081     03  FILLER                  PICTURE X(23).
019100010517
019110000000      /
019120000000       01  STMT-SUM-03.
019130000303           03  FILLER                  PICTURE X(83).
019140000000           03  SS03-LIT1               PICTURE X(8).
019150000000           03  FILLER                  PICTURE X(3).
019160000000           03  SS03-LIT2               PICTURE X(13).
019170000303           03  FILLER                  PICTURE X(6).
019180000000           03  SS03-LIT3               PICTURE X(13).
019190000000           03  FILLER                  PICTURE X(24).
019200990315
019210990315       01  STMT-SUM-03-V1-R            REDEFINES STMT-SUM-03.
019220000303           03  FILLER                  PICTURE X(66).
019230990315           03  SS03V1-LIT0             PICTURE X(13).
019240000303           03  FILLER                  PICTURE X(4).
019250990315           03  SS03V1-LIT1             PICTURE X(8).
019260990315           03  FILLER                  PICTURE X(3).
019270990315           03  SS03V1-LIT2             PICTURE X(13).
019280000303           03  FILLER                  PICTURE X(6).
019290990315           03  SS03V1-LIT3             PICTURE X(13).
019300990315           03  FILLER                  PICTURE X(24).
019310990928
019320990928       01  STMT-SUM-03-V3-R            REDEFINES STMT-SUM-03.
019330990928           03  FILLER                  PICTURE X(50).
019340000224           03  FILLER                  PICTURE X(24).
019350990928           03  SS03V3-LIT1             PICTURE X(8).
019360990928           03  FILLER                  PICTURE X(4).
019370990928           03  SS03V3-LIT2             PICTURE X(13).
019380000224           03  FILLER                  PICTURE X(7).
019390990928           03  SS03V3-LIT3             PICTURE X(13).
019400990928           03  FILLER                  PICTURE X(11).
019410010517
019420010517R10081 01  STMT-SUM-03-V4-R            REDEFINES STMT-SUM-03.
019430010522           03  FILLER                  PICTURE X(64).
019440010517           03  SS03V4-LIT0             PICTURE X(13).
019450010517           03  FILLER                  PICTURE X(4).
019460010517           03  SS03V4-LIT1             PICTURE X(8).
019470010517           03  FILLER                  PICTURE X(3).
019480010517           03  SS03V4-LIT2             PICTURE X(13).
019490010522           03  FILLER                  PICTURE X(9).
019500010517           03  SS03V4-LIT3             PICTURE X(13).
019510010522R10081     03  FILLER                  PICTURE X(23).
019520010517
019530000000      /
019540000000       01  STMT-SUM-04.
019550971210           03  FILLER                  PICTURE X(8).
019560000000           03  SS04-INVESTMENT-NAME    PICTURE X(35).
019570980130           03  FILLER                  PICTURE X(2).
019580980130           03  SS04-CURRENCY           PICTURE X(3).
019590000303           03  FILLER                  PICTURE X(32).
019600000303           03  SS04-LAST-UNIT-PRICE    PICTURE ZZ,ZZZ.9999.
019610000000           03  SS04-LAST-UNIT-PRICE-SIGN
019620000000                                       PICTURE X(1).
019630000000           03  SS04-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZZ.999.
019640000000           03  SS04-NO-OF-UNITS-SIGN   PICTURE X(1).
019650000303           03  SS04-MARKET-VALUE       PICTURE $$$,$$$,$$$,$$$.99.
019660000000           03  SS04-MARKET-VALUE-SIGN  PICTURE X(1).
019670000000           03  FILLER                  PICTURE X(23).
019680990928
019690990315       01  STMT-SUM-04-V1-R              REDEFINES STMT-SUM-04.
019700990315           03  FILLER                    PICTURE X(8).
019710990315           03  SS04V1-INVESTMENT-NAME    PICTURE X(35).
019720990315           03  FILLER                    PICTURE X(2).
019730990315           03  SS04V1-CURRENCY           PICTURE X(3).
019740000303           03  FILLER                    PICTURE X(20).
019750000303           03  SS04V1-ACB-UNIT-PRICE     PICTURE ZZ,ZZZ.9999.
019760990315           03  SS04V1-ACB-UNIT-PRICE-SIGN
019770990315                                         PICTURE X(1).
019780000303      *    03  FILLER                    PICTURE X(2).
019790000303           03  SS04V1-LAST-UNIT-PRICE    PICTURE ZZ,ZZZ.9999.
019800990315           03  SS04V1-LAST-UNIT-PRICE-SIGN
019810990315                                         PICTURE X(1).
019820990315           03  SS04V1-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZZ.999.
019830990315           03  SS04V1-NO-OF-UNITS-SIGN   PICTURE X(1).
019840000303           03  SS04V1-MARKET-VALUE       PICTURE $$$,$$$,$$$,$$$.99.
019850990315           03  SS04V1-MARKET-VALUE-SIGN  PICTURE X(1).
019860990315           03  FILLER                    PICTURE X(23).
019870990928
019880990928       01  STMT-SUM-04-V3-R              REDEFINES STMT-SUM-04.
019890990928           03  FILLER                    PICTURE X(10).
019900990928           03  SS04V3-INVESTMENT-NAME    PICTURE X(35).
019910000224           03  FILLER                    PICTURE X(26).
019920000224           03  SS04V3-LAST-UNIT-PRICE    PICTURE ZZ,ZZZ.9999.
019930990928           03  SS04V3-LAST-UNIT-PRICE-SIGN
019940990928                                         PICTURE X(1).
019950990928           03  FILLER                    PICTURE X(1).
019960990928           03  SS04V3-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZZ.999.
019970990928           03  SS04V3-NO-OF-UNITS-SIGN   PICTURE X(1).
019980990928           03  FILLER                    PICTURE X(1).
019990000224           03  SS04V3-MARKET-VALUE       PICTURE $$$,$$$,$$$,$$$.99.
020000990928           03  SS04V3-MARKET-VALUE-SIGN  PICTURE X(1).
020010990928           03  FILLER                    PICTURE X(10).
020020990928
020030010517R10081 01  STMT-SUM-04-V4-R              REDEFINES STMT-SUM-04.
020040010522           03  FILLER                    PICTURE X(6).
020050010517           03  SS04V4-INVESTMENT-NAME    PICTURE X(35).
020060010517           03  FILLER                    PICTURE X(2).
020070010517           03  SS04V4-CURRENCY           PICTURE X(3).
020080010517           03  FILLER                    PICTURE X(20).
020090010517           03  SS04V4-ACB-UNIT-PRICE     PICTURE ZZ,ZZZ.9999.
020100010517           03  SS04V4-ACB-UNIT-PRICE-SIGN
020110010517                                         PICTURE X(1).
020120010517      *    03  FILLER                    PICTURE X(2).
020130010517           03  SS04V4-LAST-UNIT-PRICE    PICTURE ZZ,ZZZ.9999.
020140010517           03  SS04V4-LAST-UNIT-PRICE-SIGN
020150010517                                         PICTURE X(1).
020160010517           03  SS04V4-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZZ.999.
020170010517           03  SS04V4-NO-OF-UNITS-SIGN   PICTURE X(1).
020180010522           03  FILLER                    PICTURE X(3).
020190010517           03  SS04V4-MARKET-VALUE       PICTURE $$$,$$$,$$$,$$$.99.
020200010517           03  SS04V4-MARKET-VALUE-SIGN  PICTURE X(1).
020210010522R10081     03  FILLER                    PICTURE X(22).
020220010517
020230000000      /
020240000000       01  STMT-SUM-05.
020250000000           03  FILLER                  PICTURE X(113).
020260000000           03  SS05-LIT1               PICTURE X(14).
020270000000           03  FILLER                  PICTURE X(23).
020280000000
020290990928       01  STMT-SUM-05-V3-R            REDEFINES STMT-SUM-05.
020300990928           03  FILLER                  PICTURE X(106).
020310990928           03  SS05V3-LIT1             PICTURE X(14).
020320990928           03  FILLER                  PICTURE X(10).
020330010517
020340010517R10081 01  STMT-SUM-05-V4-R            REDEFINES STMT-SUM-05.
020350010522           03  FILLER                  PICTURE X(114).
020360010517           03  SS05V4-LIT1             PICTURE X(14).
020370010522R10081     03  FILLER                  PICTURE X(22).
020380990928
020390010517R10081/
020400010517       01  STMT-SUM-05A.
020410010522           03  FILLER                  PICTURE X(6).
020420010517           03  SS05A-LIT1              PICTURE X(50).
020430010522           03  FILLER                  PICTURE X(53).
020440010517           03  SS05A-MARKET-VALUE      PICTURE $$$,$$$,$$$,$$$.99-.
020450010522           03  FILLER                  PICTURE X(22).
020460010517
020470010517      /
020480010517       01  STMT-SUM-05B.
020490010522           03  FILLER                  PICTURE X(6).
020500010517           03  SS05B-LIT00             PICTURE X(35).
020510010519           03  FILLER                  PICTURE X(6).
020520010517           03  SS05B-LIT0              PICTURE X(8).
020530010517           03  FILLER                  PICTURE X(4).
020540010517           03  SS05B-LIT1              PICTURE X(8).
020550010517           03  FILLER                  PICTURE X(2).
020560010517           03  SS05B-LIT2              PICTURE X(13).
020570010517           03  FILLER                  PICTURE X(3).
020580010517           03  SS05B-LIT3              PICTURE X(13).
020590010522           03  FILLER                  PICTURE X(16).
020600010517           03  SS05B-LIT4              PICTURE X(13).
020610010522           03  FILLER                  PICTURE X(23).
020620010517
020630010517      /
020640010517       01  STMT-SUM-05C.
020650010522           03  FILLER                  PICTURE X(69).
020660010517           03  SS05C-LIT1              PICTURE X(13).
020670010517           03  FILLER                  PICTURE X(3).
020680010517           03  SS05C-LIT2              PICTURE X(13).
020690010522           03  FILLER                  PICTURE X(16).
020700010517           03  SS05C-LIT3              PICTURE X(13).
020710010522           03  FILLER                  PICTURE X(23).
020720010517
020730010517      /
020740010517       01  STMT-SUM-05D.
020750010522           03  FILLER                  PICTURE X(6).
020760010519           03  SS05D-CERTIFICATE-NO    PICTURE X(12).
020770010917R11406     03  FILLER                  PICTURE X(29).
020780010917R11406     03  SS05D-RATE              PICTURE ZZZ.999.
020790010607           03  SS05D-PERCENTAGE-LIT    PICTURE X(1).
020800010608           03  FILLER                  PICTURE X(6).
020810010608           03  SS05D-TERM              PICTURE 99.999.
020820010608           03  FILLER                  PICTURE X(5).
020830010608           03  SS05D-ISSUE-DATE        PICTURE XXXX/XX/XX.
020840010608           03  FILLER                  PICTURE X(6).
020850010608R10383     03  SS05D-MATURITY-DATE     PICTURE XXXX/XX/XX.
020860010522           03  FILLER                  PICTURE X(11).
020870010517           03  SS05D-ACTUAL-CAPITAL    PICTURE $$$,$$$,$$$,$$$.99.
020880010517           03  SS05D-ACTUAL-CAPITAL-SIGN
020890010517                                       PICTURE X(1).
020900010522           03  FILLER                  PICTURE X(22).
020910010517
020920010517      /
020930010517       01  STMT-SUM-05E.
020940010522           03  FILLER                  PICTURE X(6).
020950010517           03  SS05E-INVESTMENT-NAME   PICTURE X(35).
020960010917R11406     03  FILLER                  PICTURE X(6).
020970010917R11406     03  SS05E-RATE              PICTURE ZZ9.999.
020980010608R10383     03  SS05E-PERCENTAGE-LIT    PICTURE X(1).
020990010522           03  FILLER                  PICTURE X(54).
021000010517           03  SS05E-ACTUAL-CAPITAL    PICTURE $$$,$$$,$$$,$$$.99.
021010010517           03  SS05E-ACTUAL-CAPITAL-SIGN
021020010517                                       PICTURE X(1).
021030010522           03  FILLER                  PICTURE X(22).
021040010517
021050010517      /
021060010517       01  STMT-SUM-05F.
021070010522           03  FILLER                  PICTURE X(114).
021080010517           03  SS05F-LIT1              PICTURE X(14).
021090010522           03  FILLER                  PICTURE X(22).
021100010517
021110010517      /
021120010517       01  STMT-SUM-05G.
021130010522           03  FILLER                  PICTURE X(6).
021140010517           03  SS05G-LIT1              PICTURE X(50).
021150010522           03  FILLER                  PICTURE X(53).
021160010517           03  SS05G-TOTAL-CAPITAL     PICTURE $$$,$$$,$$$,$$$.99-.
021170010522R10081     03  FILLER                  PICTURE X(22).
021180010517
021190000000      /
021200000000       01  STMT-SUM-06.
021210010522           03  FILLER                  PICTURE X(8).
021220000000           03  SS06-LIT1               PICTURE X(35).
021230000303           03  FILLER                  PICTURE X(35).
021240000000           03  SS06-LIT-CURRDESC       PICTURE X(30).
021250000303           03  SS06-MARKET-VALUE       PICTURE $$$,$$$,$$$,$$$.99-.
021260010522           03  FILLER                  PICTURE X(23).
021270990928
021280990928       01  STMT-SUM-06-V3-R            REDEFINES STMT-SUM-06.
021290990928           03  FILLER                  PICTURE X(10).
021300990928           03  SS06V3-LIT1             PICTURE X(30).
021310000224           03  FILLER                  PICTURE X(31).
021320990928           03  SS06V3-LIT-CURRDESC     PICTURE X(30).
021330000224           03  SS06V3-MARKET-VALUE     PICTURE $$$,$$$,$$$,$$$.99-.
021340990928           03  FILLER                  PICTURE X(10).
021350010517
021360010517R10081 01  STMT-SUM-06-V4-R            REDEFINES STMT-SUM-06.
021370010522           03  FILLER                  PICTURE X(6).
021380010522           03  SS06V4-LIT1             PICTURE X(35).
021390010522           03  FILLER                  PICTURE X(35).
021400010522           03  SS06V4-LIT-CURRDESC     PICTURE X(30).
021410010522           03  FILLER                  PICTURE X(3).
021420010517           03  SS06V4-MARKET-VALUE     PICTURE $$$,$$$,$$$,$$$.99-.
021430010522R10081     03  FILLER                  PICTURE X(22).
021440990928
021450971210      /
021460971210       01  STMT-SUM-07.
021470971210           03  FILLER                  PICTURE X(8).
021480971210           03  SS07-INVESTMENT-NAME    PICTURE X(35).
021490980202           03  FILLER                  PICTURE X(2).
021500980202           03  SS07-CURRENCY           PICTURE X(3).
021510000303           03  FILLER                  PICTURE X(20).
021520000303           03  SS07-ACB-UNIT-PRICE     PICTURE ZZ,ZZZ.9999.
021530990316           03  SS07-ACB-UNIT-PRICE-SIGN
021540990316                                       PICTURE X(1).
021550000303      *    03  FILLER                  PICTURE X(2).
021560000303           03  SS07-LAST-UNIT-PRICE    PICTURE ZZ,ZZZ.9999.
021570971210           03  SS07-LAST-UNIT-PRICE-SIGN
021580971210                                       PICTURE X(1).
021590971210           03  SS07-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZZ.999.
021600971210           03  SS07-NO-OF-UNITS-SIGN   PICTURE X(1).
021610000303           03  SS07-MARKET-VALUE       PICTURE $$$,$$$,$$$,$$$.99.
021620971210           03  SS07-MARKET-VALUE-SIGN  PICTURE X(1).
021630971210           03  FILLER                  PICTURE X(23).
021640990930
021650990930       01  STMT-SUM-07-V3-R            REDEFINES STMT-SUM-07.
021660990930           03  FILLER                  PICTURE X(10).
021670990930           03  SS07V3-INVESTMENT-NAME  PICTURE X(35).
021680990930           03  FILLER                  PICTURE X(2).
021690990930           03  SS07V3-CURRENCY         PICTURE X(3).
021700000225           03  FILLER                  PICTURE X(21).
021710000224           03  SS07V3-LAST-UNIT-PRICE  PICTURE ZZ,ZZZ.9999.
021720990930           03  SS07V3-LAST-UNIT-PRICE-SIGN
021730990930                                       PICTURE X(1).
021740990930           03  FILLER                  PICTURE X(1).
021750990930           03  SS07V3-NO-OF-UNITS      PICTURE ZZZ,ZZZ,ZZZ.999.
021760990930           03  SS07V3-NO-OF-UNITS-SIGN PICTURE X(1).
021770990930           03  FILLER                  PICTURE X(1).
021780000224           03  SS07V3-MARKET-VALUE     PICTURE $$$,$$$,$$$,$$$.99.
021790990930           03  SS07V3-MARKET-VALUE-SIGN PICTURE X(1).
021800000225           03  FILLER                  PICTURE X(10).
021810010517
021820010517R10081 01  STMT-SUM-07-V4-R            REDEFINES STMT-SUM-07.
021830010522           03  FILLER                  PICTURE X(6).
021840010517           03  SS07V4-INVESTMENT-NAME  PICTURE X(35).
021850010517           03  FILLER                  PICTURE X(2).
021860010517           03  SS07V4-CURRENCY         PICTURE X(3).
021870010517           03  FILLER                  PICTURE X(20).
021880010517           03  SS07V4-ACB-UNIT-PRICE   PICTURE ZZ,ZZZ.9999.
021890010517           03  SS07V4-ACB-UNIT-PRICE-SIGN
021900010517                                       PICTURE X(1).
021910010517      *    03  FILLER                  PICTURE X(2).
021920010517           03  SS07V4-LAST-UNIT-PRICE    PICTURE ZZ,ZZZ.9999.
021930010517           03  SS07V4-LAST-UNIT-PRICE-SIGN
021940010517                                         PICTURE X(1).
021950010517           03  SS07V4-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZZ.999.
021960010517           03  SS07V4-NO-OF-UNITS-SIGN   PICTURE X(1).
021970010522           03  FILLER                    PICTURE X(3).
021980010517           03  SS07V4-MARKET-VALUE       PICTURE $$$,$$$,$$$,$$$.99.
021990010517           03  SS07V4-MARKET-VALUE-SIGN  PICTURE X(1).
022000010522R10081     03  FILLER                    PICTURE X(22).
022010010517
022020971210      /
022030971210       01  STMT-SUM-08.
022040971210           03  FILLER                  PICTURE X(113).
022050971210           03  SS08-LIT1               PICTURE X(14).
022060971210           03  FILLER                  PICTURE X(23).
022070990930
022080990930       01  STMT-SUM-08-V3-R            REDEFINES STMT-SUM-08.
022090990930           03  FILLER                  PICTURE X(106).
022100990930           03  SS08V3-LIT1             PICTURE X(14).
022110990930           03  FILLER                  PICTURE X(10).
022120010517
022130010517R10081 01  STMT-SUM-08-V4-R            REDEFINES STMT-SUM-08.
022140010522           03  FILLER                  PICTURE X(114).
022150010517           03  SS08V4-LIT1             PICTURE X(14).
022160010522R10081     03  FILLER                  PICTURE X(22).
022170010517
022180000000      /
022190971210       01  STMT-SUM-09.
022200971210           03  FILLER                  PICTURE X(8).
022210971210           03  SS09-LIT1               PICTURE X(35).
022220000303           03  FILLER                  PICTURE X(35).
022230971210           03  SS09-LIT-CURRDESC       PICTURE X(30).
022240000303           03  SS09-MARKET-VALUE       PICTURE $$$,$$$,$$$,$$$.99-.
022250971210           03  FILLER                  PICTURE X(23).
022260990930
022270991009       01  STMT-SUM-09-V3-R            REDEFINES STMT-SUM-09.
022280990930           03  FILLER                  PICTURE X(10).
022290990930           03  SS09V3-LIT1             PICTURE X(30).
022300000224           03  FILLER                  PICTURE X(31).
022310990930           03  SS09V3-LIT-CURRDESC     PICTURE X(30).
022320000224           03  SS09V3-MARKET-VALUE     PICTURE $$$,$$$,$$$,$$$.99-.
022330990930           03  FILLER                  PICTURE X(10).
022340991002
022350010517R10081 01  STMT-SUM-09-V4-R            REDEFINES STMT-SUM-09.
022360010522           03  FILLER                  PICTURE X(6).
022370010517           03  SS09V4-LIT1             PICTURE X(35).
022380010522           03  FILLER                  PICTURE X(35).
022390010522           03  SS09V4-LIT-CURRDESC     PICTURE X(30).
022400010522           03  FILLER                  PICTURE X(3).
022410010517           03  SS09V4-MARKET-VALUE     PICTURE $$$,$$$,$$$,$$$.99-.
022420010522R10081     03  FILLER                  PICTURE X(22).
022430010517
022440991002      *****
022450991002      *****    The confirm summary lines for RESP Account.
022460991002      *****         Version 3:  Used by UBS.
022470991002      *****
022480991002
022490971210      /
022500991007       01  STMT-SUM-RESP-HDG.
022510991007           03  SSRHDG-LIT1             PICTURE X(137).
022520991002           03  FILLER                  PICTURE X(13).
022530991002
022540991007       01  STMT-SUM-RESP-HDG-V3-R      REDEFINES STMT-SUM-RESP-HDG.
022550991002           03  FILLER                  PICTURE X(10).
022560991007           03  SSRHDGV3-LIT1           PICTURE X(110).
022570991002           03  FILLER                  PICTURE X(10).
022580991002
022590991002      /
022600991007       01  STMT-SUM-RESP-01.
022610991002           03  FILLER                  PICTURE X(8).
022620991012           03  SSR01-LIT1              PICTURE X(22).
022630991007           03  SSR01-ACCT-BENEFICIARY1 PICTURE X(45).
022640991002           03  FILLER                  PICTURE X(75).
022650991002
022660991007       01  STMT-SUM-RESP-01-V3-R       REDEFINES STMT-SUM-RESP-01.
022670991002           03  FILLER                  PICTURE X(10).
022680991007           03  SSR01V3-LIT1            PICTURE X(22).
022690991007           03  SSR01V3-ACCT-BENEFICIARY1 PICTURE X(45).
022700991002           03  FILLER                  PICTURE X(53).
022710991002
022720991002      /
022730991007       01  STMT-SUM-RESP-02.
022740991002           03  FILLER                  PICTURE X(8).
022750991012           03  FILLER                  PICTURE X(22).
022760991012      *    03  SSR02-LIT1              PICTURE X(22).
022770991011           03  SSR02-ACCT-BENEFICIARY2 PICTURE X(45).
022780991002           03  FILLER                  PICTURE X(75).
022790991002
022800991007       01  STMT-SUM-RESP-02-V3-R       REDEFINES STMT-SUM-RESP-02.
022810991002           03  FILLER                  PICTURE X(10).
022820991012           03  FILLER                  PICTURE X(22).
022830991012      *    03  SSR02V3-LIT1            PICTURE X(22).
022840991011           03  SSR02V3-ACCT-BENEFICIARY2 PICTURE X(45).
022850991002           03  FILLER                  PICTURE X(53).
022860991002
022870991007      /
022880991007       01  STMT-SUM-RESP-03.
022890991007           03  FILLER                  PICTURE X(8).
022900991012           03  FILLER                  PICTURE X(22).
022910991012      *    03  SSR03-LIT1              PICTURE X(22).
022920991011           03  SSR03-ACCT-BENEFICIARY3 PICTURE X(45).
022930991007           03  FILLER                  PICTURE X(75).
022940991007
022950991007       01  STMT-SUM-RESP-03-V3-R       REDEFINES STMT-SUM-RESP-03.
022960991007           03  FILLER                  PICTURE X(10).
022970991012           03  FILLER                  PICTURE X(22).
022980991012      *    03  SSR03V3-LIT1            PICTURE X(22).
022990991011           03  SSR03V3-ACCT-BENEFICIARY3 PICTURE X(45).
023000991007           03  FILLER                  PICTURE X(53).
023010991007
023020991007      /
023030991007       01  STMT-SUM-RESP-04.
023040991007           03  FILLER                  PICTURE X(8).
023050991012           03  FILLER                  PICTURE X(22).
023060991012      *    03  SSR04-LIT1              PICTURE X(22).
023070991011           03  SSR04-ACCT-BENEFICIARY4 PICTURE X(45).
023080991007           03  FILLER                  PICTURE X(75).
023090991007
023100991007       01  STMT-SUM-RESP-04-V3-R       REDEFINES STMT-SUM-RESP-04.
023110991007           03  FILLER                  PICTURE X(10).
023120991012           03  FILLER                  PICTURE X(22).
023130991012      *    03  SSR04V3-LIT1            PICTURE X(22).
023140991011           03  SSR04V3-ACCT-BENEFICIARY4 PICTURE X(45).
023150991007           03  FILLER                  PICTURE X(53).
023160991007
023170991007      /
023180991007       01  STMT-SUM-RESP-05.
023190991007           03  FILLER                  PICTURE X(8).
023200991012           03  FILLER                  PICTURE X(22).
023210991012      *    03  SSR05-LIT1              PICTURE X(22).
023220991011           03  SSR05-ACCT-BENEFICIARY5 PICTURE X(45).
023230991007           03  FILLER                  PICTURE X(75).
023240991007
023250991007       01  STMT-SUM-RESP-05-V3-R       REDEFINES STMT-SUM-RESP-05.
023260991007           03  FILLER                  PICTURE X(10).
023270991012           03  FILLER                  PICTURE X(22).
023280991012      *    03  SSR05V3-LIT1            PICTURE X(22).
023290991011           03  SSR05V3-ACCT-BENEFICIARY5 PICTURE X(45).
023300991007           03  FILLER                  PICTURE X(53).
023310991007
023320991007      /
023330991007       01  STMT-SUM-RESP-06.
023340991007           03  FILLER                  PICTURE X(8).
023350991012           03  FILLER                  PICTURE X(22).
023360991012      *    03  SSR06-LIT1              PICTURE X(22).
023370991011           03  SSR06-ACCT-BENEFICIARY6 PICTURE X(45).
023380991007           03  FILLER                  PICTURE X(75).
023390991007
023400991007       01  STMT-SUM-RESP-06-V3-R       REDEFINES STMT-SUM-RESP-06.
023410991007           03  FILLER                  PICTURE X(10).
023420991012           03  FILLER                  PICTURE X(22).
023430991012      *    03  SSR06V3-LIT1            PICTURE X(22).
023440991011           03  SSR06V3-ACCT-BENEFICIARY6 PICTURE X(45).
023450991007           03  FILLER                  PICTURE X(53).
023460991007
023470000000      ******************************************************************
023480000000      *                                                                *
023490000000      *    S T A T E M E N T   M E S S A G E   P R I N T   L I N E S   *
023500000000      *                                                                *
023510000000      ******************************************************************
023520000000
023530000000       01  STMT-MSG-01.
023540000000           03  FILLER                  PICTURE X(7).
023550000000           03  SM01-STATEMENT-MESSAGE  PICTURE X(115).
023560000000           03  FILLER                  PICTURE X(28).
023570000000      /
023580000000      ******************************************************************
023590000000      *                                                                *
023600000000      *    S T A T E M E N T   H E A D I N G   L I T E R A L S         *
023610000000      *                                                                *
023620000000      ******************************************************************
023630990329       01  WS-TOP-LITS.
023640971203
023650971203      ****
023660971203      ****      E N G L I S H
023670971203      ****
023680971203           05  WS-PAGE-LIT-E            PIC X(4)  VALUE "PAGE".
023690990316           05  WS-DEALER-LIT-E          PIC X(17) VALUE
023700990316                          "DEALER          :".
023710990316           05  WS-REP-LIT-E             PIC X(17) VALUE
023720990316                          "REPRESENTATIVE  :".
023730990316           05  WS-ADDR-LIT-E            PIC X(17) VALUE
023740990316                          "ADDRESS         :".
023750990316           05  WS-PHONE-LIT-E           PIC X(17) VALUE
023760990316                          "PHONE           :".
023770990316           05  WS-FAX-LIT-E             PIC X(17) VALUE
023780990316                          "FAX             :".
023790971215           05  WS-ACC-NO-LIT-E          PIC X(17) VALUE
023800971215                          "ACCOUNT NO     : ".
023810971215           05  WS-ACC-TYPE-LIT-E        PIC X(17) VALUE
023820971215                          "ACCOUNT TYPE   : ".
023830990316           05  WS-XREF-NO-LIT-E         PIC X(17) VALUE
023840990316                          "XREF NO         :".
023850010519           05  WS-SIN-NO-LIT-E          PIC X(17) VALUE
023860010519                          "SIN             :".
023870010519R10081     05  WS-SIN-NO-LIT-4-E        PIC X(5)  VALUE
023880010519                          "SIN :".
023890971203      ****
023900971203      ****    F R E N C H
023910971203      ****
023920971203           05  WS-PAGE-LIT-F            PIC X(4)  VALUE "PAGE".
023930990316           05  WS-DEALER-LIT-F          PIC X(17) VALUE
023940990316                          "COURTIER        :".
023950990316           05  WS-REP-LIT-F             PIC X(17) VALUE
023960030326R16804                    "REPRÉSENTANT(E) :".
023970990316           05  WS-ADDR-LIT-F            PIC X(17) VALUE
023980990316                          "ADRESSE         :".
023990990316           05  WS-PHONE-LIT-F           PIC X(17) VALUE
024000030326R16804                    "TÉLÉPHONE       :".
024010990316           05  WS-FAX-LIT-F             PIC X(17) VALUE
024020030326R16804                    "TÉLÉCOPIEUR     :".
024030971215           05  WS-ACC-NO-LIT-F          PIC X(17) VALUE
024040030326R16804                    "NUMÉRO DE COMPTE:".
024050971215           05  WS-ACC-TYPE-LIT-F        PIC X(17) VALUE
024060971215                          "GENRE DE COMPTE :".
024070990316           05  WS-XREF-NO-LIT-F         PIC X(17) VALUE
024080030326R16804                    "XREF NUMÉRO     :".
024090010519           05  WS-SIN-NO-LIT-F          PIC X(17) VALUE
024100010519                          "NAS             :".
024110010519R10081     05  WS-SIN-NO-LIT-4-F        PIC X(5)  VALUE
024120010519                          "NAS :".
024130971203
024140971203       01  WS-L                         REDEFINES WS-TOP-LITS.
024150971203           05 WS-LL                     OCCURS 2 TIMES
024160971203                                        INDEXED BY SSL.
024170971203            10  WS-PAGE-LIT              PIC X(4).
024180990316            10  WS-DEALER-LIT            PIC X(17).
024190971203
024200990316            10  WS-REP-LIT               PIC X(17).
024210971203
024220990316            10  WS-ADDR-LIT              PIC X(17).
024230971203
024240990316            10  WS-PHONE-LIT             PIC X(17).
024250971203
024260990316            10  WS-FAX-LIT               PIC X(17).
024270971203
024280971215            10  WS-ACC-NO-LIT            PIC X(17).
024290971203
024300971215            10  WS-ACC-TYPE-LIT          PIC X(17).
024310971203
024320990316            10  WS-XREF-NO-LIT           PIC X(17).
024330971203
024340010519            10  WS-SIN-NO-LIT            PIC X(17).
024350971203
024360010519R10081      10  WS-SIN-NO-LIT-4          PIC X(5).
024370010519
024380971203
024390971203       01  WS-STMT-HDG-LITS.
024400000000      *****
024410000000      *****    English Literals.
024420000000      *****
024430000000
024440000000      *****
024450000000      *****    - Standard Version.
024460000000      *****
024470000000
024480971203           03  WS-SH-HDGLIT01-E.
024490000000               05  FILLER              PICTURE X(50)       VALUE
024500000000                   "--------------------------------------------------".
024510000000               05  FILLER              PICTURE X(50)       VALUE
024520000000                   "--------------------------------------------------".
024530000000               05  FILLER              PICTURE X(50)       VALUE
024540000000                   "-------------------------------------             ".
024550990928
024560971203           03  WS-SH-HDGLIT02-E.
024570000000               05  FILLER              PICTURE X(50)       VALUE
024580971204                   " TRADE                                           G".
024590000000               05  FILLER              PICTURE X(50)       VALUE
024600971215                   "ROSS                     NET INVESTED/          PR".
024610000000               05  FILLER              PICTURE X(50)       VALUE
024620971215                   "ICE                                               ".
024630990928
024640971203           03  WS-SH-HDGLIT03-E.
024650000000               05  FILLER              PICTURE X(50)       VALUE
024660971204                   " DATE       TRANSACTION TYPE                     A".
024670000000               05  FILLER              PICTURE X(50)       VALUE
024680971215                   "MOUNT     DEDUCTIONS          PROCEEDS       PER U".
024690000000               05  FILLER              PICTURE X(50)       VALUE
024700971215                   "NIT            UNITS                              ".
024710971203
024720971203           03  WS-SH-HDGLIT04-E.
024730000000               05  FILLER              PICTURE X(50)       VALUE
024740000000                   "--------------------------------------------------".
024750000000               05  FILLER              PICTURE X(50)       VALUE
024760000000                   "--------------------------------------------------".
024770000000               05  FILLER              PICTURE X(50)       VALUE
024780000000                   "-------------------------------------             ".
024790971203
024800971203           03  WS-SH-HDGLIT05-E.
024810000000               05  FILLER              PICTURE X(50)       VALUE
024820000000                   "--------------------------------------------------".
024830000000               05  FILLER              PICTURE X(50)       VALUE
024840000000                   "--------------------------------------------------".
024850000000               05  FILLER              PICTURE X(50)       VALUE
024860000000                   "-------------------------------------             ".
024870000000
024880990928           03  WS-SH-HDGLIT03-1-E.
024890990928               05  FILLER              PICTURE X(9).
024900990928               05  FILLER              PICTURE X(31)       VALUE
024910990928                   "-------------------------------"                   .
024920990928               05  FILLER              PICTURE X(50)       VALUE
024930990928                   "--------------------------------------------------".
024940990928               05  FILLER              PICTURE X(31)       VALUE
024950990928                   "------------------------------ ".
024960990928               05  FILLER              PICTURE X(9).
024970000000
024980990928           03  WS-SH-HDGLIT03-2-E.
024990990928               05  FILLER              PICTURE X(10).
025000990928               05  FILLER              PICTURE X(10)       VALUE
025010990928                   "DATE      ".
025020990928               05  FILLER              PICTURE X(2).
025030990928               05  FILLER              PICTURE X(35)       VALUE
025040990928                   "DETAILS                            ".
025050990928               05  FILLER              PICTURE X(3).
025060000224               05  FILLER              PICTURE X(9)       VALUE
025070000224                   "   AMOUNT".
025080000224               05  FILLER              PICTURE X(5).
025090990928               05  FILLER              PICTURE X(8)       VALUE
025100990928                   "    UNIT".
025110000224               05  FILLER              PICTURE X(2).
025120990928               05  FILLER              PICTURE X(15)       VALUE
025130990928                   "          UNITS".
025140000224               05  FILLER              PICTURE X(5).
025150990928               05  FILLER              PICTURE X(15)       VALUE
025160990928                   "         MARKET".
025170000224               05  FILLER              PICTURE X(11).
025180990928
025190990928           03  WS-SH-HDGLIT03-3-E.
025200990928               05  FILLER              PICTURE X(10).
025210990928               05  FILLER              PICTURE X(10)       VALUE
025220990928                   "          ".
025230990928               05  FILLER              PICTURE X(2).
025240990928               05  FILLER              PICTURE X(35)       VALUE
025250990928                   "                                   ".
025260990928               05  FILLER              PICTURE X(3).
025270000224               05  FILLER              PICTURE X(9)       VALUE
025280000224                   "         ".
025290000224               05  FILLER              PICTURE X(5).
025300990928               05  FILLER              PICTURE X(8)       VALUE
025310990928                   "   PRICE".
025320990928               05  FILLER              PICTURE X(2).
025330990928               05  FILLER              PICTURE X(15)       VALUE
025340990928                   "               ".
025350000224               05  FILLER              PICTURE X(5).
025360990928               05  FILLER              PICTURE X(15)       VALUE
025370990928                   "          VALUE".
025380990928               05  FILLER              PICTURE X(11).
025390990928
025400990928           03  WS-SH-HDGLIT03-4-E.
025410990928               05  FILLER              PICTURE X(9).
025420990928               05  FILLER              PICTURE X(31)       VALUE
025430990928                   "-------------------------------"                   .
025440990928               05  FILLER              PICTURE X(50)       VALUE
025450990928                   "--------------------------------------------------".
025460990928               05  FILLER              PICTURE X(31)       VALUE
025470990928                   "------------------------------ "                   .
025480990928               05  FILLER              PICTURE X(9).
025490010522
025500010522R10081     03  WS-SH-HDGLIT04-1-E.
025510010522               05  FILLER              PICTURE X(50)       VALUE
025520010522                   "      --------------------------------------------".
025530010522               05  FILLER              PICTURE X(50)       VALUE
025540010522                   "--------------------------------------------------".
025550010522               05  FILLER              PICTURE X(50)       VALUE
025560010522                   "----------------------------                      ".
025570010522
025580010522           03  WS-SH-HDGLIT04-2-E.
025590010522               05  FILLER              PICTURE X(50)       VALUE
025600010525                   "      TRADE         TRANSACTION TYPE              ".
025610010522               05  FILLER              PICTURE X(50)       VALUE
025620010525                   "      GROSS     DEDUCTIONS     NET INVESTED/      ".
025630010522               05  FILLER              PICTURE X(50)       VALUE
025640010522                   "    PRICE                                         ".
025650010522
025660010522           03  WS-SH-HDGLIT04-3-E.
025670010522               05  FILLER              PICTURE X(50)       VALUE
025680010525                   "      DATE                                        ".
025690010522               05  FILLER              PICTURE X(50)       VALUE
025700010525                   "     AMOUNT                         PROCEEDS      ".
025710010522               05  FILLER              PICTURE X(50)       VALUE
025720010522                   " PER UNIT            UNITS                        ".
025730010522
025740010522           03  WS-SH-HDGLIT04-4-E.
025750010522               05  FILLER              PICTURE X(50)       VALUE
025760010522                   "      --------------------------------------------".
025770010522               05  FILLER              PICTURE X(50)       VALUE
025780010522                   "--------------------------------------------------".
025790010522               05  FILLER              PICTURE X(50)       VALUE
025800010522R10081             "----------------------------                      ".
025810010524
025820010525R10383     03  WS-SH-HDGLIT04-5-E.
025830010525               05  FILLER              PICTURE X(6).
025840010525               05  FILLER              PICTURE X(44)       VALUE
025850010917R11406*            "MUTUAL FUNDS                                ".
025860010917R11406             "INVESTMENT                                  ".
025870010531               05  FILLER              PICTURE X(100).
025880010531
025890010531           03  WS-SH-HDGLIT04-6-E.
025900010531               05  FILLER              PICTURE X(50)       VALUE
025910010531                   "      --------------------------------------------".
025920010531               05  FILLER              PICTURE X(50)       VALUE
025930010531                   "--------------------------------------------------".
025940010531               05  FILLER              PICTURE X(50)       VALUE
025950010531                   "----------------------------                      ".
025960010531
025970010531           03  WS-SH-HDGLIT04-7-E.
025980010531               05  FILLER              PICTURE X(50)       VALUE
025990010531                   "      TRADE         TRANSACTION TYPE              ".
026000010531               05  FILLER              PICTURE X(50)       VALUE
026010010531                   "      GROSS     DEDUCTIONS     NET INVESTED/      ".
026020010531               05  FILLER              PICTURE X(50)       VALUE
026030010531                   "                     BALANCE                      ".
026040010531
026050010531           03  WS-SH-HDGLIT04-8-E.
026060010531               05  FILLER              PICTURE X(50)       VALUE
026070010531                   "      DATE                                        ".
026080010531               05  FILLER              PICTURE X(50)       VALUE
026090010531                   "     AMOUNT                         PROCEEDS      ".
026100010531               05  FILLER              PICTURE X(50)       VALUE
026110010531                   "                                                  ".
026120010531
026130010531           03  WS-SH-HDGLIT04-9-E.
026140010531               05  FILLER              PICTURE X(50)       VALUE
026150010531                   "      --------------------------------------------".
026160010531               05  FILLER              PICTURE X(50)       VALUE
026170010531                   "--------------------------------------------------".
026180010531               05  FILLER              PICTURE X(50)       VALUE
026190010531                   "----------------------------                      ".
026200010531
026210010531           03  WS-SH-HDGLIT04-10-E.
026220010531               05  FILLER              PICTURE X(6).
026230010531               05  FILLER              PICTURE X(44)       VALUE
026240010531                   "DAILY INTEREST INVESTMENT                   ".
026250010531R10383         05  FILLER              PICTURE X(100).
026260010524
026270000000      *****
026280000000      *****    French Literals.
026290000000      *****
026300000000
026310000000      *****
026320000000      *****    - Standard Version.
026330000000      *****
026340000000
026350971203           03  WS-SH-HDGLIT01-F.
026360000000               05  FILLER              PICTURE X(50)       VALUE
026370000000                   "--------------------------------------------------".
026380000000               05  FILLER              PICTURE X(50)       VALUE
026390000000                   "--------------------------------------------------".
026400000000               05  FILLER              PICTURE X(50)       VALUE
026410000000                   "-------------------------------------             ".
026420971203           03  WS-SH-HDGLIT02-F.
026430000000               05  FILLER              PICTURE X(50)       VALUE
026440971204                   "                                                MO".
026450000000               05  FILLER              PICTURE X(50)       VALUE
026460971215                   "NTANT                  MONTANT NET INVESTI       P".
026470000000               05  FILLER              PICTURE X(50)       VALUE
026480971215                   "RIX                                               ".
026490971203           03  WS-SH-HDGLIT03-F.
026500000000               05  FILLER              PICTURE X(50)       VALUE
026510010519                   " DATE                TRANSACTION                 B".
026520000000               05  FILLER              PICTURE X(50)       VALUE
026530030326                   "RUT       DÉDUCTIONS         / PRODUIT       UNITA".
026540000000               05  FILLER              PICTURE X(50)       VALUE
026550030326                   "IRE            UNITÉS                             ".
026560971203
026570971203           03  WS-SH-HDGLIT04-F.
026580000000               05  FILLER              PICTURE X(50)       VALUE
026590000000                   "--------------------------------------------------".
026600000000               05  FILLER              PICTURE X(50)       VALUE
026610000000                   "--------------------------------------------------".
026620000000               05  FILLER              PICTURE X(50)       VALUE
026630000000                   "-------------------------------------             ".
026640971203
026650971203           03  WS-SH-HDGLIT05-F.
026660000000               05  FILLER              PICTURE X(50)       VALUE
026670000000                   "--------------------------------------------------".
026680000000               05  FILLER              PICTURE X(50)       VALUE
026690000000                   "--------------------------------------------------".
026700000000               05  FILLER              PICTURE X(50)       VALUE
026710000000                   "-------------------------------------             ".
026720000000
026730990928           03  WS-SH-HDGLIT03-1-F.
026740990928               05  FILLER              PICTURE X(9).
026750990928               05  FILLER              PICTURE X(31)       VALUE
026760990928                   "-------------------------------"                   .
026770990928               05  FILLER              PICTURE X(50)       VALUE
026780990928                   "--------------------------------------------------".
026790990928               05  FILLER              PICTURE X(31)       VALUE
026800990928                   "------------------------------ ".
026810990928               05  FILLER              PICTURE X(9).
026820990928
026830990928           03  WS-SH-HDGLIT03-2-F.
026840000228               05  FILLER              PICTURE X(10).
026850000228               05  FILLER              PICTURE X(10)       VALUE
026860000228                   "DATE      ".
026870000228               05  FILLER              PICTURE X(2).
026880000228               05  FILLER              PICTURE X(35)       VALUE
026890000228                   "DETAILS                            ".
026900000228               05  FILLER              PICTURE X(3).
026910000228               05  FILLER              PICTURE X(9)       VALUE
026920000228                   "   AMOUNT".
026930000228               05  FILLER              PICTURE X(5).
026940000228               05  FILLER              PICTURE X(8)       VALUE
026950000228                   "    UNIT".
026960000228               05  FILLER              PICTURE X(2).
026970000228               05  FILLER              PICTURE X(15)       VALUE
026980000228                   "          UNITS".
026990000228               05  FILLER              PICTURE X(5).
027000000228               05  FILLER              PICTURE X(15)       VALUE
027010000228                   "         MARKET".
027020000228               05  FILLER              PICTURE X(11).
027030000228
027040000228           03  WS-SH-HDGLIT03-3-F.
027050000228               05  FILLER              PICTURE X(10).
027060000228               05  FILLER              PICTURE X(10)       VALUE
027070000228                   "          ".
027080000228               05  FILLER              PICTURE X(2).
027090000228               05  FILLER              PICTURE X(35)       VALUE
027100000228                   "                                   ".
027110000228               05  FILLER              PICTURE X(3).
027120000228               05  FILLER              PICTURE X(9)       VALUE
027130000228                   "         ".
027140000228               05  FILLER              PICTURE X(5).
027150000228               05  FILLER              PICTURE X(8)       VALUE
027160000228                   "   PRICE".
027170000228               05  FILLER              PICTURE X(2).
027180000228               05  FILLER              PICTURE X(15)       VALUE
027190000228                   "               ".
027200000228               05  FILLER              PICTURE X(5).
027210000228               05  FILLER              PICTURE X(15)       VALUE
027220000228                   "          VALUE".
027230000228               05  FILLER              PICTURE X(11).
027240990928
027250990928           03  WS-SH-HDGLIT03-4-F.
027260990928               05  FILLER              PICTURE X(9).
027270990928               05  FILLER              PICTURE X(31)       VALUE
027280990928                   "-------------------------------"                   .
027290990928               05  FILLER              PICTURE X(50)       VALUE
027300990928                   "--------------------------------------------------".
027310990928               05  FILLER              PICTURE X(31)       VALUE
027320990928                   "------------------------------ "                   .
027330990928               05  FILLER              PICTURE X(9).
027340010522
027350010522R10081     03  WS-SH-HDGLIT04-1-F.
027360010522               05  FILLER              PICTURE X(50)       VALUE
027370010522                   "      --------------------------------------------".
027380010522               05  FILLER              PICTURE X(50)       VALUE
027390010522                   "--------------------------------------------------".
027400010522               05  FILLER              PICTURE X(50)       VALUE
027410010522                   "----------------------------                      ".
027420010522           03  WS-SH-HDGLIT04-2-F.
027430010522               05  FILLER              PICTURE X(50)       VALUE
027440010522                   "                                                  ".
027450010522               05  FILLER              PICTURE X(50)       VALUE
027460010522                   "    MONTANT                  MONTANT NET INVESTI  ".
027470010522               05  FILLER              PICTURE X(50)       VALUE
027480010522                   "     PRIX                                         ".
027490010522           03  WS-SH-HDGLIT04-3-F.
027500010522               05  FILLER              PICTURE X(50)       VALUE
027510010522                   "      DATE        TRANSACTION                     ".
027520010522               05  FILLER              PICTURE X(50)       VALUE
027530030326R16804             "     BRUT       DÉDUCTIONS         / PRODUIT      ".
027540010522               05  FILLER              PICTURE X(50)       VALUE
027550030326R16804             " UNITAIRE            UNITÉS                       ".
027560010522
027570010522           03  WS-SH-HDGLIT04-4-F.
027580010522               05  FILLER              PICTURE X(50)       VALUE
027590010522                   "      --------------------------------------------".
027600010522               05  FILLER              PICTURE X(50)       VALUE
027610010522                   "--------------------------------------------------".
027620010522               05  FILLER              PICTURE X(50)       VALUE
027630010522R10081             "----------------------------                      ".
027640010524
027650010525R10383     03  WS-SH-HDGLIT04-5-F.
027660010525               05  FILLER              PICTURE X(6).
027670010525               05  FILLER              PICTURE X(44)       VALUE
027680010917R11406*            "FONDS DE PLACEMENT                          ".
027690010917R11406             "INVESTISSEMENT                              ".
027700010531               05  FILLER              PICTURE X(100).
027710010531
027720010531           03  WS-SH-HDGLIT04-6-F.
027730010531               05  FILLER              PICTURE X(50)       VALUE
027740010531                   "      --------------------------------------------".
027750010531               05  FILLER              PICTURE X(50)       VALUE
027760010531                   "--------------------------------------------------".
027770010531               05  FILLER              PICTURE X(50)       VALUE
027780010531                   "----------------------------                      ".
027790010531           03  WS-SH-HDGLIT04-7-F.
027800010531               05  FILLER              PICTURE X(50)       VALUE
027810010531                   "                                                  ".
027820010531               05  FILLER              PICTURE X(50)       VALUE
027830010531                   "    MONTANT                  MONTANT NET INVESTI  ".
027840010531               05  FILLER              PICTURE X(50)       VALUE
027850010531                   "                                                  ".
027860010531           03  WS-SH-HDGLIT04-8-F.
027870010531               05  FILLER              PICTURE X(50)       VALUE
027880010531                   "      DATE        TRANSACTION                     ".
027890010531               05  FILLER              PICTURE X(50)       VALUE
027900030326R16804             "     BRUT       DÉDUCTIONS         / PRODUIT      ".
027910010531               05  FILLER              PICTURE X(50)       VALUE
027920010614                   "                     SOLDE                        ".
027930010531
027940010531           03  WS-SH-HDGLIT04-9-F.
027950010531               05  FILLER              PICTURE X(50)       VALUE
027960010531                   "      --------------------------------------------".
027970010531               05  FILLER              PICTURE X(50)       VALUE
027980010531                   "--------------------------------------------------".
027990010531               05  FILLER              PICTURE X(50)       VALUE
028000010531                   "----------------------------                      ".
028010010531
028020010531           03  WS-SH-HDGLIT04-10-F.
028030010531               05  FILLER              PICTURE X(6).
028040010531               05  FILLER              PICTURE X(44)       VALUE
028050010531                   "COMPTE A INTERET QUOTIDIEN                  ".
028060010531R10383         05  FILLER              PICTURE X(100).
028070000000
028080000000      *****
028090000000      *****    Statement Heading Literals.
028100000000      *****
028110000000
028120000000       01  WS-STMT-HDG-LITS-R          REDEFINES WS-STMT-HDG-LITS.
028130000000           03  WS-STMT-HDG-LIT-LNG     OCCURS   2  TIMES
028140000000                                       INDEXED BY  SHL.
028150000000               05  WS-SHL01            PICTURE X(150).
028160000000               05  WS-SHL02            PICTURE X(150).
028170000000               05  WS-SHL03            PICTURE X(150).
028180000000               05  WS-SHL04            PICTURE X(150).
028190000000               05  WS-SHL05            PICTURE X(150).
028200990928               05  WS-SHL03-1          PICTURE X(130).
028210990928               05  WS-SHL03-2          PICTURE X(130).
028220990928               05  WS-SHL03-3          PICTURE X(130).
028230990928               05  WS-SHL03-4          PICTURE X(130).
028240010522R10081         05  WS-SHL04-1          PICTURE X(150).
028250010522               05  WS-SHL04-2          PICTURE X(150).
028260010522               05  WS-SHL04-3          PICTURE X(150).
028270010522R10081         05  WS-SHL04-4          PICTURE X(150).
028280010525R10383         05  WS-SHL04-5          PICTURE X(150).
028290010531               05  WS-SHL04-6          PICTURE X(150).
028300010531               05  WS-SHL04-7          PICTURE X(150).
028310010531               05  WS-SHL04-8          PICTURE X(150).
028320010531               05  WS-SHL04-9          PICTURE X(150).
028330010531R10383         05  WS-SHL04-10         PICTURE X(150).
028340010525
028350000000      /
028360000000      ******************************************************************
028370000000      *                                                                *
028380000000      *    S T A T E M E N T   L I T E R A L S                         *
028390000000      *                                                                *
028400000000      ******************************************************************
028410000000
028420000000       01  WS-STMT-LITS.
028430000000
028440000000      *****
028450000000      *****    English Literals.
028460000000      *****
028470000000           03  WS-SH01-LIT1-E          PICTURE X(20)       VALUE
028480971211               "TRANSACTIONS FROM   ".
028490000000           03  WS-SH01-LIT2-E          PICTURE X(2)        VALUE "TO".
028500980213           03  WS-SH02-LIT-E           PICTURE X(15)       VALUE
028510980213               "** DUPLICATE **".
028520000000           03  WS-SH10-LIT1-E          PICTURE X(47)       VALUE
028530000000               "PLEASE NOTE THAT THIS ACCOUNT IS REGISTERED TO:".
028540990928           03  WS-SH11V3-LIT1-E        PICTURE X(30)       VALUE
028550990928               "     UNITHOLDER CONFIRM       ".
028560990928           03  WS-SH13V3-LIT1-E        PICTURE X(12)       VALUE
028570990928               "ACCOUNT NO :".
028580971202           03  WS-SD02-LIT1-E          PICTURE X(10)       VALUE
028590971201               "          ".
028600991008           03  WS-SD03-PERCENTAGE-LIT-E   PICTURE X(1)     VALUE
028610991008               "%".
028620000000           03  WS-SS01-LIT1-E.
028630000000               05  FILLER              PICTURE X(49)       VALUE
028640000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
028650000000               05  FILLER              PICTURE X(40)       VALUE
028660000000                   "   CONFIRMATION DATE ACCOUNT POSITION   ".
028670000000               05  FILLER              PICTURE X(49)       VALUE
028680000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
028690000000           03  WS-SS01V1-LIT1-E.
028700000000               05  FILLER              PICTURE X(49)       VALUE
028710000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
028720000000               05  FILLER              PICTURE X(40)       VALUE
028730000000                   "   CONFIRMATION DATE ACCOUNT POSITION   ".
028740000000               05  FILLER              PICTURE X(49)       VALUE
028750000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
028760000000           03  WS-SS01V2-LIT1-E.
028770000000               05  FILLER              PICTURE X(43)       VALUE
028780000000                   "* * * * * * * * * * * * * * * * * * * * * *".
028790000000               05  FILLER              PICTURE X(40)       VALUE
028800000000                   "   CONFIRMATION DATE ACCOUNT POSITION   ".
028810000000               05  FILLER              PICTURE X(43)       VALUE
028820000000                   "* * * * * * * * * * * * * * * * * * * * * *".
028830000000           03  WS-SS01V3-LIT1-E.
028840000000               05  FILLER              PICTURE X(49)       VALUE
028850000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
028860000000               05  FILLER              PICTURE X(40)       VALUE
028870000000                   "   CONFIRMATION DATE ACCOUNT POSITION   ".
028880000000               05  FILLER              PICTURE X(49)       VALUE
028890000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
028900000000           03  WS-SS01V4-LIT1-E.
028910000000               05  FILLER              PICTURE X(49)       VALUE
028920000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
028930000000               05  FILLER              PICTURE X(40)       VALUE
028940000000                   "   CONFIRMATION DATE ACCOUNT POSITION   ".
028950000000               05  FILLER              PICTURE X(49)       VALUE
028960000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
028970000000           03  WS-SS01V5-LIT1-E.
028980000000               05  FILLER              PICTURE X(49)       VALUE
028990000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
029000000000               05  FILLER              PICTURE X(40)       VALUE
029010000000                   "   CONFIRMATION DATE ACCOUNT POSITION   ".
029020000000               05  FILLER              PICTURE X(49)       VALUE
029030000000                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
029040990928           03  WS-SS01V3-1-LIT1-E.
029050000225               05  FILLER              PICTURE X(41)       VALUE
029060000225                   "* * * * * * * * * * * * * * * * * * * * *".
029070990928               05  FILLER              PICTURE X(30)       VALUE
029080000225                   " * * *  ACCOUNT SUMMARY  * * *".
029090990929               05  FILLER              PICTURE X(40)       VALUE
029100990929                   " * * * * * * * * * * * * * * * * * * * *".
029110010517R10081     03  WS-SS01V3-4-LIT1-E.
029120010517               05  FILLER              PICTURE X(49)       VALUE
029130010522                   "      * * * * * * * * * * * * * * * * * * * * * *".
029140010517               05  FILLER              PICTURE X(40)       VALUE
029150010517                   "   CONFIRMATION DATE ACCOUNT POSITION   ".
029160010517               05  FILLER              PICTURE X(49)       VALUE
029170010522R10081             "* * * * * * * * * * * * * * * * * * * *          ".
029180991002
029190991002      ***  FOR RESP
029200991002
029210991007           03  WS-SSRHDG-LIT1-E.
029220991002               05  FILLER              PICTURE X(49)       VALUE
029230991002                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
029240991002               05  FILLER              PICTURE X(40)       VALUE
029250991002                   " * * * * *  RESP  BENEFICIARY  * * * * *".
029260991002               05  FILLER              PICTURE X(49)       VALUE
029270991002                   " * * * * * * * * * * * * * * * * * * * * * * * * ".
029280991007           03  WS-SSRHDGV3-LIT1-E.
029290991002               05  FILLER              PICTURE X(40)       VALUE
029300991002                   "* * * * * * * * * * * * * * * * * * * * ".
029310991002               05  FILLER              PICTURE X(30)       VALUE
029320991002                   "* * *  RESP BENEFICIARY  * * *".
029330991002               05  FILLER              PICTURE X(40)       VALUE
029340991002                   " * * * * * * * * * * * * * * * * * * * *".
029350991002
029360991002      ***
029370991002
029380010517R10081     03  WS-SS02-LIT00-E         PICTURE X(35)       VALUE
029390010917R10081*        "MUTUAL FUNDS                       ".
029400010917R11406         "YOUR INVESTMENTS                   ".
029410990315           03  WS-SS02-LIT0-E          PICTURE X(13)       VALUE
029420990316               "      AVERAGE".
029430000000           03  WS-SS02-LIT1-E          PICTURE X(8)        VALUE
029440000000               "    UNIT".
029450000000           03  WS-SS02-LIT2-E          PICTURE X(13)       VALUE
029460000000               "         UNIT".
029470000000           03  WS-SS02-LIT3-E          PICTURE X(13)       VALUE
029480000000               "       MARKET".
029490990315           03  WS-SS03-LIT0-E          PICTURE X(13)       VALUE
029500990316               "         COST".
029510000000           03  WS-SS03-LIT1-E          PICTURE X(8)        VALUE
029520000000               "   PRICE".
029530000000           03  WS-SS03-LIT2-E          PICTURE X(13)       VALUE
029540000000               "      BALANCE".
029550000000           03  WS-SS03-LIT3-E          PICTURE X(13)       VALUE
029560000000               "        VALUE".
029570000000           03  WS-SS05-LIT1-E          PICTURE X(14)       VALUE
029580000000               " -------------".
029590000000           03  WS-SS05V1-LIT1-E        PICTURE X(13)       VALUE
029600000000               " ------------".
029610000000           03  WS-SS05V2-LIT1-E        PICTURE X(14)       VALUE
029620000000               " -------------".
029630000000           03  WS-SS05V3-LIT1-E        PICTURE X(14)       VALUE
029640000000               " -------------".
029650000000           03  WS-SS05V4-LIT1-E        PICTURE X(14)       VALUE
029660000000               " -------------".
029670000000           03  WS-SS05V5-LIT1-E        PICTURE X(14)       VALUE
029680000000               " -------------".
029690990928           03  WS-SS05V3-1-LIT1-E      PICTURE X(14)       VALUE
029700990928               " -------------".
029710010517R10081     03  WS-SS05A-LIT1-E         PICTURE X(50)       VALUE
029720010917      *        "TOTAL VALUE FOR YOUR FUNDS                        ".
029730010917R11406         "TOTAL VALUE OF YOUR INVESTMENTS                   ".
029740010517           03  WS-SS05B-LIT00-E        PICTURE X(35)       VALUE
029750010725               "GUARANTEED INVESTMENTS             ".
029760010517           03  WS-SS05B-LIT0-E         PICTURE X(8)        VALUE
029770010517               "    RATE".
029780010517           03  WS-SS05B-LIT1-E         PICTURE X(8)        VALUE
029790010517               "    TERM".
029800010517           03  WS-SS05B-LIT2-E         PICTURE X(13)       VALUE
029810010517               "        ISSUE".
029820010517           03  WS-SS05B-LIT3-E         PICTURE X(13)       VALUE
029830010517               "     MATURITY".
029840010517           03  WS-SS05B-LIT4-E         PICTURE X(13)       VALUE
029850010517               "       ACTUAL".
029860010517           03  WS-SS05C-LIT1-E         PICTURE X(13)       VALUE
029870010517               "         DATE".
029880010517           03  WS-SS05C-LIT2-E         PICTURE X(13)       VALUE
029890010517               "         DATE".
029900010517           03  WS-SS05C-LIT3-E         PICTURE X(13)       VALUE
029910010517               "      CAPITAL".
029920010517           03  WS-SS05F-LIT1-E         PICTURE X(14)       VALUE
029930010517               " -------------".
029940010517           03  WS-SS05G-LIT1-E         PICTURE X(50)       VALUE
029950010517R10081         "TOTAL VALUE FOR YOUR GUARANTEED INVESTMENTS       ".
029960000000           03  WS-SS06-LIT1-E          PICTURE X(35)       VALUE
029970990317               "ACCOUNT VALUE                      ".
029980991002
029990991002      *** FOR RESP
030000991002
030010991011      *    03  WS-SSR01-LIT1-E         PICTURE X(21)       VALUE
030020991011      *        "ACCOUNT BENEFICIARY: ".
030030991009           03  WS-SSR-ACC-LIT-E       PICTURE X(21)       VALUE
030040991002               "ACCOUNT BENEFICIARY: ".
030050000000
030060000000      *****
030070000000      *****    French Literals.
030080000000      *****
030090000000
030100000000           03  WS-SH01-LIT1-F          PICTURE X(20)       VALUE
030110971215               "TRANSACTIONS DE     ".
030120000000           03  WS-SH01-LIT2-F          PICTURE X(2)        VALUE "A ".
030130980213           03  WS-SH02-LIT-F           PICTURE X(15)       VALUE
030140980213               "** DUPLICATA **".
030150000000           03  WS-SH10-LIT1-F          PICTURE X(47)       VALUE
030160000000               "VEUILLEZ NOTER CE COMPTE EST ENREGISTRE A      ".
030170990928           03  WS-SH11V3-LIT1-F        PICTURE X(30)       VALUE
030180990928               "     UNITHOLDER CONFIRM       ".
030190990928           03  WS-SH13V3-LIT1-F        PICTURE X(12)       VALUE
030200990928               "ACCOUNT NO :".
030210971201           03  WS-SD02-LIT1-F          PICTURE X(10)       VALUE
030220971201               "          ".
030230991008           03  WS-SD03-PERCENTAGE-LIT-F   PICTURE X(1)     VALUE
030240991008               "%".
030250991008           03  WS-SS01-LIT1-F.
030260000000               05  FILLER              PICTURE X(45)       VALUE
030270000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030280000000               05  FILLER              PICTURE X(48)       VALUE
030290971215                   "  POSITION DU COMPTE EN DATE DE CONFIRMATION    ".
030300000000               05  FILLER              PICTURE X(45)       VALUE
030310000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030320000000           03  WS-SS01V1-LIT1-F.
030330000000               05  FILLER              PICTURE X(45)       VALUE
030340000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030350000000               05  FILLER              PICTURE X(48)       VALUE
030360000000                   "  POSITION DU COMPTE A LA DATE DU CONFIRMATION  ".
030370000000               05  FILLER              PICTURE X(45)       VALUE
030380000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030390000000           03  WS-SS01V2-LIT1-F.
030400000000               05  FILLER              PICTURE X(39)       VALUE
030410000000                   "* * * * * * * * * * * * * * * * * * * *".
030420000000               05  FILLER              PICTURE X(48)       VALUE
030430000000                   "  POSITION DU COMPTE A LA DATE DU CONFIRMATION  ".
030440000000               05  FILLER              PICTURE X(39)       VALUE
030450000000                   "* * * * * * * * * * * * * * * * * * * *".
030460000000           03  WS-SS01V3-LIT1-F.
030470000000               05  FILLER              PICTURE X(45)       VALUE
030480000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030490000000               05  FILLER              PICTURE X(48)       VALUE
030500000000                   "  POSITION DU COMPTE A LA DATE DU CONFIRMATION  ".
030510000000               05  FILLER              PICTURE X(45)       VALUE
030520000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030530000000           03  WS-SS01V4-LIT1-F.
030540000000               05  FILLER              PICTURE X(45)       VALUE
030550000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030560000000               05  FILLER              PICTURE X(48)       VALUE
030570000000                   "  POSITION DU COMPTE A LA DATE DU CONFIRMATION  ".
030580000000               05  FILLER              PICTURE X(45)       VALUE
030590000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030600000000           03  WS-SS01V5-LIT1-F.
030610000000               05  FILLER              PICTURE X(45)       VALUE
030620000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030630000000               05  FILLER              PICTURE X(48)       VALUE
030640000000                   "  POSITION DU COMPTE A LA DATE DU CONFIRMATION  ".
030650000000               05  FILLER              PICTURE X(45)       VALUE
030660000000                   "* * * * * * * * * * * * * * * * * * * * * * *".
030670990928           03  WS-SS01V3-1-LIT1-F.
030680000225               05  FILLER              PICTURE X(41)       VALUE
030690990928                   "* * * * * * * * * * * * * * * * * * * * ".
030700990928               05  FILLER              PICTURE X(30)       VALUE
030710990928                   "* * *  ACCOUNT  SUMMARY  * * *".
030720990928               05  FILLER              PICTURE X(40)       VALUE
030730990929                   " * * * * * * * * * * * * * * * * * * * *".
030740010517R10081     03  WS-SS01V3-4-LIT1-F.
030750010517               05  FILLER              PICTURE X(45)       VALUE
030760010522                   "      * * * * * * * * * * * * * * * * * * * *".
030770010517               05  FILLER              PICTURE X(48)       VALUE
030780010917R11280*            "  POSITIONS DU COMPTE EN DATE DE CONFIRMATION   ".
030790010917R11406             "  POSITION DU COMPTE EN DATE DE CONFIRMATION    ".
030800010517               05  FILLER              PICTURE X(45)       VALUE
030810010522R10081             "* * * * * * * * * * * * * * * * * *          ".
030820991002
030830991002      ***  FOR RESP
030840991002
030850991007           03  WS-SSRHDG-LIT1-F.
030860991002               05  FILLER              PICTURE X(49)       VALUE
030870991002                   "* * * * * * * * * * * * * * * * * * * * * * * * *".
030880991002               05  FILLER              PICTURE X(40)       VALUE
030890991002                   " * * * * *  RESP  BENEFICIARY  * * * * *".
030900991002               05  FILLER              PICTURE X(49)       VALUE
030910991002                   " * * * * * * * * * * * * * * * * * * * * * * * * ".
030920991007           03  WS-SSRHDGV3-LIT1-F.
030930991002               05  FILLER              PICTURE X(40)       VALUE
030940991002                   "* * * * * * * * * * * * * * * * * * * * ".
030950991002               05  FILLER              PICTURE X(30)       VALUE
030960991002                   "* * *  RESP BENEFICIARY  * * *".
030970991002               05  FILLER              PICTURE X(40)       VALUE
030980991002                   " * * * * * * * * * * * * * * * * * * * *".
030990991002
031000991002      ***
031010991002
031020010517R10081     03  WS-SS02-LIT00-F         PICTURE X(35)       VALUE
031030010917R10081*        "FONDS DE PLACEMENT                 ".
031040010919R11406         "VOS INVESTISSEMENTS                ".
031050990315           03  WS-SS02-LIT0-F          PICTURE X(13)       VALUE
031060990316               "         COUT".
031070000000           03  WS-SS02-LIT1-F          PICTURE X(8)        VALUE
031080971215               "    PRIX".
031090000000           03  WS-SS02-LIT2-F          PICTURE X(13)       VALUE
031100010519               "        SOLDE".
031110000000           03  WS-SS02-LIT3-F          PICTURE X(13)       VALUE
031120971215               "       VALEUR".
031130990315           03  WS-SS03-LIT0-F          PICTURE X(13)       VALUE
031140990316               "        MOYEN".
031150000000           03  WS-SS03-LIT1-F          PICTURE X(8)        VALUE
031160971215               "UNITAIRE".
031170000000           03  WS-SS03-LIT2-F          PICTURE X(13)       VALUE
031180010519               "     D'UNITES".
031190000000           03  WS-SS03-LIT3-F          PICTURE X(13)       VALUE
031200971215               "    MARCHANDE".
031210000000           03  WS-SS05-LIT1-F          PICTURE X(14)       VALUE
031220000000               " -------------".
031230990318           03  WS-SS05V1-LIT1-F        PICTURE X(13)       VALUE
031240990317               " ------------".
031250000000           03  WS-SS05V2-LIT1-F        PICTURE X(14)       VALUE
031260000000               " -------------".
031270000000           03  WS-SS05V3-LIT1-F        PICTURE X(14)       VALUE
031280000000               " -------------".
031290000000           03  WS-SS05V4-LIT1-F        PICTURE X(14)       VALUE
031300000000               " -------------".
031310000000           03  WS-SS05V5-LIT1-F        PICTURE X(14)       VALUE
031320000000               " -------------".
031330990928           03  WS-SS05V3-1-LIT1-F      PICTURE X(14)       VALUE
031340990928               " -------------".
031350010517R10081     03  WS-SS05A-LIT1-F         PICTURE X(50)       VALUE
031360010917      *        "TOTAL DE VOS FONDS DE PLACEMENT                   ".
031370010919R11406         "TOTAL DE VOS INVESTISSEMENTS                      ".
031380010517           03  WS-SS05B-LIT00-F        PICTURE X(35)       VALUE
031390010517               "PLACEMENTS GARANTIS                ".
031400010517           03  WS-SS05B-LIT0-F         PICTURE X(8)        VALUE
031410010517               "    TAUX".
031420010517           03  WS-SS05B-LIT1-F         PICTURE X(8)        VALUE
031430010517               "   TERME".
031440010517           03  WS-SS05B-LIT2-F         PICTURE X(13)       VALUE
031450010517               "         DATE".
031460010517           03  WS-SS05B-LIT3-F         PICTURE X(13)       VALUE
031470010517               "         DATE".
031480010517           03  WS-SS05B-LIT4-F         PICTURE X(13)       VALUE
031490010517               "      CAPITAL".
031500010517           03  WS-SS05C-LIT1-F         PICTURE X(13)       VALUE
031510010517               "     EMISSION".
031520010517           03  WS-SS05C-LIT2-F         PICTURE X(13)       VALUE
031530010517               "     ECHEANCE".
031540010517           03  WS-SS05C-LIT3-F         PICTURE X(13)       VALUE
031550010517               "       ACTUEL".
031560010517           03  WS-SS05F-LIT1-F         PICTURE X(14)       VALUE
031570010517               " -------------".
031580010517           03  WS-SS05G-LIT1-F         PICTURE X(50)       VALUE
031590010517R10081         "TOTAL DE VOS PLACEMENTS GARANTIS                  ".
031600990928           03  WS-SS06-LIT1-F          PICTURE X(35)       VALUE
031610000000               "VALEUR DU COMPTE                   ".
031620991002
031630991002      *** FOR RESP
031640991002
031650991011      *    03  WS-SSR01-LIT1-F         PICTURE X(21)       VALUE
031660991011      *        "ACCOUNT BENEFICIARY: ".
031670991009           03  WS-SSR-ACC-LIT-F       PICTURE X(21)       VALUE
031680991002               "ACCOUNT BENEFICIARY: ".
031690000000
031700000000       01  WS-STMT-LITS-R              REDEFINES WS-STMT-LITS.
031710000000           03  WS-STMT-LIT             OCCURS   2  TIMES
031720000000                                       INDEXED BY  SL.
031730000000
031740000000      *****
031750000000      *****    Heading Literals.
031760000000      *****
031770000000               05  WS-SH01-LIT1        PICTURE X(20).
031780000000               05  WS-SH01-LIT2        PICTURE X(2).
031790980213               05  WS-SH02-LIT         PICTURE X(15).
031800000000               05  WS-SH10-LIT1        PICTURE X(47).
031810990928               05  WS-SH11V3-LIT1      PICTURE X(30).
031820990928               05  WS-SH13V3-LIT1      PICTURE X(12).
031830000000
031840000000      *****
031850000000      *****    Detail Literals.
031860000000      *****
031870000000
031880991008               05  WS-SD02-LIT1                PICTURE X(10).
031890991008               05  WS-SD03-PERCENTAGE-LIT      PICTURE X(1).
031900000000
031910000000      *****
031920000000      *****    Summary Literals.
031930000000      *****
031940000000
031950000000               05  WS-SS01-LIT1        PICTURE X(138).
031960000000               05  WS-SS01V1-LIT1      PICTURE X(138).
031970000000               05  WS-SS01V2-LIT1      PICTURE X(126).
031980000000               05  WS-SS01V3-LIT1      PICTURE X(138).
031990000000               05  WS-SS01V4-LIT1      PICTURE X(138).
032000000000               05  WS-SS01V5-LIT1      PICTURE X(138).
032010000225               05  WS-SS01V3-1-LIT1    PICTURE X(111).
032020010517R10081         05  WS-SS01V3-4-LIT1    PICTURE X(138).
032030991002
032040991007               05  WS-SSRHDG-LIT1      PICTURE X(138).
032050991007               05  WS-SSRHDGV3-LIT1    PICTURE X(110).
032060991002
032070010517R10081         05  WS-SS02-LIT00       PICTURE X(35).
032080990315               05  WS-SS02-LIT0        PICTURE X(13).
032090000000               05  WS-SS02-LIT1        PICTURE X(8).
032100000000               05  WS-SS02-LIT2        PICTURE X(13).
032110000000               05  WS-SS02-LIT3        PICTURE X(13).
032120990315               05  WS-SS03-LIT0        PICTURE X(13).
032130000000               05  WS-SS03-LIT1        PICTURE X(8).
032140000000               05  WS-SS03-LIT2        PICTURE X(13).
032150000000               05  WS-SS03-LIT3        PICTURE X(13).
032160000000               05  WS-SS05-LIT1        PICTURE X(14).
032170990317               05  WS-SS05V1-LIT1      PICTURE X(13).
032180000000               05  WS-SS05V2-LIT1      PICTURE X(14).
032190000000               05  WS-SS05V3-LIT1      PICTURE X(14).
032200000000               05  WS-SS05V4-LIT1      PICTURE X(14).
032210000000               05  WS-SS05V5-LIT1      PICTURE X(14).
032220990928               05  WS-SS05V3-1-LIT1    PICTURE X(14).
032230010517R10081         05  WS-SS05A-LIT1       PICTURE X(50).
032240010517               05  WS-SS05B-LIT00      PICTURE X(35).
032250010517               05  WS-SS05B-LIT0       PICTURE X(8).
032260010517               05  WS-SS05B-LIT1       PICTURE X(8).
032270010517               05  WS-SS05B-LIT2       PICTURE X(13).
032280010517               05  WS-SS05B-LIT3       PICTURE X(13).
032290010517               05  WS-SS05B-LIT4       PICTURE X(13).
032300010517               05  WS-SS05C-LIT1       PICTURE X(13).
032310010517               05  WS-SS05C-LIT2       PICTURE X(13).
032320010517               05  WS-SS05C-LIT3       PICTURE X(13).
032330010517               05  WS-SS05F-LIT1       PICTURE X(14).
032340010517R10081         05  WS-SS05G-LIT1       PICTURE X(50).
032350000000               05  WS-SS06-LIT1        PICTURE X(35).
032360991002
032370991009               05  WS-SSR-ACC-LIT      PICTURE X(21).
032380991002
032390000000      /
032400000000      ******************************************************************
032410000000      *                                                                *
032420000000      *    S T A T E M E N T   L I T E R A L S   ( C U R R E N C Y )   *
032430000000      *                                                                *
032440000000      ******************************************************************
032450000000
032460000000       01  WS-CURRENCY-TBL.
032470000000           03  WS-SC-CAD.
032480000000               05  FILLER              PICTURE X(3)        VALUE "CAD".
032490000000               05  FILLER              PICTURE X(30)       VALUE
032500000000                   "CANADIAN (CAD) DOLLAR TOTAL   ".
032510000000               05  FILLER              PICTURE X(30)       VALUE
032520990708                   "TOTAL DOLLARS CANADIENS       ".
032530010622R10081*        05  FILLER              PICTURE X(8).
032540010627R10700         05  FILLER              PICTURE X(22).
032550000000           03  WS-SC-USD.
032560000000               05  FILLER              PICTURE X(3)        VALUE "USD".
032570000000               05  FILLER              PICTURE X(30)       VALUE
032580000000                   "US (USD) DOLLAR TOTAL         ".
032590000000               05  FILLER              PICTURE X(30)       VALUE
032600990708                   "TOTAL DOLLARS AMERICAINS      ".
032610010622R10081*        05  FILLER              PICTURE X(8).
032620010627R10700         05  FILLER              PICTURE X(22).
032630000000
032640000000       01  WS-CURRENCY-TBL-R           REDEFINES WS-CURRENCY-TBL.
032650000000           03  WS-SC-ENTRY             OCCURS   2  TIMES
032660000000                                       INDEXED BY  SC.
032670000000             04  WS-SC-CURRENCY        PICTURE X(3).
032680000000             04  WS-SC-CURRDESC        OCCURS   2  TIMES
032690000000                                       INDEXED BY  SCL
032700000000                                       PICTURE X(30).
032710000224      *      04  WS-SC-MARKET-VALUE    PICTURE S9(9)V9(2)  COMP-3.
032720000224             04  WS-SC-MARKET-VALUE    PICTURE S9(11)V9(2)  COMP-3.
032730010517R10081       04  WS-SC-MARKET-VALUE-GIC-DII
032740010517                                       PICTURE S9(11)V9(2)  COMP-3.
032750010517R10081       04  WS-SC-MARKET-VALUE-FUND
032760010517                                       PICTURE S9(11)V9(2)  COMP-3.
032770000000             04  WS-SC-RPTIND          PICTURE X(1).
032780000000      /
032790000000       01  WS-STMT-INVESTOR-ACCOUNT-TBL.
032800000000
032810000000      ******************************************************************
032820000000      *                                                                *
032830000000      *    S T A T E M E N T   I N V E S T O R / A C C O U N T   T B L *
032840000000      *                                                                *
032850000000      ******************************************************************
032860000000
032870000000           03  WS-SIA-ENT              OCCURS        1000  TIMES
032880000000                                       ASCENDING KEY   IS  WS-SIA-ACCT
032890000000                                       INDEXED         BY  SIA
032900000000                                                           SIA1
032910000000                                                           SIA2.
032920000000               05  WS-SIA-ACCT         PICTURE X(9).
032930980213               05  WS-SIA-DLRACCTNO    PICTURE X(15).
032940000000               05  WS-SIA-NOMCDE       PICTURE X(5).
032950000000               05  WS-SIA-NOMNAM       PICTURE X(35).
032960000000               05  WS-SIA-NOMACCT      PICTURE X(15).
032970000000               05  WS-SIA-REGCTB       PICTURE 9(9)V9(2)   COMP-3.
032980000000               05  WS-SIA-REGCTBSGN    PICTURE X(1).
032990000607               05  WS-SIA-ENTEREDBY    PICTURE X(10).
033000000626RF6725         05  WS-SIA-MAIL-FLAG    PICTURE X(1).
033010000000      /
033020000000       01  WS-STMT-ACCOUNT-FUND-TABLE.
033030000000
033040000000      ******************************************************************
033050000000      *                                                                *
033060000000      *    S T A T E M E N T   A C C O U N T / F U N D   T A B L E     *
033070000000      *                                                                *
033080000000      ******************************************************************
033090000000
033100000000           03  WS-STMT-ACCOUNT-FUND    OCCURS 100  TIMES
033110971210                                       INDEXED BY SAF.
033120000000               05  WS-SAF-ACB-UNIT-PRICE
033130000303      *                                PICTURE S9(3)V9(4)  COMP-3.
033140000303                                       PICTURE S9(5)V9(4)  COMP-3.
033150000000               05  WS-SAF-ACB-UNIT-PRICE-SIGN
033160000000                                       PICTURE X(1).
033170000000               05  WS-SAF-CURRENCY     PICTURE X(3).
033180000000               05  WS-SAF-FUND-NO      PICTURE X(8).
033190000000               05  WS-SAF-INVESTMENT-NAME
033200000000                                       PICTURE X(35).
033210000000               05  WS-SAF-LAST-UNIT-PRICE
033220000224                                       PICTURE S9(5)V9(4)  COMP-3.
033230000000               05  WS-SAF-LAST-UNIT-PRICE-SIGN
033240000000                                       PICTURE X(1).
033250000224               05  WS-SAF-MARKET-VALUE PICTURE S9(11)V9(2)  COMP-3.
033260000000               05  WS-SAF-MARKET-VALUE-SIGN
033270000000                                       PICTURE X(1).
033280000000               05  WS-SAF-NO-OF-UNITS  PICTURE S9(10)V9(3) COMP-3.
033290000000               05  WS-SAF-NO-OF-UNITS-SIGN
033300000000                                       PICTURE X(1).
033310000000      /
033320971210      *  US CURRENCY DETAIL TABLE  *
033330971211
033340971210       01  US-TABLE.
033350971210           03  WS-US-DATA          OCCURS 50 TIMES
033360971210                                   INDEXED BY SN.
033370990316
033380000303              05 W-SS07-ACB-UNIT-PRICE         PIC ZZ,ZZZ.9999.
033390990316              05 W-SS07-ACB-UNIT-PRICE-SIGN    PIC X.
033400971210              05 W-SS07-INVESTMENT-NAME        PIC X(35).
033410980202              05 W-SS07-CURRENCY               PIC X(3).
033420000303              05 W-SS07-LAST-UNIT-PRICE        PIC ZZ,ZZZ.9999.
033430971210              05 W-SS07-LAST-UNIT-PRICE-SIGN   PIC X.
033440000309              05 W-SS07-NO-OF-UNITS            PIC ZZZ,ZZZ,ZZZ.999.
033450971210              05 W-SS07-NO-OF-UNITS-SIGN       PIC X.
033460000303              05 W-SS07-MARKET-VALUE           PIC $$$,$$$,$$$,$$$.99.
033470971210              05 W-SS07-MARKET-VALUE-SIGN      PIC X.
033480991102
033490991102      *****
033500991103      *****    Account Type Table contains only two fields.
033510991102      *****
033520991102
033530090914R72304 01  ln-Array-size          PIC S9(09).
033540991103       01  WS-ACCTYP-TBL.
033550090302R64527***  04  WS-ACCTYP-ENT         OCCURS  50  TIMES
033560090302R64527***                            INDEXED BY  AT1.
033570090914R64527***  04  ln-Array-size      PIC S9(09).  R72304
033580090302R64527     04  WS-ACCTYP-ENT         OCCURS 1 TO 30000
033590090302R64527                               DEPENDING ON ln-Array-Size
033600090302R64527                               INDEXED BY AT1.
033610090914R72304       07  WS-ACCTYP-ENT-ELEMENT.
033620090914R72304         10  WS-AT-CODE          PICTURE X(5).
033630090914R72304         10  WS-AT-RULE          PICTURE X(1).
033640090914R72304***      05  WS-AT-CODE          PICTURE X(5).
033650090914R72304***      05  WS-AT-RULE          PICTURE X(1).
033660991102
033670991103       01  WS-AT-LST               PICTURE S9(3)   COMP-3.
033680090305R64527*01  WS-AT-MAX               PICTURE S9(3)   COMP-3
033690090305R64527***                                                  VALUE 50.
033700090305R64527 01  WS-AT-MAX               PICTURE S9(6)   COMP-3
033710090305R64527                                                    VALUE 30000.
033720010221      *****
033730010221      *****    Investment Code Table.
033740010221      *****    - This table will only support two languages, the first
033750010221      *****      entry is English and the second entry is French.
033760010221      *****
033770010221
033780090914R72304 01  ln-Array-sizeIC            PIC S9(09).
033790010222       01  WS-INVCDE-TBL.
033800020401      * RFS 13374 BEGIN
033810020401RF8385*      04  WS-INVCDE-ENT         OCCURS 800  TIMES
033820090302R13466***    04  WS-INVCDE-ENT         OCCURS 1000 TIMES
033830090302R64527***                              ASCENDING KEY   IS  WS-IC-FUND
033840090302R64527***                              INDEXED BY  IC.
033850090302      * RFS 13374 END
033860090914R64527**** 04  ln-Array-sizeIC    PIC S9(09).     R72304
033870090302R64527     04  WS-INVCDE-ENT         OCCURS 1 TO 30000
033880090302R64527                               DEPENDING ON ln-Array-SizeIC
033890090302R64527                               INDEXED BY IC.
033900090914R72304       10  WS-INVCDE-ENT-ELEMENT.
033910090914R72304         15  WS-IC-FUND          PICTURE X(5).
033920090914R72304         15  WS-IC-CODE          PICTURE X(5).
033930090914R72304         15  WS-IC-PROD          PICTURE X(3).
033940090914R72304         15  WS-IC-RULE          PICTURE X(1).
033950090914R72304****     05  WS-IC-FUND          PICTURE X(5).
033960090914R72304****     05  WS-IC-CODE          PICTURE X(5).
033970090914R72304****     05  WS-IC-PROD          PICTURE X(3).
033980090914R72304****     05  WS-IC-RULE          PICTURE X(1).
033990010221
034000020423       01  WS-IC-LST               PICTURE S9(4)       COMP-3.
034010020401      * RFS 13374 BEGIN
034020090305R64527*01  WS-IC-MAX               PICTURE S9(4)       COMP-3
034030020401      *                                                VALUE 800.
034040090305R13466****                                             VALUE 1000.
034050090305R64527 01  WS-IC-MAX               PICTURE S9(6)       COMP-3
034060090305R64527                                                 VALUE 30000.
034070020401      * RFS 13374 END
034080990315      /
034090000000      ******************************************************************
034100000000      *                                                                *
034110000000      *    H E A D I N G   P R I N T   L I N E S                       *
034120000000      *                                                                *
034130000000      ******************************************************************
034140000000
034150000000       01  HEADING-LINE-1.
034160000000           05  FILLER                  PICTURE X(11)       VALUE
034170000000               "DATE     : ".
034180000000           03  HL1-YY                  PICTURE 9(2).
034190000000           03  FILLER                  PICTURE X(1)        VALUE "/".
034200000000           03  HL1-MM                  PICTURE 9(2).
034210000000           03  FILLER                  PICTURE X(1)        VALUE "/".
034220000000           03  HL1-DD                  PICTURE 9(2).
034230000000           03  FILLER                  PICTURE X(95)       VALUE SPACES.
034240000000           03  FILLER                  PICTURE X(6)        VALUE
034250000000               "TIME: ".
034260000000           03  HL1-TIME                PICTURE 99B99B99B99.
034270000000           03  HL1-TIME-R              REDEFINES HL1-TIME.
034280000000               05  FILLER              PICTURE X(8).
034290000000               05  HL1-TIME-DOT        PICTURE X(1).
034300000000               05  FILLER              PICTURE X(2).
034310000000           03  FILLER                  PICTURE X(19)       VALUE SPACES.
034320000000
034330000000       01  HEADING-LINE-2.
034340000000           03  FILLER                  PICTURE X(11)       VALUE
034350000000               "REPORT NO: ".
034360000000           03  FILLER                  PICTURE X(10)       VALUE
034370000000               "CNFMPRT   ".
034380000000           03  FILLER                  PICTURE X(15)       VALUE SPACES.
034390000000           03  FILLER                  PICTURE X(33)       VALUE
034400000000               "CONFIRMATION PRINT CONTROL REPORT".
034410000000           03  FILLER                  PICTURE X(45)       VALUE SPACES.
034420000000           03  FILLER                  PICTURE X(5)        VALUE
034430000000               "PAGE:".
034440000000           03  FILLER                  PICTURE X(8)        VALUE SPACES.
034450000000           03  HL2-PGECNT              PICTURE ZZZZ9.
034460000000           03  FILLER                  PICTURE X(18)       VALUE SPACES.
034470000000
034480000000       01  HEADING-LINE-3.
034490000000           03  FILLER                  PICTURE X(3)        VALUE SPACES.
034500000000           03  FILLER                  PICTURE X(9)        VALUE
034510000000               "INVESTOR#".
034520000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
034530000000           03  FILLER                  PICTURE X(9)        VALUE
034540000000               "ACCOUNT  ".
034550000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
034560000000           03  FILLER                  PICTURE X(9)        VALUE
034570000000               "SECTION  ".
034580000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
034590000000           03  FILLER                  PICTURE X(3)        VALUE "LNG".
034600000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
034610000000           03  FILLER                  PICTURE X(6)        VALUE
034620000000               "DEALER".
034630000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
034640000000           03  FILLER                  PICTURE X(5)        VALUE
034650000000               "REP. ".
034660000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
034670000000           03  FILLER                  PICTURE X(50)       VALUE
034680000000               "MESSAGE                                           ".
034690000000           03  FILLER                  PICTURE X(50)       VALUE SPACES.
034700991102
034710000000      /
034720000000      ******************************************************************
034730000000      *                                                                *
034740000000      *    E R R O R   P R I N T   L I N E S
034750000000      *                                                                *
034760000000      ******************************************************************
034770000000
034780000000       01  ERROR-LINE-1.
034790000000           03  FILLER                  PICTURE X(3).
034800000000           03  EL1-INVESTOR-NO         PICTURE 9(9).
034810000000           03  FILLER                  PICTURE X(1).
034820000000           03  EL1-ACCOUNT             PICTURE 9(9).
034830000000           03  FILLER                  PICTURE X(1).
034840000000           03  EL1-SECTION-NO          PICTURE 9(2).
034850000000           03  EL1-SECTION-LITDSH      PICTURE X(1).
034860000000           03  EL1-SECTION-SEQUENCE    PICTURE 9(6).
034870000000           03  FILLER                  PICTURE X(2).
034880000000           03  EL1-LANGUAGE-CODE       PICTURE X(1).
034890000000           03  FILLER                  PICTURE X(2).
034900000000           03  EL1-DEALER              PICTURE X(4).
034910000000           03  FILLER                  PICTURE X(3).
034920000000           03  EL1-DEALER-REP-CODE     PICTURE X(5).
034930000000           03  FILLER                  PICTURE X(1).
034940000000           03  EL1-MSG                 PICTURE X(50).
034950000000           03  FILLER                  PICTURE X(50).
034960991102
034970000000      /
034980000000      ******************************************************************
034990000000      *                                                                *
035000000000      *    C O N T R O L   P R I N T   L I N E S                       *
035010000000      *                                                                *
035020000000      ******************************************************************
035030000000
035040000000       01  CONTROL-LINE-1.
035050000000           03  FILLER                  PICTURE X(3).
035060000000           03  CL1-LIT                 PICTURE X(50) JUST RIGHT.
035070000000           03  FILLER                  PICTURE X(1).
035080000000           03  CL1-CNT                 PICTURE ZZZ,ZZZ,ZZ9.
035090000000           03  FILLER                  PICTURE X(85).
035100000000
035110000000       01  CONTROL-LINE-2.
035120000000           03  FILLER                  PICTURE X(3)        VALUE SPACES.
035130000000           03  FILLER                  PICTURE X(43)       VALUE
035140000000               "CONFIRMATIONS FOR MANAGEMENT COMPANY CODE: ".
035150000000           03  CL2-MANAGEMENT-COMPANY-CODE
035160000000                                       PICTURE X(3).
035170000000           03  FILLER                  PICTURE X(101)      VALUE SPACES.
035180000000      /
035190000000       01  WS-PGM-DEFIND-WORK-ITEMS.
035200000000
035210000000      ******************************************************************
035220000000      *                                                                *
035230000000      *    P R O G R A M   D E F I N E D   W O R K   I T E M S         *
035240000000      *                                                                *
035250000000      ******************************************************************
035260980202           03  WS-B-CURRENCY           PICTURE X(3).
035270980202
035280971203           03  WS-M-DATE               PICTURE XX/XX/XX.
035290010221RF8307     03  WS-AT-FUND-CODE.
035300010221               05 WS-AT-FUND-MGMT-CDE  PICTURE X(3).
035310010221               05 WS-AT-INDUSTRY-CODE  PICTURE X(5).
035320010222RF8307     03  WS-PRODUCT-TYPE-RULE    PICTURE X(1).
035330010221
035340000000      *****
035350000000      *****    Control Report Counters.
035360000000      *****
035370000000
035380000000           03  WS-STMT-DTA-BCNT        PICTURE S9(7)       COMP-3.
035390000000           03  WS-STMT-DTA-BCNT-00     PICTURE S9(7)       COMP-3.
035400000000           03  WS-STMT-DTA-BCNT-05     PICTURE S9(7)       COMP-3.
035410000000           03  WS-STMT-DTA-BCNT-10     PICTURE S9(7)       COMP-3.
035420010308RF8633     03  WS-STMT-DTA-BCNT-12     PICTURE S9(7)       COMP-3.
035430000000           03  WS-STMT-DTA-BCNT-15     PICTURE S9(7)       COMP-3.
035440140624132121     03  WS-STMT-DTA-BCNT-16     PICTURE S9(7)       COMP-3.
035450040406R20870     03  WS-STMT-DTA-BCNT-17     PICTURE S9(7)       COMP-3.
035460000000           03  WS-STMT-DTA-BCNT-20     PICTURE S9(7)       COMP-3.
035470010321RF8633     03  WS-STMT-DTA-BCNT-25     PICTURE S9(7)       COMP-3.
035480130408117038     03  WS-STMT-DTA-BCNT-22     PICTURE S9(7)       COMP-3.
035490991126           03  WS-STMT-DTA-BCNT-30     PICTURE S9(7)       COMP-3.
035500040406R20870     03  WS-STMT-DTA-BCNT-33     PICTURE S9(7)       COMP-3.
035510991126           03  WS-STMT-DTA-BCNT-35     PICTURE S9(7)       COMP-3.
035520040406R20870     03  WS-STMT-DTA-BCNT-38     PICTURE S9(7)       COMP-3.
035530010308RF4638     03  WS-STMT-DTA-BCNT-40     PICTURE S9(7)       COMP-3.
035540010308RF4638     03  WS-STMT-DTA-BCNT-43     PICTURE S9(7)       COMP-3.
035550010308RF4638     03  WS-STMT-DTA-BCNT-45     PICTURE S9(7)       COMP-3.
035560000000           03  WS-STMT-DTA-BCNT-50     PICTURE S9(7)       COMP-3.
035570000000           03  WS-STMT-DTA-BCNT-60     PICTURE S9(7)       COMP-3.
035580991002           03  WS-STMT-DTA-BCNT-62     PICTURE S9(7)       COMP-3.
035590091124R69515     03  WS-STMT-DTA-BCNT-63     PICTURE S9(7)       COMP-3.
035600010323rf8633     03  WS-STMT-DTA-BCNT-67     PICTURE S9(7)       COMP-3.
035610000000           03  WS-STMT-DTA-BCNT-70     PICTURE S9(7)       COMP-3.
035620060824R34848     03  WS-STMT-DTA-BCNT-81     PICTURE S9(7)       COMP-3.
035630000000           03  WS-STMT-DTA-BCNT-82     PICTURE S9(7)       COMP-3.
035640991007           03  WS-STMT-DTA-BCNT-84     PICTURE S9(7)       COMP-3.
035650010308RF4638     03  WS-STMT-DTA-BCNT-90     PICTURE S9(7)       COMP-3.
035660000000           03  WS-STMT-DTA-RCNT        PICTURE S9(7)       COMP-3.
035670000000           03  WS-STMT-DTA-SCNT-01     PICTURE S9(7)       COMP-3.
035680000000           03  WS-STMT-DTA-SCNT-05     PICTURE S9(7)       COMP-3.
035690000000           03  WS-STMT-DTA-SCNT-10     PICTURE S9(7)       COMP-3.
035700000000           03  WS-STMT-DTA-SCNT-20     PICTURE S9(7)       COMP-3.
035710000000           03  WS-STMT-DTA-SCNT-80     PICTURE S9(7)       COMP-3.
035720991013           03  WS-STMT-DTA-SCNT-84     PICTURE S9(7)       COMP-3.
035730000000           03  WS-STMT-PRT-DTL-WCNT    PICTURE S9(7)       COMP-3.
035740000000           03  WS-STMT-PRT-HDR-WCNT    PICTURE S9(7)       COMP-3.
035750000000
035760000000      *****
035770000000      *****    Control Report Literals.
035780000000      *****
035790000000
035800000000           03  WS-STMT-DTA-BLIT        PICTURE X(50)       VALUE
035810000000               "STATEMENT DATA RECS BYPASSED:                     ".
035820000000           03  WS-STMT-DTA-BLIT-00     PICTURE X(50)       VALUE
035830000000               "STATEMENT DATA (DELIVERY INFO) RECS BYPASSED:     ".
035840980914           03  WS-STMT-DTA-BLIT-01     PICTURE X(50)       VALUE
035850980914               "STATEMENT DATA (INVESTOR INFO   ) RECS BYPASSED:  ".
035860000000           03  WS-STMT-DTA-BLIT-05     PICTURE X(50)       VALUE
035870000000               "STATEMENT DATA (DEALER) RECS BYPASSED:            ".
035880000000           03  WS-STMT-DTA-BLIT-10     PICTURE X(50)       VALUE
035890000000               "STATEMENT DATA (INVESTOR SUMMARY) RECS BYPASSED:  ".
035900010308RF8633     03  WS-STMT-DTA-BLIT-12     PICTURE X(50)       VALUE
035910010313               "STATEMENT DATA (INVESTOR SUMMARY SEC2) BYPASSED:  ".
035920000000           03  WS-STMT-DTA-BLIT-15     PICTURE X(50)       VALUE
035930000000               "STATEMENT DATA (ACCT ASSET CLASS) RECS BYPASSED:  ".
035940040406R20870     03  WS-STMT-DTA-BLIT-17     PICTURE X(50)       VALUE
035950040406               "STATEMENT DATA (ACCT IPS)         RECS BYPASSED:  ".
035960000000           03  WS-STMT-DTA-BLIT-20     PICTURE X(50)       VALUE
035970000000               "STATEMENT DATA (ACCOUNT DETAIL) RECS BYPASSED:    ".
035980010321RF8633     03  WS-STMT-DTA-BLIT-25     PICTURE X(50)       VALUE
035990010321               "STATEMENT DATA (ACCOUNT GIC DETAIL) RECS BYPASSED:".
036000130408117038     03  WS-STMT-DTA-BLIT-22     PICTURE X(50)       VALUE
036010130408117038         "STATEMENT DATA (ACCOUNT ADD DETAIL) RECS BYPASSED:".
036020991126           03  WS-STMT-DTA-BLIT-30     PICTURE X(50)       VALUE
036030991126               "STATEMENT DATA (ACC PERF) RECS BYPASSED:          ".
036040040406R20870     03  WS-STMT-DTA-BLIT-33     PICTURE X(50)       VALUE
036050040406               "STATEMENT DATA (ACC ROR)  RECS BYPASSED:          ".
036060991126           03  WS-STMT-DTA-BLIT-35     PICTURE X(50)       VALUE
036070991126               "STATEMENT DATA (ACC FUND PERF) RECS BYPASSED:     ".
036080040406R20870     03  WS-STMT-DTA-BLIT-38     PICTURE X(50)       VALUE
036090040406               "STATEMENT DATA (ACC FUND ROR)  RECS BYPASSED:     ".
036100010308RF4638     03  WS-STMT-DTA-BLIT-40     PICTURE X(50)       VALUE
036110010308               "STATEMENT DATA (SEG FUND CONTR DTL) RECS BYPASSED:".
036120010308           03  WS-STMT-DTA-BLIT-43     PICTURE X(50)       VALUE
036130010308               "STATEMENT DATA (SEG FUND INVES DTL) RECS BYPASSED:".
036140010308           03  WS-STMT-DTA-BLIT-45     PICTURE X(50)       VALUE
036150010308RF4638         "STATEMENT DATA (ANNUITANT DTL) RECS BYPASSED:     ".
036160000000           03  WS-STMT-DTA-BLIT-50     PICTURE X(50)       VALUE
036170000000               "STATEMENT DATA (ROLLOVER) RECS BYPASSED:          ".
036180000000           03  WS-STMT-DTA-BLIT-60     PICTURE X(50)       VALUE
036190000000               "STATEMENT DATA (RRIF DETAIL) RECS BYPASSED:       ".
036200991002           03  WS-STMT-DTA-BLIT-62     PICTURE X(50)       VALUE
036210991002               "STATEMENT DATA (RESP DETAIL) RECS BYPASSED:       ".
036220091125R69515     03  WS-STMT-DTA-BLIT-63     PICTURE X(50)       VALUE
036230091125R69515         "STATEMENT DATA (RDSP) RECS BYPASSED:              ".
036240010323           03  WS-STMT-DTA-BLIT-67     PICTURE X(50)       VALUE
036250010323               "STATEMENT DATA (BENEFICIARY INFOR) RECS BYPASSED  ".
036260000000           03  WS-STMT-DTA-BLIT-70     PICTURE X(50)       VALUE
036270000000               "STATEMENT DATA (SYSTEM PLAN INFO) RECS BYPASSED:  ".
036280060824R34848     03  WS-STMT-DTA-BLIT-81     PICTURE X(50)       VALUE
036290060824               "STATEMENT DATA (DED TRANS 81)     RECS BYPASSED:  ".
036300000000           03  WS-STMT-DTA-BLIT-82     PICTURE X(50)       VALUE
036310000000               "STATEMENT DATA (ACCT TRAN INST DTL) RECS BYPASSED:".
036320991007           03  WS-STMT-DTA-BLIT-84     PICTURE X(50)       VALUE
036330991014               "STATEMENT DATA (RESP 84           ) RECS BYPASSED:".
036340010308RF4638     03  WS-STMT-DTA-BLIT-90     PICTURE X(50)       VALUE
036350010308               "STATEMENT DATA (RESET CONTRACT  ) RECS BYPASSED:  ".
036360000000           03  WS-STMT-DTA-RLIT        PICTURE X(50)       VALUE
036370000000               "STATEMENT DATA RECS READ:                         ".
036380000000           03  WS-STMT-DTA-SLIT-01     PICTURE X(50)       VALUE
036390000000               "STATEMENT DATA (INVESTOR INFO) RECS SELECTED:     ".
036400000000           03  WS-STMT-DTA-SLIT-05     PICTURE X(50)       VALUE
036410000000               "STATEMENT DATA (DEALER) RECS SELECTED:            ".
036420000000           03  WS-STMT-DTA-SLIT-10     PICTURE X(50)       VALUE
036430000000               "STATEMENT DATA (INVESTOR SUMMARY) RECS SELECTED:  ".
036440000000           03  WS-STMT-DTA-SLIT-20     PICTURE X(50)       VALUE
036450000000               "STATEMENT DATA (ACCOUNT DETAIL) RECS SELECTED:    ".
036460000000           03  WS-STMT-DTA-SLIT-80     PICTURE X(50)       VALUE
036470000000               "STATEMENT DATA (ACCT. TRANSACTION) RECS SELECTED: ".
036480991013           03  WS-STMT-DTA-SLIT-84     PICTURE X(50)       VALUE
036490991013               "STATEMENT DATA (RESP 84          ) RECS SELECTED: ".
036500000000           03  WS-STMT-PRT-DTL-WLIT    PICTURE X(50)       VALUE
036510000000               "STATEMENT PRINT DETAIL RECS WRITTEN:              ".
036520000000           03  WS-STMT-PRT-HDR-WLIT    PICTURE X(50)       VALUE
036530000000               "STATEMENT PRINT HEADER RECS WRITTEN:              ".
036540000000
036550000000      *****
036560000000      *****    Error Messages.
036570000000      *****
036580000000
036590000000           03  WS-MSGS.
036600000000               05  WS-MSG-01           PICTURE X(50)       VALUE
036610000000                   "MFASTMTFP SECTION-NO INVALID, RECORD BYPASSED     ".
036620000000               05  WS-MSG-02           PICTURE X(50)       VALUE
036630000000                   "ACCOUNT DETAIL SECTION-NO INVALID, RECORD BYPASSED".
036640000000               05  WS-MSG-03           PICTURE X(50)       VALUE
036650000000                   "ACCOUNT DETAIL CONTAINS INVALID CURRENCY          ".
036660000000               05  WS-MSG-04           PICTURE X(50)       VALUE
036670000000                   "PROGRAM CURRENCY MAXIMUM EXCEEDED                 ".
036680000000               05  WS-MSG-05           PICTURE X(50)       VALUE
036690000000                   "WARNING: MISSING ACCT DTL REC FOR ACCT TRANS FUND ".
036700000000               05  WS-MSG-06           PICTURE X(50)       VALUE
036710000000                   "STATEMENT PRINT HEADER RECORD WRITE FAILED, ABORT ".
036720000000               05  WS-MSG-07           PICTURE X(50)       VALUE
036730000000                   "STATEMENT PRINT DETAIL RECORD WRITE FAILED, ABORT ".
036740000000               05  WS-MSG-08           PICTURE X(50)       VALUE
036750000000                   "MISSING INVESTOR INFORMATION RECORD FOR ACCOUNT   ".
036760000000               05  WS-MSG-09           PICTURE X(50)       VALUE
036770000000                   "MISSING DEALER RECORD FOR ACCOUNT                 ".
036780000000               05  WS-MSG-10           PICTURE X(50)       VALUE
036790000000                   "MISSING ACCOUNT DETAIL RECORD FOR ACCOUNT         ".
036800000000               05  WS-MSG-11           PICTURE X(50)       VALUE
036810000000                   "PROGRAM ACCOUNT MAXIMUM EXCEEDED                  ".
036820000000               05  WS-MSG-12           PICTURE X(50)       VALUE
036830000000                   "WARNING: NOMINEE ACCOUNT WITH NO NOMINEE DATA     ".
036840000000               05  WS-MSG-13           PICTURE X(50)       VALUE
036850000000                   "WARNING: NON-NOMINEE ACCOUNT WITH NOMINEE DATA    ".
036860000000           03  WS-MSGS-R               REDEFINES WS-MSGS.
036870000000               05  WS-MSG              OCCURS  13  TIMES
036880000000                                       INDEXED BY  MSG
036890000000                                       PICTURE X(50).
036900000000
036910000000      *****
036920000000      *****    Format Account Type Description Routine Work Items.
036930000000      *****
036940000000
036950000000           03  WS-ACTTYPGRP            PICTURE X(1).
036960000000
036970000000           03  WS-ACTTYPIN.
036980000000               05  WS-ACTTYPIN-PFX     PICTURE X(35).
036990000000               05  WS-ACTTYPIN-SFX     PICTURE X(2).
037000000000
037010000000           03  WS-ACTTYPLCK            PICTURE X(1).
037020000000           03  WS-ACTTYPLIT1           PICTURE X(13).
037030000000           03  WS-ACTTYPLIT2           PICTURE X(13).
037040000000           03  WS-ACTTYPLIT3           PICTURE X(13).
037050000000           03  WS-ACTTYPLNG            PICTURE X(1).
037060000000           03  WS-ACTTYPNOM            PICTURE X(1).
037070000000           03  WS-ACTTYPOUT            PICTURE X(80).
037080000000           03  WS-ACTTYPSHT            PICTURE X(5).
037090000000           03  WS-ACTTYPSPS            PICTURE X(1).
037100000524RF7063     03  WS-NOMACTTYPOUT         PICTURE X(80).
037110000525RF7063     03  WS-NOMACTTYPLIT1        PICTURE X(13).
037120000000
037130000000      *****
037140000000      *****    Index/Subscript Related Items.
037150000000      *****
037160000000
037170000000           03  WS-SAF-LST              PICTURE S9(3)       COMP-3.
037180000000           03  WS-SAF-MAX              PICTURE S9(3)       COMP-3.
037190000000           03  WS-SC-MAX               PICTURE S9(3)       COMP-3.
037200000000           03  WS-SIA-LST              PICTURE S9(5)       COMP-3.
037210000000           03  WS-SIA-MAX              PICTURE S9(5)       COMP-3.
037220000000           03  WS-SPL                  PICTURE S9(3)       COMP-3.
037230000000           03  WS-SPL-DTLFST           PICTURE S9(3)       COMP-3.
037240000000           03  WS-SPL-DTLLST           PICTURE S9(3)       COMP-3.
037250000000           03  WS-SPL-DTLMAX           PICTURE S9(3)       COMP-3.
037260000000           03  WS-SPL-DTLTST           PICTURE S9(3)       COMP-3.
037270000000           03  WS-SPL-HDGFST           PICTURE S9(3)       COMP-3.
037280000000           03  WS-SPL-MAX              PICTURE S9(3)       COMP-3.
037290000000           03  WS-SPL-SH02             PICTURE S9(3)       COMP-3.
037300000000           03  WS-SPML-MAX             PICTURE S9(3)       COMP-3.
037310980916           03  WS-II-LST               PICTURE S9(3)       COMP-3.
037320980916           03  WS-II-MAX               PICTURE S9(3)       COMP-3.
037330000626RF6725     03  WS-DI-LST               PICTURE S9(3)       COMP-3.
037340000626           03  WS-DI-MAX               PICTURE S9(3)       COMP-3.
037350010517R10081     03  WS-GIC-LST              PICTURE S9(3)       COMP-3.
037360010517           03  WS-GIC-MAX              PICTURE S9(3)       COMP-3.
037370010517           03  WS-AFD-LST              PICTURE S9(3)       COMP-3.
037380010517           03  WS-AFD-MAX              PICTURE S9(3)       COMP-3.
037390010517           03  WS-AGD-LST              PICTURE S9(3)       COMP-3.
037400010517           03  WS-AGD-MAX              PICTURE S9(3)       COMP-3.
037410010517           03  WS-ADID-LST             PICTURE S9(3)       COMP-3.
037420010517R10081     03  WS-ADID-MAX             PICTURE S9(3)       COMP-3.
037430980916
037440000000      *****
037450000000      *****    Non-Numeric Items.
037460000000      *****
037470000000
037480990329           03  WS-ENTERED-BY           PICTURE X(10).
037490000000           03  WS-ADRTMP               PICTURE X(40).
037500000000           03  WS-BRANCH-ADDR1         PICTURE X(40).
037510000000           03  WS-BRANCH-ADDR2         PICTURE X(40).
037520000000           03  WS-BRANCH-ADDR3         PICTURE X(40).
037530000000           03  WS-BRANCH-ADDR4         PICTURE X(40).
037540000000           03  WS-BRANCH-ADDR5         PICTURE X(40).
037550000626RF6725     03  WS-MAILING-ADDRESS-INDICATOR PIC X(1).
037560011204R11972     03  WS-STMT-SUM-05A              PIC X(1).
037570991102
037580000000           03  WS-DATE.
037590000000               05  WS-DATE-YY          PICTURE 9(2).
037600000000               05  WS-DATE-MM          PICTURE 9(2).
037610000000               05  WS-DATE-DD          PICTURE 9(2).
037620000000
037630980213           03  WS-DEALER-ACCOUNT-NO    PICTURE X(15).
037640000000           03  WS-DEALER-NAME          PICTURE X(35).
037650000000           03  WS-DEALER-REP-NAMES     PICTURE X(51).
037660000000
037670000000           03  WS-END-DATE.
037680991004      *        05  FILLER              PICTURE X(2).
037690991004               05  WS-SH-END-DATE      PICTURE X(8).
037700000000
037710990928           03  WS-END-DATE-3.
037720990928               05  WS-SH-END-DATE-3    PICTURE X(8).
037730990928
037740000000           03  WS-FAX.
037750000000             04  WS-SH-FAX-01-03       PICTURE 9(3).
037760000000             04  WS-SH-FAX-04-10       PICTURE 9(7).
037770000000             04  WS-SH-FAX-04-10-R     REDEFINES WS-SH-FAX-04-10.
037780000000               05  WS-SH-FAX-04-06     PICTURE X(3).
037790000000               05  WS-SH-FAX-07-10     PICTURE X(4).
037800000000
037810000000           03  WS-FILSTAT              PICTURE X(2).
037820000000
037830000000           03  WS-FUND-NO.
037840000000               05  WS-MANAGEMENT-COMPANY-CODE
037850000000                                       PICTURE X(3).
037860000000               05  FILLER              PICTURE X(5).
037870000000
037880000000           03  WS-NOMINEE              PICTURE X(53).
037890000000           03  WS-NOMINEE-CODE         PICTURE X(5).
037900000000           03  WS-NOMINEE-NAME         PICTURE X(37).
037910000000           03  WS-NOMINEES-ACCT-NO     PICTURE X(15).
037920000000
037930000000           03  WS-PHONE.
037940000000             04  WS-SH-PHONE-01-03     PICTURE 9(3).
037950000000             04  WS-SH-PHONE-04-10     PICTURE 9(7).
037960000000             04  WS-SH-PHONE-04-10-R   REDEFINES WS-SH-PHONE-04-10.
037970000000               05  WS-SH-PHONE-04-06   PICTURE X(3).
037980000000               05  WS-SH-PHONE-07-10   PICTURE X(4).
037990000000
038000990316           03  WS-PHONE-2.
038010990316             04  WS-SH-PHONE2-01-03    PICTURE 9(3).
038020990316             04  WS-SH-PHONE2-04-10    PICTURE 9(7).
038030990316             04  WS-SH-PHONE2-04-10-R  REDEFINES WS-SH-PHONE2-04-10.
038040990316               05  WS-SH-PHONE2-04-06  PICTURE X(3).
038050990316               05  WS-SH-PHONE2-07-10  PICTURE X(4).
038060990316
038070000000           03  WS-POSTAL.
038080000000               05  WS-POSTAL1          PICTURE X(3).
038090000000               05  WS-POSTAL2          PICTURE X(7).
038100000000
038110000000           03  WS-POSTAL-OUT.
038120000000               05  WS-POSTAL-OUT1      PICTURE X(3).
038130000000               05  FILLER              PICTURE X(1).
038140000000               05  WS-POSTAL-OUT2      PICTURE X(6).
038150000000
038160000000           03  WS-REP-NAME             PICTURE X(40).
038170000000
038180000000           03  WS-SH02-SIN-NO.
038190000000               05  SH02-SIN-NO-1-3     PICTURE X(3).
038200000000               05  SH02-SIN-NO-LITDSH1 PICTURE X(1).
038210000000               05  SH02-SIN-NO-4-6     PICTURE X(3).
038220000000               05  SH02-SIN-NO-LITDSH2 PICTURE X(1).
038230000000               05  SH02-SIN-NO-7-9     PICTURE X(3).
038240000000
038250000000           03  WS-SH04-INVESTOR-ADDRESS1.
038260000000               05  SH04-POSTAL-CODE    PICTURE X(10).
038270000000               05  FILLER              PICTURE X(30).
038280000000
038290000000           03  WS-SH05-INVESTOR-ADDRESS2.
038300000000               05  SH05-POSTAL-CODE    PICTURE X(10).
038310000000               05  FILLER              PICTURE X(30).
038320000000
038330000000           03  WS-SH06-INVESTOR-ADDRESS3.
038340971205               05  SH6-POSTAL-CODE     PICTURE X(10).
038350000000               05  FILLER              PICTURE X(30).
038360000000
038370000000           03  WS-SH07-INVESTOR-ADDRESS4.
038380971204               05  SH7-POSTAL-CODE     PICTURE X(10).
038390000000               05  FILLER              PICTURE X(30).
038400000000
038410000000           03  WS-SH08-INVESTOR-ADDRESS5.
038420000000               05  SH08-POSTAL-CODE    PICTURE X(10).
038430000000               05  FILLER              PICTURE X(30).
038440000000
038450000000           03  WS-SH09-POSTAL-CODE     PICTURE X(10).
038460000000           03  WS-SH10-LIT1X           PICTURE X(47).
038470000000
038480000000           03  WS-SH10-PHONE.
038490000000               05  SH10-PHONE-LITLB    PICTURE X(1).
038500000000               05  SH10-PHONE-01-03    PICTURE X(3).
038510000000               05  SH10-PHONE-LITRB    PICTURE X(1).
038520000000               05  FILLER              PICTURE X(1).
038530000000               05  SH10-PHONE-04-06    PICTURE X(3).
038540000000               05  SH10-PHONE-LITDSH   PICTURE X(1).
038550000000               05  SH10-PHONE-07-10    PICTURE X(4).
038560000000
038570990316           03  WS-SH10V1-PHONE.
038580990707               05  SH10V1-PHONE-LITLB    PICTURE X(1).
038590990316               05  SH10V1-PHONE-01-03    PICTURE X(3).
038600990707               05  SH10V1-PHONE-LITRB    PICTURE X(1).
038610990707               05  FILLER                PICTURE X(1).
038620990316               05  SH10V1-PHONE-04-06    PICTURE X(3).
038630990707               05  SH10V1-PHONE-LITDSH   PICTURE X(1).
038640990316               05  SH10V1-PHONE-07-10    PICTURE X(4).
038650010519
038660010519R10081     03  WS-SH10V4-PHONE.
038670010519               05  SH10V4-PHONE-LITLB    PICTURE X(1).
038680010519               05  SH10V4-PHONE-01-03    PICTURE X(3).
038690010519               05  SH10V4-PHONE-LITRB    PICTURE X(1).
038700010519               05  FILLER                PICTURE X(1).
038710010519               05  SH10V4-PHONE-04-06    PICTURE X(3).
038720010519               05  SH10V4-PHONE-LITDSH   PICTURE X(1).
038730010519R10081         05  SH10V4-PHONE-07-10    PICTURE X(4).
038740990316
038750000000           03  WS-SH11-NOMINEE         PICTURE X(53).
038760000000
038770000000           03  WS-SH11-FAX.
038780000000               05  SH11-FAX-LITLB      PICTURE X(1).
038790000000               05  SH11-FAX-01-03      PICTURE X(3).
038800000000               05  SH11-FAX-LITRB      PICTURE X(1).
038810000000               05  FILLER              PICTURE X(1).
038820000000               05  SH11-FAX-04-06      PICTURE X(3).
038830000000               05  SH11-FAX-LITDSH     PICTURE X(1).
038840000000               05  SH11-FAX-07-10      PICTURE X(4).
038850000000
038860000000           03  WS-SIN-NO.
038870000000               05  WS-SIN-NO-1-3       PICTURE X(3).
038880000000               05  WS-SIN-NO-4-6       PICTURE X(3).
038890000000               05  WS-SIN-NO-7-9       PICTURE X(3).
038900000000
038910000000           03  WS-START-DATE.
038920991004      *        05  FILLER              PICTURE X(2).
038930991004               05  WS-SH-START-DATE    PICTURE X(8).
038940000000
038950990928           03  WS-START-DATE-3.
038960990928               05  WS-SH-START-DATE-3  PICTURE X(8).
038970990928
038980000000           03  WS-TRADE-DATE.
038990991004      *        05  FILLER              PICTURE X(2).
039000991004               05  WS-SH-TRADE-DATE    PICTURE X(8).
039010000000
039020990928           03  WS-TRADE-DATE-3.
039030990928               05  WS-SH-TRADE-DATE-3  PICTURE X(8).
039040000000      *****
039050000000      *****    Non-Numeric Literals.
039060000000      *****
039070000000
039080000000           03  WS-ACCOUNT-TYPE-SHORT-TOTAL
039090000000                                       PICTURE X(5)        VALUE
039100000000               "TOTAL".
039110000000           03  WS-ACCOUNT-TYPE-TOTAL   PICTURE X(35)       VALUE
039120000000               "TOTAL                              ".
039130000000           03  WS-INVESTMENT-NAME-TOTAL
039140000000                                       PICTURE X(35)       VALUE
039150000000               "TOTAL                              ".
039160000000
039170000000      *****
039180000000      *****    Numeric Items.
039190000000      *****
039200000000
039210000000
039220010615R10404     03  WS-ACTUAL-CAPITAL       PICTURE 9(11)V9(2).
039230000000           03  WS-DEDUCTIONS           PICTURE S9(9)V9(2)  COMP-3.
039240000000           03  WS-DEDUCTIONS-SIGN      PICTURE X(1).
039250000000
039260000000           03  WS-LNECNT               PICTURE S9(3)       COMP-3.
039270000000           03  WS-LNEMAX               PICTURE S9(3)       COMP-3.
039280000000           03  WS-PGECNT               PICTURE S9(5)       COMP-3.
039290000000
039300000000           03  WS-REG-CTB-CUR          PICTURE 9(9)V9(2)   COMP-3.
039310000000           03  WS-REG-CTB-CUR-SIGN     PICTURE X(1).
039320000000
039330000000           03  WS-SH-PGENO             PICTURE S9(3)       COMP-3.
039340000000           03  WS-STMTVRSN             PICTURE S9(3)       COMP-3.
039350000000
039360000000      *****
039370000000      *****    Switches.
039380000000      *****
039390000000
039400000000           03  WS-BYPPRT-SW            PICTURE X(1).
039410000000           03  WS-CLTSPR-SW            PICTURE X(1).
039420000000           03  WS-EOJHDG-SW            PICTURE X(1).
039430000000           03  WS-L01BYP-SW            PICTURE X(1).
039440000000           03  WS-PSRERR-SW            PICTURE X(1).
039450000000           03  WS-PSTCDEPRT-SW         PICTURE X(1).
039460000000           03  WS-SELPRT-SW            PICTURE X(1).
039470000000           03  WS-STMT-DTA-SW-01       PICTURE X(1).
039480000000           03  WS-STMT-DTA-SW-05       PICTURE X(1).
039490010517R10081     03  WS-STMT-DTA-SW-25       PICTURE X(1).
039500010517R10081     03  WS-STMT-DTA-SW-20FUND   PICTURE X(1).
039510010517R10081     03  WS-STMT-DTA-SW-20GIC    PICTURE X(1).
039520010517R10081     03  WS-STMT-DTA-SW-20DII    PICTURE X(1).
039530010524R10383     03  WS-STMT-DTA-SW-80DII    PICTURE X(1).
039540010524R10383     03  WS-STMT-DTA-SW-80FUND   PICTURE X(1).
039550000000           03  WS-STMT-PRT-HDR-WSW     PICTURE X(1).
039560000000      /
039570000000       01  DUMP-ARGUMENTS.
039580000000
039590000000      ******************************************************************
039600000000      *                                                                *
039610000000      *    D U M P   P A S S   P A R A M E T E R S                     *
039620000000      *                                                                *
039630000000      ******************************************************************
039640000000
039650000000           03  DA-TYPE                 PICTURE X(1)        VALUE "F".
039660000000               88  COBOL-IDENTIFIERS                       VALUE "D".
039670000000               88  FULL-DUMP                               VALUE "F".
039680000000           03  FILLER                  PICTURE X(1).
039690000000           03  DA-PGM-NAME             PICTURE X(10)       VALUE
039700000000               "CNFMPRT   ".
039710000000      /
039720000000      ******************************************************************
039730000000      *                                                                *
039740000000      *    C U R R E N T   /   P R E V I O U S   C O N T R O L S       *
039750000000      *                                                                *
039760000000      ******************************************************************
039770000000
039780000000       01  CURR-CONTROLS.
039790000000           03  CURR-LEVEL1.
039800000000             04  CURR-LEVEL2.
039810980128               05  CURR-START-DATE     PICTURE 9(8).
039820980128               05  CURR-END-DATE       PICTURE 9(8).
039830000000               05  CURR-INVESTOR-NO    PICTURE 9(9).
039840000000             04  CURR-ACCOUNT          PICTURE 9(9).
039850000000
039860000000       01  PREV-CONTROLS.
039870000000           03  PREV-LEVEL1.
039880000000             04  PREV-LEVEL2.
039890980128               05  PREV-START-DATE     PICTURE 9(8).
039900980128               05  PREV-END-DATE       PICTURE 9(8).
039910000000               05  PREV-INVESTOR-NO    PICTURE 9(9).
039920000000             04  PREV-ACCOUNT          PICTURE 9(9).
039930000000
039940000000       01  CURR-CTLS-DPR.
039950000000           03  CURR-CD-LEV1.
039960000000               05  CURR-CD-FUND-NO     PICTURE X(8).
039970000000
039980000000       01  PREV-CTLS-DPR.
039990000000           03  PREV-CD-LEV1.
040000000000               05  PREV-CD-FUND-NO     PICTURE X(8).
040010010528
040020000000      /
040030190614      *RFS183449-Starts
040040190614       01    Lc-Acct-Type-Code         PICTURE X(5).
040050190614      *RFS183449-Ends
040060190614
040070000000       PROCEDURE DIVISION.
040080000000
040090000000      ******************************************************************
040100000000      *                                                                *
040110000000      *    P R O C E D U R E   D I V I S I O N                         *
040120000000      *                                                                *
040130000000      ******************************************************************
040140000000      /
040150000000       MAINLINE.
040160000000
040170000000      ******************************************************************
040180000000      *                                                                *
040190000000      *    M A I N L I N E                                             *
040200000000      *                                                                *
040210000000      ******************************************************************
040220000000
040230000000           PERFORM INITIAL-LOGIC-RTN  THRU ILR-EXIT.
040240990928
040250000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
040260990928               GO TO MLR-0050
040270990928           END-IF.
040280990928
040290000000       MLR-0010.
040300990928
040310000000           PERFORM GET-CURRENT-RECORD THRU GCR-EXIT.
040320990928
040330000000           IF  PREV-LEVEL1    IS EQUAL TO  CURR-LEVEL1
040340990928               GO TO MLR-0040
040350990928           END-IF
040360990928
040370000000           IF  PREV-CONTROLS  IS EQUAL TO  LOW-VALUES
040380990928               GO TO MLR-0020
040390990928           END-IF
040400000000
040410000000           PERFORM LEVEL-SUMMARY-1    THRU LS1-EXIT.
040420000000
040430000000           IF  PREV-LEVEL2    IS EQUAL TO  CURR-LEVEL2
040440990928               GO TO MLR-0030
040450990928           END-IF
040460000000
040470000000           PERFORM LEVEL-SUMMARY-2    THRU LS2-EXIT.
040480000000
040490000000       MLR-0020.
040500990928
040510000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
040520990928               GO TO MLR-0050
040530990928           END-IF
040540000000
040550000000           PERFORM LEVEL-REINIT-2     THRU LR2-EXIT.
040560000000
040570000000       MLR-0030.
040580010725
040590000000           PERFORM LEVEL-REINIT-1     THRU LR1-EXIT.
040600000000
040610000000       MLR-0040.
040620990928
040630000000           PERFORM DETAIL-PROCESS-RTN THRU DPR-EXIT.
040640990928
040650000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
040660990928               GO TO MLR-0050
040670990928           END-IF
040680000000
040690000000           MOVE CURR-CONTROLS          TO  PREV-CONTROLS.
040700000000           GO TO MLR-0010.
040710000000
040720000000       MLR-0050.
040730990928
040740000000           PERFORM END-JOB-RTN        THRU EJR-EXIT.
040750000000           STOP RUN.
040760990928
040770990928      **********
040780990928
040790000000      /
040800000000       GET-CURRENT-RECORD.
040810000000
040820000000      ******************************************************************
040830000000      *                                                                *
040840000000      *    G E T   C U R R E N T   R E C O R D   R O U T I N E         *
040850000000      *                                                                *
040860000000      ******************************************************************
040870000000
040880000000           CONTINUE.
040890000000
040900000000      *****
040910000000      *****    Read through the Statement Data records.
040920000000      *****
040930000000
040940000000       GCR-0010.
040950990928
040960000000           READ STMT-DTA-FILE          AT  END
040970000000               MOVE HIGH-VALUES        TO  CURR-CONTROLS
040980990928               GO TO GCR-EXIT
040990990928           END-READ
041000990928
041010000000           MOVE STMT-DTA-RECD          TO  MFASTMTFP-SECTION.
041020000000           ADD 1                       TO  WS-STMT-DTA-RCNT.
041030000000
041040000000      *****
041050000000      *****    Determine which Statement Data record is being processed.
041060000000      *****    If the record cannot be identified, an error message will
041070000000      *****    be printed and the record bypassed.  If this occurs, the
041080000000      *****    program should be changed to either bypass the record or
041090000000      *****    to handle it appropriately.
041100000000      *****
041110000000
041120991001
041130991001           EVALUATE PR-SECTION-NO
041140991001             WHEN  "00"               GO TO GCR-0020
041150991001             WHEN  "01"               GO TO GCR-0030
041160991001             WHEN  "05"               GO TO GCR-0040
041170991001             WHEN  "10"               GO TO GCR-0050
041180010308RF8633       WHEN  "12"               GO TO GCR-0050-0005
041190991001             WHEN  "15"               GO TO GCR-0050-0010
041200140624132121       WHEN  "16"               GO TO GCR-0050-0016
041210040406R20870       WHEN  "17"               GO TO GCR-0050-0017
041220991001             WHEN  "20"               GO TO GCR-0060
041230130408117038       WHEN  "22"               GO TO GCR-0060-0022
041240010321RF8633       WHEN  "25"               GO TO GCR-0060-0005
041250991126             WHEN  "30"               GO TO GCR-0060-0010
041260040406R20870       WHEN  "33"               GO TO GCR-0060-0033
041270991126             WHEN  "35"               GO TO GCR-0060-0020
041280040406R20870       WHEN  "38"               GO TO GCR-0060-0038
041290010308RF4638       WHEN  "40"               GO TO GCR-0060-0030
041300010308RF4638       WHEN  "43"               GO TO GCR-0060-0040
041310010308RF4638       WHEN  "45"               GO TO GCR-0060-0050
041320991001             WHEN  "50"               GO TO GCR-0070
041330991001             WHEN  "60"               GO TO GCR-0070-0010
041340991002             WHEN  "62"               GO TO GCR-0070-0015
041350091124R69515       WHEN  "63"               GO TO GCR-0070-0016
041360010323RF8633       WHEN  "67"               GO TO GCR-0070-0018
041370991001             WHEN  "70"               GO TO GCR-0070-0020
041380991001             WHEN  "80"               GO TO GCR-0080
041390060824R34848       WHEN  "81"               GO TO GCR-0080-0005
041400991001             WHEN  "82"               GO TO GCR-0080-0010
041410991007             WHEN  "84"               GO TO GCR-0080-0020
041420010308RF4638       WHEN  "90"               GO TO GCR-0080-0030
041430991001             WHEN  OTHER
041440991001               MOVE SPACES                 TO  ERROR-LINE-1
041450991001               SET MSG                     TO  1
041460991001               PERFORM PRINT-ERR-LINE      THRU PEL-EXIT
041470991001               ADD 1                       TO  WS-STMT-DTA-BCNT
041480991001               GO TO GCR-0090
041490991001           END-EVALUATE.
041500991001
041510000000       GCR-0020.
041520000000
041530000000      *****
041540000000      *****    Processing a Delivery Information record, bypass it.
041550000000      *****
041560000000
041570000000           ADD 1                       TO  WS-STMT-DTA-BCNT-00.
041580000000           GO TO GCR-0090.
041590000000
041600000000       GCR-0030.
041610000000
041620000000      *****
041630000000      *****    Processing an Investor Information record, select it.
041640000000      *****
041650980914
041660980916           MOVE MFASTMTFP-SECTION      TO  INVESTOR-INFO-SECTION.
041670980916           ADD 1                       TO  WS-STMT-DTA-SCNT-01.
041680981001           GO TO GCR-0100.
041690000000
041700000000       GCR-0040.
041710000000
041720000000      *****
041730000000      *****    Processing a Dealer record.  The record will be selected
041740000000      *****    unless it is the primary record.
041750000000      *****
041760000000
041770000000           MOVE MFASTMTFP-SECTION      TO  DEALER-SECTION.
041780000626      *    IF  DL-SECTION-SEQ
041790000626      *                   IS GREATER THAN  1
041800000626      *        ADD 1                   TO  WS-STMT-DTA-BCNT-05
041810000626      *        GO TO GCR-0090.
041820000000
041830000000           ADD 1                       TO  WS-STMT-DTA-SCNT-05.
041840000000           GO TO GCR-0100.
041850000000
041860000000       GCR-0050.
041870000000
041880000000      *****
041890000000      *****    Processing an Investor Summary record.  The record will
041900000000      *****    be selected unless it is a 'TOTAL' record.
041910000000      *****
041920000000
041930000000           MOVE MFASTMTFP-SECTION      TO  INVESTOR-SUMMARY-SECTION.
041940000000           IF  IS-ACCOUNT-TYPE   EQUAL TO  WS-ACCOUNT-TYPE-TOTAL
041950000000           AND IS-ACCOUNT-TYPE-SHORT
041960000000                              IS EQUAL TO  WS-ACCOUNT-TYPE-SHORT-TOTAL
041970000000               ADD 1                   TO  WS-STMT-DTA-BCNT-10
041980000000               GO TO GCR-0090.
041990000000
042000000000           ADD 1                       TO  WS-STMT-DTA-SCNT-10.
042010000000           GO TO GCR-0100.
042020010308
042030010308RF8633 GCR-0050-0005.
042040010308
042050010308      *****
042060010308      *****    Processing an Investor Summary Section 2 record, bypass
042070010308      *****    it.
042080010308      *****
042090010308
042100010308           MOVE MFASTMTFP-SECTION      TO  INVESTOR-SUMMARY-SECTION-2.
042110010308           ADD 1                       TO  WS-STMT-DTA-BCNT-12.
042120010308RF8633     GO TO GCR-0090.
042130010308
042140000000       GCR-0050-0010.
042150000000
042160000000      *****
042170000000      *****    Processing an Account Asset Class Summary record, bypass
042180000000      *****    it.
042190000000      *****
042200000000
042210000000           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-ASSET-CLASS-SECTION.
042220000000           ADD 1                       TO  WS-STMT-DTA-BCNT-15.
042230000000           GO TO GCR-0090.
042240010619
042250140624      *RFS132121 - START
042260140624       GCR-0050-0016.
042270140624
042280140624      *****
042290140624      *****    Processing an Account Level Asset Allocation record,
042300140624      *****    bypass it.
042310140624      *****
042320140624
042330140708           MOVE MFASTMTFP-SECTION   TO  ACCOUNT-LEVEL-ASSET-ALLOC-DTL.
042340140708           ADD 1                    TO  WS-STMT-DTA-BCNT-16.
042350140624           GO TO GCR-0090.
042360140624
042370140624      *RFS132121 - END
042380040406R20870 GCR-0050-0017.
042390040406
042400040406      *****
042410040406      *****    Processing an Account IPS, bypass
042420040406      *****    it.
042430040406      *****
042440040406
042450040406           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-IPS-DETAILS.
042460040406           ADD 1                       TO  WS-STMT-DTA-BCNT-17.
042470040406           GO TO GCR-0090.
042480040406
042490000000       GCR-0060.
042500000000
042510000000      *****
042520000000      *****    Processing an Account Detail record.  The record will be
042530000000      *****    selected unless it is a 'TOTAL' record.
042540000000      *****
042550000000
042560000000           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-DETAILS-SECTION.
042570010619R10404     MOVE MFASTMTFP-SECTION    TO  WS-ACCOUNT-FUND-DETAILS-TEMP.
042580000000           IF  AD-INVESTMENT-NAME
042590000000                              IS EQUAL TO  WS-INVESTMENT-NAME-TOTAL
042600000000               ADD 1                   TO  WS-STMT-DTA-BCNT-20
042610000000               GO TO GCR-0090.
042620000000
042630000000           ADD 1                       TO  WS-STMT-DTA-SCNT-20.
042640000000           GO TO GCR-0100.
042650991126
042660010321RF8633 GCR-0060-0005.
042670010321
042680010321      *****
042690010321      *****    Processing an Account GIC Detail record, bypass it.
042700010517R10081*****    PROCESSING AN ACCOUNT GIC DETAIL RECORD, SELECT IT.
042710010321      *****
042720010321
042730010321           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-GIC-DETAILS-SECTION.
042740010321           ADD 1                       TO  WS-STMT-DTA-BCNT-25.
042750010517RF8633*    GO TO GCR-0090.
042760010517R10081     GO TO GCR-0100.
042770010321
042780130408117038 GCR-0060-0022.
042790130408117038
042800130408117038     MOVE MFASTMTFP-SECTION      TO  ACCOUNT-DETAILS-SECTION-22.
042810130408117038     ADD 1                       TO  WS-STMT-DTA-BCNT-22.
042820130408117038     GO TO GCR-0100.
042830130408117038
042840130408117038 GCR-0060-0010.
042850991126
042860991126      *****
042870991126      *****    Processing a Account Performance record, bypass it.
042880991126      *****
042890991126
042900991126           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-PERFORMANCE-SECTION.
042910991126           ADD 1                       TO  WS-STMT-DTA-BCNT-30.
042920991126           GO TO GCR-0090.
042930991126
042940040406R20870 GCR-0060-0033.
042950040406
042960040406      *****
042970040406      *****    Processing a Account ROR, bypass it.
042980040406      *****
042990040406
043000040406           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-ROR-FRQ-SECTION.
043010040406           ADD 1                       TO  WS-STMT-DTA-BCNT-33.
043020040406           GO TO GCR-0090.
043030040406
043040991126       GCR-0060-0020.
043050991126
043060991126      *****
043070991126      *****  Processing a Account Fund Performance record, bypass it.
043080991126      *****
043090991126
043100991126           MOVE MFASTMTFP-SECTION     TO ACCOUNT-FUND-PERFORM-SECTION.
043110991126           ADD 1                      TO WS-STMT-DTA-BCNT-35.
043120991126           GO TO GCR-0090.
043130991126
043140040406R20870 GCR-0060-0038.
043150040406
043160040406      *****
043170040406      *****  Processing a Account Fund ROR, bypass it.
043180040406      *****
043190040406
043200040406           MOVE MFASTMTFP-SECTION     TO ACCOUNT-FUND-ROR-FRQ-SECTION.
043210040406           ADD 1                      TO WS-STMT-DTA-BCNT-38.
043220040406           GO TO GCR-0090.
043230040406
043240010308RF4638 GCR-0060-0030.
043250010308
043260010308      *****
043270010308      *****  Processing a Seg Fund Contract Details record, bypass it.
043280010308      *****
043290010308
043300010308           MOVE MFASTMTFP-SECTION     TO SEG-FUND-CONTRACT-DETAILS.
043310010308           ADD 1                      TO WS-STMT-DTA-BCNT-40.
043320010308           GO TO GCR-0090.
043330010308
043340010308RF4638 GCR-0060-0040.
043350010308
043360010308      *****
043370010308      *****  Processing a Seg Fund Contract Investment Details record,
043380010308      *****  bypass it.
043390010308      *****
043400010308
043410010308           MOVE MFASTMTFP-SECTION     TO SEG-FUND-CONTRACT-INVESTMENT.
043420010308           ADD 1                      TO WS-STMT-DTA-BCNT-43.
043430010308           GO TO GCR-0090.
043440010308
043450010308RF4638 GCR-0060-0050.
043460010308
043470010308      *****
043480010308      *****  Processing a ANNUITANT DETAILS record, bypass it.
043490010308      *****
043500010308
043510010308           MOVE MFASTMTFP-SECTION     TO ANNUITANT-DETAILS.
043520010308           ADD 1                      TO WS-STMT-DTA-BCNT-45.
043530010308           GO TO GCR-0090.
043540010308
043550000000       GCR-0070.
043560000000
043570000000      *****
043580000000      *****    Processing a Rollover record, bypass it.
043590000000      *****
043600000000
043610000000           MOVE MFASTMTFP-SECTION      TO  ROLLOVER-SECTION.
043620000000           ADD 1                       TO  WS-STMT-DTA-BCNT-50.
043630000000           GO TO GCR-0090.
043640000000
043650000000       GCR-0070-0010.
043660000000
043670000000      *****
043680000000      *****    Processing a RRIF Detail record, bypass it.
043690000000      *****
043700000000
043710000000           MOVE MFASTMTFP-SECTION      TO  RRIF-DETAIL-SECTION.
043720000000           ADD 1                       TO  WS-STMT-DTA-BCNT-60.
043730000000           GO TO GCR-0090.
043740000000
043750991002       GCR-0070-0015.
043760991002
043770991002      *****
043780991002      *****    Processing a RESP Detail record, bypass it.
043790991002      *****
043800991002
043810991002           MOVE MFASTMTFP-SECTION      TO  RESP-DETAIL-SECTION.
043820991002           ADD 1                       TO  WS-STMT-DTA-BCNT-62.
043830991002           GO TO GCR-0090.
043840091124
043850091124      *RFS69515 Begin
043860091124       GCR-0070-0016.
043870091124
043880091124      *****
043890091124      *****    Processing a RDSP Detail record, bypass it.
043900091124      *****
043910091124
043920091125           MOVE MFASTMTFP-SECTION      TO  RDSP-DETAIL-SECTION.
043930091124           ADD 1                       TO  WS-STMT-DTA-BCNT-63.
043940091124           GO TO GCR-0090.
043950091124
043960091124      *RFS69515 End
043970010323       GCR-0070-0018.
043980010323
043990010323      *****
044000010323      *****    Processing a BENEFICIARY INFORMATION record, bypass it.
044010010323      *****
044020010323
044030011203           MOVE MFASTMTFP-SECTION      TO  BENEFICIARY-INFORMATION.
044040010323           ADD 1                       TO  WS-STMT-DTA-BCNT-67.
044050010323           GO TO GCR-0090.
044060010323
044070000000       GCR-0070-0020.
044080000000
044090000000      *****
044100000000      *****    Processing a Systematic Plan Info record, bypass it.
044110000000      *****
044120000000
044130000000           MOVE MFASTMTFP-SECTION      TO  SYSTEMATIC-PLAN-INFO-SECTION.
044140000000           ADD 1                       TO  WS-STMT-DTA-BCNT-70.
044150000000           GO TO GCR-0090.
044160000000
044170000000       GCR-0080.
044180000000
044190000000      *****
044200000000      *****    Processing an Account Transaction record, select it.
044210000000      *****
044220000000
044230000000           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-TXN-SECTION.
044240000000           ADD 1                       TO  WS-STMT-DTA-SCNT-80.
044250000000           GO TO GCR-0100.
044260000000
044270060824R34848*Start
044280060824       GCR-0080-0005.
044290060824
044300060824      *****
044310060824      *****    Processing a Deduction Transaction, bypass it.
044320060824      *****
044330060824
044340060824           MOVE MFASTMTFP-SECTION      TO  TRANS-DED-SECTION.
044350060824           ADD 1                       TO  WS-STMT-DTA-BCNT-81.
044360060824           GO TO GCR-0090.
044370060824R34848*End
044380000000       GCR-0080-0010.
044390000000
044400000000      *****
044410000000      *****    Processing an Account Transaction Institution Detail
044420000000      *****    record, bypass it.
044430000000      *****
044440000000
044450000000           MOVE MFASTMTFP-SECTION      TO  AT-INSTITUTION-DETAIL-SECTION.
044460991013           ADD 1                       TO  WS-STMT-DTA-BCNT-82.
044470000000           GO TO GCR-0090.
044480000000
044490991007       GCR-0080-0020.
044500991007
044510991007      *****
044520991008      *****    Processing an RESP Account transaction beneficiary
044530991008      *****    record. The record will be selected.
044540991007      *****
044550991013
044560991013           MOVE MFASTMTFP-SECTION      TO  AT-RESP-DETAIL-SECTION
044570991013
044580991013           IF WS-LDA-RESP-84 IS EQUAL TO "Y"
044590991013              ADD 1          TO  WS-STMT-DTA-SCNT-84
044600991013              GO TO GCR-0100.
044610991013
044620991013           ADD 1             TO  WS-STMT-DTA-BCNT-84.
044630991013           GO TO GCR-0090.
044640010308
044650010308RF4638 GCR-0080-0030.
044660010308
044670010308      *****
044680010308      *****    Processing an RESET CONTRACT DETAILS record, bypass it.
044690010308      *****
044700010308
044710010308           MOVE MFASTMTFP-SECTION      TO  RESET-CONTRACT-DETAILS.
044720010308           ADD 1                       TO  WS-STMT-DTA-BCNT-90.
044730010308           GO TO GCR-0090.
044740991013
044750000000       GCR-0090.
044760000000
044770000000      *****
044780000000      *****    The record is to be bypassed.  Therefore, return to read
044790000000      *****    the next record.
044800000000      *****
044810000000
044820000000           GO TO GCR-0010.
044830000000
044840000000       GCR-0100.
044850000000
044860000000      *****
044870000000      *****    The record has been selected and is to be processed.
044880000000      *****    Format the current controls.
044890000000      *****
044900980212
044910980212           IF PR-START-DATE = SPACES
044920990928              MOVE ZEROES   TO PR-START-DATE
044930990928           END-IF
044940990928
044950980212           IF PR-END-DATE   = SPACES
044960990928              MOVE ZEROES   TO PR-END-DATE
044970990928           END-IF
044980000000
044990980128           MOVE PR-START-DATE          TO  CURR-START-DATE.
045000980128           MOVE PR-END-DATE            TO  CURR-END-DATE.
045010000000           MOVE PR-INVESTOR-NO         TO  CURR-INVESTOR-NO.
045020000000           MOVE PR-ACCOUNT             TO  CURR-ACCOUNT.
045030000000
045040990928      **********
045050990928
045060000000       GCR-EXIT.
045070000000           EXIT.
045080990928
045090990928      **********
045100021219
045110021219R15810******************************************************************
045120021219  ¦   *  GET DEDUCTION DETIAL LINE DESCRIPTION                         *
045130021219  v   ******************************************************************
045140021219       GET-DEDUCTION-DETAIL-LINES.
045150021219
045160021219      * Comission Amount
045170021219           IF AT-COMMISSION IS NOT EQUAL TO 0
045180021219              MOVE AT-COMMISSION      TO SD022-DEDUCTIONS
045190021219              MOVE AT-COMMISSION-SIGN TO SD022-DEDUCTIONS-SIGN
045200021219
045210021219              MOVE WS-COMM            TO  DEDUCTION-CODE
045220021219                                         OF TRANS-DEDUCTION-DESCR-REC
045230021219              MOVE AD-LANGUAGE        TO  LANGUAGE-CODE
045240021219                                         OF TRANS-DEDUCTION-DESCR-REC
045250021219
045260021219             READ TRANS-DEDUCTION-DESCR
045270021219              INVALID KEY
045280021219               MOVE SPACES  TO SD022-DEDUCTION-DESC
045290021219              NOT INVALID KEY
045300021219               MOVE DEDUCTION-LONG-DESCR OF  TRANS-DEDUCTION-DESCR-REC
045310021219                            TO SD022-DEDUCTION-DESC
045320021219
045330021219               SET   SPL                   UP BY 1
045340021219               MOVE STMT-DTL-DEDUCTION TO WS-STMTPGE-LNE (SPL)
045350021219           END-IF.
045360021219
045370021219      * DSC Amount
045380021219           IF AT-DSC        IS NOT EQUAL TO 0
045390021219              MOVE AT-DSC             TO SD022-DEDUCTIONS
045400021219              MOVE AT-DSC-SIGN        TO SD022-DEDUCTIONS-SIGN
045410021219
045420021219              MOVE WS-CDSC            TO  DEDUCTION-CODE
045430021219                                         OF TRANS-DEDUCTION-DESCR-REC
045440021219              MOVE AD-LANGUAGE        TO  LANGUAGE-CODE
045450021219                                         OF TRANS-DEDUCTION-DESCR-REC
045460021219
045470021219             READ TRANS-DEDUCTION-DESCR
045480021219              INVALID KEY
045490021219               MOVE SPACES TO SD022-DEDUCTION-DESC
045500021219              NOT INVALID KEY
045510021219               MOVE DEDUCTION-LONG-DESCR OF  TRANS-DEDUCTION-DESCR-REC
045520021219                            TO SD022-DEDUCTION-DESC
045530021219
045540021219               SET   SPL                   UP BY 1
045550021219               MOVE STMT-DTL-DEDUCTION TO WS-STMTPGE-LNE (SPL)
045560021219           END-IF.
045570021219
045580021219      * Admin Amount
045590021219           IF AT-ADMIN-FEES       IS NOT EQUAL TO 0
045600021219              MOVE AT-ADMIN-FEES      TO SD022-DEDUCTIONS
045610021219              MOVE SPACES             TO SD022-DEDUCTIONS-SIGN
045620021219
045630021219              MOVE WS-ADMN            TO  DEDUCTION-CODE
045640021219                                         OF TRANS-DEDUCTION-DESCR-REC
045650021219              MOVE AD-LANGUAGE        TO  LANGUAGE-CODE
045660021219                                         OF TRANS-DEDUCTION-DESCR-REC
045670021219
045680021219             READ TRANS-DEDUCTION-DESCR
045690021219              INVALID KEY
045700021219               MOVE SPACES TO SD022-DEDUCTION-DESC
045710021219              NOT INVALID KEY
045720021219               MOVE DEDUCTION-LONG-DESCR OF  TRANS-DEDUCTION-DESCR-REC
045730021219                            TO SD022-DEDUCTION-DESC
045740021219
045750021219               SET   SPL                   UP BY 1
045760021219               MOVE STMT-DTL-DEDUCTION TO WS-STMTPGE-LNE (SPL)
045770021219           END-IF.
045780021219
045790021219      * GST Amount
045800021219           IF AT-GST              IS NOT EQUAL TO 0
045810021219              MOVE AT-GST             TO SD022-DEDUCTIONS
045820021219              MOVE SPACES             TO SD022-DEDUCTIONS-SIGN
045830021219
045840021219              MOVE WS-GST             TO  DEDUCTION-CODE
045850021219                                         OF TRANS-DEDUCTION-DESCR-REC
045860021219              MOVE AD-LANGUAGE        TO  LANGUAGE-CODE
045870021219                                         OF TRANS-DEDUCTION-DESCR-REC
045880021219
045890021219             READ TRANS-DEDUCTION-DESCR
045900021219              INVALID KEY
045910021219               MOVE SPACES TO SD022-DEDUCTION-DESC
045920021219              NOT INVALID KEY
045930021219               MOVE DEDUCTION-LONG-DESCR OF  TRANS-DEDUCTION-DESCR-REC
045940021219                            TO SD022-DEDUCTION-DESC
045950021219
045960021219               SET   SPL                   UP BY 1
045970021219               MOVE STMT-DTL-DEDUCTION TO WS-STMTPGE-LNE (SPL)
045980021219           END-IF.
045990021219
046000021219      * PST Amount
046010021219           IF AT-PST              IS NOT EQUAL TO 0
046020021219              MOVE AT-PST             TO SD022-DEDUCTIONS
046030021219              MOVE SPACES             TO SD022-DEDUCTIONS-SIGN
046040021219
046050021219              MOVE WS-PST             TO  DEDUCTION-CODE
046060021219                                         OF TRANS-DEDUCTION-DESCR-REC
046070021219              MOVE AD-LANGUAGE        TO  LANGUAGE-CODE
046080021219                                         OF TRANS-DEDUCTION-DESCR-REC
046090021219
046100021219             READ TRANS-DEDUCTION-DESCR
046110021219              INVALID KEY
046120021219               MOVE SPACES TO SD022-DEDUCTION-DESC
046130021219              NOT INVALID KEY
046140021219               MOVE DEDUCTION-LONG-DESCR OF  TRANS-DEDUCTION-DESCR-REC
046150021219                            TO SD022-DEDUCTION-DESC
046160021219
046170021219               SET   SPL                   UP BY 1
046180021219               MOVE STMT-DTL-DEDUCTION TO WS-STMTPGE-LNE (SPL)
046190021219           END-IF.
046200021219
046210021219      * Federal Tax Amount
046220021219           IF AT-FED-TAX IS NOT EQUAL TO 0
046230021219              MOVE AT-FED-TAX         TO SD022-DEDUCTIONS
046240021219              MOVE SPACES             TO SD022-DEDUCTIONS-SIGN
046250021219
046260021219              MOVE WS-FEDT            TO  DEDUCTION-CODE
046270021219                                         OF TRANS-DEDUCTION-DESCR-REC
046280021219              MOVE AD-LANGUAGE        TO  LANGUAGE-CODE
046290021219                                         OF TRANS-DEDUCTION-DESCR-REC
046300021219
046310021219             READ TRANS-DEDUCTION-DESCR
046320021219              INVALID KEY
046330021219               MOVE SPACES TO SD022-DEDUCTION-DESC
046340021219              NOT INVALID KEY
046350021219               MOVE DEDUCTION-LONG-DESCR OF  TRANS-DEDUCTION-DESCR-REC
046360021219                            TO SD022-DEDUCTION-DESC
046370021219
046380021219               SET   SPL                   UP BY 1
046390021219               MOVE STMT-DTL-DEDUCTION TO WS-STMTPGE-LNE (SPL)
046400021219           END-IF.
046410021219
046420021219      * Provincial tax Amount
046430021219           IF AT-PROV-TAX         IS NOT EQUAL TO 0
046440021219              MOVE AT-PROV-TAX        TO SD022-DEDUCTIONS
046450021219              MOVE SPACES             TO SD022-DEDUCTIONS-SIGN
046460021219
046470021219              MOVE WS-PRVT            TO  DEDUCTION-CODE
046480021219                                         OF TRANS-DEDUCTION-DESCR-REC
046490021219              MOVE AD-LANGUAGE        TO  LANGUAGE-CODE
046500021219                                         OF TRANS-DEDUCTION-DESCR-REC
046510021219
046520021219             READ TRANS-DEDUCTION-DESCR
046530021219              INVALID KEY
046540021219               MOVE SPACES TO SD022-DEDUCTION-DESC
046550021219              NOT INVALID KEY
046560021219               MOVE DEDUCTION-LONG-DESCR OF  TRANS-DEDUCTION-DESCR-REC
046570021219                            TO SD022-DEDUCTION-DESC
046580021219
046590021219               SET   SPL                   UP BY 1
046600021219               MOVE STMT-DTL-DEDUCTION TO WS-STMTPGE-LNE (SPL)
046610021219           END-IF.
046620021219
046630021219      * NON-TAX-DEDUCTIONS
046640030103           COMPUTE NON-RESEDINTIAL-TAX =
046650030103                     AT-TAX - (AT-FED-TAX + AT-PROV-TAX).
046660030103           IF NON-RESEDINTIAL-TAX IS NOT EQUAL TO 0
046670030103            MOVE NON-RESEDINTIAL-TAX      TO SD022-DEDUCTIONS
046680040514R22291*     MOVE NON-RESEDINTIAL-TAX      TO SD022-DEDUCTIONS-SIGN
046690040514R22291      MOVE SPACES                   TO SD022-DEDUCTIONS-SIGN
046700021219
046710021219              MOVE WS-NONT            TO  DEDUCTION-CODE
046720021219                                         OF TRANS-DEDUCTION-DESCR-REC
046730021219              MOVE AD-LANGUAGE        TO  LANGUAGE-CODE
046740021219                                         OF TRANS-DEDUCTION-DESCR-REC
046750021219
046760021219             READ TRANS-DEDUCTION-DESCR
046770021219              INVALID KEY
046780021219               MOVE SPACES TO SD022-DEDUCTION-DESC
046790021219              NOT INVALID KEY
046800021219               MOVE DEDUCTION-LONG-DESCR OF  TRANS-DEDUCTION-DESCR-REC
046810021219                            TO SD022-DEDUCTION-DESC
046820021219
046830021219               SET   SPL                   UP BY 1
046840021219               MOVE STMT-DTL-DEDUCTION TO WS-STMTPGE-LNE (SPL)
046850021219           END-IF.
046860021219
046870021219
046880021219      **********
046890021219
046900021219       DED-EXIT.
046910021219           EXIT.
046920021219
046930021219R15810**********
046940021219
046950000000      /
046960000000       DETAIL-PROCESS-RTN.
046970000000
046980000000      ******************************************************************
046990000000      *                                                                *
047000000000      *    D E T A I L   P R O C E S S   R O U T I N E                 *
047010000000      *                                                                *
047020000000      ******************************************************************
047030000000
047040000000      *****
047050000000      *****    If an error was detected in a re-initialization routine,
047060000000      *****    bypass processing the record.
047070000000      *****
047080000000
047090000000           IF  WS-L01BYP-SW   IS EQUAL TO  "Y"
047100991001               GO TO DPR-EXIT
047110991001           END-IF
047120000000
047130000000      *****
047140000000      *****    Process the Statement Data record depending on the
047150000000      *****    section number.  If it cannot be identified, an error
047160000000      *****    message will be printed and the record bypassed.  If
047170000000      *****    this occurs, we have a real problem since the GET CURRENT
047180000000      *****    RECORD routine should have bypassed the record.
047190000000      *****
047200000000
047210991001           EVALUATE PR-SECTION-NO
047220991001             WHEN "01"
047230991001               GO TO DPR-0010
047240991001             WHEN "05"
047250991001               GO TO DPR-0020
047260991001             WHEN "10"
047270991001               GO TO DPR-0020-0010
047280991001             WHEN "20"
047290991001               GO TO DPR-0030
047300010517R10081       WHEN "25"
047310010517R10081         GO TO DPR-0055
047320991001             WHEN "80"
047330991001               GO TO DPR-0060
047340991008             WHEN "84"
047350991008               GO TO DPR-0065
047360991001             WHEN OTHER
047370991001                  MOVE SPACES                 TO  ERROR-LINE-1
047380991001                  SET MSG                     TO  2
047390991001                  PERFORM PRINT-ERR-LINE      THRU PEL-EXIT
047400991001                  GO TO DPR-EXIT
047410991001           END-EVALUATE.
047420991001
047430980916       DPR-0010.
047440000000
047450000000      *****
047460000000      *****    Processing an Investor Information record.  Simply
047470000000      *****    indicate that one has been found for the account, then
047480000000      *****    exit.
047490000000      *****
047500990930
047510980921           IF WS-LDA-INV-ACC-FLAG IS EQUAL TO "N"
047520991001           OR WS-STMTVRSN         IS EQUAL TO  3
047530991001              GO TO DPR-0010-0000
047540991001           END-IF
047550991001
047560980916           IF WS-II-LST NOT LESS THAN WS-II-MAX
047570980916              MOVE SPACES TO ERROR-LINE-1
047580980916              SET MSG     TO 4
047590980916              PERFORM PRINT-ERR-LINE THRU PEL-EXIT
047600991001              GO TO DPR-EXIT
047610991001           END-IF
047620991001
047630980916           ADD 1      TO WS-II-LST.
047640980916           SET II     TO WS-II-LST.
047650980916           MOVE INVESTOR-INFO-SECTION TO WS-INVESTOR-INFO (II).
047660980921           MOVE "Y"                    TO  WS-STMT-DTA-SW-01.
047670980921           GO TO DPR-EXIT.
047680980921
047690980921       DPR-0010-0000.
047700991001
047710000000           MOVE "Y"                    TO  WS-STMT-DTA-SW-01.
047720000000           GO TO DPR-EXIT.
047730000000
047740000000       DPR-0020.
047750000000
047760000000      *****
047770000000      *****    Processing a Dealer record.  Simply indicate that one has
047780000000      *****    been found for the account, then exit.
047790000000      *****
047800000626
047810000626RF6725     IF WS-DI-LST NOT LESS THAN WS-DI-MAX
047820000626              MOVE SPACES TO ERROR-LINE-1
047830000626              SET MSG     TO 4
047840000626              PERFORM PRINT-ERR-LINE THRU PEL-EXIT
047850000626              GO TO DPR-EXIT
047860000626           END-IF
047870000626
047880000626           ADD 1      TO WS-DI-LST.
047890000626           SET DI     TO WS-DI-LST.
047900000626
047910000626           MOVE DEALER-SECTION         TO  WS-DEALER-INFO (DI).
047920000626
047930000000           MOVE "Y"                    TO  WS-STMT-DTA-SW-05.
047940000000           GO TO DPR-EXIT.
047950000000
047960000000       DPR-0020-0010.
047970000000
047980000000      *****
047990000000      *****    Processing an Investor Summary record.  Store the Account
048000000000      *****    information for Nominee and Registered Contribution.  If
048010000000      *****    the table is full, an error message will be printed and
048020000000      *****    the account will not be formatted.  If this occurs, the
048030000000      *****    table occurrence should be increased.  Remember to udpate
048040000000      *****    the setting of WS-SIA-MAX in INITIAL-LOGIC.
048050000000      *****
048060000000
048070000000           IF  WS-SIA-LST   NOT LESS THAN  WS-SIA-MAX
048080000000               MOVE SPACES             TO  ERROR-LINE-1
048090000000               SET MSG                 TO  11
048100000000               PERFORM PRINT-ERR-LINE THRU PEL-EXIT
048110991001               GO TO DPR-0020-0060
048120991001           END-IF
048130000000
048140000000           IF  WS-SIA-LST     IS EQUAL TO  ZEROES
048150000000               SET SIA                 TO  1
048160991001               GO TO DPR-0020-0050
048170991001           END-IF
048180000000
048190000000           SET SIA                     TO  WS-SIA-LST.
048200000000           IF  IS-ACCOUNT2   GREATER THAN  WS-SIA-ACCT (SIA)
048210000000               SET SIA              UP BY  1
048220991001               GO TO DPR-0020-0050
048230991001           END-IF
048240000000
048250000000           SET SIA                     TO  1.
048260000000
048270000000       DPR-0020-0020.
048280991001
048290000000           IF  IS-ACCOUNT2   IS LESS THAN  WS-SIA-ACCT (SIA)
048300991001               GO TO DPR-0020-0030
048310991001           END-IF
048320000000
048330000000           SET SIA                  UP BY  1.
048340991001
048350000000           IF  SIA    IS NOT GREATER THAN  WS-SIA-LST
048360991001               GO TO DPR-0020-0020
048370991001           END-IF.
048380000000
048390000000       DPR-0020-0030.
048400991001
048410000000           SET SIA1                    TO  WS-SIA-LST.
048420000000           SET SIA2                    TO  WS-SIA-LST.
048430991001           SET SIA2                    UP BY  1.
048440000000
048450000000       DPR-0020-0040.
048460991001
048470000000           IF  SIA1      IS NOT LESS THAN  SIA
048480000000               MOVE WS-SIA-ENT (SIA1)  TO  WS-SIA-ENT (SIA2)
048490000000               SET SIA1           DOWN BY  1
048500000000               SET SIA2           DOWN BY  1
048510991001               GO TO DPR-0020-0040
048520991001           END-IF.
048530000000
048540000000       DPR-0020-0050.
048550991001
048560000000           MOVE IS-ACCOUNT2            TO  WS-SIA-ACCT (SIA).
048570980213           MOVE IS-DEALER-ACCOUNT-NO   TO  WS-SIA-DLRACCTNO (SIA).
048580991001
048590991001           IF IS-NOMINEE               IS EQUAL TO  "Y"
048600991001              MOVE IS-NOMINEE-CODE     TO  WS-SIA-NOMCDE (SIA)
048610991001              MOVE IS-NOMINEE-NAME     TO  WS-SIA-NOMNAM (SIA)
048620991001              MOVE IS-NOMINEES-ACCT-NO TO  WS-SIA-NOMACCT (SIA)
048630991001           ELSE
048640991001              MOVE SPACES              TO  WS-SIA-NOMCDE (SIA)
048650991001              MOVE SPACES              TO  WS-SIA-NOMNAM (SIA)
048660991001              MOVE SPACES              TO  WS-SIA-NOMACCT (SIA)
048670991001           END-IF
048680991001
048690000000           MOVE IS-REG-CTB-CUR         TO  WS-SIA-REGCTB (SIA).
048700000000           MOVE IS-REG-CTB-CUR-SIGN    TO  WS-SIA-REGCTBSGN (SIA).
048710000607RF7201     MOVE IS-ENTERED-BY          TO  WS-SIA-ENTEREDBY (SIA).
048720000626RF6725     MOVE IS-MAILING-ADDRESS-INDICATOR
048730000626                                       TO  WS-SIA-MAIL-FLAG (SIA).
048740000000           ADD 1                       TO  WS-SIA-LST.
048750000000
048760000000       DPR-0020-0060.
048770991001
048780000000           GO TO DPR-EXIT.
048790000000
048800000000       DPR-0030.
048810000000
048820000000      *****
048830000000      *****    Processing an Account Detail record.  These records will
048840000000      *****    be processed, after the Account Transaction records have
048850000000      *****    been processed, by the LEVEL SUMMARIZATION 1 routine.
048860000000      *****    For now, accumulate the fund market value by currency and
048870000000      *****    store the data.  If the currency cannot be identified, an
048880000000      *****    error message will be printed and the record bypassed.
048890000000      *****    If this occurs, the program should be changed to handle
048900000000      *****    the new currency.  Remember to update the setting of
048910000000      *****    the setting of WS-SC-MAX in INITIAL-LOGIC.
048920000000      *****
048930000000
048940000000           SET SC                      TO  1.
048950000000
048960000000       DPR-0040.
048970991001
048980000000           IF  AD-CURRENCY    IS EQUAL TO  WS-SC-CURRENCY (SC)
048990991001               GO TO DPR-0050
049000991001           END-IF
049010000000
049020000000           IF  SC            IS LESS THAN  WS-SC-MAX
049030000000               SET SC               UP BY  1
049040991001               GO TO DPR-0040
049050991001           END-IF
049060000000
049070000000           MOVE SPACES                 TO  ERROR-LINE-1.
049080000000           SET MSG                     TO  3.
049090000000           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
049100000000           GO TO DPR-EXIT.
049110000000
049120000000       DPR-0050.
049130991001
049140010517R10081*****
049150010517      *****    GIC fund will be reported separately in confirm.
049160010517      *****    But, the values will be accumulated.
049170010517      *****
049180010517
049190010517           INITIALIZE WS-AT-FUND-CODE
049200010517                      WS-PRODUCT-TYPE-RULE.
049210010517
049220010517           MOVE AD-FUND-NO             TO  WS-AT-FUND-CODE.
049230010517
049240010517      *****
049250010517      *****    Search the account type table for the correct
049260010517      *****    account type rule.
049270010517      *****
049280010517
049290010517           SET IC                      TO  1.
049300010517
049310010517       DPR-0050-0010.
049320010517
049330010517           IF  WS-AT-INDUSTRY-CODE    IS EQUAL TO  WS-IC-FUND (IC)
049340010517               GO TO DPR-0050-0020
049350010517           END-IF
049360010517
049370010517           SET IC                   UP BY  1.
049380010517
049390010517           IF  IC     IS NOT GREATER THAN  WS-IC-LST
049400010517               GO TO DPR-0050-0010
049410010517           END-IF.
049420010517
049430010517       DPR-0050-0020.
049440010517
049450010517           MOVE WS-IC-RULE (IC)       TO  WS-PRODUCT-TYPE-RULE.
049460010517
049470010726           IF  WS-STMTVRSN   IS EQUAL TO 4
049480010726               IF WS-PRODUCT-TYPE-RULE  IS EQUAL TO "2" OR "7"
049490010726                  IF AD-BOOK-VALUE-SIGN    IS EQUAL TO  SPACES
049500010726                     ADD AD-BOOK-VALUE-BASE
049510010726                                    TO  WS-SC-MARKET-VALUE-GIC-DII (SC)
049520010726                     ADD AD-BOOK-VALUE-BASE TO  WS-SC-MARKET-VALUE (SC)
049530010726                  ELSE
049540010726                     SUBTRACT AD-BOOK-VALUE-BASE
049550010726                                 FROM WS-SC-MARKET-VALUE-GIC-DII (SC)
049560010726                     SUBTRACT AD-BOOK-VALUE-BASE
049570010726                                 FROM  WS-SC-MARKET-VALUE (SC)
049580010726                  END-IF
049590010726               ELSE
049600010726                  IF AD-MARKET-VALUE-SIGN    IS  EQUAL TO  SPACES
049610010726                     ADD AD-MARKET-VALUE
049620010726                                     TO  WS-SC-MARKET-VALUE-FUND (SC)
049630010726                     ADD AD-MARKET-VALUE  TO  WS-SC-MARKET-VALUE (SC)
049640010726                  ELSE
049650010726                     SUBTRACT AD-MARKET-VALUE
049660010726                                 FROM WS-SC-MARKET-VALUE-FUND (SC)
049670010726                     SUBTRACT AD-MARKET-VALUE
049680010726                                 FROM  WS-SC-MARKET-VALUE (SC)
049690010726                  END-IF
049700010726               END-IF
049710010726               GO TO DPR-0050-0020-0000
049720010726R10081     END-IF
049730010726
049740010726           IF  AD-MARKET-VALUE-SIGN    IS EQUAL TO  SPACES
049750010726               ADD AD-MARKET-VALUE     TO  WS-SC-MARKET-VALUE (SC)
049760010726           ELSE
049770010726               SUBTRACT AD-MARKET-VALUE  FROM  WS-SC-MARKET-VALUE (SC)
049780010726           END-IF.
049790010726
049800010726R10081 DPR-0050-0020-0000.
049810010726
049820000000           MOVE "Y"                    TO  WS-SC-RPTIND (SC).
049830000000
049840000000      *****
049850000000      *****    Format the fund in the Statement Account Fund table.  If
049860000000      *****    the table is full, an error message will be printed and
049870000000      *****    the record bypassed.  If this occurs, the program should
049880000000      *****    be changed to handle more funds for an account.  Remember
049890000000      *****    to update the setting of WS-SAF-MAX in INITIAL-LOGIC.
049900000000      *****
049910000000
049920000000           IF  WS-SAF-LST   NOT LESS THAN  WS-SAF-MAX
049930000000               MOVE SPACES             TO  ERROR-LINE-1
049940000000               SET MSG                 TO  4
049950000000               PERFORM PRINT-ERR-LINE THRU PEL-EXIT
049960991001               GO TO DPR-EXIT
049970991001           END-IF
049980000000
049990000000           ADD 1                       TO  WS-SAF-LST.
050000000000           SET SAF                     TO  WS-SAF-LST.
050010000000           MOVE AD-ACB-UNIT-PRICE      TO  WS-SAF-ACB-UNIT-PRICE (SAF).
050020000000           MOVE AD-ACB-UNIT-PRICE-SIGN TO  WS-SAF-ACB-UNIT-PRICE-SIGN
050030000000                                             (SAF).
050040000000           MOVE AD-CURRENCY            TO  WS-SAF-CURRENCY (SAF).
050050000000           MOVE AD-FUND-NO             TO  WS-SAF-FUND-NO (SAF).
050060000000           MOVE AD-INVESTMENT-NAME     TO  WS-SAF-INVESTMENT-NAME (SAF).
050070000000           MOVE AD-LAST-UNIT-PRICE     TO  WS-SAF-LAST-UNIT-PRICE (SAF).
050080000000           MOVE AD-LAST-UNIT-PRICE-SIGN
050090000000                                       TO  WS-SAF-LAST-UNIT-PRICE-SIGN
050100000000                                             (SAF).
050110000000           MOVE AD-MARKET-VALUE        TO  WS-SAF-MARKET-VALUE (SAF).
050120000000           MOVE AD-MARKET-VALUE-SIGN   TO  WS-SAF-MARKET-VALUE-SIGN
050130000000                                             (SAF).
050140000000           MOVE AD-NO-OF-UNITS         TO  WS-SAF-NO-OF-UNITS (SAF).
050150000000           MOVE AD-NO-OF-UNITS-SIGN    TO  WS-SAF-NO-OF-UNITS-SIGN
050160000000                                             (SAF).
050170010517
050180010517R10081 DPR-0050-0030.
050190010517
050200010517           IF  WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "2"
050210010517           AND WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "7"
050220010517
050230010517               ADD 1                 TO WS-AFD-LST
050240010517               SET AFD               TO WS-AFD-LST
050250010517
050260010517               MOVE ACCOUNT-DETAILS-SECTION
050270010517                                     TO  WS-ACCOUNT-FUND-DETAILS (AFD)
050280010517               MOVE "Y"              TO WS-STMT-DTA-SW-20FUND
050290010517           END-IF
050300010517
050310010517           IF  WS-PRODUCT-TYPE-RULE  IS EQUAL TO "2"
050320010517
050330010517               ADD 1                 TO WS-AGD-LST
050340010517               SET AGD               TO WS-AGD-LST
050350010517
050360010517               MOVE ACCOUNT-DETAILS-SECTION
050370010517                                     TO  WS-ACCOUNT-GIC-DETAILS (AGD)
050380010517               MOVE "Y"              TO WS-STMT-DTA-SW-20GIC
050390010517           END-IF
050400010517
050410010517           IF  WS-PRODUCT-TYPE-RULE  IS EQUAL TO "7"
050420010517               ADD 1                 TO WS-ADID-LST
050430010517               SET ADID              TO WS-ADID-LST
050440010517
050450010517               MOVE ACCOUNT-DETAILS-SECTION
050460010517                                     TO WS-ACCOUNT-DII-DETAILS (ADID)
050470010517               MOVE "Y"              TO WS-STMT-DTA-SW-20DII
050480010517R10081     END-IF
050490010517
050500000000           GO TO DPR-EXIT.
050510010517
050520010517R10081 DPR-0055.
050530010517
050540010517      *****
050550010517      *****    Processing an Account GIC Details record.  Simply
050560010517      *****    indicate that one has been found for the account,
050570010517      *****    then exit.
050580010517      *****
050590010517
050600010517           IF WS-GIC-LST NOT LESS THAN WS-GIC-MAX
050610010517              MOVE SPACES TO ERROR-LINE-1
050620010517              SET MSG     TO 4
050630010517              PERFORM PRINT-ERR-LINE THRU PEL-EXIT
050640010517              GO TO DPR-EXIT
050650010517           END-IF
050660010517
050670010517           ADD 1      TO WS-GIC-LST.
050680010517           SET GIC    TO WS-GIC-LST.
050690010517
050700010517           MOVE ACCOUNT-GIC-DETAILS-SECTION TO  WS-GIC-INFO (GIC).
050710010517           MOVE "Y"                    TO  WS-STMT-DTA-SW-25.
050720010517R10081     GO TO DPR-EXIT.
050730000000
050740000000       DPR-0060.
050750000000
050760000000      *****
050770000000      *****    Processing an Account Transaction record.  These records
050780000000      *****    will be processed using the MLS programming techniques,
050790000000      *****    without the performs.  The current and previous controls
050800000000      *****    have been initialized in the LEVEL REINITIALIZATION 1
050810000000      *****    routine and the records have been read in the GET CURRENT
050820000000      *****    routine.  Therefore, the first step will be to format the
050830000000      *****    current statement transaction controls.
050840000000      *****
050850000000
050860000000           MOVE AT-FUND-NO             TO  CURR-CD-FUND-NO.
050870000000
050880010222      *****
050890010222      *****    GIC transactions will not be reported in confirm.
050900010222      *****
050910010222
050920010222RF8307     INITIALIZE WS-AT-FUND-CODE
050930010222                      WS-PRODUCT-TYPE-RULE.
050940010222
050950010221           MOVE AT-FUND-NO             TO  WS-AT-FUND-CODE.
050960010221
050970010222      *****
050980010222      *****    Search the account type table for the correct
050990010222      *****    account type rule.
051000010222      *****
051010010222
051020010222           SET IC                      TO  1.
051030010222           IF  WS-IC-LST        IS NOT GREATER THAN  ZEROES
051040010222               GO TO DPR-0060-0050
051050010222           END-IF.
051060010222
051070010222       DPR-0060-0010.
051080010222
051090010222           IF  WS-AT-INDUSTRY-CODE    IS EQUAL TO  WS-IC-FUND (IC)
051100010222               GO TO DPR-0060-0020
051110010222           END-IF
051120010222
051130010222           SET IC                   UP BY  1.
051140010222
051150010222           IF  IC     IS NOT GREATER THAN  WS-IC-LST
051160010222               GO TO DPR-0060-0010
051170010222           END-IF.
051180010222
051190010222       DPR-0060-0020.
051200010222
051210010222           MOVE WS-IC-RULE (IC)       TO  WS-PRODUCT-TYPE-RULE.
051220010524
051230010531R10383*****
051240010531      *****    Transactions of Funds and DIIs are under different
051250010531      *****    heading.
051260010531      *****
051270010531
051280010607           IF WS-STMTVRSN           IS EQUAL TO  4
051290010607              IF  WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "7"
051300010607              AND WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "2"
051310010607              AND WS-STMT-DTA-SW-80FUND IS NOT EQUAL TO "Y"
051320011009R11747        AND WS-SH-PGENO           IS NOT GREATER THAN 1
051330010620R10081            SET SPL                     TO  WS-SPL-DTLFST
051340010607                  MOVE WS-SHL04-1 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051350010607                  SET SPL                     UP BY  1
051360010607                  MOVE WS-SHL04-2 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051370010607                  SET SPL                     UP BY  1
051380010607                  MOVE WS-SHL04-3 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051390010607                  SET SPL                     UP BY  1
051400010607                  MOVE WS-SHL04-4 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051410010607                  SET SPL                     UP BY  2
051420010607                  MOVE WS-SHL04-5 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051430010607                  MOVE "Y"                    TO WS-STMT-DTA-SW-80FUND
051440010607              END-IF
051450010531
051460010607              IF  WS-PRODUCT-TYPE-RULE  IS EQUAL TO "7"
051470010607              AND WS-STMT-DTA-SW-80DII  IS NOT EQUAL TO "Y"
051480011009R10081            IF WS-STMT-DTA-SW-80FUND IS NOT EQUAL TO "Y"
051490011009                     SET SPL                  TO  WS-SPL-DTLFST
051500011009R10081            END-IF
051510011009
051520011029R11747            IF WS-SH-PGENO           IS GREATER THAN 1
051530011009R11009               SET SPL                     UP BY  2
051540011203R11972            ELSE
051550011203R11972               SET SPL                     UP BY  2
051560011029                  END-IF
051570011009
051580011009      *****
051590011016                  SET WS-SPL-DTLTST           TO  SPL
051600011016
051610011016                  IF (WS-SPL-DTLTST           +  10)
051620011016                     IS  GREATER THAN  WS-SPL-DTLLST
051630011016                     PERFORM PRINT-STMT-RTN     THRU PSR-EXIT
051640011016                     IF WS-PSRERR-SW  NOT EQUAL TO  SPACES
051650011016                        GO TO DPR-EXIT
051660011016                     END-IF
051670011009R11747*              SET SPL                  UP BY  2
051680011016                  END-IF
051690011009      *****
051700010607                  MOVE WS-SHL04-6 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051710010607                  SET SPL                     UP BY  1
051720010607                  MOVE WS-SHL04-7 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051730010607                  SET SPL                     UP BY  1
051740010607                  MOVE WS-SHL04-8 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051750010607                  SET SPL                     UP BY  1
051760010607                  MOVE WS-SHL04-9 (SHL)       TO  WS-STMTPGE-LNE (SPL)
051770010619                  SET SPL                     UP BY  2
051780010607                  MOVE WS-SHL04-10 (SHL)      TO  WS-STMTPGE-LNE (SPL)
051790011009
051800011016R11747*           IF WS-SH-PGENO           IS GREATER THAN 1
051810011016R11009*              SET SPL                     UP BY 1
051820011016      *           END-IF
051830010607                  MOVE "Y"                    TO WS-STMT-DTA-SW-80DII
051840010607              END-IF
051850010607R10383     END-IF.
051860010222
051870010222           IF WS-PRODUCT-TYPE-RULE  IS EQUAL TO "2"
051880010222              GO TO DPR-EXIT
051890010222           END-IF.
051900010222
051910010222       DPR-0060-0050.
051920010222
051930010222      *****    End RFS8307 in this section
051940010222
051950000000      *****
051960000000      *****    Determine if this is a new FUND being processed for the
051970000000      *****    account.
051980000000      *****
051990000000
052000000000           IF  PREV-CD-LEV1   IS EQUAL TO  CURR-CD-LEV1
052010991001               GO TO DPR-0120
052020991001           END-IF
052030000000
052040000000      *****
052050000000      *****    A new fund is being processed.  If this is the first fund
052060000000      *****    for the account, bypass the summary logic.
052070000000      *****
052080000000
052090000000           IF  PREV-CTLS-DPR  IS EQUAL TO  LOW-VALUES
052100991001               GO TO DPR-0070
052110991001           END-IF
052120000000
052130000000      *****
052140000000      *****    Place the fund summary logic here.  Currently, the only
052150000000      *****    processing required is to print a blank line.  Please
052160000000      *****    note that if the statement page is full, the blank line
052170000000      *****    is not formatted.  The next Account Transaction or the
052180000000      *****    Account Summary will skip to the new page, if required.
052190000000      *****
052200000000
052210000000           IF  SPL           IS LESS THAN  WS-SPL-DTLLST
052220991001               SET SPL              UP BY  1
052230991001           END-IF.
052240000000
052250000000       DPR-0070.
052260000000
052270000000      *****
052280000000      *****    Normally, MLS checks the current controls to determine if
052290000000      *****    processing is complete.  Since the Account Transactions
052300000000      *****    are read in the GET CURRENT RECORD routine, this will be
052310000000      *****    done by the normal MLS and will not be required here.
052320000000      *****    Therefore, place the fund re-initialization logic here.
052330000000      *****    Verify that an Account Detail has been read for the fund.
052340000000      *****    If one has not been, a warning message will be printed
052350000000      *****    and the record will be processed as normal.  If this
052360000000      *****    occurs, the program that creates the Statement Data file
052370000000      *****    should be reviewed.
052380000000      *****
052390000000
052400000000           SET SAF                     TO  1.
052410991001
052420000000           IF  SAF        IS GREATER THAN  WS-SAF-LST
052430991001               GO TO DPR-0090
052440991001           END-IF.
052450991001
052460000000       DPR-0080.
052470990928
052480000000           IF  CURR-CD-FUND-NO   EQUAL TO  WS-SAF-FUND-NO (SAF)
052490991001               GO TO DPR-0100
052500991001           END-IF
052510000000
052520000000           IF  SAF           IS LESS THAN  WS-SAF-LST
052530000000               SET SAF              UP BY  1
052540991001               GO TO DPR-0080
052550991001           END-IF.
052560000000
052570000000       DPR-0090.
052580990928
052590000000           MOVE SPACES                 TO  ERROR-LINE-1.
052600000000           SET MSG                     TO  5.
052610000000           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
052620000000
052630000000       DPR-0100.
052640000000
052650000000      *****
052660000000      *****    Format the Investment Name.  If this line and at least
052670000000      *****    one transaction line cannot be printed on the current
052680000000      *****    page, process this page and start a subsequent page.
052690000000      *****
052700000000
052710000000           MOVE SPACES                 TO  STMT-DTL-01.
052720000000
052730990928           IF WS-STMTVRSN              IS  EQUAL TO  3
052740990928              MOVE AT-INVESTMENT-NAME  TO  SD01V3-INVESTMENT-NAME
052750990929              GO TO DPR-0100-0010
052760990928           END-IF
052770010517
052780010531R10383     IF WS-STMTVRSN              IS  EQUAL TO  4
052790010517              MOVE AT-INVESTMENT-NAME  TO  SD01V4-INVESTMENT-NAME
052800010531              IF AT-CURRENCY NOT = WS-B-CURRENCY
052810010531                 MOVE AT-CURRENCY         TO SD01V4-CURRENCY
052820010531              END-IF
052830010531              GO TO DPR-0100-0010
052840010531R10383     END-IF.
052850990928
052860990929           MOVE AT-INVESTMENT-NAME     TO  SD01-INVESTMENT-NAME.
052870990928
052880980202           IF AT-CURRENCY NOT = WS-B-CURRENCY
052890990928              MOVE AT-CURRENCY         TO SD01-CURRENCY
052900990928           END-IF.
052910990928
052920000000       DPR-0100-0010.
052930990928
052940000000           SET WS-SPL-DTLTST           TO  SPL.
052950990928
052960000000           IF  (WS-SPL-DTLTST           +  3)
052970000000                      IS NOT GREATER THAN  WS-SPL-DTLLST
052980990928               GO TO DPR-0110
052990990928           END-IF
053000990928
053010000000           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
053020990928
053030000000           IF  WS-PSRERR-SW  NOT EQUAL TO  SPACES
053040990928               GO TO DPR-EXIT
053050990928           END-IF.
053060000000
053070000000       DPR-0110.
053080990928
053090990929           IF WS-STMTVRSN              IS EQUAL TO  3
053100990929              SET SPL                  UP BY  1
053110990929           ELSE
053120990929              SET SPL                  UP BY  2
053130990929           END-IF
053140990929
053150000000           MOVE STMT-DTL-01            TO  WS-STMTPGE-LNE (SPL).
053160990928           SET SPL                     UP BY  1.
053170000000
053180000000       DPR-0120.
053190000000
053200000000      *****
053210000000      *****    Place the detail processing logic here.  The Account
053220000000      *****    Transaction record is to be processed depending on the
053230000000      *****    Transaction Type Code.
053240000000      *****
053250000000
053260991008           MOVE SPACES                 TO  STMT-DTL-03.
053270991008           MOVE SPACES                 TO  STMT-DTL-04.
053280991008           MOVE SPACES                 TO  STMT-DTL-05.
053290991012           MOVE SPACES                 TO  STMT-DTL-06.
053300991012           MOVE SPACES                 TO  STMT-DTL-07.
053310991012           MOVE SPACES                 TO  STMT-DTL-08.
053320991012
053330990928           IF  AT-TRANS-TYPE-CODE      IS EQUAL TO  "BFW"
053340990928               GO TO DPR-0130
053350990928           END-IF
053360990928
053370990928           IF  AT-TRANS-TYPE-CODE      IS EQUAL TO  "BCL"
053380990928               GO TO DPR-0130-0010
053390990928           END-IF
053400990928
053410000000           GO TO DPR-0140.
053420000000
053430000000       DPR-0130.
053440000000
053450000000      *****
053460000000      *****    Processing a BALANCE FORWARD transaction.  Format the
053470000000      *****    detail line.
053480000000      *****
053490000000
053500000000           MOVE SPACES                 TO  STMT-DTL-02.
053510010802R10992     MOVE SPACES                 TO  STMT-DTL-15.
053520010802           MOVE ZEROS                  TO  WS-DEDUCTIONS.
053530000000
053540010522R10081     IF WS-STMTVRSN              IS EQUAL TO  4
053550010801R10992        IF  WS-PRODUCT-TYPE-RULE  IS  EQUAL TO "7"
053560010801                MOVE AT-TRANS-TYPE        TO  SD15-TRANS-TYPE
053570010801                MOVE AT-UNIT-BALANCE      TO  SD15-UNIT-BALANCE
053580010801                MOVE AT-UNIT-BALANCE-SIGN TO  SD15-UNIT-BALANCE-SIGN
053590010801                GO TO DPR-0130-0000-0010
053600010801              END-IF
053610010801
053620010522              MOVE WS-SD02-LIT1 (SL)      TO  SD02V4-LIT1
053630010522              MOVE AT-TRANS-TYPE          TO  SD02V4-TRANS-TYPE
053640010522              MOVE AT-NO-OF-UNITS         TO  SD02V4-NO-OF-UNITS
053650010522              MOVE AT-NO-OF-UNITS-SIGN    TO  SD02V4-NO-OF-UNITS-SIGN
053660010522              GO TO DPR-0130-0000-0010
053670010522R10081     END-IF
053680010522
053690990928           IF WS-STMTVRSN              IS EQUAL TO  3
053700990928              MOVE SPACES                 TO  SD02V3-LIT1
053710990928              MOVE AT-TRANS-TYPE          TO  SD02V3-TRANS-TYPE
053720990928              MOVE AT-NO-OF-UNITS         TO  SD02V3-NO-OF-UNITS
053730990928              MOVE AT-NO-OF-UNITS-SIGN    TO  SD02V3-NO-OF-UNITS-SIGN
053740990928              MOVE AT-MKT-VALUE           TO  SD02V3-MKT-VALUE
053750990928              MOVE SPACES                 TO  SD02V3-MKT-VALUE-SIGN
053760990928           ELSE
053770990928              MOVE WS-SD02-LIT1 (SL)      TO  SD02-LIT1
053780990928              MOVE AT-TRANS-TYPE          TO  SD02-TRANS-TYPE
053790990928              MOVE AT-NO-OF-UNITS         TO  SD02-NO-OF-UNITS
053800990928              MOVE AT-NO-OF-UNITS-SIGN    TO  SD02-NO-OF-UNITS-SIGN
053810990928           END-IF.
053820000000
053830000000       DPR-0130-0000-0010.
053840990928
053850000000           GO TO DPR-0150.
053860000000
053870000000       DPR-0130-0010.
053880000000
053890000000      *****
053900000000      *****    Processing a BALANCE CLOSING transaction.  Format the
053910000000      *****    detail line.
053920000000      *****
053930000000
053940000000           MOVE SPACES                 TO  STMT-DTL-02.
053950010802R10992     MOVE SPACES                 TO  STMT-DTL-15.
053960010802           MOVE ZEROS                  TO  WS-DEDUCTIONS.
053970000000
053980010522R10081     IF WS-STMTVRSN              IS EQUAL TO  4
053990010522              MOVE WS-SH-END-DATE         TO  SD02V4-TRADE-DATE
054000010522              MOVE AT-TRANS-TYPE          TO  SD02V4-TRANS-TYPE
054010010615
054020010801R10992        IF  WS-PRODUCT-TYPE-RULE  IS  EQUAL TO "7"
054030010917R11406          MOVE WS-SH-TRADE-DATE     TO  SD15-TRADE-DATE
054040010801                MOVE AT-TRANS-TYPE        TO  SD15-TRANS-TYPE
054050010801                MOVE AT-UNIT-BALANCE      TO  SD15-UNIT-BALANCE
054060010801                MOVE AT-UNIT-BALANCE-SIGN TO  SD15-UNIT-BALANCE-SIGN
054070010801                GO TO DPR-0130-0020
054080010801              END-IF
054090010801
054100010917R11406        MOVE AT-UNIT-PRICE          TO  SD02V4-UNIT-PRICE
054110010917R11406        MOVE AT-UNIT-PRICE-SIGN     TO  SD02V4-UNIT-PRICE-SIGN
054120010615
054130010522              MOVE AT-NO-OF-UNITS         TO  SD02V4-NO-OF-UNITS
054140010522              MOVE AT-NO-OF-UNITS-SIGN    TO  SD02V4-NO-OF-UNITS-SIGN
054150010522              GO TO DPR-0130-0020
054160010522R10081     END-IF.
054170990928
054180990928           IF WS-STMTVRSN              IS EQUAL TO  3
054190990928              MOVE WS-SH-END-DATE-3       TO  SD02V3-TRADE-DATE
054200990928              MOVE AT-TRANS-TYPE          TO  SD02V3-TRANS-TYPE
054210990928              MOVE AT-UNIT-PRICE          TO  SD02V3-UNIT-PRICE
054220990928              MOVE AT-UNIT-PRICE-SIGN     TO  SD02V3-UNIT-PRICE-SIGN
054230990928              MOVE AT-NO-OF-UNITS         TO  SD02V3-NO-OF-UNITS
054240990928              MOVE AT-NO-OF-UNITS-SIGN    TO  SD02V3-NO-OF-UNITS-SIGN
054250990928              MOVE AT-MKT-VALUE           TO  SD02V3-MKT-VALUE
054260991007              MOVE SPACES                 TO  SD02V3-MKT-VALUE-SIGN
054270990928           ELSE
054280991004              MOVE WS-SH-END-DATE         TO  SD02-TRADE-DATE
054290990928              MOVE AT-TRANS-TYPE          TO  SD02-TRANS-TYPE
054300990928              MOVE AT-UNIT-PRICE          TO  SD02-UNIT-PRICE
054310990928              MOVE AT-UNIT-PRICE-SIGN     TO  SD02-UNIT-PRICE-SIGN
054320990928              MOVE AT-NO-OF-UNITS         TO  SD02-NO-OF-UNITS
054330990928              MOVE AT-NO-OF-UNITS-SIGN    TO  SD02-NO-OF-UNITS-SIGN
054340990928           END-IF.
054350000000
054360000000       DPR-0130-0020.
054370990928
054380000000           GO TO DPR-0150.
054390000000
054400000000       DPR-0140.
054410000000
054420000000      *****
054430000000      *****    Processing a transaction other than a BALANCE FORWARD or
054440000000      *****    BALANCE CLOSING.  Format the detail line.
054450000000      *****
054460000000      *****    Please note that the CAPITAL GAIN/LOSS is only being
054470000000      *****    formatted if it is non-zero.  If this does not satisfy
054480000000      *****    the requirements, logic should be added to format this
054490000000      *****    field base on the transaction type.
054500000000      *****
054510000000
054520991103991102     IF WS-AT-RULE (AT1)            IS EQUAL TO "4"
054530991103           AND ( AT-TRANS-TYPE-CODE       IS EQUAL TO "BUY"
054540991103                 OR AT-TRANS-TYPE-CODE    IS EQUAL TO "SEL"
054550991103                 OR AT-TRANS-TYPE-CODE    IS EQUAL TO "TRI"
054560991103                 OR AT-TRANS-TYPE-CODE    IS EQUAL TO "TRO")
054570991103                 MOVE AT-CONTR-REDEMP-DESCRIPTION
054580991103                                          TO AT-TRANS-TYPE
054590991103           END-IF
054600991001
054610991103
054620991103991103     IF WS-LDA-MGMT-COM-CDE         IS  EQUAL TO "CND"
054630991103           AND ( AT-CONTR-REDEMP-CODE     IS  EQUAL TO "MFCCNV")
054640991103                MOVE AT-CONTR-REDEMP-DESCRIPTION
054650991103                                          TO  AT-TRANS-TYPE
054660991103991103     END-IF
054670991103
054680991103           IF WS-STMTVRSN              IS EQUAL TO  3
054690991103              GO TO DPR-0140-0050
054700991103           END-IF
054710991103
054720000000           MOVE ZEROES                 TO  WS-DEDUCTIONS.
054730021227
054740021225
054750991001           IF  AT-COMMISSION-SIGN      IS EQUAL TO  "-"
054760991001               SUBTRACT AT-COMMISSION  FROM  WS-DEDUCTIONS
054770991001           ELSE
054780991001               ADD AT-COMMISSION       TO  WS-DEDUCTIONS
054790991001           END-IF
054800991001
054810001221           IF  AT-DSC-SIGN             IS EQUAL TO  "-"
054820001221               SUBTRACT AT-DSC         FROM  WS-DEDUCTIONS
054830990929           ELSE
054840001221               ADD AT-DSC              TO  WS-DEDUCTIONS
054850991001           END-IF
054860991001
054870000000           IF  AT-TAX-SIGN    IS EQUAL TO  "-"
054880000000               SUBTRACT AT-TAX       FROM  WS-DEDUCTIONS
054890991001           ELSE
054900991001               ADD AT-TAX              TO  WS-DEDUCTIONS
054910991001           END-IF
054920991001
054930010122RF9184     ADD  AT-ADMIN-FEES          TO  WS-DEDUCTIONS.
054940010130RF9298     ADD  AT-GST
054950050402R26894          AT-ERF
054960010130                AT-PST                 TO  WS-DEDUCTIONS.
054970010122
054980000000           IF  WS-DEDUCTIONS IS LESS THAN  ZEROES
054990000000               MOVE "-"                TO  WS-DEDUCTIONS-SIGN
055000991001           ELSE
055010991001               MOVE SPACES             TO  WS-DEDUCTIONS-SIGN
055020991001           END-IF.
055030000000
055040000000       DPR-0140-0050.
055050990928
055060991001           MOVE SPACES                 TO  STMT-DTL-02.
055070010531R10383     MOVE SPACES                 TO  STMT-DTL-15.
055080991001           MOVE AT-TRADE-DATE          TO  WS-TRADE-DATE.
055090991001           MOVE AT-TRADE-DATE          TO  WS-TRADE-DATE-3.
055100991001
055110010531R10383     IF WS-STMTVRSN              IS EQUAL TO  4
055120010531              IF  WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "2"
055130010531              AND WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "7"
055140010531                MOVE WS-SH-TRADE-DATE       TO  SD02V4-TRADE-DATE
055150010531                MOVE AT-TRANS-TYPE          TO  SD02V4-TRANS-TYPE
055160010531                MOVE AT-GROSS               TO  SD02V4-GROSS
055170010531                MOVE AT-GROSS-SIGN          TO  SD02V4-GROSS-SIGN
055180010531                MOVE WS-DEDUCTIONS          TO  SD02V4-DEDUCTIONS
055190010531                MOVE AT-NET                 TO  SD02V4-NET
055200010531                MOVE AT-NET-SIGN            TO  SD02V4-NET-SIGN
055210010531                MOVE AT-UNIT-PRICE          TO  SD02V4-UNIT-PRICE
055220010531                MOVE AT-UNIT-PRICE-SIGN     TO  SD02V4-UNIT-PRICE-SIGN
055230010531                MOVE AT-NO-OF-UNITS         TO  SD02V4-NO-OF-UNITS
055240010531                MOVE AT-NO-OF-UNITS-SIGN    TO  SD02V4-NO-OF-UNITS-SIGN
055250010531                GO TO DPR-0140-9999
055260010531              END-IF
055270010531              IF  WS-PRODUCT-TYPE-RULE  IS  EQUAL TO "7"
055280010531                MOVE WS-SH-TRADE-DATE     TO  SD15-TRADE-DATE
055290010531                MOVE AT-TRANS-TYPE        TO  SD15-TRANS-TYPE
055300010531                MOVE AT-GROSS             TO  SD15-GROSS
055310010531                MOVE AT-GROSS-SIGN        TO  SD15-GROSS-SIGN
055320010531                MOVE WS-DEDUCTIONS        TO  SD15-DEDUCTIONS
055330010531                MOVE AT-NET               TO  SD15-NET
055340010531                MOVE AT-NET-SIGN          TO  SD15-NET-SIGN
055350010531                MOVE AT-UNIT-BALANCE      TO  SD15-UNIT-BALANCE
055360010531                MOVE AT-UNIT-BALANCE-SIGN TO  SD15-UNIT-BALANCE-SIGN
055370010531                GO TO DPR-0140-9999
055380010531              END-IF
055390010531R10383     END-IF.
055400010522
055410990928           IF WS-STMTVRSN              IS EQUAL TO  3
055420990928              MOVE WS-SH-TRADE-DATE-3     TO  SD02V3-TRADE-DATE
055430991103              MOVE AT-TRANS-TYPE          TO  SD02V3-TRANS-TYPE
055440990928              MOVE AT-GROSS               TO  SD02V3-GROSS
055450990928              MOVE AT-GROSS-SIGN          TO  SD02V3-GROSS-SIGN
055460990928              MOVE AT-UNIT-PRICE          TO  SD02V3-UNIT-PRICE
055470990928              MOVE AT-UNIT-PRICE-SIGN     TO  SD02V3-UNIT-PRICE-SIGN
055480990928              MOVE AT-NO-OF-UNITS         TO  SD02V3-NO-OF-UNITS
055490990928              MOVE AT-NO-OF-UNITS-SIGN    TO  SD02V3-NO-OF-UNITS-SIGN
055500990928              MOVE AT-MKT-VALUE           TO  SD02V3-MKT-VALUE
055510990928              MOVE SPACES                 TO  SD02V3-MKT-VALUE-SIGN
055520990928           ELSE
055530991004              MOVE WS-SH-TRADE-DATE       TO  SD02-TRADE-DATE
055540991103              MOVE AT-TRANS-TYPE          TO SD02-TRANS-TYPE
055550990928              MOVE AT-GROSS               TO  SD02-GROSS
055560990928              MOVE AT-GROSS-SIGN          TO  SD02-GROSS-SIGN
055570990928              MOVE WS-DEDUCTIONS          TO  SD02-DEDUCTIONS
055580990928              MOVE AT-NET                 TO  SD02-NET
055590990928              MOVE AT-NET-SIGN            TO  SD02-NET-SIGN
055600991001              MOVE AT-UNIT-PRICE          TO  SD02-UNIT-PRICE
055610990928              MOVE AT-UNIT-PRICE-SIGN     TO  SD02-UNIT-PRICE-SIGN
055620990928              MOVE AT-NO-OF-UNITS         TO  SD02-NO-OF-UNITS
055630990928              MOVE AT-NO-OF-UNITS-SIGN    TO  SD02-NO-OF-UNITS-SIGN
055640990928           END-IF.
055650991001
055660000000       DPR-0140-9999.
055670990928
055680000000           GO TO DPR-0150.
055690000000
055700991008       DPR-0065.
055710991008
055720991008      *****
055730991008      *****    Processing a RESP "BUY" or "SEL" or "TRI" or "TRO"
055740991008      *****    transaction to format the beneficiary detail lines.
055750991008      *****
055760991008
055770991008           MOVE SPACES                 TO  STMT-DTL-03.
055780991008           MOVE SPACES                 TO  STMT-DTL-04.
055790991008           MOVE SPACES                 TO  STMT-DTL-05.
055800991012           MOVE SPACES                 TO  STMT-DTL-06.
055810991012           MOVE SPACES                 TO  STMT-DTL-07.
055820991012           MOVE SPACES                 TO  STMT-DTL-08.
055830991008
055840991012           IF TE-ACCOUNT-BENEFICIARY1         IS NOT EQUAL TO SPACES
055850010607R10383        IF WS-STMTVRSN              IS EQUAL TO  4
055860010607                 MOVE TE-ACCOUNT-BENEFICIARY1   TO  SD03V4-BENEFICIARY1
055870010607                 MOVE TE-PERCENT1                TO  SD03V4-PERCENT1
055880010607                 MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD03V4-PERCENTAGE1
055890010607                 MOVE TE-AMOUNT1                 TO  SD03V4-AMOUNT1
055900010607                 MOVE TE-AMOUNT-SIGN1           TO  SD03V4-AMOUNT-SIGN1
055910010607                 GO TO DPR-0065-0010
055920010607R10383        END-IF
055930991012              IF WS-STMTVRSN              IS EQUAL TO  3
055940991012                 MOVE TE-ACCOUNT-BENEFICIARY1   TO  SD03V3-BENEFICIARY1
055950991012                 MOVE TE-PERCENT1                TO  SD03V3-PERCENT1
055960991012                 MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD03V3-PERCENTAGE1
055970991012                 MOVE TE-AMOUNT1                 TO  SD03V3-AMOUNT1
055980991012                 MOVE TE-AMOUNT-SIGN1            TO SD03V3-AMOUNT-SIGN1
055990991012              ELSE
056000991012                 MOVE TE-ACCOUNT-BENEFICIARY1    TO  SD03-BENEFICIARY1
056010991012                 MOVE TE-PERCENT1                TO  SD03-PERCENT1
056020991012                 MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD03-PERCENTAGE1
056030991012                 MOVE TE-AMOUNT1                 TO  SD03-AMOUNT1
056040991012                 MOVE TE-AMOUNT-SIGN1            TO  SD03-AMOUNT-SIGN1
056050991012              END-IF
056060010607           END-IF.
056070991008
056080010607R10383 DPR-0065-0010.
056090010607
056100991008           IF TE-ACCOUNT-BENEFICIARY2         IS NOT EQUAL TO SPACES
056110010607R10383          IF WS-STMTVRSN              IS EQUAL TO  4
056120010607                MOVE TE-ACCOUNT-BENEFICIARY2  TO  SD04V4-BENEFICIARY2
056130010607                MOVE TE-PERCENT2              TO  SD04V4-PERCENT2
056140010607                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD04V4-PERCENTAGE2
056150010607                MOVE TE-AMOUNT2               TO  SD04V4-AMOUNT2
056160010607                MOVE TE-AMOUNT-SIGN2          TO  SD04V4-AMOUNT-SIGN2
056170010607                GO TO DPR-0065-0020
056180010607R10383        END-IF
056190991008             IF WS-STMTVRSN              IS EQUAL TO  3
056200991008                MOVE TE-ACCOUNT-BENEFICIARY2  TO  SD04V3-BENEFICIARY2
056210991008                MOVE TE-PERCENT2              TO  SD04V3-PERCENT2
056220991008                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD04V3-PERCENTAGE2
056230991008                MOVE TE-AMOUNT2               TO  SD04V3-AMOUNT2
056240991008                MOVE TE-AMOUNT-SIGN2          TO  SD04V3-AMOUNT-SIGN2
056250991008             ELSE
056260991008                MOVE TE-ACCOUNT-BENEFICIARY2  TO  SD04-BENEFICIARY2
056270991008                MOVE TE-PERCENT2              TO  SD04-PERCENT2
056280991008                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD04-PERCENTAGE2
056290991008                MOVE TE-AMOUNT2               TO  SD04-AMOUNT2
056300991008                MOVE TE-AMOUNT-SIGN2          TO  SD04-AMOUNT-SIGN2
056310991008              END-IF
056320010607           END-IF.
056330010607
056340010607R10383 DPR-0065-0020.
056350991008
056360991008           IF TE-ACCOUNT-BENEFICIARY3         IS NOT EQUAL TO SPACES
056370010607R10383       IF WS-STMTVRSN              IS EQUAL TO  4
056380010607                MOVE TE-ACCOUNT-BENEFICIARY3  TO  SD05V4-BENEFICIARY3
056390010607                MOVE TE-PERCENT3              TO  SD05V4-PERCENT3
056400010607                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD05V4-PERCENTAGE3
056410010607                MOVE TE-AMOUNT3               TO  SD05V4-AMOUNT3
056420010607                MOVE TE-AMOUNT-SIGN3          TO  SD05V4-AMOUNT-SIGN3
056430010607                GO TO DPR-0065-0030
056440010607R10383        END-IF
056450991008             IF WS-STMTVRSN              IS EQUAL TO  3
056460991008                MOVE TE-ACCOUNT-BENEFICIARY3  TO  SD05V3-BENEFICIARY3
056470991008                MOVE TE-PERCENT3              TO  SD05V3-PERCENT3
056480991008                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD05V3-PERCENTAGE3
056490991008                MOVE TE-AMOUNT3               TO  SD05V3-AMOUNT3
056500991012                MOVE TE-AMOUNT-SIGN3          TO  SD05V3-AMOUNT-SIGN3
056510991008             ELSE
056520991008                MOVE TE-ACCOUNT-BENEFICIARY3  TO  SD05-BENEFICIARY3
056530991008                MOVE TE-PERCENT3              TO  SD05-PERCENT3
056540991008                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD05-PERCENTAGE3
056550991008                MOVE TE-AMOUNT3               TO  SD05-AMOUNT3
056560991008                MOVE TE-AMOUNT-SIGN3          TO  SD05-AMOUNT-SIGN3
056570010607              END-IF.
056580991012
056590010607R10383 DPR-0065-0030.
056600010607
056610991012           IF TE-ACCOUNT-BENEFICIARY4         IS NOT EQUAL TO SPACES
056620010607R10383       IF WS-STMTVRSN              IS EQUAL TO  4
056630010607                MOVE TE-ACCOUNT-BENEFICIARY4  TO  SD06V4-BENEFICIARY4
056640010607                MOVE TE-PERCENT4              TO  SD06V4-PERCENT4
056650010607                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD06V4-PERCENTAGE4
056660010607                MOVE TE-AMOUNT4               TO  SD06V4-AMOUNT4
056670010607                MOVE TE-AMOUNT-SIGN4          TO  SD06V4-AMOUNT-SIGN4
056680010607                GO TO DPR-0065-0040
056690010607R10383        END-IF
056700991012             IF WS-STMTVRSN              IS EQUAL TO  3
056710991012                MOVE TE-ACCOUNT-BENEFICIARY4  TO  SD06V3-BENEFICIARY4
056720991012                MOVE TE-PERCENT4              TO  SD06V3-PERCENT4
056730991012                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD06V3-PERCENTAGE4
056740991012                MOVE TE-AMOUNT4               TO  SD06V3-AMOUNT4
056750991012                MOVE TE-AMOUNT-SIGN4          TO  SD06V3-AMOUNT-SIGN4
056760991012             ELSE
056770991012                MOVE TE-ACCOUNT-BENEFICIARY4  TO  SD06-BENEFICIARY4
056780991012                MOVE TE-PERCENT4              TO  SD06-PERCENT4
056790991012                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD06-PERCENTAGE4
056800991012                MOVE TE-AMOUNT4               TO  SD06-AMOUNT4
056810991012                MOVE TE-AMOUNT-SIGN4          TO  SD06-AMOUNT-SIGN4
056820010607              END-IF.
056830991012
056840010607R10383 DPR-0065-0040.
056850010607
056860991012           IF TE-ACCOUNT-BENEFICIARY5         IS NOT EQUAL TO SPACES
056870010607R10383       IF WS-STMTVRSN              IS EQUAL TO  4
056880010607                MOVE TE-ACCOUNT-BENEFICIARY5  TO  SD07V4-BENEFICIARY5
056890010607                MOVE TE-PERCENT5              TO  SD07V4-PERCENT5
056900010607                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD07V4-PERCENTAGE5
056910010607                MOVE TE-AMOUNT5               TO  SD07V4-AMOUNT5
056920010607                MOVE TE-AMOUNT-SIGN5          TO  SD07V4-AMOUNT-SIGN5
056930010607                GO TO DPR-0065-0050
056940010607R10383        END-IF
056950991012             IF WS-STMTVRSN              IS EQUAL TO  3
056960991012                MOVE TE-ACCOUNT-BENEFICIARY5  TO  SD07V3-BENEFICIARY5
056970991012                MOVE TE-PERCENT5              TO  SD07V3-PERCENT5
056980991012                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD07V3-PERCENTAGE5
056990991012                MOVE TE-AMOUNT5               TO  SD07V3-AMOUNT5
057000991012                MOVE TE-AMOUNT-SIGN5          TO  SD07V3-AMOUNT-SIGN5
057010991012             ELSE
057020991012                MOVE TE-ACCOUNT-BENEFICIARY5  TO  SD07-BENEFICIARY5
057030991012                MOVE TE-PERCENT5              TO  SD07-PERCENT5
057040991012                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD07-PERCENTAGE5
057050991012                MOVE TE-AMOUNT5               TO  SD07-AMOUNT5
057060991012                MOVE TE-AMOUNT-SIGN5          TO  SD07-AMOUNT-SIGN5
057070010607              END-IF.
057080991012
057090010607R10383 DPR-0065-0050.
057100010607
057110991012           IF TE-ACCOUNT-BENEFICIARY6         IS NOT EQUAL TO SPACES
057120010607R10383       IF WS-STMTVRSN              IS EQUAL TO  4
057130010607                MOVE TE-ACCOUNT-BENEFICIARY6  TO  SD08V4-BENEFICIARY6
057140010607                MOVE TE-PERCENT6              TO  SD08V4-PERCENT6
057150010607                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD08V4-PERCENTAGE6
057160010607                MOVE TE-AMOUNT6               TO  SD08V4-AMOUNT6
057170010607                MOVE TE-AMOUNT-SIGN6          TO  SD08V4-AMOUNT-SIGN6
057180010607                GO TO DPR-0065-0060
057190010607R10383        END-IF
057200991012             IF WS-STMTVRSN              IS EQUAL TO  3
057210991012                MOVE TE-ACCOUNT-BENEFICIARY6  TO  SD08V3-BENEFICIARY6
057220991012                MOVE TE-PERCENT6              TO  SD08V3-PERCENT6
057230991012                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD08V3-PERCENTAGE6
057240991012                MOVE TE-AMOUNT6               TO  SD08V3-AMOUNT6
057250991012                MOVE TE-AMOUNT-SIGN6          TO  SD08V3-AMOUNT-SIGN6
057260991012             ELSE
057270991012                MOVE TE-ACCOUNT-BENEFICIARY6  TO  SD08-BENEFICIARY6
057280991012                MOVE TE-PERCENT6              TO  SD08-PERCENT6
057290991012                MOVE WS-SD03-PERCENTAGE-LIT (SL) TO SD08-PERCENTAGE6
057300991012                MOVE TE-AMOUNT6               TO  SD08-AMOUNT6
057310991012                MOVE TE-AMOUNT-SIGN6          TO  SD08-AMOUNT-SIGN6
057320991012              END-IF
057330991008           END-IF.
057340010607
057350010607R10383 DPR-0065-0060.
057360010607           GO TO DPR-0150.
057370010607
057380000000       DPR-0150.
057390000000
057400000000      *****
057410000000      *****    If the transaction cannot be printed on the current page,
057420000000      *****    process the current page and start a subsequent page.
057430000000      *****                                                            e
057440000000
057450000000           IF SPL IS LESS THAN  WS-SPL-DTLLST
057460991001               GO TO DPR-0160
057470991001           END-IF
057480991001
057490000000           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
057500991001
057510000000           IF  WS-PSRERR-SW  NOT EQUAL TO  SPACES
057520991001               GO TO DPR-EXIT
057530991001           END-IF.
057540991001
057550000000       DPR-0160.
057560010525
057570991008           IF PR-SECTION-NO            IS EQUAL TO 80
057580021223R10383        IF WS-STMTVRSN              IS EQUAL TO  4
057590010607                 IF  WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "2"
057600010607                 AND WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "7"
057610011016                    SET SPL                UP BY  1
057620011005R11747              IF WS-SH-PGENO          IS GREATER THAN 1
057630011005                    AND WS-STMT-DTA-SW-80FUND IS NOT EQUAL TO "Y"
057640011005                       SET SPL                     TO  WS-SPL-DTLFST
057650011005                       MOVE WS-SHL04-1 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057660011005                       SET SPL                UP BY  1
057670011005                       MOVE WS-SHL04-2 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057680011005                       SET SPL                UP BY  1
057690011005                       MOVE WS-SHL04-3 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057700011005                       SET SPL                UP BY  1
057710011005                       MOVE WS-SHL04-4 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057720011005                       SET SPL                UP BY  2
057730011005                       MOVE WS-SHL04-5 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057740011005                       MOVE "Y"               TO WS-STMT-DTA-SW-80FUND
057750011016                       SET SPL                UP BY  2
057760011016                       MOVE STMT-DTL-01       TO  WS-STMTPGE-LNE (SPL)
057770011016                       SET SPL                UP BY  2
057780011005R11747              END-IF
057790011005                  MOVE STMT-DTL-02       TO  WS-STMTPGE-LNE (SPL)
057800011005                  GO TO DPR-0170
057810010607                 END-IF
057820010928
057830010607                 IF  WS-PRODUCT-TYPE-RULE  IS  EQUAL TO "7"
057840010607                    SET SPL                UP BY  1
057850010928R11648              IF WS-SH-PGENO          IS GREATER THAN 1
057860011005R11747              AND WS-STMT-DTA-SW-80DII      IS EQUAL TO "N"
057870011005                       SET SPL                  TO  WS-SPL-DTLFST
057880010928                       MOVE WS-SHL04-6 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057890010928                       SET SPL                     UP BY  1
057900010928                       MOVE WS-SHL04-7 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057910010928                       SET SPL                     UP BY  1
057920010928                       MOVE WS-SHL04-8 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057930010928                       SET SPL                     UP BY  1
057940010928                       MOVE WS-SHL04-9 (SHL)  TO  WS-STMTPGE-LNE (SPL)
057950010928                       SET SPL                     UP BY  2
057960010928                       MOVE WS-SHL04-10 (SHL) TO  WS-STMTPGE-LNE (SPL)
057970010928                       SET SPL                      UP  BY  2
057980011005R11747                 MOVE "Y"          TO  WS-STMT-DTA-SW-80DII
057990011016                       MOVE STMT-DTL-01       TO  WS-STMTPGE-LNE (SPL)
058000011016                       SET SPL                UP BY  2
058010010928R11648              END-IF
058020010928                    MOVE STMT-DTL-15       TO  WS-STMTPGE-LNE (SPL)
058030010607                    GO TO DPR-0170
058040010608                 END-IF
058050010608              END-IF
058060010608R10383     END-IF
058070010608
058080010608           IF PR-SECTION-NO            IS EQUAL TO 80
058090021227R15810        IF WS-STMTVRSN              IS EQUAL TO  5
058100030102  ¦             MOVE  SD02-DEDUCTIONS TO SD02-DEDUCTIONS-EX
058110040514R22291*         MOVE  SPACES TO SD02-DEDUCTIONS
058120040514R22291          MOVE  SPACES TO SD02-DEDUCTIONS-SIGN
058130021228R15810        END-IF
058140010608              SET SPL                     UP BY  1
058150010608              MOVE STMT-DTL-02            TO  WS-STMTPGE-LNE (SPL)
058160021227R15810        IF WS-STMTVRSN              IS EQUAL TO  5
058170030102  ¦             IF SD02-DEDUCTIONS-EX IS NOT EQUAL TO SPACES
058180021219  ¦                PERFORM GET-DEDUCTION-DETAIL-LINES THRU DED-EXIT
058190030102  ¦             END-IF
058200021227R15810        END-IF
058210021219991014        GO TO DPR-0170
058220021219           END-IF
058230991014
058240991014991014     SET SPL                     UP BY 6
058250991014           IF SPL                      IS LESS THAN WS-SPL-DTLLST
058260991014              SET SPL                  DOWN BY 6
058270991014           ELSE
058280991014              PERFORM PRINT-STMT-RTN   THRU PSR-EXIT
058290991014              IF WS-PSRERR-SW          IS NOT EQUAL TO SPACES
058300991014                 GO TO DPR-EXIT
058310991014              END-IF
058320991014991014     END-IF
058330991014
058340991014           IF PR-SECTION-NO            IS EQUAL TO 84
058350991008              IF STMT-DTL-03              IS NOT EQUAL TO SPACES
058360991008                 SET SPL                  UP BY 1
058370991008                 MOVE STMT-DTL-03         TO  WS-STMTPGE-LNE (SPL)
058380991008                 MOVE SPACES              TO STMT-DTL-03
058390991008              END-IF
058400991008
058410991008              IF STMT-DTL-04              IS NOT EQUAL TO SPACES
058420991008                 SET SPL                  UP BY 1
058430991008                 MOVE STMT-DTL-04         TO  WS-STMTPGE-LNE (SPL)
058440991008                 MOVE SPACES              TO STMT-DTL-04
058450991008              END-IF
058460991008
058470991008              IF STMT-DTL-05              IS NOT EQUAL TO SPACES
058480991008                 SET SPL                  UP BY 1
058490991008                 MOVE STMT-DTL-05         TO  WS-STMTPGE-LNE (SPL)
058500991008                 MOVE SPACES              TO STMT-DTL-05
058510991008              END-IF
058520991012
058530991012              IF STMT-DTL-06              IS NOT EQUAL TO SPACES
058540991012                 SET SPL                  UP BY 1
058550991012                 MOVE STMT-DTL-06         TO  WS-STMTPGE-LNE (SPL)
058560991012                 MOVE SPACES              TO STMT-DTL-06
058570991012              END-IF
058580991012
058590991012              IF STMT-DTL-07              IS NOT EQUAL TO SPACES
058600991012                 SET SPL                  UP BY 1
058610991012                 MOVE STMT-DTL-07         TO  WS-STMTPGE-LNE (SPL)
058620991012                 MOVE SPACES              TO STMT-DTL-07
058630991012              END-IF
058640991012
058650991012              IF STMT-DTL-08              IS NOT EQUAL TO SPACES
058660991012                 SET SPL                  UP BY 1
058670991012                 MOVE STMT-DTL-08         TO  WS-STMTPGE-LNE (SPL)
058680991012                 MOVE SPACES              TO STMT-DTL-08
058690991012              END-IF
058700991008           END-IF.
058710991012
058720000000       DPR-0170.
058730000000
058740000000      *****
058750000000      *****    The Account Transaction has been completely processed.
058760000000      *****    Update the previous statement transaction controls and
058770000000      *****    exit.  The next, if any, Account Transaction will be read
058780000000      *****    by the GET CURRENT RECORD routine.
058790000000      *****
058800000000
058810000000           MOVE CURR-CTLS-DPR          TO  PREV-CTLS-DPR.
058820000000
058830991007      **********
058840991007
058850000000       DPR-EXIT.
058860000000           EXIT.
058870991007
058880991007      **********
058890991007
058900000000      /
058910000000       LEVEL-SUMMARY-1.
058920000000
058930000000      ******************************************************************
058940000000      *                                                                *
058950000000      *    L E V E L   S U M M A R I Z A T I O N   1   R O U T I N E   *
058960000000      *                                                                *
058970000000      *        ACCOUNT:                Account                         *
058980000000      *                                                                *
058990000000      ******************************************************************
059000000000
059010971217
059020000000      *****
059030000000      *****    If Account is zeroes, bypass this routine.
059040000000      *****
059050971217
059060000000           IF  PREV-ACCOUNT   IS EQUAL TO  ZEROES
059070971217              GO TO LS1-EXIT.
059080000000
059090000000      *****
059100000000      *****    If an error was detected by the LEVEL REINITIALIZATION 1
059110000000      *****    routine, bypass this routine.
059120000000      *****
059130000000
059140000000           IF  WS-L01BYP-SW   IS EQUAL TO  "Y"
059150000000               GO TO LS1-EXIT.
059160000000
059170980107971218     IF  WS-LDA-SUM-SUPPRESS-FLAG  IS EQUAL TO "Y"
059180980107971218         GO TO LS1-0160-3.
059190971218
059200000000      *****
059210000000      *****    If at least one Account Transaction was formatted, skip a
059220000000      *****    line.
059230000000      *****
059240000000
059250000000           IF  CURR-CTLS-DPR NOT EQUAL TO  LOW-VALUES
059260000000               SET SPL              UP BY  1.
059270000000
059280000000      *****
059290000000      *****    If the account funds and currency totals cannot be
059300000000      *****    formatted on the current page, process the page and start
059310000000      *****    a subsequent page.  But, if the account funds and
059320000000      *****    currency totals cannot be formatted on their own page,
059330000000      *****    complete the current page.
059340000000      *****
059350000000
059360000000           SET WS-SPL-DTLTST           TO  SPL.
059370000000           ADD 4                       TO  WS-SPL-DTLTST.
059380000000           ADD WS-SAF-LST              TO  WS-SPL-DTLTST.
059390000000
059400000000           SET SC                      TO  1.
059410000000
059420000000       LS1-0010.
059430000000           IF  WS-SC-RPTIND (SC) EQUAL TO  "Y"
059440000000               ADD 1                   TO  WS-SPL-DTLTST
059450000000               GO TO LS1-0020.
059460000000
059470000000           IF  SC            IS LESS THAN  WS-SC-MAX
059480000000               SET SC               UP BY  1
059490000000               GO TO LS1-0010.
059500000000
059510000000       LS1-0020.
059520000000           SET SC                      TO  1.
059530000000
059540000000       LS1-0030.
059550000000           IF  WS-SC-RPTIND (SC) EQUAL TO  "Y"
059560000000               ADD 1                   TO  WS-SPL-DTLTST.
059570000000
059580000000           IF  SC            IS LESS THAN  WS-SC-MAX
059590000000               SET SC               UP BY  1
059600000000               GO TO LS1-0030.
059610000000
059620000000           IF  WS-SPL-DTLTST
059630000000                      IS NOT GREATER THAN  WS-SPL-DTLLST
059640000000               GO TO LS1-0050.
059650000000
059660000000           SUBTRACT WS-SPL-DTLFST    FROM  WS-SPL-DTLLST
059670000000                                   GIVING  WS-SPL-DTLMAX.
059680000000           SET WS-SPL                  TO  SPL.
059690000000           SUBTRACT WS-SPL           FROM  WS-SPL-DTLTST.
059700000000           IF  WS-SPL-DTLTST
059710000000                      IS NOT GREATER THAN  WS-SPL-DTLMAX
059720000000               GO TO LS1-0040.
059730000000
059740000000           SET SPL                  UP BY  7.
059750000000           IF  SPL    IS NOT GREATER THAN  WS-SPL-DTLLST
059760000000               SET SPL            DOWN BY  7
059770000000               GO TO LS1-0050.
059780000000
059790000000       LS1-0040.
059800000000           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
059810000000           IF  WS-PSRERR-SW  NOT EQUAL TO  SPACES
059820000000               GO TO LS1-EXIT.
059830000000
059840000000       LS1-0050.
059850000000
059860990329      *****
059870990329      *****    Format message line for MLA to display
059880990329      *****    the user-id who placed the transaction.
059890990329      *****
059900990329
059910990329           IF  WS-STMTVRSN IS EQUAL TO 2
059920990331               MOVE SPACES         TO WS-STATEMENT-PAGE-MESSAGE
059930990331               SET  SPML           TO 1
059940990330               MOVE WS-ENTERED-BY  TO WS-STMTPGE-MSGLNE (SPML)
059950990330               MOVE WS-STMTPGE-MSGLNE (SPML) TO WS-STMTPGE-MSG.
059960990330
059970000000      *****
059980000000      *****    Format statement summary line 1.
059990000000      *****
060000000000
060010000000           MOVE SPACES                 TO  STMT-SUM-01.
060020010517
060030010517R10081     IF WS-STMTVRSN                 IS EQUAL TO 4
060040010522              MOVE WS-SS01V3-4-LIT1 (SL)  TO  SS01V4-LIT1
060050010522              GO TO LS1-0050-0010
060060010517R10081     END-IF
060070000000
060080990928           IF WS-STMTVRSN                 IS EQUAL TO 3
060090990928              MOVE WS-SS01V3-1-LIT1 (SL)  TO  SS01V3-LIT1
060100990928           ELSE
060110990928              MOVE WS-SS01-LIT1 (SL)      TO  SS01-LIT1
060120990928           END-IF.
060130990928
060140000000       LS1-0050-0010.
060150990928
060160010619R10081     IF WS-STMTVRSN              IS EQUAL TO 4
060170010620              IF SPL < WS-SPL-DTLFST
060180010620                 SET SPL TO  WS-SPL-DTLFST
060190010620              END-IF
060200010619              SET SPL                  UP BY  2
060210010619              GO TO LS1-0050-0010-0000
060220010619R10081     END-IF
060230990928           IF WS-STMTVRSN              IS EQUAL TO 3
060240990928              SET SPL                  UP BY  2
060250990928           ELSE
060260990928              SET SPL                  UP BY  3
060270010619           END-IF.
060280990928
060290010619R10081 LS1-0050-0010-0000.
060300010619
060310971203           MOVE STMT-SUM-01         TO  WS-STMTPGE-LNE (SPL).
060320000000
060330000000      *****
060340000000      *****    Format statement summary line 2.
060350990318      *****    DJT use Confirm Version 1.
060360990928      *****    UBS use Confirm Version 3.
060370990928      *****
060380990318
060390000000           MOVE SPACES                 TO  STMT-SUM-02.
060400000000
060410010522R10081     IF  WS-STMTVRSN   IS EQUAL TO 4
060420010522           AND WS-STMT-DTA-SW-20FUND  IS  NOT EQUAL TO "Y"
060430010522                  GO TO LS1-0120-0040
060440010522R10081        END-IF
060450010522
060460990315           IF  WS-STMTVRSN   IS EQUAL TO 1
060470990316               MOVE WS-SS02-LIT0 (SL)      TO  SS02V1-LIT0
060480990316               MOVE WS-SS02-LIT1 (SL)      TO  SS02V1-LIT1
060490990316               MOVE WS-SS02-LIT2 (SL)      TO  SS02V1-LIT2
060500990316               MOVE WS-SS02-LIT3 (SL)      TO  SS02V1-LIT3
060510990928               GO TO LS1-0050-0020
060520990928           END-IF
060530990928
060540990928           IF  WS-STMTVRSN   IS EQUAL TO 3
060550990928               MOVE WS-SS02-LIT1 (SL)      TO  SS02V3-LIT1
060560990928               MOVE WS-SS02-LIT2 (SL)      TO  SS02V3-LIT2
060570990928               MOVE WS-SS02-LIT3 (SL)      TO  SS02V3-LIT3
060580990928               GO TO LS1-0050-0020
060590990928           END-IF
060600010517
060610010517R10081     IF  WS-STMTVRSN   IS EQUAL TO 4
060620010522               MOVE WS-SS02-LIT00 (SL)     TO  SS02V4-LIT00
060630010522               MOVE WS-SS02-LIT0 (SL)      TO  SS02V4-LIT0
060640010522               MOVE WS-SS02-LIT1 (SL)      TO  SS02V4-LIT1
060650010522               MOVE WS-SS02-LIT2 (SL)      TO  SS02V4-LIT2
060660010522               MOVE WS-SS02-LIT3 (SL)      TO  SS02V4-LIT3
060670010522               GO TO LS1-0050-0020
060680010517R10081     END-IF
060690990928
060700000000           MOVE WS-SS02-LIT1 (SL)      TO  SS02-LIT1.
060710000000           MOVE WS-SS02-LIT2 (SL)      TO  SS02-LIT2.
060720000000           MOVE WS-SS02-LIT3 (SL)      TO  SS02-LIT3.
060730000000
060740000000       LS1-0050-0020.
060750990928
060760010726R10992     SET SPL                     UP BY  1.
060770010726           MOVE SPACES                 TO WS-STMTPGE-LNE(SPL).
060780010726           SET SPL                     UP BY  1.
060790010726
060800010726R10992*    SET SPL                     UP BY  2.
060810000000           MOVE STMT-SUM-02            TO  WS-STMTPGE-LNE (SPL).
060820990929
060830000000      *****
060840000000      *****    Format statement summary line 3.
060850000000      *****
060860000000
060870000000           MOVE SPACES                 TO  STMT-SUM-03.
060880000000
060890990315           IF  WS-STMTVRSN   IS EQUAL TO 1
060900990316               MOVE WS-SS03-LIT0 (SL)      TO  SS03V1-LIT0
060910990316               MOVE WS-SS03-LIT1 (SL)      TO  SS03V1-LIT1
060920990316               MOVE WS-SS03-LIT2 (SL)      TO  SS03V1-LIT2
060930990316               MOVE WS-SS03-LIT3 (SL)      TO  SS03V1-LIT3
060940990928               GO TO LS1-0050-0030
060950990928           END-IF
060960990928
060970990928           IF  WS-STMTVRSN   IS EQUAL TO 3
060980990928               MOVE WS-SS03-LIT1 (SL)      TO  SS03V3-LIT1
060990990928               MOVE WS-SS03-LIT2 (SL)      TO  SS03V3-LIT2
061000990928               MOVE WS-SS03-LIT3 (SL)      TO  SS03V3-LIT3
061010990928               GO TO LS1-0050-0030
061020990928           END-IF
061030010517
061040010517R10081     IF  WS-STMTVRSN   IS EQUAL TO 4
061050010517               MOVE WS-SS03-LIT0 (SL)      TO  SS03V4-LIT0
061060010517               MOVE WS-SS03-LIT1 (SL)      TO  SS03V4-LIT1
061070010517               MOVE WS-SS03-LIT2 (SL)      TO  SS03V4-LIT2
061080010517               MOVE WS-SS03-LIT3 (SL)      TO  SS03V4-LIT3
061090010517               GO TO LS1-0050-0030
061100010517R10081     END-IF
061110990928
061120000000           MOVE WS-SS03-LIT1 (SL)      TO  SS03-LIT1.
061130000000           MOVE WS-SS03-LIT2 (SL)      TO  SS03-LIT2.
061140000000           MOVE WS-SS03-LIT3 (SL)      TO  SS03-LIT3.
061150000000
061160000000       LS1-0050-0030.
061170990928
061180000000           SET SPL                  UP BY  1.
061190971211           MOVE STMT-SUM-03         TO  WS-STMTPGE-LNE (SPL).
061200971204           SET SPL                  UP BY  1.
061210971204
061220000000      *****
061230000000      *****    Format statement summary line 4, one line for each fund.
061240000000      *****
061250000000
061260000000           SET SAF                     TO  1.
061270971210           SET SN                      TO  1.
061280971210
061290000000       LS1-0060.
061300990928
061310990928           IF SAF   IS GREATER         THAN  WS-SAF-LST
061320990928              GO TO LS1-0080
061330990928           END-IF
061340990928
061350000000           MOVE SPACES                 TO  STMT-SUM-04.
061360010621
061370010621R10081     IF  WS-STMTVRSN   NOT EQUAL TO  4
061380010621               GO TO LS1-0060-0010
061390010621           END-IF
061400010614
061410010621           INITIALIZE WS-AT-FUND-CODE
061420010614                      WS-PRODUCT-TYPE-RULE.
061430010614
061440010614           MOVE WS-SAF-FUND-NO (SAF)   TO  WS-AT-FUND-CODE.
061450010614
061460010614      *****
061470010614      *****    Search the account type table for the correct
061480010614      *****    account type rule.
061490010614      *****
061500010614
061510010614           SET IC                      TO  1.
061520010614
061530010614       LS1-0060-0001.
061540010614
061550010614           IF  WS-AT-INDUSTRY-CODE    IS EQUAL TO  WS-IC-FUND (IC)
061560010614               GO TO LS1-0060-0002
061570010614           END-IF
061580010614
061590010614           SET IC                   UP BY  1.
061600010614
061610010614           IF  IC     IS NOT GREATER THAN  WS-IC-LST
061620010614               GO TO LS1-0060-0001
061630010614           END-IF.
061640010614
061650010614       LS1-0060-0002.
061660010614
061670010614           MOVE WS-IC-RULE (IC)       TO  WS-PRODUCT-TYPE-RULE.
061680000000
061690010621           IF  WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "2"
061700010614           AND WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "7"
061710010517
061720010518               IF WS-SAF-CURRENCY(SAF) = "CAD"
061730010518                  MOVE WS-SAF-INVESTMENT-NAME (SAF)
061740010517                                       TO  SS04V4-INVESTMENT-NAME
061750010518                  IF WS-SAF-CURRENCY(SAF) NOT = WS-B-CURRENCY
061760010518                     MOVE WS-SAF-CURRENCY(SAF) TO SS04V4-CURRENCY
061770010518                  END-IF
061780010518                  MOVE WS-SAF-ACB-UNIT-PRICE (SAF)
061790010517                                       TO  SS04V4-ACB-UNIT-PRICE
061800010518                  MOVE WS-SAF-ACB-UNIT-PRICE-SIGN (SAF)
061810010517                                       TO  SS04V4-ACB-UNIT-PRICE-SIGN
061820010518                  MOVE WS-SAF-LAST-UNIT-PRICE (SAF)
061830010517                                       TO  SS04V4-LAST-UNIT-PRICE
061840010518                  MOVE WS-SAF-LAST-UNIT-PRICE-SIGN (SAF)
061850010517                                       TO  SS04V4-LAST-UNIT-PRICE-SIGN
061860010518                  MOVE WS-SAF-NO-OF-UNITS (SAF)
061870010517                                       TO  SS04V4-NO-OF-UNITS
061880010518                  MOVE WS-SAF-NO-OF-UNITS-SIGN (SAF)
061890010517                                       TO  SS04V4-NO-OF-UNITS-SIGN
061900010518                  MOVE WS-SAF-MARKET-VALUE (SAF)
061910010517                                       TO  SS04V4-MARKET-VALUE
061920010518                  MOVE WS-SAF-MARKET-VALUE-SIGN (SAF)
061930010517                                       TO  SS04V4-MARKET-VALUE-SIGN
061940010518                  GO TO LS1-0060-9999
061950010518               END-IF
061960010517
061970010518               IF WS-SAF-CURRENCY(SAF) = "USD"
061980010518                  MOVE WS-SAF-INVESTMENT-NAME (SAF)
061990010517                                       TO  W-SS07-INVESTMENT-NAME(SN)
062000010518                  IF WS-SAF-CURRENCY(SAF) NOT = WS-B-CURRENCY
062010010518                     MOVE WS-SAF-CURRENCY(SAF) TO W-SS07-CURRENCY(SN)
062020010518                  END-IF
062030010518                  MOVE WS-SAF-ACB-UNIT-PRICE (SAF)
062040010518                                   TO  W-SS07-ACB-UNIT-PRICE(SN)
062050010518                  MOVE WS-SAF-ACB-UNIT-PRICE-SIGN (SAF)
062060010517                                   TO  W-SS07-ACB-UNIT-PRICE-SIGN(SN)
062070010518                  MOVE WS-SAF-LAST-UNIT-PRICE (SAF)
062080010517                                   TO  W-SS07-LAST-UNIT-PRICE(SN)
062090010518                  MOVE WS-SAF-LAST-UNIT-PRICE-SIGN (SAF)
062100010518                                   TO  W-SS07-LAST-UNIT-PRICE-SIGN(SN)
062110010518                  MOVE WS-SAF-NO-OF-UNITS (SAF)
062120010518                                   TO  W-SS07-NO-OF-UNITS(SN)
062130010518                  MOVE WS-SAF-NO-OF-UNITS-SIGN (SAF)
062140010518                                   TO  W-SS07-NO-OF-UNITS-SIGN(SN)
062150010518                  MOVE WS-SAF-MARKET-VALUE (SAF)
062160010518                                   TO  W-SS07-MARKET-VALUE(SN)
062170010518                  MOVE WS-SAF-MARKET-VALUE-SIGN (SAF)
062180010518                                   TO  W-SS07-MARKET-VALUE-SIGN(SN)
062190010518                  SET SN                  UP BY 1
062200010518                  GO TO LS1-0070-1
062210010518               END-IF
062220010621           END-IF.
062230010621
062240010621R10081 LS1-0060-0010.
062250010517
062260990315           IF  WS-STMTVRSN   NOT EQUAL TO  1
062270990928               GO TO LS1-0060-0050
062280990928           END-IF
062290990928
062300990315           IF WS-SAF-CURRENCY(SAF) = "CAD"
062310990928              MOVE WS-SAF-INVESTMENT-NAME (SAF)
062320990315                                       TO  SS04V1-INVESTMENT-NAME
062330990928              IF WS-SAF-CURRENCY(SAF) NOT = WS-B-CURRENCY
062340990928                 MOVE WS-SAF-CURRENCY(SAF) TO SS04V1-CURRENCY
062350990928              END-IF
062360990928              MOVE WS-SAF-ACB-UNIT-PRICE (SAF)
062370990315                                       TO  SS04V1-ACB-UNIT-PRICE
062380990928              MOVE WS-SAF-ACB-UNIT-PRICE-SIGN (SAF)
062390990315                                       TO  SS04V1-ACB-UNIT-PRICE-SIGN
062400990928              MOVE WS-SAF-LAST-UNIT-PRICE (SAF)
062410990315                                       TO  SS04V1-LAST-UNIT-PRICE
062420990928              MOVE WS-SAF-LAST-UNIT-PRICE-SIGN (SAF)
062430990315                                       TO  SS04V1-LAST-UNIT-PRICE-SIGN
062440990928              MOVE WS-SAF-NO-OF-UNITS (SAF)
062450990315                                       TO  SS04V1-NO-OF-UNITS
062460990928              MOVE WS-SAF-NO-OF-UNITS-SIGN (SAF)
062470990315                                       TO  SS04V1-NO-OF-UNITS-SIGN
062480990928              MOVE WS-SAF-MARKET-VALUE (SAF)
062490990315                                       TO  SS04V1-MARKET-VALUE
062500990928              MOVE WS-SAF-MARKET-VALUE-SIGN (SAF)
062510990317                                       TO  SS04V1-MARKET-VALUE-SIGN
062520990928              GO TO LS1-0060-9999
062530990928           END-IF
062540990928
062550990315           IF WS-SAF-CURRENCY(SAF) = "USD"
062560990928              MOVE WS-SAF-INVESTMENT-NAME (SAF)
062570990315                                       TO  W-SS07-INVESTMENT-NAME(SN)
062580990928              IF WS-SAF-CURRENCY(SAF) NOT = WS-B-CURRENCY
062590990928                 MOVE WS-SAF-CURRENCY(SAF) TO W-SS07-CURRENCY(SN)
062600990928              END-IF
062610990928              MOVE WS-SAF-ACB-UNIT-PRICE (SAF)
062620990928                                  TO  W-SS07-ACB-UNIT-PRICE(SN)
062630990928              MOVE WS-SAF-ACB-UNIT-PRICE-SIGN (SAF)
062640990316                                   TO  W-SS07-ACB-UNIT-PRICE-SIGN(SN)
062650990928              MOVE WS-SAF-LAST-UNIT-PRICE (SAF)
062660990316                                   TO  W-SS07-LAST-UNIT-PRICE(SN)
062670990928              MOVE WS-SAF-LAST-UNIT-PRICE-SIGN (SAF)
062680990316                                 TO  W-SS07-LAST-UNIT-PRICE-SIGN(SN)
062690990928              MOVE WS-SAF-NO-OF-UNITS (SAF)
062700990316                                 TO  W-SS07-NO-OF-UNITS(SN)
062710990928              MOVE WS-SAF-NO-OF-UNITS-SIGN (SAF)
062720990316                                 TO  W-SS07-NO-OF-UNITS-SIGN(SN)
062730990928              MOVE WS-SAF-MARKET-VALUE (SAF)
062740990316                                 TO  W-SS07-MARKET-VALUE(SN)
062750990928              MOVE WS-SAF-MARKET-VALUE-SIGN (SAF)
062760990316                                 TO  W-SS07-MARKET-VALUE-SIGN(SN)
062770990315               SET SN                  UP BY 1
062780990315               GO TO LS1-0070-1
062790990315           END-IF.
062800990315
062810000000       LS1-0060-0050.
062820971211
062830990928           IF  WS-STMTVRSN   NOT EQUAL TO  3
062840990928               GO TO LS1-0060-0060
062850990928           END-IF
062860990928
062870971210           IF WS-SAF-CURRENCY(SAF) = "CAD"
062880990928              MOVE WS-SAF-INVESTMENT-NAME (SAF)
062890990928                                       TO  SS04V3-INVESTMENT-NAME
062900990928              MOVE WS-SAF-LAST-UNIT-PRICE (SAF)
062910990928                                       TO  SS04V3-LAST-UNIT-PRICE
062920990928              MOVE WS-SAF-LAST-UNIT-PRICE-SIGN (SAF)
062930990928                                       TO  SS04V3-LAST-UNIT-PRICE-SIGN
062940990928              MOVE WS-SAF-NO-OF-UNITS (SAF)
062950990928                                       TO  SS04V3-NO-OF-UNITS
062960990928              MOVE WS-SAF-NO-OF-UNITS-SIGN (SAF)
062970990928                                       TO  SS04V3-NO-OF-UNITS-SIGN
062980990928              MOVE WS-SAF-MARKET-VALUE (SAF)
062990990928                                       TO  SS04V3-MARKET-VALUE
063000990928              MOVE WS-SAF-MARKET-VALUE-SIGN (SAF)
063010990928                                       TO  SS04V3-MARKET-VALUE-SIGN
063020990928              GO TO LS1-0060-9999
063030990928           END-IF
063040990928
063050971211           IF WS-SAF-CURRENCY(SAF) = "USD"
063060990928              MOVE WS-SAF-INVESTMENT-NAME (SAF)
063070990930                                       TO  W-SS07-INVESTMENT-NAME(SN)
063080990928              IF WS-SAF-CURRENCY(SAF) NOT = WS-B-CURRENCY
063090990930                 MOVE WS-SAF-CURRENCY(SAF) TO W-SS07-CURRENCY(SN)
063100990928              END-IF
063110980202
063120990928              MOVE WS-SAF-LAST-UNIT-PRICE (SAF)
063130990930                                       TO  W-SS07-LAST-UNIT-PRICE(SN)
063140990928              MOVE WS-SAF-LAST-UNIT-PRICE-SIGN (SAF)
063150990930                                 TO  W-SS07-LAST-UNIT-PRICE-SIGN(SN)
063160990928              MOVE WS-SAF-NO-OF-UNITS (SAF)
063170990930                                       TO  W-SS07-NO-OF-UNITS(SN)
063180990928              MOVE WS-SAF-NO-OF-UNITS-SIGN (SAF)
063190990930                                    TO  W-SS07-NO-OF-UNITS-SIGN(SN)
063200990928              MOVE WS-SAF-MARKET-VALUE (SAF)
063210990930                                       TO  W-SS07-MARKET-VALUE(SN)
063220990928              MOVE WS-SAF-MARKET-VALUE-SIGN (SAF)
063230990930                                   TO  W-SS07-MARKET-VALUE-SIGN(SN)
063240990928              SET SN                   UP BY 1
063250990928              GO TO LS1-0070-1
063260971211           END-IF.
063270971210
063280990928       LS1-0060-0060.
063290990928
063300010615R10404     IF  WS-STMTVRSN   IS  EQUAL TO  4
063310010615               SET SAF                  UP BY  1
063320010615               GO TO LS1-0060
063330010615           END-IF
063340010615
063350990928           IF WS-SAF-CURRENCY(SAF) = "CAD"
063360990928              MOVE WS-SAF-INVESTMENT-NAME (SAF)
063370990928                                       TO  SS04-INVESTMENT-NAME
063380990928              IF WS-SAF-CURRENCY(SAF) NOT = WS-B-CURRENCY
063390990928                 MOVE WS-SAF-CURRENCY(SAF) TO SS04-CURRENCY
063400990928              END-IF
063410990928
063420990928              MOVE WS-SAF-LAST-UNIT-PRICE (SAF)
063430990928                                       TO  SS04-LAST-UNIT-PRICE
063440990928              MOVE WS-SAF-LAST-UNIT-PRICE-SIGN (SAF)
063450990928                                       TO  SS04-LAST-UNIT-PRICE-SIGN
063460990928              MOVE WS-SAF-NO-OF-UNITS (SAF)
063470990928                                       TO  SS04-NO-OF-UNITS
063480990928              MOVE WS-SAF-NO-OF-UNITS-SIGN (SAF)
063490990928                                       TO  SS04-NO-OF-UNITS-SIGN
063500990928              MOVE WS-SAF-MARKET-VALUE (SAF)
063510990928                                       TO  SS04-MARKET-VALUE
063520990928              MOVE WS-SAF-MARKET-VALUE-SIGN (SAF)
063530990928                                       TO  SS04-MARKET-VALUE-SIGN
063540990928           END-IF
063550990928
063560990928           IF WS-SAF-CURRENCY(SAF) = "USD"
063570990928              MOVE WS-SAF-INVESTMENT-NAME (SAF)
063580990928                                       TO  W-SS07-INVESTMENT-NAME(SN)
063590990928              IF WS-SAF-CURRENCY(SAF) NOT = WS-B-CURRENCY
063600990928                 MOVE WS-SAF-CURRENCY(SAF) TO W-SS07-CURRENCY(SN)
063610990928              END-IF
063620990928
063630990928              MOVE WS-SAF-LAST-UNIT-PRICE (SAF)
063640990928                                       TO  W-SS07-LAST-UNIT-PRICE(SN)
063650990928              MOVE WS-SAF-LAST-UNIT-PRICE-SIGN (SAF)
063660990928                                    TO  W-SS07-LAST-UNIT-PRICE-SIGN(SN)
063670990928              MOVE WS-SAF-NO-OF-UNITS (SAF)
063680990928                                       TO  W-SS07-NO-OF-UNITS(SN)
063690990928              MOVE WS-SAF-NO-OF-UNITS-SIGN (SAF)
063700990928                                       TO  W-SS07-NO-OF-UNITS-SIGN(SN)
063710990928              MOVE WS-SAF-MARKET-VALUE (SAF)
063720990928                                       TO  W-SS07-MARKET-VALUE(SN)
063730990928              MOVE WS-SAF-MARKET-VALUE-SIGN (SAF)
063740990928                                       TO  W-SS07-MARKET-VALUE-SIGN(SN)
063750990928              SET SN                  UP BY 1
063760990928              GO TO LS1-0070-1
063770990928           END-IF.
063780990928
063790000000       LS1-0060-9999.
063800990928
063810971210           IF  SPL                  IS LESS THAN  WS-SPL-DTLLST
063820971204               SET SPL              UP BY  1
063830990928               GO TO LS1-0070
063840990928           END-IF
063850990928
063860000000           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
063870990928
063880000000           IF  WS-PSRERR-SW  NOT EQUAL TO  SPACES
063890990928               GO TO LS1-EXIT
063900990928           END-IF.
063910000000
063920000000       LS1-0070.
063930990928
063940971210           MOVE STMT-SUM-04         TO  WS-STMTPGE-LNE (SPL).
063950000000
063960971211       LS1-0070-1.
063970990928
063980000000           SET SAF                  UP BY  1.
063990000000           GO TO LS1-0060.
064000000000
064010000000       LS1-0080.
064020000000
064030000000      *****
064040000000      *****    If the currency totals cannot be formatted on the current
064050000000      *****    page, process the page and start a subsequent one, do not
064060000000      *****    print summary line 5.
064070000000      *****
064080000000
064090000000           SET WS-SPL-DTLTST           TO  SPL.
064100000000           SET SC                      TO  1.
064110000000
064120000000       LS1-0090.
064130990928
064140990928           IF WS-SC-RPTIND (SC) EQUAL TO  "Y"
064150990928              ADD 2                   TO  WS-SPL-DTLTST
064160990928              GO TO LS1-0100
064170990928           END-IF
064180990928
064190990928           IF SC            IS LESS THAN  WS-SC-MAX
064200990928              SET SC                  UP BY  1
064210990928              GO TO LS1-0090
064220990928           END-IF
064230000000
064240000000      *****
064250000000      *****    There are no currency total lines to be printed.
064260000000      *****
064270000000
064280971212           GO TO LS1-0160-3.
064290000000
064300000000       LS1-0100.
064310990928
064320000000           IF  SC        IS NOT LESS THAN  WS-SC-MAX
064330000000               GO TO LS1-0110.
064340000000
064350000000           SET SC                   UP BY  1.
064360000000           IF  WS-SC-RPTIND (SC) EQUAL TO  "Y"
064370000000               ADD 1                   TO  WS-SPL-DTLTST.
064380000000           GO TO LS1-0100.
064390000000
064400000000       LS1-0110.
064410990928
064420991002           IF  WS-SPL-DTLTST    IS NOT GREATER THAN  WS-SPL-DTLLST
064430991002               GO TO LS1-0120
064440991002           END-IF
064450991002
064460000000           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
064470990928
064480991002           IF  WS-PSRERR-SW           IS  NOT EQUAL TO  SPACES
064490991002               GO TO LS1-EXIT
064500991002           END-IF
064510000000
064520010622R10081*    GO TO LS1-0130.
064530010622R10081     GO TO LS1-0120-0020.
064540000000
064550000000       LS1-0120.
064560000000
064570000000      *****
064580000000      *****    Format statement summary line 5.
064590000000      *****
064600000000
064610000000           MOVE SPACES                 TO  STMT-SUM-05.
064620990929
064630010517R10081     IF WS-STMTVRSN              IS EQUAL TO  4
064640010519              MOVE SPACES              TO  SS05V4-LIT1
064650010522              GO TO LS1-0120-0010
064660010517R10081     END-IF
064670010517
064680990928           IF WS-STMTVRSN              IS EQUAL TO  3
064690990929              MOVE WS-SS05V3-1-LIT1 (SL)  TO  SS05V3-LIT1
064700990928           ELSE
064710990928              MOVE WS-SS05-LIT1 (SL)      TO  SS05-LIT1
064720990928           END-IF.
064730000000
064740000000       LS1-0120-0010.
064750990928
064760990928           SET SPL                     UP BY  1.
064770000000           MOVE STMT-SUM-05            TO  WS-STMTPGE-LNE (SPL).
064780000000
064790010517R10081 LS1-0120-0020.
064800010517
064810010517      ****
064820010517      ****    Format statement summary line 5A.
064830010517      ****
064840010517
064850010517           MOVE SPACES                 TO  STMT-SUM-05A.
064860010517
064870010517           SET SC                      TO  1.
064880010517
064890010517       LS1-0120-0020-0010.
064900010517
064910010517           IF  SC         IS GREATER THAN  WS-SC-MAX
064920010517               GO TO LS1-0120-0040
064930010517           END-IF
064940010517
064950010517           IF  WS-SC-RPTIND (SC) EQUAL TO  "N"
064960010517               SET SC                   UP BY  1
064970010517               GO TO LS1-0120-0020-0010
064980010517           END-IF.
064990010517
065000010517           IF SC IS EQUAL TO 1
065010010517              IF WS-STMTVRSN              IS EQUAL TO  4
065020010518                     MOVE WS-SS05A-LIT1 (SL)  TO  SS05A-LIT1
065030010518                     MOVE WS-SC-MARKET-VALUE-FUND (SC)
065040010517                                       TO SS05A-MARKET-VALUE
065050010518              ELSE
065060010518                 GO TO LS1-0130
065070010517              END-IF
065080010517           END-IF.
065090010517
065100010517           IF SC IS EQUAL TO 2
065110010517              IF WS-STMTVRSN              IS EQUAL TO  4
065120010518                     MOVE WS-SS05A-LIT1 (SL)  TO  SS05A-LIT1
065130010518                     MOVE WS-SC-MARKET-VALUE-FUND (SC)
065140010518                                       TO SS05A-MARKET-VALUE
065150010518              ELSE
065160010518                 GO TO LS1-0130
065170010518              END-IF
065180010517           END-IF.
065190010517
065200010517       LS1-0120-0030.
065210010517           SET SPL                     UP BY  1.
065220010517           MOVE STMT-SUM-05A           TO  WS-STMTPGE-LNE (SPL).
065230010517
065240010517      ****
065250010517      ****    Line 5B to 5G are for GIC/DII. If no GIC and no DII
065260010517      ****    these lines will not reported.
065270010517      ****
065280010517
065290010517       LS1-0120-0040.
065300010517
065310010517      ****
065320010517      ****    Format statement summary line 5B.
065330010517      ****
065340010618
065350011010           SET SPL                UP BY 5.
065360010618
065370011204R11972     MOVE "N"               TO WS-STMT-SUM-05A.
065380011204
065390010619           IF SPL IS LESS THAN WS-SPL-DTLLST
065400010619              SET SPL             DOWN BY 5
065410010619           ELSE
065420011204R11972        MOVE "Y"               TO WS-STMT-SUM-05A
065430010619              PERFORM PRINT-STMT-RTN  THRU PSR-EXIT
065440010619              IF WS-PSRERR-SW NOT EQUAL TO SPACES
065450010619                 GO TO LS1-EXIT
065460010619              END-IF
065470011010
065480011010R11747*****
065490011010      ***** If Summay Section can not be in one page, the Summay
065500011010      ***** Header need to be reported on the next page.
065510011010      *****
065520011009
065530011009      *****
065540011009      *****    Format statement summary line 1.
065550011009      *****
065560011009
065570011010              MOVE SPACES                 TO  STMT-SUM-01
065580011009
065590011010              IF WS-STMTVRSN              IS EQUAL TO 4
065600011010                 MOVE WS-SS01V3-4-LIT1 (SL)  TO  SS01V4-LIT1
065610011010              END-IF
065620011009
065630011010              MOVE STMT-SUM-01            TO  WS-STMTPGE-LNE (SPL)
065640011009
065650011009      *****
065660011009      *****    Format statement summary line 2.
065670011009      *****
065680011009
065690011204R11972        IF WS-STMT-SUM-05A          IS EQUAL TO "Y"
065700011204                 SET SPL                  DOWN  BY  1
065710011204                 GO TO LS1-0120-0045
065720011204R11972        END-IF
065730011204
065740011010              MOVE SPACES                 TO  STMT-SUM-02
065750011009
065760011010              MOVE WS-SS02-LIT00 (SL)     TO  SS02V4-LIT00
065770011010              MOVE WS-SS02-LIT0 (SL)      TO  SS02V4-LIT0
065780011010              MOVE WS-SS02-LIT1 (SL)      TO  SS02V4-LIT1
065790011010              MOVE WS-SS02-LIT2 (SL)      TO  SS02V4-LIT2
065800011010              MOVE WS-SS02-LIT3 (SL)      TO  SS02V4-LIT3
065810011009
065820011010              SET SPL                     UP BY  2
065830011010              MOVE STMT-SUM-02            TO  WS-STMTPGE-LNE (SPL)
065840011009
065850011009      *****
065860011009      *****    Format statement summary line 3.
065870011009      *****
065880011009
065890011010              MOVE SPACES                 TO  STMT-SUM-03
065900011009
065910011010              MOVE WS-SS03-LIT0 (SL)      TO  SS03V4-LIT0
065920011010              MOVE WS-SS03-LIT1 (SL)      TO  SS03V4-LIT1
065930011010              MOVE WS-SS03-LIT2 (SL)      TO  SS03V4-LIT2
065940011010              MOVE WS-SS03-LIT3 (SL)      TO  SS03V4-LIT3
065950011009
065960011010              SET SPL                     UP BY  1
065970011010              MOVE STMT-SUM-03            TO  WS-STMTPGE-LNE (SPL)
065980011010
065990011010R11747***** End of RFS11747
066000011009
066010011009              SET SPL             UP BY 2
066020011009              MOVE SPACES         TO  WS-STMTPGE-LNE (SPL)
066030011009              SET SPL             UP BY 3
066040011009              MOVE SPACES         TO  WS-STMTPGE-LNE (SPL)
066050011009              SET SPL             DOWN BY 5
066060010619R10081     END-IF.
066070010517
066080011204R11972 LS1-0120-0045.
066090011204
066100010518           IF  WS-STMT-DTA-SW-25    IS NOT EQUAL TO "Y"
066110010518           AND WS-STMT-DTA-SW-20GIC IS NOT EQUAL TO "Y"
066120010518           AND WS-STMT-DTA-SW-20DII IS NOT EQUAL TO "Y"
066130010518               GO TO LS1-0130
066140010518           END-IF
066150010517
066160010518              MOVE SPACES                  TO  STMT-SUM-05B.
066170010518              MOVE WS-SS05B-LIT00 (SL)     TO  SS05B-LIT00.
066180010518              MOVE WS-SS05B-LIT0  (SL)     TO  SS05B-LIT0.
066190010518              MOVE WS-SS05B-LIT1  (SL)     TO  SS05B-LIT1.
066200010518              MOVE WS-SS05B-LIT2  (SL)     TO  SS05B-LIT2.
066210010518              MOVE WS-SS05B-LIT3  (SL)     TO  SS05B-LIT3.
066220010518              MOVE WS-SS05B-LIT4  (SL)     TO  SS05B-LIT4.
066230010517
066240010517       LS1-0120-0050.
066250010517
066260010620           SET SPL                     UP BY  3.
066270010517           MOVE STMT-SUM-05B           TO  WS-STMTPGE-LNE (SPL).
066280010517
066290010517       LS1-0120-0060.
066300010517
066310010517      ****
066320010517      ****     Format statement summary line 5C
066330010517      ****
066340010517
066350010518              MOVE SPACES                  TO  STMT-SUM-05C.
066360010518              MOVE WS-SS05C-LIT1 (SL)      TO  SS05C-LIT1.
066370010518              MOVE WS-SS05C-LIT2 (SL)      TO  SS05C-LIT2.
066380010518              MOVE WS-SS05C-LIT3 (SL)      TO  SS05C-LIT3.
066390010517
066400010517       LS1-0120-0070.
066410010517
066420010517           SET SPL                     UP BY  1.
066430010517           MOVE STMT-SUM-05C           TO  WS-STMTPGE-LNE (SPL).
066440010517           SET SPL                     UP BY  1.
066450010517
066460010517       LS1-0120-0080.
066470010517
066480010517      ***
066490010517      ****     Format statement summary line 5D.
066500010517      ***
066510010517
066520010517           IF  WS-STMT-DTA-SW-25    IS NOT EQUAL TO "Y"
066530010517           AND WS-STMT-DTA-SW-20GIC IS NOT EQUAL TO "Y"
066540010517               GO TO LS1-0120-0100
066550010517           END-IF.
066560010517
066570010517           SET GIC                 TO  1.
066580010517
066590010517       LS1-0120-0080-0010.
066600010517
066610010726R10992     SET SPL                     UP BY  1.
066620010726
066630010517           SET AGD                 TO  1.
066640010517           IF GIC    IS GREATER THAN   WS-GIC-LST
066650010517               GO TO LS1-0120-0100
066660010517           END-IF.
066670010517
066680010517           INITIALIZE ACCOUNT-GIC-DETAILS-SECTION.
066690010517           MOVE WS-GIC-INFO (GIC) TO ACCOUNT-GIC-DETAILS-SECTION.
066700010517
066710010517       LS1-0120-0080-0020.
066720010517
066730010517           IF AGD     IS GREATER THAN   WS-AGD-MAX
066740010517              SET AGD                 TO 1
066750010517              INITIALIZE ACCOUNT-DETAILS-SECTION
066760010517              MOVE  WS-ACCOUNT-GIC-DETAILS (AGD)
066770010517                                      TO ACCOUNT-DETAILS-SECTION
066780010517              GO TO LS1-0120-0090-0010
066790010517           END-IF.
066800010517
066810010517           INITIALIZE ACCOUNT-DETAILS-SECTION
066820010517           MOVE  WS-ACCOUNT-GIC-DETAILS (AGD)
066830010517                                   TO ACCOUNT-DETAILS-SECTION
066840010517
066850010517           INITIALIZE WS-AT-FUND-CODE.
066860010517           MOVE AD-FUND-NO             TO  WS-AT-FUND-CODE.
066870010517
066880010517           IF AG-FUND-NO OF ACCOUNT-GIC-DETAILS-SECTION  IS NOT EQUAL
066890010517                            TO WS-AT-INDUSTRY-CODE
066900010517              SET AGD   UP BY 1
066910010517              GO TO LS1-0120-0080-0020
066920010517           END-IF.
066930010517
066940010615              INITIALIZE             STMT-SUM-05D
066950010615                                     WS-ACTUAL-CAPITAL.
066960010615
066970010518              MOVE AG-CERTIFICATE-NO TO SS05D-CERTIFICATE-NO.
066980010518              MOVE AG-RATE           TO SS05D-RATE.
066990010608R10383        MOVE WS-SD03-PERCENTAGE-LIT (SL)
067000010608R10383                               TO SS05D-PERCENTAGE-LIT.
067010010518              MOVE AG-TERM           TO SS05D-TERM.
067020010518              MOVE AG-ISSUED-DATE    TO SS05D-ISSUE-DATE.
067030010518              MOVE AG-MATURITY-DATE  TO SS05D-MATURITY-DATE.
067040010726R10992*       ADD  AG-ACCRUED-INTEREST  TO WS-ACTUAL-CAPITAL.
067050010726R10992*       ADD  AG-BALANCE           TO WS-ACTUAL-CAPITAL.
067060010726R10992*       MOVE WS-ACTUAL-CAPITAL TO SS05D-ACTUAL-CAPITAL.
067070010726R10992        MOVE AG-BALANCE        TO SS05D-ACTUAL-CAPITAL.
067080010517
067090010517       LS1-0120-0090.
067100010517
067110010517           SET SPL                     UP BY  1.
067120010726
067130010726R10992     IF SPL IS LESS THAN WS-SPL-DTLLST
067140010726              SET SPL                   DOWN BY  1
067150010726           ELSE
067160010726              PERFORM PRINT-STMT-RTN   THRU PSR-EXIT
067170010726              IF WS-PSRERR-SW          IS NOT EQUAL TO SPACES
067180010726                 GO TO LS1-EXIT
067190010726              END-IF
067200010726
067210010726              SET SPL                   UP BY 3
067220010726
067230010726              MOVE SPACES                  TO  STMT-SUM-05B
067240010726              MOVE WS-SS05B-LIT00 (SL)     TO  SS05B-LIT00
067250010726              MOVE WS-SS05B-LIT0  (SL)     TO  SS05B-LIT0
067260010726              MOVE WS-SS05B-LIT1  (SL)     TO  SS05B-LIT1
067270010726              MOVE WS-SS05B-LIT2  (SL)     TO  SS05B-LIT2
067280010726              MOVE WS-SS05B-LIT3  (SL)     TO  SS05B-LIT3
067290010726              MOVE WS-SS05B-LIT4  (SL)     TO  SS05B-LIT4
067300010726
067310010726              MOVE STMT-SUM-05B            TO  WS-STMTPGE-LNE (SPL)
067320010726
067330010726              SET SPL                      UP BY 1
067340010726
067350010726              MOVE SPACES                  TO  STMT-SUM-05C
067360010726              MOVE WS-SS05C-LIT1 (SL)      TO  SS05C-LIT1
067370010726              MOVE WS-SS05C-LIT2 (SL)      TO  SS05C-LIT2
067380010726              MOVE WS-SS05C-LIT3 (SL)      TO  SS05C-LIT3
067390010726              MOVE STMT-SUM-05C            TO  WS-STMTPGE-LNE (SPL)
067400010726              SET SPL                      UP BY  2
067410010726R10992     END-IF.
067420010517
067430010726           MOVE STMT-SUM-05D           TO  WS-STMTPGE-LNE (SPL).
067440010726
067450010517       LS1-0120-0090-0010.
067460010517
067470010517           SET GIC       UP BY  1.
067480010517           GO TO LS1-0120-0080-0010.
067490010517
067500010517       LS1-0120-0100.
067510010517
067520010517      ****
067530010517      ****     Format statement summary line 5E
067540010517      ****
067550010517
067560010517           SET ADID                TO  1.
067570010517
067580010517       LS1-0120-0100-0010.
067590010517
067600010517           IF ADID   IS GREATER THAN   WS-ADID-LST
067610010517               GO TO LS1-0120-0120
067620010517           END-IF.
067630010517
067640010517           INITIALIZE ACCOUNT-DETAILS-SECTION.
067650010517           MOVE WS-ACCOUNT-DII-DETAILS (ADID)
067660010517                            TO ACCOUNT-DETAILS-SECTION.
067670010517
067680010517       LS1-0120-0100-0020.
067690010517
067700010518              MOVE SPACES               TO  STMT-SUM-05E.
067710010518              MOVE AD-INVESTMENT-NAME   TO SS05E-INVESTMENT-NAME.
067720010518              MOVE AD-DII-RATE          TO SS05E-RATE.
067730010608R10383        MOVE WS-SD03-PERCENTAGE-LIT (SL)
067740010608R10383                               TO SS05E-PERCENTAGE-LIT.
067750010726R10992*       MOVE AD-MARKET-VALUE      TO SS05E-ACTUAL-CAPITAL.
067760010726      *       MOVE AD-MARKET-VALUE-SIGN TO SS05E-ACTUAL-CAPITAL-SIGN.
067770010726              MOVE AD-BOOK-VALUE-BASE   TO SS05E-ACTUAL-CAPITAL.
067780010726              MOVE AD-BOOK-VALUE-SIGN   TO SS05E-ACTUAL-CAPITAL-SIGN.
067790010517
067800010517       LS1-0120-0110.
067810010517
067820010517           SET SPL                     UP BY  1.
067830010517           MOVE STMT-SUM-05E           TO  WS-STMTPGE-LNE (SPL).
067840010517
067850010517       LS1-0120-0110-0000.
067860010517
067870010517           SET ADID      UP BY  1.
067880010517           GO TO LS1-0120-0100-0010.
067890010517
067900010517       LS1-0120-0120.
067910010619
067920010619R10404****
067930010619      ****     ACCOUNT-DETAILS-SECTION was used in both GIC and DII
067940010619      ****     in Summary 5E/5E. Therefore, the new read
067950010619      ****     WS-ACCOUNT-DETAILS-TEMP must be moved to
067960010619      ****     ACCOUNT-DETAILS-SECTION for new account process if
067970010619      ****     an Investor has multiple accounts.
067980010619      ****
067990010619
068000010619           IF PREV-LEVEL2    IS EQUAL TO  CURR-LEVEL2
068010010619              MOVE WS-ACCOUNT-FUND-DETAILS-TEMP
068020010619                             TO ACCOUNT-DETAILS-SECTION
068030010619R10404     END-IF.
068040010517
068050010517      ****
068060010517      ****     Format statement summary line 5F
068070010517      ****
068080010517
068090010518              MOVE SPACES                TO  STMT-SUM-05F.
068100010519              MOVE SPACES                TO  SS05F-LIT1.
068110010517
068120010517       LS1-0120-0130.
068130010517
068140010517           SET SPL                    UP BY  1.
068150010517           MOVE STMT-SUM-05F          TO  WS-STMTPGE-LNE (SPL).
068160010517
068170010517       LS1-0120-0140.
068180010517
068190010517      ****
068200010517      ****     Format statement summary line 5G
068210010517      ****
068220010517
068230010517           SET SC                      TO  1.
068240010517
068250010517       LS1-0120-0140-0010.
068260010517
068270010517           IF  SC         IS GREATER THAN  WS-SC-MAX
068280010517               GO TO LS1-0130
068290010517           END-IF
068300010517
068310010517           IF  WS-SC-RPTIND (SC) EQUAL TO  "N"
068320010517               SET SC                   UP BY  1
068330010517               GO TO LS1-0120-0140-0010
068340010517           END-IF.
068350010517
068360010517           IF SC IS EQUAL TO 1
068370010518                 INITIALIZE                    STMT-SUM-05G
068380010518                 MOVE WS-SS05G-LIT1 (SL)   TO  SS05G-LIT1
068390010518                 MOVE WS-SC-MARKET-VALUE-GIC-DII (SC)
068400010518                                     TO SS05G-TOTAL-CAPITAL
068410010517           END-IF.
068420010517
068430010517           IF SC IS EQUAL TO 2
068440010518                 INITIALIZE                    STMT-SUM-05G
068450010518                 MOVE WS-SS05G-LIT1 (SL)   TO  SS05G-LIT1
068460010518                 MOVE WS-SC-MARKET-VALUE-GIC-DII (SC)
068470010517                                     TO SS05G-TOTAL-CAPITAL
068480010517           END-IF.
068490010517
068500010517       LS1-0120-0150.
068510010517
068520010517           SET SPL                   UP BY  1.
068530010517R10081     MOVE STMT-SUM-05G         TO  WS-STMTPGE-LNE (SPL).
068540010517
068550000000       LS1-0130.
068560000000
068570000000      *****
068580000000      *****    Format statement summary line 6, one line for each
068590000000      *****    applicable currency.
068600000000      *****
068610000000
068620000000           SET SC                      TO  1.
068630000000
068640000000       LS1-0140.
068650990928
068660000000           IF  SC         IS GREATER THAN  WS-SC-MAX
068670990928               GO TO LS1-0160
068680990928           END-IF
068690000000
068700000000           IF  WS-SC-RPTIND (SC) EQUAL TO  "N"
068710990928               GO TO LS1-0150
068720990928           END-IF
068730990928
068740971210           IF SC IS EQUAL TO 1
068750990930              IF WS-STMTVRSN                   IS EQUAL TO 3
068760990930                 MOVE SPACES                   TO  STMT-SUM-06
068770990930                 MOVE WS-SS06-LIT1 (SL)        TO  SS06V3-LIT1
068780990930                 MOVE WS-SC-CURRDESC (SC, SCL) TO  SS06V3-LIT-CURRDESC
068790990930                 MOVE WS-SC-MARKET-VALUE (SC)  TO  SS06V3-MARKET-VALUE
068800990930              ELSE
068810990930                 MOVE SPACES                   TO  STMT-SUM-06
068820990930                 MOVE WS-SS06-LIT1 (SL)        TO  SS06-LIT1
068830990930                 MOVE WS-SC-CURRDESC (SC, SCL) TO  SS06-LIT-CURRDESC
068840990930                 MOVE WS-SC-MARKET-VALUE (SC)  TO  SS06-MARKET-VALUE
068850990930              END-IF
068860010621R10081        IF WS-STMTVRSN                   IS EQUAL TO 4
068870010621                 MOVE SPACES                   TO  STMT-SUM-06
068880010621                 MOVE WS-SS06-LIT1 (SL)        TO  SS06V4-LIT1
068890010621                 MOVE WS-SC-CURRDESC (SC, SCL) TO  SS06V4-LIT-CURRDESC
068900010621                 MOVE WS-SC-MARKET-VALUE (SC)  TO  SS06V4-MARKET-VALUE
068910010621R10081        END-IF
068920990928           END-IF
068930990928
068940971210           IF SC  IS EQUAL TO 2
068950990930              IF WS-STMTVRSN                   IS EQUAL TO 3
068960990930                 MOVE SPACES                   TO  STMT-SUM-09
068970990930                 MOVE WS-SS06-LIT1 (SL)        TO  SS09V3-LIT1
068980990930                 MOVE WS-SC-CURRDESC (SC, SCL) TO  SS09V3-LIT-CURRDESC
068990990930                 MOVE WS-SC-MARKET-VALUE (SC)  TO  SS09V3-MARKET-VALUE
069000990930              ELSE
069010990930                 MOVE SPACES                   TO  STMT-SUM-09
069020990930                 MOVE WS-SS06-LIT1 (SL)        TO  SS09-LIT1
069030990930                 MOVE WS-SC-CURRDESC (SC, SCL) TO  SS09-LIT-CURRDESC
069040990930                 MOVE WS-SC-MARKET-VALUE (SC)  TO  SS09-MARKET-VALUE
069050990930              END-IF
069060010621R10081        IF WS-STMTVRSN                   IS EQUAL TO 4
069070010621                 MOVE SPACES                   TO  STMT-SUM-09
069080010621                 MOVE WS-SS06-LIT1 (SL)        TO  SS09V4-LIT1
069090010621                 MOVE WS-SC-CURRDESC (SC, SCL) TO  SS09V4-LIT-CURRDESC
069100010621                 MOVE WS-SC-MARKET-VALUE (SC)  TO  SS09V4-MARKET-VALUE
069110010621              END-IF
069120010622R10081        GO TO LS1-0150
069130990928           END-IF.
069140990928
069150000000       LS1-0140-0010.
069160990928
069170010519R10081     IF WS-STMTVRSN         IS EQUAL TO 4
069180010519              SET SPL                  UP BY  2
069190010522              MOVE STMT-SUM-06         TO  WS-STMTPGE-LNE (SPL)
069200010522              GO TO LS1-0140-0020
069210010519R10081     END-IF
069220010519
069230010519           SET SPL                     UP BY  1.
069240000000           MOVE STMT-SUM-06            TO  WS-STMTPGE-LNE (SPL).
069250991002
069260010522R10081 LS1-0140-0020.
069270010522
069280991013           IF WS-LDA-RESP-84 IS NOT EQUAL TO "Y"
069290991013              GO TO LS1-0150.
069300991013
069310991103991103     IF WS-AT-RULE (AT1)         IS NOT EQUAL TO  "4"
069320991013              GO TO LS1-0150.
069330991002
069340991011991003*** FOR RESP BENEFICIARY
069350991002
069360991007           MOVE SPACES                 TO  STMT-SUM-RESP-HDG
069370991007           MOVE SPACES                 TO  STMT-SUM-RESP-01
069380991007           MOVE SPACES                 TO  STMT-SUM-RESP-02
069390991009           MOVE SPACES                 TO  STMT-SUM-RESP-03
069400991009           MOVE SPACES                 TO  STMT-SUM-RESP-04
069410991009           MOVE SPACES                 TO  STMT-SUM-RESP-05
069420991009           MOVE SPACES                 TO  STMT-SUM-RESP-06
069430991002
069440991103991103     IF WS-AT-RULE (AT1)         IS EQUAL TO  "4"
069450991002              IF WS-STMTVRSN                   IS  EQUAL TO 3
069460991012                 IF RE-ACCOUNT-BENEFICIARY1    IS NOT EQUAL TO SPACES
069470991012                    MOVE WS-SSRHDGV3-LIT1 (SL)    TO  SSRHDGV3-LIT1
069480991012                    MOVE WS-SSR-ACC-LIT (SL)      TO  SSR01V3-LIT1
069490991012                    MOVE RE-ACCOUNT-BENEFICIARY1
069500991007                                     TO SSR01V3-ACCT-BENEFICIARY1
069510991012                 END-IF
069520991012
069530991011                 IF RE-ACCOUNT-BENEFICIARY2    IS NOT EQUAL TO SPACES
069540991011                    MOVE RE-ACCOUNT-BENEFICIARY2
069550991011                                     TO SSR02V3-ACCT-BENEFICIARY2
069560991011                 END-IF
069570991011
069580991011                 IF RE-ACCOUNT-BENEFICIARY3    IS NOT EQUAL TO SPACES
069590991011                    MOVE RE-ACCOUNT-BENEFICIARY3
069600991011                                     TO SSR03V3-ACCT-BENEFICIARY3
069610991011                 END-IF
069620991011
069630991012                 IF RE-ACCOUNT-BENEFICIARY4    IS NOT EQUAL TO SPACES
069640991012                    MOVE RE-ACCOUNT-BENEFICIARY4
069650991012                                     TO SSR04V3-ACCT-BENEFICIARY4
069660991011                 END-IF
069670991011
069680991012                 IF RE-ACCOUNT-BENEFICIARY5    IS NOT EQUAL TO SPACES
069690991012                    MOVE RE-ACCOUNT-BENEFICIARY5
069700991012                                     TO SSR05V3-ACCT-BENEFICIARY5
069710991011                 END-IF
069720991011
069730991012                 IF RE-ACCOUNT-BENEFICIARY6    IS NOT EQUAL TO SPACES
069740991012                    MOVE RE-ACCOUNT-BENEFICIARY6
069750991012                                     TO SSR06V3-ACCT-BENEFICIARY6
069760991011                 END-IF
069770991002              ELSE
069780991012                 IF RE-ACCOUNT-BENEFICIARY1    IS NOT EQUAL TO SPACES
069790991012                    MOVE WS-SSRHDG-LIT1 (SL)      TO  SSRHDG-LIT1
069800991012                    MOVE WS-SSR-ACC-LIT (SL)      TO  SSR01-LIT1
069810991012                    MOVE RE-ACCOUNT-BENEFICIARY1
069820991007                                     TO SSR01-ACCT-BENEFICIARY1
069830991012                 END-IF
069840991012
069850991011                 IF RE-ACCOUNT-BENEFICIARY2    IS NOT EQUAL TO SPACES
069860991011                    MOVE RE-ACCOUNT-BENEFICIARY2
069870991011                                     TO SSR02-ACCT-BENEFICIARY2
069880991011                 END-IF
069890991011
069900991011                 IF RE-ACCOUNT-BENEFICIARY3    IS NOT EQUAL TO SPACES
069910991011                    MOVE RE-ACCOUNT-BENEFICIARY3
069920991011                                     TO SSR03-ACCT-BENEFICIARY3
069930991011                 END-IF
069940991011
069950991011                 IF RE-ACCOUNT-BENEFICIARY4    IS NOT EQUAL TO SPACES
069960991011                    MOVE RE-ACCOUNT-BENEFICIARY4
069970991011                                     TO SSR04-ACCT-BENEFICIARY4
069980991011                 END-IF
069990991011
070000991011                 IF RE-ACCOUNT-BENEFICIARY5    IS NOT EQUAL TO SPACES
070010991011                    MOVE RE-ACCOUNT-BENEFICIARY5
070020991011                                     TO SSR05-ACCT-BENEFICIARY5
070030991011                 END-IF
070040991011
070050991011                 IF RE-ACCOUNT-BENEFICIARY6    IS NOT EQUAL TO SPACES
070060991011                    MOVE RE-ACCOUNT-BENEFICIARY6
070070991011                                     TO SSR06-ACCT-BENEFICIARY6
070080991011                 END-IF
070090991002              END-IF
070100991012           END-IF
070110991014
070120991014991014     SET SPL                     UP BY 8
070130991014           IF SPL                      IS LESS THAN WS-SPL-DTLLST
070140991014              SET SPL                  DOWN BY 8
070150991014           ELSE
070160991014              PERFORM PRINT-STMT-RTN   THRU PSR-EXIT
070170991014              IF WS-PSRERR-SW          IS NOT EQUAL TO SPACES
070180991102                 GO TO LS1-EXIT
070190991014              END-IF
070200991014991014     END-IF
070210991014
070220991012           IF STMT-SUM-RESP-01         IS NOT EQUAL TO SPACES
070230991012              SET SPL                  UP BY  2
070240991012              MOVE STMT-SUM-RESP-HDG   TO  WS-STMTPGE-LNE (SPL)
070250991012              SET SPL                  UP BY  2
070260991012              MOVE STMT-SUM-RESP-01    TO  WS-STMTPGE-LNE (SPL)
070270991012           END-IF
070280991011
070290991011           IF STMT-SUM-RESP-02         IS NOT EQUAL TO SPACES
070300991011              SET SPL                  UP BY  1
070310991011              MOVE STMT-SUM-RESP-02    TO  WS-STMTPGE-LNE (SPL)
070320991011           END-IF
070330991011
070340991011           IF STMT-SUM-RESP-03         IS NOT EQUAL TO SPACES
070350991011              SET SPL                  UP BY  1
070360991011              MOVE STMT-SUM-RESP-03    TO  WS-STMTPGE-LNE (SPL)
070370991011           END-IF
070380991002
070390991011           IF STMT-SUM-RESP-04         IS NOT EQUAL TO SPACES
070400991011              SET SPL                  UP BY  1
070410991011              MOVE STMT-SUM-RESP-04    TO  WS-STMTPGE-LNE (SPL)
070420991011           END-IF
070430991011
070440991011           IF STMT-SUM-RESP-05         IS NOT EQUAL TO SPACES
070450991011              SET SPL                  UP BY  1
070460991011              MOVE STMT-SUM-RESP-05    TO  WS-STMTPGE-LNE (SPL)
070470991011           END-IF
070480991011
070490991011           IF STMT-SUM-RESP-06         IS NOT EQUAL TO SPACES
070500991011              SET SPL                  UP BY  1
070510991011              MOVE STMT-SUM-RESP-06    TO  WS-STMTPGE-LNE (SPL)
070520991011           END-IF.
070530991011
070540991002991003
070550991002
070560000000       LS1-0150.
070570990928
070580000000           SET SC                   UP BY  1.
070590000000           GO TO LS1-0140.
070600971215
070610971215      ****
070620971215      ****       FORMAT SUMMARY LINE 7
070630971215      ****
070640971215
070650000000       LS1-0160.
070660990928
070670971212           SET  SN                  TO 1.
070680991002
070690971210           IF W-SS07-INVESTMENT-NAME(SN) IS EQUAL TO SPACES
070700991002              GO TO LS1-0160-3
070710991002           END-IF
070720991002
070730971211           SET  SPL                 UP BY 2.
070740971210
070750971210       LS1-0160-1.
070760971210
070770971210           IF W-SS07-INVESTMENT-NAME(SN) IS EQUAL TO SPACES
070780991002               GO TO LS1-0160-2
070790991002           END-IF
070800971210
070810971210           MOVE SPACES TO STMT-SUM-07.
070820990930
070830010619R10081     IF WS-STMTVRSN                  IS EQUAL TO  4
070840010618              MOVE W-SS07-INVESTMENT-NAME(SN) TO SS07V4-INVESTMENT-NAME
070850010618              MOVE W-SS07-CURRENCY(SN)        TO SS07V4-CURRENCY
070860010618              GO TO LS1-0160-1-0010
070870010619R10081     END-IF
070880990930           IF WS-STMTVRSN                  IS EQUAL TO  3
070890990930              MOVE W-SS07-INVESTMENT-NAME(SN) TO SS07V3-INVESTMENT-NAME
070900990930              MOVE W-SS07-CURRENCY(SN)        TO SS07V3-CURRENCY
070910990930           ELSE
070920990930              MOVE W-SS07-INVESTMENT-NAME(SN) TO SS07-INVESTMENT-NAME
070930990930              MOVE W-SS07-CURRENCY(SN)        TO SS07-CURRENCY
070940010618           END-IF.
070950990930
070960010619R10081 LS1-0160-1-0010.
070970010618
070980990316           IF WS-STMTVRSN IS EQUAL TO  1
070990990316              MOVE W-SS07-ACB-UNIT-PRICE(SN)  TO SS07-ACB-UNIT-PRICE
071000990316              MOVE W-SS07-ACB-UNIT-PRICE-SIGN(SN)
071010990930                              TO SS07-ACB-UNIT-PRICE-SIGN
071020990930           END-IF
071030990930
071040010619R10081     IF WS-STMTVRSN IS EQUAL TO  4
071050010618              MOVE W-SS07-LAST-UNIT-PRICE(SN) TO SS07V4-LAST-UNIT-PRICE
071060010618              MOVE W-SS07-LAST-UNIT-PRICE-SIGN(SN)
071070010618                                      TO SS07V4-LAST-UNIT-PRICE-SIGN
071080010618              MOVE W-SS07-NO-OF-UNITS(SN) TO SS07V4-NO-OF-UNITS
071090010618              MOVE W-SS07-NO-OF-UNITS-SIGN(SN)
071100010618                                      TO SS07V4-NO-OF-UNITS-SIGN
071110010618              MOVE W-SS07-MARKET-VALUE(SN) TO SS07V4-MARKET-VALUE
071120010618              MOVE W-SS07-MARKET-VALUE-SIGN(SN)
071130010618                                      TO SS07V4-MARKET-VALUE-SIGN
071140010618              GO TO LS1-0160-1-0020
071150010619R10081     END-IF
071160990930
071170990930           IF WS-STMTVRSN                  IS EQUAL TO  3
071180990930              MOVE W-SS07-LAST-UNIT-PRICE(SN)
071190990930                                      TO SS07V3-LAST-UNIT-PRICE
071200990930              MOVE W-SS07-LAST-UNIT-PRICE-SIGN(SN)
071210990930                                      TO SS07V3-LAST-UNIT-PRICE-SIGN
071220990930              MOVE W-SS07-NO-OF-UNITS(SN) TO SS07V3-NO-OF-UNITS
071230990930              MOVE W-SS07-NO-OF-UNITS-SIGN(SN)
071240990930                                      TO SS07V3-NO-OF-UNITS-SIGN
071250990930              MOVE W-SS07-MARKET-VALUE(SN) TO SS07V3-MARKET-VALUE
071260990930              MOVE W-SS07-MARKET-VALUE-SIGN(SN)
071270990930                                      TO SS07V3-MARKET-VALUE-SIGN
071280990930           ELSE
071290990930              MOVE W-SS07-LAST-UNIT-PRICE(SN) TO SS07-LAST-UNIT-PRICE
071300990930              MOVE W-SS07-LAST-UNIT-PRICE-SIGN(SN)
071310990930                                      TO SS07-LAST-UNIT-PRICE-SIGN
071320990930              MOVE W-SS07-NO-OF-UNITS(SN) TO SS07-NO-OF-UNITS
071330990930              MOVE W-SS07-NO-OF-UNITS-SIGN(SN)
071340990930                                      TO SS07-NO-OF-UNITS-SIGN
071350990930              MOVE W-SS07-MARKET-VALUE(SN) TO SS07-MARKET-VALUE
071360990930              MOVE W-SS07-MARKET-VALUE-SIGN(SN)
071370990930                                      TO SS07-MARKET-VALUE-SIGN
071380010618           END-IF.
071390990930
071400010619R10081 LS1-0160-1-0020.
071410010618
071420971211           IF SPL IS LESS THAN WS-SPL-DTLLST
071430971211             SET SPL UP BY 1
071440971211             GO TO LS1-0160-1-1.
071450971211
071460971211           PERFORM PRINT-STMT-RTN  THRU PSR-EXIT.
071470971211           IF WS-PSRERR-SW  NOT EQUAL TO SPACES
071480971211              GO TO LS1-EXIT.
071490971211
071500971211       LS1-0160-1-1.
071510990928
071520971210           MOVE STMT-SUM-07  TO WS-STMTPGE-LNE(SPL).
071530971211           SET SN                     UP BY 1.
071540971210           GO TO LS1-0160-1.
071550971210
071560971210       LS1-0160-2.
071570990928
071580971211               SET SPL                UP BY 2.
071590971211
071600971211               IF SPL IS LESS THAN WS-SPL-DTLLST
071610971211                  SET SPL             DOWN BY 2
071620971211               ELSE
071630971211                  PERFORM PRINT-STMT-RTN  THRU PSR-EXIT
071640971211                  IF WS-PSRERR-SW NOT EQUAL TO SPACES
071650971211                     GO TO LS1-EXIT
071660971211                  END-IF
071670971211               END-IF
071680971211
071690971215      ****
071700971215      ****     FORMAT SUMMARY LINE 8 AND SUMMARY LINE 9
071710971215      ****
071720971211               MOVE SPACES            TO US-TABLE.
071730971210               MOVE SPACES            TO STMT-SUM-08.
071740990930
071750010619R10081     IF WS-STMTVRSN                  IS EQUAL TO  4
071760010618                  MOVE WS-SS05-LIT1(SL)  TO SS08V4-LIT1
071770010619                  GO TO LS1-0160-2-0000
071780010619R10081     END-IF
071790990930           IF WS-STMTVRSN                  IS EQUAL TO  3
071800990930                  MOVE WS-SS05-LIT1(SL)  TO SS08V3-LIT1
071810990930           ELSE
071820990930                  MOVE WS-SS05-LIT1(SL)  TO SS08-LIT1
071830010619           END-IF.
071840010619
071850010619R10081 LS1-0160-2-0000.
071860010619
071870991002           SET  SPL               UP BY 1.
071880991002           MOVE STMT-SUM-08       TO WS-STMTPGE-LNE(SPL).
071890991002           SET  SPL               UP BY 1.
071900991002           MOVE STMT-SUM-09       TO WS-STMTPGE-LNE(SPL).
071910991002
071920991002991003****
071930991002      ****     FORMAT RESP BENEFICIARY SUMMARY
071940991002      ****
071950991002
071960971210       LS1-0160-3.
071970971218
071980000000      *****
071990000000      *****    Process the current page.
072000000000      *****
072010971218
072020971212           MOVE SPACES TO US-TABLE.
072030000000           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
072040000000           IF  WS-PSRERR-SW  NOT EQUAL TO  SPACES
072050000000               GO TO LS1-EXIT.
072060000000
072070000000           CONTINUE.
072080000000
072090000000       LS1-EXIT.
072100000000           EXIT.
072110000000      /
072120000000       PRINT-STMT-RTN.
072130000000
072140000000      ******************************************************************
072150000000      *                                                                *
072160000000      *    P R I N T   S T A T E M E N T   R O U T I N E               *
072170000000      *                                                                *
072180000000      ******************************************************************
072190000000
072200000000      *****
072210000000      *****    If the Statement Print Header record has not been
072220000000      *****    created, create it.  The record was formatted in the
072230000000      *****    LEVEL REINITIALIZATION 1 routine.
072240000000      *****
072250000000
072260000000           MOVE SPACES                 TO  WS-PSRERR-SW.
072270000000
072280991007           IF WS-STMT-PRT-HDR-WSW      IS EQUAL TO  "Y"
072290991007              GO TO PSR-0010
072300991007           END-IF
072310991007
072320000000           WRITE STMT-PRT-HDR-RECD
072330000000               INVALID KEY
072340000000                   MOVE "H"            TO  WS-PSRERR-SW
072350000000                   GO TO PSR-9999.
072360000000
072370000000           ADD 1                       TO  WS-STMT-PRT-HDR-WCNT.
072380000000           MOVE "Y"                    TO  WS-STMT-PRT-HDR-WSW.
072390000000
072400000000       PSR-0010.
072410000000
072420000000      *****
072430000000      *****    Format and print the Statement Print Detail records.  One
072440000000      *****    record will be created for each statement line.  If the
072450000000      *****    statement line is spaces, no record will be created.
072460000000      *****
072470000000
072480000000           SET SPL                     TO  1.
072490000000
072500000000       PSR-0020.
072510991007
072520991007           IF WS-STMTPGE-LNE (SPL)     IS EQUAL TO  SPACES
072530991007              GO TO PSR-0030
072540991007           END-IF
072550991007
072560000000           MOVE SPACES                 TO  STMT-PRT-DTL-RECD.
072570991007           MOVE INVESTOR-NO OF STMT-PRT-HDR-RECD
072580991007                            TO  INVESTOR-NO OF STMT-PRT-DTL-RECD.
072590000000           MOVE ACCOUNT
072600000000                OF STMT-PRT-HDR-RECD   TO  ACCOUNT
072610000000                                           OF STMT-PRT-DTL-RECD.
072620000000           MOVE LANGUAGE-CODE
072630000000                OF STMT-PRT-HDR-RECD   TO  LANGUAGE-CODE
072640000000                                           OF STMT-PRT-DTL-RECD.
072650000000           MOVE DEALER
072660000000                OF STMT-PRT-HDR-RECD   TO  DEALER
072670000000                                           OF STMT-PRT-DTL-RECD.
072680000000           MOVE DEALER-REP-CODE
072690000000                OF STMT-PRT-HDR-RECD   TO  DEALER-REP-CODE
072700000000                                           OF STMT-PRT-DTL-RECD.
072710000000           MOVE WS-SH-PGENO            TO  STMPGENO
072720000000                                           OF STMT-PRT-DTL-RECD.
072730000000           SET STMLNENO
072740000000               OF STMT-PRT-DTL-RECD    TO  SPL.
072750000000           MOVE WS-STMTPGE-LNE (SPL)   TO  STMLNE
072760000000                                           OF STMT-PRT-DTL-RECD.
072770980129           MOVE START-DATE
072780980129                OF STMT-PRT-HDR-RECD   TO  START-DATE
072790980129                                           OF STMT-PRT-DTL-RECD.
072800980129           MOVE END-DATE
072810980129                OF STMT-PRT-HDR-RECD   TO  END-DATE
072820980129                                           OF STMT-PRT-DTL-RECD.
072830980129
072840000000           WRITE STMT-PRT-DTL-RECD
072850000000               INVALID KEY
072860000000                   MOVE "D"            TO  WS-PSRERR-SW
072870000000                   GO TO PSR-9999.
072880000000
072890000000           ADD 1                       TO  WS-STMT-PRT-DTL-WCNT.
072900000000
072910000000       PSR-0030.
072920990928
072930991007           IF SPL           IS LESS THAN  WS-SPL-MAX
072940991007              SET SPL              UP BY  1
072950991007              GO TO PSR-0020
072960991007           END-IF
072970991007
072980000000      *****
072990000000      *****    Format a new page for the account statement.
073000000000      *****
073010000000
073020000000           ADD 1                       TO  WS-SH-PGENO.
073030991001
073040010619R10081     IF WS-STMTVRSN              IS EQUAL TO  4
073050010619              MOVE WS-SH-PGENO         TO  SHEXV4-PGENO
073060010619              GO TO PSR-0040
073070010619R10081     END-IF
073080010517
073090990929           IF WS-STMTVRSN              IS EQUAL TO  3
073100990929              MOVE WS-SH-PGENO         TO  SHEXV3-PGENO
073110990929           ELSE
073120990929              MOVE WS-SH-PGENO         TO  SH02-PGENO
073130990929           END-IF.
073140990929
073150000000       PSR-0040.
073160990928
073170010619R10081     IF WS-STMTVRSN              IS EQUAL TO  4
073180010619              SET SPL                  TO  WS-SPL-SH02
073190010619              MOVE STMT-HDG-02         TO  WS-STMTPGE-LNE (SPL)
073200010619              SET SPL                  UP BY 1
073210010619              MOVE STMT-HDG-EXTRA      TO  WS-STMTPGE-LNE (SPL)
073220010619              GO TO PSR-0040-0010
073230010619R10081     END-IF
073240011005
073250990929           IF WS-STMTVRSN              IS EQUAL TO  3
073260990929              SET SPL                  TO  WS-SPL-SH02
073270990929              MOVE STMT-HDG-EXTRA      TO  WS-STMTPGE-LNE (SPL)
073280990929           ELSE
073290990929              SET SPL                  TO  WS-SPL-SH02
073300990929              MOVE STMT-HDG-02         TO  WS-STMTPGE-LNE (SPL)
073310010619           END-IF.
073320990929
073330010619R10081 PSR-0040-0010.
073340010619
073350990930           IF WS-STMTVRSN              IS EQUAL TO  3
073360991001              MOVE SPACES              TO  WS-STMTPGE-DTL-V3
073370990930           ELSE
073380991001              MOVE SPACES              TO  WS-STMTPGE-DTL
073390011009R11747        IF WS-STMTVRSN              IS EQUAL TO  4
073400011009                 MOVE SPACES              TO  WS-STMTPGE-DTL-V4
073410011009R11747        END-IF
073420011009              IF  WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "7"
073430011009              AND WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "2"
073440011009              AND PR-SECTION-NO            IS EQUAL TO 80
073450011009R11747            MOVE "N"             TO  WS-STMT-DTA-SW-80FUND
073460011009              ELSE
073470011009R11747            MOVE "N"             TO  WS-STMT-DTA-SW-80DII
073480011009              END-IF
073490990930           END-IF.
073500991001
073510000000       PSR-0050.
073520990928
073530000000           SET SPL                     TO  WS-SPL-DTLFST.
073540011009
073550000000           GO TO PSR-EXIT.
073560000000
073570000000       PSR-9999.
073580000000
073590000000      *****
073600000000      *****    An error was detected attempting to write either a
073610000000      *****    Statement Print Header record or a Statement Print Detail
073620000000      *****    record.  An error message will be printed and the program
073630000000      *****    terminated.
073640000000      *****
073650000000
073660000000           IF  WS-PSRERR-SW   IS EQUAL TO  "H"
073670000000               SET MSG                 TO  6
073680000000             ELSE
073690000000               SET MSG                 TO  7.
073700000000
073710000000           MOVE SPACES                 TO  ERROR-LINE-1.
073720000000           MOVE INVESTOR-NO
073730000000                OF STMT-PRT-HDR-RECD   TO  EL1-INVESTOR-NO.
073740000000           MOVE ACCOUNT
073750000000                OF STMT-PRT-HDR-RECD   TO  EL1-ACCOUNT.
073760000000           MOVE LANGUAGE-CODE
073770000000                OF STMT-PRT-HDR-RECD   TO  EL1-LANGUAGE-CODE.
073780000000           MOVE DEALER
073790000000                OF STMT-PRT-HDR-RECD   TO  EL1-DEALER.
073800000000           MOVE DEALER-REP-CODE
073810000000                OF STMT-PRT-HDR-RECD   TO  EL1-DEALER-REP-CODE.
073820000000           MOVE WS-MSG (MSG)           TO  EL1-MSG.
073830000000           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
073840000000
073850000000           MOVE SPACES                 TO  ERROR-LINE-1.
073860000000           IF  WS-PSRERR-SW   IS EQUAL TO  "H"
073870000000               MOVE STMT-PRT-HDR-RECD  TO  ERROR-LINE-1
073880000000             ELSE
073890000000               MOVE STMT-PRT-DTL-RECD  TO  ERROR-LINE-1.
073900000000           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
073910000000
073920000000           MOVE SPACES                 TO  ERROR-LINE-1.
073930000000           MOVE WS-FILSTAT             TO  ERROR-LINE-1.
073940000000           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
073950000000
073960000000           PERFORM DUMP-ROUTINE       THRU DR-EXIT.
073970000000           MOVE HIGH-VALUES            TO  CURR-CONTROLS.
073980000000
073990000000       PSR-EXIT.
074000000000           EXIT.
074010000000      /
074020000000       DUMP-ROUTINE.
074030000000
074040000000      ******************************************************************
074050000000      *                                                                *
074060000000      *    D U M P   R O U T I N E                                     *
074070000000      *                                                                *
074080000000      ******************************************************************
074090000000
074100000000      *****
074110000000      *****    Produce a program dump for analysis.
074120000000      *****
074130000000
074140000000           CALL    "QLREXHAN"       USING  DUMP-ARGUMENTS.
074150000000
074160000000       DR-EXIT.
074170000000           EXIT.
074180000000      /
074190000000       LEVEL-SUMMARY-2.
074200000000
074210000000      ******************************************************************
074220000000      *                                                                *
074230000000      *    L E V E L   S U M M A R I Z A T I O N   2   R O U T I N E   *
074240000000      *                                                                *
074250000000      *        INVESTOR-NO:            Investor Number                 *
074260000000      *                                                                *
074270000000      ******************************************************************
074280000000
074290000000      *****
074300000000      *****    Null routine.
074310000000      *****
074320000000
074330000000           CONTINUE.
074340000000
074350000000       LS2-EXIT.
074360000000           EXIT.
074370000000      /
074380000000       LEVEL-REINIT-2.
074390000000
074400000000      ******************************************************************
074410000000      *                                                                *
074420000000      *    L E V E L   R E I N I T I A L I Z A T I O N   2   R T N .   *
074430000000      *                                                                *
074440000000      *        INVESTOR-NO:            Investor Number                 *
074450000000      *                                                                *
074460000000      ******************************************************************
074470000000
074480000000      *****
074490000000      *****    Indicate that the Investor Information record and the
074500000000      *****    Dealer record have not yet been read.
074510000000      *****
074520000000
074530000000           MOVE "N"                    TO  WS-STMT-DTA-SW-01.
074540000000           MOVE "N"                    TO  WS-STMT-DTA-SW-05.
074550010517R10081     MOVE "N"                    TO  WS-STMT-DTA-SW-25.
074560010517R10081     MOVE "N"                    TO  WS-STMT-DTA-SW-20FUND.
074570010517R10081     MOVE "N"                    TO  WS-STMT-DTA-SW-20GIC.
074580010517R10081     MOVE "N"                    TO  WS-STMT-DTA-SW-20DII.
074590010531R10383     MOVE "N"                    TO  WS-STMT-DTA-SW-80DII.
074600011005R11747*    MOVE "N"                    TO  WS-STMT-DTA-SW-80DII-HEAD.
074610010531R10383     MOVE "N"                    TO  WS-STMT-DTA-SW-80FUND.
074620000000
074630000000      *****
074640000000      *****    Initialize the statement investor accounts table.
074650000000      *****
074660000000
074670000000           MOVE HIGH-VALUES            TO  WS-STMT-INVESTOR-ACCOUNT-TBL.
074680000000           MOVE ZEROES                 TO  WS-SIA-LST.
074690980915
074700980916      *****
074710980916      *****    Initialize the investor information table.
074720980916      *****
074730980916
074740981001           INITIALIZE                  WS-INVESTOR-INFO-TBL.
074750980916           MOVE ZEROES                 TO  WS-II-LST.
074760980916
074770000626RF6725*****
074780000626      *****    Initialize the dealer information table.
074790000626      *****
074800000626
074810000626           INITIALIZE                  WS-DEALER-INFO-TBL.
074820000626           MOVE ZEROES                 TO  WS-DI-LST.
074830000626
074840010517R10081*****
074850010517      *****    Initialize the GIC information table.
074860010517      *****
074870010517
074880010517           INITIALIZE                  WS-GIC-INFO-TBL.
074890010517           MOVE ZEROES                 TO  WS-GIC-LST.
074900010517
074910010517      *****
074920010517      *****    Initialize the Account Detail (FUND, GIC & DII) table.
074930010517      *****
074940010517
074950010517           INITIALIZE                  WS-ACCOUNT-FUND-TABLE.
074960010517           MOVE ZEROES                 TO  WS-AFD-LST.
074970010517
074980010517           INITIALIZE                  WS-ACCOUNT-GIC-TABLE.
074990010517           MOVE ZEROES                 TO  WS-AGD-LST.
075000010517
075010010517           INITIALIZE                  WS-ACCOUNT-DII-TABLE.
075020010517R10081     MOVE ZEROES                 TO  WS-ADID-LST.
075030010517
075040000000       LR2-EXIT.
075050000000           EXIT.
075060000000      /
075070000000       LEVEL-REINIT-1.
075080000000
075090000000      ******************************************************************
075100000000      *                                                                *
075110000000      *    L E V E L   R E I N I T I A L I Z A T I O N   1   R T N .   *
075120000000      *                                                                *
075130000000      *        ACCOUNT:                Account                         *
075140000000      *                                                                *
075150000000      ******************************************************************
075160000000
075170000000      *****
075180000000      *****    If Account is zeroes, bypass this routine.
075190000000      *****
075200000000
075210000000           IF  CURR-ACCOUNT   IS EQUAL TO  ZEROES
075220990928               GO TO LR1-EXIT
075230990928           END-IF
075240990928
075250000000      *****
075260000000      *****    If one of the following conditions is detected, an error
075270000000      *****    message will be printed and the account will be bypassed.
075280000000      *****       1. Investor Information record missing.
075290000000      *****       2. Dealer record missing.
075300000000      *****       3. Account Detail record missing.
075310000000      *****    If this occurs, the program that creates the Statement
075320000000      *****    Data file should be reviewed.
075330000000      *****
075340000000
075350000000           MOVE "N"                    TO  WS-L01BYP-SW.
075360000000
075370000000           IF  WS-STMT-DTA-SW-01 EQUAL TO  "Y"
075380000000           AND WS-STMT-DTA-SW-05 EQUAL TO  "Y"
075390000000           AND PR-SECTION-NO  IS EQUAL TO  20
075400991103991103         GO TO LR1-0015
075410990928           END-IF
075420990928
075430000000           MOVE SPACES                 TO  ERROR-LINE-1.
075440000000
075450000000           IF  WS-STMT-DTA-SW-01 EQUAL TO  "N"
075460000000               SET MSG                 TO  8
075470000000               GO TO LR1-0010.
075480000000
075490000000           IF  WS-STMT-DTA-SW-05 EQUAL TO  "N"
075500000000               SET MSG                 TO  9
075510000000               GO TO LR1-0010.
075520000000
075530000000           IF  PR-SECTION-NO NOT EQUAL TO  20
075540000000               SET MSG                 TO  10
075550000000               GO TO LR1-0010.
075560000000
075570000000           CONTINUE.
075580000000
075590000000       LR1-0010.
075600990928
075610000000           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
075620000000           MOVE "Y"                    TO  WS-L01BYP-SW.
075630000000           GO TO LR1-EXIT.
075640000000
075650991102
075660991102      *****************************************************
075670991102
075680991102       LR1-0015.
075690991103
075700991102      *****
075710991103      *****    Search the account type table for the correct
075720991103      *****    'rule'
075730991102      *****
075740991102
075750991102           SET AT1                     TO  1.
075760991103           IF  WS-AT-LST        IS NOT GREATER THAN  ZEROES
075770991103               GO TO LR1-0020
075780991103           END-IF.
075790991103
075800991102       LR1-0015-000.
075810991102
075820190614      *RFS183449-Starts
075830190614991103*    IF  AD-ACCOUNT-TYPE-SHORT  IS EQUAL TO  WS-AT-CODE (AT1)
075840190614           INITIALIZE Lc-Acct-Type-Code
075850190619           PERFORM Get-Account-Type-Code
075860190614           IF Lc-Acct-Type-Code IS EQUAL TO  WS-AT-CODE (AT1)
075870190614      *RFS183449-Ends
075880991103               GO TO LR1-0020
075890991103           END-IF
075900991103
075910991102           SET AT1                  UP BY  1.
075920991103
075930991102           IF  AT1    IS NOT GREATER THAN  WS-AT-LST
075940991103               GO TO LR1-0015-000
075950991103           END-IF.
075960991102
075970991102      *************************************************************
075980991102
075990000000       LR1-0020.
076000000000
076010000000      *****
076020000000      *****    Find the account information in the investor account
076030000000      *****    table.  Format the nominee and registered contribution
076040000000      *****    data and print a message, if required.
076050000000      *****
076060000000
076070980213           MOVE SPACES                 TO  WS-DEALER-ACCOUNT-NO.
076080000000           MOVE SPACES                 TO  WS-NOMINEE.
076090000000           MOVE SPACES                 TO  WS-NOMINEE-CODE.
076100000000           MOVE SPACES                 TO  WS-NOMINEE-NAME.
076110000000           MOVE SPACES                 TO  WS-NOMINEES-ACCT-NO.
076120000000           MOVE ZEROES                 TO  WS-REG-CTB-CUR.
076130000000           MOVE SPACES                 TO  WS-REG-CTB-CUR-SIGN.
076140991102
076150000000           SEARCH ALL WS-SIA-ENT
076160000000               AT END
076170000000                   GO TO LR1-0020-0020
076180000000               WHEN WS-SIA-ACCT (SIA)
076190000000                              IS EQUAL TO  AD-ACCOUNT
076200980213                   MOVE WS-SIA-DLRACCTNO (SIA)
076210980213                                       TO  WS-DEALER-ACCOUNT-NO
076220000000                   MOVE WS-SIA-NOMCDE (SIA)
076230000000                                       TO  WS-NOMINEE-CODE
076240000000                   MOVE WS-SIA-NOMNAM (SIA)
076250000000                                       TO  WS-NOMINEE-NAME
076260000000                   MOVE WS-SIA-NOMACCT (SIA)
076270000000                                       TO  WS-NOMINEES-ACCT-NO
076280000000                   MOVE WS-SIA-REGCTB (SIA)
076290000000                                       TO  WS-REG-CTB-CUR
076300000000                   MOVE WS-SIA-REGCTBSGN (SIA)
076310000000                                       TO  WS-REG-CTB-CUR-SIGN.
076320000607RF7201             MOVE WS-SIA-ENTEREDBY (SIA)
076330000607                                       TO  WS-ENTERED-BY.
076340000626RF6725             MOVE WS-SIA-MAIL-FLAG (SIA)
076350000626                                     TO  WS-MAILING-ADDRESS-INDICATOR.
076360000000
076370000000       LR1-0020-0020.
076380000000
076390000000      *****
076400000000      *****    If the account is flagged as NOMINEE but no nominee data
076410000000      *****    was found, an error message will be printed and the
076420000000      *****    nominee name will be defaulted to 'NOMINEE'.  If this
076430000000      *****    occurs, the program that creates the Statement Data file
076440000000      *****    should be reviewed.
076450000000      *****
076460000000
076470990928           IF  AD-NOMINEE              IS  EQUAL TO  "Y"
076480990928           AND WS-NOMINEE-CODE         IS  EQUAL TO  SPACES
076490990928           AND WS-NOMINEE-NAME         IS  EQUAL TO  SPACES
076500990928           AND WS-NOMINEES-ACCT-NO     IS  EQUAL TO  SPACES
076510000000               MOVE SPACES             TO  ERROR-LINE-1
076520000000               SET MSG                 TO  12
076530000000               PERFORM PRINT-ERR-LINE THRU PEL-EXIT
076540990928               MOVE "NOMINEE"          TO  WS-NOMINEE-NAME
076550990928           END-IF
076560990928
076570000000      *****
076580000000      *****    If the account is not flagged as NOMINEE but nominee data
076590000000      *****    is found, an error message will be printed and the
076600000000      *****    nominee data will be set to spaces.  If this occurs, the
076610000000      *****    program that creates the Statement Data file should be
076620000000      *****    reviewed.
076630000000      *****
076640000000
076650000000           IF  AD-NOMINEE     IS EQUAL TO  "Y"
076660000000               GO TO LR1-0020-0030.
076670000000
076680990928           IF  WS-NOMINEE-CODE         IS NOT EQUAL TO  SPACES
076690990928           OR  WS-NOMINEE-NAME         IS NOT EQUAL TO  SPACES
076700990928           OR  WS-NOMINEES-ACCT-NO     IS NOT EQUAL TO  SPACES
076710000000               MOVE SPACES             TO  ERROR-LINE-1
076720000000               SET MSG                 TO  13
076730000000               PERFORM PRINT-ERR-LINE THRU PEL-EXIT
076740000000               MOVE SPACES             TO  WS-NOMINEE-CODE
076750000000               MOVE SPACES             TO  WS-NOMINEE-NAME
076760990928               MOVE SPACES             TO  WS-NOMINEES-ACCT-NO
076770990928           END-IF.
076780000000
076790000000       LR1-0020-0030.
076800000000
076810000000      *****
076820000000      *****    Format the nominee data, if applicable.
076830000000      *****
076840000000
076850990928           IF  WS-NOMINEE-CODE         IS  EQUAL TO  SPACES
076860990928           AND WS-NOMINEE-NAME         IS  EQUAL TO  SPACES
076870990928           AND WS-NOMINEES-ACCT-NO     IS  EQUAL TO  SPACES
076880990928               GO TO LR1-0020-0040
076890990928           END-IF
076900990928
076910990928           IF  WS-NOMINEES-ACCT-NO     IS  EQUAL TO  SPACES
076920000000               MOVE WS-NOMINEE-NAME    TO  WS-NOMINEE
076930990928               GO TO LR1-0020-0040
076940990928           END-IF
076950990928
076960000000           STRING WS-NOMINEE-NAME
076970000000                             DELIMITED BY  "  ",
076980000000                  " ("       DELIMITED BY  SIZE,
076990000000                  WS-NOMINEES-ACCT-NO
077000000000                             DELIMITED BY  " ",
077010000000                  ")"        DELIMITED BY  SIZE
077020000000                                     INTO  WS-NOMINEE.
077030980331
077040980331       LR1-0020-0040.
077050980331
077060000000      *****
077070000000      *****    The literals will be formatted depending on the account
077080000000      *****    language code.  If the language code is not handled,
077090000000      *****    default to English.
077100000000      *****
077110000000
077120000000           IF  AD-LANGUAGE    IS EQUAL TO  "E"
077130000000               SET SCL                 TO  1
077140000000               SET SHL                 TO  1
077150971203               SET SSL                 TO  SHL
077160000000               SET SL                  TO  1
077170000000               GO TO LR1-0030.
077180000000
077190000000           IF  AD-LANGUAGE    IS EQUAL TO  "F"
077200000000               SET SCL                 TO  2
077210000000               SET SHL                 TO  2
077220971203               SET SSL                 TO  SHL
077230000000               SET SL                  TO  2
077240000000               GO TO LR1-0030.
077250000000
077260000000           SET SCL                     TO  1.
077270000000           SET SHL                     TO  1.
077280971203           SET SSL                     TO  SHL.
077290000000           SET SL                      TO  1.
077300000000
077310000000       LR1-0030.
077320990928
077330000626RF6725     SET DI                      TO  1.
077340000626
077350980921           IF WS-LDA-INV-ACC-FLAG IS EQUAL TO "N"
077360991001           OR WS-STMTVRSN         IS EQUAL TO  3
077370000626              GO TO LR1-0030-0003
077380990928           END-IF
077390990928
077400980916           SET II                      TO  1.
077410980910
077420980910       LR1-0030-0001.
077430990928
077440000626RF6725     IF II    IS GREATER THAN   WS-II-LST
077450980917              INITIALIZE INVESTOR-INFO-SECTION
077460980917              MOVE WS-INVESTOR-INFO (II) TO INVESTOR-INFO-SECTION
077470000626              GO TO LR1-0030-0003
077480990928           END-IF
077490990928
077500981005           INITIALIZE INVESTOR-INFO-SECTION.
077510981005           MOVE WS-INVESTOR-INFO (II) TO INVESTOR-INFO-SECTION.
077520981005
077530980916           IF II-ACCOUNT2 OF INVESTOR-INFO-SECTION IS
077540991001                                        NOT EQUAL TO CURR-ACCOUNT
077550980916              SET II UP BY 1
077560990928              GO TO LR1-0030-0001
077570990928           END-IF.
077580990928
077590000626       LR1-0030-0003.
077600000626
077610000626           IF DI    IS GREATER THAN   WS-DI-LST
077620000626              INITIALIZE DEALER-SECTION
077630000626              MOVE WS-DEALER-INFO (DI) TO DEALER-SECTION
077640000626              GO TO LR1-0030-0005
077650000626           END-IF
077660000626
077670000626           INITIALIZE DEALER-SECTION.
077680000626           MOVE WS-DEALER-INFO (DI) TO DEALER-SECTION.
077690000626
077700000626           IF DL-ACCOUNT2 OF DEALER-SECTION IS
077710000626                                        NOT EQUAL TO AD-ACCOUNT
077720000626              SET DI UP BY 1
077730000626              GO TO LR1-0030-0003
077740000626           END-IF.
077750000626
077760000626       LR1-0030-0005.
077770000626
077780000000      *****
077790000000      *****    Format the required fields.
077800000000      *****
077810000000
077820000000           MOVE II-END-DATE            TO  WS-END-DATE.
077830990928           MOVE II-END-DATE            TO  WS-END-DATE-3.
077840000000           MOVE "N"                    TO  WS-PSTCDEPRT-SW.
077850000000           MOVE II-START-DATE          TO  WS-START-DATE.
077860990928           MOVE II-START-DATE          TO  WS-START-DATE-3.
077870000000
077880000000      *****
077890000000      *****    The Statement File Generation (ANNSTMTJSI) formats and
077900000000      *****    creates the Dealer record using the Dealer & Dealer
077910000000      *****    Representative of the first account for the investor.  If
077920000000      *****    an investor has more than one account, the Dealer &
077930000000      *****    Dealer Representative of the accounts may differ.  If
077940000000      *****    this is the case, the Dealer & Dealer Representative
077950000000      *****    names and address lines will be retrieved and formatted.
077960000000      *****
077970000000
077980000000           MOVE SPACES                 TO  WS-BRANCH-ADDR1.
077990000000           MOVE SPACES                 TO  WS-BRANCH-ADDR2.
078000000000           MOVE SPACES                 TO  WS-BRANCH-ADDR3.
078010000000           MOVE SPACES                 TO  WS-BRANCH-ADDR4.
078020000000           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
078030000000           MOVE SPACES                 TO  WS-DEALER-REP-NAMES.
078040000000           MOVE ZEROES                 TO  WS-FAX.
078050000000           MOVE ZEROES                 TO  WS-PHONE.
078060990316           MOVE ZEROES                 TO  WS-PHONE-2.
078070000000           MOVE SPACES                 TO  WS-REP-NAME.
078080000000
078090000000           IF  AD-SALESREP    IS EQUAL TO  DL-SALESREP
078100000000           AND AD-DEALER      IS EQUAL TO  DL-DEALER
078110041222R23390         IF WS-LDA-ATTN-LINE-PRT = 'Y'
078120041222  ¦               IF DL-BRANCH-CO-ATTN NOT = SPACES
078130041222  ¦                  MOVE DL-BRANCH-CO-ATTN  TO  WS-BRANCH-ADDR1
078140041222  ¦                  MOVE DL-BRANCH-ADDR1    TO  WS-BRANCH-ADDR2
078150041222  ¦                  MOVE DL-BRANCH-ADDR2    TO  WS-BRANCH-ADDR3
078160041222  ¦                  MOVE DL-BRANCH-ADDR3    TO  WS-BRANCH-ADDR4
078170041222  ¦                  MOVE DL-BRANCH-ADDR4    TO  WS-BRANCH-ADDR5
078180041222  ¦               ELSE
078190041222  ¦                  MOVE DL-BRANCH-ADDR1    TO  WS-BRANCH-ADDR1
078200041222  ¦                  MOVE DL-BRANCH-ADDR2    TO  WS-BRANCH-ADDR2
078210041222  ¦                  MOVE DL-BRANCH-ADDR3    TO  WS-BRANCH-ADDR3
078220041222  ¦                  MOVE DL-BRANCH-ADDR4    TO  WS-BRANCH-ADDR4
078230041222  ¦               END-IF
078240041222  ¦            ELSE
078250041222  ¦               MOVE DL-BRANCH-ADDR1    TO  WS-BRANCH-ADDR1
078260041222  ¦               MOVE DL-BRANCH-ADDR2    TO  WS-BRANCH-ADDR2
078270041222  ¦               MOVE DL-BRANCH-ADDR3    TO  WS-BRANCH-ADDR3
078280041222  V               MOVE DL-BRANCH-ADDR4    TO  WS-BRANCH-ADDR4
078290041222R23390         END-IF
078300041222
078310971203               MOVE DL-DEALER-NAME     TO  WS-DEALER-NAME
078320971203               MOVE DL-REP-NAME        TO  WS-REP-NAME
078330000000               MOVE DL-FAX             TO  WS-FAX
078340000000               MOVE DL-PHONE           TO  WS-PHONE
078350990316               MOVE DL-BRANCH-PHONE    TO  WS-PHONE-2
078360991001               GO TO LR1-0030-0090
078370041215R23390     END-IF.
078380000000
078390000000      *****
078400000000      *****    The account Dealer & Dealer Representative are different
078410000000      *****    than the dealer.  The following steps will be executed to
078420000000      *****    retrieve and format the Dealer & Dealer Representative
078430000000      *****    names and address lines.
078440000000      *****       1. Read the Dealer file for the name.
078450000000      *****       2. Read the Dealer Representative for the name, fax
078460000000      *****          and phone number.
078470000000      *****       3. Read the Dealer Representative Address for the
078480000000      *****          address lines.
078490000000      *****       4. If required, read the Institution Branch and
078500000000      *****          Institution Address for the address lines.
078510000000      *****       5. Format the address lines field by field, in case
078520000000      *****          one or more of the fields contain spaces.
078530000000      *****       6. Compress the address lines.
078540000000      *****
078550000000
078560000000           INITIALIZE MFADEAP.
078570991001
078580000000           MOVE AD-DEALER              TO  DEALER-CODE
078590000000                                           OF DEALER-RECD.
078600000000           READ DEALER-FILE
078610000000               INVALID KEY
078620000000                   MOVE "DEALER NAME NOT ON FILE            "
078630000000                                       TO  DEALER-NAME
078640991001                                           OF DEALER-RECD
078650041215R23390     END-READ.
078660991001
078670000000           MOVE DEALER-NAME
078680000000                OF DEALER-RECD         TO  WS-DEALER-NAME.
078690000000
078700000000           INITIALIZE MFADEAREP.
078710000000           MOVE AD-DEALER              TO  DEALER-CODE
078720000000                                           OF DEALER-REP-RECD.
078730000000           MOVE AD-SALESREP            TO  DEALER-REP-CODE
078740000000                                           OF DEALER-REP-RECD.
078750000000           READ DEALER-REP-FILE
078760000000               INVALID KEY
078770991001                   INITIALIZE MFADEAREP
078780041215R23390     END-READ.
078790991001
078800000000           MOVE SPACES                 TO  WS-ADRTMP.
078810000000           STRING SALUTATION-CODE
078820000000                  OF DEALER-REP-RECD
078830000000                             DELIMITED BY  " "
078840000000                                     INTO  WS-ADRTMP.
078850000000
078860000000           IF  WS-ADRTMP      IS EQUAL TO  SPACES
078870000000               STRING FIRST-NAME
078880000000                      OF DEALER-REP-RECD
078890000000                             DELIMITED BY  "  "
078900000000                                     INTO  WS-ADRTMP
078910991001           ELSE
078920000000               STRING WS-ADRTMP
078930000000                             DELIMITED BY  "  ",
078940000000                      " "    DELIMITED BY  SIZE,
078950000000                      FIRST-NAME
078960000000                      OF DEALER-REP-RECD
078970000000                             DELIMITED BY  "  "
078980000000                                     INTO  WS-REP-NAME
078990991001               MOVE WS-REP-NAME        TO  WS-ADRTMP
079000041215R23390     END-IF.
079010991001
079020000000           IF  WS-ADRTMP      IS EQUAL TO  SPACES
079030000000               STRING INITIALS
079040000000                      OF DEALER-REP-RECD
079050000000                             DELIMITED BY  "  "
079060000000                                     INTO  WS-ADRTMP
079070991001           ELSE
079080000000               STRING WS-ADRTMP
079090000000                             DELIMITED BY  "  ",
079100000000                      " "    DELIMITED BY  SIZE,
079110000000                      INITIALS
079120000000                      OF DEALER-REP-RECD
079130000000                             DELIMITED BY  "  "
079140000000                                     INTO  WS-REP-NAME
079150991001               MOVE WS-REP-NAME        TO  WS-ADRTMP
079160041215R23390     END-IF.
079170991001
079180000000           IF  WS-ADRTMP      IS EQUAL TO  SPACES
079190000000               STRING LAST-NAME
079200000000                      OF DEALER-REP-RECD
079210000000                             DELIMITED BY  "  "
079220000000                                     INTO  WS-ADRTMP
079230991001           ELSE
079240000000               STRING WS-ADRTMP
079250000000                             DELIMITED BY  "  ",
079260000000                      " "    DELIMITED BY  SIZE,
079270000000                      LAST-NAME
079280000000                      OF DEALER-REP-RECD
079290000000                             DELIMITED BY  "  "
079300000000                                     INTO  WS-REP-NAME
079310991001               MOVE WS-REP-NAME        TO  WS-ADRTMP
079320041215R23390     END-IF.
079330991001
079340000000           MOVE WS-ADRTMP              TO  WS-REP-NAME.
079350000000
079360990707           INITIALIZE MFAINSBRP.
079370990707           MOVE INSTITUTION-CODE
079380990707                OF DEALER-RECD         TO  INSTITUTION-CODE
079390990707                                           OF INSTITUTION-BRANCH-RECD.
079400990707           MOVE BRANCH-CODE
079410990707                OF DEALER-REP-RECD     TO  BRANCH-CODE
079420990707                                           OF INSTITUTION-BRANCH-RECD.
079430990707           READ INSTITUTION-BRANCH
079440990707               INVALID KEY
079450991001                   GO TO LR1-0030-0006
079460041215R23390     END-READ.
079470991001
079480990707           MOVE AREA-CODE OF INSTITUTION-BRANCH-RECD
079490990707                                       TO  WS-SH-PHONE2-01-03.
079500990707           MOVE PHONE-NO OF INSTITUTION-BRANCH-RECD
079510990707                                       TO  WS-SH-PHONE2-04-10.
079520990707       LR1-0030-0006.
079530991001
079540991001           IF  ADDR-NO OF DEALER-REP-RECD    IS EQUAL TO  ZEROES
079550991001               GO TO LR1-0030-0010
079560041215R23390     END-IF.
079570991001
079580000000           INITIALIZE MFADRADRP.
079590000000           MOVE ADDR-NO
079600000000                OF DEALER-REP-RECD     TO  ADDR-NO
079610000000                                           OF DEALER-REP-ADDRESS-RECD.
079620000000            READ DEALER-REP-ADDRESS
079630000000                INVALID KEY
079640991001                    GO TO LR1-0030-0010
079650041215R23390      END-READ.
079660000000
079670000000            MOVE CORR MFADRADRP        TO  MFAINADDP.
079680000000            GO TO LR1-0030-0030.
079690000000
079700000000       LR1-0030-0010.
079710991001
079720000000           INITIALIZE MFAINADDP.
079730991001           MOVE ADDR-NO OF INSTITUTION-BRANCH-RECD
079740991001                        TO  ADDR-NO OF INSTITUTION-ADDRESS-RECD.
079750991001
079760000000           READ INSTITUTION-ADDRESS
079770000000               INVALID KEY
079780991001                   GO TO LR1-0030-0020
079790041215R23390     END-READ.
079800991001
079810000000           GO TO LR1-0030-0030.
079820000000
079830000000       LR1-0030-0020.
079840991001
079850000000           INITIALIZE MFAINSBRP.
079860000000           MOVE INSTITUTION-CODE
079870000000                OF DEALER-RECD         TO  INSTITUTION-CODE
079880000000                                           OF INSTITUTION-BRANCH-RECD.
079890000000           MOVE BRANCH-CODE
079900000000                OF DEALER-RECD         TO  BRANCH-CODE
079910000000                                           OF INSTITUTION-BRANCH-RECD.
079920000000           READ INSTITUTION-BRANCH
079930000000               INVALID KEY
079940000000                   INITIALIZE MFAINADDP
079950041215R23390             GO TO LR1-0030-0030
079960041215R23390     END-READ.
079970000000
079980000000           INITIALIZE MFAINADDP.
079990000000           MOVE ADDR-NO
080000000000                OF INSTITUTION-BRANCH-RECD
080010000000                                       TO  ADDR-NO
080020000000                                           OF INSTITUTION-ADDRESS-RECD.
080030000000           READ INSTITUTION-ADDRESS
080040000000               INVALID KEY
080050000000                   INITIALIZE MFAINADDP
080060041215R23390             GO TO LR1-0030-0030
080070041215R23390     END-READ.
080080000000
080090000000       LR1-0030-0030.
080100991001
080110000000           MOVE SPACES                 TO  WS-ADRTMP.
080120000000           STRING STREET-NO
080130000000               OF INSTITUTION-ADDRESS
080140000000                             DELIMITED BY  "  "
080150000000                                     INTO  WS-ADRTMP.
080160971212
080170971212           IF PROVINCE-CODE OF INSTITUTION-ADDRESS
080180971212              EQUAL TO "QC"
080190041215R23390        GO TO LR1-0030-0030-1
080200041215R23390     END-IF.
080210000000
080220000000           IF  WS-ADRTMP      IS EQUAL TO  SPACES
080230000000               STRING STREET-NAME
080240000000                      OF INSTITUTION-ADDRESS
080250000000                             DELIMITED BY  "  "
080260000000                                     INTO  WS-ADRTMP
080270000000             ELSE
080280000000               STRING WS-ADRTMP
080290000000                             DELIMITED BY  "  ",
080300000000                      " "    DELIMITED BY  SIZE,
080310000000                      STREET-NAME
080320000000                      OF INSTITUTION-ADDRESS
080330000000                             DELIMITED BY  "  "
080340000000                                     INTO  WS-BRANCH-ADDR1
080350041215R23390         MOVE WS-BRANCH-ADDR1    TO  WS-ADRTMP
080360041215R23390     END-IF.
080370000000
080380000000           IF  WS-ADRTMP      IS EQUAL TO  SPACES
080390000000               STRING STREET-TYPE-CODE
080400000000                      OF INSTITUTION-ADDRESS
080410000000                             DELIMITED BY  "  "
080420000000                                     INTO  WS-ADRTMP
080430000000             ELSE
080440000000               STRING WS-ADRTMP
080450000000                             DELIMITED BY  "  ",
080460000000                      " "    DELIMITED BY  SIZE,
080470000000                      STREET-TYPE-CODE
080480000000                      OF INSTITUTION-ADDRESS
080490000000                             DELIMITED BY  "  "
080500000000                                     INTO  WS-BRANCH-ADDR1
080510041215R23390         MOVE WS-BRANCH-ADDR1    TO  WS-ADRTMP
080520041215R23390     END-IF.
080530000000
080540971212              GO TO LR1-0030-0030-2.
080550971212
080560971212       LR1-0030-0030-1.
080570991001
080580971212           IF  WS-ADRTMP     IS EQUAL TO  SPACES
080590971212               STRING STREET-TYPE-CODE OF INSTITUTION-ADDRESS
080600971212                      DELIMITED BY "  "
080610971212                            INTO WS-ADRTMP
080620971212           ELSE
080630971212               STRING WS-ADRTMP
080640971212                      DELIMITED BY "  ",
080650971212                      " "  DELIMITED BY SIZE,
080660971212                      STREET-TYPE-CODE OF INSTITUTION-ADDRESS
080670971212                           DELIMITED BY "  "
080680971212                             INTO WS-BRANCH-ADDR1
080690041215R23390         MOVE WS-BRANCH-ADDR1    TO WS-ADRTMP
080700041215R23390     END-IF.
080710971212
080720971212           IF WS-ADRTMP     IS EQUAL TO SPACES
080730971212                STRING STREET-NAME OF INSTITUTION-ADDRESS
080740971212                             DELIMITED BY "  "
080750971212                             INTO WS-ADRTMP
080760971212           ELSE
080770971212                STRING WS-ADRTMP
080780971212                            DELIMITED BY "  ",
080790971212                       " "  DELIMITED BY SIZE,
080800971212                       STREET-NAME OF INSTITUTION-ADDRESS
080810971212                            DELIMITED BY "  "
080820971212                            INTO WS-BRANCH-ADDR1
080830041215R23390            MOVE WS-BRANCH-ADDR1      TO  WS-ADRTMP
080840041215R23390     END-IF.
080850971212
080860971212       LR1-0030-0030-2.
080870000000           IF  WS-ADRTMP      IS EQUAL TO  SPACES
080880000000               STRING STREET-DIRCT-CODE
080890000000                      OF INSTITUTION-ADDRESS
080900000000                             DELIMITED BY  "  "
080910000000                                     INTO  WS-ADRTMP
080920971212           ELSE
080930000000               STRING WS-ADRTMP
080940000000                             DELIMITED BY  "  ",
080950000000                      " "    DELIMITED BY  SIZE,
080960000000                      STREET-DIRCT-CODE
080970000000                      OF INSTITUTION-ADDRESS
080980000000                             DELIMITED BY  "  "
080990000000                                     INTO  WS-BRANCH-ADDR1
081000041215R23390         MOVE WS-BRANCH-ADDR1    TO  WS-ADRTMP
081010041215R23390     END-IF.
081020000000
081030000000           MOVE WS-ADRTMP              TO  WS-BRANCH-ADDR1.
081040000000
081050000000           MOVE MISC-FIRST-ADDR-LINE
081060000000                OF INSTITUTION-ADDRESS-RECD
081070000000                                       TO  WS-BRANCH-ADDR2.
081080000000           MOVE MISC-SECOND-ADDR-LINE
081090000000                OF INSTITUTION-ADDRESS-RECD
081100000000                                       TO  WS-BRANCH-ADDR3.
081110000000           MOVE CO-OR-ATTENTION
081120000000                OF INSTITUTION-ADDRESS-RECD
081130000000                                       TO  WS-BRANCH-ADDR4.
081140980420
081150980420980420     IF  WS-LDA-ATTN-LINE-PRT = "N"
081160041215R23390         MOVE SPACES TO WS-BRANCH-ADDR4
081170041215R23390     END-IF.
081180000000
081190000000           MOVE POSTAL-CODE
081200000000                OF INSTITUTION-ADDRESS TO  WS-POSTAL.
081210000000           MOVE SPACES                 TO  WS-POSTAL-OUT.
081220000000           IF  COUNTRY-CODE
081230000000               OF INSTITUTION-ADDRESS
081240000000                              IS EQUAL TO  "CAN"
081250000000               MOVE WS-POSTAL1         TO  WS-POSTAL-OUT1
081260000000               MOVE WS-POSTAL2         TO  WS-POSTAL-OUT2
081270000000             ELSE
081280041215R23390         MOVE WS-POSTAL          TO  WS-POSTAL-OUT
081290041215R23390     END-IF.
081300000000
081310000000           MOVE SPACES                 TO  WS-ADRTMP.
081320000000           STRING CITY
081330000000               OF INSTITUTION-ADDRESS
081340000000                             DELIMITED BY  "  "
081350000000                                     INTO  WS-ADRTMP.
081360000000
081370000000           IF  WS-ADRTMP      IS EQUAL TO  SPACES
081380000000               STRING PROVINCE-CODE
081390000000                      OF INSTITUTION-ADDRESS
081400000000                             DELIMITED BY  "  "
081410000000                                     INTO  WS-ADRTMP
081420041215R23390         GO TO LR1-0030-0040
081430041215R23390     END-IF.
081440000000
081450041215R23390     IF  PROVINCE-CODE OF INSTITUTION-ADDRESS = SPACES
081460041215R23390         GO TO LR1-0030-0040
081470041215R23390     END-IF.
081480000000
081490000000           STRING WS-ADRTMP  DELIMITED BY  "  ",
081500000000                  ", "       DELIMITED BY  SIZE,
081510000000                  PROVINCE-CODE
081520000000                  OF INSTITUTION-ADDRESS
081530000000                             DELIMITED BY  "  "
081540000000                                     INTO  WS-BRANCH-ADDR5.
081550000000           MOVE WS-BRANCH-ADDR5        TO  WS-ADRTMP.
081560000000
081570000000       LR1-0030-0040.
081580000000           IF  WS-ADRTMP      IS EQUAL TO  SPACES
081590000000               STRING WS-POSTAL-OUT
081600000000                             DELIMITED BY  "  "
081610000000                                     INTO  WS-ADRTMP
081620000000             ELSE
081630000000               STRING WS-ADRTMP
081640000000                             DELIMITED BY  "  ",
081650000000                      "  "   DELIMITED BY  SIZE,
081660000000                      WS-POSTAL-OUT
081670000000                             DELIMITED BY  "  "
081680000000                                     INTO  WS-BRANCH-ADDR5
081690041215R23390         MOVE WS-BRANCH-ADDR5    TO  WS-ADRTMP
081700041215R23390     END-IF.
081710000000
081720000000           MOVE WS-ADRTMP              TO  WS-BRANCH-ADDR5.
081730000000
081740041215R23390     IF  WS-BRANCH-ADDR1 IS NOT EQUAL TO  SPACES
081750041215R23390         GO TO LR1-0030-0050
081760041215R23390     END-IF.
081770000000
081780041215R23390     IF  WS-BRANCH-ADDR2 IS NOT EQUAL TO  SPACES
081790000000               MOVE WS-BRANCH-ADDR2    TO  WS-BRANCH-ADDR1
081800000000               MOVE SPACES             TO  WS-BRANCH-ADDR2
081810041215R23390         GO TO LR1-0030-0050
081820041215R23390     END-IF.
081830000000
081840041215R23390     IF  WS-BRANCH-ADDR3 IS NOT EQUAL TO  SPACES
081850000000               MOVE WS-BRANCH-ADDR3    TO  WS-BRANCH-ADDR1
081860000000               MOVE SPACES             TO  WS-BRANCH-ADDR3
081870041215R23390         GO TO LR1-0030-0050
081880041215R23390     END-IF.
081890000000
081900041215R23390     IF  WS-BRANCH-ADDR4 IS NOT EQUAL TO  SPACES
081910000000               MOVE WS-BRANCH-ADDR4    TO  WS-BRANCH-ADDR1
081920000000               MOVE SPACES             TO  WS-BRANCH-ADDR4
081930041215R23390         GO TO LR1-0030-0050
081940041215R23390     END-IF.
081950000000
081960000000           MOVE WS-BRANCH-ADDR5        TO  WS-BRANCH-ADDR1.
081970000000           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
081980000000           GO TO LR1-0030-0080.
081990000000
082000000000       LR1-0030-0050.
082010041215R23390     IF  WS-BRANCH-ADDR2 IS NOT EQUAL TO  SPACES
082020041215R23390         GO TO LR1-0030-0060
082030041215R23390     END-IF.
082040000000
082050041215R23390     IF  WS-BRANCH-ADDR3 IS NOT EQUAL TO  SPACES
082060000000               MOVE WS-BRANCH-ADDR3    TO  WS-BRANCH-ADDR2
082070000000               MOVE SPACES             TO  WS-BRANCH-ADDR3
082080041215R23390         GO TO LR1-0030-0060
082090041215R23390     END-IF.
082100000000
082110041215R23390     IF  WS-BRANCH-ADDR4 IS NOT EQUAL TO  SPACES
082120000000               MOVE WS-BRANCH-ADDR4    TO  WS-BRANCH-ADDR2
082130000000               MOVE SPACES             TO  WS-BRANCH-ADDR4
082140041215R23390         GO TO LR1-0030-0060
082150041215R23390     END-IF.
082160000000
082170000000           MOVE WS-BRANCH-ADDR5        TO  WS-BRANCH-ADDR2.
082180000000           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
082190000000           GO TO LR1-0030-0080.
082200000000
082210000000       LR1-0030-0060.
082220000000           IF  WS-BRANCH-ADDR3
082230000000                          IS NOT EQUAL TO  SPACES
082240000000               GO TO LR1-0030-0070.
082250000000
082260000000           IF  WS-BRANCH-ADDR4
082270000000                          IS NOT EQUAL TO  SPACES
082280000000               MOVE WS-BRANCH-ADDR4    TO  WS-BRANCH-ADDR3
082290000000               MOVE SPACES             TO  WS-BRANCH-ADDR4
082300000000               GO TO LR1-0030-0070.
082310000000
082320000000           MOVE WS-BRANCH-ADDR5        TO  WS-BRANCH-ADDR3.
082330000000           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
082340000000           GO TO LR1-0030-0080.
082350000000
082360000000       LR1-0030-0070.
082370000000           IF  WS-BRANCH-ADDR4
082380000000                          IS NOT EQUAL TO  SPACES
082390000000               GO TO LR1-0030-0080.
082400000000
082410000000           MOVE WS-BRANCH-ADDR5        TO  WS-BRANCH-ADDR4.
082420000000           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
082430000000
082440000000       LR1-0030-0080.
082450000000
082460000000           MOVE FAX-AREA
082470000000                OF DEALER-REP-RECD     TO  WS-SH-FAX-01-03.
082480000000           MOVE FAX-PHONE
082490000000                OF DEALER-REP-RECD     TO  WS-SH-FAX-04-10.
082500000000
082510000000           MOVE AREA-CODE
082520000000                OF DEALER-REP-RECD     TO  WS-SH-PHONE-01-03.
082530000000           MOVE PHONE-NO
082540000000                OF DEALER-REP-RECD     TO  WS-SH-PHONE-04-10.
082550000000
082560000000       LR1-0030-0090.
082570000000
082580000000      *****
082590000000      *****    Format the account type description.
082600000000      *****
082610000000
082620000000           MOVE AD-GROUP               TO  WS-ACTTYPGRP.
082630000000           MOVE AD-ACCOUNT-TYPE        TO  WS-ACTTYPIN-PFX.
082640000000           MOVE AD-LOCKED-IN           TO  WS-ACTTYPLCK.
082650000000           MOVE AD-LANGUAGE            TO  WS-ACTTYPLNG.
082660000000           MOVE AD-NOMINEE             TO  WS-ACTTYPNOM.
082670190619183449*    MOVE AD-ACCOUNT-TYPE-SHORT  TO  WS-ACTTYPSHT.
082680190619183449     MOVE Lc-Acct-Type-Code      TO  WS-ACTTYPSHT.
082690000000           MOVE AD-SPOUSAL             TO  WS-ACTTYPSPS.
082700000000           PERFORM FORMAT-ACTTYP-DESC THRU FAD-EXIT.
082710000000
082720000000      *****
082730000000      *****    Initialize the statement for the new account.
082740000000      *****
082750000000
082760000000           MOVE SPACES                 TO  WS-STATEMENT-PAGE.
082770000000           MOVE 1                      TO  WS-SH-PGENO.
082780000000
082790000000      *****
082800000000      *****    Format statement heading line 1.
082810000000      *****
082820000000
082830000000           MOVE SPACES                 TO  STMT-HDG-01.
082840000000
082850990928           IF WS-STMTVRSN              IS EQUAL TO  1
082860990928              MOVE WS-SH01-LIT1 (SL)   TO  SH01V1-LIT1
082870990928              MOVE WS-SH-START-DATE    TO  SH01V1-START-DATE
082880990928              MOVE WS-SH01-LIT2 (SL)   TO  SH01V1-LIT2
082890990928              MOVE WS-SH-END-DATE      TO  SH01V1-END-DATE
082900990928              GO TO LR1-0030-0100
082910041215R23390     END-IF.
082920010517
082930010517R10081     IF WS-STMTVRSN              IS EQUAL TO  4
082940010517              MOVE WS-SH01-LIT1 (SL)   TO  SH01V4-LIT1
082950010517              MOVE WS-SH-START-DATE    TO  SH01V4-START-DATE
082960010517              MOVE WS-SH01-LIT2 (SL)   TO  SH01V4-LIT2
082970010517              MOVE WS-SH-END-DATE      TO  SH01V4-END-DATE
082980010517              GO TO LR1-0030-0100
082990041215R23390     END-IF.
083000990928
083010990928           IF WS-STMTVRSN              IS EQUAL TO  3
083020990928              GO TO LR1-0030-0100
083030041215R23390     END-IF.
083040990928
083050000000           MOVE WS-SH01-LIT1 (SL)      TO  SH01-LIT1.
083060000000           MOVE WS-SH-START-DATE       TO  SH01-START-DATE.
083070000000           MOVE WS-SH01-LIT2 (SL)      TO  SH01-LIT2.
083080000000           MOVE WS-SH-END-DATE         TO  SH01-END-DATE.
083090000000
083100000000       LR1-0030-0100.
083110990928
083120990929           IF WS-STMTVRSN              IS NOT EQUAL TO  3
083130990930              SET SPL                  TO  WS-SPL-HDGFST
083140990930              MOVE STMT-HDG-01         TO  WS-STMTPGE-LNE (SPL)
083150041215R23390     END-IF.
083160000000
083170000000      *****
083180000000      *****    Confirmations are to be printed on a free format form,
083190000000      *****    not on a pre-printed form like the statements.
083200000000      *****    Therefore, format the heading area heading lines.
083210000000      *****
083220000000
083230000000
083240000000      *****
083250000000      *****    Format statement heading line 2.
083260000000      *****
083270000000
083280990928           MOVE SPACES                 TO  STMT-HDG-02.
083290990928
083300990928           IF WS-STMTVRSN              IS EQUAL TO  3
083310990930              SET SPL                  TO  WS-SPL-HDGFST
083320000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
083330000626                 MOVE WS-NOMINEE-NAME  TO  SH02V3-INVESTOR-NAME
083340000626              ELSE
083350990928              MOVE II-INVESTOR-NAME    TO  SH02V3-INVESTOR-NAME
083360000626              END-IF
083370990928              MOVE WS-SH01-LIT1 (SL)   TO  SH02V3-LIT1
083380990928              MOVE WS-SH-START-DATE-3  TO  SH02V3-START-DATE
083390990928              MOVE WS-SH01-LIT2 (SL)   TO  SH02V3-LIT2
083400990928              MOVE WS-SH-END-DATE-3    TO  SH02V3-END-DATE
083410990928              GO TO LR1-0030-0110
083420041215R23390     END-IF.
083430010519
083440000000           MOVE II-SIN-NO              TO  WS-SIN-NO.
083450000000           MOVE SPACES                 TO  WS-SH02-SIN-NO.
083460000825
083470000825RF7395     IF WS-LDA-SIN               IS NOT EQUAL TO "N"
083480000825              MOVE WS-SIN-NO-1-3       TO  SH02-SIN-NO-1-3
083490000825              MOVE "-"                 TO  SH02-SIN-NO-LITDSH1
083500000825              MOVE WS-SIN-NO-4-6       TO  SH02-SIN-NO-4-6
083510000825              MOVE "-"                 TO  SH02-SIN-NO-LITDSH2
083520000825              MOVE WS-SIN-NO-7-9       TO  SH02-SIN-NO-7-9
083530000825           END-IF.
083540000825
083550010519R10081     IF WS-STMTVRSN              IS EQUAL TO  4
083560010519RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
083570010519                 MOVE WS-NOMINEE-NAME  TO  SH02V4-INVESTOR-NAME
083580010519              ELSE
083590010519                 MOVE II-INVESTOR-NAME    TO  SH02V4-INVESTOR-NAME
083600010519              END-IF
083610010519              SET SPL                     UP BY  1
083620010519              GO TO LR1-0030-0110
083630041215R23390     END-IF.
083640010519
083650000626RF6725     IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
083660000626              MOVE WS-NOMINEE-NAME     TO  SH02-INVESTOR-NAME
083670000626           ELSE
083680000626              MOVE II-INVESTOR-NAME    TO  SH02-INVESTOR-NAME
083690041215R23390     END-IF.
083700980213
083710991015           IF WS-LDA-CNFM-DUP-FLAG     IS EQUAL TO  "Y"
083720980213              MOVE WS-SH02-LIT(SL)   TO SH02-LIT
083730980213           ELSE
083740980213              MOVE SPACES            TO SH02-LIT
083750980213           END-IF.
083760980213
083770971203           MOVE WS-PAGE-LIT(SSL)       TO  SH02-PGE-LIT1.
083780000000           MOVE WS-SH-PGENO            TO  SH02-PGENO.
083790971205           SET SPL                     UP BY  2.
083800000000
083810000000       LR1-0030-0110.
083820990928
083830000000           MOVE STMT-HDG-02            TO  WS-STMTPGE-LNE (SPL).
083840990929
083850990928           IF WS-STMTVRSN              IS  NOT EQUAL TO  3
083860990928              SET WS-SPL-SH02          TO  SPL
083870041215R23390     END-IF.
083880990928
083890971204      *****
083900971204      *****    FORMAT STATEMENT EXTRA HEADING LINE
083910971204      *****
083920971204
083930971204           MOVE SPACES                 TO  WS-SH04-INVESTOR-ADDRESS1.
083940990928
083950990928           IF  II-INVESTOR-ADDRESS1    IS EQUAL TO  SPACES
083960990928           AND II-INVESTOR-ADDRESS2    IS EQUAL TO  SPACES
083970990928           AND II-INVESTOR-ADDRESS3    IS EQUAL TO  SPACES
083980990928           AND II-INVESTOR-ADDRESS4    IS EQUAL TO  SPACES
083990990928           AND II-INVESTOR-ADDRESS5    IS EQUAL TO  SPACES
084000971204               MOVE II-POSTAL-CODE     TO  SH04-POSTAL-CODE
084010971204               MOVE "Y"                TO  WS-PSTCDEPRT-SW
084020990928           ELSE
084030971204               MOVE II-INVESTOR-ADDRESS1
084040990928                                       TO  WS-SH04-INVESTOR-ADDRESS1
084050041215R23390     END-IF.
084060990928
084070971204           MOVE SPACES                 TO  STMT-HDG-EXTRA.
084080971204
084090010519R10081     IF WS-STMTVRSN              IS EQUAL TO  4
084100010519             MOVE WS-SH04-INVESTOR-ADDRESS1 TO SHEXV4-INVESTOR-ADDRESS1
084110010519             MOVE WS-PAGE-LIT(SSL)       TO  SHEXV4-PGE-LIT1
084120010519             MOVE WS-SH-PGENO            TO  SHEXV4-PGENO
084130010608             GO TO LR1-0030-0110-0000
084140041215R23390     END-IF.
084150010519
084160990928           IF WS-STMTVRSN              IS EQUAL TO  3
084170990928             MOVE WS-SH04-INVESTOR-ADDRESS1 TO SHEXV3-INVESTOR-ADDRESS1
084180990928             MOVE WS-PAGE-LIT(SSL)       TO  SHEXV3-PGE-LIT1
084190990928             MOVE WS-SH-PGENO            TO  SHEXV3-PGENO
084200990928           ELSE
084210000914RF7813       IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
084220001002      *         MOVE SPACES                   TO SHEX-INVESTOR-ADDRESS1
084230001002                MOVE II-INVESTOR-NAME         TO SHEX-INVESTOR-ADDRESS1
084240000914             ELSE
084250000914               MOVE WS-SH04-INVESTOR-ADDRESS1 TO SHEX-INVESTOR-ADDRESS1
084260000914             END-IF
084270010608           END-IF.
084280990928
084290010608       LR1-0030-0110-0000.
084300010608
084310971204           SET  SPL                    UP BY 1.
084320971204           MOVE STMT-HDG-EXTRA         TO WS-STMTPGE-LNE(SPL).
084330971204
084340990928           IF WS-STMTVRSN              IS  EQUAL TO  3
084350990928              SET WS-SPL-SH02          TO  SPL
084360041215R23390     END-IF.
084370040308
084380000000      *****
084390000000      *****    Format statement heading line 3.
084400000000      *****
084410000000
084420971204           MOVE SPACES                 TO  WS-SH05-INVESTOR-ADDRESS2.
084430971204
084440990928           IF  WS-PSTCDEPRT-SW         IS  EQUAL TO  "N"
084450990928           AND II-INVESTOR-ADDRESS2    IS  EQUAL TO  SPACES
084460990928           AND II-INVESTOR-ADDRESS3    IS  EQUAL TO  SPACES
084470990928           AND II-INVESTOR-ADDRESS4    IS  EQUAL TO  SPACES
084480990928           AND II-INVESTOR-ADDRESS5    IS  EQUAL TO  SPACES
084490971204               MOVE II-POSTAL-CODE     TO  SH05-POSTAL-CODE
084500971204               MOVE "Y"                TO  WS-PSTCDEPRT-SW
084510990928           ELSE
084520990928               MOVE II-INVESTOR-ADDRESS2 TO WS-SH05-INVESTOR-ADDRESS2
084530041215R23390     END-IF.
084540990928
084550971204           MOVE SPACES                 TO  STMT-HDG-03.
084560990820
084570990928           IF WS-STMTVRSN             IS EQUAL TO  1
084580000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
084590040514R22291           MOVE DL-NOMINEE-CO-ATTN  TO SH03V1-INVESTOR-ADDRESS2
084600040514R22291*          MOVE DL-NOMINEE-ADDR1    TO SH03V1-INVESTOR-ADDRESS2
084610000626              ELSE
084620990928              MOVE WS-SH05-INVESTOR-ADDRESS2
084630990820                            TO  SH03V1-INVESTOR-ADDRESS2
084640000626              END-IF
084650990820              IF  SSL IS EQUAL TO  1
084660990820                  MOVE "SERVICES CENTRE :"  TO  SH03V1-LIT1
084670990820              END-IF
084680990820
084690990820              IF  SSL IS EQUAL TO  2
084700990820                  MOVE "POINT D'AFFAIRES:"  TO  SH03V1-LIT1
084710990820              END-IF
084720990820
084730990820              MOVE AD-DEALER              TO  SH03V1-DEALER
084740990820              MOVE WS-DEALER-NAME         TO  SH03V1-DEALER-NAMES
084750040909R22740         IF WS-LDA-DLR-REP-SUPPRESS IS = "Y"
084760040909  ¦             MOVE SPACES TO SH03V1-DEALER
084770040909R22740         END-IF
084780990820              GO TO LR1-0030-0120
084790041215R23390     END-IF.
084800010517
084810010517R10081     IF WS-STMTVRSN             IS EQUAL TO  4
084820010517RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
084830040514R22291           MOVE DL-NOMINEE-CO-ATTN  TO SH03V4-INVESTOR-ADDRESS2
084840040514R22291*          MOVE DL-NOMINEE-ADDR1    TO SH03V4-INVESTOR-ADDRESS2
084850010517              ELSE
084860010517              MOVE WS-SH05-INVESTOR-ADDRESS2
084870010517                            TO  SH03V4-INVESTOR-ADDRESS2
084880010517              END-IF
084890010517              GO TO LR1-0030-0120
084900041215R23390     END-IF.
084910990820
084920990928           IF WS-STMTVRSN             IS EQUAL TO  3
084930000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
084940040514R22291           MOVE DL-NOMINEE-CO-ATTN  TO SH03V3-INVESTOR-ADDRESS2
084950040514R22291*          MOVE DL-NOMINEE-ADDR1    TO SH03V3-INVESTOR-ADDRESS2
084960000626              ELSE
084970990928              MOVE WS-SH05-INVESTOR-ADDRESS2
084980990928                            TO  SH03V3-INVESTOR-ADDRESS2
084990000626              END-IF
085000000626
085010990928              GO TO LR1-0030-0120
085020041215R23390     END-IF.
085030990928
085040000626RF6725     IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
085050040514R22291*       MOVE DL-NOMINEE-ADDR1    TO SH03-INVESTOR-ADDRESS2
085060040514R22291        MOVE DL-NOMINEE-CO-ATTN  TO SH03-INVESTOR-ADDRESS2
085070000626           ELSE
085080041215R23390        MOVE WS-SH05-INVESTOR-ADDRESS2
085090000626                                       TO SH03-INVESTOR-ADDRESS2
085100041215R23390     END-IF.
085110000626
085120971203           MOVE WS-DEALER-LIT(SSL)     TO  SH03-LIT1.
085130971202           MOVE AD-DEALER              TO  SH03-DEALER.
085140971202           MOVE WS-DEALER-NAME         TO  SH03-DEALER-NAMES.
085150041215
085160040909R22740     IF WS-LDA-DLR-REP-SUPPRESS IS = "Y"
085170040909  ¦          MOVE SPACES TO SH03-DEALER
085180040909R22740     END-IF.
085190990312
085200000000
085210000000       LR1-0030-0120.
085220990928
085230990928           SET SPL                     UP BY  1.
085240000000           MOVE STMT-HDG-03            TO  WS-STMTPGE-LNE (SPL).
085250000000
085260000000      *****
085270000000      *****    Format statement heading line 4.
085280000000      *****
085290971204
085300971204           MOVE SPACES                 TO  WS-SH06-INVESTOR-ADDRESS3.
085310971204
085320990928           IF  WS-PSTCDEPRT-SW         IS  EQUAL TO  "N"
085330990928           AND II-INVESTOR-ADDRESS3    IS EQUAL TO  SPACES
085340990928           AND II-INVESTOR-ADDRESS4    IS EQUAL TO  SPACES
085350990928           AND II-INVESTOR-ADDRESS5    IS EQUAL TO  SPACES
085360971205               MOVE II-POSTAL-CODE     TO  SH6-POSTAL-CODE
085370971204               MOVE "Y"                TO  WS-PSTCDEPRT-SW
085380990928           ELSE
085390971204               MOVE II-INVESTOR-ADDRESS3
085400990928                                       TO  WS-SH06-INVESTOR-ADDRESS3
085410041215R23390     END-IF.
085420990928
085430971204           MOVE SPACES                 TO  STMT-HDG-04.
085440990820
085450990928           IF  WS-STMTVRSN               IS EQUAL TO  1
085460000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
085470040514R22291           MOVE DL-NOMINEE-ADDR1    TO SH04V1-INVESTOR-ADDRESS3
085480040514R22291*          MOVE DL-NOMINEE-ADDR2    TO SH04V1-INVESTOR-ADDRESS3
085490000626              ELSE
085500990820               MOVE WS-SH06-INVESTOR-ADDRESS3
085510990820                                         TO  SH04V1-INVESTOR-ADDRESS3
085520000626              END-IF
085530990820               MOVE WS-REP-LIT(SSL)      TO  SH04V1-LIT1
085540990820               MOVE AD-SALESREP          TO  SH04V1-REPNO
085550990820               MOVE WS-REP-NAME          TO  SH04V1-REP-NAME
085560040909R22740         IF WS-LDA-DLR-REP-SUPPRESS IS = "Y"
085570040909  ¦              MOVE SPACES TO SH04V1-REPNO
085580040909R22740         END-IF
085590990928               GO TO LR1-0030-0130
085600041215R23390     END-IF.
085610010517
085620010517R10081     IF  WS-STMTVRSN               IS EQUAL TO  4
085630010517RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
085640040514R22291           MOVE DL-NOMINEE-ADDR1    TO SH04V4-INVESTOR-ADDRESS3
085650040514R22291*          MOVE DL-NOMINEE-ADDR2    TO SH04V4-INVESTOR-ADDRESS3
085660010517              ELSE
085670010517               MOVE WS-SH06-INVESTOR-ADDRESS3
085680010517                                         TO  SH04V4-INVESTOR-ADDRESS3
085690010517              END-IF
085700010519              IF  SSL IS EQUAL TO  1
085710010519                  MOVE "SERVICES CENTRE :"  TO  SH04V4-LIT1
085720010519              END-IF
085730010519
085740010519              IF  SSL IS EQUAL TO  2
085750010519                  MOVE "POINT D'AFFAIRES:"  TO  SH04V4-LIT1
085760010519              END-IF
085770010519
085780010519              MOVE AD-DEALER              TO  SH04V4-DEALER
085790010519              MOVE WS-DEALER-NAME         TO  SH04V4-DEALER-NAMES
085800040909R22740        IF WS-LDA-DLR-REP-SUPPRESS IS = "Y"
085810040909  ¦             MOVE SPACES TO SH04V4-DEALER
085820040909R22740        END-IF
085830010519              GO TO LR1-0030-0130
085840041215R23390     END-IF.
085850990820
085860990928           IF  WS-STMTVRSN               IS EQUAL TO  3
085870000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
085880040514R22291           MOVE DL-NOMINEE-ADDR1    TO SH04V3-INVESTOR-ADDRESS3
085890040514R22291*          MOVE DL-NOMINEE-ADDR2    TO SH04V3-INVESTOR-ADDRESS3
085900000626              ELSE
085910990928               MOVE WS-SH06-INVESTOR-ADDRESS3
085920990928                                         TO  SH04V3-INVESTOR-ADDRESS3
085930000626              END-IF
085940990928               GO TO LR1-0030-0130
085950041215R23390     END-IF.
085960990928
085970000626RF6725     IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
085980040514R22291        MOVE DL-NOMINEE-ADDR1    TO SH04-INVESTOR-ADDRESS3
085990040514R22291*       MOVE DL-NOMINEE-ADDR2    TO SH04-INVESTOR-ADDRESS3
086000000626           ELSE
086010041215              MOVE WS-SH06-INVESTOR-ADDRESS3
086020041215R23390                                 TO  SH04-INVESTOR-ADDRESS3
086030041215R23390     END-IF.
086040041215
086050971203           MOVE WS-REP-LIT(SSL)        TO  SH04-LIT1.
086060971202           MOVE AD-SALESREP            TO  SH04-REPNO.
086070971202           MOVE WS-REP-NAME            TO  SH04-REP-NAME.
086080041215
086090040909R22740     IF WS-LDA-DLR-REP-SUPPRESS IS = "Y"
086100040909  ¦           MOVE SPACES TO SH04-REPNO
086110040909R22740     END-IF.
086120971202
086130000000       LR1-0030-0130.
086140990928
086150990928           SET SPL                     UP BY  1.
086160000000           MOVE STMT-HDG-04            TO  WS-STMTPGE-LNE (SPL).
086170000000
086180000000      *****
086190000000      *****    Format statement heading line 5.
086200000000      *****
086210000000
086220971204           MOVE SPACES                 TO  WS-SH07-INVESTOR-ADDRESS4.
086230971204
086240990928           IF  WS-PSTCDEPRT-SW         IS  EQUAL TO  "N"
086250990928           AND II-INVESTOR-ADDRESS4    IS EQUAL TO  SPACES
086260990928           AND II-INVESTOR-ADDRESS5    IS EQUAL TO  SPACES
086270971204               MOVE II-POSTAL-CODE     TO  SH7-POSTAL-CODE
086280971204               MOVE "Y"                TO  WS-PSTCDEPRT-SW
086290990928           ELSE
086300971204               MOVE II-INVESTOR-ADDRESS4
086310990928                                       TO  WS-SH07-INVESTOR-ADDRESS4
086320041215R23390     END-IF.
086330990928
086340990928           IF  WS-LDA-BRANCH-ADDRESS   IS EQUAL TO  "N"
086350990928               MOVE SPACES             TO  WS-BRANCH-ADDR1
086360041215R23390     END-IF.
086370990928
086380971204           MOVE SPACES                 TO  STMT-HDG-05.
086390971204
086400990928           IF  WS-STMTVRSN             IS EQUAL TO  1
086410000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
086420040514R22291           MOVE DL-NOMINEE-ADDR2    TO SH05V1-INVESTOR-ADDRESS4
086430040514R22291*          MOVE DL-NOMINEE-ADDR3    TO SH05V1-INVESTOR-ADDRESS4
086440000626              ELSE
086450990820                MOVE WS-SH07-INVESTOR-ADDRESS4
086460990820                                           TO SH05V1-INVESTOR-ADDRESS4
086470000626              END-IF
086480990820                MOVE WS-ADDR-LIT(SSL)      TO SH05V1-LIT1
086490990820                MOVE WS-BRANCH-ADDR1       TO SH05V1-BRANCH-ADDR1
086500990928                GO TO LR1-0030-0140
086510041215R23390     END-IF.
086520010517
086530010517R10081     IF  WS-STMTVRSN             IS EQUAL TO  4
086540010517RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
086550040514R22291           MOVE DL-NOMINEE-ADDR2    TO SH05V4-INVESTOR-ADDRESS4
086560040514R22291*          MOVE DL-NOMINEE-ADDR3    TO SH05V4-INVESTOR-ADDRESS4
086570010517              ELSE
086580010517                MOVE WS-SH07-INVESTOR-ADDRESS4
086590010517                                           TO SH05V4-INVESTOR-ADDRESS4
086600010517              END-IF
086610010519              MOVE WS-REP-LIT(SSL)      TO  SH05V4-LIT1
086620010519              MOVE AD-SALESREP          TO  SH05V4-REPNO
086630010519              MOVE WS-REP-NAME          TO  SH05V4-REP-NAME
086640040909R22740        IF WS-LDA-DLR-REP-SUPPRESS IS = "Y"
086650040909  ¦             MOVE SPACES TO SH05V4-REPNO
086660040909R22740        END-IF
086670010519              GO TO LR1-0030-0140
086680041215R23390     END-IF.
086690990928
086700990928           IF  WS-STMTVRSN             IS EQUAL TO  3
086710000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
086720040514R22291           MOVE DL-NOMINEE-ADDR2    TO SH05V3-INVESTOR-ADDRESS4
086730040514R22291*          MOVE DL-NOMINEE-ADDR3    TO SH05V3-INVESTOR-ADDRESS4
086740000626              ELSE
086750990928                MOVE WS-SH07-INVESTOR-ADDRESS4
086760990928                                           TO SH05V3-INVESTOR-ADDRESS4
086770000626              END-IF
086780990928                GO TO LR1-0030-0140
086790041215R23390     END-IF.
086800990928
086810000626RF6725     IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
086820040514R22291        MOVE DL-NOMINEE-ADDR2    TO SH05-INVESTOR-ADDRESS4
086830040514R22291*       MOVE DL-NOMINEE-ADDR3    TO SH05-INVESTOR-ADDRESS4
086840000626           ELSE
086850971204           MOVE WS-SH07-INVESTOR-ADDRESS4
086860041215R23390                                 TO  SH05-INVESTOR-ADDRESS4
086870041215R23390     END-IF.
086880990318
086890990928           IF   WS-STMTVRSN            IS NOT EQUAL TO 2
086900990318                MOVE WS-ADDR-LIT(SSL)       TO  SH05-LIT1
086910990928                MOVE WS-BRANCH-ADDR1        TO  SH05-BRANCH-ADDR1
086920990928           END-IF.
086930990928
086940000000       LR1-0030-0140.
086950990928
086960990928           SET SPL                     UP BY  1.
086970000000           MOVE STMT-HDG-05            TO  WS-STMTPGE-LNE (SPL).
086980000000
086990000000      *****
087000000000      *****    Format statement heading line 6.
087010000000      *****
087020000000
087030971204           MOVE SPACES                 TO  WS-SH08-INVESTOR-ADDRESS5.
087040971204
087050990928           IF  WS-PSTCDEPRT-SW         IS  EQUAL TO  "N"
087060990928           AND II-INVESTOR-ADDRESS5    IS EQUAL TO  SPACES
087070971204               MOVE II-POSTAL-CODE     TO  SH08-POSTAL-CODE
087080971204               MOVE "Y"                TO  WS-PSTCDEPRT-SW
087090990928           ELSE
087100971204               MOVE II-INVESTOR-ADDRESS5
087110990928                                       TO  WS-SH08-INVESTOR-ADDRESS5
087120041215R23390     END-IF.
087130990928
087140990928980417     IF  WS-LDA-BRANCH-ADDRESS   IS EQUAL TO  "N"
087150990928               MOVE SPACES             TO  WS-BRANCH-ADDR2
087160041215R23390     END-IF.
087170990928
087180000000           MOVE SPACES                 TO  STMT-HDG-06.
087190000000
087200990928           IF   WS-STMTVRSN            IS EQUAL TO 1
087210000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
087220040514R22291           MOVE DL-NOMINEE-ADDR3    TO SH06V1-INVESTOR-ADDRESS5
087230040514R22291*          MOVE DL-NOMINEE-ADDR4    TO SH06V1-INVESTOR-ADDRESS5
087240000626              ELSE
087250990820                MOVE WS-SH08-INVESTOR-ADDRESS5
087260990820                                       TO  SH06V1-INVESTOR-ADDRESS5
087270000626              END-IF
087280990820                MOVE WS-BRANCH-ADDR2   TO  SH06V1-BRANCH-ADDR2
087290990928                GO TO LR1-0030-0150
087300041215R23390     END-IF.
087310010517
087320010517R10081     IF   WS-STMTVRSN            IS EQUAL TO 4
087330010517RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
087340040514R22291           MOVE DL-NOMINEE-ADDR3    TO SH06V4-INVESTOR-ADDRESS5
087350040514R22291*          MOVE DL-NOMINEE-ADDR4    TO SH06V4-INVESTOR-ADDRESS5
087360010517              ELSE
087370010517                MOVE WS-SH08-INVESTOR-ADDRESS5
087380010517                                       TO  SH06V4-INVESTOR-ADDRESS5
087390010517              END-IF
087400010519                MOVE WS-ADDR-LIT(SSL)      TO SH06V4-LIT1
087410010519                MOVE WS-BRANCH-ADDR1       TO SH06V4-BRANCH-ADDR1
087420010519      *         MOVE WS-BRANCH-ADDR2   TO  SH06V4-BRANCH-ADDR2
087430010517                GO TO LR1-0030-0150
087440041215R23390     END-IF.
087450990928
087460990928           IF   WS-STMTVRSN            IS EQUAL TO 3
087470000626RF6725        IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
087480040514R22291           MOVE DL-NOMINEE-ADDR3    TO SH06V3-INVESTOR-ADDRESS5
087490040514R22291*          MOVE DL-NOMINEE-ADDR4    TO SH06V3-INVESTOR-ADDRESS5
087500000626              ELSE
087510990928                MOVE WS-SH08-INVESTOR-ADDRESS5
087520990928                                       TO  SH06V3-INVESTOR-ADDRESS5
087530000626              END-IF
087540990928                GO TO LR1-0030-0150
087550041215R23390     END-IF.
087560990928
087570000626RF6725     IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
087580040514R22291        MOVE DL-NOMINEE-ADDR3    TO SH06-INVESTOR-ADDRESS5
087590040514R22291*       MOVE DL-NOMINEE-ADDR4    TO SH06-INVESTOR-ADDRESS5
087600000626           ELSE
087610041215              MOVE WS-SH08-INVESTOR-ADDRESS5
087620041215R23390                                 TO  SH06-INVESTOR-ADDRESS5
087630041215R23390     END-IF.
087640990318
087650990318           IF   WS-STMTVRSN IS NOT EQUAL TO 2
087660990928                MOVE WS-BRANCH-ADDR2   TO  SH06-BRANCH-ADDR2
087670990928           END-IF.
087680990928
087690000000       LR1-0030-0150.
087700990928
087710971205           SET SPL                     UP BY  1.
087720000000           MOVE STMT-HDG-06            TO  WS-STMTPGE-LNE (SPL).
087730000000
087740000000      *****
087750000000      *****    Format statement heading line 7.
087760000000      *****
087770000000
087780971205           MOVE SPACES                 TO  WS-SH09-POSTAL-CODE.
087790971205
087800990928           IF  WS-PSTCDEPRT-SW         EQUAL TO  "N"
087810990928               MOVE II-POSTAL-CODE     TO  WS-SH09-POSTAL-CODE
087820041215R23390     END-IF.
087830990928
087840990928           IF  WS-LDA-BRANCH-ADDRESS   IS EQUAL TO  "N"
087850990928               MOVE SPACES             TO  WS-BRANCH-ADDR3
087860041215R23390     END-IF.
087870000000
087880990928           MOVE SPACES                    TO  STMT-HDG-07.
087890000000
087900990928           IF   WS-STMTVRSN               IS  EQUAL TO 1
087910010807RF9983          IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
087920010807                   MOVE SPACES               TO  SH07V1-POSTAL-CODE
087930010807                ELSE
087940010807                   MOVE WS-SH09-POSTAL-CODE  TO  SH07V1-POSTAL-CODE
087950010807                END-IF
087960010807RF9983*         MOVE WS-SH09-POSTAL-CODE  TO  SH07V1-POSTAL-CODE
087970990823                MOVE WS-BRANCH-ADDR3      TO  SH07V1-BRANCH-ADDR3
087980990928                GO TO LR1-0030-0160
087990041215R23390     END-IF.
088000010517
088010010517R10081     IF   WS-STMTVRSN               IS  EQUAL TO 4
088020010807RF9983          IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
088030010807                   MOVE SPACES               TO  SH07V4-POSTAL-CODE
088040010807                ELSE
088050010807                   MOVE WS-SH09-POSTAL-CODE  TO  SH07V4-POSTAL-CODE
088060010807                END-IF
088070010807RF9983*         MOVE WS-SH09-POSTAL-CODE  TO  SH07V4-POSTAL-CODE
088080010519                MOVE WS-BRANCH-ADDR2      TO  SH07V4-BRANCH-ADDR2
088090010519      *         MOVE WS-BRANCH-ADDR3      TO  SH07V4-BRANCH-ADDR3
088100010517                GO TO LR1-0030-0160
088110041215R23390     END-IF.
088120990928
088130990928           IF   WS-STMTVRSN               IS  EQUAL TO 3
088140010807RF9983          IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
088150010807                   MOVE SPACES               TO  SH07V3-POSTAL-CODE
088160010807                ELSE
088170010807                   MOVE WS-SH09-POSTAL-CODE  TO  SH07V3-POSTAL-CODE
088180010807                END-IF
088190010807RF9983*         MOVE WS-SH09-POSTAL-CODE  TO  SH07V3-POSTAL-CODE
088200990928                GO TO LR1-0030-0160
088210041215R23390     END-IF.
088220990928
088230010807RF9983     IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
088240010807              MOVE SPACES               TO  SH07-POSTAL-CODE
088250010807           ELSE
088260010807              MOVE WS-SH09-POSTAL-CODE  TO  SH07-POSTAL-CODE
088270041215R23390     END-IF.
088280041215
088290010807RF9983*    MOVE WS-SH09-POSTAL-CODE       TO  SH07-POSTAL-CODE.
088300990318
088310990928           IF   WS-STMTVRSN               IS  NOT EQUAL TO 2
088320990928                MOVE WS-BRANCH-ADDR3   TO  SH07-BRANCH-ADDR3
088330990928           END-IF.
088340990928
088350000000       LR1-0030-0160.
088360990928
088370041215R23390     IF STMT-HDG-07 NOT = SPACES
088380041215  ¦           SET SPL                     UP BY  1
088390041215  V           MOVE STMT-HDG-07            TO  WS-STMTPGE-LNE (SPL)
088400041215R23390     END-IF.
088410000000
088420000000      *****
088430000000      *****    Format statement heading line 8.
088440000000      *****
088450000000
088460000000
088470990928           MOVE SPACES                   TO  STMT-HDG-08.
088480000000
088490990928           IF   WS-STMTVRSN              IS EQUAL TO 1
088500990824                MOVE WS-BRANCH-ADDR4     TO  SH08V1-BRANCH-ADDR4
088510990928                GO TO LR1-0030-0170
088520041215R23390     END-IF.
088530010517
088540010517R10081     IF   WS-STMTVRSN              IS EQUAL TO 4
088550010519                MOVE WS-BRANCH-ADDR3     TO  SH08V4-BRANCH-ADDR3
088560010519      *         MOVE WS-BRANCH-ADDR4     TO  SH08V4-BRANCH-ADDR4
088570010517                GO TO LR1-0030-0170
088580041215R23390     END-IF.
088590990928
088600990928           IF   WS-STMTVRSN              IS EQUAL TO 3
088610990929                GO TO LR1-0030-0190
088620990929      *         GO TO LR1-0030-0170
088630041215R23390     END-IF.
088640990928
088650990928           IF   WS-STMTVRSN              IS NOT EQUAL TO 2
088660041215R23390          MOVE WS-BRANCH-ADDR4     TO  SH08-BRANCH-ADDR4
088670041215R23390     END-IF.
088680000000
088690000000       LR1-0030-0170.
088700990928
088710041215R23390     IF STMT-HDG-08 NOT = SPACES
088720041215  ¦           SET SPL                     UP BY  1
088730041215  V           MOVE STMT-HDG-08            TO  WS-STMTPGE-LNE (SPL)
088740041215R23390     END-IF.
088750000000
088760010519R10081*****
088770010519      *****    Format statement heading line 9.
088780010519      *****
088790010519
088800010519
088810010519           MOVE SPACES                   TO  STMT-HDG-09.
088820010519
088830010519           IF   WS-STMTVRSN              IS EQUAL TO 4
088840010519                MOVE WS-BRANCH-ADDR4     TO  SH09-BRANCH-ADDR4
088850010519                GO TO LR1-0030-0170-0100
088860010519           ELSE
088870010519                GO TO LR1-0030-0170-0200
088880010519           END-IF.
088890010519
088900010519       LR1-0030-0170-0100.
088910010519
088920041215R23390     IF STMT-HDG-09 NOT = SPACES
088930041215  ¦           SET SPL                     UP BY  1
088940041215  V           MOVE STMT-HDG-09            TO  WS-STMTPGE-LNE (SPL)
088950041215R23390     END-IF.
088960000000
088970010519R10081 LR1-0030-0170-0200.
088980010519
088990000000      *****
089000000000      *****    Format statement heading line 10.
089010000000      *****
089020000000
089030000000           MOVE SPACES                 TO  WS-SH10-LIT1X.
089040990928
089050000000           IF  WS-NOMINEE IS NOT EQUAL TO  SPACES
089060990928               MOVE WS-SH10-LIT1 (SL)  TO  WS-SH10-LIT1X
089070041215R23390     END-IF.
089080990928
089090990928           IF  WS-STMTVRSN             IS EQUAL TO  3
089100990928               MOVE SPACES                 TO  STMT-HDG-10
089110990928               GO TO LR1-0030-0190
089120041215R23390     END-IF.
089130010523
089140010523R10081     IF  WS-STMTVRSN                IS EQUAL TO 4
089150010523               MOVE SPACES                TO  WS-SH10V4-PHONE
089160010523              IF  WS-PHONE   IS NOT EQUAL TO  ZEROES
089170010523                  MOVE "("                TO  SH10V4-PHONE-LITLB
089180010523                  MOVE WS-SH-PHONE-01-03  TO  SH10V4-PHONE-01-03
089190010523                  MOVE ")"                TO  SH10V4-PHONE-LITRB
089200010523                  MOVE WS-SH-PHONE-04-06  TO  SH10V4-PHONE-04-06
089210010523                  MOVE "-"                TO  SH10V4-PHONE-LITDSH
089220010523                  MOVE WS-SH-PHONE-07-10  TO  SH10V4-PHONE-07-10
089230010523              END-IF
089240010523
089250010523              MOVE SPACES                 TO  STMT-HDG-10
089260010523
089270010523              MOVE WS-SH10-LIT1X          TO  SH10V4-LIT1
089280010523              MOVE WS-PHONE-LIT(SSL)      TO  SH10V4-LIT2
089290010523              MOVE WS-SH10V4-PHONE        TO  SH10V4-PHONE
089300010523
089310010523              GO TO LR1-0030-0190
089320010523
089330041215R23390     END-IF.
089340990928
089350990928           IF  WS-STMTVRSN             IS NOT EQUAL TO 1
089360990928               GO TO LR1-0030-0180
089370041215R23390     END-IF.
089380990928
089390990317           MOVE SPACES                 TO  WS-SH10-PHONE.
089400990316           MOVE SPACES                 TO  WS-SH10V1-PHONE.
089410990316
089420990317           IF  WS-PHONE   IS NOT EQUAL TO  ZEROES
089430990317               MOVE "("                TO  SH10-PHONE-LITLB
089440990317               MOVE WS-SH-PHONE-01-03  TO  SH10-PHONE-01-03
089450990317               MOVE ")"                TO  SH10-PHONE-LITRB
089460990317               MOVE WS-SH-PHONE-04-06  TO  SH10-PHONE-04-06
089470990317               MOVE "-"                TO  SH10-PHONE-LITDSH
089480990317               MOVE WS-SH-PHONE-07-10  TO  SH10-PHONE-07-10.
089490990317
089500990316           IF  WS-PHONE-2   IS NOT EQUAL TO  ZEROES
089510990707               MOVE "("                TO  SH10V1-PHONE-LITLB
089520990316               MOVE WS-SH-PHONE2-01-03 TO  SH10V1-PHONE-01-03
089530990707               MOVE ")"                TO  SH10V1-PHONE-LITRB
089540990316               MOVE WS-SH-PHONE2-04-06 TO  SH10V1-PHONE-04-06
089550990707               MOVE "-"                TO  SH10V1-PHONE-LITDSH
089560990316               MOVE WS-SH-PHONE2-07-10 TO  SH10V1-PHONE-07-10.
089570990316
089580990316           MOVE SPACES                 TO  STMT-HDG-10.
089590990316
089600990316           MOVE WS-SH10-LIT1X          TO  SH10V1-LIT1.
089610990316           MOVE WS-PHONE-LIT(SSL)      TO  SH10V1-LIT2.
089620990317           MOVE WS-SH10-PHONE          TO  SH10V1-PHONE.
089630990317           MOVE WS-SH10V1-PHONE        TO  SH10V1-PHONE-2.
089640990326
089650990326           IF SH10V1-PHONE IS EQUAL TO SPACES
089660990326              MOVE SH10V1-PHONE-2      TO  SH10V1-PHONE
089670990326              MOVE SPACES              TO  SH10V1-PHONE-2.
089680990326
089690990316           GO TO LR1-0030-0190.
089700990316
089710990316       LR1-0030-0180.
089720990317
089730000000           MOVE SPACES                 TO  WS-SH10-PHONE.
089740990317
089750000000           IF  WS-PHONE   IS NOT EQUAL TO  ZEROES
089760000000               MOVE "("                TO  SH10-PHONE-LITLB
089770000000               MOVE WS-SH-PHONE-01-03  TO  SH10-PHONE-01-03
089780000000               MOVE ")"                TO  SH10-PHONE-LITRB
089790000000               MOVE WS-SH-PHONE-04-06  TO  SH10-PHONE-04-06
089800000000               MOVE "-"                TO  SH10-PHONE-LITDSH
089810000000               MOVE WS-SH-PHONE-07-10  TO  SH10-PHONE-07-10.
089820000000
089830000000           MOVE SPACES                 TO  STMT-HDG-10.
089840000000
089850000000           MOVE WS-SH10-LIT1X          TO  SH10-LIT1.
089860990318
089870990318           IF   WS-STMTVRSN IS NOT EQUAL TO 2
089880990318                MOVE WS-PHONE-LIT(SSL)      TO  SH10-LIT2
089890990318                MOVE WS-SH10-PHONE          TO  SH10-PHONE.
089900000000
089910000000       LR1-0030-0190.
089920990928
089930990928           SET SPL                     UP BY  1.
089940000000           MOVE STMT-HDG-10            TO  WS-STMTPGE-LNE (SPL).
089950000000
089960000000      *****
089970000000      *****    Format statement heading line 11.
089980000000      *****
089990000000
090000990928           MOVE SPACES                 TO  STMT-HDG-11.
090010990928
090020990928           IF   WS-STMTVRSN            IS  EQUAL TO  3
090030990928                MOVE WS-SH11V3-LIT1(SL) TO  SH11V3-LIT1
090040990928                GO TO LR1-0030-0200
090050041215R23390     END-IF.
090060990928
090070000000           MOVE SPACES                 TO  WS-SH11-NOMINEE.
090080990928
090090000000           IF  WS-NOMINEE IS NOT EQUAL TO  SPACES
090100990928               MOVE WS-NOMINEE         TO  WS-SH11-NOMINEE
090110041215R23390     END-IF.
090120990928
090130000000           MOVE SPACES                 TO  WS-SH11-FAX.
090140990928
090150000000           IF  WS-FAX     IS NOT EQUAL TO  ZEROES
090160000000               MOVE "("                TO  SH11-FAX-LITLB
090170000000               MOVE WS-SH-FAX-01-03    TO  SH11-FAX-01-03
090180000000               MOVE ")"                TO  SH11-FAX-LITRB
090190000000               MOVE WS-SH-FAX-04-06    TO  SH11-FAX-04-06
090200000000               MOVE "-"                TO  SH11-FAX-LITDSH
090210990928               MOVE WS-SH-FAX-07-10    TO  SH11-FAX-07-10
090220041215R23390     END-IF.
090230990823
090240990823           IF   WS-STMTVRSN IS EQUAL TO 1
090250990823                MOVE WS-SH11-NOMINEE   TO  SH11V1-NOMINEE
090260990823                MOVE WS-FAX-LIT(SSL)   TO  SH11V1-LIT1
090270990823                MOVE WS-SH11-FAX       TO  SH11V1-FAX
090280990928                GO TO LR1-0030-0200
090290041215R23390     END-IF.
090300010517
090310010517R10081     IF   WS-STMTVRSN IS EQUAL TO 4
090320010517                MOVE WS-SH11-NOMINEE   TO  SH11V4-NOMINEE
090330010517                MOVE WS-FAX-LIT(SSL)   TO  SH11V4-LIT1
090340010517                MOVE WS-SH11-FAX       TO  SH11V4-FAX
090350010517                GO TO LR1-0030-0200
090360041215R23390     END-IF.
090370990928
090380000000           MOVE WS-SH11-NOMINEE        TO  SH11-NOMINEE.
090390990318
090400990318           IF   WS-STMTVRSN IS NOT EQUAL TO 2
090410990318                MOVE WS-FAX-LIT(SSL)   TO  SH11-LIT1
090420991001                MOVE WS-SH11-FAX       TO  SH11-FAX
090430991001           END-IF.
090440991001
090450000000       LR1-0030-0200.
090460990928
090470990928           SET SPL                     UP BY  1.
090480000000           MOVE STMT-HDG-11            TO  WS-STMTPGE-LNE (SPL).
090490000000
090500000000      *****
090510000000      *****    Confirmations are to be printed on a free format form,
090520000000      *****    not on a pre-printed form like the statements.
090530000000      *****    Therefore, format the detail area heading lines.
090540000000      *****
090550971205
090560990318      *****
090570990928      *****    Format confirm heading line 12.
090580990318      *****
090590990318
090600971203           MOVE SPACES TO STMT-HDG-12.
090610990318
090620990928           IF WS-STMTVRSN                 IS EQUAL TO  3
090630990928                GO TO LR1-0030-0205
090640041215R23390     END-IF.
090650990928
090660990928           IF WS-STMTVRSN                 IS EQUAL TO  1
090670990928              MOVE WS-ACC-NO-LIT(SSL)     TO  SH12V1-LIT1
090680990928              MOVE AD-ACCOUNT             TO  SH12V1-ACCNO
090690990824
090700990928              IF WS-DEALER-ACCOUNT-NO
090710990928                 IS NOT EQUAL TO  SPACES
090720990928                  MOVE WS-XREF-NO-LIT (SSL)
090730990824                                       TO  SH12V1-LIT2
090740990928                  MOVE WS-DEALER-ACCOUNT-NO
090750990824                                       TO  SH12V1-D-OR-N-NO
090760990928              END-IF
090770990928              GO TO LR1-0030-0205
090780990824           END-IF.
090790010517
090800010517R10081     IF WS-STMTVRSN                 IS EQUAL TO  4
090810010517              MOVE WS-ACC-NO-LIT(SSL)     TO  SH12V4-LIT1
090820010517              MOVE AD-ACCOUNT             TO  SH12V4-ACCNO
090830010517
090840010517              IF WS-DEALER-ACCOUNT-NO
090850010517                 IS NOT EQUAL TO  SPACES
090860010517                  MOVE WS-XREF-NO-LIT (SSL)
090870010517                                       TO  SH12V4-LIT2
090880010517                  MOVE WS-DEALER-ACCOUNT-NO
090890010517                                       TO  SH12V4-D-OR-N-NO
090900010517              END-IF
090910010517              GO TO LR1-0030-0205
090920010517R10081     END-IF.
090930990824
090940990928           MOVE WS-ACC-NO-LIT(SSL)       TO  SH12-LIT1.
090950990928           MOVE AD-ACCOUNT               TO  SH12-ACCNO.
090960990318
090970990928           IF  WS-DEALER-ACCOUNT-NO      IS NOT EQUAL TO  SPACES
090980990928           AND WS-STMTVRSN               IS NOT EQUAL TO 2
090990990928               MOVE WS-XREF-NO-LIT (SSL) TO  SH12-LIT2
091000990928               MOVE WS-DEALER-ACCOUNT-NO TO  SH12-D-OR-N-NO
091010990928           END-IF.
091020990928
091030990824       LR1-0030-0205.
091040990928
091050041215R23390*    IF WS-STMTVRSN                 IS EQUAL TO  3
091060041215  ¦   *       SET SPL                     UP BY 1
091070041215  ¦   *    ELSE
091080041215  ¦   *       SET  SPL                    UP BY 2
091090041215  ¦   *    END-IF
091100041215  V
091110041215R23390     SET SPL UP BY 1.
091120041215
091130971202           MOVE STMT-HDG-12            TO WS-STMTPGE-LNE  (SPL).
091140971202
091150990318      *****
091160990318      *****    Format statement heading line 13.
091170990318      *****
091180990318
091190990928           MOVE SPACES                    TO STMT-HDG-13.
091200990318
091210000825RF7395     IF WS-LDA-SIN                  IS EQUAL TO "N"
091220010519R10081        MOVE SPACES                 TO  WS-SIN-NO-LIT(SSL)
091230010519              MOVE SPACES                 TO  WS-SIN-NO-LIT-4(SSL)
091240000825           END-IF.
091250000825
091260990928           IF WS-STMTVRSN                 IS EQUAL TO 1
091270990928              MOVE WS-ACC-TYPE-LIT(SSL)   TO  SH13V1-LIT1
091280990928              MOVE WS-ACTTYPOUT           TO  SH13V1-ACCTTYPE
091290990928              MOVE WS-SIN-NO-LIT(SSL)     TO  SH13V1-LIT2
091300990928              MOVE WS-SH02-SIN-NO         TO  SH13V1-SIN-NO
091310990928              GO TO LR1-0030-0210
091320041215R23390     END-IF.
091330010517
091340010517R10081     IF WS-STMTVRSN                 IS EQUAL TO 4
091350010517              MOVE WS-ACC-TYPE-LIT(SSL)   TO  SH13V4-LIT1
091360010517              MOVE WS-ACTTYPOUT           TO  SH13V4-ACCTTYPE
091370010519              MOVE WS-SIN-NO-LIT-4(SSL)   TO  SH13V4-LIT2
091380010517              MOVE WS-SH02-SIN-NO         TO  SH13V4-SIN-NO
091390010517              GO TO LR1-0030-0210
091400041215R23390     END-IF.
091410990928
091420990928           IF WS-STMTVRSN                 IS EQUAL TO 3
091430990928              MOVE WS-SH13V3-LIT1(SL)     TO  SH13V3-LIT1
091440990928              MOVE AD-ACCOUNT             TO  SH13V3-ACCNO
091450990928              GO TO LR1-0030-0210
091460041215R23390     END-IF.
091470990928
091480971204           MOVE WS-ACC-TYPE-LIT(SSL)   TO  SH13-LIT1.
091490971204           MOVE WS-ACTTYPOUT           TO  SH13-ACCTTYPE.
091500971205           MOVE WS-SIN-NO-LIT(SSL)     TO  SH13-LIT2.
091510971205           MOVE WS-SH02-SIN-NO         TO  SH13-SIN-NO.
091520990823
091530990823       LR1-0030-0210.
091540990928
091550990928           SET SPL                     UP BY  1.
091560971202           MOVE STMT-HDG-13            TO WS-STMTPGE-LNE (SPL).
091570971202
091580010607R10383     IF WS-STMTVRSN              IS EQUAL TO  4
091590010607              GO TO LR1-0030-0250
091600041215R23390     END-IF.
091610010522
091620990928           IF WS-STMTVRSN              IS EQUAL TO  3
091630990929              SET SPL                     UP BY  2
091640990928              MOVE WS-SHL03-1 (SHL)       TO  WS-STMTPGE-LNE (SPL)
091650990928              SET SPL                     UP BY  1
091660990928              MOVE WS-SHL03-2 (SHL)       TO  WS-STMTPGE-LNE (SPL)
091670990928              SET SPL                     UP BY  1
091680990928              MOVE WS-SHL03-3 (SHL)       TO  WS-STMTPGE-LNE (SPL)
091690990928              SET SPL                     UP BY  1
091700990928              MOVE WS-SHL03-4 (SHL)       TO  WS-STMTPGE-LNE (SPL)
091710990928           ELSE
091720990928              SET SPL                     UP BY  2
091730990928              MOVE WS-SHL01 (SHL)         TO  WS-STMTPGE-LNE (SPL)
091740990928              SET SPL                     UP BY  1
091750990928              MOVE WS-SHL02 (SHL)         TO  WS-STMTPGE-LNE (SPL)
091760990928              SET SPL                     UP BY  1
091770990928              MOVE WS-SHL03 (SHL)         TO  WS-STMTPGE-LNE (SPL)
091780990928              SET SPL                     UP BY  1
091790990928              MOVE WS-SHL04 (SHL)         TO  WS-STMTPGE-LNE (SPL)
091800010522           END-IF.
091810990928
091820000000      *****
091830000000      *****    Format the messages.  Initially, attempt to format the
091840000000      *****    statement messages using the Account Type Code.  If none
091850000000      *****    are found, use an Account Type Code of spaces.
091860000000      *****
091870010522
091880010531R10383 LR1-0030-0250.
091890000000
091900000000           MOVE SPACES                 TO  WS-STATEMENT-PAGE-MESSAGE.
091910000000           MOVE AD-FUND-NO             TO  WS-FUND-NO.
091920000000
091930000000       LR1-0040.
091940990928
091950000000           MOVE LOW-VALUES             TO  STMT-MSG-RECD.
091960190619183449*    MOVE AD-ACCOUNT-TYPE-SHORT  TO  ACCOUNT-TYPE-CODE
091970190619183449     MOVE Lc-Acct-Type-Code      TO  ACCOUNT-TYPE-CODE
091980000000                                           OF STMT-MSG-RECD.
091990000000           MOVE AD-LANGUAGE            TO  LANGUAGE-CODE
092000000000                                           OF STMT-MSG-RECD.
092010000000           START STMT-MSG-FILE
092020000000               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
092030000000               INVALID KEY
092040000000                   GO TO LR1-0070.
092050000000
092060000000       LR1-0050.
092070990928
092080000000           READ STMT-MSG-FILE NEXT     AT  END
092090000000               GO TO LR1-0070.
092100000000
092110000000           IF  LINE-NO    IS GREATER THAN  WS-SPML-MAX
092120000000           OR  LANGUAGE-CODE
092130000000               OF STMT-MSG-RECD
092140000000                          IS NOT EQUAL TO  AD-LANGUAGE
092150000000           OR  ACCOUNT-TYPE-CODE
092160000000               OF STMT-MSG-RECD
092170190619183449*                   IS NOT EQUAL TO  AD-ACCOUNT-TYPE-SHORT
092180190619183449                    IS NOT EQUAL TO  Lc-Acct-Type-Code
092190000000               GO TO LR1-0070.
092200000000
092210000000           IF  LINE-NO   NOT GREATER THAN  ZEROES
092220000000               GO TO LR1-0060.
092230000000
092240000000           MOVE SPACES                 TO  STMT-MSG-01.
092250000000           MOVE STATEMENT-MESSAGE      TO  SM01-STATEMENT-MESSAGE.
092260000000
092270000000           SET SPML                    TO  LINE-NO.
092280971128      *****MOVE STMT-MSG-01            TO  WS-STMTPGE-MSGLNE (SPML).
092290000000
092300000000       LR1-0060.
092310991001
092320000000           GO TO LR1-0050.
092330000000
092340000000       LR1-0070.
092350000000
092360000000      *****
092370000000      *****    If no statement messages were formatted and the Account
092380000000      *****    Type Code being used was not spaces, attempt to format
092390000000      *****    statement messages using an Account Type Code of spaces.
092400000000      *****
092410000000
092420000000           IF  WS-STATEMENT-PAGE-MESSAGE
092430000000                              IS EQUAL TO  SPACES
092440000000           AND AD-ACCOUNT-TYPE-SHORT
092450000000                          IS NOT EQUAL TO  SPACES
092460000000               MOVE SPACES             TO  AD-ACCOUNT-TYPE-SHORT
092470000000               GO TO LR1-0040.
092480971128
092490971128           GO TO LR1-0070-0000-0010.
092500000000
092510990331      *****MOVE WS-SHL05 (SHL)         TO  WS-STMTPGE-SEP.
092520990331      *****MOVE WS-STATEMENT-PAGE-MESSAGE
092530990331      *****                            TO  WS-STMTPGE-MSG.
092540000000
092550000000       LR1-0070-0000-0010.
092560000000
092570000000      *****
092580000000      *****    Position at first detail line.
092590000000      *****
092600000000
092610000000           SET SPL                     TO  WS-SPL-DTLFST.
092620000000
092630010619R10404     IF WS-STMTVRSN              IS EQUAL TO  4
092640010607              SET SPL                  TO  WS-SPL-DTLFST
092650010619              SET SPL                  DOWN BY 6
092660010619R10404     END-IF.
092670010607
092680000000      *****
092690000000      *****    Determine if the client statement copy is to be
092700000000      *****    suppressed.  This is done depending on whether or not the
092710000000      *****    account being processed is a nominee account.
092720000000      *****
092730000000
092740000000           MOVE "N"                    TO  WS-CLTSPR-SW.
092750000000
092760000000           IF  WS-NOMINEE IS NOT EQUAL TO  SPACES
092770000000               GO TO LR1-0070-0030.
092780000000
092790000000      *****
092800000000      *****    Processing a non-nominee account.  Initially read through
092810000000      *****    the Dealer Mailing Instruction.  If the form CONFMSPR is
092820000000      *****    found, the client copy statement is to be suppressed.
092830000000      *****
092840000000
092850000000           MOVE SPACES                 TO  DEALER-MAILING-INSTR-RECD.
092860000000           MOVE AD-DEALER              TO  DEALER-CODE
092870000000                                           OF DEALER-MAILING-INSTR-RECD.
092880000000           MOVE "CONFMSPR  "           TO  FORM-CODE
092890000000                                           OF DEALER-MAILING-INSTR-RECD.
092900000000           START DEALER-MAILING-INSTR
092910000000               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
092920000000               INVALID KEY
092930000000                   GO TO LR1-0070-0010.
092940000000
092950000000           READ DEALER-MAILING-INSTR NEXT
092960000000                                       AT  END
092970000000               GO TO LR1-0070-0010.
092980000000
092990000000           IF  FORM-CODE
093000000000               OF DEALER-MAILING-INSTR-RECD
093010000000                          IS NOT EQUAL TO  "CONFMSPR  "
093020000000           OR  DEALER-CODE
093030000000               OF DEALER-MAILING-INSTR-RECD
093040000000                          IS NOT EQUAL TO  AD-DEALER
093050000000               GO TO LR1-0070-0010.
093060000000
093070000000           MOVE "Y"                    TO  WS-CLTSPR-SW.
093080000000           GO TO LR1-0070-0020.
093090000000
093100000000       LR1-0070-0010.
093110000000
093120000000      *****
093130000000      *****    Processing a non-nominee account.  The client statement
093140000000      *****    copy is to be printed, according to the Dealer Mailing
093150000000      *****    Instruction.  Now read through the Dealer Representative
093160000000      *****    Mailing Instruction.  If the form CONFMSPR is found, the
093170000000      *****    client statement copy is to be suppressed.
093180000000      *****
093190000000
093200000000           MOVE SPACES                 TO  DLRREP-MAILING-INSTR-RECD.
093210000000           MOVE AD-DEALER              TO  DEALER-CODE
093220000000                                           OF DLRREP-MAILING-INSTR-RECD.
093230000000           MOVE AD-SALESREP            TO  DEALER-REP-CODE
093240000000                                           OF DLRREP-MAILING-INSTR-RECD.
093250000000           MOVE "CONFMSPR  "           TO  FORM-CODE
093260000000                                           OF DLRREP-MAILING-INSTR-RECD.
093270000000           START DEALER-REP-MAILING-INSTR
093280000000               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
093290000000               INVALID KEY
093300000000                   GO TO LR1-0070-0020.
093310000000
093320000000           READ DEALER-REP-MAILING-INSTR NEXT
093330000000                                       AT  END
093340000000               GO TO LR1-0070-0020.
093350000000
093360000000           IF  FORM-CODE
093370000000               OF DLRREP-MAILING-INSTR-RECD
093380000000                          IS NOT EQUAL TO  "CONFMSPR  "
093390000000           OR  DEALER-REP-CODE
093400000000               OF DLRREP-MAILING-INSTR-RECD
093410000000                          IS NOT EQUAL TO  AD-SALESREP
093420000000           OR  DEALER-CODE
093430000000               OF DLRREP-MAILING-INSTR-RECD
093440000000                          IS NOT EQUAL TO  AD-DEALER
093450000000               GO TO LR1-0070-0020.
093460000000
093470000000           MOVE "Y"                    TO  WS-CLTSPR-SW.
093480000000
093490000000       LR1-0070-0020.
093500000000           GO TO LR1-0070-0050.
093510000000
093520000000       LR1-0070-0030.
093530000000
093540000000      *****
093550000000      *****    Processing a nominee account.  Read through the Nominee
093560000000      *****    Mailing Instruction.  If the form CONFMCLT is not found,
093570000000      *****    the client copy statement is to be suppressed.
093580000000      *****
093590000000
093600000000           IF  WS-NOMINEE-CODE   EQUAL TO  SPACES
093610000000               GO TO LR1-0070-0050.
093620000000
093630000000           MOVE SPACES                 TO  NOMINEE-MAILING-INST-RECD.
093640000000           MOVE WS-NOMINEE-CODE        TO  NOMINEE-CODE
093650000000                                           OF NOMINEE-MAILING-INST-RECD.
093660000000           MOVE "CONFMCLT  "           TO  FORM-CODE
093670000000                                           OF NOMINEE-MAILING-INST-RECD.
093680000000           START NOMINEE-MAILING-INSTRUCTIONS
093690000000               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
093700000000               INVALID KEY
093710000000                   GO TO LR1-0070-0040.
093720000000
093730000000           READ NOMINEE-MAILING-INSTRUCTIONS NEXT
093740000000                                       AT  END
093750000000               GO TO LR1-0070-0040.
093760000000
093770041215R23390     IF  FORM-CODE OF NOMINEE-MAILING-INST-RECD
093780000000                          IS NOT EQUAL TO  "CONFMCLT  "
093790041215R23390     OR  NOMINEE-CODE OF NOMINEE-MAILING-INST-RECD
093800000000                          IS NOT EQUAL TO  WS-NOMINEE-CODE
093810000000               GO TO LR1-0070-0040.
093820000000
093830000000           GO TO LR1-0070-0050.
093840000000
093850000000       LR1-0070-0040.
093860000000           MOVE "Y"                    TO  WS-CLTSPR-SW.
093870000000
093880000000       LR1-0070-0050.
093890000000
093900000000      *****
093910000000      *****    Read through the Dealer Mailing Instruction to determine
093920000000      *****    if the Statement Print Header is to be flagged to print
093930000000      *****    dealer copies of the statements.
093940000000      *****
093950000000
093960000000           MOVE SPACES                 TO  WS-DEAMLGINS-REC.
093970000000
093980000000           MOVE SPACES                 TO  DEALER-MAILING-INSTR-RECD.
093990000000           MOVE AD-DEALER              TO  DEALER-CODE
094000000000                                           OF DEALER-MAILING-INSTR-RECD.
094010000000           MOVE "CONFMDLR  "           TO  FORM-CODE
094020000000                                           OF DEALER-MAILING-INSTR-RECD.
094030000000           START DEALER-MAILING-INSTR
094040000000               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
094050000000               INVALID KEY
094060000000                   GO TO LR1-0080.
094070000000
094080000000           READ DEALER-MAILING-INSTR NEXT
094090041215             AT  END
094100000000               GO TO LR1-0080.
094110000000
094120041215R23390     IF  FORM-CODE OF DEALER-MAILING-INSTR-RECD
094130000000                          IS NOT EQUAL TO  "CONFMDLR  "
094140041215R23390     OR  DEALER-CODE OF DEALER-MAILING-INSTR-RECD
094150000000                          IS NOT EQUAL TO  AD-DEALER
094160000000               GO TO LR1-0080.
094170000000
094180000000           MOVE DEALER-MAILING-INSTR-RECD
094190000000                                       TO  WS-DEAMLGINS-REC.
094200000000
094210000000       LR1-0080.
094220000000
094230000000      *****
094240000000      *****    Determine if the Statement Print Header is to be flagged
094250000000      *****    to print dealer representative copies of the statements.
094260000000      *****    Initially read through the Dealer Mailing Instruction.
094270000000      *****    If a record is not found, read through the Dealer
094280000000      *****    Representative Mailing Instuction.
094290000000      *****
094300000000
094310000000           MOVE SPACES                 TO  WS-DERMLGINS-REC.
094320000000
094330000000           MOVE SPACES                 TO  DEALER-MAILING-INSTR-RECD.
094340000000           MOVE AD-DEALER              TO  DEALER-CODE
094350000000                                           OF DEALER-MAILING-INSTR-RECD.
094360000000           MOVE "CONFMREP  "           TO  FORM-CODE
094370000000                                           OF DEALER-MAILING-INSTR-RECD.
094380000000           START DEALER-MAILING-INSTR
094390000000               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
094400000000               INVALID KEY
094410000000                   GO TO LR1-0080-0010.
094420000000
094430000000           READ DEALER-MAILING-INSTR NEXT
094440000000                                       AT  END
094450000000               GO TO LR1-0080-0010.
094460000000
094470041215R23390     IF  FORM-CODE OF DEALER-MAILING-INSTR-RECD
094480000000                          IS NOT EQUAL TO  "CONFMREP  "
094490041215R23390     OR  DEALER-CODE OF DEALER-MAILING-INSTR-RECD
094500000000                          IS NOT EQUAL TO  AD-DEALER
094510000000               GO TO LR1-0080-0010.
094520000000
094530041215R23390     MOVE CORR MFADEAMIP OF DEALER-MAILING-INSTR-RECD
094540041215R23390       TO  MFADERMIP     OF WS-DERMLGINS-REC.
094550041215R23390     MOVE AD-SALESREP TO  DEALER-REP-CODE OF WS-DERMLGINS-REC.
094560041215
094570000000           GO TO LR1-0090.
094580000000
094590000000       LR1-0080-0010.
094600000000           MOVE SPACES                 TO  DLRREP-MAILING-INSTR-RECD.
094610000000           MOVE AD-DEALER              TO  DEALER-CODE
094620000000                                           OF DLRREP-MAILING-INSTR-RECD.
094630000000           MOVE AD-SALESREP            TO  DEALER-REP-CODE
094640000000                                           OF DLRREP-MAILING-INSTR-RECD.
094650000000           MOVE "CONFMREP  "           TO  FORM-CODE
094660000000                                           OF DLRREP-MAILING-INSTR-RECD.
094670000000           START DEALER-REP-MAILING-INSTR
094680000000               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
094690000000               INVALID KEY
094700000000                   GO TO LR1-0090.
094710000000
094720000000           READ DEALER-REP-MAILING-INSTR NEXT
094730000000                                       AT  END
094740000000               GO TO LR1-0090.
094750000000
094760041215R23390     IF  FORM-CODE OF DLRREP-MAILING-INSTR-RECD
094770000000                          IS NOT EQUAL TO  "CONFMREP  "
094780041215R23390     OR  DEALER-REP-CODE OF DLRREP-MAILING-INSTR-RECD
094790000000                          IS NOT EQUAL TO  AD-SALESREP
094800041215R23390     OR  DEALER-CODE OF DLRREP-MAILING-INSTR-RECD
094810000000                          IS NOT EQUAL TO  AD-DEALER
094820000000               GO TO LR1-0090.
094830000000
094840041215R23390     MOVE DLRREP-MAILING-INSTR-RECD TO  WS-DERMLGINS-REC.
094850000000
094860000000       LR1-0090.
094870000000
094880000000      *****
094890000000      *****    Read through the Nominee Instruction to determine if the
094900000000      *****    Statement Print Header is to be flagged to print nominee
094910000000      *****    copies of the statements.
094920000000      *****
094930000000
094940000000           MOVE SPACES                 TO  WS-NOMMLGINS-REC.
094950000000           IF  WS-NOMINEE-CODE   EQUAL TO  SPACES
094960000000               GO TO LR1-0090-0010.
094970000000
094980000000           MOVE SPACES                 TO  NOMINEE-MAILING-INST-RECD.
094990000000           MOVE WS-NOMINEE-CODE        TO  NOMINEE-CODE
095000000000                                           OF NOMINEE-MAILING-INST-RECD.
095010000000           MOVE "CONFMNOM  "           TO  FORM-CODE
095020000000                                           OF NOMINEE-MAILING-INST-RECD.
095030000000           START NOMINEE-MAILING-INSTRUCTIONS
095040000000               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
095050000000               INVALID KEY
095060000000                   GO TO LR1-0090-0010.
095070000000
095080000000           READ NOMINEE-MAILING-INSTRUCTIONS NEXT
095090000000                                       AT  END
095100000000               GO TO LR1-0090-0010.
095110000000
095120041215R23390     IF  FORM-CODE OF NOMINEE-MAILING-INST-RECD
095130000000                          IS NOT EQUAL TO  "CONFMNOM  "
095140041215R23390     OR  NOMINEE-CODE OF NOMINEE-MAILING-INST-RECD
095150000000                          IS NOT EQUAL TO  WS-NOMINEE-CODE
095160000000               GO TO LR1-0090-0010.
095170000000
095180041215R23390     MOVE NOMINEE-MAILING-INST-RECD TO  WS-NOMMLGINS-REC.
095190000000
095200000000       LR1-0090-0010.
095210000000
095220000000      *****
095230000000      *****    Format the Statement Print Header record.
095240000000      *****
095250000000
095260000000           MOVE "N"                    TO  WS-STMT-PRT-HDR-WSW.
095270981001           INITIALIZE                      STMT-PRT-HDR-RECD.
095280000000           MOVE AD-INVESTOR-NO         TO  INVESTOR-NO
095290000000                                           OF STMT-PRT-HDR-RECD.
095300000000           MOVE AD-ACCOUNT             TO  ACCOUNT
095310000000                                           OF STMT-PRT-HDR-RECD.
095320000000           MOVE AD-LANGUAGE            TO  LANGUAGE-CODE
095330000000                                           OF STMT-PRT-HDR-RECD.
095340000000           MOVE AD-DEALER              TO  DEALER
095350000000                                           OF STMT-PRT-HDR-RECD.
095360000000           MOVE AD-SALESREP            TO  DEALER-REP-CODE
095370000000                                           OF STMT-PRT-HDR-RECD.
095380981001           IF II-SIN-NO IS NUMERIC
095390981001              MOVE II-SIN-NO           TO  SOCIAL-INSURANCE-NO
095400981001                                       OF STMT-PRT-HDR-RECD
095410981001           ELSE
095420981001              MOVE ZEROES              TO  SOCIAL-INSURANCE-NO
095430981001                                       OF STMT-PRT-HDR-RECD.
095440000000           MOVE WS-CLTSPR-SW           TO  CLIENT-COPY-SUPPRESSED
095450000000                                           OF STMT-PRT-HDR-RECD.
095460000000           MOVE II-HOLD-MAIL           TO  HOLD-MAIL
095470000000                                           OF STMT-PRT-HDR-RECD.
095480000000           MOVE BRANCH-CODE
095490000000                OF WS-DEAMLGINS-REC    TO  DEALER-BRANCH-CODE
095500000000                                           OF STMT-PRT-HDR-RECD.
095510000000           MOVE FREQUENCY-CODE
095520000000                OF WS-DEAMLGINS-REC    TO  DEALER-FREQUENCY-CODE
095530000000                                           OF STMT-PRT-HDR-RECD.
095540000000           MOVE METHOD-OF-DELIVERY
095550000000                OF WS-DEAMLGINS-REC    TO  DEALER-METHOD-OF-DELIVERY
095560000000                                           OF STMT-PRT-HDR-RECD.
095570000000           MOVE SEND-TO
095580000000                OF WS-DEAMLGINS-REC    TO  DEALER-SEND-TO
095590000000                                           OF STMT-PRT-HDR-RECD.
095600000000           MOVE BRANCH-CODE
095610000000                OF WS-DERMLGINS-REC    TO  DLR-REP-BRANCH-CODE
095620000000                                           OF STMT-PRT-HDR-RECD.
095630000000           MOVE FREQUENCY-CODE
095640000000                OF WS-DERMLGINS-REC    TO  DLR-REP-FREQUENCY-CODE
095650000000                                           OF STMT-PRT-HDR-RECD.
095660000000           MOVE METHOD-OF-DELIVERY
095670000000                OF WS-DERMLGINS-REC    TO  DLR-REP-METHOD-OF-DELIVERY
095680000000                                           OF STMT-PRT-HDR-RECD.
095690000000           MOVE SEND-TO
095700000000                OF WS-DERMLGINS-REC    TO  DLR-REP-SEND-TO
095710000000                                           OF STMT-PRT-HDR-RECD.
095720000000           MOVE WS-NOMINEE-CODE        TO  NOMINEE-CODE
095730000000                                           OF STMT-PRT-HDR-RECD.
095740000000           MOVE BRANCH-CODE
095750000000                OF WS-NOMMLGINS-REC    TO  NOMINEE-BRANCH-CODE
095760000000                                           OF STMT-PRT-HDR-RECD.
095770000000           MOVE FREQUENCY-CODE
095780000000                OF WS-NOMMLGINS-REC    TO  NOMINEE-FREQUENCY-CODE
095790000000                                           OF STMT-PRT-HDR-RECD.
095800000000           MOVE METHOD-OF-DELIVERY
095810000000                OF WS-NOMMLGINS-REC    TO  NOMINEE-METHOD-OF-DELIVERY
095820000000                                           OF STMT-PRT-HDR-RECD.
095830000000           MOVE SEND-TO
095840000000                OF WS-NOMMLGINS-REC    TO  NOMINEE-SEND-TO
095850000000                                           OF STMT-PRT-HDR-RECD.
095860000000           MOVE II-COUNTRY-CODE        TO  COUNTRY-CODE
095870000000                                           OF STMT-PRT-HDR-RECD.
095880980129           MOVE AD-START-DATE          TO  START-DATE
095890980129                                           OF STMT-PRT-HDR-RECD.
095900980129           MOVE AD-END-DATE            TO  END-DATE
095910980129                                           OF STMT-PRT-HDR-RECD.
095920010123RF7633*    MOVE IS-ENTERED-BY          TO  ENTERED-BY
095930010123rf8476     MOVE WS-ENTERED-BY          TO  ENTERED-BY
095940001003                                           OF STMT-PRT-HDR-RECD.
095950000000
095960000000      *****
095970000000      *****    Initialize the statement currency totals.
095980000000      *****
095990000000
096000000000           SET SC                      TO  1.
096010000000
096020000000       LR1-0100.
096030010517           MOVE ZEROES         TO  WS-SC-MARKET-VALUE (SC).
096040010517R10081     MOVE ZEROES         TO  WS-SC-MARKET-VALUE-FUND (SC).
096050010517R10081     MOVE ZEROES         TO  WS-SC-MARKET-VALUE-GIC-DII (SC).
096060000000           MOVE "N"                    TO  WS-SC-RPTIND (SC).
096070000000           IF  SC            IS LESS THAN  WS-SC-MAX
096080000000               SET SC               UP BY  1
096090000000               GO TO LR1-0100.
096100000000
096110000000      *****
096120000000      *****    Initialize the statement account funds table.
096130000000      *****
096140000000
096150000000           MOVE SPACES                 TO  WS-STMT-ACCOUNT-FUND-TABLE.
096160000000           MOVE ZEROES                 TO  WS-SAF-LST.
096170000000
096180010725R10992*****
096190010725      *****    Initialize the GIC information table.
096200010725      *****
096210010725
096220010725           INITIALIZE                  WS-GIC-INFO-TBL.
096230010725           MOVE ZEROES                 TO  WS-GIC-LST.
096240010725
096250010725      *****
096260010725      *****    Initialize the Account Detail (FUND, GIC & DII) table.
096270010725      *****
096280010725
096290010725           INITIALIZE                  WS-ACCOUNT-FUND-TABLE.
096300010725           MOVE ZEROES                 TO  WS-AFD-LST.
096310010725
096320010725           INITIALIZE                  WS-ACCOUNT-GIC-TABLE.
096330010725           MOVE ZEROES                 TO  WS-AGD-LST.
096340010725
096350010725           INITIALIZE                  WS-ACCOUNT-DII-TABLE.
096360010726           MOVE ZEROES                 TO  WS-ADID-LST.
096370010725
096380010726      *****
096390010726      ***** If multiple accounts of an investor have Confirms,
096400010726      ***** WS-STMT-DTA-SW-80DII must be reinitialized for every
096410010726      ***** account.
096420010726      *****
096430010726
096440010801R10992     MOVE "N"                    TO  WS-STMT-DTA-SW-25.
096450010801R10992     MOVE "N"                    TO  WS-STMT-DTA-SW-20GIC.
096460010801R10992     MOVE "N"                    TO  WS-STMT-DTA-SW-20DII.
096470010801R10992     MOVE "N"                    TO  WS-STMT-DTA-SW-20FUND.
096480010726R10992     MOVE "N"                    TO  WS-STMT-DTA-SW-80DII.
096490011005R11747*    MOVE "N"                    TO  WS-STMT-DTA-SW-80DII-HEAD.
096500010801R10992     MOVE "N"                    TO  WS-STMT-DTA-SW-80FUND.
096510010726
096520000000      *****
096530000000      *****    Initialize the statement transaction controls.
096540000000      *****
096550000000
096560000000           MOVE LOW-VALUES             TO  CURR-CTLS-DPR.
096570000000           MOVE LOW-VALUES             TO  PREV-CTLS-DPR.
096580000000
096590000000       LR1-EXIT.
096600000000           EXIT.
096610000000      /
096620000000       FORMAT-ACTTYP-DESC.
096630000000
096640000000      ******************************************************************
096650000000      *                                                                *
096660000000      *    F M T .   A C C O U N T   T Y P E   D E S C R I P T I O N   *
096670000000      *                                                                *
096680000000      ******************************************************************
096690000000
096700000000      *****
096710000000      *****    Initialize the work items.
096720000000      *****
096730000000
096740000000           MOVE SPACES                 TO  WS-ACTTYPIN-SFX.
096750000000           MOVE SPACES                 TO  WS-ACTTYPLIT1.
096760000000           MOVE SPACES                 TO  WS-ACTTYPLIT2.
096770000000           MOVE SPACES                 TO  WS-ACTTYPLIT3.
096780000000           MOVE SPACES                 TO  WS-ACTTYPOUT.
096790000524RF7063     MOVE SPACES                 TO  WS-NOMACTTYPOUT.
096800000524           MOVE SPACES                 TO  WS-NOMACTTYPLIT1.
096810000000
096820000000      *****
096830980320      *****    The account type description will be formatted
096840980320      *****    If NOMINEE, format the description.
096850000000      *****
096860000000
096870980323980320 FAD-0001.
096880980323
096890980323980320     IF  WS-ACTTYPNOM   IS NOT = "Y"
096900980323980320         GO TO FAD-0003.
096910980407
096920980408980320     INITIALIZE INVESTOR-J-REC.
096930980408980320     MOVE PR-INVESTOR-NO TO ACIVRNO OF INVESTOR-J-REC.
096940980408980320     MOVE PR-ACCOUNT     TO ACACTNO OF INVESTOR-J-REC.
096950980408
096960980408980320     START INVESTOR-JOIN
096970980408980320           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
096980980408980320           INVALID KEY
096990980408980320           GO TO FAD-0001.
097000980408
097010980408980320 FAD-0002.
097020980408980320     READ INVESTOR-JOIN NEXT RECORD
097030980408980320          AT END
097040980408980320          GO TO FAD-0030
097050980408980320     END-READ.
097060980408
097070041215R23390     IF PR-INVESTOR-NO IS NOT = ACIVRNO OF INVESTOR-J-REC
097080980408980320        GO TO FAD-0030.
097090980408
097100041215R23390     IF PR-ACCOUNT     IS NOT = ACACTNO OF INVESTOR-J-REC
097110980408980320        GO TO FAD-0030.
097120980408
097130980408980320     INITIALIZE MFANMTPYP.
097140980408
097150980408980320     MOVE ANACTYP OF INVESTOR-JOIN TO NOMINEE-ACCOUNT-TYPE
097160980408980320                    OF NOMINEE-ACCOUNT-TYPE-DESCR.
097170980407
097180980408980320     MOVE WS-ACTTYPLNG             TO LANGUAGE-CODE
097190980408980320                       OF NOMINEE-ACCOUNT-TYPE-DESCR.
097200980407
097210980408980320     READ NOMINEE-ACCOUNT-TYPE-DESCR
097220980408980320          INVALID KEY
097230000524980320          MOVE SPACES TO WS-NOMACTTYPOUT
097240980408980320     END-READ.
097250980320
097260980408980320     MOVE ACCOUNT-TYPE-DESCR OF NOMINEE-ACCOUNT-TYPE-DESCR
097270000524980320          TO WS-NOMACTTYPOUT.
097280980323
097290000524RF7063     IF  WS-ACTTYPSPS       IS EQUAL TO  "Y"
097300000525               IF  WS-ACTTYPLNG = "E"
097310000525                   MOVE "SPOUSAL      "      TO  WS-NOMACTTYPLIT1
097320000525                   STRING WS-NOMACTTYPLIT1
097330000525                             DELIMITED BY  "  ",
097340000525                          " "        DELIMITED BY  SIZE,
097350000525                          WS-NOMACTTYPOUT
097360000525                                     DELIMITED BY  SIZE,
097370000525                                     INTO  WS-ACTTYPOUT
097380000525               ELSE
097390000525                   MOVE "DE CONJOINT  "      TO  WS-NOMACTTYPLIT1
097400000525                   STRING WS-NOMACTTYPOUT
097410000525                             DELIMITED BY  "  ",
097420000525                          " "        DELIMITED BY  SIZE,
097430000525                          WS-NOMACTTYPLIT1
097440000525                                     DELIMITED BY  SIZE,
097450000525                                     INTO  WS-ACTTYPOUT
097460000525               END-IF
097470000525           ELSE
097480000525               MOVE WS-NOMACTTYPOUT      TO  WS-ACTTYPOUT
097490000524RF7063     END-IF.
097500000524
097510980408980320     GO TO FAD-0030.
097520000000
097530980323980320 FAD-0003.
097540980323
097550980323           IF WS-ACTTYPLNG = "F"
097560980323              GO TO FAD-0040.
097570000000      *****
097580000000      *****    The English description may be formatted with a LOCKED-IN
097590000000      *****    literal, a SPOUSAL literal, a GROUP literal and the
097600000000      *****    original account type description.  If any of the
097610000000      *****    literals are not applicable, they will be suppressed.
097620000000      *****    Initially, determine which literals are applicable.
097630000000      *****
097640000000
097650000000           IF  WS-ACTTYPLCK   IS EQUAL TO  "Y"
097660000000           AND WS-ACTTYPSHT  NOT EQUAL TO  "LIRA "
097670000000               MOVE "LOCKED-IN    "    TO  WS-ACTTYPLIT1.
097680000000           IF  WS-ACTTYPGRP   IS EQUAL TO  "Y"
097690000000               MOVE "GROUP        "    TO  WS-ACTTYPLIT2.
097700000000           IF  WS-ACTTYPSPS   IS EQUAL TO  "Y"
097710000000               MOVE "SPOUSAL      "    TO  WS-ACTTYPLIT3.
097720000000
097730000000      *****
097740000000      *****    Compress the optional English literals.
097750000000      *****
097760000000
097770000000           IF  WS-ACTTYPLIT1 NOT EQUAL TO  SPACES
097780000000               GO TO FAD-0010.
097790000000
097800000000           IF  WS-ACTTYPLIT2 NOT EQUAL TO  SPACES
097810000000               MOVE WS-ACTTYPLIT2      TO  WS-ACTTYPLIT1
097820000000               MOVE SPACES             TO  WS-ACTTYPLIT2
097830000000               GO TO FAD-0010.
097840000000
097850000000           IF  WS-ACTTYPLIT3 NOT EQUAL TO  SPACES
097860000000               MOVE WS-ACTTYPLIT3      TO  WS-ACTTYPLIT1
097870000000               MOVE SPACES             TO  WS-ACTTYPLIT3
097880000000               GO TO FAD-0020.
097890000000
097900000000           GO TO FAD-0020.
097910000000
097920000000       FAD-0010.
097930000000           IF  WS-ACTTYPLIT2  IS EQUAL TO  SPACES
097940000000           AND WS-ACTTYPLIT3 NOT EQUAL TO  SPACES
097950000000               MOVE WS-ACTTYPLIT3      TO  WS-ACTTYPLIT2
097960000000               MOVE SPACES             TO  WS-ACTTYPLIT3.
097970000000
097980000000       FAD-0020.
097990000000
098000000000      *****
098010000000      *****    Format the English account type description based on the
098020000000      *****    number of optional literals applicable.
098030000000      *****
098040000000
098050000000           IF  WS-ACTTYPLIT1  IS EQUAL TO  SPACES
098060000000               MOVE WS-ACTTYPIN        TO  WS-ACTTYPOUT
098070000000               GO TO FAD-0030.
098080000000
098090000000           IF  WS-ACTTYPLIT2  IS EQUAL TO  SPACES
098100000000               STRING WS-ACTTYPLIT1
098110000000                             DELIMITED BY  "  ",
098120000000                      " "    DELIMITED BY  SIZE,
098130000000                      WS-ACTTYPIN
098140000000                             DELIMITED BY  "  ",
098150000000                                     INTO  WS-ACTTYPOUT
098160000000               GO TO FAD-0030.
098170000000
098180000000           IF  WS-ACTTYPLIT3  IS EQUAL TO  SPACES
098190000000               STRING WS-ACTTYPLIT1
098200000000                             DELIMITED BY  "  ",
098210000000                      " "    DELIMITED BY  SIZE,
098220000000                      WS-ACTTYPLIT2
098230000000                             DELIMITED BY  "  ",
098240000000                      " "    DELIMITED BY  SIZE,
098250000000                      WS-ACTTYPIN
098260000000                             DELIMITED BY  "  ",
098270000000                                     INTO  WS-ACTTYPOUT
098280000000               GO TO FAD-0030.
098290000000
098300000000           STRING WS-ACTTYPLIT1
098310000000                             DELIMITED BY  "  ",
098320000000                  " "        DELIMITED BY  SIZE,
098330000000                  WS-ACTTYPLIT2
098340000000                             DELIMITED BY  "  ",
098350000000                  " "        DELIMITED BY  SIZE,
098360000000                  WS-ACTTYPLIT3
098370000000                             DELIMITED BY  "  ",
098380000000                  " "        DELIMITED BY  SIZE,
098390000000                  WS-ACTTYPIN
098400000000                             DELIMITED BY  "  ",
098410000000                                     INTO  WS-ACTTYPOUT.
098420000000
098430000000       FAD-0030.
098440000000           GO TO FAD-EXIT.
098450000000
098460000000
098470980320       FAD-0040.
098480980320
098490000000      *****
098500000000      *****    The French description may be formatted with a GROUP
098510000000      *****    literal, a LOCKED-IN literal, a SPOUSAL literal and the
098520000000      *****    original account type description.  If any of the
098530000000      *****    literals are not applicable, they will be suppressed.
098540000000      *****    Initially, determine which literals are applicable.
098550000000      *****
098560000000
098570000000           IF  WS-ACTTYPGRP   IS EQUAL TO  "Y"
098580000000               MOVE "COLLECTIF    "    TO  WS-ACTTYPLIT1.
098590000000           IF  WS-ACTTYPLCK   IS EQUAL TO  "Y"
098600000000           AND WS-ACTTYPSHT  NOT EQUAL TO  "LIRA "
098610000000               MOVE "IMMOBILISE   "    TO  WS-ACTTYPLIT2.
098620000000           IF  WS-ACTTYPSPS   IS EQUAL TO  "Y"
098630000000               MOVE "DE CONJOINT  "    TO  WS-ACTTYPLIT3.
098640000000
098650000000      *****
098660000000      *****    Compress the optional French literals.
098670000000      *****
098680000000
098690000000           IF  WS-ACTTYPLIT1 NOT EQUAL TO  SPACES
098700000000               GO TO FAD-0050.
098710000000
098720000000           IF  WS-ACTTYPLIT2 NOT EQUAL TO  SPACES
098730000000               MOVE WS-ACTTYPLIT2      TO  WS-ACTTYPLIT1
098740000000               MOVE SPACES             TO  WS-ACTTYPLIT2
098750000000               GO TO FAD-0050.
098760000000
098770000000           IF  WS-ACTTYPLIT3 NOT EQUAL TO  SPACES
098780000000               MOVE WS-ACTTYPLIT3      TO  WS-ACTTYPLIT1
098790000000               MOVE SPACES             TO  WS-ACTTYPLIT3
098800000000               GO TO FAD-0060.
098810000000
098820000000           GO TO FAD-0060.
098830000000
098840000000       FAD-0050.
098850000000           IF  WS-ACTTYPLIT2  IS EQUAL TO  SPACES
098860000000           AND WS-ACTTYPLIT3 NOT EQUAL TO  SPACES
098870000000               MOVE WS-ACTTYPLIT3      TO  WS-ACTTYPLIT2
098880000000               MOVE SPACES             TO  WS-ACTTYPLIT3.
098890000000
098900000000       FAD-0060.
098910000000
098920000000      *****
098930000000      *****    Format the French account type description.  Since the
098940000000      *****    optional literals come after the original account
098950000000      *****    description and they have been compressed, it is not
098960000000      *****    necessary to base the formatting on which option literals
098970000000      *****    are applicable.
098980000000      *****
098990000000
099000000000           STRING WS-ACTTYPIN
099010000000                             DELIMITED BY  "  ",
099020000000                  " "        DELIMITED BY  SIZE,
099030000000                  WS-ACTTYPLIT1
099040000000                             DELIMITED BY  "  ",
099050000000                  " "        DELIMITED BY  SIZE,
099060000000                  WS-ACTTYPLIT2
099070000000                             DELIMITED BY  "  ",
099080000000                  " "        DELIMITED BY  SIZE,
099090000000                  WS-ACTTYPLIT3
099100000000                             DELIMITED BY  "  ",
099110000000                                     INTO  WS-ACTTYPOUT.
099120000000
099130000000       FAD-EXIT.
099140000000           EXIT.
099150000000      /
099160000000       PRINT-ERR-LINE.
099170000000
099180000000      ******************************************************************
099190000000      *                                                                *
099200000000      *    P R I N T   E R R O R   L I N E   R O U T I N E             *
099210000000      *                                                                *
099220000000      ******************************************************************
099230000000
099240000000      *****
099250000000      *****    If the error line has not been formatted, format it using
099260000000      *****    the Statement File - Primary record.
099270000000      *****
099280000000
099290000000           IF  ERROR-LINE-1  NOT EQUAL TO  SPACES
099300000000               GO TO PEL-0010.
099310000000
099320000000           MOVE PR-INVESTOR-NO         TO  EL1-INVESTOR-NO.
099330000000           MOVE PR-ACCOUNT             TO  EL1-ACCOUNT.
099340000000           MOVE PR-SECTION-NO          TO  EL1-SECTION-NO.
099350000000           MOVE "-"                    TO  EL1-SECTION-LITDSH.
099360991011           MOVE PR-SECTION-SEQUENCE    TO  EL1-SECTION-SEQUENCE.
099370000000           MOVE PR-LANGUAGE-CODE       TO  EL1-LANGUAGE-CODE.
099380000000           MOVE PR-DEALER              TO  EL1-DEALER.
099390000000           MOVE PR-DEALER-REP-CODE     TO  EL1-DEALER-REP-CODE.
099400000000           MOVE WS-MSG (MSG)           TO  EL1-MSG.
099410000000
099420000000       PEL-0010.
099430000000
099440000000      *****
099450000000      *****    If the page is full, start a new page and print the
099460000000      *****    Heading lines.
099470000000      *****
099480000000
099490000000           IF  WS-LNECNT  IS GREATER THAN  WS-LNEMAX
099500000000               PERFORM PRINT-HDG-LINE THRU PHL-EXIT.
099510000000
099520000000      *****
099530000000      *****    Print the error line.
099540000000      *****
099550000000
099560000000           WRITE PRINT-RECD          FROM  ERROR-LINE-1
099570000000                         AFTER  ADVANCING  1.
099580000000           ADD 1                       TO  WS-LNECNT.
099590000000
099600000000       PEL-EXIT.
099610000000           EXIT.
099620000000      /
099630000000       INITIAL-LOGIC-RTN.
099640000000
099650000000      ******************************************************************
099660000000      *                                                                *
099670000000      *    I N I T I A L   L O G I C   R O U T I N E                   *
099680000000      *                                                                *
099690000000      ******************************************************************
099700000000
099710000000      *****
099720000000      *****    Retrieve the Local Data Area.
099730000000      *****
099740000000
099750000000           ACCEPT WS-LOCAL-DATA-AREA FROM  WS-LOCAL.
099760000000
099770000000      *****
099780000000      *****    Using the Management Company Code, determine which
099790000000      *****    version of the statement is to be produced.  The standard
099800990823      *****    statement is version 0, DJT use version 1. MLA use
099810991102      *****    version 2. UBS use version 3.
099820990823      *****
099830000000
099840000000           MOVE ZEROES                 TO  WS-STMTVRSN.
099850990315
099860991001           EVALUATE WS-LDA-STMT-VERSION
099870991001             WHEN 1         MOVE  1     TO WS-STMTVRSN
099880991001             WHEN 2         MOVE  2     TO WS-STMTVRSN
099890991001             WHEN 3         MOVE  3     TO WS-STMTVRSN
099900010517R10081       WHEN 4         MOVE  4     TO WS-STMTVRSN
099910021223R15810       WHEN 5         MOVE  5     TO WS-STMTVRSN
099920991001           END-EVALUATE.
099930990927
099940000000       ILR-0010.
099950000000
099960000000      *****
099970000000      *****    Initialize the program defined work items.
099980000000      *****
099990980916
100000000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT.
100010000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-00.
100020000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-05.
100030000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-10.
100040010308RF8633     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-12.
100050000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-15.
100060141007141165     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-16.
100070040406R20870     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-17.
100080000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-20.
100090010321RF8633     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-25.
100100130408117038     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-22.
100110991126           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-30.
100120040406R20870     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-33.
100130991126           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-35.
100140040406R20870     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-38.
100150010308RF4638     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-40.
100160010308RF4638     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-43.
100170010308RF4638     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-45.
100180000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-50.
100190000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-60.
100200991002           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-62.
100210091124R69515     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-63.
100220010323rf8633     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-67.
100230000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-70.
100240060824R34848     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-81.
100250000000           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-82.
100260991007           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-84.
100270010308RF4638     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-90.
100280000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT.
100290000000           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-01.
100300000000           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-05.
100310000000           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-10.
100320000000           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-20.
100330000000           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-80.
100340991013           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-84.
100350000000           MOVE ZEROES                 TO  WS-STMT-PRT-DTL-WCNT.
100360000000           MOVE ZEROES                 TO  WS-STMT-PRT-HDR-WCNT.
100370971210           MOVE SPACES                 TO  US-TABLE.
100380000000
100390000000           MOVE 100                    TO  WS-SAF-MAX.
100400000000           MOVE 2                      TO  WS-SC-MAX.
100410000000           MOVE 1000                   TO  WS-SIA-MAX.
100420000000           MOVE 87                     TO  WS-SPL-MAX.
100430980916           MOVE 50                     TO  WS-II-MAX.
100440000626RF6725     MOVE 50                     TO  WS-DI-MAX.
100450010517R10081     MOVE 100                    TO  WS-GIC-MAX.
100460010517R10081     MOVE 100                    TO  WS-AFD-MAX.
100470010517R10081     MOVE 50                     TO  WS-AGD-MAX.
100480010517R10081     MOVE 50                     TO  WS-ADID-MAX.
100490000000
100500011009R11747     IF WS-STMTVRSN              IS EQUAL TO  4
100510011009              MOVE 32                  TO  WS-SPL-DTLFST
100520011009              MOVE 80                  TO  WS-SPL-DTLLST
100530011009              MOVE 16                  TO  WS-SPL-HDGFST
100540011009              MOVE 14                  TO  WS-SPML-MAX
100550011009              GO TO ILR-0020
100560041215R23390     END-IF.
100570011009
100580990928           IF WS-STMTVRSN              IS EQUAL TO  3
100590990929              MOVE 32                  TO  WS-SPL-DTLFST
100600990929              MOVE 70                  TO  WS-SPL-DTLLST
100610990929              MOVE 15                  TO  WS-SPL-HDGFST
100620990929              MOVE 12                  TO  WS-SPML-MAX
100630990928           ELSE
100640990928              MOVE 36                     TO  WS-SPL-DTLFST
100650990928              MOVE 80                     TO  WS-SPL-DTLLST
100660990928              MOVE 16                     TO  WS-SPL-HDGFST
100670990928              MOVE 14                     TO  WS-SPML-MAX
100680990928           END-IF.
100690000000
100700000000       ILR-0020.
100710000000
100720000000           MOVE 99                     TO  WS-LNECNT.
100730000000           MOVE 60                     TO  WS-LNEMAX.
100740000000           MOVE ZEROES                 TO  WS-PGECNT.
100750000000
100760000000           MOVE "N"                    TO  WS-EOJHDG-SW.
100770000000
100780000000           MOVE LOW-VALUES             TO  CURR-CONTROLS.
100790000000           MOVE LOW-VALUES             TO  PREV-CONTROLS.
100800000000
100810000000      *****
100820000000      *****    Format the heading literals.
100830000000      *****
100840000000
100850000000           ACCEPT WS-DATE            FROM  DATE.
100860000000           MOVE WS-DATE-YY             TO  HL1-YY.
100870000000           MOVE WS-DATE-MM             TO  HL1-MM.
100880000000           MOVE WS-DATE-DD             TO  HL1-DD.
100890000000
100900000000           ACCEPT HL1-TIME           FROM  TIME.
100910000000           INSPECT HL1-TIME REPLACING ALL  SPACE
100920000000                                       BY  ":".
100930000000           MOVE "."                    TO  HL1-TIME-DOT.
100940000000
100950991102
100960991102
100970000000
100980000000      *****
100990000000      *****    Open the Input files.
101000000000      *****
101010980130
101020980130           OPEN    INPUT   CURRENCY-FILE
101030980130                           DEALER-MAILING-INSTR
101040000000                           DEALER-FILE
101050000000                           DEALER-REP-FILE
101060000000                           DEALER-REP-MAILING-INSTR
101070000000                           DEALER-REP-ADDRESS
101080000000                           INSTITUTION-ADDRESS
101090000000                           INSTITUTION-BRANCH
101100980130                           INVESTMENT-FILE
101110010222RF8307                     PRODUCT-TYPE-CODES
101120021219R15810                     TRANS-DEDUCTION-DESCR
101130980323                           INVESTOR-JOIN
101140991102991102                     ACCOUNT-TYPE-BK
101150980323                           NOMINEE-ACCOUNT-TYPE-DESCR
101160000000                           NOMINEE-MAILING-INSTRUCTIONS
101170000000                           STMT-MSG-FILE
101180190614      *RFS183449-Starts
101190190614      *                    STMT-DTA-FILE.
101200190614                           STMT-DTA-FILE
101210190614                           ACCOUNT-FILE-2.
101220190614      *RFS183449-Ends
101230000000
101240000000      *****
101250000000      *****    Open the Output files.
101260000000      *****
101270000000
101280000000           OPEN    OUTPUT  STMT-PRT-DTL-FILE
101290000000                           STMT-PRT-HDR-FILE
101300000000                           PRINT-FILE.
101310980202
101320991102       ILR-0040.
101330991102
101340991102      *****
101350991102      *****    Load the account type entries.
101360991102      *****
101370991102
101380991102           MOVE SPACES                 TO  WS-ACCTYP-TBL.
101390991102           MOVE ZEROES                 TO  WS-AT-LST.
101400090914R64527**** MOVE  500  TO ln-Array-Size.    R72304
101410090914R72304     MOVE  1    TO ln-Array-Size.
101420991102
101430991102       ILR-0050.
101440991102
101450991102           READ ACCOUNT-TYPE-BK        AT  END
101460090914R72304         SET AT1                  UP BY  1
101470090914R72304         INITIALIZE      WS-ACCTYP-ENT-ELEMENT(AT1)
101480991103               GO TO ILR-0070
101490041215R23390     END-READ.
101500991103
101510991102           IF  WS-AT-LST IS NOT LESS THAN  WS-AT-MAX
101520991102               DISPLAY "ACCOUNT TYPES (MFAACTYP) EXCEED PROGRAM MAX"
101530090305               GO TO ILR-0080
101540041215R23390     END-IF.
101550991103
101560991102           ADD 1                       TO  WS-AT-LST.
101570991102           SET AT1                     TO  WS-AT-LST.
101580090315R64527     IF AT1 >= ln-Array-Size
101590090914R64527****    COMPUTE ln-Array-Size   = ln-Array-Size   + 500 R72304
101600090914R72304        COMPUTE ln-Array-Size   = ln-Array-Size   + 1
101610090315R64527     END-IF.
101620991102           MOVE ACCOUNT-TYPE-CODE
101630991102                OF ACCOUNT-TYPE-BK-REC TO  WS-AT-CODE (AT1).
101640991102           MOVE ACCOUNT-TYPE-RULE
101650991102                OF ACCOUNT-TYPE-BK-REC TO  WS-AT-RULE (AT1).
101660991102           GO TO ILR-0050.
101670991102
101680991102       ILR-0070.
101690991102
101700991102           IF  WS-AT-LST NOT GREATER THAN  ZEROES
101710991102               DISPLAY "NO ACCOUNT TYPES (MFAACTYP) FOUND"
101720991102           END-IF.
101730991102
101740991102       ILR-0080.
101750991102
101760991102           READ CURRENCY-FILE
101770991102                AT END
101780010222      *          GO TO ILR-EXIT
101790010222                 GO TO ILR-0090
101800041215R23390     END-READ.
101810991102
101820991102           IF BASE-CURRENCY OF CURRENCY-FILE = "Y"
101830991102              MOVE CURRENCY-DDS OF CURRENCY-FILE TO WS-B-CURRENCY
101840041215R23390     END-IF.
101850991102
101860991102           GO TO ILR-0080.
101870991102
101880010221
101890010221      *****
101900010221      *****    Load the Investment Code Table.
101910010221      *****
101920010221
101930010222RF8307 ILR-0090.
101940010222
101950010222           MOVE SPACES                 TO  WS-INVCDE-TBL.
101960010221           MOVE ZEROES                 TO  WS-IC-LST.
101970090914R64527**** MOVE  500  TO ln-Array-SizeIC.    R72304
101980090914R72304     MOVE  1    TO ln-Array-SizeIC.
101990010221
102000010221       ILR-0090-0010.
102010010221
102020010222           READ INVESTMENT-FILE        AT  END
102030090914R72304        SET IC                   UP BY  1
102040090914R72304        INITIALIZE         WS-ACCTYP-ENT-ELEMENT(IC)
102050010222              GO TO ILR-EXIT
102060010221           END-READ.
102070010221
102080010221           IF  WS-IC-LST IS NOT LESS THAN  WS-IC-MAX
102090010221               DISPLAY "INVESTMENTS (MFAINVP) EXCEED PROGRAM MAX"
102100090305               GO TO ILR-EXIT
102110010221           END-IF.
102120010221
102130090302
102140010221           ADD 1                       TO  WS-IC-LST.
102150010221           SET IC                      TO  WS-IC-LST.
102160090315R64527     IF IC >= ln-Array-SizeIC
102170090914R64527****    COMPUTE ln-Array-SizeIC = ln-Array-SizeIC + 500 R72304
102180090914R72304        COMPUTE ln-Array-SizeIC = ln-Array-SizeIC + 1
102190090315R64527     END-IF.
102200010221           MOVE INVESTMENT-CODE
102210010221                OF INVESTMENT-REC      TO  WS-IC-CODE (IC).
102220010221           MOVE INDUSTRY-FUND-CODE
102230010221                OF INVESTMENT-REC      TO  WS-IC-FUND (IC).
102240010221           MOVE PRODUCT-TYPE-CODE
102250010221                OF INVESTMENT-REC      TO  WS-IC-PROD (IC).
102260010221      *****
102270010221      *****    Load the product type code entries.
102280010221      *****
102290010221
102300010221           INITIALIZE PRODUCT-TYPE-CODES-REC.
102310010221
102320010222           MOVE PRODUCT-TYPE-CODE OF INVESTMENT-REC
102330010222                    TO  PRODUCT-TYPE-CODE OF PRODUCT-TYPE-CODES-REC.
102340010221
102350010222           READ PRODUCT-TYPE-CODES
102360010222              INVALID KEY
102370010222                MOVE ZEROS          TO  PRODUCT-TYPE-RULE
102380010222                                OF PRODUCT-TYPE-CODES-REC
102390010222           END-READ.
102400010222
102410041215R23390     MOVE PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC
102420010222                                       TO  WS-IC-RULE (IC).
102430010222           GO TO ILR-0090-0010.
102440010221
102450010222      *****    End RFS8307 in this section
102460010222
102470990928      **********
102480990928
102490000000       ILR-EXIT.
102500000000           EXIT.
102510990928
102520990928      **********
102530990928
102540000000      /
102550000000       END-JOB-RTN.
102560000000
102570000000      ******************************************************************
102580000000      *                                                                *
102590000000      *    E N D   J O B   R O U T I N E                               *
102600000000      *                                                                *
102610000000      ******************************************************************
102620000000
102630000000      *****
102640000000      *****    Print the Control Report on a separate page.
102650000000      *****
102660000000
102670000000           MOVE 99                     TO  WS-LNECNT.
102680000000           MOVE "N"                    TO  WS-BYPPRT-SW.
102690000000           MOVE "Y"                    TO  WS-EOJHDG-SW.
102700000000           MOVE "N"                    TO  WS-SELPRT-SW.
102710000000
102720000000           MOVE WS-MANAGEMENT-COMPANY-CODE
102730000000                                       TO  CL2-MANAGEMENT-COMPANY-CODE.
102740000000           MOVE CONTROL-LINE-2         TO  CONTROL-LINE-1.
102750000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
102760000000
102770000000           MOVE SPACES                 TO  CONTROL-LINE-1.
102780000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
102790000000
102800000000           MOVE SPACES                 TO  CONTROL-LINE-1.
102810000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
102820000000
102830000000           MOVE SPACES                 TO  CONTROL-LINE-1.
102840000000           MOVE WS-STMT-DTA-RLIT       TO  CL1-LIT.
102850000000           MOVE WS-STMT-DTA-RCNT       TO  CL1-CNT.
102860000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
102870000000
102880000000           MOVE SPACES                 TO  CONTROL-LINE-1.
102890000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
102900000000
102910000000           IF  WS-STMT-DTA-BCNT
102920000000                          IS GREATER THAN  ZEROES
102930000000               MOVE SPACES             TO  CONTROL-LINE-1
102940000000               MOVE WS-STMT-DTA-BLIT   TO  CL1-LIT
102950000000               MOVE WS-STMT-DTA-BCNT   TO  CL1-CNT
102960000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
102970000000               MOVE "Y"                TO  WS-BYPPRT-SW.
102980000000
102990000000           IF  WS-STMT-DTA-BCNT-00
103000000000                          IS GREATER THAN  ZEROES
103010000000               MOVE SPACES             TO  CONTROL-LINE-1
103020000000               MOVE WS-STMT-DTA-BLIT-00
103030000000                                       TO  CL1-LIT
103040000000               MOVE WS-STMT-DTA-BCNT-00
103050000000                                       TO  CL1-CNT
103060000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103070000000               MOVE "Y"                TO  WS-BYPPRT-SW.
103080980914
103090000000           IF  WS-STMT-DTA-BCNT-05
103100000000                          IS GREATER THAN  ZEROES
103110000000               MOVE SPACES             TO  CONTROL-LINE-1
103120000000               MOVE WS-STMT-DTA-BLIT-05
103130000000                                       TO  CL1-LIT
103140000000               MOVE WS-STMT-DTA-BCNT-05
103150000000                                       TO  CL1-CNT
103160000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103170000000               MOVE "Y"                TO  WS-BYPPRT-SW.
103180000000
103190000000           IF  WS-STMT-DTA-BCNT-10
103200000000                          IS GREATER THAN  ZEROES
103210000000               MOVE SPACES             TO  CONTROL-LINE-1
103220000000               MOVE WS-STMT-DTA-BLIT-10
103230000000                                       TO  CL1-LIT
103240000000               MOVE WS-STMT-DTA-BCNT-10
103250000000                                       TO  CL1-CNT
103260000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103270000000               MOVE "Y"                TO  WS-BYPPRT-SW.
103280010308
103290010308RF8633     IF  WS-STMT-DTA-BCNT-12
103300010308                          IS GREATER THAN  ZEROES
103310010308               MOVE SPACES             TO  CONTROL-LINE-1
103320010308               MOVE WS-STMT-DTA-BLIT-12
103330010308                                       TO  CL1-LIT
103340010308               MOVE WS-STMT-DTA-BCNT-12
103350010308                                       TO  CL1-CNT
103360010308               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103370010308               MOVE "Y"                TO  WS-BYPPRT-SW.
103380000000
103390000000           IF  WS-STMT-DTA-BCNT-15
103400000000                          IS GREATER THAN  ZEROES
103410000000               MOVE SPACES             TO  CONTROL-LINE-1
103420000000               MOVE WS-STMT-DTA-BLIT-15
103430000000                                       TO  CL1-LIT
103440000000               MOVE WS-STMT-DTA-BCNT-15
103450000000                                       TO  CL1-CNT
103460000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103470000000               MOVE "Y"                TO  WS-BYPPRT-SW.
103480000000
103490040406R20870     IF  WS-STMT-DTA-BCNT-17
103500040406                          IS GREATER THAN  ZEROES
103510040406               MOVE SPACES             TO  CONTROL-LINE-1
103520040406               MOVE WS-STMT-DTA-BLIT-17
103530040406                                       TO  CL1-LIT
103540040406               MOVE WS-STMT-DTA-BCNT-17
103550040406                                       TO  CL1-CNT
103560040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103570040406               MOVE "Y"                TO  WS-BYPPRT-SW.
103580040406
103590000000           IF  WS-STMT-DTA-BCNT-20
103600000000                          IS GREATER THAN  ZEROES
103610000000               MOVE SPACES             TO  CONTROL-LINE-1
103620000000               MOVE WS-STMT-DTA-BLIT-20
103630000000                                       TO  CL1-LIT
103640000000               MOVE WS-STMT-DTA-BCNT-20
103650000000                                       TO  CL1-CNT
103660000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103670000000               MOVE "Y"                TO  WS-BYPPRT-SW.
103680991126
103690010321
103700010321rf8633     IF  WS-STMT-DTA-BCNT-25
103710010321                          IS GREATER THAN  ZEROES
103720010321               MOVE SPACES             TO  CONTROL-LINE-1
103730010321               MOVE WS-STMT-DTA-BLIT-25
103740010321                                       TO  CL1-LIT
103750010321               MOVE WS-STMT-DTA-BCNT-25
103760010321                                       TO  CL1-CNT
103770010321               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103780010321rf8633         MOVE "Y"                TO  WS-BYPPRT-SW.
103790010321
103800130408117038     IF  WS-STMT-DTA-BCNT-22
103810130408117038                    IS GREATER THAN  ZEROES
103820130408117038         MOVE SPACES             TO  CONTROL-LINE-1
103830130408117038         MOVE WS-STMT-DTA-BLIT-22
103840130408117038                                 TO  CL1-LIT
103850130408117038         MOVE WS-STMT-DTA-BCNT-22
103860130408117038                                 TO  CL1-CNT
103870130408117038         PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103880130408117038         MOVE "Y"                TO  WS-BYPPRT-SW.
103890130408
103900991126           IF  WS-STMT-DTA-BCNT-30
103910991126                          IS GREATER THAN  ZEROES
103920991126               MOVE SPACES             TO  CONTROL-LINE-1
103930991126               MOVE WS-STMT-DTA-BLIT-30
103940991126                                       TO  CL1-LIT
103950991126               MOVE WS-STMT-DTA-BCNT-30
103960991126                                       TO  CL1-CNT
103970991126               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
103980991126               MOVE "Y"                TO  WS-BYPPRT-SW.
103990991126
104000040406R20870     IF  WS-STMT-DTA-BCNT-33
104010040406                          IS GREATER THAN  ZEROES
104020040406               MOVE SPACES             TO  CONTROL-LINE-1
104030040406               MOVE WS-STMT-DTA-BLIT-33
104040040406                                       TO  CL1-LIT
104050040406               MOVE WS-STMT-DTA-BCNT-33
104060040406                                       TO  CL1-CNT
104070040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104080040406               MOVE "Y"                TO  WS-BYPPRT-SW.
104090040406
104100991126           IF  WS-STMT-DTA-BCNT-35
104110991126                          IS GREATER THAN  ZEROES
104120991126               MOVE SPACES             TO  CONTROL-LINE-1
104130991126               MOVE WS-STMT-DTA-BLIT-35
104140991126                                       TO  CL1-LIT
104150991126               MOVE WS-STMT-DTA-BCNT-35
104160991126                                       TO  CL1-CNT
104170991126               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104180991126               MOVE "Y"                TO  WS-BYPPRT-SW.
104190000000
104200040406R20870     IF  WS-STMT-DTA-BCNT-38
104210040406                          IS GREATER THAN  ZEROES
104220040406               MOVE SPACES             TO  CONTROL-LINE-1
104230040406               MOVE WS-STMT-DTA-BLIT-38
104240040406                                       TO  CL1-LIT
104250040406               MOVE WS-STMT-DTA-BCNT-38
104260040406                                       TO  CL1-CNT
104270040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104280040406               MOVE "Y"                TO  WS-BYPPRT-SW.
104290040406
104300010308RF8633     IF  WS-STMT-DTA-BCNT-40
104310010308                          IS GREATER THAN  ZEROES
104320010308               MOVE SPACES             TO  CONTROL-LINE-1
104330010308               MOVE WS-STMT-DTA-BLIT-40
104340010308                                       TO  CL1-LIT
104350010308               MOVE WS-STMT-DTA-BCNT-40
104360010308                                       TO  CL1-CNT
104370010308               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104380010308               MOVE "Y"                TO  WS-BYPPRT-SW.
104390010308
104400010308RF8633     IF  WS-STMT-DTA-BCNT-43
104410010308                          IS GREATER THAN  ZEROES
104420010308               MOVE SPACES             TO  CONTROL-LINE-1
104430010308               MOVE WS-STMT-DTA-BLIT-43
104440010308                                       TO  CL1-LIT
104450010308               MOVE WS-STMT-DTA-BCNT-43
104460010308                                       TO  CL1-CNT
104470010308               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104480010308               MOVE "Y"                TO  WS-BYPPRT-SW.
104490010308
104500010308RF8633     IF  WS-STMT-DTA-BCNT-45
104510010308                          IS GREATER THAN  ZEROES
104520010308               MOVE SPACES             TO  CONTROL-LINE-1
104530010308               MOVE WS-STMT-DTA-BLIT-45
104540010308                                       TO  CL1-LIT
104550010308               MOVE WS-STMT-DTA-BCNT-45
104560010308                                       TO  CL1-CNT
104570010308               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104580010308               MOVE "Y"                TO  WS-BYPPRT-SW.
104590010308
104600000000           IF  WS-STMT-DTA-BCNT-50
104610000000                          IS GREATER THAN  ZEROES
104620000000               MOVE SPACES             TO  CONTROL-LINE-1
104630000000               MOVE WS-STMT-DTA-BLIT-50
104640000000                                       TO  CL1-LIT
104650000000               MOVE WS-STMT-DTA-BCNT-50
104660000000                                       TO  CL1-CNT
104670000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104680000000               MOVE "Y"                TO  WS-BYPPRT-SW.
104690000000
104700000000           IF  WS-STMT-DTA-BCNT-60
104710000000                          IS GREATER THAN  ZEROES
104720000000               MOVE SPACES             TO  CONTROL-LINE-1
104730000000               MOVE WS-STMT-DTA-BLIT-60
104740000000                                       TO  CL1-LIT
104750000000               MOVE WS-STMT-DTA-BCNT-60
104760000000                                       TO  CL1-CNT
104770000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104780000000               MOVE "Y"                TO  WS-BYPPRT-SW.
104790000000
104800991002           IF  WS-STMT-DTA-BCNT-62
104810991002                          IS GREATER THAN  ZEROES
104820991002               MOVE SPACES             TO  CONTROL-LINE-1
104830991002               MOVE WS-STMT-DTA-BLIT-62
104840991002                                       TO  CL1-LIT
104850991002               MOVE WS-STMT-DTA-BCNT-62
104860991002                                       TO  CL1-CNT
104870991002               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104880991002               MOVE "Y"                TO  WS-BYPPRT-SW.
104890091124      *RFS69515 Begin
104900091124           IF  WS-STMT-DTA-BCNT-63
104910091124                          IS GREATER THAN  ZEROES
104920091124               MOVE SPACES             TO  CONTROL-LINE-1
104930091124               MOVE WS-STMT-DTA-BLIT-63
104940091124                                       TO  CL1-LIT
104950091124               MOVE WS-STMT-DTA-BCNT-63
104960091124                                       TO  CL1-CNT
104970091124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
104980091124               MOVE "Y"                TO  WS-BYPPRT-SW.
104990091124      *RFS69515 End
105000091124
105010010323rf8633     IF  WS-STMT-DTA-BCNT-67
105020010323                          IS GREATER THAN  ZEROES
105030010323               MOVE SPACES             TO  CONTROL-LINE-1
105040010323               MOVE WS-STMT-DTA-BLIT-67
105050010323                                       TO  CL1-LIT
105060010323               MOVE WS-STMT-DTA-BCNT-67
105070010323                                       TO  CL1-CNT
105080010323               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
105090010323               MOVE "Y"                TO  WS-BYPPRT-SW.
105100010323
105110000000           IF  WS-STMT-DTA-BCNT-70
105120000000                          IS GREATER THAN  ZEROES
105130000000               MOVE SPACES             TO  CONTROL-LINE-1
105140000000               MOVE WS-STMT-DTA-BLIT-70
105150000000                                       TO  CL1-LIT
105160000000               MOVE WS-STMT-DTA-BCNT-70
105170000000                                       TO  CL1-CNT
105180000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
105190000000               MOVE "Y"                TO  WS-BYPPRT-SW.
105200060824R34848***Start
105210060824           IF  WS-STMT-DTA-BCNT-81     IS  GREATER THAN ZEROES
105220060824               MOVE SPACES             TO  CONTROL-LINE-1
105230060824               MOVE WS-STMT-DTA-BLIT-81
105240060824                                       TO  CL1-LIT
105250060824               MOVE WS-STMT-DTA-BCNT-81
105260060824                                       TO  CL1-CNT
105270060824               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
105280060824               MOVE "Y"                TO  WS-BYPPRT-SW.
105290060824R34848***End
105300000000
105310991007           IF  WS-STMT-DTA-BCNT-82       IS GREATER THAN  ZEROES
105320000000               MOVE SPACES             TO  CONTROL-LINE-1
105330000000               MOVE WS-STMT-DTA-BLIT-82
105340000000                                       TO  CL1-LIT
105350000000               MOVE WS-STMT-DTA-BCNT-82
105360000000                                       TO  CL1-CNT
105370000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
105380000000               MOVE "Y"                TO  WS-BYPPRT-SW.
105390000000
105400991007           IF  WS-STMT-DTA-BCNT-84       IS GREATER THAN  ZEROES
105410991007               MOVE SPACES             TO  CONTROL-LINE-1
105420991007               MOVE WS-STMT-DTA-BLIT-84
105430991007                                       TO  CL1-LIT
105440991007               MOVE WS-STMT-DTA-BCNT-84
105450991007                                       TO  CL1-CNT
105460991007               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
105470991007               MOVE "Y"                TO  WS-BYPPRT-SW.
105480991007
105490010308RF4638     IF  WS-STMT-DTA-BCNT-90       IS GREATER THAN  ZEROES
105500010308               MOVE SPACES             TO  CONTROL-LINE-1
105510010308               MOVE WS-STMT-DTA-BLIT-90
105520010308                                       TO  CL1-LIT
105530010308               MOVE WS-STMT-DTA-BCNT-90
105540010308                                       TO  CL1-CNT
105550010308               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
105560010308               MOVE "Y"                TO  WS-BYPPRT-SW.
105570010308
105580000000           IF  WS-BYPPRT-SW   IS EQUAL TO  "Y"
105590000000               MOVE SPACES             TO  CONTROL-LINE-1
105600000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
105610000000
105620000000           IF  WS-STMT-DTA-SCNT-01
105630000000                          IS GREATER THAN  ZEROES
105640000000               MOVE SPACES                 TO  CONTROL-LINE-1
105650000000               MOVE WS-STMT-DTA-SLIT-01
105660000000                                       TO  CL1-LIT
105670000000               MOVE WS-STMT-DTA-SCNT-01
105680000000                                       TO  CL1-CNT
105690000000               PERFORM PRINT-CTL-LINE     THRU PCL-EXIT
105700000000               MOVE "Y"                TO  WS-SELPRT-SW.
105710000000
105720000000           IF  WS-STMT-DTA-SCNT-05
105730000000                          IS GREATER THAN  ZEROES
105740000000               MOVE SPACES             TO  CONTROL-LINE-1
105750000000               MOVE WS-STMT-DTA-SLIT-05
105760000000                                       TO  CL1-LIT
105770000000               MOVE WS-STMT-DTA-SCNT-05
105780000000                                       TO  CL1-CNT
105790000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
105800000000               MOVE "Y"                TO  WS-SELPRT-SW.
105810000000
105820000000           IF  WS-STMT-DTA-SCNT-10
105830000000                          IS GREATER THAN  ZEROES
105840000000               MOVE SPACES             TO  CONTROL-LINE-1
105850000000               MOVE WS-STMT-DTA-SLIT-10
105860000000                                       TO  CL1-LIT
105870000000               MOVE WS-STMT-DTA-SCNT-10
105880000000                                       TO  CL1-CNT
105890000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
105900000000               MOVE "Y"                TO  WS-SELPRT-SW.
105910000000
105920000000           IF  WS-STMT-DTA-SCNT-20
105930000000                          IS GREATER THAN  ZEROES
105940000000               MOVE SPACES             TO  CONTROL-LINE-1
105950000000               MOVE WS-STMT-DTA-SLIT-20
105960000000                                       TO  CL1-LIT
105970000000               MOVE WS-STMT-DTA-SCNT-20
105980000000                                       TO  CL1-CNT
105990000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
106000000000               MOVE "Y"                TO  WS-SELPRT-SW.
106010000000
106020000000           IF  WS-STMT-DTA-SCNT-80
106030000000                          IS GREATER THAN  ZEROES
106040000000               MOVE SPACES             TO  CONTROL-LINE-1
106050000000               MOVE WS-STMT-DTA-SLIT-80
106060000000                                       TO  CL1-LIT
106070000000               MOVE WS-STMT-DTA-SCNT-80
106080000000                                       TO  CL1-CNT
106090000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
106100000000               MOVE "Y"                TO  WS-SELPRT-SW.
106110000000
106120991013           IF  WS-STMT-DTA-SCNT-84
106130991013                          IS GREATER THAN  ZEROES
106140991013               MOVE SPACES             TO  CONTROL-LINE-1
106150991013               MOVE WS-STMT-DTA-SLIT-84
106160991013                                       TO  CL1-LIT
106170991013               MOVE WS-STMT-DTA-SCNT-84
106180991013                                       TO  CL1-CNT
106190991013               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
106200991013               MOVE "Y"                TO  WS-SELPRT-SW.
106210991013
106220000000           IF  WS-SELPRT-SW   IS EQUAL TO  "Y"
106230000000               MOVE SPACES             TO  CONTROL-LINE-1
106240000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
106250000000
106260000000           MOVE SPACES                 TO  CONTROL-LINE-1.
106270000000           MOVE WS-STMT-PRT-HDR-WLIT   TO  CL1-LIT.
106280000000           MOVE WS-STMT-PRT-HDR-WCNT   TO  CL1-CNT.
106290000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
106300000000
106310000000           MOVE SPACES                 TO  CONTROL-LINE-1.
106320000000           MOVE WS-STMT-PRT-DTL-WLIT   TO  CL1-LIT.
106330000000           MOVE WS-STMT-PRT-DTL-WCNT   TO  CL1-CNT.
106340000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
106350000000
106360000000      *****
106370000000      *****    Close all the files.
106380000000      *****
106390980130
106400980130           CLOSE           CURRENCY-FILE
106410980130                           DEALER-MAILING-INSTR
106420000000                           DEALER-FILE
106430000000                           DEALER-REP-FILE
106440000000                           DEALER-REP-MAILING-INSTR
106450000000                           DEALER-REP-ADDRESS
106460000000                           INSTITUTION-ADDRESS
106470000000                           INSTITUTION-BRANCH
106480980130                           INVESTMENT-FILE
106490010222RF8307                     PRODUCT-TYPE-CODES
106500021219R15810                     TRANS-DEDUCTION-DESCR
106510980323                           INVESTOR-JOIN
106520980323                           NOMINEE-ACCOUNT-TYPE-DESCR
106530000000                           NOMINEE-MAILING-INSTRUCTIONS
106540000000                           STMT-MSG-FILE
106550000000                           STMT-PRT-DTL-FILE
106560000000                           STMT-PRT-HDR-FILE
106570991102991102                     ACCOUNT-TYPE-BK
106580000000                           STMT-DTA-FILE
106590190614      *RFS183449-Starts
106600190614      *                    PRINT-FILE.
106610190614                           PRINT-FILE
106620190614                           ACCOUNT-FILE-2.
106630190614      *RFS183449-Ends
106640000000
106650000000       EJR-EXIT.
106660000000           EXIT.
106670000000      /
106680000000       PRINT-CTL-LINE.
106690000000
106700000000      ******************************************************************
106710000000      *                                                                *
106720000000      *    P R I N T   C O N T R O L   L I N E   R O U T I N E         *
106730000000      *                                                                *
106740000000      ******************************************************************
106750000000
106760000000      *****
106770000000      *****    If the page is full, start a new page and print the
106780000000      *****    Heading lines.
106790000000      *****
106800000000
106810000000           IF  WS-LNECNT  IS GREATER THAN  WS-LNEMAX
106820000000               PERFORM PRINT-HDG-LINE THRU PHL-EXIT.
106830000000
106840000000      *****
106850000000      *****    Print the Control line.
106860000000      *****
106870000000
106880000000           WRITE PRINT-RECD          FROM  CONTROL-LINE-1
106890000000                         AFTER  ADVANCING  1.
106900000000           ADD 1                       TO  WS-LNECNT.
106910000000
106920000000       PCL-EXIT.
106930000000           EXIT.
106940000000      /
106950000000       PRINT-HDG-LINE.
106960000000
106970000000      ******************************************************************
106980000000      *                                                                *
106990000000      *    P R I N T   H E A D I N G   L I N E   R O U T I N E         *
107000000000      *                                                                *
107010000000      ******************************************************************
107020000000
107030000000      *****
107040000000      *****    Print Heading line 1 on a new page.
107050000000      *****
107060000000
107070000000           WRITE PRINT-RECD          FROM  HEADING-LINE-1
107080000000                          AFTER ADVANCING  PAGE.
107090000000           ADD 1                       TO  WS-PGECNT.
107100000000           MOVE 1                      TO  WS-LNECNT.
107110000000
107120000000      *****
107130000000      *****    Format and print Heading line 2.
107140000000      *****
107150000000
107160000000           MOVE WS-PGECNT              TO  HL2-PGECNT.
107170000000
107180000000           WRITE PRINT-RECD          FROM  HEADING-LINE-2
107190000000                          AFTER ADVANCING  1.
107200000000           ADD 1                       TO  WS-LNECNT.
107210000000
107220000000      *****
107230000000      *****    Print Heading line 3, if required.
107240000000      *****
107250000000
107260000000           IF  WS-EOJHDG-SW   IS EQUAL TO  "Y"
107270000000               GO TO PHL-0010.
107280000000
107290000000           WRITE PRINT-RECD          FROM  HEADING-LINE-3
107300000000                          AFTER ADVANCING  2.
107310000000           ADD 2                       TO  WS-LNECNT.
107320000000
107330000000       PHL-0010.
107340000000
107350000000      *****
107360000000      *****    Format and print a blank line.
107370000000      *****
107380000000
107390000000           MOVE SPACES                 TO  PRINT-RECD.
107400000000           WRITE PRINT-RECD
107410000000                          AFTER ADVANCING  1.
107420000000           ADD 1                       TO  WS-LNECNT.
107430000000
107440000000       PHL-EXIT.
107450000000           EXIT.
107460190614      *RFS-183449-Starts
107470190614       GET-ACCOUNT-TYPE-CODE.
107480190614           INITIALIZE MFAACCNTP OF ACCOUNT-REC-2.
107490190614           MOVE AD-ACCOUNT
107500190614                    TO  ACCOUNT-NO OF ACCOUNT-REC-2
107510190614
107520190614           READ ACCOUNT-FILE-2
107530190619             INVALID KEY
107540190619             DISPLAY "Account File 2 not found for Account:" AD-ACCOUNT
107550190619             GO TO GAT-EXIT.
107560190614
107570190614           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC-2
107580190614                TO Lc-Acct-Type-Code.
107590190619       GAT-EXIT.
107600190614           EXIT.
107610190614      *RFS183449-Ends
