000100180315      ******************************************************************
000200180717      *    CPANNSTMV - Copybook to hold All WORKING-STORAGE variables  *
000300180712      *                of ANNSTMTJSI program                            *
000400180905      ******************************************************************
000500200303      * PROGRAMMER | YYYY/MM/DD   | DESCRIPTION                        *
000600170928      ******************************************************************
000700171208      * Muthukumar | 2017/09/28   | RFS171359 - Initial Release        *
000800170928      *----------------------------------------------------------------*
000900190723      * Muthukumar | 2017/11/30   | RFS175900 - Opening balance not    *
001000210823      *            |              | updated correctly                  *
001100181023      * Sethu B    * 2018/08/06   * RFS172713 - Section 67 enchancement*
001200210823      * M K SINDHU * 2019/01/03   * RFS180850-generating statement and *
001300190206      *            *              * confirm output                     *
001400190206      * Marita S   * 2019/02/01   * RFS181062                          *
001500190206      *            *              *     - ESG v29 Maintenance Items    *
001600190626      * Niranjan   * 2019/06/26   * RFS183097 - Include Joint Tenant   *
001700190723      *            *              * name in Confirm/Statement          *
001800190723      * Arthy K    * 2019/06/13   * RFS183449 - Populate account type  *
001900190723      *            *              * code based upon investor language  *
002000190723      *            *              * in statement extract               *
002100190806      * Mayilsamy D* 2019/08/01   * RFS1015600 - To Fix Rounding issue *
002200190806      *            *              * with book and market value in      *
002300190806      *            *              * Section 20 of statements           *
002400190919      * Arthy K    * 2019/09/03   * RFS1018431 - Rollback changes done *
002500190919      *            *              * in RFS: 183449                     *
002600190919      * Arthy K    * 2019/09/17   * RFS184715 - Put back changes in RFS*
002700190919      *            *              * 183449 with additional logic of    *
002800190919      *            *              * new edit code 'STMATL'             *
002900191128      * Mayilsamy D* 2019/11/19   * RFS1020558 - To Fix Rounding issue *
003000200108      * Priya N    * 2019/11/15   * RFS185037 - Recompile of MFABNKACP *
003100200313      * Lev O      * 2020/03/13   * RFS1027733 - statement array max   *
003200200313      *            *              *   re-design.                       *
003300200928      * Surendran C* 2020/09/15   * RFS1104542 -Statement Extract is   *
003400200928      *            *              * reporting incorrect market value   *
003500200928      *            *              * change for USD Funds               *
003600201028      * Chaya sp   * 2020/10/28   * RFS1105599 - changes done to       *
003700201028      *            *              * include blank reset type           *
003800201224      * vignesh    * 2020/11/15   * RFS185455 - Death and Maturity Reset
003900201224      *            *              * New Rider Fields Added             *
004000210105      * Surendran C* 2020/12/02   * RFS186446- To Identify first Policy*
004100210105      *            *              * in section 80 statement/confirm    *
004200210902      *            *              * Extract.                           *
004201211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv   *
004202211007      *            *              * Array from 100 to 1000             *
004203211007      *            *              * Tagged as 111744                   *
004600210623      * Kamal T    * 2021/06/23   * RFS186199 - Added working storage  *
004700210708      *            *              * variables for new fields           *
004800190723      * Surendran C* 2021/06/30   * RFS186199 -To include new section83*
004801210913      * Surendran C* 2021/09/13   * RFS186592- To include new Variables*
004802211003      *            *              * for SECTION 12 and 90              *
004803211017      * Vignesh    * 2021/10/18   * RFS1121330 - Changed array size    *
004900200203      ******************************************************************
005000190919
005100170928       01  WS-RETURN-CODE              PIC X(2) VALUE "00".
005200170928      /
005300190919R20804 01  WS-DLRREP-FREQ              PIC X(1) VALUE SPACE.
005400190723R20804 01  WS-DLR-FREQ                 PIC X(1) VALUE SPACE.
005500170928R20804 01  WS-REP-FREQ                 PIC X(1) VALUE SPACE.
005600170928      /
005700170928R18924 01  WS-MODULE1               PIC X(10) VALUE "GDVRSTCON".
005800170928   ¦   01  WS-MODULE                PIC X(10) VALUE SPACES.
005900170928   ¦   01  WS-MODULE-AUTH           PIC X(1)  VALUE SPACES.
006000170928   ¦   01  WS-CONTRACT-RESETS.
006100170928   ¦       05  WS-RESET-CATEGORY    PIC X(1) VALUE SPACES.
006200170928   ¦       05  WS-GDVRST-CONF-SUPPR PIC X(1) VALUE SPACES.
006300170928   ¦       05  WS-RESET-ACCOUNT-NO  PIC S9(9).
006400170928   v       05  WS-RESET-CONTRACT-NO PIC S9(9).
006500170928R18924     05  WS-RESET-RESET-NO    PIC S9(4).
006600170928R64262     05  WS-RESET-TYPE        PIC X(3) VALUE SPACES.
00670019011128107  01  WS-CONTRACT-ATTRIBUTE.
00680017092828107      05  WS-EFFECT-DATE       PIC S9(8).
006900170928R24058 01  WS-CONTR-REDEM-DATA.
007000170928   ¦       05  WS-CONTR-REDEM-CODE      PIC X(6) VALUE SPACES.
007100170928   v       05  WS-CONTR-REDEM-CODE-RULE PIC X(2) VALUE SPACES.
007200170928R24058     05  WS-ACCOUNT-TYPE-CODE     PIC X(5) VALUE SPACES.
007300170928R17495 01  WS-DECLARE-CURSORS.
007400170928R18143     05  WS-DECLARE-DLCKFMCD         PIC X(1) VALUE "Y".
007500170928R18143     05  WS-DECLARE-DRCKFMCD         PIC X(1) VALUE "Y".
007600170928R18143     05  WS-DECLARE-NMCKFMCD         PIC X(1) VALUE "Y".
007700170928R18147     05  WS-DECLARE-ACMBVALU         PIC X(1) VALUE "Y".
007800170928R17495     05  WS-DECLARE-INRSTRF          PIC X(1) VALUE "Y".
007900170928  |        05  WS-DECLARE-STMTTARGET       PIC X(1) VALUE "Y".
008000170928  V        05  WS-DECLARE-PHANTOMFND       PIC X(1) VALUE "Y".
008100170928      * 159149 STARTS
008200170928       01 WS-MKTACC1998-TBL.
008300170928             02 WS-MKTACC1998-ENT occurs 1 TO 30000
008400170928                   DEPENDING ON ln_Array-Size-MKTVAL INDEXED BY MKT1.
008500170928                 03 WS-MKTACC-ENT-ELEMENT.
008600170928                    05 Ws-AccountNo98 PIC S9(9).
008700170928                    05 Ws-MKTvalue98  PIC S9(13)V9(2).
008800170928       01 WS-MKTACC1998               PIC S9(9).
008900170928       01 Ws-MKTval98                 PIC S9(13)V9(2).
009000170928       01 ln_Array-Size-MKTVAL        PIC 9(09).
009100170928       01 lb_AccMktValFlag            PIC X(01).
009200170928         88 lb_AccMktValYes              VALUE "Y".
009300170928         88 lb_AccMktValNo               VALUE "N".
009400170928       01 WS-LDA-INV-NO               PIC X(9) VALUE ZEROES.
009500170928       01 WS-LDA-ACC-DLR              PIC X(4) VALUE ZEROES.
009600170928       01 WS-LDA-ACC-DLREP            PIC X(5) VALUE ZEROES.
009700170928       01 WS-LDA-ACC-NO               PIC S9(9) VALUE ZEROES.
009800170928      * RFS 159149 ENDS
009900170928R18143 01  ACMBVALU-EXCHANGE-ARRAY.
010000170928           02 ACMBVALU-EXCHANGE OCCURS 20 TIMES.
010100170928               05 ACMBVALU-CURRENCY         PIC X(3).
010200170928               05 ACMBVALU-QT-DATE          PIC S9(8).
010300170928               05 ACMBVALU-TRADE-DATE       PIC S9(8).
010400170928               05 ACMBVALU-EXCHANGE-RATE    PIC S9(2)V9(7).
010500170928R18832 01  WS-LDA-ENDDTE-SV                       PIC S9(8).
010600170928R21596 01  WS-TMP-ENDDTE                          PIC S9(8).
010700170928R16511/
010800170928  ¦    01  WS-CONS-ACCT-ID                        PIC X(20).
010900170928  ¦    01  WS-TARGET-MIX-PERCENTAGE               PIC S9(5)V9(2).
011000170928R20561 01  WS-TARGET-MIX-PERCENTAGE-AC            PIC S9(5)V9(2).
011100170928  ¦    01  WS-EFFECTIVE-DATE                      PIC S9(8).
011200170928  ¦    01  WS-ASSET-CLASS-CODE                    PIC X(6).
011300170928  ¦    01  WS-ASSET-SUB-CLASS-CODE                PIC X(6).
011400170928  ¦    01  WS-IPS-DECLARE-CURSOR                  PIC X(1) VALUE "Y".
011500170928  ¦    01  WS-PASS-PARM-S17.
011600170928  ¦        03  WS-IPS-INVESTOR-NO                 PIC 9(9).
011700170928  ¦        03  WS-IPS-ACCOUNT-NO                  PIC 9(9).
011800170928  ¦        03  WS-IPS-ACCOUNT-COUNT               PIC 9(5).
011900170928  ¦        03  WS-IPS-REQUEST-SCOPE               PIC X(1).
012000170928  ¦        03  WS-IPS-STMT-END-DATE               PIC 9(8).
012100170928  ¦        03  WS-IPS-CONS-ACCT-ID                PIC X(20).
012200170928  ¦        03  WS-IPS-EFFECTIVE-DATE              PIC 9(8).
012300170928  ¦        03  WS-IPS-CONS-ACCT-NAME              PIC X(80).
012400170928  ¦        03  WS-IPS-DEALER-NAME                 PIC X(35).
012500170928  ¦        03  WS-IPS-REP-FIRST-NAME              PIC X(20).
012600170928  ¦        03  WS-IPS-REP-LAST-NAME               PIC X(20).
012700170928  ¦        03  WS-IPS-REP-ADDR1                   PIC X(40).
012800170928  ¦        03  WS-IPS-REP-ADDR2                   PIC X(40).
012900170928  ¦        03  WS-IPS-REP-ADDR3                   PIC X(40).
013000170928  ¦        03  WS-IPS-REP-ADDR4                   PIC X(40).
013100170928  ¦        03  WS-IPS-REP-ADDR5                   PIC X(40).
013200170928  ¦        03  WS-IPS-REP-POSTAL-CODE             PIC X(12).
013300170928  ¦        03  WS-IPS-REP-COUNTRY-CODE            PIC X(3).
013400170928  v        03  WS-MAILING-ACCOUNT-NO              PIC S9(9).
013500170928R18667     03  WS-REP-PHONE-AREA-CODE             PIC 9(3).
013600170928  ¦        03  WS-REP-PHONE-NUMBER                PIC 9(7).
013700170928  ¦        03  WS-REP-PHONE-EXT                   PIC 9(6).
013800170928  v        03  WS-REP-FAX-AREA-CODE               PIC 9(3).
013900170928R18667     03  WS-REP-FAX-NUMBER                  PIC 9(7).
014000170928R19444     03  WS-IPS-ADDRESS-1                   PIC X(40).
014100170928  ¦        03  WS-IPS-ADDRESS-2                   PIC X(40).
014200170928  ¦        03  WS-IPS-ADDRESS-3                   PIC X(40).
014300170928  ¦        03  WS-IPS-ADDRESS-4                   PIC X(40).
014400170928  ¦        03  WS-IPS-ADDRESS-5                   PIC X(40).
014500170928  ¦        03  WS-IPS-POSTAL                      PIC X(12).
014600170928  ¦        03  WS-IPS-COUNTRY                     PIC X(3).
014700170928R19444     03  WS-IPS-PROVINCE                    PIC X(3).
014800170928R16511     03  WS-IPS-RETURN-CODE                 PIC X(2).
014900170928       01  WS-TIME.
015000170928           03 WHM          PIC 9(4).
015100170928           03 WSS          PIC 99.
015200170928           03 WCC          PIC 99.
015300170928      /
015400170928R10243 01  WS-FIRST-TRADE-DATE         PIC 9(8).
015500170928R15880 01  WS-FXINR-INVESTMENT-CODE    PIC X(5)  VALUE SPACES.
015600170928  `    01  WS-MLTFAMFNDD-FUNC-CODE     PIC X(10) VALUE "MLTFAMFNDD".
015700170928  `    01  WS-MLTFAMFND-FUNC-CODE      PIC X(10) VALUE "MLTFAMFND".
015800170928  `    01  WS-FXINR-INV-STRUCTURE-CODE PIC X(10) VALUE SPACES.
015900170928  `    01  WS-FXTRR-ACCOUNT-NO         PIC S9(9).
016000170928  `    01  WS-FXTRR-PROCESS-DATE       PIC S9(9).
016100170928  `    01  WS-FXTRR-CLOSING-UNIT-BAL   PIC S9(10)V9(3).
016200170928  `    01  WS-INTERNAL-AMT-PREV        PIC S9(11)V9(2).
016300170928      *RFS123925 Start
016400170928       01  ln-PGAP-Maximum-Amount      PIC S9(09)V9(2).
016500170928       01  ln-LDAP-Maximum-Amount      PIC S9(09)V9(2).
016600170928       01  lc-Year                     PIC S9(04).
016700170928      *RFS123925 End
016800170928      * RFS124157 - Start
016900170928       01  ln_YTDRESPRollOver          PIC S9(09)V9(2).
017000170928       01  lc_YTDRESPRollOverSign      PIC X(01).
017100170928       01  ln_LTDRESPRollOver          PIC S9(9)V9(2).
017200170928       01  lc_LTDRESPRollOverSign      PIC X(01).
017300170928       01  lc_StartDate                PIC X(08).
017400170928       01  lc_NewStartDate             PIC X(08).
017500170928      * RFS124157 - End
017600170928      *RFS145044 - Starts
017700170928       01 lc_DeliveryOption            PIC X(01).
017800170928       01 li_AccNo                     PIC S9(9) VALUE ZEROES.
017900170928      *RFS145044 - Ends
018000170928      * RFS151412-START
018100170928       01  lc_LWAResetValues.
018200170928           03  LC-RESET-NUMBER         PIC S9(3).
018300170928           03  LC-RESET-REQUEST-DATE   PIC S9(8).
018400170928           03  LC-EFFECTIVE-DATE       PIC S9(8).
018500170928           03  LC-LAST-RESET-DATE      PIC S9(8).
018600170928           03  LC-LAST-RESET-NUMBER    PIC S9(3).
018700170928           03  LC-RESET-CATEGORY       PIC X(1).
018800170928           03  LC-RESET-PROCESS-DATE   PIC S9(8).
018900170928           03  LC-RESET-TYP            PIC X(3).
019000170928       01 WS-MULTI-TYPE                PIC X(1) VALUE " ".
019100170928       01 li_OriginalGWAValue          PIC S9(13)V9(2).
019200170928       01 li_CurrentEWAValue           PIC S9(13)V9(2).
019300170928       01 li_ResetEffectDt             PIC S9(8).
019400170928       01 li_ResetNo                   PIC S9(3).
019500170928       01 li_LWAAccountNo              PIC S9(9).
019600170928       01 li_LWAContractNo             PIC S9(9).
019700170928       01 li_PrevContract              PIC S9(9).
019800170928       01 lc_LWAExistFlag              PIC X.
019900170928           88 lb_LWAExistYes             Value "Y".
020000170928           88 lb_LWAExistNo              Value "N".
020100170928       01 lc_LWAProcessFlag           PIC X.
020200170928           88 lb_LWAProcessYes           Value "Y".
020300170928           88 lb_LWAProcessNo            Value "N".
020400170928       01 lc_NewLWAContractFlag       PIC X.
020500170928           88 lb_NewLWAContractYes       Value "Y".
020600170928           88 lb_NewLWAContractNo        Value "N".
020700170928      * RFS151412-END
020800170928151413 01 LI_CERTMATUREAMT            PIC S9(11)V9(2).
020900170928151413 01 LI_CERTMATUREDATE           PIC S9(08).
021000170928R10737*** Begin of rfs10737
021100170928      ***
021200170928      *** GIC/DII Accrued interest was calculated more than one day
021300170928      *** of the Statement end date.
021400170928      ***
021500170928      *** GREGORIAN TO JULIAN
021600170928       01 G2J-PARMS.
021700170928          05 G2J-GREGORIAN                  PIC S9(8).
021800170928          05 G2J-JULIAN                     PIC S9(8).
021900170928      *** JULIAN TO GREGORIAN
022000170928       01 J2G-PARMS.
022100170928          05 J2G-JULIAN                     PIC S9(8).
022200170928          05 J2G-GREGORIAN                  PIC S9(8).
022300170928      *** JULIAN TO GREGORIAN
022400170928R10737 01  WS-GIC-DII-END-DATE              PIC 9(8).
022500170928      *** End of rfs10737
022600170928      *RFS116317 - Begin
022700170928       01  lc_ScreenAllowed_BYPRST.
022800170928           05 lc_BYPRST_ScreenCode        PIC X(8) VALUE "ACCCDTL".
022900170928           05 lc_BYPRST_EditCode          PIC X(6) VALUE "BYPRST".
023000170928           05 lc_BYPRST_EditLevel         PIC X(1) VALUE "A".
023100170928           05 lc_BYPRST_RtnFlag           PIC X.
023200170928              88 lb_BYPRST_EditYes           Value "Y".
023300170928              88 lb_BYPRST_EditNo            Value "N".
023400170928      *RFS116317 - End
023500170928      * RFS115161 - Start
023600170928       01  lb_Invaliddata                 PIC 1.
023700170928         88  lb_InvaliddataTrue                 VALUE B"1".
023800170928         88  lb_InvaliddataFalse                VALUE B"0".
023900170928      * RFS115161 - End
024000170928      * RFS38037 Start
024100170928       01  OvrGbv_ScreenEditsAllowed.
024200170928           03  lc_AccDtlScreenCode        PIC X(08) VALUE "ACCCDTL".
024300170928           03  lc_OvrGbvEditCode          PIC X(06) VALUE "OVRGBV".
024400170928           03  lc_OvrGbvLevelCode         PIC X(01) VALUE "C".
024500170928       01 lc_Conditions.
024600170928           02 lc_OvrGbv                   PIC X(01)  VALUE SPACE.
024700170928              88 lncc_OvrGbvSetUp                    VALUE "Y".
024800170928              88 lncc_OvrGbvNotSetUp                 VALUE "N".
024900170928R83550 01  Lc-Investment-Structure-Select.
025000170928   |       03  lc_InvStrSelScreenCode  PIC X(08) VALUE "STMTJSI".
025100170928   |       03  lc_InvStrSelEditCode    PIC X(06) VALUE "INVSTS".
025200170928   |       03  lc_InvStrSelCode        PIC X(01) VALUE "A".
025300170928   V
025400170928R83550 01 Lc_InvStrSel                 PIC X(01)  VALUE SPACE.
025500170928
025600170928R88823 01  Lc-Bypass-Trans-Two-Sides.
025700170928   |       03  lc_BYPSTMSelScreenCode  PIC X(08) VALUE "STMTJSI".
025800170928   |       03  lc_BYPSTMSelEditCode    PIC X(06) VALUE "BYPSTM".
025900170928   |       03  lc_BYPSTMSelCode        PIC X(01) VALUE "T".
026000170928   V
026100170928R88823 01 Lc_BYPSTMTrn                 PIC X(01)  VALUE SPACE.
026200170928101829 01  Lc-Use-Calculated-BV.
026300170928   |       03  lc_CLCBV_SelScreenCode  PIC X(08) VALUE "STMTJSI".
026400170928   |       03  lc_CLCBV_SelEditCode    PIC X(06) VALUE "CLCBV ".
026500170928   |       03  lc_CLCBV_SelCode        PIC X(01) VALUE "T".
026600170928   V
026700170928101829 01 Lc_CLCBV                     PIC X(01)  VALUE SPACE.
026800170928105408 01  Lc-Statement-Payment-Option.
026900170928   |       03  lc_PayOptionScreenCode  PIC X(08) VALUE "STMTJSI".
027000170928   |       03  lc_PayOptionEditCode    PIC X(06) VALUE "STMPAY".
027100170928   |       03  lc_PayOptionCode        PIC X(01) VALUE "A".
027200170928   |       03  lc_AWD_Option           PIC X(01) VALUE " ".
027300170928   V
027400170928105408 01 Lc_PayOption                 PIC X(01)  VALUE SPACE.
027500170928       01  lc_WorkingStorageFields.
027600170928           03  ln_LdaEndDate              PIC S9(09).
027700170928           03  li_OvrGbvEffectDate        PIC S9(09).
027800170928R93365     03  ln_CountlnKind             PIC S9(01).
027900170928R93365     03  li_placementdate           PIC S9(09).
028000170928R93365     03  li_transno                 PIC S9(09).
028100170928           03  lncc_OVGBV                 PIC X(05)  VALUE "OVGBV".
028200170928           03  lncc_IVGBV                 PIC X(05)  VALUE "IVGBV".
028300170928102988     03  lncc_00                    PIC X(02)  VALUE "00".
028400170928102988     03  lncc_I                     PIC X(01)  VALUE "I".
028500170928102988     03  lncc_S                     PIC X(01)  VALUE "S".
028600170928      * RFS38037 End
028700170928R57388     03  lncc_GDV                   PIC X(03)  VALUE "GDV".
028800201028120809     03  lncc_GBV                   PIC X(03)  VALUE "GBV".
028900201226105599     03  lncc_COG                   PIC X(03)  VALUE "COG".
029000210119185455     03  lncc_MBRST                 PIC X(05)  VALUE "MBRST".
029100201226185455     03  lncc_DBRST                 PIC X(05)  VALUE "DBRST".
029200170928185455     03  lncc_Adaccount             PIC S9(9).
029300170928R57388     03  lc_ProcessGDCS             PIC X(01).
029400170928R57388         88  lc_ProcessGDCSYes      VALUE "Y".
029500170928R57388         88  lc_ProcessGDCSNo       VALUE "N".
029600170928      * RFS47406 Start
029700170928           03  lc_InvestmentSeries        PIC X(05).
029800170928           03  lc_InvSeries               PIC X(05).
029900170928           03  lc_InvestmentCode          PIC X(05).
030000170928 84572     03  lc_dfltage                 PIC S9(03).
030100170928 84572     03  lc_seriestype              PIC X(04).
030200170928           03  lc_SegGLWB                 PIC X(01).
030300170928               88  lc_SegGLWBYes          VALUE "Y".
030400170928               88  lc_SegGLWBNo           VALUE "N".
030500170928           03  lc_GuarWthrlPrcnt          PIC 9(3)V99.
030600170928           03  ld_StartDate               PIC 9(08).
030700170928           03  ld_StartDate_R             REDEFINES ld_StartDate.
030800170928               05 ld_StartDateCCYY        PIC 9(04).
030900170928               05 ld_StartDateMM          PIC 9(02).
031000170928               05 ld_StartDateDD          PIC 9(02).
031100170928           03  ld_AsAtDate                PIC S9(08).
031200170928           03  ld_AsAtDate_R              REDEFINES ld_AsAtDate.
031300170928               05 ld_AsAtDateCCYY         PIC 9(04).
031400170928               05 ld_AsAtDateMM           PIC 9(02).
031500170928               05 ld_AsAtDateDD           PIC 9(02).
031600170928           03  ln_GuarWithdrawalAmt       PIC S9(11)V99.
031700170928           03  ln_GuarWithdrawalExcess    PIC S9(11)V99.
031800170928           03  ln_OldGuarWthdwlBaseVal    PIC S9(11)V99.
031900170928           03  ln_GWBaseChange            PIC S9(11)V99.
032000170928           03  lc_GWBaseCalcMethod        PIC X(01).
032100170928           03  ln_OldGuarWthdwlBalance    PIC S9(11)V99.
032200170928           03  ln_GWBalanceChange         PIC S9(11)V99.
032300170928           03  lc_FIEBaseCalcMethod       PIC X(01).
032400170928           03  ld_GWAStartDate            PIC S9(09).
032500170928           03  ln_GWAContractNo           PIC S9(09).
032600170928           03  ld_GLWADateOfBirth         PIC S9(08).
032700170928           03  ld_GLWADateOfBirth-R       REDEFINES ld_GLWADateOfBirth.
032800170928               05 ld_GLWADOB_CCYY         PIC 9(4).
032900170928               05 ld_GLWADOB_MMDD         PIC 9(4).
033000170928           03  ln_TotGuarWthdrlBaseVal    PIC S9(11)V99.
033100170928           03  ln_TotGuarWthdrlBal        PIC S9(11)V99.
033200170928           03  ld_CCYYMMDD                FORMAT DATE "@Y%m%d".
033300170928           03  ln_GrossAmtSum             PIC S9(16)V99.
033400170928           03  li_RecordCnt               PIC S9(08).
033500170928           03  ld_ProcessDate             PIC S9(09).
033600170928           03  li_TransProcSeqNo          PIC S9(03).
033700170928           03  ld_GLWAStartDte            PIC S9(09).
033800170928           03  ld_GLWAInitDepEndDte       PIC S9(08).
033900170928           03  li_GLWAInitDepDays         PIC S9(05).
034000170928           03  li_InitDepDays             PIC S9(05).
034100170928      * RFS50993.2 - Start
034200170928           03  lc_GLWAInitDepDays         PIC X(05) JUSTIFIED RIGHT.
034300170928           03  lc_InitDepDays             PIC X(05) JUSTIFIED RIGHT.
034400170928      * RFS50993.2 - End
03450017092872750      03  lc_NotionalTrans           PIC X(01).
03460017092872750          88  lc_NotionalTrnYes      VALUE "Y".
03470017092872750          88  lc_NotionalTrnNo       VALUE "N".
034800170928      *RFS 80555 Begins
034900170928           03  lc_jointFoundFlag          PIC  X(1).
035000170928               88  lncc_jointFoundNo           VALUE SPACES.
035100170928               88  lncc_jointFoundYes          VALUE "Y".
035200170928           03  li_CurrYrGLWA              PIC S9(11)V9(02).
035300170928           03  ln_SaveGWAPercent          PIC S9(03)V9(02).
035400170928           03  ln_AlternateGwaPercent     PIC S9(03)V9(02).
035500170928           03  lc_SaveInvestSeries        PIC X(05).
035600170928           03  li_AnnuitantAge            PIC S9(3).
035700170928           03  li_EligibleDate            PIC  9(8).
035800170928           03  li_EligibleDate2 REDEFINES li_EligibleDate.
035900170928               05 li_EligibleDateYYYY     PIC  9(4).
036000170928               05 li_EligibleDateMMDD     PIC  9(4).
036100170928           03  li_AnnDOB.
036200170928               05 li_AnnDOBYYYY           PIC  9(4).
036300170928               05 li_AnnDOBMMDD           PIC  9(4).
036400170928      * RFS63488 Begin
036500170928           03  lncc_GWB                   PIC X(03)  VALUE "GWB".
036600170928           03  lncc_GBB                   PIC X(03)  VALUE "GBB".
036700170928           03  pc-GLWB                    PIC X(01).
036800170928               88 GLWB-Yes                VALUES "Y".
036900170928               88 GLWB-No                 VALUES "N".
037000170928           03  lc-Inv                     PIC X(05).
037100170928           03  lc-Series                  PIC X(04).
037200170928           03  lc-Series5.
037300170928               05  lc-Series14            PIC X(04).
037400170928               05  lc-Series55            PIC X VALUE ' '.
037500170928      * RFS63488 End
037600170928      * RFS96081 Begin
037700170928           03  lc_lang_code               PIC X.
037800170928           03  lc_EW_alert                PIC X(50).
037900170928           03  lc_EWAFlag                 PIC X.
038000170928      * RFS96081 Ends
038100170928      * RFS104483 Starts
038200170928           03  lc_Account-No              PIC S9(09).
038300170928           03  lc_Account-Attr            PIC X(05).
038400170928133282     03  ld_ExpiryDate              PIC S9(08).
038500170928133282     03  ld_EffectivDate            PIC S9(08).
038600170928      * RFS104483 Ends
038700170928      *RFS132849 - Starts *
038800170928           03  MReset                     PIC X(01).
038900170928               88 MResetExists             VALUE "Y".
039000170928           03  Mat0F                      PIC X(01).
039100170928               88 Mat0                     VALUE "Y".
039200170928           03  lncc_y                     PIC X(01) VALUE "Y".
039300170928      *RFS132849 - Ends   *
039400170928      *RFS129378 - Start
039500170928           03  li_AtRate                  PIC S9(03)V9(03).
039600170928           03  ld_MatDate                 PIC S9(08).
039700170928           03  li_Account-No              PIC S9(09).
039800170928           03  lc_Investment-Code         PIC X(5).
039900170928           03  li_Certif-ID-No            PIC S9(10).
040000170928           03  lc_Int-Payment-Option      PIC X(1).
040100170928           03  lc_Int-Payment-Frequency   PIC X(2).
040200170928           03  li_Initial-Amount          PIC S9(11)V9(02).
040300170928           03  ld_Issue-Date              PIC S9(08).
040400170928           03  ld_PlacementDate           PIC S9(08).
040500170928           03  li_Trans-No                PIC S9(09).
040600170928152312     03  lc_Cert_Status             PIC X(1).
040700170928      *RFS 137921 - Begins.
040800170928           03  li_IntAccrualAmt           PIC S9(13)V9(2).
040900170928           03  li_Account                 PIC S9(09) COMP-3.
041000170928           03  lc_ErrCodeDescr01            PIC X(80)  VALUE
041100170928                "Error selecting value from WRKGICINT table".
041200170928155097     03  lc_ErrCodeDescr02            PIC X(80)  VALUE
041300170928155097          "UnSuccessfull Return from GICINTCLC call".
041400170928      *RFS 137921 - Ends.
041500170928130038     03  lc_supprconf               PIC X(1).
041600170928139988     03  lc_CERTFCTE_NO             PIC S9(10).
041700170928139988     03  lc_term_mat                PIC X(1).
041800170928139988     03  lc_Yes                     PIC X(1) VALUE "Y".
041900170928139988     03  lc_No                      PIC X(1) VALUE "N".
042000170928138172     03  lc_GuarMatSchedCode        PIC X(05).
042100170928138172     03  lc_MaturityRule            PIC X(3) VALUE SPACES.
042200170928138172     03  lncc_Spaces                PIC X(05) VALUE SPACES.
042300170928138172     03  li_StartDate               PIC S9(08).
042400170928138172     03  lc_AcctTypeCode            PIC X(05) VALUE SPACES.
042500170928151145     03  lc_CrossRefNumber          PIC X(10) VALUE SPACES.
042600170928147795     03  lc_InvCode                 PIC X(05) VALUE SPACES.
042700170928147795     03  ln_YTDTrailer              PIC S9(11)V9(2) VALUE 0.
042800170928162904     03  ln_Inv-TRL-AMT             PIC S9(11)V9(2) Comp-3
042900170928162904                                    VALUE 0.
043000170928147795     03  ln_EndYear                 PIC S9(04) VALUE 0.
043100170928147795     03  ln_StartYear               PIC S9(04) VALUE 0.
043200170928147795     03  ln_EndMonth                PIC S9(02) VALUE 0.
043300201224147795     03  ln_StartMonth              PIC S9(02) VALUE 0.
043400170928186198     03 lc_ACINVGInvStruc           PIC X(05) VALUE SPACES.
043500170928148326     03  ln_Mer                     PIC S9(03)V9(2) VALUE 0.
043600170928  |        03  lc_InvRiskRatingDesc       PIC X(50) VALUE SPACES.
043700170928  |        03  lc_InvObjectDescr          PIC X(25) VALUE SPACES.
043800170928  |        03  lc_TimeHorizonDescr        PIC X(25) VALUE SPACES.
043900170928  |        03  lc_RiskToleranceDescr      PIC X(25) VALUE SPACES.
044000170928  |        03  WS-MRRINV-CODE1            PIC X(5).
044100170928  |        03  WS-INVMER-PER1             PIC S9(3)V9(2) VALUE 0.
044200170928  |        03  WS-RR-LANG-FLAG1           PIC X(1).
044300170928  |        03  WS-RR-DES1                 PIC X(50).
044400170928  |        03  ln_InvMer                  PIC S9(03)V9(2) VALUE 0.
044500170928  |    01  WS-MRRINV-TBL.
044600170928  |        02 WS-MRRINV-ENT  OCCURS 1 TO 30000
044700170928  |                 DEPENDING ON ln_Array-Size-MRR INDEXED BY MRR.
044800170928  |          03 WS-MRRINV-ENT-ELEMENT.
044900170928  |             05  WS-MRRINV-CODE   PIC X(5).
045000170928  |             05  WS-INVMER-PER    PIC S9(3)V9(2).
045100170928  |             05  WS-RR-LANG-FLAG  PIC X(1).
045200170928  |             05  WS-RR-DES        PIC X(50).
045300170928  |    01  WS-MERINV-TBL.
045400170928  |         02 WS-MERINV-ENT         OCCURS 1 TO 30000
045500170928  |               DEPENDING ON ln_Array-Size-MER INDEXED BY MER.
045600170928  |           03 WS-MERINV-ENT-ELEMENT.
045700170928  |             05  WS-MERINV-CODE   PIC X(5).
045800170928  |             05  WS-MER-PER       PIC 9(3)V9(2).
045900170928148326          05  WS-INVMER-AMT    PIC 9(11)V9(2).
046000170928       01 lc_GICMatVAlue.
046100170928144286*  03 lc_LoadArray OCCURS 300 TIMES INDEXED BY Idx.
046200170928144286   03 lc_LoadArray OCCURS 2000 TIMES INDEXED BY Idx.
046300170928           05  li_CertIDNo                PIC S9(10).
046400170928           05  li_MatValue                PIC S9(11)V9(2).
046500170928           05  li_AccInt                  PIC 9(11)V9(2).
046600170928               05  li_AccIntSign              PIC X(1).
046700170928               05  li_Ag_Balance              PIC 9(11)V9(2).
046800170928       01  li_PopMATidx                   PIC S9(04) VALUE 0.
046900170928      *RFS129378 - End
047000170928137504 01  lc_Provinceofagreement         PIC X(03).
047100170928      * RFS112003 - Strats
047200170928      * Building a table arrays to store, defined English and French
047300170928      * Description for Frequency Code and Plan Type Code.
047400170928      * Plan-Type-Name Record.
047500170928       01  lc_PlanTypeTable.
047600170928         03  ltb_PlanTypeRecord           OCCURS 200 TIMES
047700170928                                          INDEXED BY li_IxPT.
047800170928           05  lc_PTPlanTypeCode          PIC X(03).
047900170928           05  lc_PTEnglishDesc           PIC X(40).
048000170928           05  lc_PTFrenchDesc            PIC X(40).
048100170928      * Plan-Type-Code Record.
048200170928       01  lc_PlanCodeTable.
048300170928         03  ltb_PlanCodeRecord           OCCURS 200 TIMES
048400170928                                          INDEXED BY li_IxPC.
048500170928           05  lc_PCPlanTypeCode          PIC X(03).
048600170928           05  lc_PCEnglishDesc           PIC X(10).
048700170928           05  lc_PCFrenchDesc            PIC X(10).
048800170928      * Frequency-Code Record.
048900170928       01  lc_FreqCodeTable.
049000170928         03  ltb_FreqCodeRecord           OCCURS 200 TIMES
049100170928                                          INDEXED BY li_IxFC.
049200170928           05  lc_FCFrequencyCode         PIC X(02).
049300170928           05  lc_FCEnglishDesc           PIC X(25).
049400170928           05  lc_FCFrenchDesc            PIC X(25).
049500170928       01  lc_Flags.
049600170928         03 lb_PTMatch                    PIC X(01).
049700170928            88  lb_PTMatchYes                        VALUE "Y".
049800170928            88  lb_PTMatchNo                         VALUE "N".
049900170928         03 lb_PCMatch                    PIC X(01).
050000170928            88  lb_PCMatchYes                        VALUE "Y".
050100170928            88  lb_PCMatchNo                         VALUE "N".
050200170928         03 lb_FCMatch                    PIC X(01).
050300170928            88  lb_FCMatchYes                        VALUE "Y".
050400170928            88  lb_FCMatchNo                         VALUE "N".
050500170928      *RFS169965 - Starts
050600170928         03 lb_DSROtherAcc               PIC X(01).
050700170928            88  lb_DSROtherAccYes                    VALUE "Y".
050800170928            88  lb_DSROtherAccNo                     VALUE "N".
050900170928         03 lb_DSR                       PIC X(01).
051000170928            88  lb_DSRYes                            VALUE "Y".
051100170928            88  lb_DSRNo                             VALUE "N".
051200170928
051300170928       01  li_DSRPlaceDate                PIC S9(09).
051400170928       01  li_DSRPlaceDate2               PIC S9(09).
051500170928       01  li_DSRTransNo                  PIC S9(09).
051600170928       01  li_DSRTransNo2                 PIC S9(09).
051700170928       01  li_RVSPlaceDate                PIC S9(09).
051800170928       01  li_RVSPlaceDate2               PIC S9(09).
051900170928       01  li_RVSTransNo                  PIC S9(09).
052000170928       01  li_RVSTransNo2                 PIC S9(09).
052100170928       01  lc_RVS                         PIC X(3)   VALUE "RVS".
052200170928
052300170928      *RFS169965 - Ends
052400170928      * Variables for WorkFields.
052500170928       01  lc_WorkFields.
052600170928         03  li_Count                     PIC S9(09) VALUE 0.
052700170928         03  li_MaxFetch                  PIC S9(03) VALUE 0.
052800170928         03  lc_PlanType                  PIC X(03).
052900170928         03  lc_PlanFreq                  PIC X(02).
053000170928         03  lc_LanguageCode              PIC X(01).
053100170928         03  lc_TargetValue               PIC X(250) VALUE SPACES.
053200170928      * RFS112003 - Ends
053300170928      *RFS 137921 - Begins.
053400170928       01  Ws-Err-Code                PIC X(02) VALUE SPACES.
053500170928         88 lnc_Err01                           VALUE "06".
053600170928      *RFS 137921 - Ends.
053700170928      * RFS93662 Start
053800170928       01  lc_OMSEXT_ScreenEditsAllowed.
053900170928           03  lc_OMSEXTScreenCode        PIC X(08) VALUE "OMSSTM".
054000170928           03  lc_OMSEXTEditCode          PIC X(06) VALUE "OMSEXT".
054100170928           03  lc_OMSEXTlevelCode         PIC X(01) VALUE "T".
054200170928           03  lb_OMSEXT                  PIC X(01) VALUE SPACE.
054300170928               88 lb_OMSEXTYes                      VALUE "Y".
054400170928       01  lc_NomineeOMSArea.
054500170928           03 li_CountOMS                 PIC S9(2) VALUE ZERO.
054600170928           03 lc_AccountTypeCodeOMS       PIC  X(5) VALUE SPACE.
054700170928           03 lc_NomineeTypeCodeOMS       PIC  X(5) VALUE SPACE.
054800170928           03 lc_NomineeOMS               PIC  X(1) VALUE SPACE.
054900170928           03 lc_SpousalOMS               PIC  X(1) VALUE SPACE.
055000170928           03 lc_GroupOMS                 PIC  X(1) VALUE SPACE.
055100170928           03 lc_lockinOMS                PIC  X(1) VALUE SPACE.
055200170928           03 lc_JointOMS                 PIC  X(1) VALUE SPACE.
055300170928           03 lc_TransTypeOMS             PIC  X(3) VALUE SPACE.
055400170928           03 lc_TransSubTypeOMS          PIC  X(5) VALUE SPACE.
055500170928           03 lc_TransOriginOMS           PIC  X(3) VALUE SPACE.
055600170928           03 lc_ContrRedeemOMS           PIC  X(6) VALUE SPACE.
055700170928      * RFS93662 End
055800170928      *******
055900170928       01  pc-InvestmentSeriesCode               PIC X(05).
056000170928       01  pc-InvestmentSeriesFlag               PIC X(01).
056100170928           88  pb-InvestSeriesExistYes           VALUE "Y".
056200170928           88  pb-InvestSeriesExistNo            VALUE "N".
056300170928       01  pc-RFGWRULErules                      PIC X(1024).
056400170928       01  pc-RFGWRULEfields REDEFINES pc-RFGWRULErules.
056500170928           03 pc-AllowMultipleContracts          PIC X(01).
056600170928           03 pc-EligibilityDateRule             PIC X(03).
056700170928           03 pc-EligibleDateMinAge              PIC X(03).
056800170928           03 pc-EligibleDateMaxAge              PIC X(03).
056900170928           03 pc-EligibleStartDftAge             PIC X(03).
057000170928           03 pc-ForceStartDftAge                PIC X(03).
057100170928           03 pc-StartDateApplicable             PIC X(01).
057200170928           03 pc-InitialDepositRule              PIC X(03).
05730017092855525 *    03 pc-InitialDepositDay               PIC X(03).
05740017092855525      03 pc-InitialDepositDay               PIC X(05).
057500170928           03 pc-InitialDepositMinAge            PIC X(03).
057600170928           03 pc-InitialDepositProRate           PIC X(01).
057700170928           03 pc-GLWACalcRule                    PIC X(03).
057800170928           03 pc-GLWARateLockingRule             PIC X(03).
057900170928           03 pc-DownAdjustmentRule              PIC X(03).
058000170928           03 pc-UpAdjustmentRule                PIC X(03).
058100170928           03 pc-BonusBaseSetTo0Rule             PIC X(03).
058200170928           03 pc-ResetSkipFreqYrs                PIC X(02).
058300170928           03 pc-ResetApplicableYrs              PIC X(02).
058400170928           03 pc-ResetRevSkipFreq                PIC X(02).
058500170928           03 pc-ResetRevApplYrs                 PIC X(02).
058600170928           03 pc-ResetMaximumAge                 PIC X(03).
058700170928           03 pc-FeeCode                         PIC X(05).
058800170928           03 pc-BypassRule                      PIC X(02).
058900170928           03 pc-BonusAddFlag                    PIC X(01).
059000170928           03 filler                             PIC X(961).
059100170928       01  pc-RejectionCode                      PIC X(02).
059200170928           88  pb-ValidRule                      VALUE "00".
059300170928           88  pb-ErrorFound                     VALUE "99".
059400170928      *RFS 80555 Ends
059500170928      * RFS47406 End
059600170928      * RFS 38639  - begins.
059700170928       01  lc_EOF                         PIC  X VALUE "N".
059800170928           88 EOF                                VALUE "Y".
059900170928       01  li_Seq_No_Cnt                  PIC S9(7) VALUE 0.
060000170928       01  lni-Reset-Process-Date         PIC S9(8) VALUE 0.
060100170928       01  Total_RC_Base_Values.
060200170928           03  Tot-RC-Old-Guar-Base-B     PIC 9(11)V9(2)  COMP-3.
060300170928           03  Tot-RC-New-Guar-Base-B     PIC 9(11)V9(2)  COMP-3.
060400170928           03  Tot-RC-Old-Guar-Base       PIC 9(11)V9(2)  COMP-3.
060500170928           03  Tot-RC-New-Guar-Base       PIC 9(11)V9(2)  COMP-3.
060600170928R64262     03  Tot-RC-Old-Guar-Death-Base PIC 9(11)V9(2)  COMP-3.
060700170928R64262     03  Tot-RC-New-Guar-Death-Base PIC 9(11)V9(2)  COMP-3.
060800170928R64262     03  Tot-RC-Old-GUAR-MAT-VALUE  pic 9(11)V9(2)  COMP-3.
060900170928R64262     03  Tot-RC-New-GUAR-MAT-VALUE  pic 9(11)V9(2)  COMP-3.
061000170928R63488     03  Tot-RC-Old-Guar-B-B-2      PIC S9(11)V9(2)  COMP-3.
061100170928R63488     03  Tot-RC-Old-Guar-B-2        PIC S9(11)V9(2)  COMP-3.
061200170928R74979 01  Total_RC_Type-Cat.
061300170928R74979     03  Tot-RESET-CATEGORY         PIC X(1) VALUE SPACES.
061400170928R64979     03  Tot-RESET-TYPE             PIC X(3) VALUE SPACES.
061500170928       01 lc-Edit-Codes.
061600170928          05 lc-Edit-GbvRst               PIC X(01).
061700170928             88 Edit-GbvRst                         VALUES "Y".
06180017092872750     05 lc_Edit_Stmdis               PIC X(01).
06190017092872750        88 Edit_Stmdis                         VALUES "Y".
06200017092872750        88 Edit_Stmdis_NO                      VALUES "N".
062100170928       01  lc-Scr-Edit-SqlLog             PIC X(01) VALUE "N".
062200170928       01  lc-Scr-Edit-Return             PIC X(02) VALUE "00".
062300170928       01  GbvRst_ScreenEditsAllowed.
062400170928           03  lc_StmtjsiScrnCode         PIC X(08) VALUE "STMTJSI".
062500170928           03  lc_GbvRstEditCode          PIC X(06) VALUE "GBVRST".
062600170928           03  lc_GbvRstLevelCode         PIC X(01) VALUE "C".
062700170928      * RFS 38639 - ends.
062800170928      * RFS 50492 - Begin.
062900170928       01 lc_DrfytdWorkFields.
063000170928          05 lc_FndFinActivity            PIC X(01).
063100170928             88 FndFinActivity                      VALUES "Y".
063200170928R61342    05 lc_AccFinActivity            PIC X(01).
063300170928R61342       88 AccFinActivity                      VALUES "Y".
063400170928          05 lc_Edit-Drfytd               PIC X(01).
063500170928             88 Edit-Drfytd                         VALUES "Y".
063600170928R62153    05 Ln_AccTotalBal               PICTURE S9(11)V9(3) COMP-3.
063700170928       01  ln_DorFndStrDte                PIC S9(8).
063800170928R90088 01  ln_DorFndEndDte                PIC S9(8).
063900170928R61342 01  ln_PrevAccountNo               PIC  9(9).
064000170928       01  Drfnd_ScreenEditsAllowed.
064100170928           03  lc_DrfytdEditCode    PIC X(06) VALUE "DRFYTD".
064200170928           03  lc_DrfytdLevelCode   PIC X(01) VALUE "A".
064300170928      * RFS 50492 - End.
064400170928      * RFS120931 - Start
064500170928       01  lc_GuaranBenifit         PIC X(01) VALUE " ".
064600170928       01  ln_MaximumWithAmt        PIC S9(11)V9(02).
064700170928      * RFS120931 - End
064800170928      * RFS132043 - Begin
064900170928128315*01  lc_ldaEnddateCCYY        PIC S9(04) VALUE ZEROES.
065000170928      * RFS132043 - End
065100170928R80605 01  pi_SegSAwdAccountNo   PIC S9(09) COMP-3.
065200170928  |    01  pi_SegSAwdContractNo  PIC S9(09) COMP-3.
065300170928  |    01  pc_SegSAwdResetType   PIC X(3).
065400170928  |    01  pc_SegSAwdDate        PIC S9(09) COMP-3.
065500170928  |    01  pn_SegSAwdAmount      PIC S9(11)V9(02) COMP-3.
065600170928  |    01  pc-IndependentGDV     PIC X(1).
065700170928  |
065800170928  |    01 Ln_GbvGdv_AwdSum.
065900170928  |       05 Ln_Gbv_AwdSum       PIC S9(11)V9(2) COMP-3.
066000170928  |       05 Ln_Gdv_AwdSum       PIC S9(11)V9(2) COMP-3.
066100170928  |       05 Lc_Gdv_Independ     PIC X(1).
066200170928  |    01 Lc_RESET_TYPE.
066300170928  |       05 Lc_GWB              PIC X(3) VALUE "GWB".
066400170928  |       05 Lc_GBB              PIC X(3) VALUE "GBB".
066500170928  V       05 Lc_GBV              PIC X(3) VALUE "GBV".
066600170928R80605    05 Lc_GDV              PIC X(3) VALUE "GDV".
066700170928120931    05 Lc_YTD              PIC X(3) VALUE "YTD".
066800170928130402    05 lc_STM              PIC X(3) VALUE "STM".
066900170928R17495 01 WORK-FIELDS-SQL.
067000170928          03 WS-CALLING-PROGRAM       PIC X(10)   VALUE "ANNSTMTJSI".
067100170928          03 WS-SQLERR-STATEMENT      PIC X(25)   VALUE " ".
067200170928          03 WS-SQLERR-DATA           PIC X(1780) VALUE " ".
067300170928          03 WS-SQL-STATS             PIC X(1966) VALUE " ".
067400170928          03 WS-SQLERR-REPLY          PIC X(1)    VALUE " ".
067500170928          03 WS-SQL-EOF               PIC X(1)    VALUE "N".
067600170928             88  SQL-EOF                          VALUE "Y".
067700170928R20561 77 IND1                            PIC S9(4)   BINARY.
067800170928R22370 77 IND2                            PIC S9(4)   BINARY.
067900170928R18924 77 IND3                            PIC S9(4)   BINARY.
068000170928R18924 77 IND4                            PIC S9(4)   BINARY.
068100170928R22856 77 IND5                            PIC S9(4)   BINARY.
068200170928R24058 77 IND6                            PIC S9(4)   BINARY.
068300170928      *** RFS43223 - Start
068400170928       77 IND7                            PIC S9(4)   BINARY.
068500170928      *** RFS43223 - Start
068600170928      * RFS69515 Begin
068700170928       77 IND8                        PIC S9(4)   BINARY.
068800170928151412 77 IND11                           PIC S9(4)   BINARY.
068900170928       01 ld_YtdStrDte                PIC S9(08)  VALUE 0.
069000170928      * RFS69515 End
069100170928R17527 01  WS-IPS-GROUP-ID            PIC X(20) VALUE " ".
069200170928  ¦    01  WS-IPS-GROUP-ID-FETCH      PIC X(20).
069300170928R17527 01  WS-EFFECTIVE-DATE-FETCH    PIC S9(8).
069400170928      **RFS46797 - Begin
069500170928       01  li-AccTypeRule             PIC 9(02).
069600170928       01  lc-AccTypeRule REDEFINES li-AccTypeRule.
069700170928           02 lc-AccTypeRule1         PIC X(01).
069800170928           02 lc-AccTypeRule2         PIC X(01).
069900170928      **RFS46797 - End
070000170928      **RFS92477 - Begin
070100170928       01  lt-SubTypeArea.
070200170928           05 li-PlacementDate        Pic S9(9).
070300170928           05 li-TransNo              Pic S9(9).
070400170928           05 lc-TransType            Pic X(3).
070500170928           05 lc-TransSubType         Pic X(5).
070600170928           05 lc-TransSubTypeDesc     Pic X(25).
07070017092893662      05 lc-TransOriginCode      Pic X(3).
07080017092893662      05 lc-ContribRedeemCode    Pic X(6).
070900170928      **RFS92477 - End
071000170928      *RFS93759 BEGIN
071100170928       01  li-Place-date              PIC S9(09).
071200170928       01  li-Place-date-2            PIC S9(09).
071300170928       01  li-Trans-No                PIC S9(09).
071400170928       01  li-Trans-No-2              PIC S9(09).
071500170928      *RFS93759 End
07160017092896613  01  Lc_DSR              PIC X(3) VALUE "DSR".
071700170928      *******
071800170928117038 01  lt_S22AcctVariables.
071900170928117038     02 lc_S22AccountInvestmentGrp      Pic X(5)        Value " ".
072000170928117038     02 lc_S22AccountInvestmentDesc     Pic X(25)       Value " ".
072100170928117038     02 ld_S22AccountMaturityDate       Pic S9(8)       Value 0.
072200170928117038     02 ld_S22AccountEffectiveDate      Pic S9(8)       Value 0.
072300170928117038     02 lc_S22AccountSpouseFirstName    Pic X(20)       Value " ".
072400170928117038     02 lc_S22AccountSpouseMiddleName   Pic X(20)       Value " ".
072500170928117038     02 lc_S22AccountSpouseLastName     Pic X(20)       Value " ".
072600201224124070     02 ld_S22FinalToupdate             Pic S9(8)       Value 0.
072700201224185455     02 lc_S22DBRST                     Pic X(5)        VALUE " ".
072800201224185455     02 ld_S22DBGNextResetDate          Pic S9(8)       VALUE 0.
072900201224185455     02 ld_S22DBGFinalResetDate         Pic S9(8)       VALUE 0.
073000201224185455     02 lc_S22MBRST                     Pic X(5)        VALUE " ".
073100201224185455     02 ld_S22MBGNextResetDate          Pic S9(8)       VALUE 0.
073200201224185455     02 ld_S22MBGFinalResetDate         Pic S9(8)       VALUE 0.
073300170928
073400170928117038 01  lt_S22LocalVariables.
073500170928117038     02 li_S22Idx                       Pic S9(4)       Value 0.
073600170928117038     02 ln_S22TotalAccrualInterest      Pic S9(13)V9(2) Value 0.
073700170928117038     02 ln_S22TotalOpeningMV            Pic S9(13)V9(2) Value 0.
073800170928117038     02 ln_S22TotalNetDeposit           Pic S9(13)V9(2) Value 0.
073900170928117038     02 ln_S22TotalGroussWithdrawal     Pic S9(13)V9(2) Value 0.
074000170928117038     02 ln_S22TotalClosingMV            Pic S9(13)V9(2) Value 0.
074100170928117038     02 ln_S22TotalIncrease             Pic S9(13)V9(2) Value 0.
074200170928117038     02 ln_S22RetrnInterest             Pic S9(13)V9(2) Value 0.
074300170928117038     02 lc_S22ContactMethod             Pic X(80)       Value " ".
074400170928117038     02 li_S22AcctNo                    Pic S9(9)       Value 0.
074500170928117038     02 li_ISR                          Pic s9(4)       Value 0.
074600170928117038     02 lc_ReturnFlag                   Pic  X(1)       Value " ".
074700170928117038     02 lc_Section80                    Pic  X(1)       Value "N".
074800170928117038
074900170928      * RFS152451 - Starts
075000170928       01 lc_S22YTDfields.
075100170928         02  ln_S22YTDAMSFee                PIC S9(11)V9(2) VALUE 0.
075200170928         02  ln_S22YTDAMSFedTax             PIC S9(11)V9(2) VALUE 0.
075300170928         02  ln_S22YTDAMSProvincialTax      PIC S9(11)V9(2) VALUE 0.
075400170928         02  ln_S22YTDManagFee              PIC S9(11)V9(2) VALUE 0.
075500170928         02  ln_S22YTDManagFeeFedTax        PIC S9(11)V9(2) VALUE 0.
075600170928         02  ln_S22YTDManagFeeProvTax       PIC S9(11)V9(2) VALUE 0.
075700170928         02  ln_S22YTDAccount               PIC S9(09)      VALUE 0.
075800170928         02  ln_S22YTDInvestCode            PIC  X(05)      VALUE " ".
075900170928         02  ld_S22YTDStartDate             PIC S9(08)      VALUE 0.
076000170928         02  ld_S22YTDEndDate               PIC S9(08)      VALUE 0.
076100170928         02  ln_S22REDFcharge               PIC S9(11)V9(2) VALUE 0.
076200170928         02  ln_S22GSTcharge                PIC S9(11)V9(2) VALUE 0.
076300170928         02  ln_S22PSTcharge                PIC S9(11)V9(2) VALUE 0.
076400170928      * RFS152451 - Ends
076500170928117038 01 lt_S22Constant.
076600170928117038     02 lncc_999999                     Pic S9(06) Value 999999.
076700170928117038     02 lnc_7                           Pic  X(01) Value "7".
076800170928117038     02 Lncc_TOTAL                      Pic  X(05) Value "TOTAL".
076900170928110904     02 lnc_Spaces                      PIC  X(1)  VALUE " ".
077000170928      * RFS132121 - Starts
077100170928       01 lc_StorageFields.
077200170928         03  ln_Gross-YTD-Total       PIC S9(11)V9(2)  COMP-3.
077300170928         03  ln_Gross-YTD-Minimum     PIC S9(11)V9(2)  COMP-3.
077400170928         03  ln_Min-Left-Paid         PIC S9(11)V9(2)  COMP-3.
077500170928         03  lc_GrossOrNet            PIC X(01) VALUE SPACES.
077600170928         03  lc_AccStatus             PIC X(01) VALUE SPACES.
077700170928       01  lc_16AAA-ModelType         PIC X(1).
077800170928       01  lc_16AAA-ModelCode         PIC X(5).
077900170928       01  ld_16AAA-StartDt           PIC S9(9).
078000170928       01  ld_16AAA-EndDt             PIC S9(9).
078100170928       01  lc_16AAA-InvestCd          PIC X(5).
078200170928       01  lc_16AAA-InvStruCd         PIC X(5).
078300170928       01  lc_16AAA-InvStrucDesc      PIC X(25).
078400170928       01  lc_InvStru                 PIC X(5).
078500170928       01  ln_Percent                 PIC S9(05)V9(2)  COMP-3.
078600170928       01  lc_FunctionCode            PIC X(10).
078700170928       01  lc_16AAA-Desc35            PIC X(35).
078800170928       01  ld_End-Date                PIC S9(8).
078900170928       01  lc_FInv_Code               PIC X(5).
079000170928       01  ln_FTarget_Perc            PIC S9(05)V9(2)  COMP-3.
079100170928       01  lc_FInv_Struc_Code         PIC X(5).
079200170928       01  ln_FVariance_Perc          PIC S9(05)V9(2)  COMP-3.
079300170928       01  lc_Sign                    PIC X(1).
079400170928       01  li_Inv_Mkt_Value           PIC 9(11)V9(2).
079500170928       01  li_Invstruc_Mkt_Value      PIC S9(11)V9(2).
079600170928       01  li_Invstruc_TMkt_Value     PIC S9(11)V9(2).
079700170928       01  LC_FINV_STRUC_DESC         PIC X(25).
079800170928       01  ln_FActual_Perc            PIC S9(05)V9(2)  COMP-3.
079900170928       01  li_AccountNum              PIC S9(9) VALUE ZEROS.
080000170928       01  lc_CurrMktRec.
080100170928         03  ln_CurrAccCode           PIC S9(9) VALUE ZEROS.
080200170928         03  lc_CurrInvCode           PIC X(05) VALUE SPACES.
080300170928       01  lc_PrevMktRec.
080400170928         03  ln_PrevAccCode           PIC S9(9) VALUE ZEROS.
080500170928         03  lc_PrevInvCode           PIC X(05) VALUE SPACES.
080600170928       01  lc_CurrInvestor            PIC X(09) VALUE SPACES.
080700170928       01  lc_PrevInvestor            PIC X(09) VALUE SPACES.
080800170928      * RFS132121 - Ends
080900170928      *******
081000170928      * RFS138310 - Starts
081100170928       01 ld_Prev-Start-Date          PIC S9(8)      VALUE ZEROS.
081200170928       01 ld_Prev-End-Date            PIC S9(8)      VALUE ZEROS.
081300170928       01 ln_AW-IncomePay             PIC S9(9)V9(2) VALUE ZEROS.
081400170928       01 ln_AW-WH-Tax                PIC S9(9)V9(2) VALUE ZEROS.
081500170928      * RFS138310 - Ends
081600170928      *******
081700170928109016 01  Lc_GurMatSchedCode         PIC X(5).
081800170928  |    01  lc_AccountTypeCode         PIC X(5).
081900170928  |    01  ld_ContractStartDate       PIC S9(08).
082000170928  |    01  ld_ContractMaturityDate    PIC S9(08).
082100170928  |    01  li_MatDateReduce           PIC S9(08).
082200170928  |    01  ld_NewDate                 PIC S9(08).
082300170928  |    01  li_FullYears               PIC S9(04).
082400170928  |    01  lnc_One                    PIC 9(1) VALUE 1.
082500170928  |    01  li_RemainingDays           PIC S9(04).
082600210624  |    01  li_DaysLeft                PIC 9(04).
082700210624      *RFS186199 - Begin
082800210624      * Commented below var as its not used anywhere and has
082900210624      * ambiguity with other copybook parm in CPFXSGMTVA
083000210624  |   *01  pi_GMPercent               PIC S9(03)V9(02).
083100170928      *RFS186199 - End
083200170928  |    01  ln_GuaranteePercent        PIC S9(05)V9(02).
083300170928  |    01  Li_ConAnnuitantAge         PIC S9(03).
083400170928  |    01  Li_COUNTGMP                PIC S9(5) VALUE ZEROS.
083500170928  |    01  VALDATEFMT_Parms.
083600170928  |        02  lc_TestDate               PIC X(8).
083700170928  |        02  li_TestDateNm REDEFINES lc_TestDate PIC S9(08).
083800170928  |        02  lc_TestDate_Flag          PIC X(1).
083900170928  V            88 lc_DatOK                        VALUE "Y".
084000170928109016         88 lc_DatNotOK                     VALUE "N".
084100170928      *******
084200170928       01  WS-REQUEST-DATE.
084300170928          03  WS-DI-REQUEST-CC         PIC 99.
084400170928          03  WS-REQUEST-DATE-1.
084500170928            05  WS-DI-REQUEST-YY       PIC 99.
084600170928            05  WS-DI-REQUEST-MM       PIC 99.
084700170928            05  WS-DI-REQUEST-DD       PIC 99.
084800170928R38037 01  lc_SystemDate REDEFINES WS-REQUEST-DATE PIC X(08).
084900170928R38037 01  ln_SystemDate REDEFINES lc_SystemDate PIC S9(08).
085000170928      /
085100170928       01  WS-REQUEST-TIME-1.
085200170928           03 WS-DI-REQUEST-H1       PIC 99.
085300170928           03 WS-DI-REQUEST-M1       PIC 99.
085400170928           03 WS-DI-REQUEST-S1       PIC 99.
085500170928           03 WS-DI-REQUEST-O1       PIC 99.
085600170928      /
085700170928       01  WS-REQUEST-TIME-2.
085800170928           03 WS-DI-REQUEST-H2       PIC 99.
085900170928           03 WS-DI-SIGN-1           PIC X          VALUE ":".
086000170928           03 WS-DI-REQUEST-M2       PIC 99.
086100170928           03 WS-DI-SIGN-2           PIC X          VALUE ":".
086200170928           03 WS-DI-REQUEST-S2       PIC 99.
086300170928      *******
086400170928147810 01 ln_S20RetrnInterest        Pic S9(13)V9(2) Value 0.
086500170928150035 01 ln_S20RetrnInterest1       Pic S9(13)V9(2) Value 0.
086600170928      ******************************************************************
086700170928      *    P R O G R A M   D E F I N E D   W O R K   I T E M S         *
086800170928      ******************************************************************
086900170928      *****
087000170928      *****    Transaction Contribution/Redemption Code Table.
087100170928      *****
087200170928R64527 01  WX-CR-CODE                PIC X(6).
087300170928R64527 01  WX-CR-LANG                PIC X(1).
087400170928R64527 01  WX-CR-DESC                PIC X(25).
087500170928R72304 01  ln_Array-size-CR          PIC S9(09).
087600170928R18485 01  WS-CTBRED-TBL.
087700170928R64527***  02  WS-CTBRED-ENT         OCCURS 500  TIMES
087800170928R64527***                            ASCENDING KEY IS
087900170928R64527***                            WS-CR-CODE
088000170928R64527***                            WS-CR-LANG
088100170928R64527***                            INDEXED BY  CR.
088200170928R64527***  02 ln_Array-size-CR     PIC S9(09).          ***R72304
088300170928R64527     02 WS-CTBRED-ENT          OCCURS 1 TO 30000
088400170928R64527                       DEPENDING ON ln_Array-Size-CR
088500170928R64527                       ASCENDING KEY IS
088600170928R64527                               WS-CR-CODE
088700170928R64527                               WS-CR-LANG
088800170928R64527                       INDEXED BY CR.
088900170928R72304       03 WS-CTBRED-ENT-ELEMENT.
089000170928   V           05  WS-CR-CODE          PIC X(6).
089100170928               05  WS-CR-LANG          PIC X(1).
089200170928               05  WS-CR-DESC          PIC X(25).
089300170928R64527*01  WS-CR-LST               PIC S9(3).
089400170928R64527 01  WS-CR-LST               PIC S9(5).
089500170928R18485*01  WS-CR-MAX               PIC S9(3) VALUE 500.
089600170928R64527 01  WS-CR-MAX               PIC S9(5) VALUE 30000.
089700170928R34848**RFS34848 - Start
089800170928      *****
089900170928      *****    Deduction Charges Description Table (English & French)
090000170928      *****
090100170928       01  ltb_TrnDepTbl.
090200170928           02  lc_TrnDepEnt          OCCURS 200  TIMES
090300170928                                     ASCENDING KEY IS
090400170928                                     lc_DedCode
090500170928                                     lc_LangCode
090600170928                                     INDEXED BY li_IxTrnDed.
090700170928               05  lc_DedCode          PIC X(4).
090800170928               05  lc_LangCode         PIC X(1).
090900170928               05  lc_DedShortDesc     PIC X(10).
091000170928               05  lc_DedLongDesc      PIC X(25).
091100170928       01  li_TdLst                PIC S9(3).
091200170928       01  li_TdMax                PIC S9(3) VALUE 200.
091300170928R34848**RFS34848 - End
091400170928       01  WS-PGM-DEFINED-WORK-ITEMS1.
091500170928      *****
091600170928      *****  MISCELLANEOUS NUMERIC ITEMS
091700170928      *****
091800170928           03 WS-CTLREP-W-FLAG            PICTURE X(1).
091900170928R17891     03 WS-ACCT-CHG                 PIC X(1).
092000170928           03 WS-SKIP-LN                  PICTURE S9(3)  COMP-3.
092100170928R50823     03 Ln-MGAClosingDate           PICTURE S9(8).
092200210105R50823     03 Ln-MGAUsingDate             PICTURE S9(8).
092300210105      *RFS186446 Starts *
092400210105           03 li-Purchase-Trans-Count     PICTURE S9(9).
092500170928      *RFS186446 Ends *
092501210913      *RFS186592 Starts*
092502210913           03 ln_DBRSTCount               PICTURE S9(9).
092503210913           03 ln_MBRSTCount               PICTURE S9(9).
092504210913      *RFS186592 Ends*
092600170928      *****
092700170928      *****    Control Report Counters
092800170928      *****
092900170928           03 WS-HOLDMAIL-CNT          PICTURE S9(9)  COMP-3.
093000170928           03 WS-LINE-CNT              PICTURE S9(3)  COMP-3.
093100170928           03 WS-PAGE-CNT              PICTURE S9(3)  COMP-3.
093200170928           03 WS-SUPPRESS-CNT          PICTURE S9(9)  COMP-3.
093300170928      *RFS138310 - Start *
093400170928           03 li-WH-TAX-TRNCHP-Cnt     PICTURE S9(9)  COMP-3.
093500170928      *RFS138310 - End   *
093600170928      *****
093700170928      *****    Control Report Literals
093800170928      *****
093900170928           03  WS-HOLDMAIL-LIT         PICTURE X(10) VALUE
094000170928               "HOLD MAIL ".
094100170928           03  WS-SUPPRESS-LIT         PICTURE X(10) VALUE
094200170928               "SUPPRESSED".
094300170928      *****    Date Items
094400170928      *****
094500170928           03  HEAD-DATE.
094600170928             05  YR                          PIC 99.
094700170928             05  MT                          PIC 99.
094800170928             05  DT                          PIC 99.
094900170928           03  HDG3-DATE.
095000170928             05  YY                          PIC 9999.
095100170928             05  MM                          PIC 99.
095200170928             05  DD                          PIC 99.
095300170928      *****    Account Type Table.
095400170928      *****    - This table will only support two languages, the first
095500170928      *****      entry is English and the second entry is French.
095600170928           03  WS-ACCTYP-TBL.
09570017092812090        04  WS-ACCTYP-ENT         OCCURS 250  TIMES
095800170928                                       INDEXED BY  AT1.
095900170928               05  WS-AT-CODE          PICTURE X(5).
096000170928               05  WS-AT-RULE          PICTURE X(1).
096100170928               05  WS-AT-DESC          OCCURS   2  TIMES
096200170928                                       INDEXED BY  ATL
096300170928                                       PICTURE X(35).
096400170928           03  WS-AT-LST               PICTURE S9(3)       COMP-3.
096500170928           03  WS-AT-MAX               PICTURE S9(3)       COMP-3
096600170928                                                           VALUE 50.
096700170928R17626*****
096800170928  ¦   *****    Quarter end date table.
096900170928  ¦   *****
097000170928  ¦        03  WS-QRTEND-TBL.
097100170928  ¦          04  WS-QRTEND-ENT         OCCURS 300  TIMES
097200170928  ¦                                    INDEXED BY  QRT.
097300170928  ¦            05  WS-QRT-ENDDATE      PICTURE S9(8).
097400170928  ¦            05  WS-QRT-FREQ         PICTURE X(2).
097500170928  ¦
097600170928  ¦        03  WS-QRT-LST              PICTURE S9(3)       COMP-3
097700170928R20319                                                     VALUE 0.
097800170928  ¦        03  WS-QRT-MAX              PICTURE S9(3)       COMP-3
097900170928  ¦                                                        VALUE 300.
098000170928  ¦        03  WS-QRT-STR-FRQ          PICTURE X(2).
098100170928  ¦        03  WS-MON-STR-FRQ          PICTURE X(2).
098200170928  ¦        03  WS-QRT-END-FRQ          PICTURE X(2).
098300170928R17626
098400170928R17626*****
098500170928  ¦   *****    Quarter end date table to load ten records at a time
098600170928  ¦   *****
098700170928  ¦        03  WS-QRTEND-TBL-TEN.
098800170928  ¦          04  WS-QRTEND-ENT-TEN     OCCURS 10 TIMES
098900170928  ¦                                    INDEXED BY  QRTT.
099000170928  ¦            05  WS-QRT-ENDDATE-TEN  PICTURE S9(8).
099100170928  ¦            05  WS-QRT-FREQ-TEN     PICTURE X(2).
099200170928  ¦
099300170928  ¦        03  ROR33                   PICTURE 99.
099400170928  ¦        03  ROR38                   PICTURE 99.
099500170928  ¦        03  WS-QRT-TEN              PICTURE S9(3)       COMP-3
099600170928R17626                                                     VALUE 10.
099700170928      *****
099800170928      *****    Asset Class Table.
099900170928      *****    - This table will only support two languages, the first
100000170928      *****      entry is English and the second entry is French.
100100170928      *****
100200170928           03  WS-ASTCLS-TBL.
100300170928R20205       04  WS-ASTCLS-ENT         OCCURS  70  TIMES
100400170928                                       INDEXED BY  AC
100500170928                                                   ACR.
100600170928               05  WS-AC-CODE          PICTURE X(6).
100700170928               05  WS-AC-PCT           PICTURE S9(3)V9(4)  COMP-3.
100800170928               05  WS-AC-VAL           PICTURE S9(11)V9(2)  COMP-3.
100900170928156335         05  WS-AC-BOK-VAL       PICTURE S9(11)V9(2)  COMP-3.
101000170928               05  WS-AC-DESC          OCCURS   2  TIMES
101100170928                                       INDEXED BY  ACL
101200170928                                       PICTURE X(25).
101300170928               05  WS-AC-ACSR          PICTURE S9(3)       COMP-3.
101400170928               05  WS-AC-SLST          PICTURE S9(3)       COMP-3.
101500170928R20205         05  WS-AC-SUBCLS-ENT    OCCURS  50  TIMES
101600170928                                       INDEXED BY  ACS
101700170928                                                   ACSR.
101800170928                 06  WS-ACS-CODE       PICTURE X(6).
101900170928                 06  WS-ACS-PCT        PICTURE S9(3)V9(4)  COMP-3.
102000170928                 06  WS-ACS-VAL        PICTURE S9(11)V9(2)  COMP-3.
102100170928156335           06  WS-ACS-BOK-VAL    PICTURE S9(11)V9(2)  COMP-3.
102200170928                 06  WS-ACS-DESC       OCCURS   2  TIMES
102300170928                                       INDEXED BY  ACSL
102400170928                                       PICTURE X(25).
102500170928           03  WS-AC-LST               PICTURE S9(3)       COMP-3.
102600170928           03  WS-AC-MAX               PICTURE S9(3)       COMP-3
102700170928R20205                                                   VALUE 70.
102800170928           03  WS-AC-PCTTOT            PICTURE S9(3)V9(4)  COMP-3.
102900170928           03  WS-AC-VALTOT            PICTURE S9(11)V9(2) COMP-3.
103000170928156335     03  WS-AC-BOK-VALTOT        PICTURE S9(11)V9(2) COMP-3.
103100170928           03  WS-AC-SMAX              PICTURE S9(3)       COMP-3
103200170928R20205                                                   VALUE 50.
103300170928           03  WS-ACS-PCTTOT           PICTURE S9(3)V9(4)  COMP-3.
103400170928           03  WS-ACS-VALTOT           PICTURE S9(11)V9(2) COMP-3.
103500170928156335     03  WS-ACS-BOK-VALTOT       PICTURE S9(11)V9(2) COMP-3.
103600170928      *****
103700170928      *****    RESP LTD/YTD Beneficiaries Amount table.
103800170928      *****
103900170928R12784     03  WS-BENEF-TBL.
104000170928  ¦         04  WS-BENEF-ENT                OCCURS 50   TIMES
104100170928  ¦                                             INDEXED BY  BEN.
104200170928  ¦          05  WS-BEN-SEQ-NO              PICTURE 9(3).
104300170928  ¦          05  WS-BEN-AMT-TOT-LTD-CONTR   PICTURE S9(9)V9(2) COMP-3.
104400170928  ¦          05  WS-BEN-AMT-TOT-YTD-CONTR   PICTURE S9(9)V9(2) COMP-3.
104500170928  ¦          05  WS-BEN-AMT-TOT-LTD-CESG    PICTURE S9(9)V9(2) COMP-3.
104600170928  ¦          05  WS-BEN-AMT-TOT-YTD-CESG    PICTURE S9(9)V9(2) COMP-3.
104700170928  ¦          05  WS-BEN-AMT-TOT-LTD-WITHD   PICTURE S9(9)V9(2) COMP-3.
104800170928R12784       05  WS-BEN-AMT-TOT-YTD-WITHD   PICTURE S9(9)V9(2) COMP-3.
104900170928R83788       05  WS-BEN-AMT-TOT-LTD-CLB     PICTURE S9(9)V9(2) COMP-3.
105000170928  |          05  WS-BEN-AMT-TOT-YTD-CLB     PICTURE S9(9)V9(2) COMP-3.
105100170928  |          05  WS-BEN-AMT-TOT-LTD-PGRANT  PICTURE S9(9)V9(2) COMP-3.
105200170928  |          05  WS-BEN-AMT-TOT-YTD-PGRANT  PICTURE S9(9)V9(2) COMP-3.
105300170928  V          05  WS-BEN-AMT-TOT-LTD-IQEE    PICTURE S9(9)V9(2) COMP-3.
105400170928R83788       05  WS-BEN-AMT-TOT-YTD-IQEE    PICTURE S9(9)V9(2) COMP-3.
105500170928133489       05  WS-BEN-AMT-TOT-LTD-EAP     PICTURE S9(9)V9(2) COMP-3.
105600170928  |          05  WS-BEN-AMT-TOT-YTD-EAP     PICTURE S9(9)V9(2) COMP-3.
105700170928  V          05  WS-BEN-AMT-TOT-LTD-PSE     PICTURE S9(9)V9(2) COMP-3.
105800170928133489       05  WS-BEN-AMT-TOT-YTD-PSE     PICTURE S9(9)V9(2) COMP-3.
105900170928148326       05  WS-BEN-AMT-TOT-LTD-CEAP    PICTURE S9(9)V9(2) COMP-3.
106000170928      *****
106100170928      *****    Currency Code Table.
106200170928      *****
106300170928           03  WS-CURCDE-TBL.
106400170928             04  WS-CURCDE-ENT         OCCURS  50  TIMES
106500170928R18194                                 ASCENDING KEY IS  WS-CC-CODE
106600170928                                       INDEXED BY  CC
106700170928R18194                                             CCS
106800170928                                                   CCT.
106900170928               05  WS-CC-CODE          PICTURE X(3).
107000170928R18194         05  WS-CC-DESCR         PICTURE X(25).
107100170928               05  WS-CC-BASE          PICTURE X(1).
107200170928               05  WS-CC-CUR           PICTURE S9(3)       COMP-3.
107300170928               05  WS-CC-RTECLS        PICTURE S9(2)V9(7)  COMP-3.
107400170928               05  WS-CC-RTEOPN        PICTURE S9(2)V9(7)  COMP-3.
107500170928               05  WS-CC-RTELYE        PICTURE S9(2)V9(7)  COMP-3.
107600170928               05  WS-CC-RTETYP        PICTURE X(1).
107700170928           03  WS-CC-BSE               PICTURE S9(3)       COMP-3.
107800170928           03  WS-CC-LST               PICTURE S9(3)       COMP-3.
107900170928           03  WS-CC-MAX               PICTURE S9(3)       COMP-3
108000170928                                                           VALUE 50.
108100170928R18194*****
108200170928   ¦  *****    Currency Section 20 Permanent Table.
108300170928   ¦  *****
108400170928   ¦       03  WS-CURS20-TBL.
108500170928   ¦         04  WS-CURS20-ENT         OCCURS  50  TIMES
108600170928   ¦                                   ASCENDING KEY IS  WS-CS20-CODE
108700170928   ¦                                   INDEXED BY  CS20
108800170928   ¦                                               CS20S.
108900170928   ¦           05  WS-CS20-CODE        PICTURE X(3).
109000170928   ¦           05  WS-CS20-DTL         PICTURE 9(6) VALUE 0.
109100170928   ¦           05  WS-CS20-SEQ         PICTURE 9(6) VALUE 0.
109200170928   ¦           05  WS-CS20-TOT-TOT     PICTURE 9(6) VALUE 0.
109300170928   ¦
109400170928   ¦       03  WS-CS20-LST             PICTURE S9(3)       COMP-3.
109500170928   ¦       03  WS-CS20-MAX             PICTURE S9(3)       COMP-3
109600170928   ¦                                                       VALUE 50.
109700170928   ¦  *****
109800170928   ¦  *****    Currency Section 20 Temp Table. This table will be
109900170928   ¦  *****    initialized and repopulated for each Investor at LR3.
110000170928   ¦  *****
110100170928   ¦       03  WS-CURS20T-TBL.
110200170928   ¦         04  WS-CURS20T-ENT       OCCURS  50  TIMES
110300170928   ¦                                  ASCENDING KEY IS  WS-CS20T-CODE
110400170928   ¦                                  INDEXED BY  CS20T
110500170928   ¦                                              CS20ST.
110600170928   ¦           05  WS-CS20T-CODE        PICTURE X(3).
110700170928   ¦           05  WS-CS20T-DTL         PICTURE 9(6) VALUE 0.
110800170928   ¦           05  WS-CS20T-SEQ         PICTURE 9(6) VALUE 0.
110900170928   ¦           05  WS-CS20T-TOT-TOT     PICTURE 9(6) VALUE 0.
111000170928   ¦
111100170928   ¦       03  WS-CS20T-LST             PICTURE S9(3)      COMP-3.
111200170928   v       03  WS-CS20T-MAX             PICTURE S9(3)      COMP-3
111300170928R18194                                                     VALUE 50.
111400170928R21815     03  WS-PRV-USD-RTECLS       PICTURE S9(2)V9(7)  COMP-3.
111500170928  ¦        03  WS-AIB-FIRST-USD        PICTURE X  VALUE "Y".
111600170928  V            88  AIB-FIRST-USD                  VALUE "Y".
111700170928R21815         88  AIB-NOT-FIRST-USD              VALUE "N".
111800170928      *****
111900170928      *****    Date Items.
112000170928      *****
112100170928           03  WS-PTRANS-PROCESS-DATE  PICTURE 9(8).
112200170928R10720     03  WS-GIC-END-DATE         PICTURE 9(8).
112300170928           03  WS-GIC-END-DATE-R       REDEFINES WS-GIC-END-DATE.
112400170928               05  WS-GIC-END-DATE-CCYY   PICTURE 9(4).
112500170928               05  WS-GIC-END-DATE-MM  PICTURE 9(2).
112600170928               05  WS-GIC-END-DATE-DD  PICTURE 9(2).
112700170928R10720     03  WS-GIC-BUSINESS-DAY     PICTURE 9(8).
112800170928           03  WS-GIC-BUSINESS-DAY-R   REDEFINES WS-GIC-BUSINESS-DAY.
112900170928               05  WS-GIC-BUSINESS-DAY-CCYY   PICTURE 9(4).
113000170928               05  WS-GIC-BUSINESS-DAY-MM     PICTURE 9(2).
113100170928               05  WS-GIC-BUSINESS-DAY-DD     PICTURE 9(2).
113200170928           03  WS-ACCINTDTE            PICTURE 9(8).
113300170928           03  WS-ACCINTDTE-R          REDEFINES WS-ACCINTDTE.
113400170928               05  WS-ACCINTDTE-CCYY   PICTURE 9(4).
113500170928               05  WS-ACCINTDTE-MM     PICTURE 9(2).
113600170928               05  WS-ACCINTDTE-DD     PICTURE 9(2).
113700170928           03  WS-CALC-DOB             PICTURE 9(8).
113800170928           03  WS-CALC-DOB-R           REDEFINES WS-CALC-DOB.
113900170928               05  WS-CALC-DOB-CCYY    PICTURE 9(4).
114000170928               05  WS-CALC-DOB-MMDD    PICTURE 9(4).
114100170928RF5962     03  WS-INVESTOR-DOB             PICTURE 9(8).
114200170928           03  WS-DATE                 PICTURE 9(8).
114300170928           03  WS-DATE-R               REDEFINES WS-DATE.
114400170928               05  WS-DATE-CC          PICTURE 9(2).
114500170928               05  WS-DATE-YYMMDD      PICTURE 9(6).
114600170928           03  WS-OPENING-DATE         PICTURE 9(9)        COMP-3.
114700170928           03  WS-PRV-Y-END-DATE       PICTURE 9(8).
114800170928           03  WS-PRV-Y-END-DATE-R     REDEFINES WS-PRV-Y-END-DATE.
114900170928               05  WS-PYED-CCYY        PICTURE 9(4).
115000170928               05  WS-PYED-MM          PICTURE 9(2).
115100170928               05  WS-PYED-DD          PICTURE 9(2).
115200170928           03  WS-PTDSTRDTE            PICTURE 9(8).
115300170928           03  WS-PTDSTRDTE-R          REDEFINES WS-PTDSTRDTE.
115400170928               05  WS-PTDSTRDTE-CCYY   PICTURE 9(4).
115500170928               05  FILLER              PICTURE X(4).
115600170928           03  WS-TAX-S-DATE           PICTURE 9(8).
115700170928           03  WS-TAX-S-DATE-R         REDEFINES WS-TAX-S-DATE.
115800170928               05  WS-TAX-S-CCYY       PICTURE 9(4).
115900170928               05  WS-TAX-S-MM         PICTURE 9(2).
116000170928               05  WS-TAX-S-DD         PICTURE 9(2).
116100170928           03  WS-TAX-S-DATE-P         PICTURE 9(8).
116200170928           03  WS-TAX-S-DATE-P-R       REDEFINES WS-TAX-S-DATE-P.
116300170928               05  WS-TAX-S-CCYY-P     PICTURE 9(4).
116400170928               05  WS-TAX-S-MM-P       PICTURE 9(2).
116500170928               05  WS-TAX-S-DD-P       PICTURE 9(2).
116600170928           03  WS-YTDSTRDTE            PICTURE 9(8).
116700170928           03  WS-YTDSTRDTE-R          REDEFINES WS-YTDSTRDTE.
116800170928               05  FILLER              PICTURE X(4).
116900170928               05  WS-YTDSTRDTE-MMDD   PICTURE 9(4).
117000170928RF8633     03  WS-CURYTDSTRDTE          PICTURE 9(8).
117100170928           03  WS-CURYTDSTRDTE-R        REDEFINES WS-CURYTDSTRDTE.
117200170928               05  WS-CURYTDSTRDTE-YYYY PICTURE 9(4).
117300170928RF8633         05  WS-CURYTDSTRDTE-MMDD PICTURE 9(4).
117400170928RF7503     03  WS-MKTVALUE-Q-DATE      PICTURE 9(8).
117500170928           03  WS-MKTVALUE-Q-DATE-R    REDEFINES WS-MKTVALUE-Q-DATE.
117600170928               05  WS-MKTVALUE-Q-CCYY  PICTURE 9(4).
117700170928               05  WS-MKTVALUE-Q-MM    PICTURE 9(2).
117800170928               05  WS-MKTVALUE-Q-DD    PICTURE 9(2).
117900170928           03  WS-MKT-Q-DATE           PICTURE 9(8).
118000170928           03  WS-MKTV-Q-DATE-R        REDEFINES WS-MKT-Q-DATE.
118100170928               05  WS-MKT-Q-CCYY       PICTURE 9(4).
118200170928               05  WS-MKT-Q-MM         PICTURE 9(2).
118300170928               05  WS-MKT-Q-DD         PICTURE 9(2).
118400170928           03  WS-MKT-Q1-DATE           PICTURE 9(8).
118500170928           03  WS-MKT-Q2-DATE           PICTURE 9(8).
118600170928           03  WS-MKT-Q3-DATE           PICTURE 9(8).
118700170928           03  WS-MKT-Q4-DATE           PICTURE 9(8).
118800170928      /
118900170928      ******************************************************************
119000170928      *    P R O G R A M   D E F I N E D   W O R K   I T E M S         *
119100170928      ******************************************************************
119200170928R50823*****
119300170928  |   *****    Investment Misc Details Table
119400170928  |   *****    - This table will only support two languages, the first
119500170928  |   *****      entry is English and the second entry is French.
119600170928  |   *****
119700170928R64527 01  WX-ICM-CODE             PIC X(5).
119800170928R64527 01  WX-ICM-DATE             PIC S9(8).
119900170928R72304 01  ln_Array-size-ICM       PIC S9(09).
120000170928  |    01  WS-INVCDE-MISC-TBL.
120100170928R64527*    02  WS-INVCDE-MISC-ENT      OCCURS 1000 TIMES
120200170928R64527*                                INDEXED BY  ICM.
120300170928R64527***  02 ln_Array-size-ICM    PIC S9(09).  R72304
120400170928R64527     02 WS-INVCDE-MISC-ENT     OCCURS 1 TO 30000
120500170928R64527                       DEPENDING ON ln_Array-Size-ICM
120600170928R64527                       INDEXED BY ICM.
120700170928R72304       03 WS-INVCDE-MISC-ENT-ELEMENT.
120800170928  |            05  WS-ICM-CODE         PIC X(5).
120900170928  |            05  WS-ICM-DATE         PIC S9(8).
121000170928R64527*01  WS-ICM-LST              PICTURE S9(4).
121100170928R64527 01  WS-ICM-LST              PICTURE S9(5).
121200170928R50823*01  WS-ICM-MAX              PICTURE S9(4) VALUE 1000.
121300170928R64527 01  WS-ICM-MAX              PICTURE S9(5) VALUE 30000.
121400170928      *****    Investment Code Table.
121500170928      *****    - This table will only support two languages, the first
121600170928      *****      entry is English and the second entry is French.
121700170928R64527 01  WX-IC-CODE              PIC X(5).
121800170928R64527 01  WX-IC-CURR              PIC X(3).
121900170928R64527 01  WX-IC-FRGN              PIC X(1).
122000170928R64527 01  WX-IC-FUND              PIC X(5).
122100170928R64527 01  WX-IC-GRP               PIC X(5).
122200170928R64527 01  WX-IC-LOAD              PIC X(1).
122300170928R64527 01  WX-IC-LSTPRC            PIC S9(5)V9(4)  COMP-3.
122400170928R64527 01  WX-IC-PROD              PIC X(3).
122500170928R64527 01  WX-IC-NAME-E            PIC X(35).
122600190206R64527 01  WX-IC-NAME-F            PIC X(35).
122700190425      *RFS181062 STARTS
122800190425156335 01  WX-IC-EXT-LOAD-TYP      PIC X(03).
122900190206      *01  WX-IC-EXT-LOAD-TYP      PIC X(10).
123000170928      *RFS181062 STARTS
123100170928156335 01  WX-IC-EXT-LOAD-DESC     PIC X(25).
123200170928156335 01  WX-IC-INV-GRP-CAT       PIC X(05).
123300170928R72304 01  ln_Array-size-XX        PIC S9(09).
123400170928R18485 01  WS-INVCDE-TBL.
123500170928R64527***  02  WS-INVCDE-ENT         OCCURS 1000 TIMES
123600170928R64527***                              INDEXED BY  IC
123700170928R64527***                                          ICG
123800170928R64527***                                          ICT
123900170928R64527***                                          ICS.
124000170928R64527***  02 ln_Array-size-XX     PIC S9(09).    R72304
124100170928R64527     02 WS-INVCDE-ENT          OCCURS 1 TO 30000
124200170928R64527                       DEPENDING ON ln_Array-Size-XX
124300170928R64527                       INDEXED BY IC
124400170928R64527                                  ICG
124500170928R64527                                  ICT
124600170928R64527                                  ICS.
124700170928R72304       03 WS-INVCDE-ENT-ELEMENT.
124800170928               05  WS-IC-CODE          PIC X(5).
124900170928               05  WS-IC-CURR          PIC X(3).
125000170928               05  WS-IC-FRGN          PIC X(1).
125100170928               05  WS-IC-FUND          PIC X(5).
125200170928               05  WS-IC-GRP           PIC X(5).
125300170928               05  WS-IC-LOAD          PIC X(1).
125400170928               05  WS-IC-LSTPRC        PIC S9(5)V9(4)  COMP-3.
125500170928               05  WS-IC-PROD          PIC X(3).
125600170928               05  WS-IC-NAME-E        PIC X(35).
125700190221               05  WS-IC-NAME-F        PIC X(35).
125800190425      *RFS181062 STARTS
125900190425156335         05  WS-IC-EXT-LOAD-TYP  PIC X(03).
126000190221156335*        05  WS-IC-EXT-LOAD-TYP  PIC X(10).
126100170928      *RFS181062 ENDS
126200170928156335         05  WS-IC-EXT-LOAD-DESC PIC X(25).
126300170928156335         05  WS-IC-INV-GRP-CAT   PIC X(05).
126400170928R64527*01  WS-IC-LST               PICTURE S9(4).
126500170928R64527 01  WS-IC-LST               PICTURE S9(5).
126600170928R64527*01  WS-IC-MAX               PICTURE S9(4) VALUE 1000.
126700170928R64527 01  WS-IC-MAX               PIC S9(5) VALUE 30000.
126800170928R18485 01  WS-IC-NAME-FLAG         PIC X.
126900170928RF6234*****
127000170928      *****    Investment Unit Price Table.
127100170928      *****    - This table will contain the opening, closing, and
127200170928      *****      last year end date unit prices for all investments.
127300170928      *****
127400170928R18485 01  WS-INVUPE-TBL.
127500170928      * R64057 - begin
127600170928   |  *    02  WS-INVUPE-ENT         OCCURS 1000 TIMES
127700170928152637*    02  WS-INVUPE-ENT         OCCURS 3000 TIMES
127800170928152637     02  WS-INVUPE-ENT         OCCURS 1 TO 30000 TIMES
127900170928152637                               DEPENDING ON ln_Array-Size-iup
128000170928      * R64057 - end
128100170928   |                                   ASCENDING KEY IS WS-IUP-CODE
128200170928   V                                   INDEXED BY  IUP.
128300170928152637        03 WS-INVUPE-ENT-ELE.
128400170928               05  WS-IUP-CODE         PIC X(5).
128500170928               05  WS-IUP-OPENING-DATE PIC S9(8).
128600170928               05  WS-IUP-OPENING      PIC S9(5)V9(4)  COMP-3.
128700170928               05  WS-IUP-CLOSING      PIC S9(5)V9(4)  COMP-3.
128800170928               05  WS-IUP-LASTYEND     PIC S9(5)V9(4)  COMP-3.
128900170928       01  WS-IUP-LST              PIC S9(4).
129000170928152637 01  ln_Array-Size-iup       PIC S9(9) VALUE 0.
129100170928      * R64057 - begin
129200170928      *01  WS-IUP-MAX              PIC S9(4) VALUE 1000.
129300170928144286*01  WS-IUP-MAX              PIC S9(4) VALUE 3000.
129400170928144286 01  WS-IUP-MAX              PIC S9(4) VALUE 5000.
129500170928      * R64057 - endin
129600170928R18485 01  WS-SQLSTR               PIC X(2000).
129700170928       01  WS-PGM-DEFINED-WORK-ITEMS2.
129800170928      *****
129900170928      *****    Investment Group Table.
130000170928      *****
130100170928           03  WS-INVGRP-TBL.
130200170928RF9458*      04  WS-INVGRP-ENT         OCCURS  350 TIMES
130300170928      *R64057 - begin
130400170928R51249*      04  WS-INVGRP-ENT         OCCURS  550 TIMES
130500170928      *R89518 - begin
130600170928      *      04  WS-INVGRP-ENT         OCCURS  700 TIMES
130700170928      * RFS 90579 - Begin
130800170928      *      04  WS-INVGRP-ENT         OCCURS  800 TIMES
130900200319139824*      04  WS-INVGRP-ENT         OCCURS 1450 TIMES
131000200319139824*      04  WS-INVGRP-ENT         OCCURS 5200 TIMES
131100200327      * RFS 1027733 - Start: increased array size
131200200319139824       04  WS-INVGRP-ENT         OCCURS 30000 TIMES
131300170928      * RFS 1027733 - End
131400170928      * RFS 90579 - End
131500170928      *R89518 - end
131600170928      *R64057 - begin
131700170928                                       INDEXED BY  IG
131800170928                                                   IGG.
131900170928      * RFS 90579 - Change all COMP-3 numerics to Binary in this array - Begin
132000170928               05  WS-IG-CODE          PICTURE X(5).
132100170928               05  WS-IG-CAT           PICTURE X(5).
132200170928               05  WS-IG-DESC          PICTURE X(25).
132300170928               05  WS-IG-FIXVAR        PICTURE X(1).
132400170928               05  WS-IG-PRC           PICTURE S9(5)V9(4)  Binary.
132500170928               05  WS-IG-CLST          PICTURE S9(3)       Binary.
132600170928      * RFS 90579 - Begin
132700170928      ***      05  WS-IG-ASTCLS-ENT    OCCURS  50 TIMES
132800170928               05  WS-IG-ASTCLS-ENT    OCCURS  40 TIMES
132900170928      * RFS 90579 - End
133000170928                                       INDEXED BY  IGC.
133100170928                 06  WS-IGC-AC         PICTURE S9(3)       Binary.
133200170928                 06  WS-IGC-PCT        PICTURE S9(5)V9(4)  Binary.
133300170928                 06  WS-IGC-SLST       PICTURE S9(3)       Binary.
133400170928      * RFS 90579 - Begin
133500170928      ***        06  WS-IGC-SUBCLS-ENT OCCURS  50 TIMES
133600200319139824*          06  WS-IGC-SUBCLS-ENT OCCURS  40 TIMES
133700200319      * RFS1027733 - Start: use array elements for file I/O
133800170928139824*          06  WS-IGC-SUBCLS-ENT OCCURS  10 TIMES
133900200319      * RFS 90579 - End
134000200319      *                                INDEXED BY  IGCS.
134100200319      *             07  WS-IGCS-ACS     PICTURE S9(3)       Binary.
134200200319      *             07  WS-IGCS-PCT     PICTURE S9(5)V9(4)  Binary.
134300200319           03  IGCS            PICTURE S9(3)       Binary.
134400200319           03  WS-IGCS-ACS     PICTURE S9(3)       Binary.
134500200319           03  WS-IGCS-PCT     PICTURE S9(5)V9(4)  Binary.
134600170928      * RFS1027733 - End
134700170928      * RFS 90579 - Change all COMP-3 numerics to Binary in this array - End
134800170928      * RFS 90579 - Begin
134900170928      *    03  WS-IG-LST               PICTURE S9(3)       COMP-3.
135000200320      *    03  WS-IG-MAX               PICTURE S9(3)       COMP-3
135100200320      * RFS1027733 - Start: increased array size
135200200320      *    03  WS-IG-LST               PICTURE S9(4)       COMP-3.
135300200320           03  WS-IG-LST               PICTURE S9(5)       COMP-3.
135400200320      *    03  WS-IG-MAX               PICTURE S9(4)       COMP-3
135500200320           03  WS-IG-MAX               PICTURE S9(5)       COMP-3
135600170928      * RFS1027733 - Start: increased array size
135700170928      * RFS 90579 - End
135800170928RF9458*                                                    VALUE 350.
135900170928      *R64057 - begin
136000170928R51249*                                                    VALUE 550.
136100170928      *R89518 - begin
136200170928      *                                                    VALUE 700.
136300170928      * RFS 90579 - Begin
136400170928      *                                                    VALUE 800.
136500200319139824*                                                    VALUE 1450.
136600200319      * RFS1027733 - Start: increased array size
136700200327139824*                                                    VALUE 5200.
136800200319                                                         VALUE 30000.
136900170928      * RFS1027733 - Start: increased array size
137000170928      * RFS 90579 - End
137100170928      *R89518 - end
137200170928      *R64057 - end
137300170928           03  WS-IGC-VAL              PICTURE S9(11)V9(2)  COMP-3.
137400170928           03  WS-IGC-VALHGH           PICTURE S9(11)V9(2)  COMP-3.
137500170928           03  WS-IGCS-VAL             PICTURE S9(11)V9(2)  COMP-3.
137600170928           03  WS-IGCS-VALHGH          PICTURE S9(11)V9(2)  COMP-3.
137700170928156335     03  WS-IGC-BOK-VAL          PICTURE S9(11)V9(2)  COMP-3.
137800170928156335     03  WS-IGCS-BOK-VAL         PICTURE S9(11)V9(2)  COMP-3.
137900170928      *****
138000170928      *****    Investor Type Table.
138100170928      *****
138200170928           03  WS-INVTYP-TBL.
138300170928             04  WS-INVTYP-ENT         OCCURS  50  TIMES
138400170928                                       INDEXED BY  IT.
138500170928               05  WS-IT-CODE          PICTURE X(3).
138600170928               05  WS-IT-CAT           PICTURE X(1).
138700170928               05  WS-IT-DESC          PICTURE X(25).
138800170928           03  WS-IT-LST               PICTURE S9(3)       COMP-3.
138900170928           03  WS-IT-MAX               PICTURE S9(3)       COMP-3
139000170928                                                           VALUE 50.
139100170928RF6697*****
139200170928      *****    DII rate group/account type table. At this time. no DII
139300170928      *****    -RATE-SET logical file existed in the system.
139400170928           03  WS-DIITYP-TBL.
139500170928             04  WS-DIITYP-ENT           OCCURS  50  TIMES
139600170928                                         INDEXED BY  DIT.
139700170928               05  WS-DIST-CODE          PICTURE X(6).
139800170928               05  WS-DIAT-CODE          PICTURE X(5).
139900170928               05  WS-DINT-CODE          PICTURE X(5).
140000170928
140100170928           03  WS-DIT-LST                PICTURE S9(3)   COMP-3.
140200170928           03  WS-DIT-MAX                PICTURE S9(3)   COMP-3
140300170928                                                         VALUE 50.
140400170928R11036*****
140500170928      *****    Investment Structure Table.
140600170928      *****
140700170928R64527 01  WX-ISC-STRCODE            PICTURE X(5).
140800170928R64527 01  WX-ISC-INVCODE            PICTURE X(5).
140900170928R72304 01  ln_Array-size-ISC         PIC S9(09).
141000170928R18485 01  WS-INVSTR-TBL.
141100170928R64527***  02  WS-INVSTR-ENT         OCCURS  1000 TIMES
141200170928R64527***                            INDEXED BY  ISC.
141300170928R64527***  02 ln_Array-size-ISC    PIC S9(09).     R72304
141400170928R64527     02 WS-INVSTR-ENT          OCCURS 1 TO 30000
141500170928R64527                       DEPENDING ON ln_Array-Size-ISC
141600170928R64527                       INDEXED BY ISC.
141700170928R72304       03 WS-INVSTR-ENT-ELEMENT.
141800170928               05  WS-ISC-STRCODE      PICTURE X(5).
141900170928               05  WS-ISC-INVCODE      PICTURE X(5).
142000170928       01  WS-INV-STRCODE          PIC X(5).
142100170928R64527*01  WS-ISC-LST              PIC S9(4).
142200170928R64527 01  WS-ISC-LST              PIC S9(5).
142300170928R18485*01  WS-ISC-MAX              PIC S9(4) VALUE 1000.
142400170928R64527 01  WS-ISC-MAX              PIC S9(5) VALUE 30000.
142500170928R14153*****
142600170928  ¦   *****    CONTR-REDEM-CODE-RULES Table
142700170928  ¦   *****
142800170928R64527 01  WX-CRC-ACCTYPCODE         PICTURE X(5).
142900170928R64527 01  WX-CRC-REDEMCODE          PICTURE X(6).
143000170928R64527 01  WX-CRC-REDEMRULE          PICTURE X(2).
143100170928R72304 01  ln_Array-size-CRC         PIC S9(09).
143200170928  ¦    01  WS-CONTR-REDEM-TBL.
143300170928R64527***  02  WS-CONTR-REDEM-ENT    OCCURS  1000 TIMES
143400170928R64527***                            INDEXED BY  CRC.
143500170928R64527***  02 ln_Array-size-CRC    PIC S9(09).  R72304
143600170928R64527     02 WS-CONTR-REDEM-ENT     OCCURS 1 TO 30000
143700170928R64527                       DEPENDING ON ln_Array-Size-CRC
143800170928R64527                       INDEXED BY CRC.
143900170928R72304       03 WS-CONTR-REDEM-ENT-ELEMENT.
144000170928  ¦            05  WS-CRC-ACCTYPCODE   PICTURE X(5).
144100170928  ¦            05  WS-CRC-REDEMCODE    PICTURE X(6).
144200170928  ¦            05  WS-CRC-REDEMRULE    PICTURE X(2).
144300170928  ¦   *01  WS-CONTR-REDEM-CODE-RULE PIC X(2).
144400170928R64527*01  WS-CRC-LST              PIC S9(4).
144500170928R64527 01  WS-CRC-LST              PIC S9(5).
144600170928R64527*01  WS-CRC-MAX              PIC S9(4) VALUE 1000.
144700170928R64527 01  WS-CRC-MAX              PIC S9(5) VALUE 30000.
144800170928  ¦   *****
144900170928  ¦   *****    INV-GRP-CATEGORY Table
145000170928  ¦   *****
145100170928  ¦    01  WS-INV-GRP-CAT-TBL.
145200170928  ¦        02  WS-INV-GRP-CAT-ENT    OCCURS  500  TIMES
145300170928  ¦                                  INDEXED BY  INVGC.
145400170928  ¦            05  WS-INVGC-CATEGORY   PICTURE X(5).
145500170928  ¦            05  WS-INVGC-LANGUAGE   PICTURE X(1).
145600170928  ¦            05  WS-INVGC-DESCR      PICTURE X(25).
145700170928  ¦    01  WS-INVGC-GRP-DESCR      PIC X(25).
145800170928  v    01  WS-INVGC-LST            PIC S9(4).
145900170928R14153 01  WS-INVGC-MAX            PIC S9(4) VALUE 500.
146000170928156507 01  WS-LDA-STRDTE-S79       PIC S9(08).
146100170928156507 01  WS-LDA-ENDDTE-S79       PIC S9(08).
146200170928156507 01  ln-INVPND-Array-Size    PIC S9(09).
146300170928156507 01  INVPND-CNT              PIC S9(09) VALUE 0.
146400170928156507 01  INVPND-NXT              PIC S9(09) VALUE 0.
146500170928156507 01  INVPND-MAX              PIC S9(09) VALUE 10000.
146600170928156507 01  lc-INVPND-EOF           PIC X(01).
146700170928156507 01  ln-INVPND-ACCOUNT       PIC S9(09).
146800170928156507 01  ln-INVPND-ROWNUM        PIC S9(01).
146900170928156507 01  lc-INVPND-INVESTMENT    PIC X(05).
147000170928156507 01  WS-INV-PND-TRANS.
147100170928156507     02  WS-INV-PND-ARR-DTL    OCCURS 1 TO 10000 TIMES
147200170928156507                               DEPENDING ON ln-INVPND-Array-Size
147300170928156507*                              ASCENDING KEY IS WS-INVPND-ACCOUNT
147400170928156507*                                               WS-INVPND-ROWNUM
147500170928156507                               INDEXED BY  INVPND-IDX.
147600170928156507       03 WS-INVPND-DTL.
147700170928156507         05  WS-INVPND-ACCOUNT    PIC S9(09).
147800170928156507         05  WS-INVPND-ROWNUM     PIC S9(01).
147900170928156507         05  WS-INVPND-INVESTMENT PIC X(05).
148000170928      /
148100170928       01  WS-PGM-DEFINED-WORK-ITEMS3.
148200170928      ******************************************************************
148300170928      *    P R O G R A M   D E F I N E D   W O R K   I T E M S         *
148400170928      ******************************************************************
148500170928      *****    Level Accumulators.
148600170928           03  WS-ACC-CDN-CPG          PICTURE S9(11)V9(2) COMP-3.
148700170928           03  WS-ACC-CDN-MVB          PICTURE S9(11)V9(2) COMP-3.
148800170928           03  WS-ACC-CDN-MVP          PICTURE S9(11)V9(2) COMP-3.
148900170928RF7503     03  WS-ACC-CDN-MVB-Q        PICTURE S9(11)V9(2) COMP-3.
149000170928           03  WS-ACC-CDN-MVB-Q1       PICTURE 9(11)V9(2).
149100170928           03  WS-ACC-CDN-MVB-Q2       PICTURE 9(11)V9(2).
149200170928           03  WS-ACC-CDN-MVB-Q3       PICTURE 9(11)V9(2).
149300170928           03  WS-ACC-CDN-MVB-Q4       PICTURE 9(11)V9(2).
149400170928           03  WS-ACC-NRTAX-CUR        PICTURE S9(11)V9(2) COMP-3.
149500170928           03  WS-ACC-NRTAX-INC        PICTURE S9(11)V9(2) COMP-3.
149600170928           03  WS-ACC-NRTAX-YTD        PICTURE S9(11)V9(2) COMP-3.
149700170928           03  WS-ACC-OPNMKTVAL        PICTURE S9(11)V9(2) COMP-3.
149800170928           03  WS-ACC-USD-CPG          PICTURE S9(11)V9(2) COMP-3.
149900170928           03  WS-ACC-WHTAX-CUR        PICTURE S9(11)V9(2) COMP-3.
150000170928           03  WS-ACC-WHTAX-INC        PICTURE S9(11)V9(2) COMP-3.
150100170928           03  WS-ACC-WHTAX-YTD        PICTURE S9(11)V9(2) COMP-3.
150200170928           03  WS-ACC-WHTAX-PRV        PICTURE S9(11)V9(2) COMP-3.
150300170928           03  WS-ACC-TINCOME-PRV      PICTURE S9(11)V9(2) COMP-3.
150400170928           03  WS-BOOK-FGN-ACCT        PICTURE S9(11)V9(2) COMP-3.
150500170928           03  WS-BOOK-FGN-INV         PICTURE S9(11)V9(2) COMP-3.
150600170928           03  WS-BOOK-TOTAL-ACCT      PICTURE S9(11)V9(2) COMP-3.
150700170928           03  WS-BOOK-TOTAL-INV       PICTURE S9(11)V9(2) COMP-3.
150800170928RF8359     03  WS-BOOK-VALUE-US-ACCT   PICTURE S9(11)V9(2) COMP-3.
150900170928           03  WS-BOOK-VALUE-US        PICTURE S9(11)V9(2) COMP-3.
151000170928           03  WS-BOOK-VALUE-CND       PICTURE S9(11)V9(2) COMP-3.
151100170928           03  WS-ACC-CPG-YTD          PICTURE S9(11)V9(2) COMP-3.
151200170928           03  WS-ACC-INC-YTD          PICTURE S9(11)V9(2) COMP-3.
151300170928           03  WS-ACC-INT-YTD          PICTURE S9(11)V9(2) COMP-3.
151400170928           03  WS-ACC-PUR-YTD          PICTURE S9(11)V9(2) COMP-3.
151500170928           03  WS-ACC-RED-YTD          PICTURE S9(11)V9(2) COMP-3.
151600170928           03  WS-ACC-REG-CTB-CUR      PICTURE S9(11)V9(2) COMP-3.
151700170928           03  WS-ACC-REG-CTB-INCPT    PICTURE S9(11)V9(2) COMP-3.
151800170928           03  WS-ACC-CPG-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
151900170928           03  WS-ACC-INC-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
152000170928           03  WS-ACC-INT-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
152100170928           03  WS-ACC-PUR-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
152200170928           03  WS-ACC-RED-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
152300170928           03  WS-ACC-REG-CTB-CUR-EX   PICTURE S9(11)V9(2) COMP-3.
152400170928           03  WS-ACC-REG-CTB-INCPT-EX PICTURE S9(11)V9(2) COMP-3.
152500170928           03  WS-IVR-CPG-YTD          PICTURE S9(11)V9(2) COMP-3.
152600170928           03  WS-IVR-INC-YTD          PICTURE S9(11)V9(2) COMP-3.
152700170928           03  WS-IVR-INT-YTD          PICTURE S9(11)V9(2) COMP-3.
152800170928           03  WS-IVR-PUR-YTD          PICTURE S9(11)V9(2) COMP-3.
152900170928           03  WS-IVR-RED-YTD          PICTURE S9(11)V9(2) COMP-3.
153000170928           03  WS-IVR-REG-CTB-CUR      PICTURE S9(11)V9(2) COMP-3.
153100170928           03  WS-IVR-REG-CTB-INCPT    PICTURE S9(11)V9(2) COMP-3.
153200170928           03  WS-IVR-CPG-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
153300170928           03  WS-IVR-INC-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
153400170928           03  WS-IVR-INT-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
153500170928           03  WS-IVR-PUR-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
153600170928           03  WS-IVR-RED-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
153700170928           03  WS-IVR-REG-CTB-CUR-EX   PICTURE S9(11)V9(2) COMP-3.
153800170928           03  WS-IVR-REG-CTB-INCPT-EX PICTURE S9(11)V9(2) COMP-3.
153900170928           03  WS-INV-CPG              PICTURE S9(11)V9(2) COMP-3.
154000170928           03  WS-INV-CPG-YTD          PICTURE S9(11)V9(2) COMP-3.
154100170928           03  WS-INV-INC-YTD          PICTURE S9(11)V9(2) COMP-3.
154200170928           03  WS-INV-INT-YTD          PICTURE S9(11)V9(2) COMP-3.
154300170928           03  WS-INV-PUR-YTD          PICTURE S9(11)V9(2) COMP-3.
154400170928           03  WS-INV-RED-YTD          PICTURE S9(11)V9(2) COMP-3.
154500170928           03  WS-INV-REG-CTB-CUR      PICTURE S9(11)V9(2) COMP-3.
154600170928           03  WS-INV-REG-CTB-INCPT    PICTURE S9(11)V9(2) COMP-3.
154700170928           03  WS-INV-CPG-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
154800170928           03  WS-INV-INC-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
154900170928           03  WS-INV-INT-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
155000170928           03  WS-INV-PUR-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
155100170928           03  WS-INV-RED-YTD-EX       PICTURE S9(11)V9(2) COMP-3.
155200170928           03  WS-INV-REG-CTB-CUR-EX   PICTURE S9(11)V9(2) COMP-3.
155300170928           03  WS-INV-REG-CTB-INCPT-EX PICTURE S9(11)V9(2) COMP-3.
155400170928           03  WS-INV-MVP              PICTURE S9(11)V9(2) COMP-3.
155500170928           03  WS-INV-NRTAX-CUR        PICTURE S9(11)V9(2) COMP-3.
155600170928           03  WS-INV-NRTAX-INC        PICTURE S9(11)V9(2) COMP-3.
155700170928           03  WS-INV-NRTAX-YTD        PICTURE S9(11)V9(2) COMP-3.
155800170928           03  WS-IVR-NRTAX-YTD        PICTURE S9(11)V9(2) COMP-3.
155900170928           03  WS-INV-OPNMKTVAL        PICTURE S9(11)V9(2) COMP-3.
156000170928           03  WS-INV-WHTAX-CUR        PICTURE S9(11)V9(2) COMP-3.
156100170928           03  WS-INV-WHTAX-INC        PICTURE S9(11)V9(2) COMP-3.
156200170928           03  WS-INV-WHTAX-YTD        PICTURE S9(11)V9(2) COMP-3.
156300170928           03  WS-IVR-WHTAX-YTD        PICTURE S9(11)V9(2) COMP-3.
156400170928           03  WS-INV-WHTAX-PRV        PICTURE S9(11)V9(2) COMP-3.
156500170928           03  WS-INV-TINCOME-PRV      PICTURE S9(11)V9(2) COMP-3.
156600170928           03  WS-IVR-OPNMKTVAL        PICTURE S9(11)V9(2) COMP-3.
156700170928           03  WS-IVR-WITHDRAWALS-YTD  PICTURE S9(11)V9(2) COMP-3.
156800170928           03  WS-WITHDRAWALS-YTD      PICTURE S9(11)V9(2) COMP-3.
156900170928           03  WS-IN-AMT               PICTURE S9(11)V9(2) COMP-3.
157000170928           03  WS-OUT-AMT              PICTURE S9(11)V9(2) COMP-3.
157100170928           03  WS-ORIGIN-COST-F        PICTURE S9(11)V9(2) COMP-3.
157200170928           03  WS-ORIGIN-COST-A        PICTURE S9(11)V9(2) COMP-3.
157300170928           03  WS-ORIGIN-COST-I        PICTURE S9(11)V9(2) COMP-3.
157400170928           03  WS-INV-MKT-VALUE-LAST-YE PICTURE S9(11)V9(2) COMP-3.
157500170928           03  WS-ACC-MKT-VALUE-LAST-YE PICTURE S9(11)V9(2) COMP-3.
157600170928R13017     03  WS-ADHOC-B-FLAG         PICTURE S9(5) VALUE ZEROS.
157700170928      *****
157800170928      *****    Units Items.
157900170928           03  WS-UNITS-BOUGHT         PICTURE S9(11)V9(3) COMP-3.
158000170928           03  WS-UNITS-SOLD           PICTURE S9(11)V9(3) COMP-3.
158100170928           03  WS-UNITS-DIV            PICTURE S9(11)V9(3) COMP-3.
158200170928           03  WS-AUG-UNITS-BOUGHT     PICTURE S9(11)V9(3) COMP-3.
158300170928           03  WS-AUG-UNITS-SOLD       PICTURE S9(11)V9(3) COMP-3.
158400170928           03  WS-AUG-UNITS-DIV        PICTURE S9(11)V9(3) COMP-3.
158500170928           03  WS-UNIT-AMT             PICTURE S9(11)V9(3) COMP-3.
158600170928      *****
158700170928      *****    Miscellaneous Literals.
158800170928           03  WS-CURRENCY-CAD         PICTURE X(3)        VALUE "CAD".
158900170928           03  WS-CURRENCY-USD         PICTURE X(3)        VALUE "USD".
159000170928      *****
159100170928      *****    Miscellaneous Non-numeric Items.
159200170928      *****
159300170928           03  WS-ACACTYP               PICTURE X(5).
159400170928           03  WS-RE-READ-FLAG          PICTURE X(1) VALUE "N".
159500170928R16033     03  WS-GIC-SAME-FUND-FLAG    PICTURE X(1) VALUE "N".
159600170928R17767     03  WS-SWITCH-SAME-ACCT-FLAG PICTURE X(1).
159700170928R17767         88  SWITCH-SAME-ACCT                  VALUE "Y".
159800170928R17767         88  SWITCH-DIFF-ACCT                  VALUE "N".
159900170928R50993     03 lc_SeriesDescFrench       PIC X(45).
160000170928  ¦        03 lc_SeriesDescEnglish      PIC X(45).
160100170928R50993     03 lc_ContInvSeries          PIC X(5).
160200170928           03  WS-IS-ENTERED-BY.
160300170928               04 WS-IS-ENTERED-BY-3    PICTURE X(3).
160400170928               04 WS-IS-ENTERED-BY-LIT  PICTURE X(7).
160500170928           03  WS-ENTERED-BY.
160600170928               04 WS-ENTERED-BY-3       PICTURE X(3).
160700170928               04 WS-ENTERED-BY-LIT     PICTURE X(7).
160800170928           03  WS-INVESTOR-SWITCH      PICTURE X(1) VALUE "N".
160900170928           03  WS-DEALER-REP-SWITCH    PICTURE X(1) VALUE "N".
161000170928           03  WS-FILE-STATUS          PICTURE XX.
161100170928           03  WS-CLTSPR-SW            PICTURE X(1).
161200170928           03  WS-ACCOUNT-BENEFICIARY  PICTURE X(45).
161300170928R11623     03  WS-BYPASS-ACCOUNT       PICTURE X(1) VALUE "N".
161400170928R14747     03  WS-ACCOUNT-CLOSED       PICTURE X(12)
161500170928                                       VALUE "ACCT. CLOSED".
161600170928           03  WS-RESP-BENEFICIARY-CNT      PICTURE 9(1).
161700170928R12784     03  WS-RESP-BENEFICIARY-SEQ      PICTURE 9(2).
161800170928R11177     03  WS-ACC-BENEFICIARY-TEMP      PICTURE X(45).
161900170928           03  WS-BENEFICIARY-CNT           PICTURE 9(1).
162000170928           03  WS-BENEFICIARIES.
16210017092869424          04  WS-BENEFICIARY1          PIC X(45).
16220017092869424          04  WS-BENEFICIARY2          PIC X(45).
16230017092869424          04  WS-BENEFICIARY3          PIC X(45).
16240017092869424          04  WS-BENEFICIARY4          PIC X(45).
16250017092869424          04  WS-BENEFICIARY5          PIC X(45).
16260017092869424          04  WS-BENEFICIARY6          PIC X(45).
162700170928R17380     03  WS-DEALER-CO-ATTN       PICTURE X(40).
162800170928R17380     03  WS-NOMINEE-CO-ATTN      PICTURE X(40).
162900170928           03  WS-ADRTMP               PICTURE X(50).
163000170928           03  WS-CONTR-REDEM          PICTURE X(6).
163100170928           03  WS-CONTR-REDEM-2        REDEFINES WS-CONTR-REDEM.
163200170928               05  FILLER              PICTURE X(2).
163300170928               05  WS-CONTR-REDEM-YY-2 PICTURE X(2).
163400170928               05  FILLER              PICTURE X(2).
163500170928                   88  FIRST-60                            VALUE "-1".
163600170928                   88  REMAIND                             VALUE "-E"
163700170928                                                                 "-2".
163800170928                   88  RRSP-CONTRIBUTION                   VALUE "-E"
163900170928                                                                 "-1"
164000170928                                                                 "-2".
164100170928           03  WS-CONTR-REDEM-3        REDEFINES WS-CONTR-REDEM.
164200170928               05  WS-CONTR-REDEM-YY-3 PICTURE X(2).
164300170928               05  FILLER              PICTURE X(4).
164400170928                   88  FIRST-60-BPI                        VALUE "VR1 ".
164500170928                   88  REMAIND-BPI                         VALUE "VR2 "
164600170928                                                                 "VR3 "
164700170928                                                                 "VR4 ".
164800170928                   88  RRSP-CONTRIBUTION-BPI               VALUE "VR1 "
164900170928                                                                 "VR2 "
165000170928                                                                 "VR3 "
165100170928                                                                 "VR4 ".
165200170928           03  WS-DEALER-ADDR1         PICTURE X(40).
165300170928           03  WS-DEALER-ADDR2         PICTURE X(40).
165400170928           03  WS-DEALER-ADDR3         PICTURE X(40).
165500170928           03  WS-DEALER-ADDR4         PICTURE X(40).
165600170928           03  WS-DEALER-ADDR5         PICTURE X(40).
165700170928R13011     03  WS-ADDR4-SEPARATE       PICTURE X(40).
165800170928R13011     03  WS-ADDR4-SEPARATE-R     REDEFINES WS-ADDR4-SEPARATE.
165900170928R13011         05  WS-ADDR4-SEPARATE-CITY   PICTURE X(30).
166000170928R13011         05  WS-ADDR4-SEPARATE-PROV   PICTURE X(3).
166100170928R13011         05  WS-ADDR4-SEPARATE-POST   PICTURE X(7).
166200170928R11770     03  WS-AN-ADDRESS1          PICTURE X(40).
166300170928           03  WS-AN-ADDRESS2          PICTURE X(40).
166400170928           03  WS-AN-ADDRESS3          PICTURE X(40).
166500170928           03  WS-AN-ADDRESS4          PICTURE X(40).
166600170928R11770     03  WS-AN-ADDRESS5          PICTURE X(40).
166700170928RF6725     03  WS-NOMINEE-ADDR1         PICTURE X(40).
166800170928           03  WS-NOMINEE-ADDR2         PICTURE X(40).
166900170928           03  WS-NOMINEE-ADDR3         PICTURE X(40).
167000170928           03  WS-NOMINEE-ADDR4         PICTURE X(40).
167100170928           03  WS-MAILING-ADDRESS-INDICATOR PIC X(1).
167200170928R11127     03  WS-TAXABLE-EVENT-INDICATOR   PIC X(1).
167300170928R14556     03  WS-TRANSFER-AT-AVERAGE-IND   PIC X(1) VALUE " ".
167400170928RF9850     03  WS-AD-FUND-CODE.
167500170928               05 WS-AD-FUND-MGMT-CDE  PICTURE X(3).
167600170928               05 WS-AD-INDUSTRY-CODE  PICTURE X(5).
167700170928R17848     03  WS-AD-INVESTMENT-CODE            PIC X(5).
167800170928RF9850     03  WS-INVESTMENT-STRUCTURE-CODE-F   PIC X(5).
167900170928RF9850     03  WS-INVESTMENT-STRUCTURE-CODE     PIC X(5).
168000170928R12102     03  WS-AD-PHANTOM-FUND-NUMBER        PIC X(5).
168100170928R14920     03  WS-AT-PHANTOM-FUND-NUMBER        PIC X(5) VALUE "     ".
168200170928           03  WS-DEDUCTION-CODE       PICTURE X(4).
168300170928               88  COMMISSION                              VALUE "COMM".
168400170928               88  DAF                                     VALUE "DAF ".
168500170928               88  TAX-NONRES                              VALUE "NONT".
168600170928               88  TAX-WITHHELD                            VALUE "FEDT"
168700170928                                                                 "PRVT"
168800170928R29550                                                           "USWT".
168900170928               88  SPONSOR-RATE                            VALUE "SPNS".
169000170928RF6697         88  TAX-GST                                 VALUE "GST ".
169100170928               88  TAX-PST                                 VALUE "PST ".
169200170928RF4638         88  CDSC                                    VALUE "CDSC".
169300170928               88  ADMN                                    VALUE "ADMN"
169400170928                                                                 "REDF"
169500170928                                                                 "RPTY"
169600170928                                                                 "RRPA"
169700170928                                                                 "TRSF".
169800170928               88  FEDT                                    VALUE "FEDT".
169900170928               88  PRVT                                    VALUE "PRVT".
170000170928R24080         88  ERED                                    VALUE "ERED".
170100170928R18780         88  FEDC                                    VALUE "FEDC".
170200170928R18780         88  PRVC                                    VALUE "PRVC".
170300170928R29550         88  USWT                                    VALUE "USWT".
170400170928           03  WS-DL-BRANCH-ADDR6      PICTURE X(40).
170500170928           03  WS-FDR-ACCOUNT          PICTURE X(9).
170600170928           03  WS-FDR-ADVTYPCDE        PICTURE X(3).
170700170928           03  WS-FDR-DLRCDE           PICTURE X(4).
170800170928           03  WS-FDR-DLRREPCDE        PICTURE X(6).
170900170928R10605     03  WS-ACCOUNT-DLR-REP-CODE.
171000170928               05 WS-ACCOUNT-DLRCDE            PICTURE X(4).
171100170928               05 WS-ACCOUNT-DLRREPCDE         PICTURE X(6).
171200170928           03  WS-TRANS-DLR-REP-CODE.
171300170928               05 WS-TRANS-DLRCDE              PICTURE X(4).
171400170928               05 WS-TRANS-DLRREPCDE           PICTURE X(6).
171500170928           03  WS-REP-NAME-ACC         PICTURE X(40).
171600170928           03  WS-REP-NAME-TXN         PICTURE X(40).
171700170928           03  WS-REP-NAME-ACC-TEMP    PICTURE X(40).
171800170928R10605     03  WS-REP-NAME-TXN-TEMP    PICTURE X(40).
171900170928           03  WS-AD-SALESREP          PICTURE X(6).
172000170928           03  WS-II-SALESREP          PICTURE X(6).
172100170928           03  WS-FORM-CODE            PICTURE X(10).
172200170928           03  WS-DELIVERY-METHOD-DLR  PIC X(3).
172300170928           03  WS-FUND-NO.
172400170928               05  FILLER              PICTURE X(3).
172500170928               05  WS-FUND             PICTURE X(3).
172600170928               05  FILLER              PICTURE X(2).
172700170928           03  WS-II-INVESTOR-ADDRESS6 PICTURE X(40).
172800170928           03  WS-II-INVESTOR-ADDRESS7 PICTURE X(40).
172900170928           03  WS-INVESTOR-TYPE        PICTURE X(25).
173000170928           03  WS-MFATRNP-KEYCUR.
173100170928               05  WS-KC-ACCOUNT-NO    PICTURE S9(9).
173200170928               05  WS-KC-INVESTMENT-CODE
173300170928                                       PICTURE X(5).
173400170928               05  WS-KC-PROCESS-DATE  PICTURE S9(9)       COMP-3.
173500170928               05  WS-KC-TRANS-PROC-SEQ-NO
173600170928                                       PICTURE S9(3)       COMP-3.
173700170928           03  WS-MFATRNP-KEYLST.
173800170928               05  WS-KL-ACCOUNT-NO    PICTURE S9(9).
173900170928               05  WS-KL-INVESTMENT-CODE
174000170928                                       PICTURE X(5).
174100170928               05  WS-KL-PROCESS-DATE  PICTURE S9(9)       COMP-3.
174200170928               05  WS-KL-TRANS-PROC-SEQ-NO
174300170928                                       PICTURE S9(3)       COMP-3.
174400170928           03  WS-POSTAL.
174500170928               05  WS-POSTAL1          PICTURE X(3).
174600170928               05  WS-POSTAL2          PICTURE X(7).
174700170928           03  WS-POSTAL-R             REDEFINES WS-POSTAL.
174800170928               05  WS-POSTALU1         PICTURE X(5).
174900170928               05  WS-POSTALU2.
175000170928                   07  WS-POSTALU3     PICTURE X(1).
175100170928138436*            07  FILLER          PICTURE X(3).
175200170928138436             07  WS-POSTALU4     PICTURE X(4).
175300170928138436*        05  FILLER              PICTURE X(1).
175400170928           03  WS-POSTAL-OUT.
175500170928               05  WS-POSTAL-OUT1      PICTURE X(3).
175600170928               05  FILLER              PICTURE X(1).
175700170928               05  WS-POSTAL-OUT2      PICTURE X(6).
175800170928           03  WS-POSTAL-OUT-R         REDEFINES WS-POSTAL-OUT.
175900170928               05  WS-POSTAL-OUTU1     PICTURE X(5).
176000170928               05  WS-POSTAL-OUTU2     PICTURE X(1).
176100170928               05  WS-POSTAL-OUTU3     PICTURE X(4).
176200170928           03  WS-PSTLCDI.
176300170928               05  WS-PSTLCDI1         PICTURE X(3).
176400170928               05  WS-PSTLCDI2         PICTURE X(7).
176500170928           03  WS-PSTLCDO.
176600170928               05  WS-PSTLCDO1         PICTURE X(3).
176700170928               05  FILLER              PICTURE X(1).
176800170928               05  WS-PSTLCDO2         PICTURE X(7).
176900170928           03  WS-REP-NAME             PICTURE X(40).
177000170928R48660     03  lc-OriginCode           PIC X(3).
177100170928           03  WS-TRANS-TYPE           PICTURE X(3).
177200170928R18312         88  BUY-ONLY                                VALUE "BUY".
177300170928               88  CAPITAL-GAIN                            VALUE "CPG".
177400170928               88  CAPITAL-LOSS                            VALUE "CPL".
177500170928RF6774         88  BUY-ADJUSTMENT                          VALUE "BAJ".
177600170928148326         88  SEL-ADJUSTMENT                          VALUE "SAJ".
17770017092883717          88  BUY-SELL-ADJUSTMENT                     VALUE "BAJ"
17780017092883717                                                            "SAJ".
177900170928R14858         88  BALANCE-FORWARD                         VALUE "BFW".
178000170928               88  CONTRIBS-ONLY                           VALUE "BAJ"
178100170928                                                                 "BUY".
178200170928               88  CONTRIB-U                               VALUE "BAJ"
178300170928                                                                 "BUY"
178400170928                                                                 "SWI"
178500170928RF5582                                                           "TRI".
178600170928               88  INCOME                                  VALUE "INC".
178700170928               88  INTEREST                                VALUE "INT".
178800170928               88  PURCHASE-TRANSACTION                    VALUE "BAJ"
178900170928                                                                 "BFW"
179000170928                                                                 "BUY"
179100170928                                                                 "CPG"
179200170928                                                                 "INC"
179300170928                                                                 "INT"
179400170928                                                                 "MFR"
179500170928                                                                 "SWI"
179600170928                                                                 "TRI".
179700170928               88  REDEMPTION-TRANSACTION                  VALUE "CQD"
179800170928                                                                 "FEE"
179900170928                                                                 "SAJ"
180000170928                                                                 "SEL"
180100170928                                                                 "CPL"
180200170928                                                                 "SWO"
180300170928                                                                 "TFE"
180400170928                                                                 "TRO".
180500170928               88  REDEMPTS-ONLY                           VALUE "CQD"
180600170928                                                                 "FEE"
180700170928                                                                 "SAJ"
180800170928                                                                 "SEL"
180900170928                                                                 "TFE".
181000170928               88  REDEMPT-U                               VALUE "CQD"
181100170928                                                                 "FEE"
181200170928                                                                 "SAJ"
181300170928                                                                 "SEL"
181400170928                                                                 "TFE"
181500170928                                                                 "SWO"
181600170928RF5582                                                           "TRO".
181700170928               88  REINVESTED-ONLY                         VALUE "CPG"
181800170928                                                                 "INC"
181900170928                                                                 "INT"
182000170928                                                                 "MFR".
182100170928               88  TRANSFER-IN-ONLY                        VALUE "SWI"
182200170928                                                                 "TRI".
182300170928               88  TRANSFER-OUT-ONLY                       VALUE "SWO"
182400170928                                                                 "TRO".
182500170928RF7777         88  TRANSFER-IN                             VALUE "TRI".
182600170928               88  TRANSFER-OUT                            VALUE "TRO".
182700170928               88  SWITCHES-IN                             VALUE "SWI".
182800170928               88  SWITCHES-OUT                            VALUE "SWO".
182900170928RF7171         88  TRANSFER-IN-OUT-ONLY                    VALUE "SWO"
183000170928                                                                 "TRO"
183100170928                                                                 "SWI"
183200170928                                                                 "TRI".
183300170928               88  WITHDRAWAL                              VALUE "SAJ"
183400170928                                                                 "SEL".
183500170928               88  ORIGINAL-COST-IN                        VALUE "BUY"
183600170928                                                                 "TRI"
183700170928                                                                 "SWI".
183800170928               88  ORIGINAL-COST-OUT                       VALUE "CQD"
183900170928                                                                 "SEL"
184000170928                                                                 "SWO"
184100170928                                                                 "TRO".
184200170928R11127         88  SEL-ONLY                                VALUE "SEL".
184300170928 72750         88  DISTRIBUTION-ONLY                       VALUE "INT"
184400170928 72750                                                           "INC"
184500170928 72750                                                           "CPG".
184600170928R14528         88  DISTRIBUTION                            VALUE "INT"
184700170928                                                                 "INC"
184800170928                                                                 "CPG"
184900170928                                                                 "MFR"
185000170928R14858                                                           "BAJ"
185100170928R14858                                                           "BFW"
185200170928                                                                 "CPL".
185300170928R14136         88  MANAGEMENT-FEE-REBATE                   VALUE "MFR".
185400170928R15022         88  FEES                                    VALUE "FEE".
185500170928R15022         88  TRUSTEE-FEES                            VALUE "TFE".
185600170928      *****
185700170928      *****    Miscellaneous Numeric Items.
185800170928      *****
185900170928           03  WS-GROSS-AMT-EX         PICTURE S9(11)V9(2) COMP-3.
186000170928R11127     03  WS-UNIT-AMT-EX          PICTURE S9(11)V9(3) COMP-3.
186100170928R11127     03  WS-NON-TAX-DEDUCTIONS   PICTURE S9(11)V9(2) COMP-3.
186200170928R16990     03  WS-TRANS-TOTAL-DEDUCTIONS PIC   S9(9)V9(2) COMP-3.
186300170928R34072     03  ln_trn_total_redem_charge PIC   S9(9)V9(2) COMP-3
186400170928R36808                                         Value 0.
186500170928148326     03 ln-ACB-UNIT-TRANSACTED   PICTURE S9(5)V9(4)  COMP-3.
186600170928R50993     03 li_MConFlgCount          PICTURE S9(3).
186700170928  ¦        03 li_DfltFlgCount          PICTURE S9(3).
186800170928R50993     03 ld_FstDepDate            PICTURE S9(8).
186900170928           03  WS-CERT-UNITS           PICTURE S9(9)V9(3).
187000170928           03  WS-TRN-BOOK-VALUE       PICTURE S9(11)V99.
187100170928           03  WS-CNFM-SDATE           PICTURE 9(8).
187200170928           03  WS-CNFM-EDATE           PICTURE 9(8).
187300170928           03  WS-AC-SECTION-SEQUENCE  PICTURE S9(7)       COMP-3.
187400170928           03  WS-ACB-UNIT-PRICE-BASE  PICTURE S9(5)V9(4)  COMP-3.
187500170928991029     03  WS-TEMP-TRANS-PRICE     PICTURE S9(5)V9(4)  COMP-3.
187600170928RF5962     03  WS-DISTRIBUTION-ROC     PICTURE S9(9)V9(2)  COMP-3.
187700170928RF7172     03  WS-TAXABLE-AMOUNT       PICTURE S9(9)V9(2)  COMP-3.
187800170928           03  WS-UNIT-PRICE-LAST-YEND PICTURE S9(5)V9(4)  COMP-3.
187900170928           03  WS-ACB-UNITS-TRANSACTED PICTURE S9(5)V9(4)  COMP-3.
188000170928156507     03  WS-ACB-UNITS-TRANSACTED-S79   PICTURE S9(5)V9(4)  COMP-3.
188100170928156507     03  WS-ACB-UNIT-PRICE-BASE-S79    PICTURE S9(5)V9(4)  COMP-3.
188200170928156507     03  ln-ACB-UNIT-TRANSACTED-S79    PICTURE S9(5)V9(4)  COMP-3.
188300170928156507     03  WS-TEMP-AT-UNIT-BALANCE       PICTURE 9(9)V9(3).
188400170928156507     03  WS-TEMP-AT-NO-OF-UNITS        PICTURE 9(9)V9(3).
188500170928156507     03  WS-TEMP-AT-NO-OF-UNITS-SIGN   PICTURE X(1).
188600170928156507     03  WS-TEMP-AT-NON-TAX-DEDUCTIONS PICTURE 9(11)V9(2).
188700180321156507     03  WS-TEMP-AT-ACB-UNITS-TRANS    PICTURE 9(5)V9(4).
188800170928177079     03  WS-TEMP-AT-UNIT-PRICE         PICTURE 9(5)V9(4).
188900170928           03  WS-ACCBVTOT             PICTURE S9(11)V9(2) COMP-3.
189000170928           03  WS-ACCOUNT-COUNT        PICTURE 9(6).
189100170928           03  WS-II-ACCOUNT-COUNT     PICTURE 9(6).
189200170928           03  WS-ACCPCT               PICTURE S9(3)V9(2)  COMP-3.
189300170928           03  WS-TE-PERCENT           PICTURE S9(3)V9(2)  COMP-3.
189400170928           03  WS-ACCPCT-CDN           PICTURE S9(3)V9(2)  COMP-3.
189500170928           03  WS-ACCPCT-HGH           PICTURE S9(11)V9(2) COMP-3.
189600170928           03  WS-ACCPCT-TOT           PICTURE S9(3)V9(2)  COMP-3.
189700170928           03  WS-ACCPCT-USD           PICTURE S9(3)V9(2)  COMP-3.
189800170928           03  WS-AGE                  PICTURE S9(3)       COMP-3.
189900170928           03  WS-SEG-AGE              PICTURE 9(4) VALUE ZEROS.
190000170928           03  WS-AW-SECTION-SEQUENCE  PICTURE S9(7)       COMP-3.
190100170928           03  WS-BLKADR-CNT           PICTURE S9(3)       COMP-3.
190200170928           03  WS-CPTL-GAIN            PICTURE S9(11)V9(2) COMP-3.
190300170928           03  WS-EEC-TOTAL            PICTURE S9(11)V9(2) COMP-3.
190400170928           03  WS-ERC-TOTAL            PICTURE S9(11)V9(2) COMP-3.
190500170928R16633     03  WS-EEC-ERC-TOTAL        PICTURE S9(11)V9(2) COMP-3.
190600170928           03  WS-EEC-REMAINDER        PICTURE S9(11)V9(2) COMP-3.
190700170928           03  WS-EEC-1ST60            PICTURE S9(11)V9(2) COMP-3.
190800170928           03  WS-ERC-REMAINDER        PICTURE S9(11)V9(2) COMP-3.
190900170928           03  WS-ERC-1ST60            PICTURE S9(11)V9(2) COMP-3.
191000170928           03  WS-GR-SECTION-SEQUENCE  PICTURE S9(7)       COMP-3.
191100170928           03  WS-GROSS-AMT            PICTURE S9(11)V9(2) COMP-3.
191200170928           03  WS-TE-GROSS-AMOUNT      PICTURE S9(11)V9(2) COMP-3.
191300170928           03  WS-TE-AMOUNT            PICTURE S9(9)V9(2) COMP-3.
191400170928130414* Removed the changes added in RFS 119949 and RFS 80564
191500170928119949*    03  WS-TE-ACC-AMOUNT        PICTURE S9(9)V9(2) COMP-3
191600170928  |   *                                             VALUE 0.
191700170928  |   *    03  WS-TE-DIF-AMOUNT        PICTURE S9(9)V9(2) COMP-3
191800170928119949*                                             VALUE 0.
191900170928r80564*    03  WS-TE-AMOUNT-tot        PICTURE S9(9)V9(2) COMP-3.
192000170928           03  WS-INVESTOR-COUNT       PICTURE 9(6).
192100170928           03  WS-IVRADRCNT            PICTURE S9(3)       COMP-3.
192200170928           03  WS-RE-SECTION-SEQUENCE  PICTURE S9(7)       COMP-3.
192300170928           03  WS-TE-SECTION-SEQUENCE  PICTURE S9(7)       COMP-3.
192400170928           03  WS-RE-CURR-YEAR-CONTRIB PICTURE S9(9)V9(2)  COMP-3.
192500170928           03  WS-RE-PREV-YEAR-CONTRIB PICTURE S9(9)V9(2)  COMP-3.
192600170928           03  WS-RE-CES-GRANT-AMOUNT  PICTURE S9(9)V9(2)  COMP-3.
192700170928RF5148     03  WS-ACC-PERF-COUNT       PICTURE 9(6).
192800170928RF5148     03  WS-FUND-PERF-COUNT      PICTURE 9(6).
192900170928R17626     03  WS-ACC-FRQ-COUNT        PICTURE 9(6).
193000170928R17626     03  WS-FUND-FRQ-COUNT       PICTURE 9(6).
193100170928RF6697     03  WS-ACC-GIC-COUNT        PICTURE 9(6).
193200170928           03  WS-ROLLOVER-COUNT       PICTURE 9(6).
193300170928           03  WS-SEQ                  PICTURE S9(7)       COMP-3.
193400170928           03  WS-SEQ-LST              PICTURE S9(7)       COMP-3.
193500170928           03  WS-SP-SECTION-SEQUENCE  PICTURE S9(7)       COMP-3.
193600170928           03  WS-TRANSACTION-COUNT    PICTURE 9(6).
193700170928156507     03  WS-TRANS79-COUNT        PICTURE 9(6).
193800170928R10404     03  WS-TRANSACTION-COUNT-DII PICTURE 9(6) VALUE 300000.
193900170928           03  WS-RESP-TRANSACTION-CNT PICTURE 9(6).
194000170928           03  WS-TRNCHGHID            PICTURE S9(11)V9(2) COMP-3.
194100170928           03  WS-IS-FOREIGN-CONTENT   PICTURE 9(3)V9(1).
194200170928           03  WS-ACCPCT-CDN-PHN       PICTURE S9(3)V9(1)  COMP-3.
194300170928           03  WS-ACCPCT-USD-PHN       PICTURE S9(3)V9(1)  COMP-3.
194400170928           03  WS-AC-PCT-PHN           PICTURE S9(3)V9(1)  COMP-3.
194500170928           03  WS-ACS-PCT-PHN          PICTURE S9(3)V9(1)  COMP-3.
194600170928           03  WS-ACCPCT-PHN           PICTURE S9(3)V9(1)  COMP-3.
194700170928RF6234     03  WS-UNIT-PRICE-TEMP      PICTURE S9(5)V9(4)  COMP-3.
194800170928           03  WS-UNIT-PRICE-DATE      PICTURE S9(8).
194900170928R10404     03  WS-AD-ACCRUED-INTEREST  PICTURE S9(11)V9(2).
195000170928R10992     03  WS-AD-BOOK-VALUE-BASE   PICTURE S9(11)V9(2).
195100170928R11324     03  WS-AG-ACCRUED-INTEREST1     PIC 9(11)V9(2).
195200170928R11324     03  WS-AG-ACCRUED-INTEREST2     PIC 9(11)V9(2).
195300170928129378     03  WS-AT-ACCRUED-INTEREST1     PIC 9(11)V9(2).
195400170928129378     03  WS-AT-ACCRUED-INTEREST2     PIC 9(11)V9(2).
195500170928RF6063     03  WS-BE-BENEFICIARY.
195600170928R16633         05 WS-BEYTD-CONTRIBUTIONS   PIC S9(9)V9(2) COMP-3.
195700170928   ¦           05 WS-BELTD-CONTRIBUTIONS   PIC S9(9)V9(2) COMP-3.
195800170928   ¦           05 WS-BEYTD-WITHDRAWLS      PIC S9(9)V9(2) COMP-3.
195900170928   ¦           05 WS-BELTD-WITHDRAWLS      PIC S9(9)V9(2) COMP-3.
196000170928   ¦           05 WS-BEYTD-CESG            PIC S9(9)V9(2) COMP-3.
196100170928   ¦           05 WS-BELTD-CESG            PIC S9(9)V9(2) COMP-3.
196200170928   ¦           05 WS-BEYTD-CAP-TRANSFERIN  PIC S9(9)V9(2) COMP-3.
196300170928   ¦           05 WS-BELTD-CAP-TRANSFERIN  PIC S9(9)V9(2) COMP-3.
196400170928   ¦           05 WS-BEYTD-INC-TRANSFERIN  PIC S9(9)V9(2) COMP-3.
196500170928   ¦           05 WS-BELTD-INC-TRANSFERIN  PIC S9(9)V9(2) COMP-3.
196600170928   ¦           05 WS-BEYTD-CESG-TRANSFERIN PIC S9(9)V9(2) COMP-3.
196700170928R16633         05 WS-BELTD-CESG-TRANSFERIN PIC S9(9)V9(2) COMP-3.
196800170928R83788         05 WS-BE-TOT-LTD-CLB     PICTURE S9(9)V9(2) COMP-3.
196900170928  |            05 WS-BE-TOT-YTD-CLB     PICTURE S9(9)V9(2) COMP-3.
197000170928  |            05 WS-BE-TOT-LTD-PGRANT  PICTURE S9(9)V9(2) COMP-3.
197100170928  |            05 WS-BE-TOT-YTD-PGRANT  PICTURE S9(9)V9(2) COMP-3.
197200170928  |            05 WS-BE-TOT-LTD-IQEE    PICTURE S9(9)V9(2) COMP-3.
197300170928  |            05 WS-BE-TOT-YTD-IQEE    PICTURE S9(9)V9(2) COMP-3.
197400170928  V            05 WS-BE-TOT-LTD-MONEY   PICTURE S9(9)V9(2) COMP-3.
197500170928R83788         05 WS-BE-TOT-YTD-MONEY   PICTURE S9(9)V9(2) COMP-3.
197600170928133489         05 WS-BEYTD-EAP             PIC S9(9)V9(2) COMP-3.
197700170928  |            05 WS-BELTD-EAP             PIC S9(9)V9(2) COMP-3.
197800170928  V            05 WS-BEYTD-PSE             PIC S9(9)V9(2) COMP-3.
197900170928133489         05 WS-BELTD-PSE             PIC S9(9)V9(2) COMP-3.
198000170928148326         05 WS-BELTD-CEAP            PIC S9(9)V9(2) COMP-3.
198100170928RF6063     03  WS-BENEFICIARY67-CNT        PICTURE 9(6).
198200170928R50823     03  LN-UNITPRICE                PICTURE S9(5)V9(4)  COMP-3.
198300170928RF4638     03  WS-SEG-FUND-SECTIONS.
198400180619               05 WS-GUAR-BASE-VALUE       PIC 9(11)V9(2)  COMP-3.
198500170928177152         05 WS-GUAR-DTH-VALUE        PIC 9(11)V9(2)  COMP-3.
198600180619R13184         05 WS-GUAR-BASEO-VALUE      PIC S9(11)V9(2) COMP-3.
198700170928177152         05 WS-GUAR-DEATHO-VALUE     PIC S9(11)V9(2) COMP-3.
198800180619               05 WS-GUAR-BASE-VALUE-TOT   PIC 9(11)V9(2).
198900170928177152         05 WS-GUAR-DTH-VALUE-TOT    PIC 9(11)V9(2).
199000180619R13184         05 WS-GUAR-BASEO-VALUE-TOT  PIC S9(11)V9(2) COMP-3.
199100170928177152         05 WS-GUAR-DEATHO-VALUE-TOT PIC S9(11)V9(2) COMP-3.
199200170928               05 WS-NET-DEPOSIT-VALUE     PIC 9(11)V9(2)  COMP-3.
199300170928R13184         05 WS-NET-DEPOSITO-VALUE    PIC S9(11)V9(2) COMP-3.
199400170928               05 WS-NET-DEPOSIT-VALUE-TOT PIC 9(11)V9(2).
199500170928               05 WS-GUAR-MATURITY-VAL     PIC 9(11)V9(2)  COMP-3.
199600170928               05 WS-GUAR-MATURITY-VAL-TOT PIC 9(11)V9(2)  COMP-3.
199700180626               05 WS-GUAR-DEATH-VAL        PIC 9(11)V9(2)  COMP-3.
199800170928177152         05 WS-GUAR-DEATH-VAL-OPEN   PIC 9(11)V9(2)  COMP-3.
199900170928               05 WS-GUAR-DEATH-VAL-TOT    PIC 9(11)V9(2)  COMP-3.
200000170928R13923         05 WS-CI-UNITS-TEMP         PIC S9(11)V9(3) COMP-3.
200100170928R13184         05 WS-CONTRACT-MARKET-VALUE PIC 9(11)V9(2)  COMP-3.
200200170928               05 WS-GUAR-BASE-VALUE-CHG   PIC S9(11)V9(2)  COMP-3.
200300170928R22856         05 WS-GUARANTEE-DTH-PERCENT PIC S9(5)V9(2)  COMP-3.
200400170928   ¦           05 WS-GUAR-DEATH-BENEFIT    PIC S9(11)V9(2) COMP-3.
200500170928   ¦           05 WS-GUAR-MAT-BENEFIT      PIC S9(11)V9(2) COMP-3.
200600170928   ¦           05 WS-AWD-AMT               PIC S9(11)V9(2) COMP-3.
200700170928   ¦           05 WS-AWD-AMT-TOTAL         PIC S9(11)V9(2) COMP-3.
200800170928   v           05 WS-CONTRACT-NO           PIC S9(9)       COMP-3.
200900170928R22856         05 WS-END-DATE              PIC S9(9)       COMP-3.
201000170928      * RFS37906 - Begins                                              *
201100170928               05 WS-CI-UNITSG-TEMP         PIC S9(11)V9(3) COMP-3.
201200170928               05 WS-GUAR-DEATHG-VAL        PIC  9(11)V9(2) COMP-3.
201300170928               05 WS-GUAR-DEATHG-VAL-TOT    PIC  9(11)V9(2) COMP-3.
201400170928               05 WS-NET-DEPOSITG-VALUE     PIC S9(11)V9(2) COMP-3.
201500170928               05 WS-NET-DEPOSITG-VALUE-TOT PIC  9(11)V9(2).
201600170928      * RFS37906 - Ends                                                *
201700170928RF4638     03  WS-ACC-SEG40-COUNT          PICTURE 9(6).
201800170928           03  WS-ACC-SEG43-COUNT          PICTURE 9(6).
201900170928           03  WS-ACC-SEG45-COUNT          PICTURE 9(6).
202000170928           03  WS-ACC-SEG90-COUNT          PICTURE 9(6).
202100170928R30514     03  WS-BYSTM-COUNT              PICTURE S9(5) VALUE ZEROS.
202200170928RF7503     03  WS-THROW-AWAY               PIC 9(4).
202300170928           03  WS-REM                      PIC 9(4).
202400170928           03  WS-MKT-Q-INVESTMENT         PIC 9(11)V9(2).
202500170928           03  WS-MKT-PARMS.
202600170928               05  WS-MKT-Q1-4-DATE          PIC 9(8).
202700170928               05  WS-MKT-Q-ACCOUNT-NO       PIC 9(9).
202800170928               05  WS-MKT-Q-INVESTMENT-CODE  PIC X(5).
202900170928               05  WS-MKT-Q-INVESTMENT-CURRENCY PIC 9(11)V9(2).
203000170928R8537          05  WS-MKT-Q-MK-BASE             PIC 9(11)V9(2).
203100170928R8537          05  WS-MKT-Q-BV-BASE             PIC 9(11)V9(2).
203200170928R8537          05  WS-MKT-Q-BV-EXCHANGE         PIC 9(2)V9(7).
203300170928R8537          05  WS-MKT-Q-UNIT-BAL            PIC 9(10)V9(3).
203400170928R8537          05  WS-MKT-Q-UNIT-PRICE          PIC 9(5)V9(4).
203500170928               05  WS-MKT-Q-BASE-CURRENCY       PIC 9(11)V9(2).
203600170928               05  WS-MKT-Q-ERROR-CODE       PIC X(1).
203700170928R12035     03  WS-TRCOD-CREATE-FLAG-PARM.
203800170928               05 WS-TRCOD-CREATE-FLAG       PIC X(1) VALUE "Y".
203900211001R12734* ***** BEGIN *****
203901211007      * RFS1117445 commenting the below 03 varaiables and moving
203902211007      * it to 01 varaible
204200211007      *    03  WS-SEG-PARMS.
204300211007      *        05 WS-PARM-ACCOUNT-NO         PIC 9(9).
204400211007      *        05 WS-PARM-CONTRACT-NO        PIC 9(9).
204500211007      *        05 WS-PARM-END-DATE           PIC 9(8).
204600211007177152*        05 WS-PARM-GUAR-DTH-RULE      PIC X(1).
204700211007      *        05 WS-PARM-ACC-CON-INV-ARRAY-DEF.
204800211007      *           10 WS-PARM-ACC-CON-INV-ARRAY OCCURS 100
204900211007      *                                     INDEXED BY WS-ACIIDX.
204901211007      *        10 WS-PARM-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES
204902211007      *           DEPENDING ON ln_InvArraySize INDEXED BY WS-ACIIDX.
205000211007      *              15 WS-PARM-ARRAY-ACCOUNT-NO
205100211007      *                                      PIC 9(9).
205200211007      *              15 WS-PARM-ARRAY-CONTRACT-NO
205300211007      *                                      PIC 9(9).
205400211007      *              15 WS-PARM-ARRAY-INVESTMENT-CODE
205500211007      *                                      PIC  X(5).
205600211007      *              15 WS-PARM-ARRAY-NET-DEP-VALUE
205700211007      *                                      PIC S9(11)V9(2) COMP-3.
205800211007      *              15 WS-PARM-ARRAY-GUAR-BASE-VALUE
205900211007      *                                      PIC S9(11)V9(2) COMP-3.
206000211007      *              15 WS-PARM-ARRAY-CURR-UNIT-BAL
206100211007      *                                      PIC S9(10)V9(3) COMP-3.
206200211007177152*              15 WS-PARM-ARRAY-GUAR-DTH-VALUE
206300211007177152*                                      PIC S9(11)V9(2) COMP-3.
206400211001R12734* *****  END  *****
206500210902R13184* ***** BEGIN *****
206600211007      *    03  WS-SEGO-PARMS.
206700211007      *        05 WS-PARMO-ACCOUNT-NO         PIC 9(9).
206800211007      *        05 WS-PARMO-CONTRACT-NO        PIC 9(9).
206900211007      *        05 WS-PARMO-END-DATE           PIC 9(8).
207000211007177152*        05 WS-PARMO-GUAR-DTH-RULE      PIC X(1).
207100211007      *        05 WS-PARMO-ACC-CON-INV-ARRAY-DEF.
207200211007      *           10 WS-PARMO-ACC-CON-INV-ARRAY OCCURS 100
207300211007      *                                     INDEXED BY WS-ACIIDXO.
207301211007      *        10 WS-PARMO-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES
207302211007      *           DEPENDING ON ln_InvArraySize INDEXED BY WS-ACIIDXO.
207400211007      *              15 WS-PARMO-ARRAY-ACCOUNT-NO
207500211007      *                                      PIC 9(9).
207600211007      *              15 WS-PARMO-ARRAY-CONTRACT-NO
207700211007      *                                      PIC 9(9).
207800211007      *              15 WS-PARMO-ARRAY-INVESTMENT-CODE
207900211007      *                                      PIC  X(5).
208000211007      *              15 WS-PARMO-ARRAY-NET-DEP-VALUE
208100211007      *                                      PIC S9(11)V9(2) COMP-3.
208200211007      *              15 WS-PARMO-ARRAY-GUAR-BASE-VALUE
208300211007      *                                      PIC S9(11)V9(2) COMP-3.
208400211007      *              15 WS-PARMO-ARRAY-CURR-UNIT-BAL
208500211007      *                                      PIC S9(10)V9(3) COMP-3.
208600211007177152*              15 WS-PARMO-ARRAY-GUAR-DTH-VALUE
208700211007177152*                                      PIC S9(11)V9(2) COMP-3.
208800210902R13184* *****  END  *****
208900210902      * RFS37906 - Begins                                              *
209000211007      *    03  WS-GVB-PARMS.
209100211007      *        05 WS-PARMG-ACCOUNT-NO         PIC 9(9).
209200211007      *        05 WS-PARMG-CONTRACT-NO        PIC 9(9).
209300211007      *        05 WS-PARMG-END-DATE           PIC 9(8).
209400211007      *        05 WS-PARMG-ACC-CON-INV-ARRAY-DEF.
209500211007      *           10 WS-PARMG-ACC-CON-INV-ARRAY OCCURS 100
209600211007      *                                     INDEXED BY WS-ACIIDXG.
209601211007      *        10 WS-PARMG-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES
209602211007      *           DEPENDING ON ln_InvArraySize INDEXED BY WS-ACIIDXG.
209700211007      *              15 WS-PARMG-ARRAY-ACCOUNT-NO
209800211007      *                                      PIC 9(9).
209900211007      *              15 WS-PARMG-ARRAY-CONTRACT-NO
210000211007      *                                      PIC 9(9).
210100211007      *              15 WS-PARMG-ARRAY-INVESTMENT-CODE
210200211007      *                                      PIC  X(5).
210300211007      *              15 WS-PARMG-ARRAY-NET-DEP-VAL
210400211007      *                                      PIC S9(11)V9(2) COMP-3.
210500211007      *              15 WS-PARMG-ARRAY-GUAR-DEATH-VAL
210600211007      *                                      PIC S9(11)V9(2) COMP-3.
210700211007      *              15 WS-PARMG-ARRAY-CURR-UNIT-BAL
210800211007      *                                      PIC S9(10)V9(3) COMP-3.
210801211007      * RFS1117445       - Ends                                        *
210900211001      * RFS37906 - Ends                                                *
211000170928R12102     03  WS-PHANTOM-FUND-PARMS.
211100170928               05 WS-PLACEMENT-DATE          PIC S9(9).
211200170928               05 WS-TRANS-NO                PIC S9(9).
211300170928R17130         05 WS-PROCESS-SEQUENCE        PIC S9(7).
211400170928  ¦            05 WS-TOTAL-ALLOC-TO-PROC     PIC S9(7).
211500170928R12102         05 WS-PHANTOM-FUND-NUMBER     PIC X(5).
211600170928R16881         05 WS-PH-MODE                 PIC X(1).
211700170928R16881         05 WS-PH-TRANS-TYPE           PIC X(3).
211800170928R17891         05 WS-DEALER-PROCESS-SEQ      PIC S9(7).
211900170928  |            05 WS-DEALER-TOTAL-AA-PROC    PIC S9(7).
212000170928  |            05 WS-INTERM-PROCESS-SEQ      PIC S9(7).
212100170928  V            05 WS-INTERM-TOTAL-AA-PROC    PIC S9(7).
212200170928R19502     03  WS-ACCOUNT-NO                 PIC S9(9) COMP-3 VALUE 0.
212300170928R19502     03  WS-INVESTOR-NO                PIC S9(9) COMP-3 VALUE 0.
212400170928R19502     03  WS-SQL-ACTUAL                 PIC S9(3) VALUE 0.
212500170928R19502     03  WS-SQL-INDEX                  PIC S9(3) VALUE 0.
212600170928R18147     03  WS-STMT-CFNM-STR-DATE         PIC S9(8) VALUE 0.
212700170928R17527     03  WS-STMT-IPS-DATE              PIC S9(8) VALUE 0.
212800170928R17527     03  WS-STMT-IPS-ACCOUNT-NO        PIC S9(9) VALUE 0.
212900170928           03  WS-DAYS-IN-MONTH-ARRAY.
213000170928               05 DI-JAN    PIC 9(2)  VALUE 31.
213100170928               05 DI-FEB    PIC 9(2)  VALUE 28.
213200170928               05 DI-MAR    PIC 9(2)  VALUE 31.
213300170928               05 DI-APR    PIC 9(2)  VALUE 30.
213400170928               05 DI-MAY    PIC 9(2)  VALUE 31.
213500170928               05 DI-JUN    PIC 9(2)  VALUE 30.
213600170928               05 DI-JUL    PIC 9(2)  VALUE 31.
213700170928               05 DI-AUG    PIC 9(2)  VALUE 31.
213800170928               05 DI-SEP    PIC 9(2)  VALUE 30.
213900170928               05 DI-OCT    PIC 9(2)  VALUE 31.
214000170928               05 DI-NOV    PIC 9(2)  VALUE 30.
214100170928               05 DI-DEC    PIC 9(2)  VALUE 31.
214200170928R14149     03  WS-SWITCH-TRANSFER-PARMS.
214300170928               05 WS-PLACEMENT-DATE-SWTR     PIC S9(9).
214400170928               05 WS-TRANS-NO-SWTR           PIC S9(9).
214500170928               05 WS-TRANS-TYPE-SWTR         PIC X(3).
214600170928               05 WS-TRANS-STATUS-SWTR       PIC X(3).
214700170928               05 WS-PLACEMENT-DATE-2-SWTR   PIC S9(9).
214800170928R14149         05 WS-TRANS-NO-2-SWTR         PIC S9(9).
214900170928R14101         05 WS-HIDDEN-FLAG             PIC X(1).
215000170928R18643     03 WS-PRICE-TRADE-DATE            PIC 9(8) VALUE 0.
215100170928R18643     03 WS-PRICE-INVESTMENT-CODE       PIC X(5) VALUE " ".
215200170928      *****
215300170928      *****    Legal Name Division.
215400170928      *****
215500170928           03  WS-LEGAL-NAME.
215600170928             05  WS-LEGAL-LNAME        PICTURE X(3).
215700170928             05  WS-FILLER             PICTURE X(32).
215800170928      *****
215900170928      *****    Investor Last Name Division.
216000170928      *****
216100170928           03  WS-LEGAL-LAST-NAME.
216200170928             05  WS-FIRST-THREE        PICTURE X(3).
216300170928             05  WS-FILLER             PICTURE X(17).
216400170928      *****
216500170928      *****    Nominee Account Type Table.
216600170928      *****
216700170928           03  WS-NOMACC-TBL.
216800170928             04  WS-NOMACC-ENT         OCCURS  50  TIMES
216900170928                                       INDEXED BY  NA.
217000170928               05  WS-NA-TYPE          PICTURE X(5).
217100170928               05  WS-NA-DESC          PICTURE X(35).
217200170928               05  WS-NA-LANG          PICTURE X(1).
217300170928           03  WS-NA-LST               PICTURE S9(3)       COMP-3.
217400170928           03  WS-NA-MAX               PICTURE S9(3)       COMP-3
217500170928                                                           VALUE 50.
217600170928      *****
217700170928      *****    Product Type Table.
217800170928      *****
217900170928           03  WS-PRDTYP-TBL.
218000170928             04  WS-PRDTYP-ENT         OCCURS  50  TIMES
218100170928                                       INDEXED BY  PT.
218200170928               05  WS-PT-CODE          PICTURE X(3).
218300170928               05  WS-PT-RULE          PICTURE X(1).
218400170928
218500170928           03  WS-PT-LST               PICTURE S9(3)       COMP-3.
218600170928           03  WS-PT-MAX               PICTURE S9(3)       COMP-3
218700170928                                                           VALUE 50.
218800170928      *****
218900170928      *****    Reversal Reason Table.
219000170928      *****
219100170928           03  WS-RVSRSN-TBL.
219200170928             04  WS-RVSRSN-ENT         OCCURS  50  TIMES
219300170928                                       INDEXED BY  RR.
219400170928               05  WS-RR-CODE          PICTURE X(4).
219500170928               05  WS-RR-DESC          PICTURE X(25).
219600170928R16913         05  WS-RR-RULE          PICTURE X(1).
219700170928           03  WS-RR-LST               PICTURE S9(3)       COMP-3.
219800170928           03  WS-RR-MAX               PICTURE S9(3)       COMP-3
219900170928                                                           VALUE 50.
220000170928      *****
220100170928      *****    Switches.
220200170928      *****
220300170928           03  WS-ACCINT-SW            PICTURE X(1).
220400170928           03  WS-BKVAL-SW             PICTURE X(1).
220500170928           03  WS-IDRSTR-SW            PICTURE X(1).
220600170928           03  WS-INVAUC-SW            PICTURE X(1).
220700170928           03  WS-INVAUCACC-SW         PICTURE X(1).
220800170928           03  WS-INVAUCCDN-SW         PICTURE X(1).
220900170928           03  WS-INVAUCUSD-SW         PICTURE X(1).
221000170928           03  WS-LR2BYP-SW            PICTURE X(1).
221100170928           03  WS-LR3BYP-SW            PICTURE X(1).
221200170928           03  WS-LR4BYP-SW            PICTURE X(1).
221300170928           03  WS-LR5BYP-SW            PICTURE X(1).
221400170928           03  WS-PRTSTM-SW            PICTURE X(1).
221500170928           03  WS-TRNCHG-SW            PICTURE X(1).
221600170928      *****
221700170928      *****    Systematic Plan Info Table.
221800170928      *****
221900170928           03  WS-SYSPLN-TBL.
222000170928R30514       04  WS-SYSPLN-ENT         OCCURS 110  TIMES
222100170928                                       INDEXED BY  SP
222200170928                                                   SP2.
222300170928               05  WS-SP-CAMT          PICTURE S9(9)V9(2)  COMP-3.
222400170928               05  WS-SP-CURR          PICTURE X(3).
222500170928               05  WS-SP-FLST          PICTURE S9(3)       COMP-3.
222600170928               05  WS-SP-FREQ          PICTURE X(2).
222700170928               05  WS-SP-INST          PICTURE X(35).
222800170928               05  WS-SP-PAMT          PICTURE S9(11)V9(2) COMP-3.
222900170928               05  WS-SP-PLAN          PICTURE X(3).
223000170928               05  WS-SP-PTYP          PICTURE X(1).
223100170928               05  WS-SP-REST          PICTURE 9(8).
223200170928               05  WS-SP-SEQ           PICTURE S9(7)       COMP-3.
223300170928               05  WS-SP-SOPT          PICTURE X(1).
223400170928               05  WS-SP-STAT          PICTURE X(2).
223500170928               05  WS-SP-STOP          PICTURE 9(8).
223600170928               05  WS-SP-STRT          PICTURE 9(8).
223700170928               05  WS-SP-TAMT          PICTURE S9(9)V9(4)  COMP-3.
223800170928R30514         05  WS-SP-FNDS          OCCURS 150  TIMES
223900170928                                       INDEXED BY  SPF.
224000170928                 06  WS-SPF-AMT        PICTURE S9(9)V9(4)  COMP-3.
224100170928                 06  WS-SPF-COM        PICTURE S9(9)V9(2)  COMP-3.
224200170928                 06  WS-SPF-FND        PICTURE X(5).
224300170928R24514           06  WS-SPF-FND-NAME   PICTURE X(35).
224400200827                 06  WS-SPF-GNP        PICTURE X(1).
224500170928                 06  WS-SPF-TYP        PICTURE X(1).
224600170928186053         05  WS-SP-USE-WDH       PICTURE X(1).
224700170928           03  WS-SP-LST               PICTURE S9(3)       COMP-3.
224800170928           03  WS-SP-MAX               PICTURE S9(3)       COMP-3
224900170928R30514                                                     VALUE 110.
225000170928           03  WS-SPF-MAX              PICTURE S9(3)       COMP-3
225100170928                                                           VALUE 500.
225200170928      *****
225300170928      *****    Transaction Type Table.
225400170928      *****
225500170928           03  WS-TRNTYP-TBL.
225600170928RF7729       04  WS-TRNTYP-ENT         OCCURS 900  TIMES
225700170928                                       INDEXED BY  TT.
225800170928               05  WS-TT-CODE          PICTURE X(3).
225900170928               05  WS-TT-STAT          PICTURE X(3).
226000170928               05  WS-TT-LANG          PICTURE X(1).
226100170928r12865         05  WS-TT-ORIGIN-CODE   PICTURE X(3).
226200170928               05  WS-TT-DESC          PICTURE X(25).
226300170928           03  WS-TT-LST               PICTURE S9(3)       COMP-3.
226400170928RF7467     03  WS-TT-MAX               PICTURE S9(3)       COMP-3
226500170928R17586                                                     VALUE 900.
226600170928RF5148*****
226700170928      *****    ROR Period Description Table.
226800170928      *****
226900170928RF5148     03  WS-ROR-TBL.
227000170928               04  WS-ROR-ENT           OCCURS 50   TIMES
227100170928                                        INDEXED BY  ROT.
227200170928                  05  WS-PERIOD-CODE    PICTURE X(5).
227300170928                  05  WS-PERIOD-DESC    OCCURS 2    TIMES
227400170928                                        INDEXED BY ROTL
227500170928                                        PICTURE X(25).
227600170928           03  WS-ROT-LST               PICTURE S9(3)      COMP-3.
227700170928           03  WS-ROT-MAX               PICTURE S9(3)      COMP-3
227800170928RF5148                                                     VALUE 50.
227900170928RF5148*****
228000170928      *****    ROR Period Codes Table. It would be populated after
228100170928      *****    RORCALC was called.
228200170928      *****
228300170928RF5148     03  WS-ROR-CODE-TBL.
228400170928               04  WS-ROR-CODE-ENT      OCCURS 20   TIMES
228500170928                                        INDEXED BY  ROCT.
228600170928                  05  WS-PERIOD-CCODE   PICTURE X(5).
228700170928                  05  WS-PERIOD-CROR    PICTURE S9(8)V9(5).
228800170928                  05  WS-PERIOD-CDESC   PICTURE X(25).
228900170928                  05  WS-PERIOD-CSIGN   PICTURE X(1).
229000170928           03  WS-ROCT-LST              PICTURE S9(3)      COMP-3.
229100170928           03  WS-ROCT-MAX              PICTURE S9(3)      COMP-3
229200170928RF5148                                                     VALUE 20.
229300170928R12734     03  WS-FIRST-PASS-FLAG       PICTURE X(1).
229400170928R12734         88 FIRST-PASS            VALUE "Y".
229500170928R13184     03  WS-FIRST-PASSO-FLAG      PICTURE X(1).
229600170928R13184         88 FIRST-PASSO           VALUE "Y".
229700190919      * RFS37906 - Begins                                              *
229800170928           03  WS-FIRST-PASSG-FLAG      PICTURE X(1).
229900190806               88 FIRST-PASSG           VALUE "Y".
230000190806      * RFS37906 - Ends                                                *
230100190806      * RFS1015600 - Begin
230200190806      *  Variables to check if there is only 1 transaction for the
230300190806      *  account investment.
230400190806           03  WS-END-DTE-STMT            PICTURE S9(8) VALUE 0.
230500190806           03  WS-STR-DTE-STMT            PICTURE S9(8) VALUE 0.
230600190806           03  WS-ACCOUNT-NO-SUM          PICTURE S9(9) VALUE 0.
230700190806           03  WS-INVEST-CODE-SUM         PICTURE X(5) VALUE " ".
230800190806           03  WS-ACC-INV-CLSUNIT-BAL-SUM PICTURE S9(15)V9(3) VALUE 0.
230900190806           03  WS-UNIT-AMT-SUM            PICTURE S9(15)V9(3) VALUE 0.
231000190806           03  WS-UNIT-PRC-SUM            PICTURE S9(11)V9(4) VALUE 0.
231100190806           03  WS-RES-AVG-UNIT-COST-SUM   PICTURE S9(11)V9(4) VALUE 0.
231200190806           03  WS-GRS-AMT-SUM             PICTURE S9(15)V9(2) VALUE 0.
231300190806           03  WS-NET-AMT-SUM             PICTURE S9(15)V9(2) VALUE 0.
231400190806           03  WS-SUM-CNT                 PICTURE S9(9) VALUE 0.
231500191128           03  WS-SUM-CNT-STR             PICTURE S9(9) VALUE 0.
231600191128      *RFS1015600 - End
231700191128      *RFS1020558-Starts
231800190806           03 WS-UNIT-PRICE               PICTURE S9(5)V9(4).
231900170928      *RFS1020558-Ends
232000170928
232100170928      /
232200170928       01  WS-READ-SWITCHES.
232300170928           05 WS-ACCT-NEXT              PIC X VALUE "Y".
232400170928           05 WS-ACI-START              PIC X VALUE "N".
232500170928           05 WS-SPOUSE-FOUND           PIC X VALUE "N".
232600170928           05 WS-TXNS-IN-RANGE          PIC X VALUE "N".
232700170928           05 WS-WRITE-INVESTMENT-LEVEL PIC X VALUE "N".
232800170928156507     05 WS-WRITE-INVEST-SEC79     PIC X VALUE "N".
232900170928           05 WS-WRITE-ACCOUNT-LEVEL    PIC X VALUE "N".
233000170928           05 WS-WRITE-INVESTOR-LEVEL   PIC X VALUE "N".
233100170928       01  WS-RESP-DETAIL-SECTION.
233200170928           05 WS-RESP-84                PIC X VALUE "N".
233300170928       01  WS-MISC-FIELDS.
233400170928R30514     05 WS-FOREIGN-CONTENT-LIMIT PIC 9(3).
233500170928           05 WS-DELIVERY-PRINTED   PIC X VALUE "N".
233600170928              88 DELIVERY-PRINTED  VALUE "Y".
233700170928           05 WS-BRANCH-ADDR5         PIC X(40).
233800170928           05 WS-DEALER-PHONE-NO.
233900170928              10  WS-DEALER-AREA      PIC 9(3).
234000170928              10  WS-DEALER-PHONE     PIC 9(7).
234100170928           05 WS-INSTITUTION-BRANCH-NO.
234200170928              10  WS-BRANCH-AREA      PIC 9(3).
234300170928              10  WS-BRANCH-PHONE     PIC 9(7).
234400170928           05 WS-DEALER-FAX-NO.
234500170928              10 WS-DEALER-FAX-AREA    PIC 9(3).
234600170928              10 WS-DEALER-FAX-PHONE   PIC 9(7).
234700170928           05 WS-ACCOUNT-TYPE          PIC X(60).
234800170928           05 WS-CURR-UNIT-BAL         PIC S9(11)V999 VALUE 0.
234900170928           05 WS-PRV-CLOSING-UNIT-BAL  PIC S9(11)V999 VALUE 0.
235000170928           05 WS-TEMP-CLOSING-UNIT-BAL PIC S9(11)V999 VALUE 0.
235100200928           05 WS-AUG-UNIT-BAL          PIC S9(11)V999 VALUE 0.
235200200928           05 WS-MARKET-START          PIC S9(11)V99  VALUE 0.
235300200928      *RFS1104542 Starts *
235400210105           05 WS-MARKET-START-EX       PIC S9(11)V99  VALUE 0.
235500210105      *RFS1104542 Ends   *
235600210105      *RFS186446 Starts *
235700210105           05 WS-AT-ACCOUNT-NO         PIC S9(9).
235800170928           05 WS-AT-TRADE-DTE          PIC S9(8).
235900170928      *RFS186446 Ends *
236000170928           05 WS-OPENING-PRICE         PIC S9(5)V9(4).
236100170928           05 WS-ACCT-MARKET-START     PIC S9(11)V99  VALUE 0.
236200170928           05 WS-MKT-CHANGE-INCEPT     PIC S9(11)V99  VALUE 0.
236300170928           05 WS-MKT-CHANGE-CURRENT    PIC S9(11)V99  VALUE 0.
236400170928           05 WS-LAST-ACB-PRICE        PIC S9(5)V9999 VALUE 0.
236500170928156507     05 WS-LAST-ACB-PRICE-S79    PIC S9(5)V9999 VALUE 0.
236600170928           05 WS-AUG-ACB-PRICE         PIC S9(4)V9999 VALUE 0.
236700170928           05 WS-BOOK-VALUE-PRIOR      PIC S9(11)V99   VALUE 0.
236800170928           05 WS-AUG-BOOK-VALUE        PIC S9(11)V99  VALUE 0.
236900170928           05 WS-IVR-TOTAL-VALUE       PIC S9(11)V99  VALUE 0.
237000170928RF8276     05 WS-IVR-BKVAL-CDN-TOT     PIC S9(11)V99  VALUE 0.
237100170928           05 WS-IVR-BKVAL-FGN-TOT     PIC S9(11)V99  VALUE 0.
237200170928           05 WS-IVR-MKTVAL-CHGINC-TOT PIC S9(11)V99  VALUE 0.
237300170928           05 WS-IVR-MKTVAL-CHGCUR-TOT PIC S9(9)V99  VALUE 0.
237400170928           05 WS-IVR-1ST-60            PIC S9(11)V99  VALUE 0.
237500170928           05 WS-IVR-REMAINDER         PIC S9(11)V99  VALUE 0.
237600170928           05 WS-IVR-1ST-60-EX         PIC S9(11)V99  VALUE 0.
237700170928           05 WS-IVR-REMAINDER-EX      PIC S9(11)V99  VALUE 0.
237800170928           05 WS-IVR-WITHDRAWALS       PIC S9(11)V99  VALUE 0.
237900170928           05 WS-REMAINDER             PIC S9(11)V99  VALUE 0.
238000170928           05 WS-REMAINDER-EX          PIC S9(11)V99  VALUE 0.
238100170928           05 WS-1ST-60                PIC S9(11)V99  VALUE 0.
238200170928           05 WS-1ST-60-EX             PIC S9(11)V99  VALUE 0.
238300170928           05 WS-WITHDRAWALS           PIC S9(11)V99  VALUE 0.
238400170928           05 WS-TOTAL-VALUE           PIC S9(11)V99  VALUE 0.
238500170928RF6234     05 WS-IUP-OPENING-PRICE     PIC S9(5)V9(4).
238600170928           05 WS-IUP-DATE              PIC 9(8).
238700170928           05 WS-IUP-CLOSING-PRICE     PIC S9(5)V9(4).
238800170928           05 WS-IUP-LASTYEND-PRICE    PIC S9(5)V9(4).
238900170928R17527     05 WS-NO-OF-UNITS-CURR      PIC S9(9)V9(3).
239000170928R17527     05 WS-NET-AMOUNT-CURR       PIC S9(11)V9(2).
239100170928R22370     05 WS-SPOT-EXCHANGE-RATE    PIC S9(2)V9(7).
239200170928156507     05 WS-KEY-INFO-FILL         PIC X(01).
239300170928       01  WS-INVESTOR-TOTALS.
239400170928           05 WS-IVR-PUR-INCEPT       PIC S9(11)V99  VALUE 0.
239500170928           05 WS-IVR-RED-INCEPT       PIC S9(11)V99  VALUE 0.
239600170928           05 WS-IVR-CPG-INCEPT       PIC S9(11)V99  VALUE 0.
239700170928           05 WS-IVR-INC-INCEPT       PIC S9(11)V99  VALUE 0.
239800170928           05 WS-IVR-INT-INCEPT       PIC S9(11)V99  VALUE 0.
239900170928           05 WS-IVR-TRI-INCEPT       PIC S9(11)V99  VALUE 0.
240000170928RF7777     05 WS-IVR-SWI-INCEPT       PIC S9(11)V99  VALUE 0.
240100170928           05 WS-IVR-TRO-INCEPT       PIC S9(11)V99  VALUE 0.
240200170928RF7777     05 WS-IVR-SWO-INCEPT       PIC S9(11)V99  VALUE 0.
240300170928R14556     05 WS-IVR-TRI-INCEPT-COST  PIC S9(11)V99  VALUE 0.
240400170928R14556     05 WS-IVR-TRO-INCEPT-COST  PIC S9(11)V99  VALUE 0.
240500170928R16256     05 WS-IVR-TRI-INCEPT-MKT   PIC S9(11)V99 VALUE 0.
240600170928R16256     05 WS-IVR-TRO-INCEPT-MKT   PIC S9(11)V99 VALUE 0.
240700170928R15022     05 WS-IVR-DISP-GAIN-LOSS-CUR     PIC S9(11)V9999  VALUE 0.
240800170928R15022     05 WS-IVR-DISP-GAIN-LOSS-YTD     PIC S9(11)V9999  VALUE 0.
240900170928R15022     05 WS-IVR-DISP-GAIN-LOSS-INC     PIC S9(11)V9999  VALUE 0.
241000170928           05 WS-IVR-PUR-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241100170928           05 WS-IVR-RED-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241200170928           05 WS-IVR-CPG-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241300170928           05 WS-IVR-INC-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241400170928           05 WS-IVR-INT-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241500170928           05 WS-IVR-TRI-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241600170928RF7777     05 WS-IVR-SWI-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241700170928           05 WS-IVR-TRO-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241800170928RF7777     05 WS-IVR-SWO-INCEPT-EX    PIC S9(11)V99  VALUE 0.
241900170928R16990     05 WS-IVR-NET-ADD-CURRENT       PIC S9(11)V99  VALUE 0.
242000170928  ¦        05 WS-IVR-NET-WITHDRAW-CURRENT  PIC S9(11)V99  VALUE 0.
242100170928  ¦        05 WS-IVR-DISTRIBUTION-CURRENT  PIC S9(11)V99  VALUE 0.
242200170928  V        05 WS-IVR-UNREAL-GAIN-LOSS-CURR PIC S9(11)V99  VALUE 0.
242300170928R16990     05 WS-IVR-NET-INV-CAPTAL-INCEPT PIC S9(11)V99  VALUE 0.
242400170928R16881     05 WS-IVR-TRI-INCEPT-PH         PIC S9(11)V99  VALUE 0.
242500170928  ¦        05 WS-IVR-TRI-YTD-PH            PIC S9(11)V99  VALUE 0.
242600170928  ¦        05 WS-IVR-TRI-CUR-PH            PIC S9(11)V99  VALUE 0.
242700170928  ¦        05 WS-IVR-TRO-INCEPT-PH         PIC S9(11)V99  VALUE 0.
242800170928  ¦        05 WS-IVR-TRO-YTD-PH            PIC S9(11)V99  VALUE 0.
242900170928  ¦        05 WS-IVR-TRO-CUR-PH            PIC S9(11)V99  VALUE 0.
243000170928  ¦        05 WS-IVR-TRI-INCEPT-PH-EX      PIC S9(11)V99  VALUE 0.
243100170928  ¦        05 WS-IVR-TRI-YTD-PH-EX         PIC S9(11)V99  VALUE 0.
243200170928  ¦        05 WS-IVR-TRI-CUR-PH-EX         PIC S9(11)V99  VALUE 0.
243300170928  ¦        05 WS-IVR-TRO-INCEPT-PH-EX      PIC S9(11)V99  VALUE 0.
243400170928  v        05 WS-IVR-TRO-YTD-PH-EX         PIC S9(11)V99  VALUE 0.
243500170928R16881     05 WS-IVR-TRO-CUR-PH-EX         PIC S9(11)V99  VALUE 0.
243600170928RF8633     05 WS-IVR-TRI-YTD-EX       PIC S9(11)V99 VALUE 0.
243700170928RF8633     05 WS-IVR-SWI-YTD-EX       PIC S9(11)V99 VALUE 0.
243800170928RF8633     05 WS-IVR-TRO-YTD-EX       PIC S9(11)V99 VALUE 0.
243900170928RF8633     05 WS-IVR-SWO-YTD-EX       PIC S9(11)V99 VALUE 0.
244000170928R14556     05 WS-IVR-TRI-INCEPT-COST-EX  PIC S9(11)V99  VALUE 0.
244100170928R14556     05 WS-IVR-TRO-INCEPT-COST-EX  PIC S9(11)V99  VALUE 0.
244200170928R16256     05 WS-IVR-TRI-INCEPT-MKT-EX   PIC S9(11)V99  VALUE 0.
244300170928R16256     05 WS-IVR-TRO-INCEPT-MKT-EX   PIC S9(11)V99  VALUE 0.
244400170928R15022     05 WS-IVR-DISP-GAIN-LOSS-CUR-EX    PIC S9(11)V9999  VALUE 0.
244500170928R15022     05 WS-IVR-DISP-GAIN-LOSS-YTD-EX    PIC S9(11)V9999  VALUE 0.
244600170928R15022     05 WS-IVR-DISP-GAIN-LOSS-INC-EX    PIC S9(11)V9999  VALUE 0.
244700170928           05 WS-IVR-PUR-CURRENT-EX    PIC S9(11)V99  VALUE 0.
244800170928           05 WS-IVR-RED-CURRENT-EX    PIC S9(11)V99  VALUE 0.
244900170928           05 WS-IVR-CPG-CURRENT-EX    PIC S9(11)V99  VALUE 0.
245000170928           05 WS-IVR-INC-CURRENT-EX    PIC S9(11)V99  VALUE 0.
245100170928           05 WS-IVR-INT-CURRENT-EX    PIC S9(11)V99  VALUE 0.
245200170928           05 WS-IVR-TRI-CURRENT-EX    PIC S9(11)V99  VALUE 0.
245300170928           05 WS-IVR-TRO-CURRENT-EX    PIC S9(11)V99  VALUE 0.
245400170928RF8673     05 WS-IVR-SWI-CURRENT-EX    PIC S9(11)V99  VALUE 0.
245500170928           05 WS-IVR-SWO-CURRENT-EX    PIC S9(11)V99  VALUE 0.
245600170928R33331     05 ln_IvrGainLossPdout      PIC S9(11)V99  VALUE 0.
245700170928RF8633     05 WS-PROFESSIONAL-FEE-TOT.
245800170928              10 WS-PROFESSIONAL-FEE-INCEPT-TOT PIC S9(9)V99 VALUE 0.
245900170928              10 WS-PROFESSIONAL-FEE-YTD-TOT    PIC S9(9)V99 VALUE 0.
246000170928              10 WS-PROFESSIONAL-FEE-CUR-TOT    PIC S9(9)V99 VALUE 0.
246100170928RF8633     05 WS-INVESTOR-SUMMARY-SEC12-TOT.
246200170928              10  WS-IS2-INT-INCEPT-CASH-TOT    PIC S9(9)V99 VALUE 0.
246300170928              10  WS-IS2-INT-YTD-CASH-TOT       PIC S9(9)V99 VALUE 0.
246400170928              10  WS-IS2-INT-CURRENT-CASH-TOT   PIC S9(9)V99 VALUE 0.
246500170928              10  WS-IS2-INT-INCEPT-REINV-TOT   PIC S9(9)V99 VALUE 0.
246600170928              10  WS-IS2-INT-YTD-REINV-TOT      PIC S9(9)V99 VALUE 0.
246700170928              10  WS-IS2-INT-CURRENT-REINV-TOT  PIC S9(9)V99 VALUE 0.
246800170928              10  WS-IS2-CPG-INCEPT-CASH-TOT    PIC S9(9)V99 VALUE 0.
246900170928              10  WS-IS2-CPG-YTD-CASH-TOT       PIC S9(9)V99 VALUE 0.
247000170928              10  WS-IS2-CPG-CURRENT-CASH-TOT   PIC S9(9)V99 VALUE 0.
247100170928              10  WS-IS2-CPG-INCEPT-REINV-TOT   PIC S9(9)V99 VALUE 0.
247200170928              10  WS-IS2-CPG-YTD-REINV-TOT      PIC S9(9)V99 VALUE 0.
247300170928              10  WS-IS2-CPG-CURRENT-REINV-TOT  PIC S9(9)V99 VALUE 0.
247400170928              10  WS-IS2-INC-INCEPT-CASH-TOT    PIC S9(9)V99 VALUE 0.
247500170928              10  WS-IS2-INC-YTD-CASH-TOT       PIC S9(9)V99 VALUE 0.
247600170928              10  WS-IS2-INC-CURRENT-CASH-TOT   PIC S9(9)V99 VALUE 0.
247700170928              10  WS-IS2-INC-INCEPT-REINV-TOT   PIC S9(9)V99 VALUE 0.
247800170928              10  WS-IS2-INC-YTD-REINV-TOT      PIC S9(9)V99 VALUE 0.
247900170928              10  WS-IS2-INC-CURRENT-REINV-TOT  PIC S9(9)V99 VALUE 0.
248000170928R14136        10  WS-IS2-MFR-CUR-TOT            PIC S9(9)V99 VALUE 0.
248100170928  ¦           10  WS-IS2-MFR-YTD-TOT            PIC S9(9)V99 VALUE 0.
248200170928  ¦           10  WS-IS2-MFR-INCEPT-TOT         PIC S9(9)V99 VALUE 0.
248300170928  ¦           10  WS-IS2-FED-WHTAX-CUR-TOT      PIC S9(9)V99 VALUE 0.
248400170928  ¦           10  WS-IS2-FED-WHTAX-YTD-TOT      PIC S9(9)V99 VALUE 0.
248500170928  ¦           10  WS-IS2-PROV-WHTAX-CUR-TOT     PIC S9(9)V99 VALUE 0.
248600170928R14136        10  WS-IS2-PROV-WHTAX-YTD-TOT     PIC S9(9)V99 VALUE 0.
248700170928R14858        10  WS-IS2-BAJ-CUR-TOT            PIC S9(9)V99 VALUE 0.
248800170928  ¦           10  WS-IS2-BAJ-YTD-TOT            PIC S9(9)V99 VALUE 0.
248900170928  ¦           10  WS-IS2-BAJ-INCEPT-TOT         PIC S9(9)V99 VALUE 0.
249000170928  ¦           10  WS-IS2-BFW-CUR-TOT            PIC S9(9)V99 VALUE 0.
249100170928  ¦           10  WS-IS2-BFW-YTD-TOT            PIC S9(9)V99 VALUE 0.
249200170928R14858        10  WS-IS2-BFW-INCEPT-TOT         PIC S9(9)V99 VALUE 0.
249300170928R20758        10  WS-IS2-ROC-CUR-TOT            PIC S9(9)V99 VALUE 0.
249400170928  ¦           10  WS-IS2-ROC-YTD-TOT            PIC S9(9)V99 VALUE 0.
249500170928R20758        10  WS-IS2-ROC-INCEPT-TOT         PIC S9(9)V99 VALUE 0.
249600170928R18194 01 WS-ACCOUNT-TOTALS-TBLS.
249700170928   ¦      03 WS-ACCOUNT-CURRENCY-TOT-TBL.
249800170928   ¦       04 WS-ACCOUNT-CURRENCY-TOT-ENT OCCURS  50  TIMES
249900170928   ¦                              ASCENDING KEY IS  WS-INV-CUR-CODE
250000170928   ¦                              INDEXED BY  ACT
250100170928   ¦                                         ACBV.
250200170928   ¦         05 WS-INV-CUR-CODE                PIC X(3).
250300170928   ¦         05 WS-INV-CUR-DESCR               PIC X(25).
250400170928   ¦         05 WS-INVAUCCUR-SW                PIC X(1).
250500170928   ¦         05 WS-ACC-CUR-BVB                 PIC S9(11)V9(2).
250600170928   ¦         05 WS-ACC-CUR-BVF                 PIC S9(11)V9(2).
250700170928   ¦         05 WS-ACC-CUR-VALUE               PIC S9(11)V9(2).
250800170928   ¦         05 WS-ACC-CUR-BV-BASE             PIC S9(11)V9(2).
250900170928   ¦         05 WS-ACC-CUR-CPG                 PIC S9(11)V9(2).
251000170928   ¦         05 WS-ACC-CUR-MVB                 PIC S9(11)V9(2).
251100170928   ¦         05 WS-ACC-CUR-MVP                 PIC S9(11)V9(2).
251200170928   ¦         05 WS-ACC-CUR-MVBQ1               PIC S9(11)V9(2).
251300170928   ¦         05 WS-ACC-CUR-MVBQ2               PIC S9(11)V9(2).
251400170928   ¦         05 WS-ACC-CUR-MVBQ3               PIC S9(11)V9(2).
251500170928   ¦         05 WS-ACC-CUR-MVBQ4               PIC S9(11)V9(2).
251600170928   ¦
251700170928   ¦         05 WS-INV-PUR-INCEPT-TOT-CUR      PIC S9(11)V9(2).
251800170928   ¦         05 WS-INV-RED-INCEPT-TOT-CUR      PIC S9(11)V9(2).
251900170928   ¦         05 WS-INV-PUR-CURRENT-TOT-CUR     PIC S9(11)V9(2).
252000170928   ¦         05 WS-INV-RED-CURRENT-TOT-CUR     PIC S9(11)V9(2).
252100170928   ¦         05 WS-INV-SWI-CURRENT-TOT-CUR     PIC S9(11)V9(2).
252200170928   ¦         05 WS-INV-SWO-CURRENT-TOT-CUR     PIC S9(11)V9(2).
252300170928   ¦         05 WS-INV-BUY-CURRENT-TOT-CUR     PIC S9(11)V9(2).
252400170928   ¦         05 WS-INV-SEL-CURRENT-TOT-CUR     PIC S9(11)V9(2).
252500170928   ¦         05 WS-INV-BAJ-CUR-TOT-CUR         PIC S9(11)V9(2).
252600170928   ¦         05 WS-INV-BAJ-YTD-TOT-CUR         PIC S9(11)V9(2).
252700170928   ¦         05 WS-INV-BAJ-INCEPT-TOT-CUR      PIC S9(11)V9(2).
252800170928   ¦         05 WS-INV-BFW-CUR-TOT-CUR         PIC S9(11)V9(2).
252900170928   ¦         05 WS-INV-BFW-YTD-TOT-CUR         PIC S9(11)V9(2).
253000170928   ¦         05 WS-INV-BFW-INCEPT-TOT-CUR      PIC S9(11)V9(2).
253100170928   ¦         05 WS-INV-TRI-INCEPT-TOT-CUR      PIC S9(11)V9(2).
253200170928   ¦         05 WS-INV-TRI-INCEPT-COST-TOT-CUR PIC S9(11)V9(2).
253300170928   ¦         05 WS-INV-TRO-INCEPT-COST-TOT-CUR PIC S9(11)V9(2).
253400170928   ¦         05 WS-INV-TRI-INCEPT-MKT-TOT-CUR  PIC S9(11)V9(2).
253500170928   ¦         05 WS-INV-TRO-INCEPT-MKT-TOT-CUR  PIC S9(11)V9(2).
253600170928   ¦         05 WS-INV-ROC-CUR-TOT-CUR         PIC S9(11)V9(2).
253700170928   ¦         05 WS-INV-ROC-YTD-TOT-CUR         PIC S9(11)V9(2).
253800170928   ¦         05 WS-INV-ROC-INCEPT-TOT-CUR      PIC S9(11)V9(2).
253900170928   ¦         05 WS-INV-DISP-GAIN-LOSS-CUR-TCUR  PIC S9(11)V9(4).
254000170928   ¦         05 WS-INV-DISP-GAIN-LOSS-YTD-TCUR  PIC S9(11)V9(4).
254100170928   ¦         05 WS-INV-DISP-GAIN-LOSS-INC-TCUR  PIC S9(11)V9(4).
254200170928   ¦         05 WS-INV-TRO-INCEPT-TOT-CUR    PIC S9(11)V99.
254300170928   ¦         05 WS-INV-SWI-INCEPT-TOT-CUR    PIC S9(11)V99.
254400170928   ¦         05 WS-INV-SWO-INCEPT-TOT-CUR    PIC S9(11)V99.
254500170928   ¦         05 WS-INV-TRI-CURRENT-TOT-CUR   PIC S9(11)V99.
254600170928   ¦         05 WS-INV-TRO-CURRENT-TOT-CUR   PIC S9(11)V99.
254700170928   ¦         05 WS-INV-TRI-INCEPT-COST-CUR   PIC S9(11)V99.
254800170928   ¦         05 WS-INV-TRO-INCEPT-COST-CUR   PIC S9(11)V99.
254900170928   ¦         05 WS-INV-TRI-INCEPT-MKT-CUR    PIC S9(11)V99.
255000170928   ¦         05 WS-INV-TRO-INCEPT-MKT-CUR    PIC S9(11)V99.
255100170928   ¦         05 WS-INV-TRI-INCEPT-PH-CUR     PIC S9(11)V99.
255200170928   ¦         05 WS-INV-TRI-INCEPT-PH-TOT-CUR PIC S9(11)V99.
255300170928   ¦         05 WS-INV-TRI-YTD-PH-CUR        PIC S9(11)V99.
255400170928   ¦         05 WS-INV-TRI-YTD-PH-TOT-CUR    PIC S9(11)V99.
255500170928   ¦         05 WS-INV-TRI-CUR-PH-CUR        PIC S9(11)V99.
255600170928   ¦         05 WS-INV-TRI-CUR-PH-TOT-CUR    PIC S9(11)V99.
255700170928   ¦         05 WS-INV-TRO-INCEPT-PH-CUR     PIC S9(11)V99.
255800170928   ¦         05 WS-INV-TRO-INCEPT-PH-TOT-CUR PIC S9(11)V99.
255900170928   ¦         05 WS-INV-TRO-YTD-PH-CUR        PIC S9(11)V99.
256000170928   ¦         05 WS-INV-TRO-YTD-PH-TOT-CUR    PIC S9(11)V99.
256100170928   ¦         05 WS-INV-TRO-CUR-PH-CUR        PIC S9(11)V99.
256200170928   ¦         05 WS-INV-TRO-CUR-PH-TOT-CUR    PIC S9(11)V99.
256300170928   ¦         05 WS-INV-DISP-GAIN-LOSS-CUR-CUR  PIC S9(11)V99.
256400170928   ¦         05 WS-INV-DISP-GAIN-LOSS-YTD-CUR  PIC S9(11)V99.
256500170928   ¦         05 WS-INV-DISP-GAIN-LOSS-INC-CUR  PIC S9(11)V99.
256600170928   ¦         05 WS-WITHD-TOT-CUR               PIC S9(11)V9(2).
256700170928   ¦         05 WS-DEPOSIT-TOT-CUR             PIC S9(11)V9(2).
256800170928R50823       05 WS-GMA-VALUE-TOT-CUR           PIC S9(11)V9(2).
256900170928102716       05 WS-INV-CPG-YTD-TOT             PIC S9(11)V9(2).
257000170928102716       05 WS-INV-INC-YTD-TOT             PIC S9(11)V9(2).
257100170928102716       05 WS-INV-INT-YTD-TOT             PIC S9(11)V9(2).
257200170928162904       05 ln_ACC-CPG-YTF-TOT             PIC S9(11)V9(2).
257300170928
257400170928
257500170928      * RFS 139952 - begin RM
257600170928             05 Ws-Inv-Accr-Int-Tot            PIC S9(11)V9(2).
257700170928      * RFS 139952 - end   RM
257800170928   ¦      03 WS-ACCOUNT-CURRENCY-LST           PIC S9(3) COMP-3.
257900170928   ¦      03 WS-ACCOUNT-CURRENCY-MAX           PIC S9(3) COMP-3
258000170928   ¦                                                 VALUE 50.
258100170928   ¦      03 WS-ACCOUNT-CURRENCY-PERCT-TBL.
258200170928   ¦         04 WS-ACCOUNT-CURRENCY-PERCT-ENT  OCCURS  50  TIMES
258300170928   ¦                                             INDEXED BY  ACP
258400170928   ¦                                                         ACPS.
258500170928   ¦            05 WS-ACCPCT-CUR          PIC S9(3)V9(2)  COMP-3.
258600170928   v            05 WS-ACCPCT-CUR-PHN      PIC S9(3)V9(1)  COMP-3.
258700170928R18194    03 WS-ACCPCT-HOLD               PIC S9(3)V9(2)  COMP-3.
258800170928       01  WS-ACCOUNT-TOTALS.
258900170928           05 WS-ACC-CDN-VALUE             PIC S9(11)V99  VALUE 0.
259000170928           05 WS-ACC-US-VALUE              PIC S9(11)V99  VALUE 0.
259100170928R18194     05 WS-INV-MVP-TOT-CUR           PIC S9(11)V99  VALUE 0.
259200170928R18194     05 WS-INV-ACC-MVP-TOT-CUR       PIC S9(11)V99  VALUE 0.
259300170928           05 WS-ACC-VALUE                 PIC S9(11)V99  VALUE 0.
259400170928           05 WS-ACC-CDN-BV                PIC S9(11)V99  VALUE 0.
259500170928RF8359     05 WS-ACC-USD-BV                PIC S9(11)V99  VALUE 0.
259600170928           05 WS-ACC-US-BV                 PIC S9(11)V99  VALUE 0.
259700170928           05 WS-ACC-PUR-INCEPT            PIC S9(11)V99  VALUE 0.
259800170928RF5095     05 WS-ACC-PUR-INCEPT-P          PIC S9(11)V99  VALUE 0.
259900170928           05 WS-ACC-RED-INCEPT            PIC S9(11)V99  VALUE 0.
260000170928           05 WS-ACC-CPG-INCEPT            PIC S9(11)V99  VALUE 0.
260100170928           05 WS-ACC-INC-INCEPT            PIC S9(11)V99  VALUE 0.
260200170928           05 WS-ACC-INT-INCEPT            PIC S9(11)V99  VALUE 0.
260300170928           05 WS-ACC-TRI-INCEPT            PIC S9(11)V99  VALUE 0.
260400170928RF7777     05 WS-ACC-SWI-INCEPT            PIC S9(11)V99  VALUE 0.
260500170928RF5905     05 WS-ACC-TRI-INCEPT-P          PIC S9(11)V99  VALUE 0.
260600170928RF7777     05 WS-ACC-SWI-INCEPT-P          PIC S9(11)V99  VALUE 0.
260700170928           05 WS-ACC-TRO-INCEPT            PIC S9(11)V99  VALUE 0.
260800170928RF7777     05 WS-ACC-SWO-INCEPT            PIC S9(11)V99  VALUE 0.
260900170928           05 WS-ACC-PUR-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261000170928           05 WS-ACC-RED-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261100170928           05 WS-ACC-CPG-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261200170928           05 WS-ACC-INC-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261300170928           05 WS-ACC-INT-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261400170928           05 WS-ACC-TRI-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261500170928RF7777     05 WS-ACC-SWI-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261600170928           05 WS-ACC-TRO-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261700170928RF7777     05 WS-ACC-SWO-INCEPT-EX         PIC S9(11)V99  VALUE 0.
261800170928RF8633     05 WS-ACC-TRI-YTD-EX            PIC S9(11)V99 VALUE 0.
261900170928RF8633     05 WS-ACC-SWI-YTD-EX            PIC S9(11)V99 VALUE 0.
262000170928RF8633     05 WS-ACC-TRO-YTD-EX            PIC S9(11)V99 VALUE 0.
262100170928RF8633     05 WS-ACC-SWO-YTD-EX            PIC S9(11)V99 VALUE 0.
262200170928R16881     05 WS-ACC-TRI-INCEPT-PH         PIC S9(11)V99 VALUE 0.
262300170928  ¦        05 WS-ACC-TRI-YTD-PH            PIC S9(11)V99 VALUE 0.
262400170928  ¦        05 WS-ACC-TRI-CUR-PH            PIC S9(11)V99 VALUE 0.
262500170928  ¦        05 WS-ACC-TRO-INCEPT-PH         PIC S9(11)V99 VALUE 0.
262600170928  ¦        05 WS-ACC-TRO-YTD-PH            PIC S9(11)V99 VALUE 0.
262700170928  ¦        05 WS-ACC-TRO-CUR-PH            PIC S9(11)V99 VALUE 0.
262800170928  ¦        05 WS-ACC-TRI-INCEPT-PH-EX      PIC S9(11)V99 VALUE 0.
262900170928  ¦        05 WS-ACC-TRI-YTD-PH-EX         PIC S9(11)V99 VALUE 0.
263000170928  ¦        05 WS-ACC-TRI-CUR-PH-EX         PIC S9(11)V99 VALUE 0.
263100170928  ¦        05 WS-ACC-TRO-INCEPT-PH-EX      PIC S9(11)V99 VALUE 0.
263200170928  v        05 WS-ACC-TRO-YTD-PH-EX         PIC S9(11)V99 VALUE 0.
263300170928R16881     05 WS-ACC-TRO-CUR-PH-EX         PIC S9(11)V99 VALUE 0.
263400170928R18312     05 WS-ACC-BUY-CURRENT           PIC S9(11)V99  VALUE 0.
263500170928R18312     05 WS-ACC-SEL-CURRENT           PIC S9(11)V99  VALUE 0.
263600170928           05 WS-ACC-PUR-CURRENT           PIC S9(11)V99  VALUE 0.
263700170928           05 WS-ACC-RED-CURRENT           PIC S9(11)V99  VALUE 0.
263800170928           05 WS-ACC-CPG-CURRENT           PIC S9(11)V99  VALUE 0.
263900170928           05 WS-ACC-INC-CURRENT           PIC S9(11)V99  VALUE 0.
264000170928           05 WS-ACC-INT-CURRENT           PIC S9(11)V99  VALUE 0.
264100170928164158     05 WS-ACC-CPG-CUR-CAD           PIC S9(11)V99  VALUE 0.
264200170928164158     05 WS-ACC-INC-CUR-CAD           PIC S9(11)V99  VALUE 0.
264300170928164158     05 WS-ACC-INT-CUR-CAD           PIC S9(11)V99  VALUE 0.
264400170928164158     05 WS-ACC-CPG-CUR-NCAD          PIC S9(11)V99  VALUE 0.
264500170928164158     05 WS-ACC-INC-CUR-NCAD          PIC S9(11)V99  VALUE 0.
264600170928164158     05 WS-ACC-INT-CUR-NCAD          PIC S9(11)V99  VALUE 0.
264700170928164158     05 WS-ACC-DIVS-CUR-CAD-TOT      PIC S9(11)V99  VALUE 0.
264800170928164158     05 WS-ACC-DIVS-CUR-NCAD-TOT     PIC S9(11)V99  VALUE 0.
264900170928164158     05 WS-ACC-DIVS-CURRENT-EX       PIC S9(11)V99  VALUE 0.
265000170928164313     05 WS-ACC-CPG-INCEP-CAD         PIC S9(11)V99  VALUE 0.
265100170928164313     05 WS-ACC-INC-INCEP-CAD         PIC S9(11)V99  VALUE 0.
265200170928164313     05 WS-ACC-INT-INCEP-CAD         PIC S9(11)V99  VALUE 0.
265300170928164313     05 WS-ACC-CPG-INCEP-NCAD        PIC S9(11)V99  VALUE 0.
265400170928164313     05 WS-ACC-INC-INCEP-NCAD        PIC S9(11)V99  VALUE 0.
265500170928164313     05 WS-ACC-INT-INCEP-NCAD        PIC S9(11)V99  VALUE 0.
265600170928164313     05 WS-ACC-DIVS-INCEP-CAD-TOT    PIC S9(11)V99  VALUE 0.
265700170928164313     05 WS-ACC-DIVS-INCEP-NCAD-TOT   PIC S9(11)V99  VALUE 0.
265800170928164313     05 WS-ACC-DIVS-INCEPT-EX        PIC S9(11)V99  VALUE 0.
265900170928           05 WS-ACC-TRI-CURRENT           PIC S9(11)V99  VALUE 0.
266000170928           05 WS-ACC-TRO-CURRENT           PIC S9(11)V99  VALUE 0.
266100170928RF8673     05 WS-ACC-SWI-CURRENT           PIC S9(11)V99  VALUE 0.
266200170928           05 WS-ACC-SWO-CURRENT           PIC S9(11)V99  VALUE 0.
266300170928R14556     05 WS-ACC-TRI-INCEPT-COST       PIC S9(11)V99  VALUE 0.
266400170928R14556     05 WS-ACC-TRO-INCEPT-COST       PIC S9(11)V99  VALUE 0.
266500170928R16256     05 WS-ACC-TRI-INCEPT-MKT        PIC S9(11)V99  VALUE 0.
266600170928R16256     05 WS-ACC-TRO-INCEPT-MKT        PIC S9(11)V99  VALUE 0.
266700170928R15022     05 WS-ACC-DISP-GAIN-LOSS-CUR    PIC S9(11)V9999  VALUE 0.
266800170928R15022     05 WS-ACC-DISP-GAIN-LOSS-YTD    PIC S9(11)V9999  VALUE 0.
266900170928R15022     05 WS-ACC-DISP-GAIN-LOSS-INC    PIC S9(11)V9999  VALUE 0.
267000170928R14858     05 WS-ACC-BAJ-CUR               PIC S9(11)V99 VALUE 0.
267100170928  ¦        05 WS-ACC-BAJ-YTD               PIC S9(11)V99 VALUE 0.
267200170928  ¦        05 WS-ACC-BAJ-INCEPT            PIC S9(11)V99 VALUE 0.
267300170928  ¦        05 WS-ACC-BFW-CUR               PIC S9(11)V99 VALUE 0.
267400170928  ¦        05 WS-ACC-BFW-YTD               PIC S9(11)V99 VALUE 0.
267500170928R14858     05 WS-ACC-BFW-INCEPT            PIC S9(11)V99 VALUE 0.
267600170928R20758     05 WS-ACC-ROC-CUR               PIC S9(11)V99 VALUE 0.
267700170928  ¦        05 WS-ACC-ROC-YTD               PIC S9(11)V99 VALUE 0.
267800170928R20758     05 WS-ACC-ROC-INCEPT            PIC S9(11)V99 VALUE 0.
267900170928R28931     05 WS-ACC-PURCH-LAST-12-MONTHS  PIC S9(11)V99 VALUE 0.
268000170928  ¦        05 WS-ACC-REDEM-LAST-12-MONTHS  PIC S9(11)V99 VALUE 0.
268100170928  ¦        05 WS-ACC-TRI-LAST-12-MONTHS    PIC S9(11)V99 VALUE 0.
268200170928R28931     05 WS-ACC-TRO-LAST-12-MONTHS    PIC S9(11)V99 VALUE 0.
268300170928      *RFS36342 - Starts
268400170928           05 ln_AccCurrDispProceedsBase   PIC S9(11)V99 VALUE 0.
268500170928           05 ln_AccCurrDispBookValueBase  PIC S9(11)V99 VALUE 0.
268600170928           05 ln_AccCurrDispGainLossBase   PIC S9(11)V99 VALUE 0.
268700170928           05 ln_AccGrossSoldYtdBase       PIC S9(11)V99 VALUE 0.
268800170928           05 ln_AccGrossSoldCurrBase      PIC S9(11)V99 VALUE 0.
268900170928           05 ln_AccDeductionsCdscYtdBase  PIC S9(11)V99 VALUE 0.
269000170928           05 ln_AccDeductionsCdscCurrBase PIC S9(11)V99 VALUE 0.
269100170928      *RFS36342 - Ends
269200170928           05 WS-ACC-PUR-CURRENT-EX        PIC S9(11)V99  VALUE 0.
269300170928           05 WS-ACC-RED-CURRENT-EX        PIC S9(11)V99  VALUE 0.
269400170928           05 WS-ACC-CPG-CURRENT-EX        PIC S9(11)V99  VALUE 0.
269500170928           05 WS-ACC-INC-CURRENT-EX        PIC S9(11)V99  VALUE 0.
269600170928           05 WS-ACC-INT-CURRENT-EX        PIC S9(11)V99  VALUE 0.
269700170928           05 WS-ACC-TRI-CURRENT-EX        PIC S9(11)V99  VALUE 0.
269800170928           05 WS-ACC-TRO-CURRENT-EX        PIC S9(11)V99  VALUE 0.
269900170928RF8673     05 WS-ACC-SWI-CURRENT-EX        PIC S9(11)V99  VALUE 0.
270000170928           05 WS-ACC-SWO-CURRENT-EX        PIC S9(11)V99  VALUE 0.
270100170928R33331     05 ln_AccGainLossPdout          PIC S9(11)V99  VALUE 0.
270200170928R16990     05 WS-ACC-NET-ADD-CURRENT       PIC S9(11)V99  VALUE 0.
270300170928  ¦        05 WS-ACC-NET-WITHDRAW-CURRENT  PIC S9(11)V99  VALUE 0.
270400170928  ¦        05 WS-ACC-DISTRIBUTION-CURRENT  PIC S9(11)V99  VALUE 0.
270500170928  V        05 WS-ACC-UNREAL-GAIN-LOSS-CURR PIC S9(11)V99  VALUE 0.
270600170928R16990     05 WS-ACC-NET-INV-CAPTAL-INCEPT PIC S9(11)V99  VALUE 0.
270700170928R14556     05 WS-ACC-TRI-INCEPT-COST-EX    PIC S9(11)V99  VALUE 0.
270800170928R14556     05 WS-ACC-TRO-INCEPT-COST-EX    PIC S9(11)V99  VALUE 0.
270900170928R16256     05 WS-ACC-TRI-INCEPT-MKT-EX     PIC S9(11)V99  VALUE 0.
271000170928R16256     05 WS-ACC-TRO-INCEPT-MKT-EX     PIC S9(11)V99  VALUE 0.
271100170928R15022     05 WS-ACC-DISP-GAIN-LOSS-CUR-EX PIC S9(11)V9999  VALUE 0.
271200170928R15022     05 WS-ACC-DISP-GAIN-LOSS-YTD-EX PIC S9(11)V9999  VALUE 0.
271300170928R15022     05 WS-ACC-DISP-GAIN-LOSS-INC-EX PIC S9(11)V9999  VALUE 0.
271400170928000104     05 WS-INV-PUR-INCEPT-TOT-CAD    PIC S9(11)V99  VALUE 0.
271500170928           05 WS-INV-PUR-INCEPT-TOT-USD    PIC S9(11)V99  VALUE 0.
271600170928R18312     05 WS-INV-SWO-CURRENT-TOT-CAD   PIC S9(11)V99  VALUE 0.
271700170928  ¦        05 WS-INV-SWO-CURRENT-TOT-USD   PIC S9(11)V99  VALUE 0.
271800170928  ¦        05 WS-INV-SWI-CURRENT-TOT-CAD   PIC S9(11)V99  VALUE 0.
271900170928  ¦        05 WS-INV-SWI-CURRENT-TOT-USD   PIC S9(11)V99  VALUE 0.
272000170928  ¦        05 WS-INV-BUY-CURRENT-TOT-CAD   PIC S9(11)V99  VALUE 0.
272100170928  ¦        05 WS-INV-BUY-CURRENT-TOT-USD   PIC S9(11)V99  VALUE 0.
272200170928  ¦        05 WS-INV-SEL-CURRENT-TOT-CAD   PIC S9(11)V99  VALUE 0.
272300170928R18312     05 WS-INV-SEL-CURRENT-TOT-USD   PIC S9(11)V99  VALUE 0.
272400170928           05 WS-INV-PUR-CURRENT-TOT-CAD   PIC S9(11)V99  VALUE 0.
272500170928           05 WS-INV-PUR-CURRENT-TOT-USD   PIC S9(11)V99  VALUE 0.
272600170928           05 WS-INV-RED-INCEPT-TOT-CAD    PIC S9(11)V99  VALUE 0.
272700170928           05 WS-INV-RED-INCEPT-TOT-USD    PIC S9(11)V99  VALUE 0.
272800170928           05 WS-INV-RED-CURRENT-TOT-CAD   PIC S9(11)V99  VALUE 0.
272900170928           05 WS-INV-RED-CURRENT-TOT-USD   PIC S9(11)V99  VALUE 0.
273000170928R14858     05 WS-INV-BAJ-CUR-TOT-CAD       PIC S9(11)V99  VALUE 0.
273100170928  ¦        05 WS-INV-BAJ-CUR-TOT-USD       PIC S9(11)V99  VALUE 0.
273200170928  ¦        05 WS-INV-BAJ-YTD-TOT-CAD       PIC S9(11)V99  VALUE 0.
273300170928  ¦        05 WS-INV-BAJ-YTD-TOT-USD       PIC S9(11)V99  VALUE 0.
273400170928  ¦        05 WS-INV-BAJ-INCEPT-TOT-CAD    PIC S9(11)V99  VALUE 0.
273500170928  ¦        05 WS-INV-BAJ-INCEPT-TOT-USD    PIC S9(11)V99  VALUE 0.
273600170928  ¦        05 WS-INV-BFW-CUR-TOT-CAD       PIC S9(11)V99  VALUE 0.
273700170928  ¦        05 WS-INV-BFW-CUR-TOT-USD       PIC S9(11)V99  VALUE 0.
273800170928  ¦        05 WS-INV-BFW-YTD-TOT-CAD       PIC S9(11)V99  VALUE 0.
273900170928  ¦        05 WS-INV-BFW-YTD-TOT-USD       PIC S9(11)V99  VALUE 0.
274000170928  ¦        05 WS-INV-BFW-INCEPT-TOT-CAD    PIC S9(11)V99  VALUE 0.
274100170928414858     05 WS-INV-BFW-INCEPT-TOT-USD    PIC S9(11)V99  VALUE 0.
274200170928R20758     05 WS-INV-ROC-CUR-TOT-CAD           PIC S9(11)V9999 VALUE 0.
274300170928  ¦        05 WS-INV-ROC-CUR-TOT-USD           PIC S9(11)V9999 VALUE 0.
274400170928  ¦        05 WS-INV-ROC-YTD-TOT-CAD           PIC S9(11)V9999 VALUE 0.
274500170928  ¦        05 WS-INV-ROC-YTD-TOT-USD           PIC S9(11)V9999 VALUE 0.
274600170928  ¦        05 WS-INV-ROC-INCEPT-TOT-CAD        PIC S9(11)V9999 VALUE 0.
274700170928R20758     05 WS-INV-ROC-INCEPT-TOT-USD        PIC S9(11)V9999 VALUE 0.
274800170928           05 WS-INV-TRI-INCEPT-TOT-CAD    PIC S9(11)V99  VALUE 0.
274900170928R14556     05 WS-INV-TRI-INCEPT-COST-TOT-CAD PIC S9(11)V99  VALUE 0.
275000170928R14556     05 WS-INV-TRI-INCEPT-COST-TOT-USD PIC S9(11)V99  VALUE 0.
275100170928R14556     05 WS-INV-TRO-INCEPT-COST-TOT-CAD PIC S9(11)V99  VALUE 0.
275200170928R14556     05 WS-INV-TRO-INCEPT-COST-TOT-USD PIC S9(11)V99  VALUE 0.
275300170928R16256     05 WS-INV-TRI-INCEPT-MKT-TOT-CAD  PIC S9(11)V99  VALUE 0.
275400170928   ¦       05 WS-INV-TRI-INCEPT-MKT-TOT-USD  PIC S9(11)V99  VALUE 0.
275500170928   ¦       05 WS-INV-TRO-INCEPT-MKT-TOT-CAD  PIC S9(11)V99  VALUE 0.
275600170928R16256     05 WS-INV-TRO-INCEPT-MKT-TOT-USD  PIC S9(11)V99  VALUE 0.
275700170928R15022     05 WS-INV-DISP-GAIN-LOSS-CUR-T-CD   PIC S9(11)V9999 VALUE 0.
275800170928R15022     05 WS-INV-DISP-GAIN-LOSS-CUR-T-US   PIC S9(11)V9999 VALUE 0.
275900170928R15022     05 WS-INV-DISP-GAIN-LOSS-YTD-T-CD   PIC S9(11)V9999 VALUE 0.
276000170928R15022     05 WS-INV-DISP-GAIN-LOSS-YTD-T-US   PIC S9(11)V9999 VALUE 0.
276100170928R15022     05 WS-INV-DISP-GAIN-LOSS-INC-T-CD   PIC S9(11)V9999 VALUE 0.
276200170928R15022     05 WS-INV-DISP-GAIN-LOSS-INC-T-US   PIC S9(11)V9999 VALUE 0.
276300170928           05 WS-INV-TRI-INCEPT-TOT-USD    PIC S9(11)V99  VALUE 0.
276400170928r10533     05 WS-INV-TRO-INCEPT-TOT-CAD    PIC S9(11)V99  VALUE 0.
276500170928           05 WS-INV-TRO-INCEPT-TOT-USD    PIC S9(11)V99  VALUE 0.
276600170928           05 WS-INV-TRI-CURRENT-TOT-CAD   PIC S9(11)V99  VALUE 0.
276700170928           05 WS-INV-TRI-CURRENT-TOT-USD   PIC S9(11)V99  VALUE 0.
276800170928r10533     05 WS-INV-TRO-CURRENT-TOT-CAD   PIC S9(11)V99  VALUE 0.
276900170928           05 WS-INV-TRO-CURRENT-TOT-USD   PIC S9(11)V99  VALUE 0.
277000170928           05 WS-INV-SWI-INCEPT-TOT-CAD    PIC S9(11)V99  VALUE 0.
277100170928           05 WS-INV-SWI-INCEPT-TOT-USD    PIC S9(11)V99  VALUE 0.
277200170928           05 WS-INV-SWO-INCEPT-TOT-CAD    PIC S9(11)V99  VALUE 0.
277300170928           05 WS-INV-SWO-INCEPT-TOT-USD    PIC S9(11)V99  VALUE 0.
277400170928000105     05 WS-INV-ACC-MVP-TOT-CAD       PIC S9(11)V99  VALUE 0.
277500170928           05 WS-INV-ACC-MVP-TOT-USD       PIC S9(11)V99  VALUE 0.
277600170928000105     05 WS-INV-MVP-TOT-CAD           PIC S9(11)V99  VALUE 0.
277700170928           05 WS-INV-MVP-TOT-USD           PIC S9(11)V99  VALUE 0.
277800170928R14556     05 WS-INV-TRI-INCEPT-COST-CAD   PIC S9(11)V99  VALUE 0.
277900170928           05 WS-INV-TRI-INCEPT-COST-USD   PIC S9(11)V99  VALUE 0.
278000170928           05 WS-INV-TRO-INCEPT-COST-CAD   PIC S9(11)V99  VALUE 0.
278100170928R14556     05 WS-INV-TRO-INCEPT-COST-USD   PIC S9(11)V99  VALUE 0.
278200170928R16256     05 WS-INV-TRI-INCEPT-MKT-CAD    PIC S9(11)V99  VALUE 0.
278300170928   ¦       05 WS-INV-TRI-INCEPT-MKT-USD    PIC S9(11)V99  VALUE 0.
278400170928   ¦       05 WS-INV-TRO-INCEPT-MKT-CAD    PIC S9(11)V99  VALUE 0.
278500170928R16256     05 WS-INV-TRO-INCEPT-MKT-USD    PIC S9(11)V99  VALUE 0.
278600170928R16881     05 WS-INV-TRI-INCEPT-PH-CAD     PIC S9(11)V99 VALUE 0.
278700170928  ¦        05 WS-INV-TRI-INCEPT-PH-TOT-CAD PIC S9(11)V99 VALUE 0.
278800170928  ¦        05 WS-INV-TRI-INCEPT-PH-USD     PIC S9(11)V99 VALUE 0.
278900170928  ¦        05 WS-INV-TRI-INCEPT-PH-TOT-USD PIC S9(11)V99 VALUE 0.
279000170928  ¦        05 WS-INV-TRI-YTD-PH-CAD        PIC S9(11)V99 VALUE 0.
279100170928  ¦        05 WS-INV-TRI-YTD-PH-TOT-CAD    PIC S9(11)V99 VALUE 0.
279200170928  ¦        05 WS-INV-TRI-YTD-PH-USD        PIC S9(11)V99 VALUE 0.
279300170928  ¦        05 WS-INV-TRI-YTD-PH-TOT-USD    PIC S9(11)V99 VALUE 0.
279400170928  ¦        05 WS-INV-TRI-CUR-PH-CAD        PIC S9(11)V99 VALUE 0.
279500170928  ¦        05 WS-INV-TRI-CUR-PH-TOT-CAD    PIC S9(11)V99 VALUE 0.
279600170928  ¦        05 WS-INV-TRI-CUR-PH-USD        PIC S9(11)V99 VALUE 0.
279700170928  ¦        05 WS-INV-TRI-CUR-PH-TOT-USD    PIC S9(11)V99 VALUE 0.
279800170928  ¦        05 WS-INV-TRO-INCEPT-PH-CAD     PIC S9(11)V99 VALUE 0.
279900170928  ¦        05 WS-INV-TRO-INCEPT-PH-TOT-CAD PIC S9(11)V99 VALUE 0.
280000170928  ¦        05 WS-INV-TRO-INCEPT-PH-USD     PIC S9(11)V99 VALUE 0.
280100170928  ¦        05 WS-INV-TRO-INCEPT-PH-TOT-USD PIC S9(11)V99 VALUE 0.
280200170928  ¦        05 WS-INV-TRO-YTD-PH-CAD        PIC S9(11)V99 VALUE 0.
280300170928  ¦        05 WS-INV-TRO-YTD-PH-TOT-CAD    PIC S9(11)V99 VALUE 0.
280400170928  ¦        05 WS-INV-TRO-YTD-PH-USD        PIC S9(11)V99 VALUE 0.
280500170928  ¦        05 WS-INV-TRO-YTD-PH-TOT-USD    PIC S9(11)V99 VALUE 0.
280600170928  ¦        05 WS-INV-TRO-CUR-PH-CAD        PIC S9(11)V99 VALUE 0.
280700170928  ¦        05 WS-INV-TRO-CUR-PH-TOT-CAD    PIC S9(11)V99 VALUE 0.
280800170928  v        05 WS-INV-TRO-CUR-PH-USD        PIC S9(11)V99 VALUE 0.
280900170928R16881     05 WS-INV-TRO-CUR-PH-TOT-USD    PIC S9(11)V99 VALUE 0.
281000170928R15022     05 WS-INV-DISP-GAIN-LOSS-CUR-CAD  PIC S9(11)V99 VALUE 0.
281100170928R15022     05 WS-INV-DISP-GAIN-LOSS-CUR-USD  PIC S9(11)V99 VALUE 0.
281200170928R15022     05 WS-INV-DISP-GAIN-LOSS-YTD-CAD  PIC S9(11)V99 VALUE 0.
281300170928R15022     05 WS-INV-DISP-GAIN-LOSS-YTD-USD  PIC S9(11)V99 VALUE 0.
281400170928R15022     05 WS-INV-DISP-GAIN-LOSS-INC-CAD  PIC S9(11)V99 VALUE 0.
281500170928R15022     05 WS-INV-DISP-GAIN-LOSS-INC-USD  PIC S9(11)V99 VALUE 0.
281600170928R18682***** For new fields in Section 10
281700170928R18682     05 WS-ACC-DEPOSITS             PIC S9(11)V99 VALUE 0.
281800170928   ¦       05 WS-AAC-WITHDRAWALS          PIC S9(11)V99 VALUE 0.
281900170928   ¦       05 WS-ACC-INTERESTS            PIC S9(11)V99 VALUE 0.
282000170928   ¦       05 WS-ACC-DIVIDENDS            PIC S9(11)V99 VALUE 0.
282100170928   ¦       05 WS-ACC-WTHLDNG-TAX          PIC S9(11)V99 VALUE 0.
282200170928   ¦       05 WS-ACC-MGMT-FEE             PIC S9(11)V99 VALUE 0.
282300170928   ¦       05 WS-ACC-OTHER-FEE            PIC S9(11)V99 VALUE 0.
282400170928   ¦       05 WS-ACC-ACCRUED-INC          PIC S9(11)V99 VALUE 0.
282500170928   ¦       05 WS-ACC-REALIZED-GAIN        PIC S9(11)V99 VALUE 0.
282600170928   v       05 WS-ACC-UNREALIZED-GAIN      PIC S9(11)V99 VALUE 0.
282700170928R18682     05 WS-ACC-FEES                 PIC S9(11)V99 VALUE 0.
282800170928R50823     05 WS-ACC-GMA-VALUE            PIC S9(11)V9(2) VALUE 0.
282900170928R50823     05 WS-ACC-GMA-VALUE-EX         PIC S9(11)V9(2) VALUE 0.
283000170928R59263     05 WS-ACC-GMA-VALUE-US         PIC S9(11)V9(2) VALUE 0.
283100170928      *RFS61459 Begin
283200170928R59263*01  lt-ExchangeRateCurrent.
283300170928R59263*    05 Ln-LastExchangeRate         PIC S9(09)V9(7) VALUE 0.
283400170928R59263*    05 Ld_LastTradeDate            PIC S9(09)      VALUE 0.
283500170928R59263*    05 Ld_LastTradeDate2           PIC S9(09)      VALUE 0.
283600170928R59263*    05 Lc-SQLcurrency              PIC  X(03)      VALUE "   ".
283700170928      *RFS61459 End
283800170928RF8633     05 WS-PROFESSIONAL-FEE.
283900170928              10  WS-PROFESSIONAL-FEE-INCEPT    PIC S9(9)V99 VALUE 0.
284000170928              10  WS-PROFESSIONAL-FEE-YTD       PIC S9(9)V99 VALUE 0.
284100170928              10  WS-PROFESSIONAL-FEE-CUR       PIC S9(9)V99 VALUE 0.
284200170928RF8633     05 WS-INVESTOR-SUMMARY-SEC12.
284300170928              10  WS-IS2-INT-INCEPT-CASH        PIC S9(9)V99 VALUE 0.
284400170928              10  WS-IS2-INT-YTD-CASH           PIC S9(9)V99 VALUE 0.
284500170928              10  WS-IS2-INT-CURRENT-CASH       PIC S9(9)V99 VALUE 0.
284600170928              10  WS-IS2-INT-INCEPT-REINV       PIC S9(9)V99 VALUE 0.
284700170928              10  WS-IS2-INT-YTD-REINV          PIC S9(9)V99 VALUE 0.
284800170928              10  WS-IS2-INT-CURRENT-REINV      PIC S9(9)V99 VALUE 0.
284900170928              10  WS-IS2-CPG-INCEPT-CASH        PIC S9(9)V99 VALUE 0.
285000170928              10  WS-IS2-CPG-YTD-CASH           PIC S9(9)V99 VALUE 0.
285100170928              10  WS-IS2-CPG-CURRENT-CASH       PIC S9(9)V99 VALUE 0.
285200170928              10  WS-IS2-CPG-INCEPT-REINV       PIC S9(9)V99 VALUE 0.
285300170928              10  WS-IS2-CPG-YTD-REINV          PIC S9(9)V99 VALUE 0.
285400170928              10  WS-IS2-CPG-CURRENT-REINV      PIC S9(9)V99 VALUE 0.
285500170928              10  WS-IS2-INC-INCEPT-CASH        PIC S9(9)V99 VALUE 0.
285600170928              10  WS-IS2-INC-YTD-CASH           PIC S9(9)V99 VALUE 0.
285700170928              10  WS-IS2-INC-CURRENT-CASH       PIC S9(9)V99 VALUE 0.
285800170928              10  WS-IS2-INC-INCEPT-REINV       PIC S9(9)V99 VALUE 0.
285900170928              10  WS-IS2-INC-YTD-REINV          PIC S9(9)V99 VALUE 0.
286000170928              10  WS-IS2-INC-CURRENT-REINV      PIC S9(9)V99 VALUE 0.
286100170928R14136        10  WS-IS2-MFR-CUR                PIC S9(9)V99 VALUE 0.
286200170928  ¦           10  WS-IS2-MFR-YTD                PIC S9(9)V99 VALUE 0.
286300170928  ¦           10  WS-IS2-MFR-INCEPT             PIC S9(9)V99 VALUE 0.
286400170928  ¦           10  WS-IS2-FED-WHTAX-CUR          PIC S9(9)V99 VALUE 0.
286500170928  ¦           10  WS-IS2-FED-WHTAX-YTD          PIC S9(9)V99 VALUE 0.
286600170928  ¦           10  WS-IS2-PROV-WHTAX-CUR         PIC S9(9)V99 VALUE 0.
286700170928R14136        10  WS-IS2-PROV-WHTAX-YTD         PIC S9(9)V99 VALUE 0.
286800170928R14858        10  WS-IS2-BAJ-CUR                PIC S9(9)V99 VALUE 0.
286900170928  ¦           10  WS-IS2-BAJ-YTD                PIC S9(9)V99 VALUE 0.
287000170928  ¦           10  WS-IS2-BAJ-INCEPT             PIC S9(9)V99 VALUE 0.
287100170928  ¦           10  WS-IS2-BFW-CUR                PIC S9(9)V99 VALUE 0.
287200170928  ¦           10  WS-IS2-BFW-YTD                PIC S9(9)V99 VALUE 0.
287300170928R14858        10  WS-IS2-BFW-INCEPT             PIC S9(9)V99 VALUE 0.
287400170928R20758        10  WS-IS2-ROC-CUR                PIC S9(9)V99 VALUE 0.
287500170928  ¦           10  WS-IS2-ROC-YTD                PIC S9(9)V99 VALUE 0.
287600170928R20758        10  WS-IS2-ROC-INCEPT             PIC S9(9)V99 VALUE 0.
287700170928148326        10  WS-IS2-INT-CURRENT-CASH-HST   PIC S9(11)V9(2) VALUE 0.
287800170928148326        10  WS-IS2-CPG-CURRENT-CASH-HST   PIC S9(11)V9(2) VALUE 0.
287900170928148326        10  WS-IS2-INC-CURRENT-CASH-HST   PIC S9(11)V9(2) VALUE 0.
288000170928148326        10  WS-IS2-BAJ-CUR-HST            PIC S9(11)V9(2) VALUE 0.
288100170928R61356     05 WS-ACC-LTD-CONTRIBUTION     PIC S9(11)V99 VALUE 0.
288200170928  |        05 WS-ACC-YTD-CONTRIBUTION     PIC S9(11)V99 VALUE 0.
288300170928  |        05 WS-ACC-LTD-WITHDRAWALS      PIC S9(11)V99 VALUE 0.
288400170928  |        05 WS-ACC-YTD-WITHDRAWALS      PIC S9(11)V99 VALUE 0.
288500170928  v        05 WS-ACC-LTD-WITHDRAWALS-TOT  PIC S9(11)V99 VALUE 0.
288600170928R61356     05 WS-ACC-YTD-WITHDRAWALS-TOT  PIC S9(11)V99 VALUE 0.
288700170928      *RFS69515 Begin
288800170928          03  WS-RD-TOTALS.
288900170928              05 WS-RD-YTD-CONTRIBUTIONS        PIC S9(9)V9(2) COMP-3.
289000170928              05 WS-RD-LTD-CONTRIBUTIONS        PIC S9(9)V9(2) COMP-3.
289100170928              05 WS-RD-YTD-CDS-GRANT            PIC S9(9)V9(2) COMP-3.
289200170928              05 WS-RD-LTD-CDS-GRANT            PIC S9(9)V9(2) COMP-3.
289300170928              05 WS-RD-YTD-CDS-BOND             PIC S9(9)V9(2) COMP-3.
289400170928              05 WS-RD-LTD-CDS-BOND             PIC S9(9)V9(2) COMP-3.
289500170928              05 WS-RD-YTD-TOT-CONTRIBUT        PIC S9(9)V9(2) COMP-3.
289600170928              05 WS-RD-LTD-TOT-CONTRIBUT        PIC S9(9)V9(2) COMP-3.
289700170928      *RFS69515 End
289800170928      * RFS 79298 - begin
289900170928              05 Ws-RD-Ytd-Dap-Pymt             PIC S9(9)V9(2) COMP-3.
290000170928              05 Ws-RD-Ltd-Dap-Pymt             PIC S9(9)V9(2) COMP-3.
290100170928              05 Ws-RD-Ytd-Ldap-Pymt            PIC S9(9)V9(2) COMP-3.
290200170928              05 Ws-RD-Ltd-Ldap-Pymt            PIC S9(9)V9(2) COMP-3.
290300170928              05 Ws-RD-Ytd-Total-Pymt           PIC S9(9)V9(2) COMP-3.
290400170928              05 Ws-RD-Ltd-Total-Pymt           PIC S9(9)V9(2) COMP-3.
290500170928              05 Ws-RD-Ytd-Repymt-Bond          PIC S9(9)V9(2) COMP-3.
290600170928              05 Ws-RD-Ltd-Repymt-Bond          PIC S9(9)V9(2) COMP-3.
290700170928              05 Ws-RD-Ytd-Repymt-Grant         PIC S9(9)V9(2) COMP-3.
290800170928              05 Ws-RD-Ltd-Repymt-Grant         PIC S9(9)V9(2) COMP-3.
290900170928      * RFS 79298 - end
291000170928R91272        05 WS-RD-YTD-Rollover             PIC S9(9)V9(2) COMP-3.
291100170928R91272        05 WS-RD-LTD-Rollover             PIC S9(9)V9(2) COMP-3.
291200170928      * RFS 139952 - begin RM
291300170928              05 Ws-Ad-Accr-Int                 PIC S9(9)V9(2) COMP-3.
291400170928      * RFS 139952 - end   RM
291500170928      *RFS61459 Begin
291600170928       01  lt-ExchangeRateCurrent.
291700170928           05 Ln-LastExchangeRate         PIC S9(09)V9(7) VALUE 0.
291800170928           05 Ld_LastTradeDate            PIC S9(09)      VALUE 0.
291900170928           05 Ld_LastTradeDate2           PIC S9(09)      VALUE 0.
292000170928           05 Lc-SQLcurrency              PIC  X(03)      VALUE "   ".
292100170928      *RFS61459 End
292200170928       01  WS-ACCOUNT-INVESTMENT-TOTALS.
292300170928           05 WS-INV-CPG-CURRENT PIC S9(11)V99 VALUE 0.
292400170928           05 WS-INV-INC-CURRENT PIC S9(11)V99 VALUE 0.
292500170928           05 WS-INV-INT-CURRENT PIC S9(11)V99 VALUE 0.
292600170928           05 WS-INV-PUR-CURRENT PIC S9(11)V99 VALUE 0.
292700170928           05 WS-INV-RED-CURRENT PIC S9(11)V99 VALUE 0.
292800170928R14858     05 WS-INV-BAJ-CUR     PIC S9(11)V99 VALUE 0.
292900170928  ¦        05 WS-INV-BAJ-YTD     PIC S9(11)V99 VALUE 0.
293000170928  ¦        05 WS-INV-BAJ-INCEPT  PIC S9(11)V99 VALUE 0.
293100170928  ¦        05 WS-INV-BFW-CUR     PIC S9(11)V99 VALUE 0.
293200170928  ¦        05 WS-INV-BFW-YTD     PIC S9(11)V99 VALUE 0.
293300170928R14858     05 WS-INV-BFW-INCEPT  PIC S9(11)V99 VALUE 0.
293400170928R20758     05 WS-INV-ROC-CUR     PIC S9(11)V99 VALUE 0.
293500170928  ¦        05 WS-INV-ROC-YTD     PIC S9(11)V99 VALUE 0.
293600170928R20758     05 WS-INV-ROC-INCEPT  PIC S9(11)V99 VALUE 0.
293700170928           05 WS-INV-TRI-CURRENT PIC S9(11)V99 VALUE 0.
293800170928           05 WS-INV-TRO-CURRENT PIC S9(11)V99 VALUE 0.
293900170928RF8113     05 WS-INV-SWI-CURRENT PIC S9(11)V99 VALUE 0.
294000170928RF8113     05 WS-INV-SWO-CURRENT PIC S9(11)V99 VALUE 0.
294100170928R18312     05 WS-INV-BUY-CURRENT PIC S9(11)V99 VALUE 0.
294200170928R18312     05 WS-INV-SEL-CURRENT PIC S9(11)V99 VALUE 0.
294300170928R28931     05 WS-INV-PURCH-LAST-12-MONTHS  PIC S9(11)V99 VALUE 0.
294400170928  ¦        05 WS-INV-REDEM-LAST-12-MONTHS  PIC S9(11)V99 VALUE 0.
294500170928  ¦        05 WS-INV-TRI-LAST-12-MONTHS    PIC S9(11)V99 VALUE 0.
294600170928R28931     05 WS-INV-TRO-LAST-12-MONTHS    PIC S9(11)V99 VALUE 0.
294700170928           05 WS-INV-CPG-CURRENT-EX PIC S9(11)V99 VALUE 0.
294800170928           05 WS-INV-INC-CURRENT-EX PIC S9(11)V99 VALUE 0.
294900170928           05 WS-INV-INT-CURRENT-EX PIC S9(11)V99 VALUE 0.
295000170928           05 WS-INV-PUR-CURRENT-EX PIC S9(11)V99 VALUE 0.
295100170928           05 WS-INV-RED-CURRENT-EX PIC S9(11)V99 VALUE 0.
295200170928           05 WS-INV-TRI-CURRENT-EX PIC S9(11)V99 VALUE 0.
295300170928           05 WS-INV-TRO-CURRENT-EX PIC S9(11)V99 VALUE 0.
295400170928RF8673     05 WS-INV-SWI-CURRENT-EX PIC S9(11)V99 VALUE 0.
295500170928           05 WS-INV-SWO-CURRENT-EX PIC S9(11)V99 VALUE 0.
295600170928           05 WS-INV-CPG-INCEPT  PIC S9(11)V99 VALUE 0.
295700170928           05 WS-INV-INC-INCEPT  PIC S9(11)V99 VALUE 0.
295800170928           05 WS-INV-INT-INCEPT  PIC S9(11)V99 VALUE 0.
295900170928           05 WS-INV-PUR-INCEPT  PIC S9(11)V99 VALUE 0.
296000170928RF5905     05 WS-INV-PUR-INCEPT-P  PIC S9(11)V99 VALUE 0.
296100170928           05 WS-INV-RED-INCEPT  PIC S9(11)V99 VALUE 0.
296200170928           05 WS-INV-TRI-INCEPT  PIC S9(11)V99 VALUE 0.
296300170928RF7777     05 WS-INV-SWI-INCEPT  PIC S9(11)V99 VALUE 0.
296400170928RF5905     05 WS-INV-TRI-INCEPT-P  PIC S9(11)V99 VALUE 0.
296500170928RF7777     05 WS-INV-SWI-INCEPT-P  PIC S9(11)V99 VALUE 0.
296600170928           05 WS-INV-TRO-INCEPT  PIC S9(11)V99 VALUE 0.
296700170928RF7777     05 WS-INV-SWO-INCEPT  PIC S9(11)V99 VALUE 0.
296800170928           05 WS-INV-CPG-INCEPT-EX  PIC S9(11)V99 VALUE 0.
296900170928           05 WS-INV-INC-INCEPT-EX  PIC S9(11)V99 VALUE 0.
297000170928           05 WS-INV-INT-INCEPT-EX  PIC S9(11)V99 VALUE 0.
297100170928           05 WS-INV-PUR-INCEPT-EX  PIC S9(11)V99 VALUE 0.
297200170928           05 WS-INV-RED-INCEPT-EX  PIC S9(11)V99 VALUE 0.
297300170928           05 WS-INV-TRI-INCEPT-EX  PIC S9(11)V99 VALUE 0.
297400170928RF7777     05 WS-INV-SWI-INCEPT-EX  PIC S9(11)V99 VALUE 0.
297500170928           05 WS-INV-TRO-INCEPT-EX  PIC S9(11)V99 VALUE 0.
297600170928RF7777     05 WS-INV-SWO-INCEPT-EX  PIC S9(11)V99 VALUE 0.
297700170928RF8633     05 WS-INV-TRI-YTD-EX     PIC S9(11)V99 VALUE 0.
297800170928RF8633     05 WS-INV-SWI-YTD-EX     PIC S9(11)V99 VALUE 0.
297900170928RF8633     05 WS-INV-TRO-YTD-EX     PIC S9(11)V99 VALUE 0.
298000170928RF8633     05 WS-INV-SWO-YTD-EX     PIC S9(11)V99 VALUE 0.
298100170928RF5962     05 WS-INV-DISTRIBUTION-ROC PIC S9(9)V99 VALUE 0.
298200170928RF7172     05 WS-INV-TAXABLE-AMOUNT   PIC S9(9)V99 VALUE 0.
298300170928R11127     05 WS-INV-DISP-PROCEEDS-BASE   PIC S9(11)V99 VALUE 0.
298400170928R11127     05 WS-YTD-DISP-GAIN-LOSS-BASE  PIC S9(11)V99 VALUE 0.
298500170928R11127     05 WS-INV-DISP-BOOK-VALUE-BASE PIC S9(11)V99 VALUE 0.
298600170928R11127     05 WS-YTD-DISP-BOOK-VALUE-BASE PIC S9(11)V99 VALUE 0.
298700170928R14556     05 WS-TRI-TRO-INCEPT-COST      PIC S9(11)V99 VALUE 0.
298800170928           05 WS-TRI-TRO-INCEPT-COST-EX   PIC S9(11)V99 VALUE 0.
298900170928           05 WS-INV-TRI-INCEPT-COST      PIC S9(11)V99 VALUE 0.
299000170928           05 WS-INV-TRI-INCEPT-COST-EX   PIC S9(11)V99 VALUE 0.
299100170928           05 WS-INV-TRO-INCEPT-COST      PIC S9(11)V99 VALUE 0.
299200170928R14556     05 WS-INV-TRO-INCEPT-COST-EX   PIC S9(11)V99 VALUE 0.
299300170928R16256     05 WS-INV-TRI-INCEPT-MKT       PIC S9(11)V99 VALUE 0.
299400170928   ¦       05 WS-INV-TRI-INCEPT-MKT-EX    PIC S9(11)V99 VALUE 0.
299500170928   ¦       05 WS-INV-TRO-INCEPT-MKT       PIC S9(11)V99 VALUE 0.
299600170928R16256     05 WS-INV-TRO-INCEPT-MKT-EX    PIC S9(11)V99 VALUE 0.
299700170928R16881     05 WS-INV-TRI-INCEPT-PH         PIC S9(11)V99 VALUE 0.
299800170928  ¦        05 WS-INV-TRI-YTD-PH            PIC S9(11)V99 VALUE 0.
299900170928  ¦        05 WS-INV-TRI-CUR-PH            PIC S9(11)V99 VALUE 0.
300000170928  ¦        05 WS-INV-TRI-INCEPT-PH-EX      PIC S9(11)V99 VALUE 0.
300100170928  ¦        05 WS-INV-TRI-YTD-PH-EX         PIC S9(11)V99 VALUE 0.
300200170928  ¦        05 WS-INV-TRI-CUR-PH-EX         PIC S9(11)V99 VALUE 0.
300300170928  ¦        05 WS-INV-TRO-INCEPT-PH         PIC S9(11)V99 VALUE 0.
300400170928  ¦        05 WS-INV-TRO-YTD-PH            PIC S9(11)V99 VALUE 0.
300500170928  ¦        05 WS-INV-TRO-CUR-PH            PIC S9(11)V99 VALUE 0.
300600170928  ¦        05 WS-INV-TRO-INCEPT-PH-EX      PIC S9(11)V99 VALUE 0.
300700170928  v        05 WS-INV-TRO-YTD-PH-EX         PIC S9(11)V99 VALUE 0.
300800170928R16881     05 WS-INV-TRO-CUR-PH-EX         PIC S9(11)V99 VALUE 0.
300900170928R16666     05 WS-GAIN-LOSS                  PIC S9(11)V99    VALUE 0.
301000170928R16666     05 WS-GAIN-LOSS-EX               PIC S9(11)V99    VALUE 0.
301100170928R15022     05 WS-INV-DISP-GAIN-LOSS-CUR     PIC S9(11)V9999  VALUE 0.
301200170928R15022     05 WS-INV-DISP-GAIN-LOSS-CUR-EX  PIC S9(11)V9999  VALUE 0.
301300170928R15022     05 WS-INV-DISP-GAIN-LOSS-YTD     PIC S9(11)V9999  VALUE 0.
301400170928R15022     05 WS-INV-DISP-GAIN-LOSS-YTD-EX  PIC S9(11)V9999  VALUE 0.
301500170928R15022     05 WS-INV-DISP-GAIN-LOSS-INC     PIC S9(11)V9999  VALUE 0.
301600170928R15022     05 WS-INV-DISP-GAIN-LOSS-INC-EX  PIC S9(11)V9999  VALUE 0.
301700170928R50823     05 WS-INV-GMA-VALUE              PIC S9(11)V9(2) VALUE 0.
301800170928R50823     05 WS-INV-GMA-VALUE-EX           PIC S9(11)V9(2) VALUE 0.
301900170928R22892     05 WS-CDSC-EXCHANGE-BASE       PIC S9(11)V99 VALUE 0.
302000170928R11127     05 WS-INV-DISP-CDSC-BASE       PIC S9(11)V99 VALUE 0.
302100170928R11127     05 WS-YTD-DISP-CDSC-BASE       PIC S9(11)V99 VALUE 0.
302200170928      *RFS36342 - Starts
302300170928           05 ln_InvCurrDispProceedsBase    PIC S9(11)V99 VALUE 0.
302400170928           05 ln_CurrDispProceedsBase       PIC S9(11)V99 VALUE 0.
302500170928           05 ln_InvCurrDispBookValueBase   PIC S9(11)V99 VALUE 0.
302600170928           05 ln_CurrDispBookValueBase      PIC S9(11)V99 VALUE 0.
302700170928           05 ln_InvCurrDispGainLossBase    PIC S9(11)V99 VALUE 0.
302800170928           05 ln_InvCurrDispCdscBase        PIC S9(11)V99 VALUE 0.
302900170928           05 ln_InvGrossSoldYtdBase        PIC S9(11)V99 VALUE 0.
303000170928           05 ln_InvGrossSoldCurrBase       PIC S9(11)V99 VALUE 0.
303100170928           05 ln_InvDeductionsCdscYtdBase   PIC S9(11)V99 VALUE 0.
303200170928           05 ln_InvDeductionsCdscCurrBase  PIC S9(11)V99 VALUE 0.
303300170928           05 ln_DeductionCdscBase          PIC S9(11)V99 VALUE 0.
303400170928      *RFS36342 - Ends
303500170928           05 WS-P-AUG-BOOK-VALUE    PIC S9(11)V99 VALUE 0.
303600170928           05 WS-AUG-INV-CPG-INCEPT  PIC S9(11)V99 VALUE 0.
303700170928           05 WS-AUG-INV-INC-INCEPT  PIC S9(11)V99 VALUE 0.
303800170928           05 WS-AUG-INV-INT-INCEPT  PIC S9(11)V99 VALUE 0.
303900170928           05 WS-AUG-INV-PUR-INCEPT  PIC S9(11)V99 VALUE 0.
304000170928           05 WS-AUG-INV-RED-INCEPT  PIC S9(11)V99 VALUE 0.
304100170928           05 WS-AUG-INV-TRI-INCEPT  PIC S9(11)V99 VALUE 0.
304200170928           05 WS-AUG-INV-TRO-INCEPT  PIC S9(11)V99 VALUE 0.
304300170928R14747     05 WS-AD-DIVS-INCEPT      PIC S9(11)V99 VALUE 0.
304400170928R12865 01  WS-ORIGIN-CODE                PICTURE X(3) VALUE SPACES.
304500170928R17165 01  WS-II-SECTION-INV             PICTURE X(1350).
304600170928R17165 01  WS-II-SECTION-ACC             PICTURE X(1350).
304700170928       01  CURRENCY-FIELDS.
304800170928           05 WS-CAD-DESCR       PIC X(25).
304900170928           05 WS-USD-DESCR       PIC X(25).
305000170928       01  WS-PRV-ACCOUNT        PIC S9(9).
305100170928       01  WS-PRV-INVESTMENT     PIC X(5).
305200170928156335 01  WS-EXT-LOAD-TYP       PIC X(3).
305300170928156335 01  WS-EXT-LOAD-DESC      PIC X(25).
305400170928156335 01  WS-INV-GRP-CAT        PIC X(25).
305500170928156335 01  WS-ASSET-CLASS-CD     PIC X(6).
305600170928156335 01  WS-ASSET-CLASS-DESE   PIC X(25).
305700170928156335 01  WS-ASSET-CLASS-DESF   PIC X(25).
305800170928156335 01  WS-ASSET-CLASS-DESC   PIC X(25).
305900170928RF5962 01  WS-PROVINCE-OF-AGREEMENT         PIC X(3).
306000170928RF5962 01  WS-COUNTRY-OF-AGREEMENT          PIC X(3).
306100170928R12726 01  WS-DIVS-CURRENT-EX          PIC S9(9)V9(2).
306200170928R13637 01  AD-DIVS-INCEPT-EX           PIC S9(9)V9(2).
306300170928R13637 01  AD-MARKET-VALUE-PRIOR-EX    PIC S9(11)V9(2).
306400170928R13637 01  AD-NO-OF-UNITS-EX           PIC S9(9)V9(3).
306500170928
306600170928R13955 01  WS-GROUP-NAME               PIC X(50) VALUE SPACES.
306700170928R13955 01  WS-EMPLOYEE-NO              PIC X(15) VALUE SPACES.
306800170928R13955 01  WS-GROUP-PLAN-DESC          PIC X(25) VALUE SPACES.
306900170928
307000170928R14858 01  WS-BAJ-UNIT-AMT             PIC S9(9)V9(2).
307100170928R14858 01  WS-BFW-UNIT-AMT             PIC S9(9)V9(2).
307200170928
307300170928148326 01  WS-SAJ-UNIT-AMT             PIC S9(11)V9(2).
307400170928R20758 01  WS-ROC-CALC-AMT             PIC S9(9)V9(2).
307500170928R20758 01  WS-ROC-FOUND                PIC X(1).
307600170928
307700170928R15022 01  WS-GAIN-LOSS-TMP1           PIC S9(11)V9(4).
307800170928R15022 01  WS-GAIN-LOSS-TMP2           PIC S9(11)V9(3).
307900170928
308000170928R14871 01  WS-ACIVRNO-TEMP             PIC 9(9).
308100170928R14871 01  WS-ACACTNO-TEMP             PIC 9(9).
308200170928R14871 01  WS-TRANSNO-TEMP             PIC 9(9).
308300170928
308400170928R16419 01  WS-USER-ID                       PIC X(10).
308500170928R17783 01  CURR-USER-ID                     PIC X(10) VALUE " ".
308600170928R17783 01  PREV-USER-ID                     PIC X(10) VALUE " ".
308700170928
308800170928RF6234 01  WS-LOOP-INDICATOR                PIC X(1).
308900170928       01  WS-LOOP-DATE-NUM                 PIC 9(1).
309000170928       01  WS-TRADE-DATE                    PIC 9(8).
309100170928R21714 01  WS-SKIP-CODE-VALIDATION          PIC X(1) VALUE SPACE.
309200170928R21714 01  WS-CLTSTCLT-FLAG                 PIC X(1) VALUE SPACE.
309300170928R21714 01  WS-CLTSTREP-FLAG                 PIC X(1) VALUE SPACE.
309400170928R21714 01  WS-CLTSTSPR-FLAG                 PIC X(1) VALUE SPACE.
309500170928R21714 01  WS-NOMREPSP-FLAG                 PIC X(1) VALUE SPACE.
309600170928
309700170928R14023 01  WS-SWI-TO-TRI-INDICATOR          PIC X(1) VALUE "N".
309800170928R14023 01  WS-SWO-TO-TRO-INDICATOR          PIC X(1) VALUE "N".
309900170928
310000170928R28931 01  LT-DELTA-MM               PIC 9(5) VALUE 12.
310100170928R28931 01  LAST-12-MONTHS-DATE       PIC 9(08).
310200170928R28931 01  WD-CCYYMMDD               FORMAT DATE "@Y%m%d".
310300170928
310400170928RF6645 01  WS-PERIOD-ROR-APPL-ARRAY  PICTURE X(10).
310500170928       01  WS-PERIOD-ROR-APPL-ARRAY-R
310600170928                      REDEFINES WS-PERIOD-ROR-APPL-ARRAY.
310700170928               05  WS-PERIOD-ROR-APPLICABLE-1  PICTURE X(1).
310800170928               05  WS-PERIOD-ROR-APPLICABLE-2  PICTURE X(1).
310900170928               05  WS-PERIOD-ROR-APPLICABLE-3  PICTURE X(1).
311000170928               05  WS-PERIOD-ROR-APPLICABLE-4  PICTURE X(1).
311100170928               05  WS-PERIOD-ROR-APPLICABLE-5  PICTURE X(1).
311200170928               05  WS-PERIOD-ROR-APPLICABLE-6  PICTURE X(1).
311300170928               05  WS-PERIOD-ROR-APPLICABLE-7  PICTURE X(1).
311400170928               05  WS-PERIOD-ROR-APPLICABLE-8  PICTURE X(1).
311500170928               05  WS-PERIOD-ROR-APPLICABLE-9  PICTURE X(1).
311600170928               05  WS-PERIOD-ROR-APPLICABLE-10 PICTURE X(1).
311700170928
311800170928R52815 01  lc_MfaAccFbpVars.
311900170928  |        03  li_AccountNo                 PIC S9(09)       VALUE 0.
312000170928  |        03  li_ContractNo                PIC S9(09)       VALUE 0.
312100170928  |        03  ld_LdaEndDate                PIC S9(08)       VALUE 0.
312200170928  |        03  lc_FieBonusFlag              PIC X(01)        VALUE " ".
312300170928  |        03  ln_FieBonusAmount            PIC S9(11)V9(2)  VALUE 0.
312400170928  |        03  ld_FieBonusDate              PIC S9(08).
312500170928  |        03  ld_FieBonusDate_R            REDEFINES ld_FieBonusDate.
312600170928  |            05 ld_FieBonusCCYY           PIC 9(04).
312700170928R52815         05 ld_FieBonusMMDD           PIC 9(04).
312800170928125153 01  ln_GrossAmount                   PIC S9(13)V9(2)  VALUE 0.
312900170928      *RFS167932 -  Starts
313000170928       01  ld_SelectDate           PIC S9(9) COMP-3 VALUE 0.
313100170928       01  ld_SelectDateCurr       PIC S9(9) COMP-3 VALUE 0.
313200170928       01  ld_SelectDateChrg       PIC S9(9) COMP-3 VALUE 0.
313300170928       01  ld_SelectDateLR1        PIC S9(9) COMP-3 VALUE 0.
313400170928       01  ld_SelectDateROC        PIC S9(9) COMP-3 VALUE 0.
313500170928       01  ld_SelectDateFee        PIC S9(9) COMP-3 VALUE 0.
313600170928       01  ld_SelectDateExg        PIC S9(9) COMP-3 VALUE 0.
313700170928       01  ld_SelectDateRecom      PIC S9(9) COMP-3 VALUE 0.
313800170928      *RFS167932 -  Ends
313900170928      *******
314000170928      ******************************************************************
314100170928      *                                                                *
314200170928      *    A C C O U N T   D E T A I L S   S E C T I O N   T A B L E   *
314300170928      *                                                                *
314400170928      ******************************************************************
314500170928       01  WS-ACCDTL-TBL.
31460017092812090 *    03  WS-ACCDTL-ENT           OCCURS 250  TIMES
314700170928      * RFS156599 START
31480017092812090 *    03  WS-ACCDTL-ENT           OCCURS 500  TIMES
314900170928164194*    03  WS-ACCDTL-ENT           OCCURS 900  TIMES
315000170928164194     03  WS-ACCDTL-ENT           OCCURS 2400 TIMES
315100170928      * RFS156599 END
315200170928                                       INDEXED BY  AD
315300170928                                                   ADR.
315400170928R17165         05  WS-AD-RECD          PICTURE X(1350).
315500170928
315600170928164194*01  WS-AD-LST                   PICTURE S9(3)       COMP-3.
315700170928164194 01  WS-AD-LST                   PICTURE S9(4)       COMP-3.
315800170928164194*01  WS-AD-MAX                   PICTURE S9(3)       COMP-3
315900170928164194 01  WS-AD-MAX                   PICTURE S9(4)       COMP-3
316000170928      * RFS156599 START
316100170928      *                                                    VALUE 250.
316200170928164194*                                                    VALUE 900.
316300170928164194                                                     VALUE 2400.
316400170928      * RFS156599 END
316500170928      /
316600170928       01 WS-LEVEL88-ITEMS.
316700170928           05 WS-TRANS-STATUS          PIC X(3).
316800170928              88 VALID-STATUS          VALUES "HSC" "HST" "RVS".
316900170928              88 HISTORY               VALUES "HSC" "HST".
317000170928              88 REVERSAL              VALUES "RVS".
317100170928      * RFS156507 - Start
317200170928           05 WS-TRANS79-STATUS        PIC X(3).
317300170928              88 VALID-TRANS79-STATUS  VALUES "HSC" "HST" "RVS" "AOP"
317400170928                                 "CON" "PND" "RVP" "SET" "UNC" "VER".
317500170928              88 HISTORY-TRANS79       VALUES "HSC" "HST".
317600170928              88 REVERSAL-TRANS79      VALUES "RVS".
317700170928       01  Lc-Pending-Trans-Option.
317800170928           03  lc_PndTransScreenCode   PIC X(08) VALUE "STMTJSI".
317900170928           03  lc_PndTransEditCode     PIC X(06) VALUE "STMPND".
318000170928           03  lc_PndTransLevelCode    PIC X(01) VALUE "T".
318100170928       01  Lc_PndTrans                 PIC X(01) VALUE SPACE.
318200170928       01  WS-STM79-FLAG               PIC X(01) VALUE "N".
318300170928       01  WS-STM79-HST-FLAG           PIC X(1) VALUE "N".
318400170929       01  WS-STM79-NHST-FLAG          PIC X(01) VALUE "N".
318500170929      * RFS156507 - End
318600170929      ** RFS171359 - Start **
318700170929       01  Lc-STMLTD-EDITCODE.
318800170929           03  lc_STMLTD_ScreenCode  PIC X(08) VALUE "STMTJSI".
318900170929           03  lc_STMLTD_EditCode    PIC X(06) VALUE "STMLTD".
319000170929           03  lc_STMLTD_Code        PIC X(01) VALUE "A".
319100170928       01 Lc_STMLTD                  PIC X(01)  VALUE SPACE.
319200170928      ** RFS171359 - End   **
319300170928      * RFS 33331-start
319400170928       01 lc_Constants.
319500170928          05 lc_Negative                PIC X(1) VALUE "-".
319600170928R38037    05 lncc_No                    PIC X(01)  VALUE "N".
319700170928R38037    05 lncc_Yes                   PIC X(01)  VALUE "Y".
319800170928116317    05 lncc_C                     PIC X(01)  VALUE "C".
31990017092880555     05 lncc_J                     PIC  X(01) VALUE "J".
320000170928      * RFS 33331-end
32010017092872750     05 lncc_Stmdis                PIC X(06)  VALUE "STMDIS".
320200170928      *RFS36342 - Starts
320300170928          05 lnc_D                      PIC X(1) VALUE "D".
320400170928          05 lnc_N                      PIC X(1) VALUE "N".
320500170928      *RFS36342 - Ends
320600170928      *RFS37754 - Begins
320700170928      *** RFS43223 - Start
320800170928          05  lncc_Space                PIC  X(01) VALUE " ".
320900170928          05  lc_ExchangeRateType       PIC X(01).
321000170928      *** RFS43223 - End
321100170928          05 lncc_M                     PIC X(1) VALUE "M".
321200170928          05 lc_ModuleSegSysMat         PIC X(10) VALUE "SEGSYSMAT".
321300170928          05 lc_SegSysMat               PIC X(01) VALUE "N".
321400170928      *RFS47406 Start
321500170928          05 lnc_ModuleSegGLWB          PIC X(10) VALUE "SEGGLWB".
321600170928          05 lnc_F                      PIC X(01) VALUE "F".
321700170928          05 lnc_G                      PIC X(01) VALUE "G".
321800170928          05 lnc_BUY                    PIC X(03) VALUE "BUY".
321900170928          05 lnc_SWI                    PIC X(03) VALUE "SWI".
322000170928          05 lnc_TRI                    PIC X(03) VALUE "TRI".
322100170928          05 lnc_PAC                    PIC X(03) VALUE "PAC".
322200170928          05 lnc_SEL                    PIC X(03) VALUE "SEL".
322300170928          05 lnc_SWO                    PIC X(03) VALUE "SWO".
322400170928          05 lnc_TRO                    PIC X(03) VALUE "TRO".
322500170928          05 lnc_HST                    PIC X(03) VALUE "HST".
322600170928          05 lnc_P                      PIC X(01) VALUE "P".
322700170928          05 lnc_Dollar                 PIC X(01) VALUE "$".
322800170928          05 lnc_Proportional           PIC X(15) VALUE
322900170928                                        "Proportional".
323000170928          05 lnc_For                    PIC X(15) VALUE
323100170928                                        "$ for $".
323200170928          05 lnc_INIT                   PIC X(04) VALUE
323300170928                                        "INIT".
323400170928          05 lnc_RVS                    PIC X(03) VALUE
323500170928                                        "RVS".
323600170928          05 lnc_First                  PIC X(10) VALUE
323700170928                                        "First".
323800170928          05 lnc_Initial                PIC X(10) VALUE
323900170928                                        "Initial".
324000170928          05 lnc_Additional             PIC X(10) VALUE
324100170928                                        "Additional".
324200170928          05 lnc_Reversal               PIC X(10) VALUE
324300170928                                        "Reversal".
324400170928          05 lnc_FIXED                  PIC X(05) VALUE
324500170928                                        "FIXED".
324600170928          05 lnc_GLWA                   PIC X(05) VALUE
324700170928                                        "GLWA ".
324800170928106701*--- Beg        -----------------------------------------------*
324900170928          05 lnc_CMIN                   PIC X(05) VALUE
325000170928                                        "CMIN ".
325100170928          05 lnc_ORIG                   PIC X(05) VALUE
325200170928                                        "ORIG ".
325300170928106701*--- Beg End    -----------------------------------------------*
325400170928      *RFS47406 End
325500170928R93662    05 lnc_2                      PIC X(01) VALUE "2".
325600170928R52815    05 lnc_YearEndMMDD            PIC S9(9) VALUE 1231.
325700170928  |       05 lnc_Rrif                   PIC X(04) VALUE "RRIF".
325800170928R52815    05 lnc_Rule3                  PIC X(01) VALUE "3".
325900170928      *RFS39466 - Begins
326000170928          05 lncc_EnteredByCMT          PIC X(10) VALUE "MATCMT RUN".
326100170928          05 lncc_EnteredByCMTPre       PIC X(10) VALUE "MATCMT PRE".
326200170928          05 lncc_EnteredByDMT          PIC X(10) VALUE "MATDMT RUN".
326300170928          05 lncc_EnteredByDMTPre       PIC X(10) VALUE "MATDMT PRE".
326400170928          05 lncc_NOAPP                 PIC X(5) VALUE "NOAPP".
326500170928          05 lncc_MAT                   PIC X(3) VALUE "MAT".
326600170928R64262    05 Lncc_Blank                 PIC X(1) VALUE " ".
326700170928124157    05 lnc_0101                   PIC X(4) VALUE "0101".
326800170928      * RFS112003 - Strats
326900170928          05 lnc_MaxRec                 PIC S9(3) VALUE 200.
327000170928          05 lnc_EN                     PIC X(01) VALUE "E".
327100170928          05 lnc_FR                     PIC X(01) VALUE "F".
327200170928          05 lnc_PlanTypeDesc           PIC X(14) VALUE
327300170928                                                  "PLAN-TYPE-DESC".
327400170928          05 lnc_PlanTypeName           PIC X(14) VALUE
327500170928                                                  "PLAN-TYPE-NAME".
327600170928          05 lnc_PlanTypeCode           PIC X(14) VALUE
327700170928                                                  "PLAN-TYPE-CODE".
327800170928          05 lnc_FreqDesc               PIC X(09) VALUE
327900170928                                                  "FREQ-DESC".
328000170928          05 lnc_FreqLCode              PIC X(10) VALUE
328100170928                                                  "FREQ-LCODE".
328200170928          05 lnc_FreqName               PIC X(09) VALUE
328300201224                                                  "FREQ-NAME".
328400170928      * RFS112003 - Ends
328500170928186198    05 lncc_ACINVG                PIC X(06) VALUE "ACINVG".
328600170928       01 lc-NOAPP-Cnt                  PICTURE S9(2) VALUE ZEROS.
328700170928       01 lc-ContractXref               PIC X(9).
328800170928       01 ln-ContractNo                 PIC S9(9).
328900170928       01 ln-Ad-SavAcct                 PIC S9(9).
329000170928       01 ln-Ad-AccCrtDt                PIC S9(8).
329100170928      *RFS39466 - Ends
329200170928
329300170928       01 lc_SQLVariables.
329400170928          05 ln_StartDate               PIC S9(08) VALUE 0.
329500170928          05 ln_EndDate                 PIC S9(08) VALUE 0.
329600170928          05 ln_TopUpAmt                PIC S9(11)V99 VALUE 0.
329700170928      *-- RFS 42623 Begins
329800170928          05 ln_ResetNumber             PIC S9(4) BINARY VALUE 0.
329900170928             88 lncc_ZeroResetNumber    VALUE 0.
330000170928          05 ld_OldGuarBaseVal          PIC S9(11)V99 VALUE 0.
330100170928      *-- RFS 42623 Ends
330200170928      * RFS46336 - Begin
330300170928          05 ld_OldGuarDthVal           PIC S9(11)V99 VALUE 0.
330400170928      * RFS46336 - End
330500170928      *** RFS43223 - Start
330600170928          05  li_ResetReqDate           PIC S9(08).
330700170928          05  ld_CalculatedMaturityVal  PIC S9(11)V99 VALUE 0.
330800170928      *** RFS43223 - End
330900170928      *RFS37754 - Ends
331000170928      *-- RFS 42623 Begins
331100170928       01 ln_Constants.
331200170928          03 lncc_100                   PIC 9(03) VALUE 100.
331300170928       01 ld_Variables.
331400170928          03 ld_GuaranteedMaturityVal   PIC S9(13)V9999 VALUE 0.
331500170928          03 ld_ContractMarketVal       PIC S9(13)V9999 VALUE 0.
331600170928          03 ld_GuaranteePercent        PIC S9(05)V99 VALUE 0.
331700170928      * RFS46336 - Begin
331800170928          03 ld_GuaranteeDthPercent     PIC S9(05)V99 VALUE 0.
331900170928          03 ld_GuaranteedDthVal        PIC S9(13)V9999 VALUE 0.
332000170928        01 lc_weekendCalc               PIC X(01) VALUE SPACES.
332100170928        01 ln_tmpVars.
332200170928          03  ln_tmpDepositMaturityDate PIC S9(09) COMP-3 VALUE 0.
332300170928        01 lncc_matTypeCMT              PIC X(03)  VALUE "CMT".
332400170928        01 lncc_matTypeDMT              PIC X(03)  VALUE "DMT".
332500170928        01 lc_currMatType               PIC X(03)  VALUE SPACES.
332600170928
332700170928        01 lc_resetReqFound             PIC X(01).
332800170928          88 lncc_resetReqNotFound    VALUE SPACE.
332900170928          88 lncc_resetReqFound       VALUE "Y".
333000170928        01 lc_resetAutoGDVFlag          PIC X(01).
333100170928          88 lncc_resetAutoGDVYes     VALUE "Y".
333200170928          88 lncc_resetAutoGDVNo      VALUE SPACE.
333300170928        01 lncc_A                       PIC X(01) VALUE "A".
333400170928        01 lncc_B                       PIC X(01) VALUE "B".
333500170928      * RFS46336 - End
333600170928      *-- RFS 42623 Ends
333700170928R52815  01 lc_FIEBonusFoundFlag         PIC X(01).
333800170928  |       88 lb_FIEBonusFound           VALUE "Y".
333900170928R52815    88 lb_FIEBonusNotFound        VALUE "N".
334000170928      /
334100170928       01  DUMP-ARGUMENTS.
334200170928      ******************************************************************
334300170928      *                                                                *
334400170928      *    D U M P   A R G U M E N T S                                 *
334500170928      *                                                                *
334600170928      ******************************************************************
334700170928           03  DA-TYPE                 PICTURE X(1)        VALUE "F".
334800170928               88  COBOL-IDENTIFIERS                       VALUE "D".
334900170928               88  FULL-DUMP                               VALUE "F".
335000170928           03  FILLER                  PICTURE X(1).
335100170928           03  DA-PGM-NAME             PICTURE X(10)       VALUE
335200170928               "ANNSTMTJSI".
33530017092812062*/ temp field
335400170928     * 01  WS-COUNTER-CONTRACT-TEMP1     PIC S9(1) VALUE 0.
335500170928     * 01  WS-COUNTER-CONTRACT-TEMP2     PIC S9(1) VALUE 0.
335600170928      /
335700170928       01  WS-USERID             PIC X(10).
335800170928       01  WS-REQUEST-FILE       PIC X(10).
335900170928R18147 01  WS-TARGET-ERROR       PIC X(1) VALUE " ".
336000170928      /
336100170928       01  ROR-PARAMETERS.
336200170928      ******************************************************************
336300170928      *                                                                *
336400170928      *    " T O T A L R O R "   P A S S   P A R A M E T E R S         *
336500170928      *                                                                *
336600170928      ******************************************************************
336700170928           03  ROR-ACCOUNT             PICTURE 9(9).
336800170928           03  ROR-START-DATE.
336900170928               05  ROR-START-YEAR      PICTURE 9(4).
337000170928               05  ROR-START-MMDD      PICTURE 9(4).
337100170928           03  ROR-END-DATE.
337200170928               05  ROR-END-YEAR        PICTURE 9(4).
337300170928               05  ROR-END-MMDD        PICTURE 9(4).
337400170928           03  ROR-TOTAL-ROR           PICTURE 9(5)V9(9).
337500170928           03  ROR-TOTAL-ROR-SIGN      PICTURE X(1).
337600170928           03  ROR-DUMP-FLAG           PICTURE X(1).
337700170928      /
337800170928      ******************************************************************
337900170928      *                                                                *
338000170928      *    C U R R E N T   /   P R E V I O U S   C O N T R O L S       *
338100170928      *                                                                *
338200170928      ******************************************************************
338300170928980514 01  CURR-GROUP-CONTROL          PICTURE X(1).
338400170928980514 01  PREV-GROUP-CONTROL          PICTURE X(1).
338500170928
338600170928RF6697 01  CURR-ACCOUNT-TYPE           PICTURE X(5).
338700170928       01  CURR-NOMINEE-ACCOUNT-TYPE   PICTURE X(5).
338800170928       01  PREV-ACCOUNT-TYPE           PICTURE X(5).
338900170928       01  PREV-NOMINEE-ACCOUNT-TYPE   PICTURE X(5).
339000170928
339100170928R10404 01  PREV-PT-RULE                PICTURE X(1).
339200170928R10404 01  CURR-PT-RULE                PICTURE X(1).
339300170928
339400170928       01  CURR-CONTROLS.
339500170928           03  CURR-LEVEL1.
339600170928             04  CURR-LEVEL2.
339700170928               05  CURR-LEVEL3.
339800170928                 06  CURR-LEVEL4.
339900170928                   07  CURR-LEVEL5.
340000170928                     08  CURR-DEALER   PICTURE X(4).
340100170928                   07  CURR-DLRREP     PICTURE X(6).
340200170928                 06  CURR-START-DATE   PICTURE 9(8).
340300170928                 06  CURR-END-DATE     PICTURE 9(8).
340400170928                 06  CURR-INVESTOR     PICTURE X(9).
340500170928               05  CURR-ACCOUNT        PICTURE X(9).
340600170928             04  CURR-INVESTMENT       PICTURE X(5).
340700170928
340800170928       01  PREV-CONTROLS.
340900170928           03  PREV-LEVEL1.
341000170928             04  PREV-LEVEL2.
341100170928               05  PREV-LEVEL3.
341200170928                 06  PREV-LEVEL4.
341300170928                   07  PREV-LEVEL5.
341400170928                     08  PREV-DEALER   PICTURE X(4).
341500170928                   07  PREV-DLRREP     PICTURE X(6).
341600170928      *          06  PREV-START-DATE   PICTURE 9(8).
341700170928                 06  WS-PREV-START-DATE   PICTURE 9(8).
341800170928                 06  PREV-END-DATE     PICTURE 9(8).
341900170928                 06  PREV-INVESTOR     PICTURE X(9).
342000170928               05  PREV-ACCOUNT        PICTURE X(9).
342100170928             04  PREV-INVESTMENT       PICTURE X(5).
342200170928      /
342300170928      * RFS10737 - Begin
342400170928       01 CL-COMMAND-MAIN.
342500170928          03 CL-COMMAND             PIC X(50)
342600170928              VALUE "CHGJOB LOG(4 20 *SECLVL) LOGCLPGM(*NO)".
342700170928          03 PACK-VAL               PIC 9(10)V9(5) COMP-3
342800170928              VALUE 50.
342900170928      * RFS10737 - End
343000170928R17495*****    Transaction Charges Table.
343100170928  |
343200170928  |    01  WS-TRANS-CHARGE-ARRAY.
343300170928  |        02  WS-TRNCH-REC OCCURS 10 TIMES.
343400170928  |            05  WS-TRNCH-DED-CODE    PICTURE  X(04).
343500170928  |            05  WS-TRNCH-CHARGE      PICTURE S9(11)V9(2) COMP-3.
343600170928  |            05  WS-TRNCH-COUNTRY     PICTURE  X(03).
343700170928  |            05  WS-TRNCH-PRV-CODE    PICTURE  X(03).
343800170928  |
343900170928  |    01  WS-TRANS-CHARGE-ARRAY-FIELDS.
344000170928  |        05  TRNCHMAX                 PICTURE S9(3) VALUE 10.
344100170928  |
344200170928  |    01  WS-CONTACT-METHODS-ARRAY.
344300170928  |        02  WS-CONMTC1-FIELDS OCCURS 3 TIMES.
344400170928  |            05  WS-CONTACT-METHOD    PICTURE X(10).
344500170928  |            05  WS-CONTACT           PICTURE X(60).
344600170928  |        02  WS-DEALER-CODE           PICTURE X(4).
344700170928  V        02  WS-DEALER-REP-CODE       PICTURE X(6).
344800170928R17495
344900170928
345000170928R18147 01  STATEMENT-EXTRACT-ARRAY.
34510017092893662      02  STATEMENT-REC OCCURS 475 TIMES.
345200170928   |             05 STMTX-INVESTOR-NO        PIC S9(9).
345300170928   |             05 STMTX-ACCOUNT-NO         PIC S9(9).
345400170928   |             05 STMTX-SECTION-NO         PIC S9(2).
345500170928   |             05 STMTX-SECTION-SEQ        PIC S9(6).
345600170928   |             05 STMTX-LANGUAGE-CODE      PIC X(1).
345700170928   |             05 STMTX-DEALER-CODE        PIC X(4).
345800170928   |             05 STMTX-DEALER-REP-CODE    PIC X(6).
345900170928   |             05 STMTX-DATA               PIC X(1290).
346000170928   |             05 STMTX-SECTION-SEQ-2      PIC S9(6).
346100170928   |             05 STMTX-START-DATE         PIC S9(8).
346200170928   |             05 STMTX-END-DATE           PIC S9(8).
346300170928   |             05 STMTX-EOR-IND            PIC X(1).
346400170928   V       02 ISR                            PIC S9(3) VALUE 1.
346500170928R18147     02 ISRMAX                         PIC S9(3) VALUE 475.
346600170928      * RFS 38639 - begins.
346700170928       01  TMP-STATEMENT.
346800170928           05  TMP-STATEMENT-REC.
346900170928               10  TMP-STMTX-INVESTOR-NO        PIC S9(9).
347000170928               10  TMP-STMTX-ACCOUNT-NO         PIC S9(9).
347100170928               10  TMP-STMTX-SECTION-NO         PIC S9(2).
347200170928               10  TMP-STMTX-SECTION-SEQ        PIC S9(6).
347300170928               10  TMP-STMTX-LANGUAGE-CODE      PIC X(1).
347400170928               10  TMP-STMTX-DEALER-CODE        PIC X(4).
347500170928               10  TMP-STMTX-DEALER-REP-CODE    PIC X(6).
347600170928               10  TMP-STMTX-DATA               PIC X(1290).
347700170928               10  TMP-STMTX-SECTION-SEQ-2      PIC S9(6).
347800170928               10  TMP-STMTX-START-DATE         PIC S9(8).
347900170928               10  TMP-STMTX-END-DATE           PIC S9(8).
348000170928               10  TMP-STMTX-EOR-IND            PIC X(1).
348100170928           05  TMP-STMTX-CONTRACT-NO        PIC X(09).
348200170928           05  TMP-STMTX-RESET-NO           PIC X(03).
348300170928           05  SAV-TMP-STMTX-RESET-NO       PIC X(03).
348400170928           05  TOT-STATEMENT-REC.
348500170928               10  TOT-STMTX-INVESTOR-NO        PIC S9(9).
348600170928               10  TOT-STMTX-ACCOUNT-NO         PIC S9(9).
348700170928               10  TOT-STMTX-SECTION-NO         PIC S9(2).
348800170928               10  TOT-STMTX-SECTION-SEQ        PIC S9(6).
348900170928               10  TOT-STMTX-LANGUAGE-CODE      PIC X(1).
349000170928               10  TOT-STMTX-DEALER-CODE        PIC X(4).
349100170928               10  TOT-STMTX-DEALER-REP-CODE    PIC X(6).
349200170928               10  TOT-STMTX-DATA               PIC X(1290).
349300170928               10  TOT-STMTX-SECTION-SEQ-2      PIC S9(6).
349400170928               10  TOT-STMTX-START-DATE         PIC S9(8).
349500170928               10  TOT-STMTX-END-DATE           PIC S9(8).
349600170928               10  TOT-STMTX-EOR-IND            PIC X(1).
349700170928      * RFS 38639 - ends.
349800170928R19502*** Start
349900170928       01  ABN-ACCBENC1-ARRAY.
350000170928           02  ABN-ACCBENC1-FIELDS OCCURS 10 TIMES.
350100170928             05  ABN-BENEFICIARY-SEQ-NO      PICTURE S9(3) COMP-3.
350200170928             05  ABN-SALUTATION-CODE         PICTURE X(4).
350300170928             05  ABN-FIRST-NAME              PICTURE X(20).
350400170928             05  ABN-INITIALS                PICTURE X(3).
350500170928             05  ABN-LAST-NAME               PICTURE X(20).
350600170928             05  ABN-REVOCABLE               PICTURE X(1).
350700170928             05  ABN-SOCIAL-INSURANCE-NO     PICTURE S9(9).
350800170928             05  ABN-BENEFICIARY-TYPE        PICTURE X(1).
350900170928             05  ABN-DATE-OF-BIRTH           PICTURE S9(9) COMP-3.
351000170928             05  ABN-BENEFICIARY-STATUS      PICTURE X(2).
351100170928             05  ABN-RELATIONSHIP-TYPE       PICTURE X(3).
351200170928             05  ABN-SEX                     PICTURE X(1).
351300170928             05  ABN-CUSTODIAL-PARENT-NAME   PICTURE X(35).
351400170928             05  ABN-CONTRACT-DATE           PICTURE S9(9).
351500170928             05  ABN-LANGUAGE-CODE           PICTURE X(1).
351600170928             05  ABN-BENEFICIARY-TYPE-DESC   PICTURE X(25).
351700170928             05  ABN-BEN-RELATION-TYPE-DESCR PICTURE X(35).
351800170928132121       05  ABN-BEN-PERCENT             PICTURE S9(5)V9(2) COMP-3.
351900170928      * RFS 144030 STARTS
352000170928             05  ABN-SUCCESSOR-FIRST-NAME        PICTURE X(20).
352100170928             05  ABN-SUCCESSOR-INITIAL           PICTURE X(03).
352200170928             05  ABN-SUCCESSOR-LASTNAME          PICTURE X(20).
352300170928             05  ABN-FORMER-SPOUSE-FIRST-NAME    PICTURE X(20).
352400170928             05  ABN-FORMER-SPOUSE-INITIAL       PICTURE X(03).
352500170928             05  ABN-FORMER-SPOUSE-LASTNAME      PICTURE X(20).
352600170928             05  ABN-PREV-OWNER-FIRST-NAME       PICTURE X(20).
352700180820             05  ABN-PREV-OWNER-INITIAL          PICTURE X(03).
352800180820             05  ABN-PREV-OWNER-LASTNAME         PICTURE X(20).
352900170928172713       05  ABN-PREV-OWNER-DOB              PICTURE S9(9) COMP-3.
353000170928172713       05  ABN-PREV-OWNER-DOD              PICTURE S9(9) COMP-3.
353100170928      * RFS 144030 ENDS
353200170928      * RFS 149292 STARTS
353300170928       01  ABN-ACCBENC2-ARRAY.
353400170928           02  ABN-ACCBENC2-FIELDS OCCURS 10 TIMES.
353500170928             05  ABN-BENEFICIARY-SEQ-NO1     PICTURE S9(3) COMP-3.
353600170928             05  ABN-SALUTATION-CODE1        PICTURE X(4).
353700170928             05  ABN-FIRST-NAME1             PICTURE X(20).
353800170928             05  ABN-INITIALS1               PICTURE X(3).
353900170928             05  ABN-LAST-NAME1              PICTURE X(20).
354000170928             05  ABN-REVOCABLE1              PICTURE X(1).
354100170928             05  ABN-SOCIAL-INSURANCE-NO1    PICTURE S9(9).
354200170928             05  ABN-BENEFICIARY-TYPE1       PICTURE X(1).
354300170928             05  ABN-DATE-OF-BIRTH1          PICTURE S9(9) COMP-3.
354400170928             05  ABN-BENEFICIARY-STATUS1     PICTURE X(2).
354500170928             05  ABN-RELATIONSHIP-TYPE1      PICTURE X(3).
354600170928             05  ABN-SEX1                    PICTURE X(1).
354700170928             05  ABN-CUSTODIAL-PARENT-NAME1  PICTURE X(35).
354800170928             05  ABN-CONTRACT-DATE1          PICTURE S9(9).
354900170928             05  ABN-LANGUAGE-CODE1          PICTURE X(1).
355000170928             05  ABN-BENEFICIARY-TYPE-DESC1  PICTURE X(25).
355100170928             05  ABN-BEN-RELATION-TYPE-DESCR1 PICTURE X(35).
355200170928             05  ABN-BEN-PERCENT1            PICTURE S9(5)V9(2) COMP-3.
355300170928             05  ABN-SUCCESSOR-FIRST-NAME1       PICTURE X(20).
355400170928             05  ABN-SUCCESSOR-INITIAL1          PICTURE X(03).
355500170928             05  ABN-SUCCESSOR-LASTNAME1         PICTURE X(20).
355600170928             05  ABN-FORMER-SPOUSE-FIRST-NAME1   PICTURE X(20).
355700170928             05  ABN-FORMER-SPOUSE-INITIAL1      PICTURE X(03).
355800170928             05  ABN-FORMER-SPOUSE-LASTNAME1     PICTURE X(20).
355900170928             05  ABN-PREV-OWNER-FIRST-NAME1      PICTURE X(20).
356000180820             05  ABN-PREV-OWNER-INITIAL1         PICTURE X(03).
356100180820             05  ABN-PREV-OWNER-LASTNAME1        PICTURE X(20).
356200170928172713       05  ABN-PREV-OWNER-DOB1             PICTURE S9(9) COMP-3.
356300170928172713       05  ABN-PREV-OWNER-DOD1             PICTURE S9(9) COMP-3.
356400170928      * RFS 149292 ENDS
356500170928149292 01  li_NonBenCount                    PIC S9(02) VALUE 0.
356600170928       01  WS-ACCOUNT-BENE-WORK-FIELDS.
356700170928           05  ACCBENMAX                PICTURE S9(3) VALUE 10.
356800170928R19502*** End
356900170928R19502*** Start
357000170928       01  PAC-IVRPACC1-ARRAY.
357100170928           02  PAC-IVRPACC1-FIELDS OCCURS 10 TIMES.
357200170928           05  PAC-PAC-SEQ-NO            PICTURE S9(9).
357300170928           05  PAC-INVESTMENT-CODE       PICTURE X(5).
357400170928           05  PAC-DEPOSIT-AMT           PICTURE S9(13)V9(2).
357500170928           05  PAC-NEGOTIATED-COMM       PICTURE S9(7)V9(3).
357600170928           05  PAC-START-DATE            PICTURE S9(9) COMP-3.
357700170928           05  PAC-FREQUENCY-CODE        PICTURE X(2).
357800170928           05  PAC-PAC-AMT               PICTURE S9(11)V9(2) COMP-3.
357900170928           05  PAC-PAC-STATUS            PICTURE X(2).
358000170928           05  PAC-STOP-DATE             PICTURE S9(9) COMP-3.
358100170928           05  PAC-HOLD-UNTIL-DATE       PICTURE S9(9) COMP-3.
358200170928           05  PAC-SPLIT-OPTION-CODE     PICTURE X(1).
358300170928           05  PAC-SPLIT-OPTION-RULE     PICTURE X(1).
358400170928           05  PAC-CURRENCY              PICTURE X(3).
358500170928           05  PAC-BANK-NAME             PICTURE X(35).
358600170928           05  PAC-BANK-NAME-FRENCH      PICTURE X(35).
358700170928
358800170928       01  WS-INVESTOR-PAC-WORK-FIELDS.
358900170928           05  IVRPACMAX                PICTURE S9(3) VALUE 10.
359000170928R19502*** End
359100170928R19502*** Start
359200170928       01  AWD-ACCAWDC1-ARRAY.
359300170928           02  AWD-ACCAWDC1-FIELDS OCCURS 10 TIMES.
359400170928           05  AWD-AWD-SEQ-NO            PICTURE S9(3).
359500170928           05  AWD-START-DATE            PICTURE S9(9) COMP-3.
359600170928           05  AWD-FREQUENCY-CODE        PICTURE X(2).
359700170928           05  AWD-STOP-DATE             PICTURE S9(9) COMP-3.
359800170928           05  AWD-HOLD-UNTIL-DATE       PICTURE S9(9) COMP-3.
359900170928           05  AWD-AWD-PAYMENT-TYPE      PICTURE X(1).
360000170928           05  AWD-AWD-STATUS            PICTURE X(2).
360100170928           05  AWD-CURRENCY              PICTURE X(3).
360200170928           05  AWD-INVESTMENT-CODE       PICTURE X(5).
360300170928           05  AWD-AWD-AMOUNT            PICTURE S9(11)V9(2) COMP-3.
360400170928           05  AWD-AWD-PERCENT           PICTURE S9(5)V9(2) COMP-3.
360500170928           05  AWD-AWD-UNITS             PICTURE S9(10)V9(3) COMP-3.
360600170928           05  AWD-SPLIT-OPTION-CODE     PICTURE X(1).
360700200827           05  AWD-GROSS-OR-NET          PICTURE X(1).
360800170928           05  AWD-SPLIT-OPTION-RULE     PICTURE X(1).
360900170928186053     05  AWD-USE-WITHD-HIER        PICTURE X(1).
361000170928
361100170928       01  WS-ACCOUNT-AWD-WORK-FIELDS.
361200170928           05  ACCAWDMAX                PICTURE S9(3) VALUE 10.
361300170928R19502*** End
361400170928R34848***RFS34848 - Start
361500170928       01  ltb_TransDedArray.
361600170928           02  lc_TransDedRec       OCCURS 100 TIMES.
361700170928           05  lc_TransDedCode            PICTURE X(04).
361800170928           05  ln_TransDedCharge          PICTURE S9(11)V9(2) COMP-3.
361900170928
362000170928       01  ln_TransDedWorkField.
362100170928           05 li_DedMax                   PICTURE 9(3) VALUE 0.
362200170928           05 li_DedIndex                 PICTURE 9(3) VALUE 0.
362300170928R34848***RFS34848 - End
362400170928
362500170928R17626 01  WS-STR-YY-MM-DD               PICTURE 9(8).
362600170928   |   01  WS-STR-YY-MM-DD-R   REDEFINES WS-STR-YY-MM-DD.
362700170928   |       05  WS-STR-YY                 PICTURE 9(4).
362800170928   |       05  WS-STR-MM                 PICTURE 9(2).
362900170928   |       05  WS-STR-DD                 PICTURE 9(2).
363000170928   |
363100170928   |   01  WS-END-YY-MM-DD               PICTURE 9(8).
363200170928   |   01  WS-END-YY-MM-DD-R   REDEFINES WS-END-YY-MM-DD.
363300170928   |       05  WS-END-YY                 PICTURE 9(4).
363400170928   |       05  WS-END-MM                 PICTURE 9(2).
363500170928   |       05  WS-END-DD                 PICTURE 9(2).
363600170928   |
363700170928   |   01  WS-LDA-YY-MM-DD               PICTURE 9(8).
363800170928   |   01  WS-LDA-YY-MM-DD-R  REDEFINES  WS-LDA-YY-MM-DD.
363900170928   |       05  WS-LDA-YY                 PICTURE 9(4).
364000170928   |       05  WS-LDA-MM                 PICTURE 9(2).
364100170928   |       05  WS-LDA-DD                 PICTURE 9(2).
364200170928   |
364300170928   |   01  WS-LEAP-YEAR-WORK.
364400170928   V       05  WS-LEAP-YEAR              PICTURE 9(4).
364500170928R17626     05  WS-LEAP-YR-REMAINDER      PICTURE 9(2).
364600170928
364700170928R18312 01  WS-FGN-CONT-PCT               PICTURE S9(3)V9(2).
364800170928R18312 01  WS-AVAIL-FGN-CONT-PCT         PICTURE S9(3)V9(2).
364900170928R18312 01  WS-AVAIL-FGN-CONTENT          PICTURE S9(11)V9(2).
365000170928
365100170928R18312 01  WS-WITHD-TOT                  PICTURE S9(11)V9(2).
365200170928R18312 01  WS-DEPOSIT-TOT                PICTURE S9(11)V9(2).
365300170928R18312 01  WS-WITHD-TOT-CAD              PICTURE S9(11)V9(2).
365400170928R18312 01  WS-DEPOSIT-TOT-CAD            PICTURE S9(11)V9(2).
365500170928R18312 01  WS-WITHD-TOT-USD              PICTURE S9(11)V9(2).
365600170928R18312 01  WS-DEPOSIT-TOT-USD            PICTURE S9(11)V9(2).
365700170928
365800170928R21714 01  WS-SUPP-NOMINEE               PICTURE X(1).
365900170928
366000170928R18515 01  WS-FIRST-TRADE-TRANSACTION    PICTURE S9(8).
366100170928R18515 01  WS-CURRENT-ACCOUNT-DEC        PICTURE S9(9).
366200170928
366300170928R18814 01  WS-IPS-GROUP-ID-ACC           PICTURE X(20) VALUE " ".
366400170928R18814 01  WS-ACCOUNT-NO-ROR             PICTURE S9(9).
366500170928R18814 01  WS-INVESTMENT-CODE-ROR        PICTURE X(5).
366600170928R18814 01  WS-ACCOUNT-CREATION-DATE-ROR  PICTURE S9(8).
366700170928R18814 01  WS-STMT-END-DATE-ROR          PICTURE S9(8).
366800170928R18814 01  WS-SECTION-NO-ROR             PICTURE X(2).
366900170928R18814 01  WS-PROGRAM-NAME               PICTURE X(3) VALUE "ANN".
367000170928      * RFS21503 Start
367100171219       01  WS-FROM-INVESTMENT-CODE       PICTURE X(5).
367200170928       01  WS-TO-INVESTMENT-CODE         PICTURE X(5).
367300170928       01  WS-STANDARD-COMMISSION        PICTURE X(1).
367400170928      * RFS21503 End
367500170928
367600170928      * RFS27684 - Starts *
367700170928R22986*01  WS-SPMODAUTH-ID               PICTURE X(10).
367800170928R22986*01  WS-SPMODAUTH-STMCTLRPT        PICTURE X(1).
367900170928      * RFS27684 - Ends *
368000170928R34848*RFS34848 - Start
368100170928       01  lnc_Y                         PICTURE X(1) VALUE "Y".
368200170928       01  lnc_C                         PICTURE X(1) VALUE "C".
368300170928106701*--- Beg        -----------------------------------------------*
368400170928       01  lnc_O                         PICTURE X(1) VALUE "O".
368500170928106701*--- Beg End    -----------------------------------------------*
36860017092842749  01  lnc_S                         PICTURE X(1) VALUE "S".
368700170928       01  lnc_101                       PICTURE 9(3) VALUE 101.
368800170928       01  lnc_81                        PICTURE 9(2) VALUE 81.
368900170928R34848*RFS34848 -End
369000170928
36910017092866105  01  lc-Line80             Pic X(80) Value " ".
36920017092866105  01  lc-PostalCode         Pic X(11) Value " ".
369300170928
369400170928R64262 01 LC-RESET-TYPE.
369500170928  ]       05 LC-GBV              PIC X(3) VALUE "GBV".
369600170928  ]       05 LC-GDV              PIC X(3) VALUE "GDV".
369700170928  ]
369800170928  ]    01 LC-RESET-DATE-TYPE.
369900170928  ]       05 Ld-LastRestDateGBV     PIC S9(8).
370000170928  ]       05 Lc-ResetTypeGBV        PIC X(3) VALUE "   ".
370100170928  ]       05 Ld-LastRestDateGDV     PIC S9(8).
370200170928  ]       05 Lc-ResetTypeGDV        PIC X(3) VALUE "   ".
370300170928  |       05 Ln-AccountNo           PIC S9(9).
370400170928  |       05 Ln-ResetContractNo     PIC S9(9).
370500170928  |       05 Ln-ResetNo             PIC S9(4).
370600170928  |
370700170928  |    01 Ld-AutoResetSchDates.
370800170928  |       05 Lc-AutoResetSchCode    PIC X(5) VALUE "  ".
370900170928R74979    05 Lc-ResetSchCode        PIC X(5) VALUE "  ".
371000170928  |       05 Lc-AccountTypeCode     PIC X(5) VALUE "  ".
371100170928  |       05 Ld-GBVStartDate        PIC S9(8).
371200170928  |       05 Ld-GBVEndDate          PIC S9(8).
371300170928  |       05 Ld-GDVStartDate        PIC S9(8).
371400170928  |       05 Ld-GDVEndDate          PIC S9(8).
371500170928  V       05 Ld-RestFreqGDV         PIC S9(2).
371600170928R64262    05 Ld-RestFreqGBV         PIC S9(2).
371700170928R74979*   05 Ld_NoOfResets          PIC S9(4).
371800170928137921    05 Ld_NoOfResets          PIC S9(4)  VALUE 0.
371900170928R74979    05 Ld_StartDateRst        PIC S9(08) VALUE 0.
372000170928R74979    05 Ld_EndDateRst          PIC S9(08) VALUE 0.
372100170928R74979    03 Ld_NewGuarantMatVal    PIC S9(11)V9(2) VALUE 0.
372200170928R74979    03 Ld_OldGuarantMatVal    PIC S9(11)V9(2) VALUE 0.
372300170928117144    03 lc_MultiTypeRule       PIC X(1) VALUE " ".
372400170928117144    03 lc_ResetType           PIC X(3) VALUE " ".
372500170928      * RFS76998 Begin
372600170928       01 Ld-amt                    PIC S9(11)V9(2) VALUE 0.
372700170928       01 Ld-year                   PIC S9(4) VALUE 0.
372800170928       77 IND9                      PIC S9(4) BINARY.
372900170928      *******
373000170928      * RFS45413 Begin
37310017092857553**01  ln-parm-account-no            PIC S9(9).
37320017092857553**01  ln-parm-end-date              PIC S9(8).
373300170928      * RFS45413 End
373400170928      * RFS 142884 STARTS
373500170928       01 WS-INVNO-SEC01          PICTURE S9(9).
373600170928       01 WS-PDATE-SEC80          PICTURE S9(8).
373700170928       01 WS-TRNNO-SEC80          PICTURE S9(9).
373800170928       01 WS-TERM-SEC80           PICTURE S9(4)V9(3).
373900170928       01 WS-ACINT-SEC25          PICTURE S9(11)V9(2).
374000170928       01 WS-ACINT-STDATE-SEC25   PICTURE S9(11)V9(2).
374100170928       01 WS-ACINT-PERIOD-SEC25   PICTURE S9(11)V9(2).
374200170928       01 WS-CIDNO-SEC25          PICTURE S9(10).
374300170928       01 WS-FLAG-SEC25           PICTURE X(1).
374400170928       01 WS-COUNT1-SEC25         PICTURE S9(5).
374500170928       01 WS-COUNT2-SEC25         PICTURE S9(5).
374600170928       01 WS-GLWACR-SEC40         PICTURE X(1).
374700170928       01 WS-LWA-RES-SEC40        PICTURE X(1).
374800170928       01 WS-INVESTOR-EXTN        PIC S9(10).
374900170928       01 WS-INVESTOR-FAX         PIC X(60).
375000170928       01 WS-INVESTOR-EMAIL       PIC X(60).
375100170928       01 WS-TERM-GROUP           PIC X(10).
375200170928       01 WS-INTEREST-RATE        PICTURE S9(4)V9(3).
375300170928       01 WS-CERTIFICATE-NO       PICTURE X(12).
375400170928       01 WS-CLBAL1-SEC25         PICTURE S9(10)V9(3).
375500170928       01 WS-UNITPR1-SEC25        PICTURE S9(5)V9(4).
375600170928       01 WS-TRNO2-SEC25          PIC S9(9).
375700170928       01 WS-PLDATE2-SEC25        PIC S9(9).
375800170928       01 WS-CLBAL2-SEC25         PICTURE 9(10)V9(3).
375900170928       01 WS-UNITPR2-SEC25        PICTURE 9(5)V9(4).
376000170928       01 WS-PRDATE2-SEC25        PIC S9(9).
376100170928       01 WS-TRDATE2-SEC25        PIC S9(9).
376200170928       01 WS-LDA-ENDDTES          PIC S9(8).
376300170928       01 WS-LDA-STRDTES          PIC S9(8).
376400170928       01 WS-CLOBAL-SEC25         PICTURE S9(11)V9(2).
376500170928       01 WS-BALFRW-SEC25         PICTURE S9(11)V9(2).
376600170928       01 WS-MAX-FIELDS-SEC25     PIC X(36).
376700170928158368*01 WS-DEPOSIT              PICTURE S9(11)V9(2).
376800170928158368 01 WS-DEPOSIT              PICTURE S9(13)V9(2).
376900170928158368*01 WS-REDEM                PICTURE S9(11)V9(2).
377000170928158368 01 WS-REDEM                PICTURE S9(13)V9(2).
377100170928      * RFS 142884 ENDS
377200170928148326 01 ln-AT-TRANS-BOOK-VALUE  PICTURE S9(09)V9(2).
377300170928156507 01 ln-AT-TRANS-BOOK-VALUE-S79  PICTURE S9(09)V9(2).
377400170928148326 01 ln-AAI-ORG-COST-INF     PICTURE S9(11)V9(2).
377500170928148326 01 ln-AAI-ORG-COST-TOT     PICTURE S9(11)V9(2).
377600170928148326 01 WS-INVESTOR-SUMMARY-SEC12-98.
377700170928148326    10  WS-IS2-INT-INCEPT-CASH-98     PIC S9(11)V9(2) VALUE 0.
377800170928148326    10  WS-IS2-CPG-INCEPT-CASH-98     PIC S9(11)V9(2) VALUE 0.
377900170928148326    10  WS-IS2-INC-INCEPT-CASH-98     PIC S9(11)V9(2) VALUE 0.
378000170928160284 01 li_AccCrtDate                     PIC 9(9) value 0.
378100170928144587 01 ld_PrevYTD          PIC S9(8)      VALUE ZEROS.
378200170928144587 01 ld_PREV_START_DT    PIC S9(8)      VALUE ZEROS.
378300170928      *RFS  149292 STARTS
378400170928       01 lb-CURSOR-ACCBENC1-OPENED-FLAG  PIC  X.
378500170928          88 CURSOR-ACCBENC1-OPENED     VALUE "Y".
378600170928          88 CURSOR-ACCBENC1-CLOSED     VALUE "N".
378700170928       01 lb-CURSOR-ACCBENC2-OPENED-FLAG  PIC  X.
378800170928          88 CURSOR-ACCBENC2-OPENED     VALUE "Y".
378900170928          88 CURSOR-ACCBENC2-CLOSED     VALUE "N".
379000170928      * RFS 149292 ENDS
379100170928152312 01 li_Acct-No                      PIC S9(9)      VALUE 0.
379200170928152312 01 lc_Invest-Code                  PIC X(5)       VALUE " ".
379300170928152312 01 li_CertID-No                    PIC S9(10)     VALUE 0.
379400170928152312 01 li_Cert-AccrInt                 PIC S9(11)V99  VALUE 0.
379500170928152312 01 li_Cert-Bal                     PIC S9(11)V99  VALUE 0.
379600170928156872 01 WS_COUNT                      PIC S9(9) VALUE 0.
379700170928156872 01 WS_ACC_NO                     PIC S9(9) VALUE 0.
379800170928      *RFS163790 START
379900170928      *RFS162048 START
380000170928      *01  ACC-AWD-REC.
380100170928      *    05  AWD-ACCOUNT-NO            PICTURE S9(9).
380200170928      *    05  AWD-SEQ-NUM               PICTURE S9(3).
380300170928      *    05  START_DATE                PICTURE S9(9).
380400170928      *    05  FREQUENCY_CODE            PICTURE X(2).
380500170928      *    05  STOP_DATE                 PICTURE S9(9) COMP-3.
380600170928      *    05  HOLD_UNTIL_DATE           PICTURE S9(9) COMP-3.
380700170928      *    05  NO_OF_WITHDRAWALS         PICTURE S9(3).
380800170928      *    05  WITHDRAWALS_TAKEN         PICTURE S9(3).
380900170928      *    05  NEXT_PAYMENT_DATE         PICTURE S9(9) COMP-3.
381000170928      *    05  LAST_PAYMENT_DATE         PICTURE S9(9) COMP-3.
381100170928      *    05  AWD_PAYMENT_TYPE          PICTURE X(1).
381200170928      *    05  AWD_STATUS                PICTURE X(2).
381300170928      *    05  AW_CURRENCY               PICTURE X(3).
381400170928      *01 LI_END_DATE                    PICTURE S9(9) COMP-3.
381500170928      *01 lb-CursorFlag                 PIC X(01) VALUE SPACE.
381600170928      *    88 lb-CursorOk                     VALUE SPACES.
381700170928      *    88 lb-CursorEnd                    VALUE "7".
381800170928      *RFS162048 END
381900170928      *RFS163790 END
382000170928      *RFS163727 START
382100170928       01 WS_COUNT_TRN                   PIC S9(9) VALUE "0".
382200170928       01 LN_LDA_STRDTE                  PIC S9(8).
382300170928       01 LN_LDA_ENDDTE                  PIC S9(8).
382400170928      *RFS163727 END
382500170928164374 01 WS-INV-SAJ-INCEPT  PIC S9(11)V99 VALUE 0.
382600171011164374 01 WS-ACC-SAJ-INCEPT  PIC S9(11)V99 VALUE 0.
382700171017      *******
382800171014      ** RFS171359 - Start **
382900171014       01 WS-WRITE-INVEST-CWT            PIC X(01).
383000171011       01 ln_Trans_Arr_Count             PIC S9(05).
383100171011       01 ln_CWT_Trans_Count             PIC S9(05).
383200171011       01 ln_Trans_Arr_Count_Max         PIC S9(05).
383300171011       01 WS-IS2-BUY-FIRST-N             PIC S9(11)V99 VALUE 0.
383400171011       01 WS-IS2-SWI-FIRST-N             PIC S9(11)V99 VALUE 0.
383500171201       01 WS-IS2-TRI-FIRST-N             PIC S9(11)V99 VALUE 0.
383600180323      ** RFS171359 - End   **
383700180323175900 01 WS-FIRST-PURCHASE-DATE         PIC S9(08).
383800180323      ** RFS177423 - Start **
383900180323       01 lc_Excg_Rate_Type              PIC X(01).
384000180323       01 ln_ExchangeRate                PIC S9(2)V9(7).
384100180323       01 ln_TradeDate                   PIC S9(09).
384200180627       01 lc_Investment_Code             PIC X(05).
384300180627      ** RFS177423 - End   **
384400180627
384500180627      ** RFS177152 START   **
384600180627       01 WS-LWA-Details.
384700180627          05 WS-LWA-Details-DEF OCCURS 500 TIMES
384800180627                                         INDEXED BY WS-LWADIDX.
384900180627             15 WS-PARM-ARRAY-INVESTM-SERIES
385000180705                                         PIC X(5).
385100180627             15 WS-PARM-ARRAY-AGE-UPPER-LIMIT
385200180627                                         PIC S9(3).
385300180627             15 WS-PARM-ARRAY-GWA-PERCENT
385400180627                                         PIC S9(7)V9(2) COMP-3.
385500180627             15 WS-PARM-ARRAY-ALT-GWA-PERCENT
385600180627                                         PIC S9(7)V9(2) COMP-3.
385700180627             15 WS-PARM-ARRAY-LWA-Projection
385800180627                                         PIC X(1).
385900180627       01 WS-SGGWBR-Details.
386000180627          05 WS-SGGWBR-Details-DEF OCCURS 500 TIMES
386100180627                                         INDEXED BY WS-GGWBIDX.
386200180627             15 WS-PARM-INVESTMENT-SERIES
386300180627                                         PIC X(5).
386400180627             15 WS-PARM-CONT-AGE-UPPER-LIMIT
386500180627                                         PIC S9(3).
386600180627             15 WS-PARM-BONUS-PERCENT
386700180627                                         PIC S9(7)V9(2) COMP-3.
386800180627             15 WS-PARM-SKIP-SELL-TAKEN
386900180627                                         PIC X(1).
387000180627             15 WS-PARM-AGE-THRESHOLD
387100180627                                         PIC S9(4) COMP-3.
387200180627       01 WS-GBB-Calc                    PIC S9(11)V99.
387300180627       01 WS-GWB-Calc                    PIC S9(11)V99.
387400180627       01 li_RecordCount                 PIC S9(08).
387500180627       01 WS-TEMP-STRDTE                 PIC S9(8).
387600180627       01 WS-TEMP-ENDDTE                 PIC S9(8).
387700180725       01 WS-LWA-ROW-CNT                 PIC 9(01).
387800180705       01 WS-GLWA-Ann-Calendar-Age       PIC 9(03).
387900180705       01 WS-BONUS-AGE-THRESHOLD         PIC 9(03).
388000180627       01 WS-AGE-UPPER-LIMIT-LWA         PIC 9(03).
388100180627       01 WS-AGE-UPPER-LIMIT-LWA-PRE     PIC 9(03).
388200180627       01 WS-GWA-PERCENT-GGWB            PIC S9(7)V9(2) COMP-3.
388300180627       01 WS-INVEST-SERIES-LWA           PIC X(5).
388400180703       01 WS-GWA-PERCENT-LWA             PIC S9(7)V9(2) COMP-3.
388500180703       01 WS-LWA-PROJECTION-SET          PIC X(1).
388600180627       01 WS-GBBBonusAmount              PIC S9(11)V99.
388700180731       01 WS-GWBProjectionAmount         PIC S9(11)V99.
388800180731       01 WS-LWA-PROJECT                 PIC S9(11)V99.
388900180731       01 li_AnnDOBTemp.
389000180627          03 li_AnnDOBYYYYTemp           PIC  9(4).
389100190110          03 li_AnnDOBMMDDTemp           PIC  9(4).
389200190117      ** RFS177152 END     **
389300190110
389400190110      ** RFS 180850 START **
389500190110       01 Lncc_E                         PIC X(01) VALUE "E".
389600190110       01 Lncc_CLTSTCLT                  PIC X(10) VALUE "CLTSTCLT".
389700190110       01 Lncc_CONFMCLT                  PIC X(10) VALUE "CONFMCLT".
389800190110       01 Li_InvestorNo                  PIC S9(09).
389900190626       01 Lc_TypeMatch                   PIC X(10).
390000190626      ** RFS 180850 END **
390100190715
390200190715      ** RFS 183097 START **
390300190715       01  lc_TenantName               PIC X(45).
390400190715      *    03 lc_Lastname              PIC X(20).
390500190702      *    03 lc_FirstName             PIC X(20).
390600190702      *    03 lc_Initial               PIC X(03).
390700190702       01  lc_TName.
390800190628           03 lc_Lname                 PIC X(20).
390900190626           03 lc_Init                  PIC X(03).
391000190919       01 ln_rowcount           PIC S9(3) VALUE 0.
391100190919      ** RFS 183097 END **
391200190919      ** RFS 183449 START **
391300190919       01 Lc-Acct-Type-Code              PIC X(05) VALUE SPACES.
391400190919       01 Lc-Lang-Code                   PIC X(01) VALUE SPACES.
391500190919       01 Lc-Nominee-Acct-Type           PIC X(05) VALUE SPACES.
391600190919       01 Lc-Acct-Type-Code-Lang         PIC X(05) VALUE SPACES.
391700190924       01 Lc-Nominee-Acct-Type-Lang      PIC X(05) VALUE SPACES.
391800190924      ** RFS 183449 END **
391900190919      *RFS184715 - Begin
392000190919       01  lc_ScreenAllowed_STMATL.
392100190919           05 lc_STMATL_ScreenCode        PIC X(8) VALUE "STMTJSI".
392200190919           05 lc_STMATL_EditCode          PIC X(6) VALUE "STMATL".
392300190919           05 lc_STMATL_EditLevel         PIC X(1) VALUE "A".
392400190919           05 lc_STMATL_RtnFlag           PIC X(1).
392500201224              88 lb_STMATL_EditExists        Value "Y".
392600201224      *RFS184715 - End
392601211003      *RFS186592 Starts
392602211003       01  lc_Acclevelreset.
392603211003           05 ln_Old-Guar-Base            PIC S9(11)V9(2) COMP-3.
392604211003           05 ln_New-Guar-Base            PIC S9(11)V9(2) COMP-3.
392605211003           05 ln_GDV-EffectiveDate        PIC S9(8).
392606211003           05 ln_GBV-EffectiveDate        PIC S9(8).
392607211003           05 ln_EffectiveDate            PIC S9(8).
392608211003           05 ln_AccResetLvlCnt           PIC 9(3).
392609211003           05 lc_ResetTyp                 PIC X(3).
392610211003           05 ln_AccResetAccNo            PIC S9(9).
392611211003           05 lc_GuarResetLevelGDV        PIC X(01).
392612211003           05 lc_GuarResetLevelGBV        PIC X(01).
392613211003           05 ln-Lda-Strdte-S90           PIC S9(8).
392614211003           05 ln-Lda-Enddte-S90           PIC S9(8).
392615211003           05 ln_SectionSeqNoAR           PIC 9(6).
392616211003           05 lc_Rec_Exist                PIC X(01).
392617211003              88 lb_Rec_ExistYes          VALUE "Y".
392618211003              88 lb_Rec_ExistNo           VALUE "N".
392619211003       01 WS-ACCRESET-ARRAY.
392620211003           05 WS-AR-REC OCCURS 50 TIMES INDEXED BY ARIDX.
392621211003              07 AR-ACCOUNT-NO            PIC 9(9).
392622211003              07 AR-RESET-TYPE            PIC X(03).
392623211003              07 AR-OLD-GUAR-BASE         PIC S9(11)V99 COMP-3.
392624211003              07 AR-NEW-GUAR-BASE         PIC S9(11)V99 COMP-3.
392625211003              07 AR-EFFECTIVE-DATE        PIC 9(9).
392626211003      *RFS186592 Ends
392700201224      *RFS186198 START
392800201224       01 lc_Mfasegparm.
392900201224         05 FILLER                    PIC X(29).
393000201224         05 lc_PolicyLevel            PIC X(01) VALUE SPACES.
393100201224         05 FILLER                    PIC X(20).
393200201224         05 lc_AccountGuarantees      PIC X(01).
393300201224           88 lb_AccountGuaranteesYes VALUE "Y".
393400210902           88 lb_AccountGuaranteesNo  VALUE "N".
393500210902      *RFS186198 END
401000211007      * RFS1117445 - START
401001211007       01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
401002211017112133*01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
401003211017112133 01 ln_InvArrayInitialSize     PIC S9(9) VALUE 1000.
401004211007       01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
401005211007       01  WS-SEG-PARMS.
401006211007               05 WS-PARM-ACCOUNT-NO         PIC 9(9).
401007211007               05 WS-PARM-CONTRACT-NO        PIC 9(9).
401008211007               05 WS-PARM-END-DATE           PIC 9(8).
401009211007177152         05 WS-PARM-GUAR-DTH-RULE      PIC X(1).
401010211007               05 WS-PARM-ACC-CON-INV-ARRAY-DEF.
401011211007111744*           10 WS-PARM-ACC-CON-INV-ARRAY OCCURS 100
401012211007111744*                                     INDEXED BY WS-ACIIDX.
401013211007111744         10 WS-PARM-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES
401014211007111744            DEPENDING ON ln_InvArraySize INDEXED BY WS-ACIIDX.
401015211007                     15 WS-PARM-ARRAY-ACCOUNT-NO
401016211007                                             PIC 9(9).
401017211007                     15 WS-PARM-ARRAY-CONTRACT-NO
401018211007                                             PIC 9(9).
401019211007                     15 WS-PARM-ARRAY-INVESTMENT-CODE
401020211007                                             PIC  X(5).
401021211007                     15 WS-PARM-ARRAY-NET-DEP-VALUE
401022211007                                             PIC S9(11)V9(2) COMP-3.
401023211007                     15 WS-PARM-ARRAY-GUAR-BASE-VALUE
401024211007                                             PIC S9(11)V9(2) COMP-3.
401025211007                     15 WS-PARM-ARRAY-CURR-UNIT-BAL
401026211007                                             PIC S9(10)V9(3) COMP-3.
401027211007177152               15 WS-PARM-ARRAY-GUAR-DTH-VALUE
401028211007177152                                       PIC S9(11)V9(2) COMP-3.
401029211007R12734* *****  END  *****
401030211007R13184* ***** BEGIN *****
401031211007       01  WS-SEGO-PARMS.
401032211007               05 WS-PARMO-ACCOUNT-NO         PIC 9(9).
401033211007               05 WS-PARMO-CONTRACT-NO        PIC 9(9).
401034211007               05 WS-PARMO-END-DATE           PIC 9(8).
401035211007177152         05 WS-PARMO-GUAR-DTH-RULE      PIC X(1).
401036211007               05 WS-PARMO-ACC-CON-INV-ARRAY-DEF.
401037211007               10 WS-PARMO-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES
401038211007                  DEPENDING ON ln_InvArraySize INDEXED BY WS-ACIIDXO.
401039211007                     15 WS-PARMO-ARRAY-ACCOUNT-NO
401040211007                                             PIC 9(9).
401041211007                     15 WS-PARMO-ARRAY-CONTRACT-NO
401042211007                                             PIC 9(9).
401043211007                     15 WS-PARMO-ARRAY-INVESTMENT-CODE
401044211007                                             PIC  X(5).
401045211007                     15 WS-PARMO-ARRAY-NET-DEP-VALUE
401046211007                                             PIC S9(11)V9(2) COMP-3.
401047211007                     15 WS-PARMO-ARRAY-GUAR-BASE-VALUE
401048211007                                             PIC S9(11)V9(2) COMP-3.
401049211007                     15 WS-PARMO-ARRAY-CURR-UNIT-BAL
401050211007                                             PIC S9(10)V9(3) COMP-3.
401051211007177152               15 WS-PARMO-ARRAY-GUAR-DTH-VALUE
401052211007177152                                       PIC S9(11)V9(2) COMP-3.
401053211007R13184* *****  END  *****
401054211007      * RFS37906 - Begins                                              *
401055211007       01  WS-GVB-PARMS.
401056211007               05 WS-PARMG-ACCOUNT-NO         PIC 9(9).
401057211007               05 WS-PARMG-CONTRACT-NO        PIC 9(9).
401058211007               05 WS-PARMG-END-DATE           PIC 9(8).
401059211007               05 WS-PARMG-ACC-CON-INV-ARRAY-DEF.
401060211007               10 WS-PARMG-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES
401061211007                  DEPENDING ON ln_InvArraySize INDEXED BY WS-ACIIDXG.
401062211007                     15 WS-PARMG-ARRAY-ACCOUNT-NO
401063211007                                             PIC 9(9).
401064211007                     15 WS-PARMG-ARRAY-CONTRACT-NO
401065211007                                             PIC 9(9).
401066211007                     15 WS-PARMG-ARRAY-INVESTMENT-CODE
401067211007                                             PIC  X(5).
401068211007                     15 WS-PARMG-ARRAY-NET-DEP-VAL
401069211007                                             PIC S9(11)V9(2) COMP-3.
401070211007                     15 WS-PARMG-ARRAY-GUAR-DEATH-VAL
401071211007                                             PIC S9(11)V9(2) COMP-3.
401072211007                     15 WS-PARMG-ARRAY-CURR-UNIT-BAL
401073211007                                             PIC S9(10)V9(3) COMP-3.
401074211007      * RFS1117445 - END
401075211007
401100210623      * RFS186199 - Begin
401200210623       01  INVESTOR-SUMMARY-SECTION14-FMT.
401300210623           03  FMT-SERIES-ID                   PIC X(5).
401400210623           03  FMT-SERIES-DESCRIPTION          PIC X(45).
401500210623           03  FMT-SERIES-DESCRIPTION-FRENCH   PIC X(45).
401600210623           03  FMT-ELECTION-DATE               PIC S9(8) VALUE 0.
401700210623           03  FMT-EXERCISE-DATE               PIC S9(8) VALUE 0.
401800210623           03  FMT-ELIGIBLE-DATE               PIC S9(8) VALUE 0.
401900210623           03  FMT-GWA-START-DATE              PIC S9(8) VALUE 0.
402000210623           03  FMT-GLWA-WITHDRAWN-YTD-VALUE    PIC S9(11)V9(2) VALUE 0.
402100210623           03  FMT-GLWA-WITHDR-YTD-VAL-SIGN    PIC X(1).
402200210623           03  FMT-GLWA-REMAINING-YTD-VALUE    PIC S9(11)V9(2) VALUE 0.
402300210623           03  FMT-GLWA-REMAIN-YTD-VAL-SIGN    PIC X(1).
402400210623           03  FMT-GLWA-PREVIOUS-YR-VALUE      PIC S9(11)V9(2) VALUE 0.
402500210623           03  FMT-GLWA-PREV-YR-VALUE-SIGN     PIC X(1).
402600210623           03  FMT-GLWA-RATE                   PIC S9(3)V9(2) VALUE 0.
402700210623           03  FMT-EXCESS-GLWA-WITHDR-YTD-VAL  PIC S9(11)V9(2) VALUE 0.
402800210623           03  FMT-EXCESS-WITHDR-YTD-VAL-SIGN  PIC X(1).
402900210623           03  FMT-GLWA-AWD-WITHDRAWAL-OPTION  PIC X(1).
403000210623           03  FMT-GLWA-AWD-WITHDRAWAL-AMOUNT  PIC S9(11)V9(2) VALUE 0.
403100210623           03  FMT-GLWA-AWD-SPLIT-OPTION       PIC X(1).
403200210623           03  FMT-FIE-BASE-VALUE              PIC S9(11)V9(2) VALUE 0.
403300210623           03  FMT-FIE-BASE-VALUE-SIGN         PIC X(1).
403400210623           03  FMT-BONUS-ELIG-INDICATOR        PIC X(1).
403500210623           03  FMT-BONUS-ADDED-TO-GW-BASE      PIC S9(11)V9(2) VALUE 0.
403600210623           03  FMT-BONUS-ADDED-TO-GW-BASE-DTE  PIC S9(8) VALUE 0.
403700210623           03  FMT-BONUS-PERCENTAGE            PIC S9(3)V9(2) VALUE 0.
403800210623           03  FMT-GBB-PREVIOUS-VALUE          PIC S9(11)V9(2) VALUE 0.
403900210623           03  FMT-GBB-RESULTING-VALUE         PIC S9(11)V9(2) VALUE 0.
404000210623           03  FMT-GLWA-INITIAL-DEPOSIT-DAYS   PIC S9(5) VALUE 0.
404100210623           03  FMT-ORIGINAL-GLWA               PIC S9(11)V9(2) VALUE 0.
404200210623           03  FMT-GLWA-RIF-MIN                PIC S9(11)V9(2) VALUE 0.
404300210623           03  FMT-GW-BASE-VALUE               PIC S9(11)V9(2) VALUE 0.
404400210623           03  FMT-GW-BASE-VALUE-SIGN          PIC X(1).
404500210623           03  FMT-GWB-PREVIOUS-VALUE          PIC S9(11)V9(2) VALUE 0.
404600210623           03  FMT-GWB-RESULTING-VALUE         PIC S9(11)V9(2) VALUE 0.
404700210623           03  FMT-NW-BASE-VALUE               PIC S9(11)V9(2) VALUE 0.
404800210623           03  FMT-NW-BASE-VALUE-SIGN          PIC X(1).
404900210623           03  FMT-NWB-PREVIOUS-VALUE          PIC S9(11)V9(2) VALUE 0.
405000210623           03  FMT-NWB-RESULTING-VALUE         PIC S9(11)V9(2) VALUE 0.
405100210706           03  FMT-RIDER-CANCELLATION-DATE     PIC S9(8) VALUE 0.
405200210623           03  FMT-LAST-RESET-DATE             PIC S9(8) VALUE 0.
405300210623           03  FMT-ACCOUNT-MARKET-VALUE        PIC S9(11)V9(2) VALUE 0.
405400210623           03  FMT-FIRST-ELIGIBLE-WITHDR-AMT   PIC S9(11)V9(2) VALUE 0.
405500210623           03  FMT-MDBA-RESET-DATE             PIC S9(8) VALUE 0.
405600210623           03  FMT-PREVIOUS-MDBA-RESET-AMT     PIC S9(11)V9(2) VALUE 0.
405700210623           03  FMT-RESULTING-MDBA-RESET-AMT    PIC S9(11)V9(2) VALUE 0.
405800210623           03  FMT-MDBA-INFLATION-ADJ-AMT      PIC S9(11)V9(2) VALUE 0.
405900210623           03  FMT-MDBA-NON-INFLATION-ADJ-AMT  PIC S9(11)V9(2) VALUE 0.
406000210623           03  FMT-ACCOUNT-GUAR-MAT-VALUE      PIC S9(11)V9(2) VALUE 0.
406100210623           03  FMT-ACCOUNT-GUAR-DEATH-VALUE    PIC S9(11)V9(2) VALUE 0.
406200210623           03  FMT-COG-RESET-EXECUTED          PIC X(1).
406300210623           03  FMT-GMV-RESET-EXECUTED          PIC X(1).
406400210623
406500210623       01 li_LastResetEffectDate         PIC S9(8) VALUE 0.
406600210623       01 lc_ElementCode                 PIC X(3)  VALUE SPACES.
406700210623       01 li_PreviousValue               PIC S9(11)V9(2) VALUE 0.
406800210624       01 li_ResultingValue              PIC S9(11)V9(2) VALUE 0.
406900210623       01 li_LastBonusDate               PIC S9(8)       VALUE 0.
407000210623       01 li_LastBonusPct                PIC S9(3)V9(2)  VALUE 0.
407100210623       01 li_LastBonusAmt                PIC S9(11)V9(2) VALUE 0.
407200210623       01 li_LastMDBAResetNo             PIC S9(4)       VALUE 0.
407300210623       01 li_LastMDBResetEffectDate      PIC S9(8)       VALUE 0.
407400210623       01 li_TotalMDBAPreviousAmt        PIC S9(11)V9(2) VALUE 0.
407500210623       01 li_TotalMDBAResultingAmt       PIC S9(11)V9(2) VALUE 0.
407600210623       01 li_TotalMDBAInflAdjValue       PIC S9(11)V9(2) VALUE 0.
407700210623       01 li_TotalMDBANonInflAdjValue    PIC S9(11)V9(2) VALUE 0.
407800210623       01 lc_ManResetType                PIC X(3)  VALUE SPACES.
407900210708       01 lc_ManResetCateg               PIC X(1)  VALUE SPACES.
408000210708       01 lc_ManualResetTypeCde          PIC X(3)  VALUE SPACES.
408100210708       01 lc_MDBReset                    PIC X(3)  VALUE SPACES.
408200210708       01 li_ContrPrevMDBAInflAmt        PIC S9(11)V9(2) VALUE 0.
408300210708       01 li_ContrResultMDBAInflAmt      PIC S9(11)V9(2) VALUE 0.
408400210708       01 lc_ContrMDBAInflReason         PIC X(5)  VALUE SPACES.
408500210623       01 li_ContrPrevMDBANinflAmt       PIC S9(11)V9(2) VALUE 0.
408600210623       01 li_ContrResultMDBANinflAmt     PIC S9(11)V9(2) VALUE 0.
408700210623       01 lc_ContrMDBANinflReason        PIC X(5)  VALUE SPACES.
408800210623
408900210623       01 lc_MDBAExistsFlag         PIC X(01).
409000210623           88 lb_MDBAExistsYes        VALUE "Y".
409100210623           88 lb_MDBAExistsNo         VALUE "N".
409200210623
409300210623       01 lnci_0                         PIC S9(1) VALUE 0.
409400210623       01 lncc_LWA                       PIC X(3)  VALUE "LWA".
409500210623       01 lncc_NWB                       PIC X(3)  VALUE "NWB".
409600210623       01 lncc_MDB                       PIC X(3)  VALUE "MDB".
409700210623       01 lncc_930                       PIC X(3)  VALUE "930".
409800210623       01 lncc_917                       PIC X(3)  VALUE "917".
409900210623       01 lncc_918                       PIC X(3)  VALUE "918".
410000210623       01 lncc_007                       PIC X(3)  VALUE "007".
410100210623       01 lncc_006                       PIC X(3)  VALUE "006".
410200210623       01 lncc_008                       PIC X(3)  VALUE "008".
410300210624       01 lncc_R                         PIC X(1)  VALUE "R".
410400210623       01 lncc_14                        PIC X(2)  VALUE "14".
410500210623       01 lncc_NegSign                   PIC X(1)  VALUE "-".
410600210708       01 lncc_N                         PIC X(1)  VALUE "N".
410700210708
410800210708      * RFS186199 - End
410900210708      *RFS186199 starts*
411000210708       01 ln-FNDLDESC-Array-Size      PIC S9(09).
411100210708       01 FNDLDESC-CNT                PIC S9(09) VALUE 0.
411200210708       01 FNDLDESC-MAX                PIC S9(09) VALUE 10000.
411300210708       01 lc-FNDLDESC-EOF             PIC X(01).
411400210708       01 lc-FNDLDESC-INVESTMENT-CODE PIC X(05).
411500210708       01 lc-FNDLDESC-ENGLISH         PIC X(80).
411600210708       01 lc-FNDLDESC-FRENCH          PIC X(80).
411700210708       01 WS-FND-LNG-DESC.
411800210708           02 WS-FND-LNG-DESC-ARR-DTL OCCURS 1 TO 10000
411900210708                       DEPENDING ON ln-FNDLDESC-Array-Size
412000210708                       INDEXED BY FNDLDESC-IDX.
412100210708              03 WS-FNDLDESC-DTL.
412200210708                 05 WS-FNDLDESC-INVESTMENT-CODE    PIC X(05).
412300999999                 05 WS-FNDLDESC-ENGLISH            PIC X(80).
412400999999                 05 WS-FNDLDESC-FRENCH             PIC X(80).
412500999999      *RFS186199 Ends*
