000100200420      ******************************************************************
000200200420      *                                                                *
000300200605      *    CPYTRNPST - TRNPST SEG SECTIONS COPYBOOK                    *
000400200420      *                                                                *
000500210616      ******************************************************************
000600200420      ******************************************************************
000700210609      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
000800200420      ******************************************************************
000900200420      * Reece Tam  * 2005/12/14   * RFS 24192 - move SEG sections from
001000200420      *            *              * TRNPST to new copybook CPYTPSEG
001100200420      *            *              * due to TRNPST hit maximum lines.
001200210727      * Reece Tam  * 2006/05/08   * RFS31912 - Fix incorrect creation  s
001300200420      *            *              * of orphaned TRANS-CONTRACT-TARGET  s
001400210609      *            *              * records for BUY as per Marc B.     s
001500200420      * Frank Hong * 2006/06/16   * RFS 32873.
001600200420      *            *              * If screen edit code 1ACCON is setup,
001700210727      *            *              * reject the transaction in case
001800210405      *            *              * 1) the investment in new transaction has
001900200420      *            *              * different Segfund attributes with the
002000210615      *            *              * investment in contract.
002100200420      *            *              * 2) contract is not open.
002200200420      * Lev O      * 2007/04/12   * RFS35075 New edit code to accept thetrade
002300200420      *            *              * if license is expired.
002400210616      * Daisy Ly   * 2007/04/12   * RFS37754-bypass license check for  etrade
002500200420      *            *              * maturity trades (origin code = MAT)
002600200420      *            *              * -create new popu-contract-inv
002700200420      * Esin A.    * 2007/06/07   * RFS43469 - Add investment-code of
002800200420      *            *              * TRANS into the parameter list while
002900200420      *            *              * calling the program TRNANNAG.
003000200420      *            *              * Do not call the program TRNANNAG when
003100200420      *            *              * reversal code rule of a trans is 7.
003200200420      * Lev O      * 2007/07/25   * RFS43082 - Removed RFS42621 For acc inst
003300200420      * Lev O      * 2007/07/30   * RFS42621 - Retrofit RFS42621.
003400200420      * Pawel A.   * 2007/10/10   * RFS44754 - DJT version issue w/o 39466
003500200420      * Frank Hong * 2007/11/26   * RFS40942.
003600200420      *            *              * For transactions with GLWB fund,
003700200420      *            *              * 1) Determine if transaction should
003800200420      *            *              *    be rejected based on business
003900200420      *            *              *    rule
004000200420      *            *              * 2) If accepted, update GLWB buckets
004100200420      * Emmanuel Y * 2008/01/10   * RFS47227 - recompile
004200200420      * Richard S  * 2008/02/28   * RFS47712 - recompile only for this
004300200420      *            *              * copybook.  Retrofit for 47816.
004400200420      * Frank Hong * 2008/01/22   * RFS44930.
004500200420      *            *              * Carry over death percentage.
004600200420      * Frank Hong * 2008/02/07   * RFS44930. Defect #2.
004700200420      *            *              * In CompareGDVPercWithExistCont,
004800200420      *            *              * Account-Cont-Age should not be used,
004900200420      *            *              * instead, ACCOUNT-CONTRACT should
005000200420      *            *              * be used.
005100200420      * Bojana J.  * 2008/05/05   * RFS 51776 - recompile for file c.
005200200420      * Richard S. * 2008/05/26   * RFS48630 - GLWB Funds switches
005300200420      * Frank Hong * 2008/05/23   * RFS46707.
005400200420      *            *              * 5FL changes.
005500200420      * Daniel M.  * 2008/06/26   * RFS46707 - Added pc-InvestmentSeriesCode as
005600200420      *            *              * for the call of FXGLWBRULE.
005700200420      * Lev O      * 2008/06/20   * RFS48640 - not to reduce GLWA
005800200420      *            *              *   values for tro transactions.
005900200420      * Emma Yala  * 2008/06/25   * RFS52779 - Create Joint Life Annuit
006000200420      * Sanjeev P. * 2008/06/26   * RFS50474 - GLWB Product Lunch Release 2
006100200420      * Richard S  * 2008/07/31   * RFS 50474 - def11
006200200420      * Sanjeev P  * 2008/08/01   * RFS 48640 - def06
006300200420      * Richard S  * 2008/08/02   * RFS 50474 - def14
006400200420      * Richard S  * 2008/07/25   * RFS54566 - use override gwa% if exists
006500200420      * Pawel A    * 2008/08/02   * RFS 55136 - Changes in verifivation
006600200420      *            *              * process fo investments
006700200420      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
006800200420      * Fatema Haji* 2008/08/16   * RFS 55960 - recompile for file c.
006900200420      *            *              *
007000200420      * Gary Xia   * 2008/09/09   * RFS 55140 - Switches to a different
007100200420      *            *              * series need to be in a different
007200200420      *            *              * contract.
007300200420      * Daniel Mielke * 2008/09/16  * RFS56974 - Exclude GBV/NDV when exclude is
007400200420      *               *             * 'Y'
007500200420      * Gary Xia   * 2008/09/09   * RFS 56495 - Eligible Start Age should
007600200420      *            *              * not be used to determine if a fund is
007700200420      *            *              * a GLWB fund.
007800200420      * Gary Xia   * 2008/10/16   * RFS 56318 - Multiple contracts issue.
007900200420      * Sanjeev P  * 2008/10/28   * RFS52816.13 - fix defect 13: set
008000200420      *            *              * Qualifying Flag, Spouse DOB and
008100200420      *            *              * RRIF MIN DOB in Account Contract
008200200420      *            *              * when new contract is created.
008300200420      * Shu Yin    * 2008/11/20   * RFS60638 - Fix GLWB wire order SEL.
008400200420      * Daniel M   * 2008/11/26   * RFS60593 - Fix setting of SwitchIntoGlwbYes
008500200420      * Gary Xia   * 2008/12/01   * RFS52328 - GDV multiple transfer issues.
008600200420      * Waldi R.   * 2008/12/10   * RFS58714 - Create separate Log-File
008700200420      *            *              *  -Status to capture I-O read errors
008800200420      *            *              *   as per current logic.
008900200420      *            *              *   Use existing Log-File-Status to
009000200420      *            *              *   track I-O errors for writes/
009100200420      *            *              *   rewrites/deletes in MFAIOERRP.
009200200420      * Pawel A    * 2008/12/24   * RFS62320 - GLWB switch within contract
009300200420      *            *              * updates Withdrawn and excess amount
009400200420      * Pawel A    * 2009/02/03   * RFS64440 - JOBDAILY goes to MSGW
009500200420      *            *              * when dealer licence expired.
009600200420      *            *              * Rejection code igmored.
009700200420      * Pawel A    * 2008/11/11  * RFS 55525 - Changes for Bonus End
009800200420      *            *             * Date calculation for Anniversary
009900200420      *            *             * Bonus calculation
010000200420      * Lev O      * 2009/02/18   * RFS55414 - change interface to     ng
010100200420      *            *              *   FXACCANUIT.                      ng
010200200420      * Emma Yala  * 2009/02/18   * RFS55414 - Added SPIA logic
010300200420      * Emma Yala  * 2009/03/10   * RFS56471 - Added SPIA PhaseII logic
010400200420      * Waldi R.   * 2009/05/25   * RFS68268 - Check if GLWB investment
010500200420      *            *              * earlier in the program.            ng
010600200420      * Richard S  * 2009/07/14   * RFS57388.6 Add gdv-sched-code
010700200420      *            *              * in the matching attributes.
010800200420      * Sanjeev P  * 2009/09/29   * RFS71769 - More than one open cont-
010900200420      *            *              * racts may be created in 54Life
011000200420      *            *              * accounts.
011100200420      * Lev O      * 2009/12/29   * RFS64263 - stop deposits under
011200200420      *            *              *   specified series - change linkage
011300200420      *            *              *   to FXCHKSEGAT.
011400200420      * Emma Yala  * 2010/02/09   * RFS77813 - Fix issue on JOBDAILY
011500200420      *            *              * going into MSGW when 1st trade to
011600200420      *            *              * process is WIREB on GLWB fund
011700200420      *Jess Maquirang* 2010/04/19 * RFS81379 - Deposits Rejected in the
011800200420      *            *              * overnight Batch - - Error Message
011900200420      *            *              * "Invalid Investment".
012000200420      * Sanjeev P  * 2010/04/28   * RFS81876 - Trade is pending for
012100200420      *            *              * maturity rollover with no comm.
012200200420      *            *              * Undo changes of 71769 for blanket
012300200420      *            *              * insurance licence.
012400200420      * Emma Yala  * 2010/06/01   * RFS81076- GLWB values not calculated
012500200420      *            *              * under some SEL transactions if there
012600200420      *            *              * are switches into base prior to SEL
012700200420      * Esin  A    * 2010/06/24   * RFS 81399 - Changed list of
012800200420      *            *              * parameters to call FXCHKSEGAT
012900200420      * Pawel A    * 2010/05/06   * RFS 80554 - Changed list of
013000200420      *            *              * parameters to call FXCNTMATAG
013100200420      * T.Valeri   * 2010/06/03   * RFS83243 - release lock on control-file
013200200420      *            *              * during update
013300200420      * Emman. Yala* 2010/09/09   * RFS83793 - Attach only the active Joint
013400200420      *            *              * annuitant
013500200420      * Kevin Shen * 2010/10/04   * RFS85029 - Set SwitchIntoGlwb when
013600200420      *            *              * TRO/TRI. SWO/SWI already included
013700200420      *            *              * before this change.
013800200420      * Esin  A    * 2010/11/29   * RFS 87708 - Defect fix
013900200420      * Richard Shi | 2011/03/17  | RFS 92560 - ESG 21
014000200420      *                           | recompile for MFAACCNMP.
014100200420      * Nasra F    * 2011/03/24   | RFS 89337.1 - Attach an inactive
014200200420      *                           | joint annuitant to contract.
014300200420      * Naga       * 2011/06/28   * RFS 95850 - Guarantee Value
014400200420      *                           * Calculation for Segregated Funds
014500200420      * Venkatesh C* 2011/08/19   * RFS96081 - Alert when excess
014600200420      *            *              * Withdrawal
014700200420      * Thilaga K  * 2011/09/07   * RFS96527 - Perform Resets based up
014800200420      *            *              * on Age Restrictions.
014900200420      * Naga       * 2011/06/28   * RFS 96530 - Guaranteed Amount based
015000200420      *                           * on years to Maturity Defect.8
015100200420      * Naga       * 2011/11/14   * RFS 102693 - Withdrawals from GLWB
015200200420      *            *              * funds above the LWA have been
015300200420      *            *              * processed in error
015400200420      * Naga       * 2011/07/21   * RFS 102787 - Cannot buy
015500200420      *            *              * funds that have guarante based
015600200420      *            *              * on years to maturity
015700200420      * Venkatesh  * 2011/11/17   * RFS99550 - Addition enhancement
015800200420      *            *              * to EWA
015900200420      * Thilaga K  * 2012/04/27   * RFS108168 -JOBDAILY in message wait
016000200420      *            *              * for a seg fund client.
016100200420      *            *              * changing Paramerters for calling
016200200420      *            *              * FXGWREDV
016300200420      * Brad Doyle * 2012/07/04   * RFS111584 -Correct decimal data error
016400200420      * Rekha S    * 2012/09/27   * RFS112201 - fix defect
016500200420      *            *              * Guarantee Death Value changed after
016600200420      *            *              * the fund merge processed
016700200420      * Naga       * 2012/10/10   * RFS107679 - Empire Maturity Date
016800200420      *            *              * Enhancement
016900200420      * Venkatesh C* 2012/11/05   * RFS112628 - Transfer from one
017000200420      *            *              * Account created multiple contracts
017100200420      *            *              * on TRI account
017200200420      * Ramya R    * 2012/11/19   * RFS114769 - Modified the code to
017300200420      *            *              * populate the contract maturity
017400200420      *            *              * date.
017500200420      * Venkatesh C* 2012/12/10   * RFS112944 - Maturity Options
017600200420      *            *              * AMD,Efefctive date and Investment
017700200420      *            *              * structure update
017800200420      * Rajkumar A * 2013/01/28   * RFS112944 - Defect fix for 96527
017900200420      * Suresh G.  * 2013/01/19   * RFS113773 - To process subroutine
018000200420      *            *              * related to SEG process using
018100200420      *            *              * by TRNPST.
018200200420      * Ambikapathy* 2013/02/18   * RFS119916 - Changes on Annuitant
018300200420      *            *              * Age Limit Check - CR for RFS113773
018400200420      * Naga       * 2013/02/26   * RFS118920-NEW MESSAGE ON CONTRACT'S*
018500200420      *            *              * AUDIT LOG  FROM A TRANSFER         *
018600200420      *            *              * IN KIND FROM RRSP TO RIF           *
018700200420      * VENKATESH C* 2013/02/28   * RFS120585- Defect fix for incorrect
018800200420      *            *              * Account Inv Group value.
018900200420      * Venkatesh C* 2013/03/14   * RFS116420- Account Level processing
019000200420      *            *              * for SEG and GIC
019100200420      * Nagamani S * 2013/04/24   * Defect RFS120691 - Fix.
019200200420      * Vinsfy J   * 2013/01/08   * RFS112967 - Income Plan Maturity
019300200420      *            *              * Processing.
019400200420      * Rajkumar A * 2013/05/03   * RFS 122446 Update Account level
019500200420      *            *              * Maturity Dates.
019600200420      * Venkatesh C* 2013/04/28   * RFS108944 - Maturity process
019700200420      *            *              * enhancement
019800200420      * Daniel M.  * 2013/05/03   * RFS121437 Isolate D/DR license validation
019900200420      * Venkatesh C* 2013/07/25   * RFS125695 - Fix for new contract
020000200420      *            *              * transfer - RFS 108944
020100200420      * Callista N * 2013/06/06   * RFS121057 Contract Rule Maintenance
020200200420      * Arunkumar B* 2013/07/11   * RFS110904 - Populate two new fields
020300200420      *                           * Contract-Inforce-Date and
020400200420      *                           * Guar-Eligible-Benefit.
020500200420      * Muthu      * 2013/07/05   * RFS120931 Maximum Withdrawal Payout
020600200420      * Lakshmi M  *              * Gurantee Amount.
020700200420      * RichardS   * 2013/08/09   * RFS 126350 - some RST transactions
020800200420      *            *              * being rejected with rej code '56'
020900200420      * Abhisek M  * 2013/08/22   * RFS 126777 - MV and topup should be
021000200420      *            *              * processed into same contract
021100200420      * Daisy Ly   * 2013/09/26   * RFS 127383 - not to override start
021200200420      *            *              * date if populated
021300200420      * Geeta S.   * 2013/07/26   * RFS 118636 Align CMD/DMD with AMD update
021400200420      * Venkatesh C* 2013/10/18   * RFS 118636 Align CMD/DMD with AMD update
021500200420      * Abhisek M  * 2013/11/07   * RFS 128950 Fix for Sells over Max Amount
021600200420      * Venkatesh C* 2013/11/14   * RFS 121426 - Fix for multiple
021700200420      *            *              * contract creation
021800200420      * Abhisek M  * 2013/11/14   * RFS 130780 - fix for invalid key
021900200420      *            *              * for trans-contract-details
022000200420      * Venkatesh C* 2013/12/18   * RFS132067 - Fix for TXINPUT05 MSGW
022100200420      *            *              *
022200200420      * TamilSelvi * 2014/02/07   * RFS132676 - Fix for backdated depos
022300200420      *            *              * -its to create a new contract
022400200420      * Vinsfy J   * 2014/03/18   * RFS129784 - Added logic to accept
022500200420      *            *              * time for every entry in contract log.
022600200420      * Noble T    * 2014/03/07   * RFS129709 - Fix to create audit log
022700200420      *            *              * only in update mode.
022800200420      * Muthu      * 2014/04/02   * RFS122815 - Defect#36445           g.
022900200420      * lakshmi M  *              *                                    g.
023000200420      * Antony S   * 2014/03/31   * RFS129965 -Purchases should not
023100200420      *            *              * reject to co-mingle GLWB and
023200200420      *            *              * Non-GLWB funds in an Account
023300200420      * Manjusha V * 2014/04/10   * RFS135486 - Add a call to FXYRTOMAT
023400200420      *            *              * to calculate DMD for Open contract
023500200420      * Praveen E  * 2014/05/08   * RFS136442- Align DMD and CMD with
023600200420      *            *              * AMD.RFS118636 Changes are retrofitted
023700200420      * Sushmita J * 2014/03/24   * RFS134626 - Renamed the field
023800200420      *            *              * Effective-Date to Effectiv-Date.
023900200420      * TamilSelvi * 2014/04/10   * RFS116449 - Enhancements To REP Li-
024000200420      *            *              * cence Validation.
024100200420      * Manjusha V * 2014/04/10   * RFS135486 - Add a call to FXYRTOMAT
024200200420      *            *              * to calculate DMD for Open contract
024300200420      * Ramya K    * 2014/03/24   * RFS124070 - Final Top Up Date
024400200420      *            *              * on an income plan account
024500200420      * Rupesh Kr  * 2014/06/16   * RFS136374 - Incorrect Guarantee Death
024600200420      *            *              * Value calculations around 75th birthday.
024700200420      * Kamal T    * 2014/06/11   * RFS118472 - Calculating LWA amount
024800200420      *            *              * by the Gross amount of the
024900200420      *            *              * transaction
025000200420      * Abhisek M  * 2014/06/25   * RFS138028 - Recompile for MFAACCONP
025100200420      * Nagamnai S * 2014/08/13   * RFS139007 - Recompile for CPGLWBRULE
025200200420      * Venkatesh C* 2014/11/27   * RFS142611 - Fix for Maturity age validation
025300200420      *            *              * rejection
025400200420      * TamilSelvi * 2015/02/11   * RFS139288 - To get insurance fees.
025500200420      * Kamal T    * 2015/02/26   * RFS139286 - Annuities base functionality
025600200420      *            *              * Validation to allow multiple contracts
025700200420      *            *              * for Investment Series type 'POAN'
025800200420      * TamilSelvi * 2015/04/20   * RFS146960 Fix to get the Insurane
025900200420      *            *              * fees for multiple Annuity contract.
026000200420      * TamilSelvi * 2015/06/15   * RFS139287 Bypassed the Dealer Rep
026100200420      *            *              * Valiadtion for Annuity DeathProcess
026200200420      * Kamal T    * 2015/07/08   * RFS147673 - Transfer in transaction is
026300200420      *            *              * validated for dealer/rep license
026400200420      * Kahakashan * 2015/11/04   * RFS128786 remove database file lock
026500200420      *            *              * while reading jurisdiction province
026600200420      *            *              * code
026700200420      * Thilaga K  * 2015/11/26   * RFS151764 - Transfers-in create
026800200420      *            *              * create Non-Primary Annuitant Type
026900200420      *            *              * in Account Contract
027000200420      * Divya   V  * 2016/02/02   * RFS153983 - Multiple contracts being
027100200420      *                             opened, in error
027200200420      * Kamal T    * 2016/03/23   * RFS156864 - Incorrect GDV calculation in
027300200420      *            *              * the year that  Annuitant is turning 75
027400200420      * Rupesh Kr  * 2016/04/22   * RFS158648 - Issues related to the
027500200420      *            *              * Tiered Maturity Guarantee.
027600200420      * Vinsfy J   * 2016/07/08   * RFS161489 - Additional Open and
027700200420      *            *              * active contracts created in error.
027800200420      * Venkatesh C* 2016/06/28   * RFS160885 - Insurance Fee not deducted for
027900200420      *            *              * AWD transactions
028000200420      * Sethu B    * 2016/09/06   * RFS162813 - Multiple Contracts     ted for
028100200420      *            *              * Investor Changes Issues
028200200420      * Geethanjali* 2016/11/24   * RFS163751 - BLAPRD SWO/SWI rejected
028300200420      * Geethanjali* 2017/01/12 * RFS166267 - Incorrect Outstanding Premium in
028400200420      *            *            * Annuity Detail screen
028500200420      * Geethanjali* 2016/11/16   * RFS165202 - Annuity TRI/SWI/BAJ tra
028600200420      *            *              * are not being processed into an
028700200420      *            *              * Annuity contract
028800200420      * Vinsfy J   * 2017/01/27   * RFS167104 -Unable to settle a redem trade.
028900200420      * Geethanjali* 2017/04/12   * RFS168789 - Reset Processing
029000200420      *            *              * changes
029100200420      * Joel Dsouza* 2017/05/22   * RFS170108 - Some transactions for Annuities
029200200420      *            *              * are missing from MFATRCODP and SEGBDAT file
029300200420      * Suresh G.  * 2017/07/21   * RFS171752 - Recompile of MFAACCCSP
029400200420      * Amrutha V  * 2017/09/07   * RFS173536 - Modified code to handle
029500200420      *            *              * auto switch transaction being rejected
029600200420      * Sethu B    * 2017/11/02   * RFS173241 - Multiple Open Contracts &
029700200420      *            *              * Blank Guarantee Death % on Seg
029800200420      *            *              * Contract Details screen
029900200420      * Joel Dsouza* 2017/11/10   * RFS173604 - Initializing AWD-SEQNO
030000200420      *            *              * before processing annuity redemption
030100200420      * Sethu B    * 2018/01/11   * RFS174657 - To prevent multiple contracts
030200200420      *            *              * of the same series from being created
030300200420      * Joel Dsouza* 2018/04/02   * RFS1001156- Preventing BAJ for Annuity
030400200420      *            *              * from generating new Contract
030500200420      * Joel Dsouza* 2019/08/20   * RFS1014172-Contract information not
030600200420      *            *              * updated for a SAJ trade which redeems
030700200420      *            *              * all units
030800200507      * RAJA      N* 2020/01/30   * RFS185169 - DJT Seg Fund Due
030900200420      *            *              * Diligence - Gap Development - GMWB
031000200507      *            *              * Product (GRM)
031100200507      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP
031200200507      * Poojasri M * 2020/02/18   * RFS1021595- Modified to process the
031300200507      *            *              * Maturity Top Up Buy transaction
031400200507      *            *              * without any rejection
031500200420      * sasikumar B* 2020/04/15   * RFS185170 - Optional Riders
031600200521      * Chaya SP   * 2020/05/21   * RFS1027904 - Modifed to match the
031700200521      *            *              * transaction to correct contract under
031800200521      *            *              * Trans-Contract-Details table.
031900200824      * Vignesh    * 2020/06/10   * RFS185171 - GLWB Bonus Lif Max
032000200706      * CHAYA SP   * 2020/07/01   * RFS185172 - Recompile for MFAACCONP
032100200706      * Surendran C* 2020/06/30   * RFS184676-Death Benefit Guarantee %
032200200824      *            *              * changes
032300200824      * Ashwini B  * 2020/07/07   * RFS184676 - Recompile for MFAGDTHVP
032400200824      * Vignesh    *  2020/06/25  * RFS183812 - Recompile for MFASGSTOP
032500200824      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
032600200824      *                           * MFAGDTHVP and MFACMATAGP
032700200824      * Kamal T    * 2020/08/14   * RFS186430 - Changes to move account
032800200824      *            *              * level GLWB READ outside of ESCD
032900200824      *            *              * section
033000200706      * Sasikumar B* 2020/06/29   * RFS185172 - Maturity Guarantees and
033100200706      *            *              *             Death Benefit Guarantees
033200200929      *            *              *             Enhancement
033300200929      * RAJA N     * 2020/09/16   * RFS1104547- To fix GLWA% during
033400210127      *            *              * Withdrawal Transactions*
033500210127      * Kavya K    * 2020/10/13   * RFS186497 - Recompile for MFAACMDP
033600210127      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
033700210127      *                           * and MFAACLBENP
033800210127      * Ashwini B  * 2020/12/22   * RFS180721 - LIB Option and LIB Year
033900210127      *            *              * Anniversary
034000210127      * vignesh    * 2020/11/15   * RFS185455 - Death and Maturity Reset
034100201023      * Sasikumar B* 2020/10/23   * RFS1104392- The contracts are not created
034200201023      *            *              * with the correct dates and the Death %
034300201023      *            *              * assgiend to the contract will be incorrect
034400201023      *            *              * for some of the purchases in the contract.
034500201025      *            *              * Changes are also tagged as 104392.
034600210215      * Ashwini B  * 2021/02/15   * RFS187046 - Recompile for MFAACLBENP
034700210722      * Kavin      * 2021/02/17   * RFS186290 - Recompile only
034800210512      * Mayilsamy D* 2021/05/07   * RFS186888 - Modified to calculate
034900210722      *            *              * DSC charges only on LIA Excess
035000210724      *            *              * amount.
035100210611      * Ashwini B  * 2021/06/10   * RFS1115650 -  Effective date is stamped
035200210611      *            *              * to transfer in account when effect date
035300210611      *            *              * is set to 'N' in RFSGTRFO. Changes are
035400210611      *            *              * tagged under 115650.
035401210914      * Mayilsamy D* 2021/07/13   * RFS1117913- Added logic to read
035402210914      *            *              * only Account Benefits file to fix
035403210914      *            *              * file lock issues.
035500210611      * Ashwini B  * 2021/06/11   * RFS187317 - Handling the product with
035600210603      *            *              * one day open period.
035700210724      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
035800210724      * Niranjan   * 2021/06/20   * RFS1115261 - Read MFATRCODP for
035900210724      *            *              * maturity/reset SWO/TRO
036000210724      * Ashwini B  * 2021/07/12   * RFS1116166 - Same contract number
036100210724      *            *              * associated  with two different accounts
036101210914      * Kavin      * 2021/07/14   * RFS1117962 - Jobdaily performance
036102210914      *            *              * improvement
036103210914      * Ashwini B  * 2021/09/01   * RFS1119109 - GLWA values are not
036104210914      *            *              * updated for Wire Order redemption.
036105210914      *            *              * Changes are tagged under 119109.
036107210929      * Niranjan   * 2021/09/24   * RFS1120699 - BAJ transactions for
036108210929      *            *              * GPP payments not to be validated
036109210929      *            *              * for Annuitant Age Threshold
036110210929      * Kavin      * 2021/09/01   * RFS187471 - Guaranteed Death Percent
036111210929      *            *              * will be calculated and stamped
036112210929      *            *              * on the Contract as per Annuitant's 
036113210929      *            *              * age using 'Annuitant Age Calc Rule'
036114210929      *            *              * if "Apply % at deposit TD" is set
036115210929      *            *              * to Yes in Guaranteed Death Value 
036116210929      *            *              * Schedule (SCGNDTVL).          
036900200420      ****************************************************************
037000200420      /
037100200420       EVALUATE-SEG-CONTRACT-DETAILS SECTION.
037200200420      ******************************************************************
037300200420      *
037400200420      *    E V A L   S E G   C O N T R A C T   D E T A I L   R O U T I N E
037500200420      *
037600200420      ******************************************************************
037700200420      *RFS 13306 BEGIN
037800200420      *************************************************************
037900200420      * This section will check if this transaction was manually  *
038000200420      * associated with a contract before this program was called *
038100200420      * (via TRANS-CONTRACT-DETAILS). If found, we call           *
038200200420      * FIND-SEG-CONTRACT-MATCH to verify that it is a valid      *
038300200420      * contract. Reject the purchase transaction if not valid.   *
038400200420      *                                                           *
038500210609      *************************************************************
038600210616       ESCD-0001.
038700210616
038800210616      *RFS187317 Start
038900210706           INITIALIZE PC_ONEDAYRETURNCODE.
039000210610           SET lb_OneDayProductNo TO TRUE.
039100210610           MOVE INVESTMENT-CODE OF TRANS TO pc_OneDayInvCode
039200210609           CALL "FXONEDAYOP" USING pc_OneDayInvCode,
039300210609                                   pc_OneDayReturncode
039400210609           IF pc_OneDayReturncode = "00"
039500210609              SET lb_OneDayProductYes TO TRUE
039600210610           END-IF.
039700210616      *RFS187317 End
039800200426      *RFS185169 Starts
039900200501           INITIALIZE MFAACLBENP OF Ws-Account-Benefits
040000200706      *RFS184676 Starts
040100200706           INITIALIZE pc_DepLvlTracking_GDth,
040200200706                      ld_YoungerAnnDOB,
040300200706                      li_AnnuitantAge_GDth
040400200706      *RFS184676 Ends
040500200420           MOVE SPACES           TO WRITE-ACCOUNT-BENEFITS
040600200420      *RFS185169 Ends
040700200420
04080020042052328      set lb_DthPercentCalculatedNo to true
04090020042052328      move 0 to ln_NewGDVPercent
04100020042081076      MOVE SPACES TO Ws-seg-in-investment-code  lc_InvSeriesIn
041100200420
041200200420      * RFS 111584 Begin
041300200420           INITIALIZE MFAACCONP OF WS-ACCOUNT-CONTRACT
041400200420      * RFS 111584 End
041500200420
041600200420      *RFS 15847 Begin
041700200420      *Initialize seg transfer flags if BUY. For SWI, preserve
041800200420      *the value determined during SWO segfund contract processing.
041900200420
042000200420      *RFS 16812 Begin
042100200420           IF NOT SWITCH-IN-TRANSACTION OR SWO-NOT-A-SEGFUND
042200200420      *    IF NOT SWITCH-IN-TRANSACTION
042300200420      *RFS 16812 End
042400200420               MOVE " " TO WS-SEG-NEW-CONTRACT
042500210608115650                     lc-SEG-TRANSFER-EFFECTIVE-DATE
042600200420                           WS-SEG-TRANSFER-ANNUITANT
042700200420                           WS-SEG-TRANSFER-MATURITY-DATE
042800200420           ELSE
042900200420               CONTINUE
043000200420           END-IF.
043100200420
04320020042040942      MOVE lncc_N TO Ws-Seg-Same-Account-Flag.
04330020042040942      IF Switch-In-Transaction AND
04340020042040942         Account-No OF Trans = Ws-Seg-Out-Account-No
04350020042040942         MOVE lncc_Y TO Ws-Seg-Same-Account-Flag
04360020042040942      END-IF.
043700200420
043800200420      * RFS35075 - Begin
043900200420           MOVE TRANS-ORIGIN-CODE OF TRANS TO WS-TRANS-ORIGIN-88
044000200420      * RFS35075 - End
044100200420      *    MOVE 'N' TO WS-SEG-OUT-PROCESSED-FLAG.
044200200420
044300200420      **** RFS 15847 End
044400200420
044500200420      *    Set flags and unit accumulator
044600200420
044700200420           INITIALIZE        WS-SEGFUND-MULTIPLE-WRITE.
044800200420
044900200420           MOVE ZEROES       TO WS-TCT2
045000200420                                WS-ACI2
045100200420                                WS-TCD2
045200200420                                WS-ACC2
045300200420                                WS-ACA2.
045400200420
045500200420           MOVE "N"          TO WS-TRANS-CONTR-EXISTS.
045600200420           MOVE "N"          TO WS-EDIT-SPECIFIC-CONTRACT.
045700200420           MOVE " "          TO WRITE-TRANS-CONTRACT
045800200420                                WRITE-ACCOUNT-CONTRACT-INV
045900200420                                WRITE-ACCOUNT-CONTRACT
046000200420                                WRITE-TRANS-CONTRACT-TARGET
046100200420                                WRITE-ACCOUNT-CONT-ANNT.
046200200420
046300200420           MOVE 0            TO WS-SEG-IN-UNITS-ACCUMULATED.
046400200420
04650020042040942      INITIALIZE ln_InitialPurchaseGWAPercent.
04660020042040942      SET pb_GLWBVldInitPurchaseNo TO TRUE.
04670020042081379      SET lb_SPIAInvestNo          TO TRUE.
046800200420
046900200420      * RFS108944 - Start
047000200420      * RFS125695 - Start
047100200420           INITIALIZE lc_EditSpecific, pi_CAccountNo,
047200200420                      pd_CPlacementDate, pi_CTransNo,
047300200420                      pc_CInvestCode, pd_CTradeDate,
047400200420                      pc_CContractFlag, pc_CContractMatch.
047500200420
047600200420           MOVE WS-EDIT-SPECIFIC-CONTRACT TO lc_EditSpecific.
047700200420
047800200420           MOVE ACCOUNT-NO OF TRANS     TO pi_CAccountNo.
047900200420           MOVE PLACEMENT-DATE OF TRANS TO pd_CPlacementDate.
048000200420           MOVE TRANS-NO OF TRANS       TO pi_CTransNo.
048100200420           MOVE INVESTMENT-CODE OF TRANS TO pc_CInvestCode.
048200200420           MOVE TRADE-DATE OF TRANS     TO pd_CTradeDate.
048300200420
048400200420           CALL "FXVALCONT" USING pi_CAccountNo
048500200420                                  pd_CPlacementDate
048600200420                                  pi_CTransNo
048700200420                                  pd_CTradeDate
048800200420                                  pc_CInvestCode
048900200420                                  pi_CContractNo
049000200420                                  pc_CContractFlag
049100200420                                  pc_CContractMatch.
049200200420
049300200706      * RFS185172 - Begin
049400200706           IF pc_CContractFlag = "X"
049500200716             INITIALIZE MFAACCONP OF ACCOUNT-CONTRACT
049600200706             GO TO ESCD-EXIT
049700200706           END-IF.
049800200706      * RFS185172 - End
049900200706
050000200420125695*    MOVE pc_CContractFlag     TO WS-SEG-NEW-CONTRACT.
050100200420125695*    MOVE pi_CContractNo       TO  CONTRACT-NO OF
050200200420125695*            WS-ACCOUNT-CONTRACT
050300200420      * RFS 125695 - Start
050400200420           IF pc_CContractFlag = " "
050500200420              MOVE lc_EditSpecific  TO WS-EDIT-SPECIFIC-CONTRACT
050600200420              MOVE 0    TO CONTRACT-NO OF WS-ACCOUNT-CONTRACT
050700200420           ELSE
050800200420              MOVE pc_CContractFlag TO WS-EDIT-SPECIFIC-CONTRACT
050900200420              MOVE pi_CContractNo       TO  CONTRACT-NO OF
051000200420                      WS-ACCOUNT-CONTRACT
051100200420           END-IF.
051200200420      * RFS125695 - End
051300200420
051400200420      * RFS108944 - End
051500200420      **** See if contract manually associated previously
051600200420
051700200420      *RFS185169 Starts
051800200420           IF Lb_AccountLevelGlwbYes
051900200420              PERFORM ReadAccountBenefits
052000200423           END-IF.
052100200420      *RFS185169 Ends
052200200420
052300200420           MOVE PLACEMENT-DATE OF TRANS
052400200420                             TO PLACEMENT-DATE
052500200420                             OF TRANS-CONTRACT-DETAILS.
052600200420           MOVE TRANS-NO OF TRANS
052700200420                             TO TRANS-NO
052800200420                             OF TRANS-CONTRACT-DETAILS.
052900200420           MOVE ZEROES       TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
053000200420
053100200420           START TRANS-CONTRACT-DETAILS
053200200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
053300200420           INVALID KEY
053400200420             GO TO ESCD-0005
053500200420           END-START.
053600200420
053700200420           READ TRANS-CONTRACT-DETAILS NEXT RECORD
053800200420           WITH NO LOCK
053900200420           AT END
054000200420             GO TO ESCD-0005
054100200420           END-READ.
054200200420
054300200420           IF (PLACEMENT-DATE OF TRANS IS NOT EQUAL
054400200420           PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS) OR
054500200420           TRANS-NO OF TRANS IS NOT EQUAL
054600200420           TRANS-NO OF TRANS-CONTRACT-DETAILS
054700200420             GO ESCD-0005
054800200420           END-IF.
054900200420
055000200420           MOVE "Y"          TO WS-TRANS-CONTR-EXISTS.
055100200420           GO TO ESCD-0050.
055200200420
055300200824      *RFS186430 - Begin
055400200824      * Moved this standalone para outside of ESCD section
055500200824      *RFS185169 Starts
055600200824      *ReadAccountBenefits.
055700200824      *    INITIALIZE MFAACLBENP OF Ws-Account-Benefits
055800200824      *    INITIALIZE MFAACLBENP OF ACCOUNT-BENEFITS-REC
055900200824      *    MOVE SPACES     TO WRITE-ACCOUNT-BENEFITS
056000200824      *    Move ACCOUNT-NO OF TRANS
056100200824      *                    TO ACCOUNT-NO    OF ACCOUNT-BENEFITS
056200200824      *
056300200824      *    READ ACCOUNT-BENEFITS
056400200824      *         INVALID KEY
056500200824      *            MOVE 'W' TO WRITE-ACCOUNT-BENEFITS
056600200824      *            MOVE ACCOUNT-NO OF TRANS
056700200824      *                     TO ACCOUNT-NO OF Ws-Account-Benefits
056800200824      *     NOT INVALID KEY
056900200824      *            MOVE 'R' TO WRITE-ACCOUNT-BENEFITS
057000200824      *            MOVE ACCOUNT-BENEFITS-REC TO Ws-Account-Benefits
057100200824      *    END-READ.
057200200824      *RFS185169 Ends
057300200824      *RFS186430 - End
057400200824
057500200824       ESCD-0005.
057600200420
057700200420      **** The following logic is to determine the NEW segund scenario
057800200420      **** However, since we are dependant on future seg out
057900200420      **** contract logic, we will skip this section until the
058000200420      **** Segfund Out side is processed.
058100200420      **** go to ESCD-0010- new seg switch logic (If seg out processed)
058200200420      **** go to ESCD-0050- old traditional segfund logic
058300200420
058400200420
058500200420      *RFS 16812 Begin
058600200420           IF SWITCH-IN-TRANSACTION AND SWO-IS-A-SEGFUND
058700200420      *    IF SWITCH-IN-TRANSACTION
058800200420      *RFS 16812 End
058900200420               GO TO ESCD-0010
059000200420           ELSE
059100200420               GO TO ESCD-0050
059200200420           END-IF.
059300200420
059400200420
059500200420       ESCD-0010.
059600200420
059700200420      **** Find out if same account and investment.
059800200420      **** If same account, move 'N' to WS-SEG-NEW-CONTRACT as we
059900200420      **** ignore this flag if the purchase and redemption transaction
060000200420      **** are in the same account.
060100200420
060200200420           MOVE 'N'             TO WS-SEG-SAME-ACCOUNT-FLAG
060300200420                                   WS-SEG-SAME-INVESTMENT-FLAG.
060400200420
060500200420           MOVE ACCOUNT-NO      OF TRANS
060600200420           TO   WS-SEG-IN-ACCOUNT-NO.
060700200420
060800200420           MOVE INVESTMENT-CODE OF TRANS
060900200420           TO   WS-SEG-IN-INVESTMENT-CODE.
061000200420
061100200420           IF WS-SEG-IN-ACCOUNT-NO = WS-SEG-OUT-ACCOUNT-NO
061200200420               MOVE 'Y'             TO WS-SEG-SAME-ACCOUNT-FLAG
061300200420               MOVE 'N'             TO WS-SEG-NEW-CONTRACT
061400200420           END-IF.
061500200420
061600200420           IF WS-SEG-IN-INVESTMENT-CODE = WS-SEG-OUT-INVESTMENT-CODE
061700200420               MOVE 'Y'             TO WS-SEG-SAME-INVESTMENT-FLAG
06180020042048630                                  lc_SameLoadStructure
061900200420def14                                  lc_SameSegSeries
062000200420           END-IF.
062100200420
062200200420R48630     IF Ws-seg-in-investment-code NOT =
062300200420  ¦           Ws-seg-out-investment-code
062400200420  ¦           IF Switch-in-transaction
062500200420  ¦              PERFORM FindOutLoadStructure
062600200420  ¦           END-IF
062700200420R48630     END-IF.
062800200420
062900200420      **** Determine the segfund scenario
063000200420
06310020042056471      IF lc_ModuleSEGSPIAOn
063200200420  |           PERFORM CheckIfInvIsSPIAInv
063300200420  |           IF lb_SPIAInvestYes AND
063400200420  |              Investment-Series OF Ws-Account-Contract = SPACES
063500200420  |              MOVE Investment-Series OF INVESTMENT-SEG
063600200420  |                   TO Investment-Series OF Ws-Account-Contract
063700200420  |           END-IF
06380020042056471      END-IF.
063900200420
064000200420           IF NOT SEG-NEW-CONTRACT
064100200420
064200200420               IF SEG-SAME-ACCOUNT
064300200420
064400200420                   MOVE 'N' TO WS-SEG-DO-OLD-SEGFUND-LOGIC
064500200420
064600200420                   PERFORM VARYING WS-SEG-ARRAY-CTR
064700200420      **** RFS15723 Begin
064800200420                       FROM 1 BY 1 UNTIL WS-SEG-ARRAY-CTR >
064900200420                       WS-SEG-OUT-NUMBER-OF-CONTRACTS OR
065000200420      ****             FROM WS-SEG-OUT-NUMBER-OF-CONTRACTS BY -1
065100200420      ****             UNTIL WS-SEG-ARRAY-CTR <= 0 OR
065200200420      **** RFS15723 End
065300200420                       SEG-DO-OLD-SEGFUND-LOGIC
065400200420
06550020042052328                  perform init-gdv-percent
065600200420
065700200420                       MOVE ZEROES TO WS-OVERRIDE-CONTRACT-NO
065800200420
065900200420                       PERFORM CONVERT-SWO-TO-SWI-UNITS
066000200420
066100200420                       PERFORM KEEP-IN-SAME-SEG-CONTRACTS
066200200420
066300200420                   END-PERFORM
066400200420
066500200420                   IF SEG-DO-OLD-SEGFUND-LOGIC
066600200420                       GO TO ESCD-0050
066700200420                   ELSE
066800200420                       GO TO ESCD-EXIT
066900200420                   END-IF
067000200420
067100200420               ELSE
067200200420      *RFS 52328 Begin
067300210806      *RFS187471 Starts
067400210806      *           if lb_EditCodeTGDVSetupYes and
067500210806                  if (lb_EditCodeTGDVSetupYes OR lb_DepTDDthPercentYes)
067600210806                  AND
067700210806      *RFS187471 End
067800200420                    TRANSFER-GBV OF SEG-SWITCH-TRF-OPT = 'Y'
067900200420                    and not SEG-VALIDATION-MODE
06800020042055525               and lc_GlwbInvestment not= "Y"
068100200420                     perform carryover-gdv-consolidate
068200200420                     go to ESCD-EXIT
068300200420                  else
068400200420                     set lb_DthPercentCalculatedNo to true
068500200420                     move 0 to ln_NewGDVPercent
068600200420                   GO TO ESCD-0050
068700200420                  end-if
068800200420      *RFS 52328 End
068900200420               END-IF
069000200420           ELSE
069100200420               IF SEG-SAME-ACCOUNT
069200200420
069300200420                   MOVE 'N' TO WS-SEG-DO-OLD-SEGFUND-LOGIC
069400200420
069500200420                   PERFORM VARYING WS-SEG-ARRAY-CTR
069600200420      **** RFS15723 Begin
069700200420                       FROM 1 BY 1 UNTIL WS-SEG-ARRAY-CTR >
069800200420                       WS-SEG-OUT-NUMBER-OF-CONTRACTS OR
069900200420      ****             FROM WS-SEG-OUT-NUMBER-OF-CONTRACTS BY -1
070000200420      ****             UNTIL WS-SEG-ARRAY-CTR <= 0 OR
070100200420      **** RFS15723 End
070200200420                       SEG-DO-OLD-SEGFUND-LOGIC
070300200420
07040020042052328                  perform init-gdv-percent
070500200420
070600200420                       MOVE ZEROES TO WS-OVERRIDE-CONTRACT-NO
070700200420
070800200420                       PERFORM CONVERT-SWO-TO-SWI-UNITS
070900200420
071000200420                       PERFORM KEEP-IN-SAME-SEG-CONTRACTS
071100200420
071200200420                   END-PERFORM
071300200420
071400200420                   IF SEG-DO-OLD-SEGFUND-LOGIC
071500200420                       GO TO ESCD-0050
071600200420                   ELSE
071700200420                       GO TO ESCD-EXIT
071800200420                   END-IF
071900200420
072000200420               ELSE
07210020042040942              IF lc_ModuleSEGGLWBOn
07220020042040942                 PERFORM CheckIfInvIsGLWBInv
07230020042040942 *50474          IF Investment-Series OF INVESTMENT-SEG
07240020042040942 *50474             NOT = SPACES
07250020042050474                 IF lc_GlwbInvestment = "Y"
07260020042040942                    GO TO ESCD-0050
07270020042040942                 ELSE
07280020042040942                    PERFORM CheckIfAcctHasGLWBFund
072900200420102787                   Move  Investment-Code of Trans To
073000200420102787                                         pc-InvestmentCode
073100200420
073200200420185170                   Move ACCOUNT-NO OF TRANS To pi-AccountNo
073300200420102787                   PERFORM CallFXGLWBRULE
07340020042040942                    IF Account-No OF Trans = Account-No OF
07350020042040942                                             Account-Cont-Age AND
07360020042040942                       Eligible-Date OF Account-Cont-Age NOT = 0
073700200420102787                      AND pc-AllowMultipleContracts    NOT = "3"
073800200420129965                      AND pc-AllowMultipleContracts NOT = SPACES
07390020042040942                       MOVE "S21" TO Rejection-Code OF TRANS
07400020042040942                       GO TO ESCD-EXIT
07410020042040942                    END-IF
07420020042040942                 END-IF
07430020042040942              END-IF
074400200420                   PERFORM VARYING WS-SEG-ARRAY-CTR
074500200420      **** RFS15723 Begin
074600200420                       FROM 1 BY 1 UNTIL WS-SEG-ARRAY-CTR >
074700200420                       WS-SEG-OUT-NUMBER-OF-CONTRACTS
074800200420      ****             FROM WS-SEG-OUT-NUMBER-OF-CONTRACTS BY -1
074900200420      ****             UNTIL WS-SEG-ARRAY-CTR <= 0
075000200420      **** RFS15723 End
07510020042052328                  perform init-gdv-percent
075200200420      *RFS 15656 Begin
075300200420                       MOVE 'Y'          TO WS-CREATE-TCD-FLAG
075400200420                       MOVE 'Y'          TO WS-CREATE-ACI-FLAG
075500200420                       MOVE 'Y'          TO WS-CREATE-AC-FLAG
075600200420                       MOVE 'Y'          TO WS-CREATE-TCT-FLAG
075700200420      *RFS 15656 End
075800200420                       MOVE ZEROES TO WS-OVERRIDE-CONTRACT-NO
075900200420                       PERFORM CONVERT-SWO-TO-SWI-UNITS
076000200420                       PERFORM FIND-IF-CONTRACT-CREATED-TODAY
076100200420                       PERFORM CREATE-MULT-SEG-CONTRACTS
076200200420
076300200420                   END-PERFORM
076400200420
076500200420                   GO TO ESCD-EXIT
076600200420
076700200420               END-IF
076800200420           END-IF.
076900200420
077000200420       ESCD-0050.
077100200420
077200200420      **** We now continue with traditional segfund logic
077300200420
077400200420      *RFS 13306 END
077500200420
077600200420       ESCD-0100.
077700200420      * RFS139286 - Begin
077800200420           IF PURCHASE-TRANSACTION
077900200420            IF lc_ModuleSEGPOANOn
078000200420167104        MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS-REC
078100200420167104        TO li_ContractNum
078200200420              PERFORM CheckIfInvIsPOANInv
078300200420              IF lb_POANInvestYes AND Investment-Series OF
078400200420                        Ws-Account-Contract = SPACES
078500200420                 MOVE Investment-Series OF ACCOUNT-CONTRACT-SPIA
078600200420                     TO Investment-Series OF Ws-Account-Contract
078700200420              END-IF
078800200420            END-IF
078900200420           END-IF.
079000200420      * RFS139286 - End
07910020042055136      PERFORM Check-WO-Trans-In-Same-Acct.
07920020042068268      IF lc_ModuleSEGGLWBOn
07930020042068268         PERFORM CheckIfInvIsGLWBInv
07940020042068268      END-IF.
079500200420           IF WS-TRANS-CONTR-EXISTS IS NOT EQUAL "Y"
079600200420             PERFORM FIND-SEG-CONTRACT-MATCH
079700200420             IF REJECTION-CODE OF TRANS = "00"
079800200420               IF WS-CONTRACT-MATCH IS NOT EQUAL "Y"
079900200420                 PERFORM CREATE-NEW-SEG-CONTRACT
08000020042064440            IF REJECTION-CODE OF TRANS NOT = "00"
08010020042064440              GO TO ESCD-EXIT
08020020042064440            END-IF
080300200420               ELSE
080400200420      *RFS 122446 Begins
080500200420                IF lc_Policy = "A"
080600200420                 MOVE ACCOUNT-NO  OF TRANS
080700200420                        TO ACCOUNT-NO of ACCOUNT-MISC-DETAILS
080800200420
080900200420                 READ ACCOUNT-MISC-DETAILS
081000200420122815                WITH NO LOCK
081100200420                 INVALID KEY
081200200420                  MOVE ZERO TO
081300200420124070*             EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS
081400200420124070              EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS
081500200420                 END-READ
081600200420                 IF (TRADE-DATE OF TRANS <
081700200420124070*              EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS) OR
081800200420124070               EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS) OR
081900200420124070*              EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS = 0
082000200420124070               EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS = 0
082100200420                   PERFORM CALC-CONTRACT-MATURITY-DATE
082200200420                 END-IF
082300200420      *RFS124070 Start.
082400200420                 IF ((TRADE-DATE OF TRANS >
082500200420                     EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS) AND
082600200420                     (EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS > 0 )
082700200420                     AND (FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS
082800200420                     > 0))
082900200420
083000200420                    PERFORM UPDATE-FINAL-TOPUPDATE
083100200420                 END-IF
083200200420      *RFS124070 End
083300200420
083400200420                 IF REJECTION-CODE OF TRANS NOT = "00"
083500200420                   GO TO ESCD-EXIT
083600200420                 END-IF
083700200420                END-IF
083800200420      *RFS 122446 Ends
08390020042031912            IF Switch-In-Transaction
084000200420                    PERFORM Create-Trans-Contract-Target
08410020042031912            END-IF
084200200420               END-IF
0843002004207446         ELSE
0844002004207446             GO TO ESCD-EXIT
0845002004207446         END-IF
084600200420
0847002004207446       ELSE
084800200420           IF WS-TRANS-CONTR-EXISTS IS EQUAL "Y"
084900200420             MOVE "Y"        TO WS-EDIT-SPECIFIC-CONTRACT
085000200420             PERFORM FIND-SEG-CONTRACT-MATCH
085100200420108944       IF pc_CContractMatch  = "Y"
085200200420108944          MOVE "Y"  TO WS-CONTRACT-MATCH
085300200420108944       END-IF
085400200420             IF REJECTION-CODE OF TRANS = "00"
085500200420               IF WS-CONTRACT-MATCH IS NOT EQUAL "Y"
085600200420                 MOVE "56"     TO REJECTION-CODE OF TRANS
085700200420                 GO TO ESCD-EXIT
085800200420               END-IF
085900200420      *RFS 15656 Begin
08600020042031912          IF Switch-In-Transaction
086100200420                  PERFORM Create-Trans-Contract-Target
08620020042031912          END-IF
086300200420      *RFS 15656 End
086400200420             END-IF
086500200420           END-IF.
086600200420      *RFS 7446 BEGIN
086700200420      *rfs 43469 begin
086800200420           MOVE SPACES TO lc-ReversalRule.
086900200420           IF TRANS-TYPE-CODE OF TRANS = lnc-Buy AND
087000200420              TRANS-ORIGIN-CODE OF TRANS = lnc-Dir AND
087100200420              REVERSAL-CODE OF TRANS NOT = SPACES
087200200420                 MOVE REVERSAL-CODE OF TRANS
087300200420                   TO REVERSAL-CODE OF REVERSAL-REASON
087400200420              READ REVERSAL-REASON
087500200420                   INVALID KEY MOVE SPACES TO lc-ReversalRule
087600200420                   NOT INVALID KEY
087700200420                       MOVE REVERSAL-RULE OF REVERSAL-REASON-REC
087800200420                         TO lc-ReversalRule
087900200420              END-READ
088000200420           END-IF.
088100200420      *rfs 43469 end
088200200420             IF WS-SEG-ANNUIT-AGE-THRESH IS EQUAL "Y"
088300200420      *RFS 10080
088400200420               AND REJECTION-CODE OF TRANS = "00" AND
088500200420R87708         ACCOUNT-NO  OF WS-ACCOUNT-CONTRACT IS NOT EQUAL 0 AND
088600200420  |            CONTRACT-NO OF WS-ACCOUNT-CONTRACT IS NOT EQUAL 0 AND
088700200420  |   *        ACCOUNT-NO OF ACCOUNT-CONTRACT IS NOT EQUAL 0 AND
088800200420R87708*        CONTRACT-NO OF ACCOUNT-CONTRACT IS NOT EQUAL 0 AND
088900200420      *rfs 43469 begin
089000200420               not lncc-ReversalRule7
089100200420142611         AND TRANS-ORIGIN-CODE OF TRANS IS NOT EQUAL "MAT"
089200200420      *rfs 43469 end
089201210929      *RFS1120699 Starts
089202210929               AND NOT (ENTERED-BY    OF TRANS IS EQUAL "SEGGENGPP"
089203210929                        AND TRANS-TYPE-CODE OF TRANS IS EQUAL "BAJ")
089204210929      *RFS1120699 Ends
089300200420               CALL "TRNANNAG" USING
089400200420R87708                         ACCOUNT-NO OF WS-ACCOUNT-CONTRACT
089500200420  |                            CONTRACT-NO OF WS-ACCOUNT-CONTRACT
089600200420  |   *                        ACCOUNT-NO OF ACCOUNT-CONTRACT
089700200420R87708*                        CONTRACT-NO OF ACCOUNT-CONTRACT
089800200420                               ACCOUNT-TYPE-CODE OF ACCOUNT
089900200420                               ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE
090000200420R87708                         CONTRACT-PROV OF WS-ACCOUNT-CONTRACT
090100200420R87708*                        CONTRACT-PROV OF ACCOUNT-CONTRACT
090200200420                               TRADE-DATE OF TRANS
090300200420                               REJECTION-CODE OF TRANS
090400200420      *rfs 43469 begin
090500200420                               INVESTMENT-CODE OF TRANS
090600200420      *rfs 43469 end
090700200420               CANCEL "TRNANNAG"
090800200420               IF REJECTION-CODE OF TRANS NOT EQUAL "00"
090900200420                 GO TO ESCD-EXIT
091000200420               END-IF
091100200420             END-IF.
091200200420      *RFS 7446 END
091300200420      *RFS 96527 - Start
091400200420             IF  li_Age_Res_Con_St_Date  >  0
091500200420             AND  PURCHASE-TRANSACTION
091600200420
091700200420      * RFS 111584 begin
091800200420             AND ACCOUNT-NO  OF WS-ACCOUNT-CONTRACT IS NOT EQUAL 0
091900200420             AND CONTRACT-NO OF WS-ACCOUNT-CONTRACT IS NOT EQUAL 0
092000200420             AND REJECTION-CODE OF TRANS = "00"
092100200420      * RFS 111584 - End
092200200420116420       AND TRANS-ORIGIN-CODE OF TRANS IS NOT EQUAL "MAT"
092300200420
092400200420
092500200420                 MOVE ACCOUNT-NO OF WS-ACCOUNT-CONTRACT
092600200420                                       TO pi_AGEVLDAccountNo
092700200420                 MOVE CONTRACT-NO OF WS-ACCOUNT-CONTRACT
092800200420                                       TO pi_AGEVLDContractNo
092900200420
093000200420                 MOVE TRADE-DATE OF TRANS
093100200420                                       TO Pi_AGEVLDEffectiveDate
093200200420                 MOVE PLACEMENT-DATE OF TRANS
093300200420                                       TO Pi_AGEVLDPlacementDate
093400200420                 MOVE TRANS-NO OF TRANS TO  Pi_AGEVLDTransNo
093500200420                 MOVE "00"             TO pc_AGEVLDRejection
093600200420
093700200420                 CALL "FXSGAGEVLD" USING   pi_AGEVLDAccountNo
093800200420                                           pi_AGEVLDContractNo
093900200420                                           Pi_AGEVLDEffectiveDate
094000200420                                           Pi_AGEVLDPlacementDate
094100200420                                           pi_AGEVLDTransNo
094200200420                                           pc_AGEVLDRejection
094300200420      * Defect fix for 96527 - Qc id 30541 Starts - 112944
094400200420             IF pc_AGEVLDRejection = "99"
094500200420                 MOVE "63"             TO REJECTION-CODE OF TRANS
094600200420                 GO TO ESCD-EXIT
094700200420             END-IF
094800200420             END-IF.
094900200420      *      END-IF
095000200420
095100200420      *      IF pc_AGEVLDRejection = "99"
095200200420      *          MOVE "63"             TO REJECTION-CODE OF TRANS
095300200420      *          GO TO ESCD-EXIT
095400200420      *      END-IF.
095500200420      * Defect fix for 96527 - Qc id 30541 Ends   - 112944
095600200420      *RFS96527 - End
095700200420
09580020042040942      IF lc_ModuleSEGGLWBOn
09590020042040942         PERFORM CheckIfInvIsGLWBInv
09600020042040942 *50474  IF Investment-Series OF INVESTMENT-SEG NOT = SPACES
09610020042050474         IF lc_GlwbInvestment = "Y"
09620020042040942            PERFORM CALLFxglwbvldPurchase
09630020042040942            IF Rejection-Code OF TRANS NOT = "00"
09640020042040942               GO TO ESCD-EXIT
09650020042040942            END-IF
09660020042040942         ELSE
09670020042040942            PERFORM CheckIfAcctHasGLWBFund
096800200420102787           Move  Investment-Code of Trans To
096900200420102787                                pc-InvestmentCode
097000200420185170           Move ACCOUNT-NO OF TRANS To pi-AccountNo
097100200420102787           PERFORM CallFXGLWBRULE
09720020042040942            IF Account-No OF Trans = Account-No OF
09730020042040942                                     Account-Cont-Age AND
09740020042040942               Eligible-Date OF Account-Cont-Age NOT = 0
097500200420102787              AND pc-AllowMultipleContracts    NOT = "3"
097600200420129965              AND pc-AllowMultipleContracts    NOT = SPACES
09770020042040942               MOVE "S21" TO Rejection-Code OF TRANS
09780020042040942               GO TO ESCD-EXIT
09790020042040942            END-IF
09800020042040942         END-IF
09810020042040942      END-IF.
098200200420       ESCD-EXIT.
098300200420           EXIT.
098400200420      *RFS 13306 BEGIN
098500200420      /
098600200420       CREATE-TRANS-CONTRACT-TARGET SECTION.
098700200420      ******************************************************************
098800200420      *                                                                *
098900200420      *    C R E A T E  T R A N S  C O N T R A C T  T A R G E T        E
099000200420      *                                                                *
099100200420      ******************************************************************
099200200420       CTCT-0010.
099300200420
099400200420      * Create Trans Contract Target
099500200420
099600200420           MOVE 0                   TO WS-TCT2.
099700200420           MOVE "W2"                TO WRITE-TRANS-CONTRACT-TARGET
099800200420
099900200420      *RFS 16812 Begin
100000200420
100100200420           IF SWO-NOT-A-SEGFUND
100200200420
100300200420               MOVE 1               TO WS-TCT2
100400200420
100500200420               MOVE PLACEMENT-DATE OF TRANS
100600200420               TO PLACEMENT-DATE-2
100700200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
100800200420
100900200420               MOVE TRANS-NO OF TRANS
101000200420               TO TRANS-NO-2
101100200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
101200200420
101300200420               MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS
101400200420               TO CONTRACT-NO-2
101500200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
101600200420
101700200420               MOVE WS-SAVE-STDF-PLACEMENT-DATE
101800200420               TO PLACEMENT-DATE
101900200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
102000200420
102100200420               MOVE WS-SAVE-STDF-TRANS-NO
102200200420               TO TRANS-NO
102300200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
102400200420
102500200420               MOVE 0
102600200420               TO CONTRACT-NO
102700200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
102800200420
102900200420               GO TO CTCT-EXIT
103000200420
103100200420           END-IF.
103200200420
103300200420      *RFS 16812 End
103400200420
103500200420           PERFORM VARYING WS-SEG-ARRAY-CTR
103600200420      **** RFS15723 Begin
103700200420                       FROM 1 BY 1 UNTIL WS-SEG-ARRAY-CTR >
103800200420                       WS-SEG-OUT-NUMBER-OF-CONTRACTS
103900200420      ****             FROM WS-SEG-OUT-NUMBER-OF-CONTRACTS BY -1
104000200420      ****             UNTIL WS-SEG-ARRAY-CTR <= 0
104100200420      **** RFS15723 End
104200200420
104300200420               ADD 1                TO WS-TCT2
104400200420
104500200420      * RFS49699 - Array logging logic
104600200420
104700200420               IF WS-TCT2  > WS-ARRAY4-MAX-USED
104800200420                   MOVE WS-TCT2                TO WS-ARRAY4-MAX-USED
104900200420               END-IF
105000200420
105100200420      * RFS49699 - End
105200200420               MOVE PLACEMENT-DATE OF TRANS
105300200420               TO PLACEMENT-DATE-2
105400200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
105500200420
105600200420               MOVE TRANS-NO OF TRANS
105700200420               TO TRANS-NO-2
105800200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
105900200420
106000200420               MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS
106100200420               TO CONTRACT-NO-2
106200200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
106300200420
106400200420               MOVE WS-SEG-ARRAY-PLACEMENT-DATE(WS-SEG-ARRAY-CTR)
106500200420               TO PLACEMENT-DATE
106600200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
106700200420
106800200420               MOVE WS-SEG-ARRAY-TRANS-NO(WS-SEG-ARRAY-CTR)
106900200420               TO TRANS-NO
107000200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
107100200420
107200200420               MOVE WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
107300200420               TO CONTRACT-NO
107400200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
107500200420
107600200420           END-PERFORM.
107700200420
107800200420       CTCT-EXIT.
107900200420           EXIT.
108000200420      /
108100200420       CONVERT-SWO-TO-SWI-UNITS SECTION.
108200200420      ******************************************************************
108300200420      *                                                                *
108400200420      *    C O N V E R T  S W O  T O  S W I  U N I T S                 E
108500200420      *                                                                *
108600200420      ******************************************************************
108700200420       CSSU-0010.
108800200420
108900200420      **** Skip section if last (or only) contract)
109000200420
109100200420      **** RFS 15723 Begin
109200200420      * 52328     IF WS-SEG-ARRAY-CTR = WS-SEG-OUT-NUMBER-OF-CONTRACTS
109300200420      *    IF WS-SEG-ARRAY-CTR = 1
109400200420      **** RFS 15723 End
109500200420      * 52328         GO TO CSSU-EXIT
109600200420      * 52328     END-IF.
109700200420
109800200420      *RFS18686 Begin
109900200420      **** First convert SWO units to dollars
110000200420      *
110100200420      *    COMPUTE WS-SEG-OUT-DOLLARS ROUNDED =
110200200420      *    WS-SEG-ARRAY-CONTRACT-UNITS(WS-SEG-ARRAY-CTR) *
110300200420      *    WS-SEG-ARRAY-UNIT-PRICE(WS-SEG-ARRAY-CTR).
110400200420      *
110500200420      **** Now convert the above dollars to SWI units
110600200420      *
110700200420      *    COMPUTE WS-SEG-IN-UNITS ROUNDED =
110800200420      *    WS-SEG-OUT-DOLLARS / UNIT-PRICE OF TRANS.
110900200420      *
111000200420      **** Calculate % of SWO total for the contract being evaluated.
111100200420
111200200420           COMPUTE WS-SEG-ARRAY-OUT-PERC(WS-SEG-ARRAY-CTR) ROUNDED =
111300200420           WS-SEG-ARRAY-CONTRACT-UNITS(WS-SEG-ARRAY-CTR) /
111400200420           WS-SEG-ARRAY-TOTAL-UNITS(WS-SEG-ARRAY-CTR).
111500200420
111600200420      *RFS 15719 Begin
111700200420      **** Accumulate units from each out contract (last contract
111800200420      **** will be skipped & calculated in RECORD-UPDATES, subtracting
111900200420      **** WS-SEG-IN-UNITS-ACCUMULATED from the unit amount of trans.
112000200420      *RFS 15719 End
112100200420      *
112200200420      *    COMPUTE WS-SEG-IN-UNITS-ACCUMULATED =
112300200420      *            WS-SEG-IN-UNITS-ACCUMULATED
112400200420      *          + WS-SEG-IN-UNITS.
112500200420      *
112600200420      *RFS 18686 End
112700200420
112800200420       CSSU-EXIT.
112900200420           EXIT.
113000200420      /
113100200420       FIND-IF-CONTRACT-CREATED-TODAY SECTION.
113200200420      ******************************************************************
113300200420      *                                                                *
113400200420      *    F I N D  I F  C O N T R A C T  C R E A T E D  T O D A Y     E
113500200420      *                                                                *
113600200420      ******************************************************************
113700200420       FCCT-0010.
113800210706187317     SET LB_CONTRACTEXISTNO TO TRUE.
113900200420
114000200420      **** Read ACCOUNT-CONTRACT of OUT side to find START-DATE.
114100200420
114200200420           MOVE WS-SEG-ARRAY-ACCOUNT-NO(WS-SEG-ARRAY-CTR)
114300200420           TO   ACCOUNT-NO OF ACCOUNT-CONTRACT.
114400200420
114500200420           MOVE WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
114600200420           TO   CONTRACT-NO OF ACCOUNT-CONTRACT.
114700200420
114800200420           READ ACCOUNT-CONTRACT
114900200420                INVALID KEY
115000200420                    MOVE "ACCOUNT CONTRACT"
115100200420                    TO WS-FILE-STATUS-FILE-NAME
11520020042058714         PERFORM LOG-FILE-STATUS-RD
115300200420              GO TO FCCT-EXIT
115400200420           END-READ.
115500200420
115600200420      **** Cycle through IN ACCOUNT-CONTRACT to find if a contract
115700200420      **** was created with a creation date equal to AS-AT-DATE and
115800200420      **** a start date equal to the start date of the ACCOUNT-CONTRACT
115900200420      **** of the OUT side.
116000200420
116100210616           MOVE ACCOUNT-NO  OF TRANS
116200200420           TO   ACCOUNT-NO  OF ACCOUNT-CONTRACT2.
116300200420
116400210616      *RFS187317 Start
116500210609           IF lb_OneDayProductNo
116600210616      *RFS187317 End
116700200420           MOVE PASS-PROCESS-DATE-9
116800210616      *RFS187317 Start
116900210609      *     TO CREATION-DATE OF ACCOUNT-CONTRACT2.
117000210609            TO CREATION-DATE OF ACCOUNT-CONTRACT2
117100210609           ELSE
117200210609             MOVE ZEROES TO CREATION-DATE OF ACCOUNT-CONTRACT2
117300210609           END-IF.
117400210616      *RFS187317 End
117500200420           MOVE ZEROES
117600200420           TO   START-DATE  OF ACCOUNT-CONTRACT2.
117700200420
117800200420           START ACCOUNT-CONTRACT2
117900200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
118000200420           INVALID KEY
118100200420               GO TO FCCT-EXIT
118200200420           END-START.
118300200420
118400200420       FCCT-0020.
118500200420
118600200420           READ ACCOUNT-CONTRACT2 NEXT RECORD
118700200420           AT END
118800200420             GO TO FCCT-EXIT
118900200420           END-READ.
119000200420
119100200420162813* Start
119200200420           IF CONTRACT-STATUS OF ACCOUNT-CONTRACT2 IS EQUAL "C"
119300200420               GO TO FCCT-0020
119400200420           END-IF.
119500200420162813* End
119600210609      *    IF ACCOUNT-NO    OF ACCOUNT-CONTRACT2      IS NOT EQUAL
119700210616187317      IF (ACCOUNT-NO    OF ACCOUNT-CONTRACT2    IS NOT EQUAL
119800200420              ACCOUNT-NO OF TRANS                              OR
119900200420              CREATION-DATE OF ACCOUNT-CONTRACT2      IS NOT EQUAL
120000210609              PASS-PROCESS-DATE-9
120100210616187317        )AND lb_OneDayProductNo
120200200420      *       START-DATE    OF ACCOUNT-CONTRACT2      IS NOT EQUAL
120300200420      *       START-DATE    OF ACCOUNT-CONTRACT
120400210615               GO TO FCCT-EXIT
120500200420           END-IF.
120600210609
120700210616      *RFS187317 Start
120800210609           IF  ACCOUNT-NO OF ACCOUNT-CONTRACT2 EQUAL
120900210609               ACCOUNT-NO OF TRANS AND
121000210609               START-DATE OF ACCOUNT-CONTRACT2 EQUAL
121100210609               START-DATE OF ACCOUNT-CONTRACT  AND
121200210609               lb_OneDayProductYes
121300210727               SET lb_ContractExistYes TO TRUE
121400210609           END-IF.
121500210616      *RFS187317 End
121600200420
121700200420      **** Determine if this ACCOUNT-CONTRACT is linked to the
121800200420      **** same contract we're taking units out of and the original
121900200420      **** transaction has the new-contract flag set to 'Y'
122000200420
122100200420           PERFORM DETERMINE-IF-CONTRACTS-LINKED.
122200200420
122300200420           IF CONTRACTS-LINKED
122400200420               PERFORM ADJUST-BOTH-LINKED-CONTRACTS
122500200420               GO TO FCCT-EXIT
122600200420           ELSE
122700200420               GO TO FCCT-0020
122800200420           END-IF.
122900200420
123000200420       FCCT-EXIT.
123100200420           EXIT.
123200200420      /
123300200420       ADJUST-BOTH-LINKED-CONTRACTS SECTION.
123400200420      ******************************************************************
123500200420      *                                                                *
123600200420      *    A D J U S T  B O T H  L I N K E D  C O N T R A C T S        E
123700200420      *                                                                *
123800200420      ******************************************************************
123900200420       ABLC-0010.
124000200420
124100200420           MOVE "N" TO WS-SEG-FUND-IN-LINKED-FLAG.
124200200420
124300200420      **** Determine if linked contract already holds FROM investment
124400200420
124500200420           MOVE ACCOUNT-NO  OF TRANS
124600200420           TO   ACCOUNT-NO  OF ACCOUNT-CONTRACT-INVESTMENT
124700200420
124800200420           MOVE CONTRACT-NO  OF TRANS-CONTRACT-DETAILS2
124900200420           TO   CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
125000200420
125100200420           MOVE INVESTMENT-CODE OF TRANS
125200200420           TO   INVESTMENT-CODE  OF ACCOUNT-CONTRACT-INVESTMENT
125300200420
125400200420           READ ACCOUNT-CONTRACT-INVESTMENT
125500200420                INVALID KEY
125600200420                    MOVE "N" TO WS-SEG-FUND-IN-LINKED-FLAG
125700200420                    GO TO ABLC-0100
125800200420           END-READ.
125900200420
126000200420           MOVE "Y" TO WS-SEG-FUND-IN-LINKED-FLAG.
126100200420
126200200420       ABLC-0100.
126300200420
126400200420           IF FUND-IN-LINKED
126500200420
126600200420      **** Add units to linked IN ACCOUNT-CONTRACT-INVESTMENT.
126700200420
126800200420               ADD 1                    TO WS-ACI2
126900200420      * RFS49699 - Array logging logic
127000200420
127100200420                IF WS-ACI2  > WS-ARRAY8-MAX-USED
127200200420                    MOVE WS-ACI2                TO WS-ARRAY8-MAX-USED
127300200420                END-IF
127400200420
127500200420      * RFS49699 - End
127600200420      *RFS 15719 Begin
127700200420               MOVE "R"
127800200420               TO WS-WRITE-REWRITE-ACI2(WS-ACI2)
127900200420      *RFS 15719 End
128000200420
128100200420               MOVE "R2"                TO WRITE-ACCOUNT-CONTRACT-INV
128200200420
128300200420               MOVE ACCOUNT-CONTRACT-INVEST-REC
128400200420               TO WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2)
128500200420
128600200420      *RFS 18686 Begin
128700200420      **** RFS 15723 Begin
128800200420      *        IF WS-SEG-ARRAY-CTR = WS-SEG-OUT-NUMBER-OF-CONTRACTS
128900200420      *        IF WS-SEG-ARRAY-CTR = 1
129000200420      **** RFS 15723 End
129100200420      *          CONTINUE
129200200420      *        ELSE
129300200420      *            COMPUTE
129400200420      *            CURR-UNIT-BAL
129500200420      *            OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2)
129600200420      *          = CURR-UNIT-BAL
129700200420      *            OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2)
129800200420      *            +  WS-SEG-IN-UNITS
129900200420      *        END-IF
130000200420      *RFS 18686 End
130100200420
130200200420      ****     Create remaining files
130300200420
130400200420               MOVE 'Y'              TO WS-CREATE-TCD-FLAG
130500200420               MOVE 'N'              TO WS-CREATE-ACI-FLAG
130600200420               MOVE 'N'              TO WS-CREATE-AC-FLAG
130700200420               MOVE 'Y'              TO WS-CREATE-TCT-FLAG
130800200420
130900200420           ELSE
131000200420
131100200420               MOVE 'Y'              TO WS-CREATE-TCD-FLAG
131200200420               MOVE 'Y'              TO WS-CREATE-ACI-FLAG
131300200420               MOVE 'N'              TO WS-CREATE-AC-FLAG
131400200420               MOVE 'Y'              TO WS-CREATE-TCT-FLAG
131500200420
131600200420           END-IF.
131700200420
131800200420       ABLC-EXIT.
131900200420           EXIT.
132000200420      /
132100200420       DETERMINE-IF-CONTRACTS-LINKED SECTION.
132200200420      ******************************************************************
132300200420      *                                                                *
132400200420      *    D E T E R M I N E  I F  C O N T R A C T S  L I N K E D      E
132500200420      *                                                                *
132600200420      ******************************************************************
132700200420       DICL-0010.
132800200420
132900200420      **** Determine if this ACCOUNT-CONTRACT is linked to the
133000200420      **** same contract we're taking units out of and the original
133100200420      **** transaction has the new-contract flag set to 'Y'
133200200420
133300200420           MOVE 'N'                 TO WS-SEG-CONTRACTS-LINKED-FLAG.
133400200420
133500200420      **** Loop through Trans Contract Detail with found contract
133600200420      **** (that is created today on IN side). We will link each TRANS
133700200420      **** to trans contract target until the corresponding contract
133800200420      **** matches our OUT contract (WS-SEG-ARRAY-CONTRACT-NO).
133900200420
134000200420           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT2
134100200420           TO   CONTRACT-NO OF TRANS-CONTRACT-DETAILS2.
134200200420
134300200420           START TRANS-CONTRACT-DETAILS2
134400200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
134500200420           INVALID KEY
134600200420               GO TO DICL-EXIT
134700200420           END-START.
134800200420
134900200420       DICL-0020.
135000200420
135100200420           READ TRANS-CONTRACT-DETAILS2 NEXT RECORD
135200200420           AT END
135300200420             GO TO DICL-EXIT
135400200420           END-READ.
135500200420
135600200420           IF CONTRACT-NO OF TRANS-CONTRACT-DETAILS2  IS NOT EQUAL
135700200420              CONTRACT-NO OF ACCOUNT-CONTRACT2
135800200420               GO TO DICL-EXIT
135900200420           END-IF.
136000200420
136100200420
136200200420      **** We take found transaction and link to TRANS-CONTRACT-TARGET
136300200420      **** to see if the corresponding contract is our OUT contract.
136400200420
136500200420132067     INITIALIZE MFATRCTGP OF TRANS-CONTRACT-TARGET-REC
136600200420
136700200420           MOVE ZEROES
136800200420           TO   PLACEMENT-DATE   OF TRANS-CONTRACT-TARGET.
136900200420
137000200420           MOVE ZEROES
137100200420           TO   TRANS-NO         OF TRANS-CONTRACT-TARGET.
137200200420
137300200420           MOVE ZEROES
137400200420           TO   CONTRACT-NO      OF TRANS-CONTRACT-TARGET.
137500200420
137600200420           MOVE PLACEMENT-DATE   OF TRANS-CONTRACT-DETAILS2
137700200420           TO   PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET.
137800200420
137900200420           MOVE TRANS-NO         OF TRANS-CONTRACT-DETAILS2
138000200420           TO   TRANS-NO-2       OF TRANS-CONTRACT-TARGET.
138100200420
138200200420           MOVE CONTRACT-NO      OF TRANS-CONTRACT-DETAILS2
138300200420           TO   CONTRACT-NO-2    OF TRANS-CONTRACT-TARGET.
138400200420
138500200420           START TRANS-CONTRACT-TARGET
138600200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
138700200420           INVALID KEY
138800200420               GO TO DICL-EXIT
138900200420           END-START.
139000200420
139100200420           READ TRANS-CONTRACT-TARGET NEXT RECORD
139200200420132067*         INVALID KEY
139300200420132067     AT END
139400200420                    GO TO DICL-EXIT
139500200420           END-READ.
139600200420
139700210727
139800200420           IF CONTRACT-NO   OF TRANS-CONTRACT-TARGET =
139900200420           WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
140000210727187317     AND (lb_OneDayProductNo OR (lb_OneDayProductYes
140100210727187317          AND lb_ContractExistNo))
140200210727
140300200420               PERFORM DETERMINE-NEW-CONTRACT-FLAG
140400200420
140500200420               IF SEG-NEW-CONTRACT2
140600200420                   MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS2
140700200420                   TO   CONTRACT-NO OF TRANS-CONTRACT-DETAILS
140800200420                   MOVE 'Y'   TO WS-EDIT-SPECIFIC-CONTRACT
140900200420                   MOVE 'Y'   TO WS-SAME-DAY-FLAG
141000200420                   PERFORM FIND-SEG-CONTRACT-MATCH
141100200420                   MOVE 'N'   TO WS-SAME-DAY-FLAG
141200200420                   IF REJECTION-CODE OF TRANS = "00"
141300200420                       IF WS-CONTRACT-MATCH = "Y"
141400200420                           MOVE "Y" TO WS-SEG-CONTRACTS-LINKED-FLAG
141500200420                           MOVE CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET
141600200420                           TO WS-OVERRIDE-CONTRACT-NO
141700200420                           GO TO DICL-EXIT
141800200420                       END-IF
141900200420112628*            ELSE
142000200420112628*                MOVE "00" TO REJECTION-CODE OF TRANS
142100200420                   END-IF
142200210727           END-IF.
142300210727      *RFS187317 Start
142400210727           IF lb_OneDayProductYes AND lb_ContractExistYes
142500210727               PERFORM DETERMINE-NEW-CONTRACT-FLAG
142600210727
142700210727               IF SEG-NEW-CONTRACT2
142800210727                   MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS2
142900210727                   TO   CONTRACT-NO OF TRANS-CONTRACT-DETAILS
143000210727                   MOVE 'Y'   TO WS-EDIT-SPECIFIC-CONTRACT
143100210727                   MOVE 'Y'   TO WS-SAME-DAY-FLAG
143200210727                   PERFORM FIND-SEG-CONTRACT-MATCH
143300210727                   MOVE 'N'   TO WS-SAME-DAY-FLAG
143400210727                   IF REJECTION-CODE OF TRANS = "00"
143500210727                       IF WS-CONTRACT-MATCH = "Y"
143600210727                           MOVE "Y" TO WS-SEG-CONTRACTS-LINKED-FLAG
143700210727                           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT2
143800210727                           TO WS-OVERRIDE-CONTRACT-NO
143900210727                           GO TO DICL-EXIT
144000210727                       END-IF
144100210727                   END-IF
144200210727               END-IF
144300210727           END-IF.
144400210727      *RFS187317 End
144500200420           GO TO DICL-0020.
144600200420
144700200420       DICL-EXIT.
144800200420           EXIT.
144900200420      /
145000200420       FIND-IF-SAME-INVESTMENT-SEG SECTION.
145100200420      ******************************************************************
145200200420      *                                                                *
145300200420      *    F I N D  I F  S A M E  I N V E S T M E N T  S E G           E
145400200420      *                                                                *
145500200420      ******************************************************************
145600200420       FSIS-0010.
145700200420
145800200420      ****  Get Investment Seg (attributes) for IN transaction
145900200420
146000200420           MOVE INVESTMENT-CODE OF TRANS
146100200420           TO   INVESTMENT-CODE OF INVESTMENT-SEG.
146200200420
146300200420           READ INVESTMENT-SEG
146400200420                INVALID KEY
146500200420                    MOVE "INVESTMENT SEG"
146600200420                    TO WS-FILE-STATUS-FILE-NAME
14670020042058714         PERFORM LOG-FILE-STATUS-RD
146800200420              GO TO FSIS-EXIT
146900200420           END-READ.
147000200420      *RFS185170 - Begin
147100200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
147200200426                                   lb_AccountLevelGLWBYes
147300200426              MOVE ACCOUNT-NO      OF TRANS TO pi_ACCGLWBD_AccNo
147400200426              MOVE INVESTMENT-CODE OF TRANS TO pc_ACCGLWBD_InvCode
147500200426              MOVE lc_AccountLevelGLWB      TO pc_ACCGLWBD_AccLvlGLWB
147600200426              PERFORM GetAccGLWBDetails
147700200426              IF pc_ACCGLWBD_Series NOT = SPACES
147800200426                 MOVE pc_ACCGLWBD_Series
147900200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
148000200420              END-IF
148100200426           END-IF.
148200200420      *RFS185170 - End
148300200420           MOVE INVESTMENT-SEG-REC TO WS-INVESTMENT-SEG-IN.
148400200420
148500200420      ****  Get Investment Seg (attributes) for investment which
148600200420      ****  exists in potential contract.
148700200420
148800200420           MOVE INVESTMENT-CODE OF TRANS2
148900200420           TO   INVESTMENT-CODE OF INVESTMENT-SEG.
149000200420
149100200420           READ INVESTMENT-SEG
149200200420                INVALID KEY
149300200420                    MOVE "INVESTMENT SEG"
149400200420                    TO WS-FILE-STATUS-FILE-NAME
14950020042058714         PERFORM LOG-FILE-STATUS-RD
149600200420              GO TO FSIS-EXIT
149700200420           END-READ.
149800200420
149900200420      *RFS185170 - Begin
150000200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
150100200426                                   lb_AccountLevelGLWBYes
150200200426              MOVE ACCOUNT-NO      OF TRANS2 TO pi_ACCGLWBD_AccNo
150300200426              MOVE INVESTMENT-CODE OF TRANS2 TO pc_ACCGLWBD_InvCode
150400200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
150500200426              PERFORM GetAccGLWBDetails
150600200426              IF pc_ACCGLWBD_Series NOT = SPACES
150700200426                 MOVE pc_ACCGLWBD_Series
150800200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
150900200426              END-IF
151000200426           END-IF.
151100200420      *RFS185170 - End
151200200420
151300200420           MOVE INVESTMENT-SEG-REC TO WS-INVESTMENT-SEG-OUT.
151400200420
151500200420      ****  Compare WS-INVESTMENT-SEG-IN and WS-SEG-INVESTMENT-SEG-OUT
151600200420
151700200420           MOVE 'N'                 TO WS-SEG-SAME-INVEST-TYPE-FLAG
151800200420
151900200420           IF WS-GUAR-MAT-SCHED-CODE-IN =
152000200420             WS-GUAR-MAT-SCHED-CODE-OUT AND
152100200420             WS-GUAR-DEATH-SCHED-CODE-IN =
152200200420             WS-GUAR-DEATH-SCHED-CODE-OUT AND
152300200420             WS-CONTRACT-STAT-SCHD-CODE-IN =
152400200420             WS-CONTRACT-STAT-SCHD-CODE-OUT AND
152500200420             WS-RESET-TYPE-CODE-IN =
152600200420             WS-RESET-TYPE-CODE-OUT
152700200420               MOVE 'Y'            TO WS-SEG-SAME-INVEST-TYPE-FLAG
152800200420           END-IF.
152900200420
153000200420       FSIS-EXIT.
153100200420           EXIT.
153200200420      /
153300200420       DETERMINE-NEW-CONTRACT-FLAG SECTION.
153400200420      ******************************************************************
153500200420      *                                                                *
153600200420      *    D E T E R M I N E  N E W  C O N T R A C T  F L A G          E
153700200420      *                                                                *
153800200420      ******************************************************************
153900200420       DNCF-0010.
154000200420
154100200420           MOVE 'N'              TO WS-SEG-NEW-CONTRACT2.
154200200420
154300200420      **** Must get associated TRANS to get fields used to later
154400200420      **** read SEG-SWITCH-TRF-OPT file.
154500200420
154600200420           MOVE PLACEMENT-DATE   OF TRANS-CONTRACT-TARGET
154700200420           TO   PLACEMENT-DATE   OF TRANS2.
154800200420
154900200420           MOVE TRANS-NO         OF TRANS-CONTRACT-TARGET
155000200420           TO   TRANS-NO         OF TRANS2.
155100200420
155200200420           READ TRANS2
155300200420           INVALID KEY
155400200420             GO TO DNCF-EXIT
155500200420           END-READ.
155600200420
155700200420      **** Must get associated ACCOUNT to get fields used to later
155800200420      **** read SEG-SWITCH-TRF-OPT file.
155900200420
156000200420           MOVE ACCOUNT-NO       OF TRANS2
156100200420           TO   ACCOUNT-NO       OF ACCOUNT2.
156200200420
156300200420           READ ACCOUNT2
156400200420           INVALID KEY
156500200420             GO TO DNCF-EXIT
156600200420           END-READ.
156700200420
15680020042056974      Initialize Mfasgstop OF SEG-SWITCH-TRF-OPT-REC.
156900200420           MOVE ACCOUNT-TYPE-CODE    OF  ACCOUNT2
157000200420           TO   ACCOUNT-TYPE-CODE    OF  SEG-SWITCH-TRF-OPT.
157100200420
157200200420           IF NOMINEE OF ACCOUNT2 = 'Y'
157300200420
157400200420               MOVE ACCOUNT-NO       OF ACCOUNT2
157500200420               TO   ACCOUNT-NO       OF ACCOUNT-NOMINEE2
157600200420
157700200420               READ ACCOUNT-NOMINEE2
157800200420               INVALID KEY
157900200420                 GO TO DNCF-EXIT
158000200420               END-READ
158100200420
158200200420               MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE2
158300200420               TO   NOMINEE-ACCOUNT-TYPE OF SEG-SWITCH-TRF-OPT
158400200420
158500200420           ELSE
158600200420               MOVE SPACES
158700200420               TO   NOMINEE-ACCOUNT-TYPE OF SEG-SWITCH-TRF-OPT
158800200420           END-IF.
158900210727
159000200420           MOVE TRANS-TYPE-CODE      OF TRANS2
159100200420           TO   TRANS-TYPE-CODE      OF SEG-SWITCH-TRF-OPT.
159200200420
159300200420           MOVE TRANS-ORIGIN-CODE    OF TRANS2
159400200420           TO   TRANS-ORIGIN-CODE    OF SEG-SWITCH-TRF-OPT.
159500200420
159600200420           MOVE CONTR-REDEM-CODE     OF TRANS2
159700200420           TO   CONTR-REDEM-CODE     OF SEG-SWITCH-TRF-OPT.
159800200420
159900200420           READ SEG-SWITCH-TRF-OPT
160000200420           INVALID KEY
160100200420             GO TO DNCF-EXIT
160200210609           END-READ.
160300200420
160400200420           IF NEW-CONTRACT           OF SEG-SWITCH-TRF-OPT = 'Y'
160500200420               MOVE 'Y'              TO WS-SEG-NEW-CONTRACT2
160600200420           END-IF.
160700210609
160800210609
160900200420       DNCF-EXIT.
161000200420           EXIT.
161100200420      /
161200200420       KEEP-IN-SAME-SEG-CONTRACTS SECTION.
161300200420      ******************************************************************
161400200420      *                                                                *
161500200420      *    K E E P  I N  S A M E  S E G  C O N T R A C T S             E
161501210914      *                                                                *
161700200420      ******************************************************************
161800200420       KISC-0010.
161900200420
162000200420           IF CONTRACTED OR
162100200420              UNCONFIRMED
162200200420             GO TO KISC-EXIT
162300200420           END-IF.
162400200420
162500200420      * rfs 23617 - start
162600200420      *    Check if the SWO/TRO contract is closed?
162700200420      *    If it is closed, set on WS-SEG-DO-OLD-SEGFUND-LOGIC so that
162800200420      *    the SWI/TRI will not go into the closed contract.
162900200420
163000200420           INITIALIZE MFAACCONP OF ACCOUNT-CONTRACT-REC.
163100200420           MOVE WS-SEG-ARRAY-ACCOUNT-NO (WS-SEG-ARRAY-CTR)
163200200420             TO ACCOUNT-NO OF ACCOUNT-CONTRACT.
163300200420           MOVE WS-SEG-ARRAY-CONTRACT-NO (WS-SEG-ARRAY-CTR)
163400200420             TO CONTRACT-NO OF ACCOUNT-CONTRACT.
163500200420
163600200420           READ ACCOUNT-CONTRACT WITH NO LOCK
163700200420           INVALID KEY
163800200420             INITIALIZE MFAACCONP OF ACCOUNT-CONTRACT-REC
163900200420           END-READ.
164000200829
164100200829      *RFS185176 Start
164200200829           IF lb_AccountLevelGLWBYes AND
164300200829              ENTERED-BY OF TRANS = "SEGCOGRST" AND
164400200829              START-DATE OF ACCOUNT-CONTRACT < TRADE-DATE OF TRANS
164500200829              MOVE "Y" TO WS-SEG-DO-OLD-SEGFUND-LOGIC
164600200829              GO TO KISC-EXIT
164700200829           END-IF
164800200829      *RFS185176 End
164900200420
165000200420           IF CONTRACT-STATUS OF ACCOUNT-CONTRACT IS EQUAL "C"
165100200420              MOVE 'Y' TO WS-SEG-DO-OLD-SEGFUND-LOGIC
165200200420              GO TO KISC-EXIT
165300200420           END-IF.
165400200420      * rfs 23617 - end
165500200420
165600200420      * rfs 127383 - begin
165700200420           IF START-DATE OF ACCOUNT-CONTRACT = 0
165800200420              MOVE TRADE-DATE OF TRANS TO LI-CON-START-DATE
165900200420           ELSE
166000200420              MOVE START-DATE OF ACCOUNT-CONTRACT
166100200420                TO LI-CON-START-DATE
166200200420           END-IF.
166300200420      * rfs 127383 - end
166400200420      ****  Get Investment Seg (attributes) for IN transaction
166500200420
166600200420           MOVE INVESTMENT-CODE OF TRANS
166700200420           TO   INVESTMENT-CODE OF INVESTMENT-SEG.
166800200420
166900200420           READ INVESTMENT-SEG
167000200420                INVALID KEY
167100200420                    MOVE "INVESTMENT SEG"
167200200420                    TO WS-FILE-STATUS-FILE-NAME
16730020042058714         PERFORM LOG-FILE-STATUS-RD
167400200420              GO TO KISC-EXIT
167500200420           END-READ.
167600200420      *RFS185170 - Begin
167700200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
167800200426                                   lb_AccountLevelGLWBYes
167900200426              MOVE ACCOUNT-NO      OF TRANS  TO pi_ACCGLWBD_AccNo
168000200426              MOVE INVESTMENT-CODE OF TRANS  TO pc_ACCGLWBD_InvCode
168100200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
168200200426              PERFORM GetAccGLWBDetails
168300200426              IF pc_ACCGLWBD_Series NOT = SPACES
168400200426                 MOVE pc_ACCGLWBD_Series
168500200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
168600200426              END-IF
168700200426           END-IF.
168800200420      *RFS185170 - End
168900200420
169000200420           MOVE INVESTMENT-SEG-REC TO WS-INVESTMENT-SEG-IN.
169100200420
169200200420      * RFS 32873 Start.
16930020042032873      MOVE Maturity-Allow-Days OF Investment-Seg-Rec
16940020042032873        TO Ws-Maturity-Allow-Days-In.
16950020042055140      MOVE Investment-Series  OF Investment-Seg-Rec
16960020042055140        TO Ws-Investment-Series-In.
16970020042057388      MOVE gdv-sched-code OF Investment-Seg-Rec
16980020042057388        TO Ws-gdv-sched-code-in.
169900200420
17000020042032873 * Get deposit length for IN transaction.
17010020042032873      MOVE Investment-Code OF Trans
17020020042032873        TO Investment-Code OF Deposit-Mat-Len-Sched.
17030020042032873      MOVE ZEROES TO Start-Date OF Deposit-Mat-Len-Sched
17040020042032873                     End-Date   OF Deposit-Mat-Len-Sched.
170500200420
17060020042032873      START Deposit-Mat-Len-Sched
17070020042032873      KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
17080020042032873      INVALID KEY
17090020042032873        MOVE "DEPOSIT MAT LEN SCHED" TO Ws-File-Status-File-Name
17100020042058714        PERFORM Log-File-Status-RD
171100200420      *RFS112201 - Start
171200200420             IF NOT UNCONFIRMED
171300200420               MOVE "61"       TO REJECTION-CODE OF TRANS
171400200420             END-IF
171500200420      *RFS112201 - End
17160020042032873        GO TO Kisc-Exit
17170020042032873      END-START.
171800200420
17190020042032873  KISC-0020.
17200020042032873      READ Deposit-Mat-Len-Sched NEXT RECORD
17210020042032873      AT END
17220020042032873        MOVE "DEPOSIT MAT LEN SCHED" TO Ws-File-Status-File-Name
17230020042095850        MOVE GBV-Gross-Net           OF Deposit-Mat-Len-Sched
17240020042095850                                     TO Ws-Cmp-GBVGrossNet
17250020042058714        PERFORM Log-File-Status-RD
172600200420      *RFS112201 - Start
172700200420             IF NOT UNCONFIRMED
172800200420               MOVE "61"       TO REJECTION-CODE OF TRANS
172900200420             END-IF
173000200420      *RFS112201 - End
17310020042032873        GO TO Kisc-Exit
17320020042032873      END-READ.
173300200420
17340020042032873      IF Investment-Code OF Deposit-Mat-Len-Sched NOT =
17350020042032873         Investment-Code OF Trans
17360020042032873         MOVE "DEPOSIT MAT LEN SCHED" TO Ws-File-Status-File-Name
17370020042058714         PERFORM Log-File-Status-RD
173800200420      *RFS112201 - Start
173900200420             IF NOT UNCONFIRMED
174000200420               MOVE "61"       TO REJECTION-CODE OF TRANS
174100200420             END-IF
174200200420      *RFS112201 - End
17430020042032873         GO TO Kisc-Exit
17440020042032873      END-IF.
174500200420
174600200420      *173536 starts
17470020042032873 *    IF Start-Date OF Deposit-Mat-Len-Sched >
17480020042032873 *163751 Trade-Date OF Trans                        OR
174900200420163751*       Start-date of Account-contract             OR
17500020042032873 *       End-Date   OF Deposit-Mat-Len-Sched <
17510020042032873 *163751 Trade-Date OF Trans
175200200420163751*       Start-date of Account-contract
17530020042032873 *       GO TO Kisc-0020
17540020042032873 *    END-IF.
175500200420
175600200420           IF Start-Date OF Deposit-Mat-Len-Sched >
175700200420           LI-CON-START-DATE             OR
175800200420           End-Date   OF Deposit-Mat-Len-Sched <
175900200420           LI-CON-START-DATE
176000200420           GO TO Kisc-0020
176100200420           END-IF.
176200200420      *173536 Ends
176300200420
17640020042032873      MOVE Deposit-Length OF Deposit-Mat-Len-Sched
17650020042032873        TO Ws-Cmp-Deposit-Len.
176600200420      * RFS 32873 End.
176700200420
176800200420      ****  Get Investment Seg (attributes) for OUT transaction
176900200420
177000200420           MOVE WS-SEG-ARRAY-INVESTMENT-CODE(WS-SEG-ARRAY-CTR)
177100200420           TO   INVESTMENT-CODE OF INVESTMENT-SEG.
177200200420
177300200420           READ INVESTMENT-SEG
177400200420                INVALID KEY
177500200420                    MOVE "INVESTMENT SEG"
177600200420                    TO WS-FILE-STATUS-FILE-NAME
17770020042058714         PERFORM LOG-FILE-STATUS-RD
177800200420              GO TO KISC-EXIT
177900200420           END-READ.
178000200420      *RFS185170 - Begin
178100200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
178200200426                                   lb_AccountLevelGLWBYes
178300200426              MOVE WS-SEG-ARRAY-ACCOUNT-NO(WS-SEG-ARRAY-CTR)
178400200426                TO pi_ACCGLWBD_AccNo
178500200426              MOVE WS-SEG-ARRAY-INVESTMENT-CODE(WS-SEG-ARRAY-CTR)
178600200426                TO pc_ACCGLWBD_InvCode
178700200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
178800200426              PERFORM GetAccGLWBDetails
178900200426              IF pc_ACCGLWBD_Series NOT = SPACES
179000200426                 MOVE pc_ACCGLWBD_Series
179100200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
179200200426              END-IF
179300200426           END-IF.
179400200420      *RFS185170 - End
179500200420
179600200420           MOVE INVESTMENT-SEG-REC TO WS-INVESTMENT-SEG-OUT.
179700200420
179800200420      * RFS 32873 Start.
17990020042032873      MOVE Maturity-Allow-Days OF Investment-Seg-Rec
18000020042032873        TO Ws-Maturity-Allow-Days-Out.
18010020042055140      MOVE Investment-Series OF Investment-Seg-Rec
18020020042055140        TO Ws-Investment-Series-Out.
18030020042057388      MOVE gdv-sched-code of Investment-Seg-Rec
18040020042057388        TO Ws-gdv-sched-code-out.
180500200420
18060020042032873      MOVE Contract-Status-Sched-Code OF Investment-Seg
18070020042032873        TO Contract-Status-Sched-Code OF Contract-Status-Sched.
18080020042032873      MOVE ZERO TO Start-Date OF Contract-Status-Sched,
18090020042032873                   End-Date   OF Contract-Status-Sched.
181000200420
18110020042032873      START Contract-Status-Sched
18120020042032873      KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
18130020042032873      INVALID KEY
18140020042032873        MOVE "CONTRACT STATUS SCHED" TO Ws-File-Status-File-Name
18150020042058714        PERFORM Log-File-Status-RD
18160020042032873        GO TO Kisc-Exit
18170020042032873      END-START.
181800200420
18190020042032873 *Get contract age.
18200020042032873  KISC-0030.
182100200420
182200200420      * rfs 127383 - begin
182300200420           IF START-DATE OF ACCOUNT-CONTRACT = 0
182400200420              MOVE TRADE-DATE OF TRANS TO LI-CON-START-DATE
182500200420           ELSE
182600200420              MOVE START-DATE OF ACCOUNT-CONTRACT
182700200420                TO LI-CON-START-DATE
182800200420           END-IF.
182900200420      * rfs 127383 - end
183000200420
18310020042032873      READ Contract-Status-Sched NEXT
18320020042032873      AT END
18330020042032873        GO TO Kisc-Exit
18340020042032873      END-READ.
183500200420
18360020042032873      IF Contract-Status-Sched-Code OF Contract-Status-Sched NOT=
18370020042032873         Contract-Status-Sched-Code OF Investment-Seg
18380020042032873         GO TO Kisc-Exit
18390020042032873      END-IF.
184000200420
184100200420      * 127383 - replace start-date with LI-CON-START-DATE
18420020042032873      IF Start-Date OF Contract-Status-Sched >
184300200420127383        LI-CON-START-DATE   OR
18440020042032873 *       Start-Date OF Account-Contract              OR
18450020042032873         End-Date   OF Contract-Status-Sched  <
184600200420127383        LI-CON-START-DATE
18470020042032873 *       Start-Date OF Account-Contract
18480020042032873         GO TO Kisc-0030
18490020042032873      END-IF.
185000200420
18510020042032873 * Get deposit length for OUT transaction.
18520020042032873      MOVE Ws-Seg-Array-Investment-Code (Ws-Seg-Array-Ctr)
18530020042032873        TO Investment-Code OF Deposit-Mat-Len-Sched.
18540020042032873      MOVE ZEROES TO Start-Date OF Deposit-Mat-Len-Sched
18550020042032873                     End-Date   OF Deposit-Mat-Len-Sched.
185600200420
18570020042032873      START Deposit-Mat-Len-Sched
18580020042032873      KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
18590020042032873      INVALID KEY
18600020042032873        MOVE "DEPOSIT MAT LEN SCHED" TO Ws-File-Status-File-Name
18610020042058714        PERFORM Log-File-Status-RD
186200200420      *RFS112201 - Start
186300200420             IF NOT UNCONFIRMED
186400200420               MOVE "61"       TO REJECTION-CODE OF TRANS
186500200420             END-IF
186600200420      *RFS112201 - End
18670020042032873        GO TO Kisc-Exit
18680020042032873      END-START.
186900200420
18700020042032873  KISC-0040.
187100200420
187200200420      * rfs 127383 - begin
187300200420           IF START-DATE OF ACCOUNT-CONTRACT = 0
187400200420              MOVE TRADE-DATE OF TRANS TO LI-CON-START-DATE
187500200420           ELSE
187600200420              MOVE START-DATE OF ACCOUNT-CONTRACT
187700200420                TO LI-CON-START-DATE
187800200420           END-IF.
187900200420      * rfs 127383 - end
188000200420
18810020042032873      READ Deposit-Mat-Len-Sched NEXT RECORD
18820020042032873      AT END
18830020042032873        MOVE "DEPOSIT MAT LEN SCHED" TO Ws-File-Status-File-Name
18840020042058714        PERFORM Log-File-Status-RD
188500200420      *RFS112201 - Start
188600200420             IF NOT UNCONFIRMED
188700200420               MOVE "61"       TO REJECTION-CODE OF TRANS
188800200420             END-IF
188900200420      *RFS112201 - End
18900020042032873        GO TO Kisc-Exit
18910020042032873      END-READ.
189200200420
18930020042032873      IF Investment-Code OF Deposit-Mat-Len-Sched NOT =
18940020042032873         Ws-Seg-Array-Investment-Code (Ws-Seg-Array-Ctr)
18950020042032873         MOVE "DEPOSIT MAT LEN SCHED" TO Ws-File-Status-File-Name
18960020042058714         PERFORM Log-File-Status-RD
189700200420      *RFS112201 - Start
189800200420             IF NOT UNCONFIRMED
189900200420               MOVE "61"       TO REJECTION-CODE OF TRANS
190000200420             END-IF
190100200420      *RFS112201 - End
19020020042032873         GO TO Kisc-Exit
19030020042032873      END-IF.
190400200420
190500200420      * 127383 - replace start-date with LI-CON-START-DATE
19060020042032873      IF Start-Date OF Deposit-Mat-Len-Sched >
190700200420127383        LI-CON-START-DATE                          OR
19080020042032873 *       Start-Date OF Account-Contract                OR
19090020042032873         End-Date   OF Deposit-Mat-Len-Sched <
191000200420127383        LI-CON-START-DATE
19110020042032873 *       Start-Date OF Account-Contract
19120020042032873          GO TO Kisc-0040
19130020042032873      END-IF.
191400200420      * RFS 32873 End.
191500200420
191600210127      *RFS186198 START
191700210127           IF Lb_AccountLevelGlwbYes
191800210127      *Retrieve inv structure of IN transaction
191900210127              INITIALIZE lc_FXSETPOL_Parms,
192000210127                         lc_InvStrucCodeofTransInv
192100210127              MOVE INVESTMENT-CODE OF TRANS TO lc_FXSETPOL_InvCode
192200210127              PERFORM GET-SETPOL-STRUCTURE
192300210127              MOVE lc_FXSETPOL_InvStrucCode
192400210127                TO lc_InvStrucCodeofTransInv
192500210127      *Retrieve inv structure of OUT transaction
192600210127              INITIALIZE lc_FXSETPOL_Parms,
192700210127                         lc_InvStrucCodeOfFirstContInv
192800210127              MOVE WS-SEG-ARRAY-INVESTMENT-CODE(WS-SEG-ARRAY-CTR)
192900210127                TO lc_FXSETPOL_InvCode
193000210127              PERFORM GET-SETPOL-STRUCTURE
193100210127              MOVE lc_FXSETPOL_InvStrucCode
193200210127                TO lc_InvStrucCodeOfFirstContInv
193300210127           END-IF.
193400210127      *RFS186198 END
193500200420      ****  Compare WS-INVESTMENT-SEG-IN and WS-SEG-INVESTMENT-SEG-OUT
193600200420
193700200420           MOVE 'N'                 TO WS-SEG-SAME-INVEST-TYPE-FLAG
193800200420
193900200420      * RFS 32873 Start.
19400020042032873**    IF WS-GUAR-MAT-SCHED-CODE-IN =
19410020042032873**      WS-GUAR-MAT-SCHED-CODE-OUT AND
19420020042032873**      WS-GUAR-DEATH-SCHED-CODE-IN =
19430020042032873**      WS-GUAR-DEATH-SCHED-CODE-OUT AND
19440020042032873      IF Contract-Age OF Contract-Status-Sched NOT = 0 AND
19450020042032873        Deposit-Length OF Deposit-Mat-Len-Sched =
19460020042032873        Ws-Cmp-Deposit-Len AND
19470020042095850        GBV-Gross-Net OF Deposit-Mat-Len-Sched  =
19480020042095850        Ws-Cmp-GBVGrossNet AND
19490020042032873        Ws-Maturity-Allow-Days-In =
19500020042032873        Ws-Maturity-Allow-Days-Out AND
19510020042032873        Ws-Reset-Schedule-Code-In =
19520020042032873        Ws-Reset-Schedule-Code-Out AND
195300200420      * RFS 32873 End.
195400200420             WS-CONTRACT-STAT-SCHD-CODE-IN =
195500200420             WS-CONTRACT-STAT-SCHD-CODE-OUT AND
19560020042057388        Ws-gdv-sched-code-in =
19570020042057388        Ws-gdv-sched-code-out   AND
195800200420             WS-RESET-TYPE-CODE-IN =
19590020042055140 *      WS-RESET-TYPE-CODE-OUT
19600020042055140        WS-RESET-TYPE-CODE-OUT AND
19610020042055140        Ws-Investment-Series-In =
19620020042055140        Ws-Investment-Series-Out
196300210127      *RFS186198 START
196400210127             AND
196500210127             ( Lb_AccountLevelGlwbNo OR
196600210127               ( Lb_AccountLevelGlwbYes AND
196700210127                 ( lc_InvStrucCodeofTransInv =
196800210127                   lc_InvStrucCodeOfFirstContInv ) ) )
196900210127      *RFS186198 END
197000200420               MOVE 'Y'            TO WS-SEG-SAME-INVEST-TYPE-FLAG
197100200420           END-IF.
197200200420
197300200420      **** Determine if TO investment is held in same contract as
197400200420      **** FROM investment by reading ACCOUNT-CONTRACT-INVESTMENT.
197500200420
197600200420           MOVE ACCOUNT-NO OF TRANS
197700200420           TO   ACCOUNT-NO  OF ACCOUNT-CONTRACT-INVESTMENT.
197800200420
197900200420           MOVE WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
198000200420           TO   CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
198100200420
198200200420           MOVE INVESTMENT-CODE OF TRANS
198300200420           TO   INVESTMENT-CODE  OF ACCOUNT-CONTRACT-INVESTMENT.
198400200420
198500200420           READ ACCOUNT-CONTRACT-INVESTMENT
198600200420                INVALID KEY
198700200420                    MOVE "N" TO WS-SEG-BOTH-FUNDS-IN-CONTRACT
198800200420                    GO TO KISC-0100
198900200420           END-READ.
199000200420
199100200420           MOVE "Y" TO WS-SEG-BOTH-FUNDS-IN-CONTRACT.
199200200420
199300200420       KISC-0100.
199400200420
199500200420      **** Compare INVESTMENT-SEG values between the 2 funds.
199600200420      **** If values are all same
199700200420      ****     If TO fund already exists in same contract
199800200420      ****         Modify units on both sides
199900200420      ****     If TO fund does not exist in same contract
200000200420      ****         Create new contract investment and modify units
200100200420      **** If values are not same
200200200420      ****     Use old traditional segfund logic
200300200420
200400200420           IF SAME-INVESTMENT-TYPE
200500200420
200600200420               MOVE WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
200700200420               TO   WS-OVERRIDE-CONTRACT-NO
200800200420
200900200420               IF BOTH-FUNDS-IN-CONTRACT
201000200420
201100200420      *            Read IN and add units ACCOUNT-CONTRACT-INVESTMENT
201200200420
201300200420                   MOVE ACCOUNT-NO  OF TRANS
201400200420                   TO   ACCOUNT-NO  OF ACCOUNT-CONTRACT-INVESTMENT
201500200420
201600200420                   MOVE WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
201700200420                   TO   CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
201800200420
201900200420                   MOVE INVESTMENT-CODE OF TRANS
202000200420                   TO   INVESTMENT-CODE  OF ACCOUNT-CONTRACT-INVESTMENT
202100200420
202200200420                   READ ACCOUNT-CONTRACT-INVESTMENT
202300200420                        INVALID KEY
202400200420                            MOVE "N" TO WS-SEG-BOTH-FUNDS-IN-CONTRACT
202500200420                            GO TO KISC-EXIT
202600200420                   END-READ
202700200420
202800200420      **** Rewrite Account Contract Investment
202900200420
203000200420                   ADD 1                TO WS-ACI2
203100200420      * RFS49699 - Array logging logic
203200200420
203300200420                   IF WS-ACI2 > WS-ARRAY8-MAX-USED
203400200420                       MOVE WS-ACI2                TO WS-ARRAY8-MAX-USED
203500200420                   END-IF
203600200420
203700200420      * RFS49699 - End
203800200420
203900200420      *RFS 15719 Begin
204000200420                   MOVE "R"
204100200420                   TO WS-WRITE-REWRITE-ACI2(WS-ACI2)
204200200420      *RFS 15719 End
204300200420
204400200420                   MOVE "R2"            TO WRITE-ACCOUNT-CONTRACT-INV
204500200420
204600200420                   MOVE ACCOUNT-CONTRACT-INVEST-REC
204700200420                   TO WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2)
204800200420
204900200420      *RFS 18686 Begin
205000200420      **** RFS 15723 Begin
205100200420      *            IF WS-SEG-ARRAY-CTR = WS-SEG-OUT-NUMBER-OF-CONTRACTS
205200200420      *            IF WS-SEG-ARRAY-CTR = 1
205300200420      **** RFS 15723 End
205400200420      *                CONTINUE
205500200420      *            ELSE
205600200420      *                COMPUTE CURR-UNIT-BAL
205700200420      *                OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2)
205800200420      *                = CURR-UNIT-BAL
205900200420      *                OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2)
206000200420      *                +  WS-SEG-IN-UNITS
206100200420      *            END-IF
206200200420      *RFS 18686 End
206300200420
206400200420      ****         Create remaining files
206500200420
206600200420                   MOVE 'Y'              TO WS-CREATE-TCD-FLAG
206700200420                   MOVE 'N'              TO WS-CREATE-ACI-FLAG
206800200420                   MOVE 'N'              TO WS-CREATE-AC-FLAG
206900200420                   MOVE 'Y'              TO WS-CREATE-TCT-FLAG
207000200420
207100200420                   PERFORM CREATE-MULT-SEG-CONTRACTS
207200200420
207300200420               ELSE
207400200420
207500200420      ****         Create remaining files
207600200420
207700200420                   MOVE 'Y'              TO WS-CREATE-TCD-FLAG
207800200420                   MOVE 'Y'              TO WS-CREATE-ACI-FLAG
207900200420                   MOVE 'N'              TO WS-CREATE-AC-FLAG
208000200420                   MOVE 'Y'              TO WS-CREATE-TCT-FLAG
208100200420
208200200420                   PERFORM CREATE-MULT-SEG-CONTRACTS
208300200420
208400200420               END-IF
208500200420           ELSE
208600200420
208700200420      ****     Follow old segfund logic
208800200420
208900200420               MOVE 'Y' TO WS-SEG-DO-OLD-SEGFUND-LOGIC
209000200420
209100200420           END-IF.
209200200420
209300200420       KISC-EXIT.
209400200420           EXIT.
209500200420      /
209600200420       CREATE-MULT-SEG-CONTRACTS SECTION.
209700200420      ******************************************************************
209800200420      *                                                                *
209900200420      *    C R E A T E  M U L T  S E G  C O N T R A C T S              E
210000200420      *                                                                *
210100200420      ******************************************************************
210200200420
210300200420       CMSC-0001.
210400200420
210500200420      **** Skip section if wire order and not settled.
210600200420
210700200420           IF CONTRACTED OR
210800200420              UNCONFIRMED
210900200420             GO TO CMSC-EXIT
211000200420           END-IF.
211100200420
211200200420      * Create trans contract details
211300200420
211400200420           IF CREATE-TCD
211500200420               CONTINUE
211600200420           ELSE
211700200420               GO TO CMSC-0150
211800200420           END-IF.
211900200420
212000200420           ADD 1                    TO WS-TCD2.
212100200420           MOVE "W2"                TO WRITE-TRANS-CONTRACT.
212200200420
212300200420           INITIALIZE MFATRCODP
212400200420           OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2).
212500200420
212600200420           MOVE PLACEMENT-DATE OF TRANS
212700200420           TO PLACEMENT-DATE
212800200420           OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2).
212900200420
213000200420           MOVE TRANS-NO OF TRANS
213100200420           TO TRANS-NO
213200200420           OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2).
213300200420
213400200420           IF WS-OVERRIDE-CONTRACT-NO = 0
213500200420
213600200420               MOVE "CON#"       TO CONTROL-CODE OF CONTROL-FILE
213700200420
213800200420      * RFS20711 - Begin (Replaced "READ   " with "PERFORM ...")
213900200420               MOVE "CONTROL FILE CON"   TO WS-TEMP-STR
214000200420               PERFORM READ-CONTROL-FILE                                RFS9530
214100200420      * RFS20711 - End
214200200420
214300200420               MOVE NEXT-NUMBER OF CONTROL-FILE
214400200420               TO CONTRACT-NO
214500200420               OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2)
214600200420
214700200420      *  RFS83243 begin
214800200420      *        ADD 1             TO NEXT-NUMBER OF CONTROL-FILE
214900200420
215000200420      ****     RFS 15847 Begin
215100200420      *        IF NOT SEG-VALIDATION-MODE
215200200420      * RFS20711 - Begin (Replaced "REWRITE" with "PERFORM ...")
215300200420      *            PERFORM REWRITE-CONTROL-FILE
215400200420      * RFS20711 - End
215500200420      *        END-IF
215600200420      ****     RFS 15847 End
215700200420
215800200420               IF NOT SEG-VALIDATION-MODE
215900200420                  ADD 1  TO NEXT-NUMBER OF CONTROL-FILE
216000200420               END-IF
216100200420               PERFORM REWRITE-CONTROL-FILE
216200200420      * RFS83243 end
216300200420           ELSE
216400200420               MOVE WS-OVERRIDE-CONTRACT-NO
216500200420               TO CONTRACT-NO
216600200420               OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2)
216700200420           END-IF.
216800200420
216900200420      *RFS 18686 Begin
217000200420      *    MOVE  WS-SEG-IN-UNITS
217100200420      *    TO ORIG-UNIT-BAL
217200200420      *    OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2).
217300200420      *RFS 18686 End
217400200420
217500200420       CMSC-0150.
217600200420
217700200420      * Create account contract investment
217800200420
217900200420           IF CREATE-ACI
218000200420               CONTINUE
218100200420           ELSE
218200200420               GO TO CMSC-0200
218300200420           END-IF.
218400200420
218500200420           ADD 1                    TO WS-ACI2.
218600200420      * RFS49699 - Array logging logic
218700200420
218800200420           IF WS-ACI2  > WS-ARRAY8-MAX-USED
218900200420               MOVE WS-ACI2                TO WS-ARRAY8-MAX-USED
219000200420           END-IF.
219100200420
219200200420      * RFS49699 - End
219300200420
219400200420      *RFS 15719 Begin
219500200420           MOVE "W"
219600200420           TO WS-WRITE-REWRITE-ACI2(WS-ACI2)
219700200420      *RFS 15719 End
219800200420
219900200420           MOVE "W2"                TO WRITE-ACCOUNT-CONTRACT-INV.
220000200420
220100200420           INITIALIZE MFAACCCIP
220200200420           OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2).
220300200420
220400200420           MOVE ACCOUNT-NO OF TRANS
220500200420           TO ACCOUNT-NO
220600200420           OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2).
220700200420
220800200420           MOVE INVESTMENT-CODE OF TRANS
220900200420           TO INVESTMENT-CODE
221000200420           OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2).
221100200420
221200200420           MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2)
221300200420           TO CONTRACT-NO
221400200420           OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2).
221500200420
221600200420           MOVE PASS-PROCESS-DATE-9
221700200420           TO CREATION-DATE
221800200420           OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2).
221900200420
222000200420      *RFS 18686 Begin
222100200420      **** RFS 15723 Begin
222200200420      *    IF WS-SEG-ARRAY-CTR = WS-SEG-OUT-NUMBER-OF-CONTRACTS
222300200420      *    IF WS-SEG-ARRAY-CTR = 1
222400200420      **** RFS 15723 End
222500200420      *        CONTINUE
222600200420      *    ELSE
222700200420      *        MOVE  WS-SEG-IN-UNITS
222800200420      *        TO CURR-UNIT-BAL
222900200420      *        OF WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2)
223000200420      *    END-IF.
223100200420      *RFS 18686 End
223200200420
223300200420       CMSC-0200.
223400200420
223500200420      * Create account contract
223600200420
223700200420           IF CREATE-AC
223800200420               CONTINUE
223900200420           ELSE
224000200420               GO TO CMSC-0300
224100200420           END-IF.
224200200420
224300200420           ADD 1                    TO WS-ACC2.
224400200420      * RFS49699 - Array logging logic
224500200420
224600200420           IF WS-ACC2  > WS-ARRAY5-MAX-USED
224700200420               MOVE WS-ACC2                TO WS-ARRAY5-MAX-USED
224800200420           END-IF.
224900200420
225000200420      * RFS49699 - End
225100200420           MOVE "W2"                TO WRITE-ACCOUNT-CONTRACT.
225200200420
225300200420           INITIALIZE MFAACCONP
225400200420           OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
225500200420110904     INITIALIZE   Li_ADLInvestor
225600200420110904                  Li_ADLAccountNo
225700200420110904                  Li_ADLContractNo.
225800200420
225900200420
226000200420           MOVE ACCOUNT-NO OF TRANS
226100200420                             TO ACCOUNT-NO
226200200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
226300200420110904                          Li_ADLAccountNo.
226400200420           MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2)
226500200420                             TO CONTRACT-NO
226600200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
226700200420110904                          Li_ADLContractNo.
226800200420           MOVE "O"          TO CONTRACT-STATUS
226900200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
227000200420      *RFS116449-Start
227100200420           MOVE ACCOUNT-NO OF TRANS
227200200420                             TO ACCOUNT-NO OF ACCOUNT-MISC-DETAILS.
227300200420           READ ACCOUNT-MISC-DETAILS
227400200420128786          WITH NO LOCK
227500200420             INVALID KEY
227600200420                MOVE PROVINCE-CODE OF INVESTOR
227700200420                             TO CONTRACT-PROV
227800200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
227900200420             NOT INVALID KEY
228000200420              IF JURISDICTION-PROVINCE-CODE  OF ACCOUNT-MISC-DETAILS
228100200420               NOT = " "
228200200420                MOVE JURISDICTION-PROVINCE-CODE  OF
228300200420                          ACCOUNT-MISC-DETAILS
228400200420                          TO CONTRACT-PROV OF
228500200420                          WS-ACCOUNT-CONTRACT-2(WS-ACC2)
228600200420              ELSE
228700200420                MOVE PROVINCE-CODE OF INVESTOR
228800200420                                TO CONTRACT-PROV
228900200420                                OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
229000200420              END-IF
229100200420           END-READ.
229200200420      *     MOVE PROVINCE-CODE OF INVESTOR
229300200420      *                      TO CONTRACT-PROV
229400200420      *                     OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
229500200420      *RFS116449-End
229600200420110904     MOVE INVESTOR-NO   OF INVESTOR
229700200420110904                        TO Li_ADLInvestor.
229800200420
229900200420      * RFS 124070 - START
230000200420           IF lc_Policy = "A"
230100200420                  MOVE SPACES TO LC-INVSTRUCTURECODE,
230200200420                                 LC-GUARBENEFITELIGIBLE
230300200420
230400200420              CALL "FXSETPOL" USING PLACEMENT-DATE OF TRANS,
230500200420                                    TRANS-NO OF TRANS,
230600200420                                    LC-GUARBENEFITELIGIBLE,
230700200420                                    INVESTMENT-CODE OF TRANS,
230800200420                                    LC-INVSTRUCTURECODE
230900200420
231000200420               MOVE LC-INVSTRUCTURECODE TO CONTRACT-XREF
231100200420                                 OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
231200200420           ELSE
231300200420               MOVE SPACES       TO CONTRACT-XREF
231400200420                                 OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
231500200420
231600200420      *    MOVE SPACES       TO CONTRACT-XREF
231700200420      *                      OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
231800200420           END-IF.
231900200420      * RFS 124070 - END
232000200420           MOVE "N"          TO MATURITY-INSTRUCTION
232100200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
23220020042046707      IF lb_EditCodeANNDTHSetupYes
23230020042046707         MOVE lncc_N TO Death-Instruction
23240020042046707                        OF Ws-Account-Contract-2(Ws-Acc2)
23250020042046707      ELSE
232600200420           MOVE "R"          TO DEATH-INSTRUCTION
232700200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
232800200420           MOVE TRADE-DATE   OF TRANS
232900200420                             TO START-DATE
233000200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
233100200420           MOVE 0            TO MATURITY-DATE
233200200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
233300200420           MOVE 0            TO DEPOSIT-MATURITY-DATE
233400200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
233500200420           MOVE 0            TO DEPOSIT-RENEWAL-DATE
233600200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
233700200420           MOVE 0            TO NO-OF-RESETS-REMAINING
233800200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
233900200420           MOVE 0            TO LAST-RESET-DATE
234000200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
234100200420           MOVE 0            TO LAST-RESET-NUMBER
234200200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
234300200420           MOVE 0            TO PROCESS-DEATH-REDEM
234400200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
234500200420           MOVE 0            TO PAYMENT-TYPE-CODE
234600200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
234700200420           MOVE 0            TO CONTRACT-CLOSED-DATE
234800200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
234900200420           MOVE PASS-PROCESS-DATE-9
235000200420                             TO CREATION-DATE
235100200420                             OF WS-ACCOUNT-CONTRACT-2(WS-ACC2).
235200200420
235300200420           MOVE ACCOUNT-NO   OF TRANS
235400200420                             TO ACCOUNT-NO
235500200420                             OF ACCOUNT-ANNUITANT-DEFAULT.
235600200420EY         MOVE "P"          TO DEFAULT-FLAG
235700200420                             OF ACCOUNT-ANNUITANT-DEFAULT.
235800200420
235900200420           MOVE SPACES TO MATURITY-DATE
236000200420           OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
236100200420
236200200420           PERFORM CALC-CONTRACT-MATURITY-DATE.
236300200420
236400200420           MOVE WS-MATURITY-DATE
236500200420           TO MATURITY-DATE OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
236600200420
236700200420      * RFS124070 - START
236800200420           IF lc_Policy = "A"
236900200420
237000200420             IF ((FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS) <=
237100200420              pi-MATAGContractMaturityDate ) AND
237200200420               ( pi-MATAGContractMaturityDate <
237300200420                 pi-MATAGAccMaturityDate) AND
237400200420               ( FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS > 0)
237500200420
237600200420                  MOVE FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS
237700200420                         TO MATURITY-DATE OF WS-ACCOUNT-CONTRACT
237800200420                            WS-MATURITY-DATE
237900200420             END-IF
238000200420              MOVE SPACES TO LC-INVSTRUCTURECODE,
238100200420                             LC-GUARBENEFITELIGIBLE
238200200420
238300200420              CALL "FXSETPOL" USING PLACEMENT-DATE OF TRANS,
238400200420                                    TRANS-NO OF TRANS,
238500200420                                    LC-GUARBENEFITELIGIBLE,
238600200420                                    INVESTMENT-CODE OF TRANS,
238700200420                                    LC-INVSTRUCTURECODE
238800200420
238900200420               MOVE LC-INVSTRUCTURECODE TO CONTRACT-XREF
239000200420                                 OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
239100200420           ELSE
239200200420               MOVE SPACES       TO CONTRACT-XREF
239300200420                                 OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
239400200420           END-IF.
239500200420      * RFS124070 - END
239600200420
239700200420107679     MOVE li_orgCntMaturity
239800200420107679     TO ORIGINAL-CMD  OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
239900200420
240000200420      * RFS110904 - Start
240100200420           MOVE PASS-PROCESS-DATE-9
240200200420           TO CONT-INFORCE-DATE     OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
240300200420           MOVE 'N'
240400200420           TO GUAR-BENEFIT-ELIGIBLE OF WS-ACCOUNT-CONTRACT-2(WS-ACC2)
240500200420      * RFS110904 - End
240600200420
24070020042044930 *52328     IF lb_EditCodeTGDVSetupYes
24080020042044930 *52328        MOVE Ws-Seg-Array-GDV-Percent(Ws-Seg-Array-Ctr)
24090020042044930 *52328          TO Guarantee-Dth-Percent OF
24100020042044930 *52328             Ws-Account-Contract-2(Ws-Acc2)
24110020042044930 *52328     END-IF.
241200200420
241300200420      *52328 Start
241301210929      *RFS187471 Starts
241302210929      *    IF lb_EditCodeTGDVSetupYes
241303210929           IF (lb_EditCodeTGDVSetupYes OR lb_DepTDDthPercentYes)
241304210929      *RFS187471 End
24180020042055525         and lc_GlwbInvestment not= "Y"
241900200420              IF lb_DthPercentCalculatedNo
242000200420                 IF lnc_origCodeMat
242100200420
242200200420158648*             MOVE Ws-Seg-Array-GDV-Percent(Ws-Seg-Array-Ctr)
242300200420158648*               TO ln_NewGDVPercent
242400200420
242500200420      * RFS 132067 - Start
242600200420132067* Code changes of 121426 have been moved to new
242700200420132067* section Calculate-GDV-MAT-Value
242800200420
242900200420                   IF TRANS-TYPE-CODE OF TRANS = "BUY"
243000210724      * RFS1115261 Starts
243100210724132067*                PERFORM Calculate-GDV-MAT-Value
243200210724158648*                PERFORM CalculateGDVPercentage
243300210724                       PERFORM GetMATContractGDVPercent
243400210724      * RFS1115261 Ends
243500200420158648             ELSE
243600200420158648                 MOVE Ws-Seg-Array-GDV-Percent(Ws-Seg-Array-Ctr)
243700200420158648                      TO ln_NewGDVPercent
243800200420132067             END-IF
243900200420      * RFS 132067 - End
244000200420      * RFS 161489 - Start
244100200420158648*          ELSE
244200200420158648*             PERFORM CalculateGDVPercentage
244300200420                 ELSE
244400200420                    PERFORM CalculateGDVPercentage
244500200420      * RFS 161489 - End
244600200420                 END-IF
244700200420                 SET lb_DthPercentCalculatedYes to true
244800200420              END-IF
244900200420              MOVE ln_NewGDVPercent TO Guarantee-Dth-Percent OF
245000200420                   Ws-Account-Contract-2(Ws-Acc2)
245100200420           END-IF.
245200200420      *RFS129709 Starts
245300200420110904*    PERFORM createAuditLog.
245400200420           IF NOT SEG-VALIDATION-MODE
245500200420              PERFORM createAuditLog
245600200420           END-IF.
245700200420      *RFS129709 Ends
245800200420      *52328 End
245900200420
246000200420      * RFS132067 - Removed the changes made for 121426,
246100200420      * same logic is present above
246200200420      * RFS132067 - End
246300200420
246400200420       CMSC-0300.
246500200420
246600200420      * Create Trans Contract Target
246700200420
246800200420           IF CREATE-TCT
246900200420               CONTINUE
247000200420           ELSE
247100200420               GO TO CMSC-0400
247200200420           END-IF.
247300200420
247400200420           ADD 1                    TO WS-TCT2.
247500200420      * RFS49699 - Array logging logic
247600200420
247700200420           IF WS-TCT2  > WS-ARRAY4-MAX-USED
247800200420               MOVE WS-TCT2                TO WS-ARRAY4-MAX-USED
247900200420           END-IF.
248000200420
248100200420      * RFS49699 - End
248200200420           MOVE "W2"                TO WRITE-TRANS-CONTRACT-TARGET.
248300200420
248400200420           INITIALIZE MFATRCTGP
248500200420           OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2).
248600200420
248700200420           MOVE WS-SEG-ARRAY-PLACEMENT-DATE(WS-SEG-ARRAY-CTR)
248800200420           TO PLACEMENT-DATE
248900200420           OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2).
249000200420
249100200420           MOVE WS-SEG-ARRAY-TRANS-NO(WS-SEG-ARRAY-CTR)
249200200420           TO TRANS-NO
249300200420           OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2).
249400200420
249500200420           MOVE WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
249600200420           TO CONTRACT-NO
249700200420           OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2).
249800200420
249900200420           MOVE PLACEMENT-DATE OF TRANS
250000200420           TO PLACEMENT-DATE-2
250100200420           OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2).
250200200420
250300200420           MOVE TRANS-NO OF TRANS
250400200420           TO TRANS-NO-2
250500200420           OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2).
250600200420
250700200420           MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2)
250800200420           TO CONTRACT-NO-2
250900200420           OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2).
251000200420
251100200420       CMSC-0400.
251200200420
251300200420      * Create Account Contract Annuitant
251400200420
251500200420           IF CREATE-AC AND NOT SEG-TRANSFER-ANNUITANT
251600200420               CONTINUE
251700200420           ELSE
251800200420               GO TO CMSC-0500
251900200420           END-IF.
252000200420
252100200420           MOVE ACCOUNT-NO   OF TRANS
252200200420                             TO ACCOUNT-NO
252300200420                             OF ACCOUNT-ANNUITANT-DEFAULT.
252400200420EY         MOVE "P"          TO DEFAULT-FLAG
252500200420                             OF ACCOUNT-ANNUITANT-DEFAULT.
25260020042083793D     SET lb_AlreadyJLBackNo TO TRUE.
252700200420
25280020042052779  CMSC-0450.
252900200420      * RFS83793 Start - Added logic to pick up only the 'A' Joint Annuitant
253000200420           START ACCOUNT-ANNUITANT-DEFAULT
253100200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
253200200420           INVALID KEY
253300200420             GO TO CMSC-0500
253400200420           END-START.
253500200420
253600200420       CMSC-0460.
253700200420           READ ACCOUNT-ANNUITANT-DEFAULT NEXT RECORD
253800200420           AT END
253900200420             GO TO CMSC-0500
254000200420           END-READ.
254100200420
25420020042083793 *    READ ACCOUNT-ANNUITANT-DEFAULT
254300200420  |   *    INVALID KEY
254400200420  |   *      GO TO CMSC-0500
25450020042083793 *    END-READ.
254600200420
254700200420           IF ACCOUNT-NO OF ACCOUNT-ANNUITANT-DEFAULT  NOT =
254800200420              ACCOUNT-NO OF TRANS
254900200420              GO TO CMSC-0500
255000200420           END-IF.
255100200420
255200200420           IF DEFAULT-FLAG OF ACCOUNT-ANNUITANT-DEFAULT  =  "J"  AND
255300200420      *89337.1 Begins create an inactive annuitant
255400200420              (ANNUITANT-STATUS OF ACCOUNT-ANNUITANT-DEFAULT NOT = "A"
255500200420           AND ANNUITANT-STATUS OF ACCOUNT-ANNUITANT-DEFAULT NOT = "I")
255600200420      *89337.1 End
255700200420              GO TO CMSC-0460
255800200420           END-IF.
255900200420      *RFS151764 - Start
256000200420           IF DEFAULT-FLAG OF ACCOUNT-ANNUITANT-DEFAULT = "N"  OR
256100200420              DEFAULT-FLAG OF ACCOUNT-ANNUITANT-DEFAULT = "S"
256200200420              GO TO CMSC-0460
256300200420           END-IF.
256400200420      *RFS151764 - End
256500200420      * RFS83793 End
256600200420
256700200420           ADD 1                    TO WS-ACA2.
256800200420              MOVE "W2"                TO WRITE-ACCOUNT-CONT-ANNT
256900200420
257000200420
257100200420           INITIALIZE MFAACCANP
257200200420           OF WS-ACCOUNT-CONT-ANNT-2(WS-ACA2).
257300200420
257400200420           MOVE ACCOUNT-NO   OF TRANS
257500200420           TO ACCOUNT-NO OF WS-ACCOUNT-CONT-ANNT-2(WS-ACA2).
257600200420
257700200420           MOVE CONTRACT-NO  OF WS-TRANS-CONTRACT-DETAILS-2(WS-TCD2)
257800200420           TO CONTRACT-NO OF WS-ACCOUNT-CONT-ANNT-2(WS-ACA2).
257900200420
258000200420           MOVE ANNUITANT-SEQ-NO OF ACCOUNT-ANNUITANT-DEFAULT
258100200420           TO ANNUITANT-SEQ-NO OF WS-ACCOUNT-CONT-ANNT-2(WS-ACA2).
258200200420
258300200420 52779*    MOVE "P"
258400200420 52779     MOVE DEFAULT-FLAG OF ACCOUNT-ANNUITANT-DEFAULT
258500200420           TO ANNUITANT-TYPE-CODE OF WS-ACCOUNT-CONT-ANNT-2(WS-ACA2).
258600200420
258700200420           MOVE PASS-PROCESS-DATE-9
258800200420           TO CREATION-DATE       OF WS-ACCOUNT-CONT-ANNT-2(WS-ACA2).
258900200420
259000200420      * Go back to add also JointLife Annuitant if any
259100200420 52779     IF DEFAULT-FLAG OF ACCOUNT-ANNUITANT-DEFAULT = "P"
25920020042083793D       AND lb_AlreadyJLBackNo
25930020042083793D        SET lb_AlreadyJLBackYes TO TRUE
259400200420   ¦          MOVE "J" TO DEFAULT-FLAG OF ACCOUNT-ANNUITANT-DEFAULT
259500200420   ¦          GO TO CMSC-0450
259600200420 52779     END-IF.
259700200420
259800200420       CMSC-0500.
259900200420
260000200420       CMSC-EXIT.
260100200420
260200200420      /
260300200420       CALC-CONTRACT-MATURITY-DATE SECTION.
260400200420      ******************************************************************
260500200420      *                                                                *
260600200420      *    C A L C  C O N T R A C T  M A T U R I T Y  D A T E          E
260700200420      *                                                                *
260800200420      ******************************************************************
260900200420       CCMD-0001.
261000200420
261100200420      **** Determine MATURITY-DATE of ACCOUNT-CONTRACT
261200200420
261300200420           MOVE ZEROES              TO WS-MATURITY-DATE.
261400200420
261500200420      *RFS 122446 Begins
261600200420      *    IF SEG-TRANSFER-MATURITY-DATE
261700200420           IF SEG-TRANSFER-MATURITY-DATE AND lc_Policy NOT= "A"
261800200420      *RFS 122446 Begins
261900200420           IF SEG-TRANSFER-MATURITY-DATE
262000200420               GO TO CCMD-EXIT
262100200420           ELSE
262200200420               CONTINUE
262300200420           END-IF.
262400200420
262500200420      *RFS 15917 Begin
262600200420           MOVE ACCOUNT-NO OF TRANS
262700200420           TO ACCOUNT-NO OF ACCOUNT
262800200420
262900200420           READ ACCOUNT
263000200420             KEY IS EXTERNALLY-DESCRIBED-KEY
263100200420             INVALID KEY
263200200420               GO TO CCMD-EXIT
263300200420           END-READ
263400200420
263500200420           MOVE ACCOUNT-NO   OF TRANS
263600200420                             TO ACCOUNT-NO
263700200420                             OF ACCOUNT-ANNUITANT-DEFAULT.
263800200420EY         MOVE "P"          TO DEFAULT-FLAG
263900200420                             OF ACCOUNT-ANNUITANT-DEFAULT.
264000200420
264100200420      *RFS 15917 End
264200200420
264300200420           READ ACCOUNT-ANNUITANT-DEFAULT
264400200420           INVALID KEY
264500200420             GO TO CCMD-EXIT
264600200420           END-READ.
264700200420
264800200420           IF DATE-OF-BIRTH OF ACCOUNT-ANNUITANT-DEFAULT = 0
264900200420             GO TO CCMD-EXIT
265000200420           END-IF.
265100200420      * RFS112944 - Start
265200200420           IF lc_Policy = "A"
265300200420               PERFORM  PopulateEffectiveDate
265400200420           END-IF.
265500200420      * RFS112944 - End
265600200420
26570020042046707      MOVE Account-No OF Trans TO pi-MATAGAccountNo.
26580020042046707      MOVE 0 TO pi-MATAGContractNo.
265900200420114769     IF  Contract-Prov OF Ws-Account-Contract NOT = Spaces
26600020042046707          MOVE Contract-Prov OF Ws-Account-Contract
26610020042046707                                    TO pc-MATAGProvinceCode
266200200420      *RFS114769 - Start
266300200420           ELSE
266400200420               MOVE PROVINCE-CODE OF INVESTOR
266500200420                                         TO pc-MATAGProvinceCode
266600200420           End-IF
266700200420      *RFS114769 - End
26680020042046707      MOVE Investment-Code OF Trans TO pc-MATAGInvestmentCode.
266900200420      * EY Pass 0 as Start_Date to get CMD from the younger annuit DOB
267000200420EY    **   MOVE Trade-Date OF Trans TO pi-MATAGStartDate.
267100200420EY         MOVE Zeroes              TO pi-MATAGStartDate.
267200200420      * RFS107679 - Start
267300200420           SET lc_FlagCallFXCNTMATAGYes  TO TRUE.
267400200420      * RFS112944 - Start
267500200420           IF lc_Policy = "A"
267600200420              MOVE START-DATE of Ws-Account-Contract TO
267700200420                                    pi-MATAGStartDate
267800200420              MOVE CONTRACT-NO of Ws-Account-Contract TO
267900200420                                    pi-MATAGContractNo
268000200420           END-IF.
268100200420      * RFS112944 - End
268200200420107679     PERFORM CallFXCNTMATAG.
268300200420           IF  lc_GlwbInvestment = "Y"  AND pb-MATAGNoRejection
268400200420           AND pc-CMDOverride    = "Y"
268500200420      * RFS118636 - 13.6 Defect 34433 - start
268600200420           AND NOT SEG-VALIDATION-MODE
268700200420      * RFS118636 - 13.6 Defect 34433 - end
268800200420               MOVE Account-No OF Trans TO pi_CNTMAGAccountNo
268900200420               MOVE Zeroes              TO pi_CNTMAGContractNo
269000200420               MOVE li_orgCntMaturity   TO pi_CNTMAGOrgcntmatdate
269100200420               MOVE Ws-Maturity-Date    TO pi_CNTMAGCntmatdate
269200200420               MOVE Trade-date Of Trans TO pi_CNTMAGTradedate
269300200420               MOVE ZEROS               TO pi_CNTMAGrejcode
269400200420               PERFORM CallFXORGCNTMAG
269500200420           END-IF.
269600200420      * RFS107679 - End
269700200420      * RFS112944 - Start
269800200420           IF lc_Policy = "A"
269900200420               PERFORM  CheckAcctMatDate
270000200420           END-IF.
270100200420      * RFS112944 - End
270200200420
270300200420107679 CallFXCNTMATAG.
27040020042046707      CALL "FXCNTMATAG" USING pi-MATAGAccountNo
27050020042046707                              pi-MATAGContractNo
27060020042046707                              pc-MATAGProvinceCode
27070020042046707                              pc-MATAGInvestmentCode
27080020042046707                              pi-MATAGStartDate
27090020042046707                              pi-MATAGContractMaturityDate
27100020042046707                              pc-MATAGWhichDateFlag
27110020042046707                              pc-MATAGAllowChangesFlag
27120020042046707                              pi-MATAGAgeThreshold
27130020042080554                              pi-MATAGEligDftAge
27140020042080554                              pc-MATAGEligDateRule
271500200420107679                             pi-MATAGOrgContMaturityDate
271600200420112944                             pi-MATAGAccMaturityDate
271700200420112967                             pc-MATAGDisallowMatBen
27180020042046707                              pc-MATAGRejectionCode.
271900200420
27200020042046707      IF pb-MATAGNoRejection
272100200420122446       IF NOT SEG-TRANSFER-MATURITY-DATE
27220020042046707         MOVE pi-MATAGContractMaturityDate
27230020042046707           TO Ws-Maturity-Date
272400200420      * RFS107679 - START
272500200420              MOVE pi-MATAGOrgContMaturityDate
272600200420                TO li_orgCntMaturity
272700200420122446       END-IF
272800200420      * RFS107679 - END
272900200420      * RFS118920 - START
273000200420           Evaluate True
273100200420            When pi-MATAGContractMaturityDate NOT =
273200200420                 Maturity-Date of WS-ACCOUNT-CONTRACT  AND
273300200420                 pi-MATAGOrgContMaturityDate  NOT =
273400200420                 Original-CMD of WS-ACCOUNT-CONTRACT
273500200420                 MOVE "B" TO  pc_MatdateChangeIndicator
273600200420            When pi-MATAGContractMaturityDate NOT =
273700200420                 Maturity-Date of WS-ACCOUNT-CONTRACT  AND
273800200420                 pi-MATAGOrgContMaturityDate  =
273900200420                 Original-CMD of WS-ACCOUNT-CONTRACT
274000200420                 MOVE "C" TO  pc_MatdateChangeIndicator
274100200420            When pi-MATAGContractMaturityDate =
274200200420                 Maturity-Date of WS-ACCOUNT-CONTRACT  AND
274300200420                 pi-MATAGOrgContMaturityDate  NOT =
274400200420                 Original-CMD of WS-ACCOUNT-CONTRACT
274500200420                 MOVE "O" TO  pc_MatdateChangeIndicator
274600200420            When Other
274700200420                 MOVE " " TO pc_MatdateChangeIndicator
274800200420           End-Evaluate
274900200420      * RFS118920 - END
27500020042046707      END-IF.
275100200420      * RFS107679 - START
275200200420       CallFXORGCNTMAG.
275300200420               CALL "FXORCNTMAG"  USING pi_CNTMAGAccountNo
275400200420                                        pi_CNTMAGContractNo
275500200420                                        pi_CNTMAGOrgcntmatdate
275600200420                                        pi_CNTMAGCntmatdate
275700200420                                        pi_CNTMAGtradedate
275800200420                                        pi_CNTMAGrejcode.
275900200420      * RFS107679 - END
276000200420
27610020042046707 * The following logic is replaced by calling FXCNTMATAG.
276200200420
27630020042011900 *46707INITIALIZE MFACMATAGP OF CONTRACT-MATURITY-AGE.
276400200420  ¦   *46707
276500200420  ¦   *46707MOVE ACCOUNT-TYPE-CODE OF ACCOUNT
276600200420  ¦   *46707                 TO ACCOUNT-TYPE-CODE
276700200420  ¦   *46707                 OF CONTRACT-MATURITY-AGE.
276800200420  ¦
276900200420  ¦   *46707MOVE CONTRACT-PROV     OF  WS-ACCOUNT-CONTRACT
277000200420  ¦   *46707                 TO PROVINCE-OF-AGREEMENT
277100200420  ¦   *46707                 OF CONTRACT-MATURITY-AGE.
277200200420  ¦
277300200420  ¦   *46707IF NOMINEE OF ACCOUNT EQUAL TO 'Y'
277400200420      *RFS 15917 Begin
277500200420      *46707   MOVE ACCOUNT-NO       OF ACCOUNT
277600200420      *46707   TO   ACCOUNT-NO       OF ACCOUNT-NOMINEE
277700200420
277800200420      *46707   READ ACCOUNT-NOMINEE
277900200420      *46707   INVALID KEY
278000200420      *46707     GO TO CCMD-0100
278100200420      *46707   END-READ
278200200420
278300200420      *RFS 15917 End
278400200420  ¦   *46707   MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE
278500200420  ¦   *46707                 TO NOMINEE-ACCOUNT-TYPE
278600200420  ¦   *46707                 OF CONTRACT-MATURITY-AGE
278700200420  ¦   *46707END-IF.
278800200420  ¦
278900200420  ¦   *46707READ CONTRACT-MATURITY-AGE
279000200420  ¦   *46707INVALID KEY
279100200420  ¦   *46707 CONTINUE
279200200420  ¦   *46707NOT INVALID KEY
279300200420  ¦   *46707 GO TO CCMD-0100
279400200420  ¦   *46707END-READ.
279500200420  ¦
279600200420  ¦   *46707INITIALIZE MFACMATAGP OF CONTRACT-MATURITY-AGE.
279700200420  ¦
279800200420  ¦   *46707IF NOMINEE OF ACCOUNT EQUAL TO 'Y'
279900200420  ¦   *46707  MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE
280000200420  ¦   *46707                 TO NOMINEE-ACCOUNT-TYPE
280100200420  ¦   *46707                 OF CONTRACT-MATURITY-AGE
28020020042011900 *46707END-IF.
280300200420
280400200420      *46707MOVE ACCOUNT-TYPE-CODE OF ACCOUNT
280500200420      *46707                 TO ACCOUNT-TYPE-CODE
280600200420      *46707                 OF CONTRACT-MATURITY-AGE.
280700200420
280800200420      *46707READ CONTRACT-MATURITY-AGE
280900200420      *46707INVALID KEY
281000200420      *46707 GO TO CCMD-EXIT
281100200420      *46707END-READ.
281200200420
28130020042011900 *46707CCMD-0100.
281400200420
281500200420      *46707MOVE DATE-OF-BIRTH OF ACCOUNT-ANNUITANT-DEFAULT
281600200420      *46707                 TO WS-MATURITY-DATE.
281700200420      *46707ADD AGE-THRESHOLD OF CONTRACT-MATURITY-AGE
281800200420      *46707                 TO WS-MATURITY-YEAR.
281900200420
282000200420      * RFS 16454 Begin
282100200420      * If WS-MATURITY-DATE is calculated as February, 29th - we
282200200420      * should check if the resultant year is a valid leap year -
282300200420      * otherwise, let's replace with March 1rst instead.
282400200420
282500200420      *46707IF WHICH-DATE-FLAG OF CONTRACT-MATURITY-AGE = "Y"
282600200420      *46707 MOVE 12         TO WS-MATURITY-MONTH
282700200420      *46707 MOVE 31         TO WS-MATURITY-DAYS
282800200420      *46707ELSE
282900200420      *46707   IF WS-MATURITY-MONTH = 2 AND WS-MATURITY-DAYS = 29
283000200420      *46707       MOVE WS-MATURITY-YEAR TO DLP-YEAR
283100200420      *46707       CALL "DRLEAP" USING DR-LEAP-PARMS
283200200420      *46707       IF NOT IS-LEAP-YEAR
283300200420      *46707           MOVE 03 TO WS-MATURITY-MONTH
283400200420      *46707           MOVE 01 TO WS-MATURITY-DAYS
283500200420      *46707       END-IF
283600200420      *46707   END-IF
283700200420      *46707END-IF.
283800200420
283900200420      * RFS 16454 End
284000200420
284100200420       CCMD-EXIT.
284200200420           EXIT.
284300200420
284400200420      *RFS 13306 END
284500200420      /
284600200420      * RFS112944 - Start
284700200420        PopulateEffectiveDate section.
284800200420
284900200420            INITIALIZE MFAACMDP OF ACCOUNT-MISC-DETAILS-REC
285000200420
285100200420            SET lb_RewriteNo TO TRUE
285200200420            SET lb_WriteNo   TO TRUE
285300200420
285400200420            MOVE ACCOUNT-NO  OF TRANS
285500200420                        TO ACCOUNT-NO of ACCOUNT-MISC-DETAILS
285600200420
285700200420            READ ACCOUNT-MISC-DETAILS
285800200420122815           WITH NO LOCK
285900200420            INVALID KEY
286000200420              SET lb_WriteYes  TO TRUE
286100200420            NOT INVALID KEY
286200200420              SET lb_RewriteYes  TO TRUE
286300200420            END-READ
286400200420
286500200420124070*    IF EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS  > 0
286600200420124070     IF EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS  > 0
286700200420              IF (TRADE-DATE OF TRANS <
286800200420124070*           EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS)
286900200420124070            EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS)
287000200420                     SET lb_RewriteYes  TO TRUE
287100200420                     MOVE TRADE-DATE OF TRANS TO
287200200420124070*                EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS
287300200420124070                 EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS
287400200420              END-IF
287500200420              IF (TRADE-DATE OF TRANS >
287600200420124070*           EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS)
287700200420124070            EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS)
287800200420                     SET lb_RewriteNo TO TRUE
287900200420              END-IF
288000200420           ELSE
288100200420                 MOVE TRADE-DATE OF TRANS TO
288200200420124070*                EFFECTIVE-DATE  OF ACCOUNT-MISC-DETAILS
288300200420124070                 EFFECTIV-DATE  OF ACCOUNT-MISC-DETAILS
288400200420           END-IF.
288500200420
288600200420           IF lb_EditCodeACINVGSetupYes
288700200420
288800200420             MOVE ACCOUNT-NO  OF TRANS
288900200420                        TO ACCOUNT-NO of ACCOUNT-MISC-DETAILS
289000200420               IF lb_WriteYes
289100200420                   WRITE ACCOUNT-MISC-DETAILS-REC
289200200420                      INVALID KEY
289300200420                      CONTINUE
289400200420                   END-WRITE
289500200420               ELSE
289600200420               IF lb_RewriteYes
289700200420                   REWRITE ACCOUNT-MISC-DETAILS-REC
289800200420                      INVALID KEY
289900200420                      CONTINUE
290000200420                   END-REWRITE
290100200420               END-IF
290101210914      *RFS1117962 - Starts
290102210914185455*              PERFORM RecalculateRiderResetDate
290103210914               PERFORM RecalculateRiderResetDate thru
290104210914                       RRRD-Exit
290105210914      *RFS1117962 - End
290300200420           END-IF.
290400200420
290500200420        CheckAcctMatDate section.
290600200420
290700200420      *** RFS 118636 starts ***
290800200420136442*     IF Maturity-Date of WS-ACCOUNT-CONTRACT =
290900200420136442*        ACCOUNT-MATURITY-DATE OF ACCOUNT-MISC-DETAILS
291000200420136442*     SET lc_AMDCMDSame TO TRUE
291100200420136442*     END-IF.
291200200420      *** RFS 118636 ends   ***
291300200420            IF pi-MATAGAccMaturityDate  >
291400200420               ACCOUNT-MATURITY-DATE OF ACCOUNT-MISC-DETAILS
291500200420                 MOVE pi-MATAGAccMaturityDate TO
291600200420                        Account-Maturity-date
291700200420                        OF ACCOUNT-MISC-DETAILS
291800200420            ELSE
291900200420                  CONTINUE
292000200420            END-IF.
292100200420
292200200420            IF lb_EditCodeACINVGSetupYes
292300200420
292400200420      * RFS120585 - Start
292500200420
292600200420                INITIALIZE MFAACMDP OF ACCOUNT-MISC-DETAILS-REC
292700200420
292800200420                MOVE ACCOUNT-NO   OF TRANS
292900200420                       TO ACCOUNT-NO of ACCOUNT-MISC-DETAILS
293000200420
293100200420                READ ACCOUNT-MISC-DETAILS
293200200420122815               WITH NO LOCK
293300200420                INVALID KEY
293400200420                  SET lb_WriteYes  TO TRUE
293500200420                NOT INVALID KEY
293600200420                  SET lb_RewriteYes  TO TRUE
293700200420                END-READ
293800200420
293900200420                 IF (TRADE-DATE OF TRANS >
294000200420124070*            EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS)
294100200420124070             EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS)
294200200420                     SET lb_RewriteNo TO TRUE
294300200420                 END-IF
294400200420
294500200420                 INITIALIZE lc-returnCode
294600200420      * RFS120585 - End
294700200420
294800200420                 Call "FXACINVG" using lnc-TRNPST
294900200420                                  account-no of trans
295000200420                                  investment-code of trans
295100200420                                  lc-returnCodeDesc
295200200420                                  lc-returnCode
295300200420
295400200420                 IF ACCOUNT-INVESTMENT-GROUP OF
295500200420                                  ACCOUNT-MISC-DETAILS = " "
295600200420                   IF lc-returnCode not equal spaces
295700200420                         Move "S54" to REJECTION-CODE OF TRANS
295800200420                   END-IF
295900200420
296000200420                 END-IF
296100200420
296200200420                 IF ACCOUNT-INVESTMENT-GROUP OF
296300200420                       ACCOUNT-MISC-DETAILS NOT EQUAL SPACES
296400200420
296500200420                   IF lc-returnCode not equal spaces
296600200420                         Move "S55" to REJECTION-CODE OF TRANS
296700200420                   END-IF
296800200420
296900200420                 END-IF
297000200420
297100200420118636         IF pi-MATAGAccMaturityDate  >
297200200420  |               ACCOUNT-MATURITY-DATE OF ACCOUNT-MISC-DETAILS
297300200420  |               and lb_RewriteNo and lb_WriteNo
297400200420  |               SET lb_RewriteYes  TO TRUE
297500200420118636         END-IF
297600200420
297700200420               MOVE pi-MATAGAccMaturityDate TO
297800200420                   ACCOUNT-MATURITY-DATE OF ACCOUNT-MISC-DETAILS
297900200420
298000200420               IF ACCOUNT-INVESTMENT-GROUP OF ACCOUNT-MISC-DETAILS
298100200420                  EQUAL SPACES
298200200420
298300200420                  INITIALIZE MFAINVSXP
298400200420                        OF INVESTMENT-STRUCTURE-XREF-REC
298500200420
298600200420                  MOVE Investment-Code OF Trans TO
298700200420                    INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF
298800200420
298900200420                  MOVE SPACES TO INVESTMENT-STRUCTURE-CODE
299000200420                                 OF INVESTMENT-STRUCTURE-XREF
299100200420
299200200420                  START INVESTMENT-STRUCTURE-XREF
299300200420                    KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
299400200420                    INVALID KEY
299500200420                         CONTINUE
299600200420                    NOT INVALID KEY
299700200420                      SET lb_ProceedFlag TO TRUE
299800200420                  END-START
299900200420
300000200420      * RFS120585 - Start
300100200420                  IF lb_ProceedFlag
300200200420122446              SET lb_NotEndFlag  TO TRUE
300300200420                    PERFORM UNTIL lb_EndFlag
300400200420                      READ INVESTMENT-STRUCTURE-XREF NEXT RECORD
300500200420                      AT END
300600200420                        SET lb_EndFlag  TO TRUE
300700200420                      NOT AT END
300800200420                       IF (Investment-Code OF Trans NOT =
300900200420                         INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF)
301000200420
301100200420                           SET lb_EndFlag  TO TRUE
301200200420                       ELSE
301300200420
301400200420                           INITIALIZE MFAFNCTP
301500200420                                 OF FUNCT-INV-STRUCT-XREF-REC
301600200420
301700200420                         MOVE INVESTMENT-STRUCTURE-CODE OF
301800200420                           INVESTMENT-STRUCTURE-XREF  TO
301900200420                              INVESTMENT-STRUCTURE-CODE OF
302000200420                            FUNCTION-INV-STRUCTURE-XREF
302100200420
302200200420                         MOVE "ACINVG" TO FUNCTION-CODE OF
302300200420                         FUNCTION-INV-STRUCTURE-XREF
302400200420
302500200420                         READ FUNCTION-INV-STRUCTURE-XREF
302600200420                         INVALID KEY
302700200420                           MOVE SPACES TO
302800200420                            ACCOUNT-INVESTMENT-GROUP OF
302900200420                            ACCOUNT-MISC-DETAILS
303000200420                         NOT INVALID KEY
303100200420                           SET lb_EndFlag  TO TRUE
303200200420                           MOVE INVESTMENT-STRUCTURE-CODE OF
303300200420                            INVESTMENT-STRUCTURE-XREF  TO
303400200420                            ACCOUNT-INVESTMENT-GROUP OF
303500200420                            ACCOUNT-MISC-DETAILS
303600200420                         END-READ
303700200420                       END-IF
303800200420                     END-READ
303900200420                    END-PERFORM
304000200420                  END-IF
304100200420               END-IF
304200200420
304300200420      * Below code is to erase Effective Date for the initial
304400200420      * deposit when there is no Inv Structure with ACINVG
304500200420
304600200420118636*        IF ((REJECTION-CODE OF TRANS NOT = "00")
304700200420118636         IF ((REJECTION-CODE OF TRANS = "S54")
304800200420                  AND (TRADE-DATE OF TRANS =
304900200420124070*             EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS))
305000200420124070              EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS))
305100200420      * RFS120585 - End
305200200420
305300200420                  MOVE 0 TO
305400200420                     ACCOUNT-MATURITY-DATE OF ACCOUNT-MISC-DETAILS
305500200420                  MOVE 0 TO
305600200420124070*              EFFECTIVE-DATE OF ACCOUNT-MISC-DETAILS
305700200420124070               EFFECTIV-DATE OF ACCOUNT-MISC-DETAILS
305800200420               END-IF
305900200420      *RFS124070 Start.
306000200420               IF ((pi-MATAGContractMaturityDate > 0) AND
306100200420                  (pc-MATAGDisallowMatBen = 'Y') AND
306200200420                  (FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS = 0))
306300200420
306400200420                  MOVE pi-MATAGContractMaturityDate
306500200420                  TO FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS
306600200420               END-IF
306700200420      *RFS124070 End.
306800200420
306900200420               IF lb_RewriteYes
307000200420                 REWRITE ACCOUNT-MISC-DETAILS-REC
307100200420                  INVALID KEY
307200200420                     CONTINUE
307300200420                 END-REWRITE
307400200420               END-IF
307500200420
307600200420      *** RFS 118636 starts ***
307700200420            IF Maturity-Date of WS-ACCOUNT-CONTRACT =
307800200420               ACCOUNT-MATURITY-DATE OF ACCOUNT-MISC-DETAILS
307900200420            SET lc_AMDCMDSame TO TRUE
308000200420136442      ELSE
308100200420136442      SET lc_AMDCMDDiff TO TRUE
308200200420            END-IF
308300200420      *** RFS 118636 ends   ***
308400200420      *** RFS 118636 starts ***
308500200420            IF pi-MATAGContractMaturityDate NOT =  Maturity-Date OF
308600200420136442*        WS-ACCOUNT-CONTRACT and lc_AMDCMDSame
308700200420136442         WS-ACCOUNT-CONTRACT and lc_AMDCMDDiff
308800200420               MOVE Account-No OF WS-ACCOUNT-CONTRACT TO
308900200420                             Account-No OF Account-Contract-Rec
309000200420               MOVE Contract-No OF WS-ACCOUNT-CONTRACT TO
309100200420                              Contract-No OF Account-Contract-Rec
309200200420               MOVE pi-MATAGContractMaturityDate TO Maturity-Date
309300200420                                           OF Account-Contract-Rec
309400200420               MOVE "C" TO pc_MatdateChangeIndicator
309500200420
309600200420               IF Deposit-Maturity-Date OF WS-ACCOUNT-CONTRACT > 0
309700200420                  MOVE pi-MATAGContractMaturityDate TO
309800200420                       Deposit-Maturity-Date OF Account-Contract-Rec
309900200420                  MOVE "A" TO pc_MatdateChangeIndicator
310000200420
310100200420136442         IF pi-MATAGContractMaturityDate = pi-MATAGAccMaturityDate
310200200420136442         MOVE pi-MATAGContractMaturityDate TO MATURITY-DATE OF
310300200420136442                         WS-ACCOUNT-CONTRACT
310400200420136442         MOVE pi-MATAGContractMaturityDate TO
310500200420136442                DEPOSIT-MATURITY-DATE OF WS-ACCOUNT-CONTRACT
310600200420               REWRITE Account-Contract-Rec
310700200420                   INVALID KEY CONTINUE
310800200420               END-REWRITE
310900200420
311000200420               MOVE Account-No OF WS-ACCOUNT-CONTRACT TO pi_Account_No
311100200420               MOVE Contract-No OF WS-ACCOUNT-CONTRACT TO pi_ContractNo
311200200420               MOVE "TRNPST " TO pi_Changedby
311300200420               INITIALIZE pc_rejCode pi_ScreenPrgmCode
311400200420               CALL "FXSEGLOG" USING   pi_Account_No
311500200420                                       pi_ContractNo
311600200420                                       pc_MatdateChangeIndicator
311700200420                                       pi_Changedby
311800200420                                       pi_ScreenPrgmCode
311900200420                                       pc_rejCode
312000200420            END-IF
312100200420      *** RFS 118636 ends  ***
312200200420
312300200420            END-IF.
312400200420      * RFS112944 - End
312500200420
312600200420      *RFS124070 - Start
312700200420
312800200420            MOVE Account-No OF WS-ACCOUNT-CONTRACT TO pi_Account_No.
312900200420            MOVE Contract-No OF WS-ACCOUNT-CONTRACT TO pi_ContractNo.
313000200420            MOVE "TRNPST " TO pi_Changedby.
313100200420            MOVE "ACCDTL " TO pi_ScreenPrgmCode.
313200200420            MOVE "F"       TO pc_MatdateChangeIndicator.
313300200420            INITIALIZE pc_rejCode .
313400200420            CALL "FXSEGLOG" USING   pi_Account_No
313500200420                                    pi_ContractNo
313600200420                                    pc_MatdateChangeIndicator
313700200420                                    pi_Changedby
313800200420                                    pi_ScreenPrgmCode
313900200420                                    pc_rejCode.
314000200420
314100200420
314200200420            IF (((FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS) <=
314300200420              pi-MATAGContractMaturityDate ) AND
314400200420               ( pi-MATAGContractMaturityDate <
314500200420                 pi-MATAGAccMaturityDate) AND
314600200420               ( FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS > 0))
314700200420
314800200420              MOVE Account-No OF WS-ACCOUNT-CONTRACT TO
314900200420                            Account-No OF Account-Contract-Rec
315000200420
315100200420              MOVE Contract-No OF WS-ACCOUNT-CONTRACT TO
315200200420                             Contract-No OF Account-Contract-Rec
315300200420
315400200420              MOVE FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS
315500200420                   TO Maturity-Date OF Account-Contract-Rec
315600200420                   MATURITY-DATE OF WS-ACCOUNT-CONTRACT
315700200420                   WS-MATURITY-DATE
315800200420
315900200420
316000200420              MOVE FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS
316100200420                TO Deposit-Maturity-Date OF Account-Contract-Rec
316200200420                DEPOSIT-MATURITY-DATE OF WS-ACCOUNT-CONTRACT
316300200420
316400200420                    REWRITE Account-Contract-Rec
316500200420                        INVALID KEY CONTINUE
316600200420                    END-REWRITE
316700200420           END-IF.
316800200420
316900200420       UPDATE-FINAL-TOPUPDATE SECTION.
317000200420
317100200420            MOVE Account-No OF Trans TO pi-MATAGAccountNo.
317200200420
317300200420            IF  Contract-Prov OF Ws-Account-Contract NOT = Spaces
317400200420                MOVE Contract-Prov OF Ws-Account-Contract
317500200420                                          TO pc-MATAGProvinceCode
317600200420            ELSE
317700200420                MOVE PROVINCE-CODE OF INVESTOR
317800200420                                          TO pc-MATAGProvinceCode
317900200420            END-IF.
318000200420
318100200420            MOVE Investment-Code OF Trans TO pc-MATAGInvestmentCode.
318200200420
318300200420            MOVE START-DATE of Ws-Account-Contract TO
318400200420                                  pi-MATAGStartDate.
318500200420            MOVE CONTRACT-NO of Ws-Account-Contract TO
318600200420                                  pi-MATAGContractNo.
318700200420
318800200420           CALL "FXCNTMATAG" USING pi-MATAGAccountNo
318900200420                                   pi-MATAGContractNo
319000200420                                   pc-MATAGProvinceCode
319100200420                                   pc-MATAGInvestmentCode
319200200420                                   pi-MATAGStartDate
319300200420                                   pi-MATAGContractMaturityDate
319400200420                                   pc-MATAGWhichDateFlag
319500200420                                   pc-MATAGAllowChangesFlag
319600200420                                   pi-MATAGAgeThreshold
319700200420                                   pi-MATAGEligDftAge
319800200420                                   pc-MATAGEligDateRule
319900200420                                   pi-MATAGOrgContMaturityDate
320000200420                                   pi-MATAGAccMaturityDate
320100200420                                   pc-MATAGDisallowMatBen
320200200420                                   pc-MATAGRejectionCode.
320300200420
320400200420            IF (((FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS) <=
320500200420              pi-MATAGContractMaturityDate ) AND
320600200420               ( pi-MATAGContractMaturityDate <
320700200420                 pi-MATAGAccMaturityDate))
320800200420
320900200420              MOVE Account-No OF WS-ACCOUNT-CONTRACT TO
321000200420                            Account-No OF Account-Contract-Rec
321100200420
321200200420              MOVE Contract-No OF WS-ACCOUNT-CONTRACT TO
321300200420                             Contract-No OF Account-Contract-Rec
321400200420
321500200420              MOVE FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS
321600200420                   TO Maturity-Date OF Account-Contract-Rec
321700200420                      MATURITY-DATE OF WS-ACCOUNT-CONTRACT
321800200420
321900200420
322000200420              MOVE FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS
322100200420                TO Deposit-Maturity-Date OF Account-Contract-Rec
322200200420                  DEPOSIT-MATURITY-DATE OF WS-ACCOUNT-CONTRACT
322300200420
322400200420                    REWRITE Account-Contract-Rec
322500200420                        INVALID KEY CONTINUE
322600200420                    END-REWRITE
322700200420           END-IF.
322800200420      * RFS124070 - END
322900200420
323000200420       FIND-SEG-CONTRACT-MATCH SECTION.
323100200420      ******************************************************************
323200200420      *                                                                *
323300200420      *    F I N D   S E G   C O N T R A C T   M A T C H   R O U T I N E
323400200420      *                                                                *
323500200420      ******************************************************************
323600200420
323700200420      * Skip nominee seg. authorization checking if no account
323800200420
323900200420      * RFS11236- Begin
324000200420           INITIALIZE MFAACCONP OF ACCOUNT-CONTRACT-REC
324100200420      * RFS11236 - End
324200200420
32430020042044930 * 52328     SET lb_DthPercentCalculatedNo TO TRUE.
324400200420
324500200420           IF WS-ACCOUNT-EXISTS NOT = "Y"
324600200420             GO TO FSCM-0001
324700200420           END-IF.
324800200420
324900200420           IF NOMINEE OF ACCOUNT NOT = "Y"
325000200420             GO TO FSCM-0001
325100200420           END-IF.
325200200420
325300200420           IF ACCOUNT-DESIGNATION OF NOMINEE-FILE = "2"
325400200420             GO TO FSCM-0001
325500200420           END-IF.
325600200420
325700200420      * Check for nominee seg. authorization for 3rd party admin.
325800200420
325900200420           MOVE NOMINEE-CODE OF ACCOUNT-NOMINEE
326000200420                             TO NOMINEE-CODE OF NOMINEE-MISC-DETAILS.
326100200420
326200200420           READ NOMINEE-MISC-DETAILS
326300200420           INVALID KEY
326400200420             MOVE "57"       TO REJECTION-CODE OF TRANS
326500200420             GO TO FSCM-EXIT
326600200420           END-READ.
326700200420
326800200420           IF SEG-FUND-TRADING OF NOMINEE-MISC-DETAILS NOT = "Y"
326900200420             MOVE "57"       TO REJECTION-CODE OF TRANS
327000200420             GO TO FSCM-EXIT
327100200420           END-IF.
327200200420
327300200420       FSCM-0001.
327400200420      ** RFS 37754 - begin
327500200420R81876** RFS 81876 - begin (uncommented the below code commented for
327600200420 |    *              RFS 71769)
327700200420 |    ** RFS 71769 - begin (commented the below code to Move Y)
327800200420 |          IF SPEC-MOD-AUTH-SEGSYSMAT-ON AND
327900200420 |             PURCHASE-TRANSACTION       AND
328000200420 |             lnc_OrigCodeMat            AND
328100200420 |             COMM-RATE OF TRANS-COMMISSION = 0
328200200420 |             MOVE "Y"          TO WS-BLANKET-INSURANCE-LICENSE
328300200420 |             GO TO FSCM-0003
328400200420 |          END-IF.
328500200420 |    ** RFS 71769 - end
328600200420R81876** RFS 81876 - end
328700200420      ** RFS 37754 - end
328800200420
328900200420      * Test if dealer has blanket insurance license
329000200420
329100200420           MOVE "N"          TO WS-BLANKET-INSURANCE-LICENSE.
329200200420           MOVE DEALER-CODE  OF TRANS
329300200420                             TO DEALER-CODE OF DEALER-MISC-DETAILS.
329400200420
329500200420           READ DEALER-MISC-DETAILS
329600200420           INVALID KEY
329700200420             GO TO FSCM-0003
329800200420           END-READ.
329900200420
330000200420           MOVE BLANKET-INSURANCE-LICENSE OF DEALER-MISC-DETAILS
330100200420                             TO WS-BLANKET-INSURANCE-LICENSE.
330200200420
330300200420       FSCM-0003.
330400200420
330500200420           MOVE "N"          TO WS-CONTRACT-MATCH.
330600200420           MOVE "N"          TO WS-CONTRACT-IS-EMPTY.
330700200420
330800210127      *RFS186198 START
330900210727           IF Lb_AccountLevelGlwbYes
331000210127              INITIALIZE lc_FXSETPOL_Parms,
331100210127                         lc_InvStrucCodeofTransInv
331200210127              MOVE INVESTMENT-CODE OF TRANS TO lc_FXSETPOL_InvCode
331300210127              PERFORM GET-SETPOL-STRUCTURE
331400210127              MOVE lc_FXSETPOL_InvStrucCode
331500210127                TO lc_InvStrucCodeofTransInv
331600210127           END-IF.
331700210127      *RFS186198 END
331800200420      * Get investment seg information
331900200420
332000200420           MOVE INVESTMENT-CODE OF TRANS
332100200420                               TO INVESTMENT-CODE OF INVESTMENT-SEG.
332200200420
332300200420           READ INVESTMENT-SEG
332400200420           INVALID KEY
332500200420             IF NOT UNCONFIRMED
332600200420               MOVE "60"       TO REJECTION-CODE OF TRANS
332700200420             END-IF
332800200420             GO TO FSCM-EXIT
332900200420           END-READ.
333000200420      *RFS185170 - Begin
333100200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
333200200426                                   lb_AccountLevelGLWBYes
333300200426              MOVE ACCOUNT-NO      OF TRANS
333400200426                TO pi_ACCGLWBD_AccNo
333500200426              MOVE INVESTMENT-CODE OF TRANS
333600200426                TO pc_ACCGLWBD_InvCode
333700200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
333800200426              PERFORM GetAccGLWBDetails
333900200426              IF pc_ACCGLWBD_Series NOT = SPACES
334000200426                 MOVE pc_ACCGLWBD_Series
334100200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
334200200426              END-IF
334300200426           END-IF.
334400200420      *RFS185170 - End
334500200420
334600200420           MOVE RESET-TYPE-CODE OF INVESTMENT-SEG
334700200420                               TO WS-CMP-RESET-TYPE.
334800200420           MOVE CONTRACT-STATUS-SCHED-CODE OF INVESTMENT-SEG
334900200420                               TO WS-CMP-CONTRACT-STATUS-SCHED.
335000200420           MOVE MATURITY-ALLOW-DAYS OF INVESTMENT-SEG
335100200420                               TO WS-CMP-MATURITY-ALLOW-DAYS.
33520020042057388      MOVE gdv-sched-code of Investment-seg
33530020042057388                          TO Ws-cmp-gdv-sched-code.
335400200420      * RFS 7924 - BEGIN
335500200420           MOVE RESET-SCHEDULE-CODE OF INVESTMENT-SEG
335600200420                               TO WS-CMP-RESET-SCHEDULE-CODE.
335700200420      * RFS 7924 - END
33580020042044930      MOVE Guar-Death-Sched-Code OF INVESTMENT-SEG
33590020042044930        TO Ws-Cmp-Guar-Death-Sched-Code.
33600020042055136      MOVE Investment-Series OF INVESTMENT-SEG
33610020042055136                          TO Ws-Cmp-Investment-Series.
336200200420
33630020042046707      PERFORM CheckGLWBRules.
336400200420
33650020042046707      MOVE Ws-Edit-Specific-Contract
33660020042046707        TO Ws-Edit-Specific-Contract-Old.
33670020042046707 *    IF Investment-Series OF Investment-Seg NOT = SPACE AND
33680020042050474      IF lc_GlwbInvestment = "Y" AND
33690020042046707         Ws-Edit-Specific-Contract NOT = lncc_Y
33700020042046707         PERFORM GetQualifiedGLWBContract
33710020042046707      END-IF.
337200200420
337300200420      * Calculate deposit length
337400200420
337500200420
337600200420           MOVE INVESTMENT-CODE OF TRANS
337700200420                               TO INVESTMENT-CODE
337800200420                               OF DEPOSIT-MAT-LEN-SCHED.
337900200420           MOVE ZEROES
338000200420                               TO START-DATE
338100200420                               OF DEPOSIT-MAT-LEN-SCHED.
338200200420           MOVE ZEROES         TO END-DATE
338300200420                               OF DEPOSIT-MAT-LEN-SCHED.
338400200420
338500200420           START DEPOSIT-MAT-LEN-SCHED
338600200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
338700200420           INVALID KEY
338800200420             IF NOT UNCONFIRMED
338900200420               MOVE "61"       TO REJECTION-CODE OF TRANS
339000200420             END-IF
339100200420             GO TO FSCM-EXIT
339200200420           END-START.
339300200420
339400200420       FSCM-0005.
339500200420
339600200420           READ DEPOSIT-MAT-LEN-SCHED NEXT RECORD
339700200420           AT END
339800200420             IF NOT UNCONFIRMED
339900200420               MOVE "61"       TO REJECTION-CODE OF TRANS
340000200420             END-IF
340100200420             GO TO FSCM-EXIT
340200200420           END-READ.
340300200420
340400200420           IF INVESTMENT-CODE OF DEPOSIT-MAT-LEN-SCHED
340500200420           IS NOT EQUAL INVESTMENT-CODE OF TRANS
340600200420             IF NOT UNCONFIRMED
340700200420               MOVE "61"       TO REJECTION-CODE OF TRANS
340800200420             END-IF
340900200420             GO TO FSCM-EXIT
341000200420           END-IF.
341100200420
341200200420           IF (START-DATE OF DEPOSIT-MAT-LEN-SCHED IS GREATER THAN
341300200420           TRADE-DATE OF TRANS)   OR
341400200420              (END-DATE OF DEPOSIT-MAT-LEN-SCHED IS LESS THAN
341500200420           TRADE-DATE OF TRANS)
341600200420             GO TO FSCM-0005
341700200420           END-IF.
341800200420
341900200420           MOVE DEPOSIT-LENGTH OF DEPOSIT-MAT-LEN-SCHED
342000200420                               TO WS-CMP-DEPOSIT-LEN.
34210020042095850      MOVE GBV-Gross-Net  OF DEPOSIT-MAT-LEN-SCHED
34220020042095850                          TO Ws-Cmp-GBVGrossNet.
342300200420
342400200420R11286     IF WS-EDIT-SEG-CONTR-PROV IS EQUAL TO "Y"
342500200420R11286        MOVE PROVINCE-CODE OF INVESTOR
342600200420R11286          TO CONTRACT-PROV OF ACCOUNT-CONTRACT
342700200420R11286     END-IF.
342800200420
342900200420           IF WS-EDIT-SPECIFIC-CONTRACT IS NOT EQUAL "Y"
343000200420             GO TO FSCM-0010
343100200420           END-IF.
343200200420
343300200420           MOVE ACCOUNT-NO OF TRANS
343400200420                               TO ACCOUNT-NO
343500200420                               OF ACCOUNT-CONTRACT.
343600200420           MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS
343700200420                               TO CONTRACT-NO
343800200420                               OF ACCOUNT-CONTRACT.
343900200420
344000200420           READ ACCOUNT-CONTRACT WITH NO LOCK
344100200420           INVALID KEY
344200200420      * RFS11236 - Begin
344300200420             INITIALIZE MFAACCONP OF ACCOUNT-CONTRACT-REC
344400200420      * RFS11236 - End
344500200420             GO TO FSCM-EXIT
344600200420           END-READ.
344700200829      *RFS185176 Start
344800200829           IF lb_AccountLevelGLWBYes AND
344900200829              ENTERED-BY OF TRANS = "SEGCOGRST" AND
345000200829              START-DATE OF ACCOUNT-CONTRACT < TRADE-DATE OF TRANS
345100200829              MOVE "N" TO WS-CONTRACT-MATCH
345200200829              GO TO FSCM-EXIT
345300200829           END-IF
345400200829      *RFS185176 End
345500200420
345600200420      *RFS121057 Begins
345700200420           IF (CONTRACT-STATUS OF ACCOUNT-CONTRACT IS NOT EQUAL "C"
345800200420              AND  lc_Seg_Contract_rule = lncc_3 )
345900200420
346000200420           CALL "FXCHKACON" using  pn_AccountNumber
346100200420                                   pn_ContractNumber
346200200420                                   pc_ValidAccount
346300200420
346400200420           IF pc_ValidAccount = lncc_N
346500200420              MOVE "04" TO Rejection-Code OF Trans
346600200420              GO TO FSCM-EXIT
346700200420              END-IF
346800200420            END-IF.
346900200420      *RFS121057 Ends
347000200420
347100200420           IF CONTRACT-STATUS OF ACCOUNT-CONTRACT IS NOT EQUAL "O"
347200201023      *RFS1104392 - Start
347300201023              OR (lb_AccountLevelGLWBYes AND
347400201023                CONTRACT-STATUS OF ACCOUNT-CONTRACT IS EQUAL "O" AND
347500201023                CREATION-DATE OF ACCOUNT-CONTRACT = PASS-PROCESS-DATE-9
347600201023                AND START-DATE OF ACCOUNT-CONTRACT < PASS-PROCESS-DATE-9
347700201023                AND TRANS-TYPE-CODE OF TRANS IS EQUAL "BUY")
347800201023                  SET lb_BackdatedBuyContractNo TO TRUE
347900201023                  IF CONTRACT-STATUS OF ACCOUNT-CONTRACT IS EQUAL "O"
348000201023                     SET lb_BackdatedBuyContractYes TO TRUE
348100201023                     MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT TO
348200201023                                     pi_STRSMD_AccountNo
348300201023                     MOVE CONTRACT-XREF OF ACCOUNT-CONTRACT TO
348400201023                                      pc_STRSMD_ContractXref
348500201023                  END-IF
348600201023      *RFS1104392 - End
348700200420      * RFS 32873 Start.
348800200420      * RFS121057 Begins
34890020042032873 *      IF (lb_EditCode1ACCONSetupYes and
349000200420             IF (lc_Seg_Contract_rule = lncc_2  and
349100200420      * RFS121057 Ends
349200200420def19           investment-series of investment-seg = spaces
34930020042056471           )
34940020042056471          OR (lb_SPIAInvestYes AND pc_AllowMultipleContracts= "N")
349500200420108944*        OR CONTRACT-STATUS OF ACCOUNT-CONTRACT IS NOT EQUAL "A"
349600200420139286        OR (lb_POANInvestYes AND pc_PoanAllowMultiContracts = "N")
349700200420108944         OR (CONTRACT-STATUS OF ACCOUNT-CONTRACT IS NOT EQUAL "A"
349800200420139287*        AND TRANS-ORIGIN-CODE OF TRANS IS NOT EQUAL "MAT")
349900200420139287         AND TRANS-ORIGIN-CODE OF TRANS IS NOT EQUAL "MAT"
350000200420139287         AND TRANS-TYPE-CODE OF TRANS IS NOT EQUAL "BAJ" AND
350100200420139287             TRANS-TYPE-CODE OF TRANS IS NOT EQUAL "SAJ")
35020020042032873           MOVE "04" TO Rejection-Code OF Trans
35030020042032873           GO TO FSCM-EXIT
35040020042032873        END-IF
350500200420      * RFS 32873 End.
350600200420      *RFS19738 Begin
350700200420             IF CONTRACT-STATUS OF ACCOUNT-CONTRACT IS EQUAL "C"
350800200420                 GO TO FSCM-EXIT
350900200420             END-IF
351000200420      *RFS19738 End
351100200420      *RFS19058 Begin
351200200420      *      GO TO FSCM-EXIT
351300200420      * rfs 127383 - begin
351400200420             IF START-DATE OF ACCOUNT-CONTRACT = 0
351500200420              MOVE TRADE-DATE OF TRANS TO LI-CON-START-DATE
351600200420             ELSE
351700200420              MOVE START-DATE OF ACCOUNT-CONTRACT
351800200420                TO LI-CON-START-DATE
351900200420             END-IF
352000200420      * rfs 127383 - end
352100200420             MOVE "N" TO WS-CONTRACT-RECENTLY-OPEN-FLAG
352200200420             MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT
352300200420             TO WS-AC-ACCOUNT-NO
352400200420             MOVE CONTRACT-NO OF ACCOUNT-CONTRACT
352500200420             TO WS-AC-CONTRACT-NO
352600200420127383*      MOVE START-DATE  OF ACCOUNT-CONTRACT
352700200420127383       MOVE LI-CON-START-DATE
352800200420             TO WS-AC-START-DATE
352900200420             MOVE CONTRACT-STATUS OF ACCOUNT-CONTRACT
353000200420             TO WS-AC-CONTRACT-STATUS
353100200420      *1001156 START
353200200420             MOVE INVESTMENT-SERIES OF ACCOUNT-CONTRACT
353300200420               TO WS-LOC-Investment-Series
353400200420      *1001156 END
353500200420             PERFORM CHECK-IF-CON-RECENTLY-OPEN
353600200420             IF CONTRACT-RECENTLY-OPEN
353700200420                 CONTINUE
353800200420             ELSE
353900200420132676         IF ((pc_CContractMatch NOT = " "))
354000200420132676          GO TO FSCM-0090
354100200420132676         END-IF
354200200420               GO TO FSCM-EXIT
354300200420             END-IF
354400200420      *RFS19058 End
354500200420           END-IF.
354600200420
354700200420           IF (NOMINEE OF ACCOUNT = "Y" AND
354800200420               ACCOUNT-DESIGNATION OF NOMINEE-FILE NOT = "2")
354900200420             GO TO FSCM-0025
355000200420           END-IF.
355100200420
355200200420      * RFS147673 - Begin
355300200420           IF WS-SAME-DAY-FLAG = 'Y'
355400200420174657*        GO TO FSCM-0010
355500200420174657         GO TO FSCM-0025
355600200420           END-IF.
355700200420      * RFS147673 - End
355800200420      * RFS121437 - Begins - Comment and re-write
355900200420      ** RFS 37754 - begin
356000200420R81876** RFS 81876 - begin (uncommented the below code commented for
356100200420 |    *              RFS 71769)
356200200420 |    ** RFS 71769 - begin
356300200420 |    *     IF SPEC-MOD-AUTH-SEGSYSMAT-ON AND
356400200420 |    *        PURCHASE-TRANSACTION       AND
356500200420 |    *        lnc_OrigCodeMat            AND
356600200420 |    *        COMM-RATE OF TRANS-COMMISSION = 0
356700200420 |    *        GO TO FSCM-0008
356800200420 |    *     END-IF.
356900200420 |    ** RFS 71769 - end
357000200420R81876** RFS 81876 - end
357100200420      ** RFS 37754 - end
357200200420
357300200420      *RFS 7947 BEGIN
357400200420      * Check if dealer has seg. license authorization,
357500200420      * including dealer nominee registered.
357600200420
357700200420      *    IF WS-EDIT-SEG-CONTR-PROV = "Y"
357800200420      *      MOVE DEALER-CODE  OF TRANS
357900200420      *                        TO DEALER-CODE OF DEALER-PROV-LICENSE
358000200420      *      MOVE CONTRACT-PROV OF ACCOUNT-CONTRACT
358100200420      *                        TO PROVINCE-CODE
358200200420      *                        OF DEALER-PROV-LICENSE
358300200420      *
358400200420      *      READ DEALER-PROV-LICENSE
358500200420      *      INVALID KEY
358600200420      *RFS 9365 BEGIN
358700200420      *        INITIALIZE MFADELPLP OF DEALER-PROV-LICENSE
358800200420      *RFS 9365 END
358900200420      *      END-READ
359000200420      *
359100200420      *      IF EXPIRY-DATE OF DEALER-PROV-LICENSE <=
359200200420      *         TRADE-DATE OF TRANS
359300200420      *RFS 9092 BEGIN
359400200420      *        IF WS-EDIT-SEG-JURISDICTION = "Y"
359500200420      *          PERFORM CHECK-SAME-JURISDICTION
359600200420      *          IF WS-SAME-JURISDICTION-FOUND = "Y"
359700200420      *            GO TO FSCM-0008
359800200420      *          END-IF
359900200420      *        END-IF
360000200420      *RFS 9092 END
360100200420      *        MOVE "58"       TO REJECTION-CODE OF TRANS
360200200420      *        GO TO FSCM-EXIT
360300200420      *      END-IF
360400200420      *    END-IF.
360500200420      *RFS 7947 END
360600200420      * RFS121437 - Continues - Re-write
360700200420            IF SPEC-MOD-AUTH-SEGSYSMAT-ON AND
360800200420               PURCHASE-TRANSACTION       AND
360900200420               lnc_OrigCodeMat            AND
361000200420               COMM-RATE OF TRANS-COMMISSION = 0
361100200420               CONTINUE
361200200420            ELSE
361300200420               MOVE DEALER-CODE  OF TRANS
361400200420                 TO Lc_ValidateDealer
361500200420               MOVE SPACES
361600200420                 TO Lc_ValidateDealerRep
361700200420               MOVE CONTRACT-PROV OF ACCOUNT-CONTRACT
361800200420                 TO Lc_ValidateProvince
361900200420               PERFORM VALIDATE-DEALER-LICENSE
362000200420            END-IF.
362100200420            IF REJECTION-CODE OF TRANS = "58"
362200200420               GO TO FSCM-EXIT
362300200420            END-IF.
362400200420      * RFS121437 - Ends
362500200420
362600200420       FSCM-0008.
362700200420
362800200420      * RFS121437 - Begins - Comment existing
362900200420      *    IF WS-BLANKET-INSURANCE-LICENSE = "Y"
363000200420      *      GO TO FSCM-0025
363100200420      *    END-IF.
363200200420      *
363300200420      * Check if dealer rep has seg. license authorization,
363400200420      * including dealer nominee registered.
363500200420
363600200420      *    MOVE DEALER-CODE  OF TRANS
363700200420      *                      TO DEALER-CODE OF DEALER-REP-PROV-LICENSE.
363800200420      *    MOVE DEALER-REP-CODE  OF TRANS
363900200420      *                      TO DEALER-REP-CODE
364000200420      *                      OF DEALER-REP-PROV-LICENSE.
364100200420      *    MOVE CONTRACT-PROV OF ACCOUNT-CONTRACT
364200200420      *                      TO PROVINCE-CODE
364300200420      *                      OF DEALER-REP-PROV-LICENSE.
364400200420      *
364500200420      *    READ DEALER-REP-PROV-LICENSE
364600200420      *    INVALID KEY
364700200420LYD   *RFS 9365 BEGIN
364800200420      *        INITIALIZE MFADERPLP OF DEALER-REP-PROV-LICENSE
364900200420LYD   *RFS 9365 END
365000200420LYD   *      MOVE "58"       TO REJECTION-CODE OF TRANS
365100200420LYD   *      GO TO FSCM-EXIT
365200200420      *    END-READ.
365300200420
365400200420      *    IF EXPIRY-DATE OF DEALER-REP-PROV-LICENSE <=
365500200420      *       TRADE-DATE OF TRANS
365600200420      *RFS 9092 BEGIN
365700200420      *        IF WS-EDIT-SEG-JURISDICTION = "Y"
365800200420      *          PERFORM CHECK-SAME-JURISDICTION
365900200420      *          IF WS-SAME-JURISDICTION-FOUND = "Y"
366000200420      *            GO TO FSCM-0025
366100200420      *          END-IF
366200200420      *        END-IF
366300200420      *RFS 9092 END
366400200420      * RFS35075 - Begin: do not reject if license expired
366500200420      *      IF lnc_EditCodeREPLICSetupYes
366600200420      *         AND lnc_origCodesForREPLIC
366700200420      *         AND PURCHASE-TRANSACTION
366800200420      *        GO TO FSCM-0025
366900200420      *      ELSE
367000200420      * RFS35075 - End
367100200420      *        MOVE "58"       TO REJECTION-CODE OF TRANS
367200200420      *        GO TO FSCM-EXIT
367300200420      * RFS35075 - Begin
367400200420      *      END-IF
367500200420      * RFS35075 - End
367600200420      *    END-IF.
367700200420      * RFS 121437 - Begins - New activity
367800200420           MOVE DEALER-CODE  OF TRANS
367900200420                             TO Lc_ValidateDealer.
368000200420           MOVE DEALER-REP-CODE  OF TRANS
368100200420                             TO Lc_ValidateDealerRep.
368200200420           MOVE CONTRACT-PROV OF ACCOUNT-CONTRACT
368300200420                             TO Lc_ValidateProvince.
368400200420           PERFORM VALIDATE-DEALER-REP-LICENSE.
368500200420           IF REJECTION-CODE OF TRANS = "58"
368600200420              GO TO FSCM-EXIT
368700200420           END-IF.
368800200420      * RFS 121437 - Ends
368900200420
369000200420           GO TO FSCM-0025.
369100200420
369200200420       FSCM-0010.
369300200420
369400200420           MOVE ACCOUNT-NO OF TRANS
369500200420                             TO ACCOUNT-NO OF ACCOUNT-CONT-AGE
369600200420           MOVE ZEROES       TO START-DATE  OF ACCOUNT-CONT-AGE.
369700200420
369800200420           START ACCOUNT-CONT-AGE
369900200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
370000200420           INVALID KEY
370100200420      * RFS 32873 Start.
37020020042055136 *      IF lb_EditCode1ACCONSetupYes
37030020042032873           PERFORM Check-WO-Trans-In-Same-Acct
37040020042055136 *      END-IF
370500200420      * RFS 32873 End.
370600200420             GO TO FSCM-EXIT
370700200420           END-START.
370800200420
370900200420
371000200420       FSCM-0015.
371100200420
371200200420           READ ACCOUNT-CONT-AGE NEXT RECORD
371300200420           AT END
371400200420      * RFS 32873 Start.
37150020042055136 *      IF lb_EditCode1ACCONSetupYes
37160020042032873           PERFORM Check-WO-Trans-In-Same-Acct
37170020042055136 *      END-IF
371800200420      * RFS 32873 End.
371900200420             GO TO FSCM-EXIT
372000200420           END-READ.
372100200420
372200200420       FSCM-0018.
372300200420
372400200420           IF ACCOUNT-NO OF ACCOUNT-CONT-AGE IS NOT EQUAL
372500200420           ACCOUNT-NO OF TRANS
372600200420      * RFS 32873 Start.
37270020042055136 *      IF lb_EditCode1ACCONSetupYes
37280020042032873           PERFORM Check-WO-Trans-In-Same-Acct
37290020042055136 *      END-IF
373000200420      * RFS 32873 End.
373100200420             GO TO FSCM-EXIT
373200200420           END-IF.
373300200829      *RFS185176 Start
373400200829           IF lb_AccountLevelGLWBYes AND
373500200829              ENTERED-BY OF TRANS = "SEGCOGRST" AND
373600200908              START-DATE OF ACCOUNT-CONT-AGE < TRADE-DATE OF TRANS
373700200829              MOVE "N" TO WS-CONTRACT-MATCH
373800200908              GO TO FSCM-0015
373900200829           END-IF
374000200829      *RFS185176 End
374100200420
374200200420      *RFS 162813 Begin
374300200420             IF CONTRACT-STATUS OF ACCOUNT-CONT-AGE IS EQUAL "C"
374400200420                     GO TO FSCM-0015
374500200420             END-IF
374600200420      *RFS 162813 End
374700200420           IF CONTRACT-STATUS OF ACCOUNT-CONT-AGE IS NOT EQUAL "O"
374800201023      *RFS1104392 - Start
374900201023              OR (lb_AccountLevelGLWBYes AND
375000201023              CONTRACT-STATUS OF ACCOUNT-CONT-AGE IS EQUAL "O" AND
375100201023              CREATION-DATE OF ACCOUNT-CONT-AGE = PASS-PROCESS-DATE-9
375200201023              AND START-DATE OF ACCOUNT-CONT-AGE < PASS-PROCESS-DATE-9
375300201023              AND TRANS-TYPE-CODE OF TRANS IS EQUAL "BUY")
375400201023                SET lb_BackdatedBuyContractNo TO TRUE
375500201023                IF CONTRACT-STATUS OF ACCOUNT-CONT-AGE IS EQUAL "O"
375600201023                   SET lb_BackdatedBuyContractYes TO TRUE
375700201023                   MOVE ACCOUNT-NO OF ACCOUNT-CONT-AGE TO
375800201023                                      pi_STRSMD_AccountNo
375900201023                   MOVE CONTRACT-XREF OF ACCOUNT-CONT-AGE TO
376000201023                                      pc_STRSMD_ContractXref
376100201025                END-IF
376200201023      *RFS1104392 - End
376300200420      * RFS 32873 Start.
376400200420      * RFS121057 Begins
37650020042032873 *      IF (lb_EditCode1ACCONSetupYes and
376600200420             IF (lc_Seg_Contract_rule = lncc_2 and
376700200420      * RFS121057 Ends
376800200420def19           investment-series of investment-seg = spaces
37690020042056471           )
37700020042056471          OR (lb_SPIAInvestYes AND pc_AllowMultipleContracts= "N")
377100200420139286        OR (lb_POANInvestYes AND pc_PoanAllowMultiContracts = "N")
37720020042032873           MOVE "04" TO Rejection-Code OF Trans
37730020042032873           GO TO FSCM-EXIT
37740020042032873        END-IF
377500200420      * RFS 32873 End.
377600200420      *RFS19738 Begin
377700200420             IF CONTRACT-STATUS OF ACCOUNT-CONT-AGE IS EQUAL "C"
377800200420                 IF WS-EDIT-SPECIFIC-CONTRACT IS NOT EQUAL "Y"
377900200420                     GO TO FSCM-0015
378000200420                 ELSE
378100200420                     GO TO FSCM-EXIT
378200200420                 END-IF
378300200420             END-IF
378400200420      *RFS19738 End
378500200420      *RFS19058 Begin
378600200420      *      IF WS-EDIT-SPECIFIC-CONTRACT IS NOT EQUAL "Y"
378700200420      *        GO TO FSCM-0015
378800200420      *      ELSE
378900200420      *        GO TO FSCM-EXIT
379000200420      *      END-IF
379100200420      * rfs 127383 - begin
379200200420             IF START-DATE OF ACCOUNT-CONT-AGE = 0
379300200420              MOVE TRADE-DATE OF TRANS TO LI-CON-START-DATE
379400200420             ELSE
379500200420              MOVE START-DATE OF ACCOUNT-CONT-AGE
379600200420                TO LI-CON-START-DATE
379700200420             END-IF
379800200420      * rfs 127383 - end
379900200420             MOVE "N" TO WS-CONTRACT-RECENTLY-OPEN-FLAG
380000200420             MOVE ACCOUNT-NO OF ACCOUNT-CONT-AGE
380100200420             TO WS-AC-ACCOUNT-NO
380200200420             MOVE CONTRACT-NO OF ACCOUNT-CONT-AGE
380300200420             TO WS-AC-CONTRACT-NO
380400200420127383*      MOVE START-DATE  OF ACCOUNT-CONT-AGE
380500200420127383       MOVE LI-CON-START-DATE
380600200420             TO WS-AC-START-DATE
380700200420             MOVE CONTRACT-STATUS OF ACCOUNT-CONT-AGE
380800200420             TO WS-AC-CONTRACT-STATUS
380900200420      *1001156 START
381000200420             MOVE INVESTMENT-SERIES OF ACCOUNT-CONT-AGE
381100200420               TO WS-LOC-Investment-Series
381200200420      *1001156 END
381300200420             PERFORM CHECK-IF-CON-RECENTLY-OPEN
381400200420             IF CONTRACT-RECENTLY-OPEN
381500200420                 CONTINUE
381600200420             ELSE
381700200420                 IF WS-EDIT-SPECIFIC-CONTRACT IS NOT EQUAL "Y"
381800200420                   GO TO FSCM-0015
381900200420                 ELSE
382000200420                   GO TO FSCM-EXIT
382100200420                 END-IF
382200200420             END-IF
382300200420      *RFS19058 End
382400200420           END-IF.
382500200420
382600200420           MOVE ACCOUNT-CONT-AGE-REC
382700200420                             TO ACCOUNT-CONTRACT-REC.
382800200420
382900200420           READ ACCOUNT-CONTRACT WITH NO LOCK
383000200420           INVALID KEY
383100200420             MOVE PROVINCE-CODE OF INVESTOR
383200200420                             TO CONTRACT-PROV OF ACCOUNT-CONTRACT
383300200420           END-READ.
383400200420      * rfs 127383 - begin
383500200420           IF START-DATE OF ACCOUNT-CONTRACT = 0
383600200420              MOVE TRADE-DATE OF TRANS TO LI-CON-START-DATE
383700200420           ELSE
383800200420              MOVE START-DATE OF ACCOUNT-CONTRACT
383900200420                TO LI-CON-START-DATE
384000200420           END-IF.
384100200420      * rfs 127383 - end
384200200420
384300200420           IF (NOMINEE OF ACCOUNT = "Y" AND
384400200420               ACCOUNT-DESIGNATION OF NOMINEE-FILE NOT = "2")
384500200420             GO TO FSCM-0025
384600200420           END-IF.
384700200420
384800200420      * RFS 174657 - Start
384900200420           IF WS-SAME-DAY-FLAG = 'Y'
385000200420              GO TO FSCM-0025
385100200420           END-IF
385200200420      * RFS 174657 - End
385300200420
385400200420      * Check if dealer has seg. license authorization,
385500200420      * including dealer nominee registered.
385600200420
385700200420      *RFS 7947 BEGIN
385800200420           IF WS-EDIT-SEG-CONTR-PROV = "Y"
385900200420             MOVE DEALER-CODE  OF TRANS
386000200420                               TO DEALER-CODE OF DEALER-PROV-LICENSE
386100200420             MOVE CONTRACT-PROV OF ACCOUNT-CONTRACT
386200200420                               TO PROVINCE-CODE
386300200420                               OF DEALER-PROV-LICENSE
386400200420
386500200420             READ DEALER-PROV-LICENSE
386600200420             INVALID KEY
386700200420      *RFS 14738 - BEGIN
386800200420                       INITIALIZE MFADELPLP OF DEALER-PROV-LICENSE
386900200420      *                GO TO FSCM-0050
387000200420      *RFS 14738 - END
387100200420             END-READ
387200200420
387300200420             IF EXPIRY-DATE OF DEALER-PROV-LICENSE <=
387400200420                TRADE-DATE OF TRANS
387500200420      *RFS 9092 BEGIN
387600200420               IF WS-EDIT-SEG-JURISDICTION = "Y"
387700200420                 PERFORM CHECK-SAME-JURISDICTION
387800200420                 IF WS-SAME-JURISDICTION-FOUND = "Y"
387900200420                   GO TO FSCM-0019
388000200420                 END-IF
388100200420               END-IF
388200200420      *RFS 9092 END
388300200420               GO TO FSCM-0050
388400200420             END-IF
388500200420           END-IF.
388600200420      *RFS 7947 END
388700200420
388800200420       FSCM-0019.
388900200420           IF WS-BLANKET-INSURANCE-LICENSE = "Y"
389000200420             GO TO FSCM-0025
389100200420           END-IF.
389200200420
389300200420      * Test if dealer rep has seg. license authorization,
389400200420      * including dealer nominee registered.
389500200420
389600200420           MOVE DEALER-CODE  OF TRANS
389700200420                             TO DEALER-CODE OF DEALER-REP-PROV-LICENSE.
389800200420           MOVE DEALER-REP-CODE  OF TRANS
389900200420                             TO DEALER-REP-CODE
390000200420                             OF DEALER-REP-PROV-LICENSE.
390100200420           MOVE CONTRACT-PROV OF ACCOUNT-CONTRACT
390200200420                             TO PROVINCE-CODE
390300200420                             OF DEALER-REP-PROV-LICENSE.
390400200420
390500200420           READ DEALER-REP-PROV-LICENSE
390600200420           INVALID KEY
390700200420      *RFS 14738 BEGIN
390800200420                   INITIALIZE MFADERPLP OF DEALER-REP-PROV-LICENSE
390900200420      *            GO TO FSCM-0050
391000200420      *RFS 14738 END
391100200420           END-READ.
391200200420
391300200420           IF EXPIRY-DATE OF DEALER-REP-PROV-LICENSE <=
391400200420              TRADE-DATE OF TRANS
391500200420      *RFS 9092 BEGIN
391600200420               IF WS-EDIT-SEG-JURISDICTION = "Y"
391700200420                 PERFORM CHECK-SAME-JURISDICTION
391800200420                 IF WS-SAME-JURISDICTION-FOUND = "Y"
391900200420                   GO TO FSCM-0025
392000200420                 END-IF
392100200420               END-IF
392200200420      *RFS 9092 END
392300200420      * RFS42621 - Begin: do not create new contract if REPLIC is active
392400200420      * (may be new contract will be created but not because of expired
392500200420      *  license)
392600200420               IF lnc_EditCodeREPLICSetupYes
392700200420                 AND lnc_origCodesForREPLIC
392800200420                 AND PURCHASE-TRANSACTION
392900200420                 GO TO FSCM-0025
393000200420               END-IF
393100200420      * RFS42621 - End
393200200420             GO TO FSCM-0050
393300200420           END-IF.
393400200420
393500200420
393600200420       FSCM-0025.
393700200420
393800200420           MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT
393900200420                             TO ACCOUNT-NO
394000200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
394100200420           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT
394200200420                             TO CONTRACT-NO
394300200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
394400200420           MOVE LOW-VALUES   TO INVESTMENT-CODE
394500200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
394600200420
394700200420           START ACCOUNT-CONTRACT-INVESTMENT
394800200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
394900200420           INVALID KEY
395000200420             MOVE "Y"        TO WS-CONTRACT-IS-EMPTY
395100200420             GO TO FSCM-0050
395200200420           END-START.
395300200420
395400200420           READ ACCOUNT-CONTRACT-INVESTMENT NEXT RECORD
395500200420           WITH NO LOCK
395600200420           AT END
395700200420             MOVE "Y"        TO WS-CONTRACT-IS-EMPTY
395800200420             GO TO FSCM-0050
395900200420           END-READ.
396000200420
396100200420           IF (ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
396200200420           IS NOT EQUAL ACCOUNT-NO OF ACCOUNT-CONTRACT) OR
396300200420           (CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
396400200420           IS NOT EQUAL CONTRACT-NO OF ACCOUNT-CONTRACT)
396500200420             MOVE "Y"        TO WS-CONTRACT-IS-EMPTY
396600200420             GO TO FSCM-0050
396700200420           END-IF.
396800200420
396900210127      *RFS186198 START
397000210127           IF Lb_AccountLevelGlwbYes
397100210127              INITIALIZE lc_FXSETPOL_Parms,
397200210127                         lc_InvStrucCodeOfFirstContInv
397300210127              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
397400210127                TO lc_FXSETPOL_InvCode
397500210127              PERFORM GET-SETPOL-STRUCTURE
397600210127              MOVE lc_FXSETPOL_InvStrucCode
397700210127                TO lc_InvStrucCodeOfFirstContInv
397800210127           END-IF.
397900210127      *RFS186198 END
398000200420      * Get Investment Seg Info
398100200420
398200200420           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
398300200420                             TO INVESTMENT-CODE OF INVESTMENT-SEG.
398400200420
398500200420           READ INVESTMENT-SEG
398600200420           INVALID KEY
398700200420             GO TO FSCM-0050
398800200420           END-READ.
398900200426      *RFS185170 - Start
399000200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
399100200426                                   lb_AccountLevelGLWBYes
399200200426              MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
399300200426                TO pi_ACCGLWBD_AccNo
399400200426              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
399500200426                TO pc_ACCGLWBD_InvCode
399600200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
399700200426              PERFORM GetAccGLWBDetails
399800200426              IF pc_ACCGLWBD_Series NOT = SPACES
399900200426                 MOVE pc_ACCGLWBD_Series
400000200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
400100200426              END-IF
400200200426           END-IF.
400300200420      *RFS185170 - End
400400200420
400500200420      * Calculate deposit length
400600200420
400700200420
400800200420           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
400900200420                               TO INVESTMENT-CODE
401000200420                               OF DEPOSIT-MAT-LEN-SCHED.
401100200420           MOVE ZEROES
401200200420                               TO START-DATE
401300200420                               OF DEPOSIT-MAT-LEN-SCHED.
401400200420           MOVE ZEROES         TO END-DATE
401500200420                               OF DEPOSIT-MAT-LEN-SCHED.
401600200420
401700200420           START DEPOSIT-MAT-LEN-SCHED
401800200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
401900200420           INVALID KEY
402000200420             GO TO FSCM-0050
402100200420           END-START.
402200200420
402300200420       FSCM-0035.
402400200420
402500200420      * rfs 127383 - begin
402600200420           IF START-DATE OF ACCOUNT-CONTRACT = 0
402700200420              MOVE TRADE-DATE OF TRANS TO LI-CON-START-DATE
402800200420           ELSE
402900200420              MOVE START-DATE OF ACCOUNT-CONTRACT
403000200420                TO LI-CON-START-DATE
403100200420           END-IF.
403200200420      * rfs 127383 - end
403300200420
403400200420           READ DEPOSIT-MAT-LEN-SCHED NEXT RECORD
403500200420           AT END
403600200420             GO TO FSCM-0050
403700200420           END-READ.
403800200420
403900200420           IF INVESTMENT-CODE OF DEPOSIT-MAT-LEN-SCHED
404000200420           IS NOT EQUAL INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
404100200420             GO TO FSCM-0050
404200200420           END-IF.
404300200420
404400200420           IF (START-DATE OF DEPOSIT-MAT-LEN-SCHED IS GREATER THAN
404500200420127383*    START-DATE OF ACCOUNT-CONTRACT)   OR
404600200420127383     LI-CON-START-DATE) OR
404700200420              (END-DATE OF DEPOSIT-MAT-LEN-SCHED IS LESS THAN
404800200420127383*    START-DATE OF ACCOUNT-CONTRACT)
404900200420127383     LI-CON-START-DATE)
405000200420             GO TO FSCM-0035
405100200420           END-IF.
405200200420
405300200420      *RFS135486 Start
405400200420           INITIALIZE  ln_AccountNum,
405500200420                       ln_ContractNum,
405600200420                       ld_StartDate,
405700200420                       li_TransTradeDate,
405800200420                       lc_GuarDthSchedCode,
405900200420                       lc_GuarMatSchedCode,
406000200420                       lc_DepositMaturityRule,
406100200420                       ln_DepositLength.
406200200420
406300200420           MOVE DEPOSIT-MATURITY-RULE OF DEPOSIT-MAT-LEN-SCHED
406400200420                                        TO lc_DepositMaturityRule.
406500200420           MOVE DEPOSIT-LENGTH        OF DEPOSIT-MAT-LEN-SCHED
406600200420                                        TO ln_DepositLength.
406700200420           IF lc_DepositMaturityRule = lnc_2
406800200420              MOVE lnc_N TO lc_NewContract
406900200420              MOVE START-DATE OF ACCOUNT-CONTRACT TO ld_StartDate
407000200420              MOVE GUAR-MAT-SCHED-CODE OF INVESTMENT-SEG
407100200420                                        TO lc_GuarMatSchedCode
407200200420              MOVE GUAR-DEATH-SCHED-CODE OF INVESTMENT-SEG
407300200420                                        TO lc_GuarDthSchedCode
407400200420              MOVE ACCOUNT-NO  OF ACCOUNT-CONTRACT
407500200420                                        TO ln_AccountNum
407600200420              MOVE CONTRACT-NO OF ACCOUNT-CONTRACT
407700200420                                        TO ln_ContractNum
407800200420              MOVE TRADE-DATE OF TRANS  TO li_TransTradeDate
407900200420
408000200420               IF DEPOSIT-MATURITY-DATE OF ACCOUNT-CONTRACT
408100200420                          IS EQUAL TO ZEROES
408200200420              AND CONTRACT-STATUS OF ACCOUNT-CONTRACT
408300200420                          IS EQUAL TO lnc_O
408400200420                 CALL "FXYRTOMAT"  USING ln_AccountNum,
408500200420                                         ln_ContractNum,
408600200420                                         li_AnnuitantAge,
408700200420                                         ld_StartDate,
408800200420                                         pi_DateOfBirth,
408900200420                                         li_TransTradeDate,
409000200420                                         lc_GuarMatSchedCode,
409100200420                                         lc_GuarDthSchedCode,
409200200420                                         lc_NewContract,
409300200420                                         lc_DepositMaturityRule,
409400200420                                         ln_DepositLength
409500200420                 IF lc_NewContract IS EQUAL TO lnc_Y
409600200420                    MOVE ZEROES TO
409700200420                               DEPOSIT-LENGTH OF DEPOSIT-MAT-LEN-SCHED
409800200420                 END-IF
409900200420               END-IF
410000200420           END-IF
410100200420      *RFS135486 End
410200200420------
410300200420      * Calculate contract staus schedule
410400200420
410500200420
410600200420           MOVE CONTRACT-STATUS-SCHED-CODE OF INVESTMENT-SEG
410700200420                               TO CONTRACT-STATUS-SCHED-CODE
410800200420                               OF CONTRACT-STATUS-SCHED.
410900200420           MOVE ZEROES
411000200420                               TO START-DATE
411100200420                               OF CONTRACT-STATUS-SCHED.
411200200420           MOVE ZEROES         TO END-DATE
411300200420                               OF CONTRACT-STATUS-SCHED.
411400200420
411500200420           START CONTRACT-STATUS-SCHED
411600200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
411700200420           INVALID KEY
411800200420             GO TO FSCM-0050
411900200420           END-START.
412000200420
412100200420       FSCM-0037.
412200200420
412300200420      * rfs 127383 - begin
412400200420           IF START-DATE OF ACCOUNT-CONTRACT = 0
412500200420              MOVE TRADE-DATE OF TRANS TO LI-CON-START-DATE
412600200420           ELSE
412700200420              MOVE START-DATE OF ACCOUNT-CONTRACT
412800200420                TO LI-CON-START-DATE
412900200420           END-IF.
413000200420      * rfs 127383 - end
413100200420
413200200420           READ CONTRACT-STATUS-SCHED NEXT RECORD
413300200420           AT END
413400200420             GO TO FSCM-0050
413500200420           END-READ.
413600200420
413700200420           IF CONTRACT-STATUS-SCHED-CODE OF CONTRACT-STATUS-SCHED
413800200420           IS NOT EQUAL CONTRACT-STATUS-SCHED-CODE OF INVESTMENT-SEG
413900200420             GO TO FSCM-0050
414000200420           END-IF.
414100200420
414200200420           IF (START-DATE OF CONTRACT-STATUS-SCHED IS GREATER THAN
414300200420127383*    START-DATE OF ACCOUNT-CONTRACT)   OR
414400200420127383     LI-CON-START-DATE) OR
414500200420              (END-DATE OF CONTRACT-STATUS-SCHED IS LESS THAN
414600200420127372*    START-DATE OF ACCOUNT-CONTRACT)
414700200420127383     LI-CON-START-DATE)
414800200420             GO TO FSCM-0037
414900200420           END-IF.
415000210605
415100200420------
415200200420       FSCM-0040.
415300200420      * Compare attribute compatability
415400200420
415500200420           IF RESET-TYPE-CODE OF INVESTMENT-SEG
415600200420           IS EQUAL TO WS-CMP-RESET-TYPE
415700200420           AND
415800200420           CONTRACT-STATUS-SCHED-CODE OF INVESTMENT-SEG
415900200420           IS EQUAL TO WS-CMP-CONTRACT-STATUS-SCHED
416000200420           AND
416100200420           MATURITY-ALLOW-DAYS OF INVESTMENT-SEG
416200200420           IS EQUAL TO WS-CMP-MATURITY-ALLOW-DAYS
416300200420      * RFS 7924 - BEGIN
416400200420           AND
416500200420           RESET-SCHEDULE-CODE OF INVESTMENT-SEG
416600200420           IS EQUAL TO WS-CMP-RESET-SCHEDULE-CODE
416700200420      * RFS 7924 - END
41680020042057388      AND gdv-sched-code of Investment-seg
41690020042057388      IS EQUAL TO Ws-cmp-gdv-sched-code
417000200420           AND
417100200420           DEPOSIT-LENGTH OF DEPOSIT-MAT-LEN-SCHED
417200200420           IS EQUAL TO WS-CMP-DEPOSIT-LEN
417300210707           AND
41740020042095850      GBV-Gross-Net OF DEPOSIT-MAT-LEN-SCHED
41750020042095850      =                Ws-Cmp-GBVGrossNet
41760020042095850      AND
417700200420           (CONTRACT-AGE OF CONTRACT-STATUS-SCHED IS NOT EQUAL 0)
41780020042055136      AND
41790020042055136      Investment-Series OF INVESTMENT-SEG
41800020042055136      IS EQUAL TO Ws-Cmp-Investment-Series
418100200420132676     AND (CONTRACT-STATUS OF ACCOUNT-CONTRACT = "O"
418200200420132676     OR  (CONTRACT-STATUS OF ACCOUNT-CONTRACT = "A"
418300210616      *RFS187317 Start
418400210615132676*    AND  pc_CContractMatch  = "Y"))
418500210615           AND  pc_CContractMatch  = "Y") OR
418600210615           (CONTRACT-STATUS OF ACCOUNT-CONTRACT = "A"
418700210615           AND pc_CContractMatch = " " AND
418800210615           lb_OneDayProductYes))
418900210616      *RFS187317 End
419000210608      *RFS186198 START
419100210127           AND
419200210605            ( Lb_AccountLevelGlwbNo OR
419300210127              ( Lb_AccountLevelGlwbYes AND
419400210127                ( lc_InvStrucCodeofTransInv =
419500210127                  lc_InvStrucCodeOfFirstContInv ) ) )
419600210127      *RFS186198 END
419700210616      *RFS187317 Start
419800210609            AND (lb_OneDayProductNo OR
419900210609                 (lb_OneDayProductYes AND TRADE-DATE OF TRANS =
420000210609                    (START-DATE OF ACCOUNT-CONTRACT)))
420100210616      *RFS187317 End
420200200420             MOVE "Y"        TO WS-CONTRACT-MATCH
42030020042044930        GO TO FSCM-0080
42040020042044930 *      GO TO FSCM-0090
420500200420      * RFS 32873 Start.
42060020042032873      ELSE
420700200420      *RFS121057 Begins
42080020042032873 *      IF (lb_EditCode1ACCONSetupYes and
42090020042032873        IF (lc_Seg_Contract_rule = lncc_2 and
421000200420      *RFS121057 Ends
421100200420def19           investment-series of investment-seg = spaces
42120020042056471           )
42130020042056471          OR (lb_SPIAInvestYes AND pc_AllowMultipleContracts= "N")
421400200420139286        OR (lb_POANInvestYes AND pc_PoanAllowMultiContracts = "N")
42150020042032873           MOVE "04" TO Rejection-Code OF Trans
42160020042032873           GO TO FSCM-EXIT
42170020042032873        END-IF
421800200420      * RFS 32873 End.
421900200420           END-IF.
422000200420
422100200420       FSCM-0050.
422200200420
422300200420           IF WS-CONTRACT-IS-EMPTY = "Y"
422400200420      * RFS 32873 Start.
42250020042055136 *      IF lb_EditCode1ACCONSetupYes
42260020042032873           PERFORM Check-WO-Trans-In-Same-Acct
42270020042032873           IF pncc_SegAttReturnCodeFail
42280020042032873              GO TO Fscm-Exit
42290021080632873           END-IF
42300020042055136 *      END-IF
423100200420      * RFS 32873 End.
423200200420      * RFS165202 - Start
423300200420             IF PURCHASE-TRANSACTION and lc_ModuleSEGPOANOn
423400200420
423500200420                 MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT TO
423600200420                     ACCOUNT-NO OF Account-Contract-SPIA
423700200420
423800200420                 MOVE CONTRACT-NO OF ACCOUNT-CONTRACT TO
423900200420                     CONTRACT-NO OF Account-Contract-SPIA
424000200420
424100200420                     READ Account-Contract-SPIA
424200200420                       INVALID KEY
424300200420                         CONTINUE
424400200420                       NOT INVALID KEY
424500200420                         CONTINUE
424600200420                     END-READ
424700200420             END-IF
424800200420      * RFS165202 - END
424900200420
425000200420      *RFS166267 - STARTS
425100200420           Initialize MFAINVSRP OF INVESTMENT-SERIESID-REC
425200200420           MOVE Investment-Code OF Trans TO
425300200420                            INVESTMENT-CODE OF INVESTMENT-SERIESID
425400200420           MOVE SPACES TO INVESTMENT-SERIES OF INVESTMENT-SERIESID
425500200420
425600200420           START INVESTMENT-SERIESID
425700200420             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
425800200420             INVALID KEY
425900200420168789        MOVE SPACES TO INVESTMENT-SERIES OF INVESTMENT-SERIESID
426000200420168789*             CONTINUE
426100200420              NOT INVALID KEY
426200200420                    CONTINUE
426300200420            END-START
426400200420
426500200420            READ INVESTMENT-SERIESID NEXT RECORD
426600200420            AT END
426700200420                  MOVE SPACES TO INVESTMENT-SERIES OF
426800200420            INVESTMENT-SERIESID
426900200420             NOT AT END
427000200420                  CONTINUE
427100200420            END-READ
427200200420      *RFS166267 - ENDS
427300200420168789        IF  Investment-Code OF Trans NOT =
427400200420168789            INVESTMENT-CODE OF INVESTMENT-SERIESID
427500200420168789        MOVE SPACES TO INVESTMENT-SERIES OF
427600200420168789                 INVESTMENT-SERIESID
427700200420168789        END-IF
427800200420
427900200420             MOVE "Y"      TO WS-CONTRACT-MATCH
42800020042055136        GO TO FSCM-0060
42810020042044930 *      GO TO FSCM-0080
42820020042044930 *      GO TO FSCM-0090
428300200420           END-IF.
428400210616      *RFS187317 Start
428500210616           IF lb_OneDayProductYes AND lb_ContractExistYes
428600210616              MOVE "Y"      TO WS-CONTRACT-MATCH
428700210616              GO TO FSCM-0060
428800210616           END-IF.
428900210616      *RFS187317 End
429000210616
429100200420           IF WS-EDIT-SPECIFIC-CONTRACT IS NOT EQUAL "Y"
429200200420             GO TO FSCM-0015
429300200420           ELSE
429400200420             GO TO FSCM-EXIT
429500200420           END-IF.
429600200420
42970020042055136  FSCM-0060.
429800200420139286     IF NOT lc_ModuleSEGPOANOn
429900200420  ¦        IF WS-CONTRACT-IS-EMPTY = "Y" AND
430000200420  ¦           Investment-Series OF INVESTMENT-SEG
430100200420  ¦           NOT = INVESTMENT-SERIES OF ACCOUNT-CONTRACT AND
430200200420  ¦           INVESTMENT-SERIES OF ACCOUNT-CONTRACT NOT = " "
430300200420  ¦           MOVE lncc_N TO WS-CONTRACT-MATCH
43040020042056318         MOVE lncc_N TO WS-CONTRACT-IS-EMPTY
43050020042056318         IF Ws-Edit-Specific-Contract NOT = lncc_Y
43060020042056318            GO TO FSCM-0015
43070021061656318         ELSE
43080020042056318            GO TO FSCM-EXIT
43090020042056318         END-IF
43100020042056318      END-IF
43110020042056318 *       GO TO FSCM-0080
431200200420      *RFS139286 -start
431300200420           ELSE
431400200420           IF WS-CONTRACT-IS-EMPTY = "Y" AND
431500200420166267      ((
431600200420              Investment-Series OF ACCOUNT-CONTRACT-SPIA
431700200420              NOT = INVESTMENT-SERIES OF ACCOUNT-CONTRACT AND
431800200420166267*       INVESTMENT-SERIES OF ACCOUNT-CONTRACT NOT = " "
431900200420166267        INVESTMENT-SERIES OF ACCOUNT-CONTRACT NOT = " " )
432000200420166267        OR (
432100200420166267        (INVESTMENT-SERIES OF INVESTMENT-SERIESID NOT = " "
432200200420166267        AND (INVESTMENT-SERIES OF INVESTMENT-SERIESID NOT =
432300200420166267             Investment-Series OF ACCOUNT-CONTRACT-SPIA) AND
432400200420168789         Investment-Series OF ACCOUNT-CONTRACT-SPIA NOT = " "
432500200420168789         )))
432600200420              MOVE lncc_N TO WS-CONTRACT-MATCH
432700200420              MOVE lncc_N TO WS-CONTRACT-IS-EMPTY
432800200420              IF Ws-Edit-Specific-Contract NOT = lncc_Y
432900200420                 GO TO FSCM-0015
433000200420              ELSE
433100200420                 GO TO FSCM-EXIT
433200200420              END-IF
433300200420           END-IF
433400200420      *RFS139286 -end
43350020042055136      END-IF.
433600200420
43370020042044930  FSCM-0080.
433800210806      *RFS187471 Starts
43390021080644930 *    IF lb_EditCodeTGDVSetupYes
434000210806           IF (lb_EditCodeTGDVSetupYes OR lb_DepTDDthPercentYes)
434100210806      *RFS187471 End
43420020042055525         and lc_GlwbInvestment not= "Y"
43430020042044930         SET lb_SameGDVPercentNo TO TRUE
43440020042044930         PERFORM CheckIfGDVPercentageIsSame
43450020042044930         IF lb_SameGDVPercentNo
43460020042044930            MOVE lncc_N TO WS-CONTRACT-MATCH
43470020042044930            IF Ws-Edit-Specific-Contract NOT = lncc_Y
43480020042044930               GO TO FSCM-0015
43490020042044930            ELSE
43500020042044930               GO TO FSCM-EXIT
43510020042044930            END-IF
43520020042044930         END-IF
435300200420      *RFS-START132676
435400200420              IF lb_SameGDVPercentYes
435500200420                GO TO FSCM-0090
435600200420              END-IF
435700200420      *RFS-END-132676
435800200706      *RFS184676 Starts
435900200706           ELSE
436000210806      *RFS187471 Starts
436100210806      *       IF lb_EditCodeTGDVSetupNo AND
436200210806              IF (lb_EditCodeTGDVSetupNo OR lb_DepTDDthPercentNo)
436300210806              AND
436400210806      *RFS187471 End
436500200706                 START-DATE OF ACCOUNT-CONTRACT > 0
436600200706                 PERFORM DEP-DTH-VAL-CHECK
436700200706              END-IF
436800200706      *RFS184676 Ends
43690020042044930      END-IF.
437000200420
437100200420       FSCM-0090.
437200200420
437300200420           IF WS-SAME-DAY-FLAG = 'Y'
437400200420               GO TO FSCM-0100
437500200420           END-IF.
437600200420
437700200420           MOVE ACCOUNT-CONTRACT-REC
437800200420                             TO WS-ACCOUNT-CONTRACT.
437900200420
438000200420           IF WS-CONTRACT-IS-EMPTY = "Y"
438100200420      * RFS 127383 -begin
438200200420      * RFS120691 - Begin
438300200420      *      IF START-DATE OF WS-ACCOUNT-CONTRACT = 0
438400200420      *      IF DEPOSIT-MATURITY-DATE OF WS-ACCOUNT-CONTRACT NOT = 0
438500200420126350*         AND TRANS-ORIGIN-CODE OF TRANS NOT = "RST"
438600200420126777*         AND TRANS-ORIGIN-CODE OF TRANS NOT = "MAT"
438700200420      *             MOVE 0 TO START-DATE OF WS-ACCOUNT-CONTRACT
438800200420      *      ELSE
438900200420      * RFS120691 - End
439000200420      *        MOVE TRADE-DATE OF TRANS
439100200420      *             TO START-DATE OF WS-ACCOUNT-CONTRACT
439200200420      *      END-IF
439300200420      *    END-IF.
439400200420           EVALUATE TRUE
439500200420              WHEN START-DATE OF WS-ACCOUNT-CONTRACT NOT = 0
439600200420               AND DEPOSIT-MATURITY-DATE OF WS-ACCOUNT-CONTRACT NOT = 0
439700200420                   CONTINUE
439800200420              WHEN START-DATE OF WS-ACCOUNT-CONTRACT     = 0
439900200420               AND DEPOSIT-MATURITY-DATE OF WS-ACCOUNT-CONTRACT NOT = 0
440000200420                AND TRANS-ORIGIN-CODE OF TRANS NOT = "RST"
440100200420                AND TRANS-ORIGIN-CODE OF TRANS NOT = "MAT"
440200200420                    CONTINUE
440300200420              WHEN OTHER
440400200420               MOVE TRADE-DATE OF TRANS
440500200420                    TO START-DATE OF WS-ACCOUNT-CONTRACT
440600200420           END-EVALUATE.
440700200420      * RFS 127383 -end
440800200420
440900200420           MOVE "R"          TO WRITE-ACCOUNT-CONTRACT.
441000200420
441100200420           MOVE ACCOUNT-NO OF TRANS
441200200420                             TO ACCOUNT-NO
441300200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
441400200420           MOVE INVESTMENT-CODE OF TRANS
441500200420                             TO INVESTMENT-CODE
441600200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
441700200420           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT
441800200420                             TO CONTRACT-NO
441900200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
442000200420
442100200420           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
442200200420           INVALID KEY
442300200420             INITIALIZE MFAACCCIP OF WS-ACCOUNT-CONTRACT-INVESTMENT
442400200420             MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT
442500200420                             TO ACCOUNT-NO
442600200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT
442700200420             MOVE INVESTMENT-CODE OF TRANS
442800200420                             TO INVESTMENT-CODE
442900200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT
443000200420             MOVE CONTRACT-NO OF ACCOUNT-CONTRACT
443100200420                             TO CONTRACT-NO
443200200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT
443300200420             MOVE PASS-PROCESS-DATE-9
443400200420                             TO CREATION-DATE
443500200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT
443600200420             MOVE "W"        TO WRITE-ACCOUNT-CONTRACT-INV
443700200420           NOT INVALID KEY
443800200420             MOVE ACCOUNT-CONTRACT-INVEST-REC
443900200420                             TO WS-ACCOUNT-CONTRACT-INVESTMENT
444000200420             MOVE "R"        TO WRITE-ACCOUNT-CONTRACT-INV
444100200420           END-READ.
444200200420
44430020042046707      MOVE Ws-Edit-Specific-Contract-Old
44440020042046707        TO Ws-Edit-Specific-Contract.
444500200420           IF WS-EDIT-SPECIFIC-CONTRACT IS EQUAL "Y"
444600200420             MOVE TRANS-CONTRACT-DETAILS-REC
444700200420                             TO WS-TRANS-CONTRACT-DETAILS
444800200420             MOVE "R"        TO WRITE-TRANS-CONTRACT
444900200420           ELSE
445000200420             INITIALIZE MFATRCODP OF WS-TRANS-CONTRACT-DETAILS
445100200420             MOVE PLACEMENT-DATE OF TRANS
445200200420                             TO PLACEMENT-DATE
445300200420                             OF WS-TRANS-CONTRACT-DETAILS
445400200420             MOVE TRANS-NO OF TRANS
445500200420                             TO TRANS-NO
445600200420                             OF WS-TRANS-CONTRACT-DETAILS
445700200420             MOVE CONTRACT-NO OF ACCOUNT-CONTRACT
445800200420                             TO CONTRACT-NO
445900200420                             OF WS-TRANS-CONTRACT-DETAILS
446000200420             MOVE "W"        TO WRITE-TRANS-CONTRACT
446100200420           END-IF.
446200200420
446300200420       FSCM-0100.
446400200420
446500200420       FSCM-EXIT.
446600200420           EXIT.
446700200420      *RFS 19058 Begin - Trades don't allow contracts active after TD.
446800200420      /
446900200420       CHECK-IF-CON-RECENTLY-OPEN SECTION.
447000200420       CCRO-0000.
447100200420
447200200420      *1001156 START - Preventing new Seg Contract creation for Annuity account
447300200420           IF lc_ModuleSEGPOANOn
447400200420             MOVE INVESTMENT-CODE OF TRANS TO
447500200420                  INVESTMENT-CODE OF INVESTMENT-SERIESID
447600200420             MOVE WS-LOC-Investment-Series TO
447700200420                  INVESTMENT-SERIES OF INVESTMENT-SERIESID
447800200420             READ INVESTMENT-SERIESID
447900200420             INVALID KEY
448000200420                  CONTINUE
448100200420             NOT INVALID KEY
448200200420                  MOVE "Y" TO WS-CONTRACT-RECENTLY-OPEN-FLAG
448300200420                  GO TO CCRO-EXIT
448400200420             END-READ
448500200420           END-IF.
448600200420      *1001156 END
448700200420
448800200420      * If the trade date of the purchase transaction falls within
448900200420      * the start date plus contract age threshold (Contract Age of
449000200420      * CONTRACT-STATUS-SCHED for 'open' contract status), we will set
449100200420      * the WS-CONTRACT-RECENTLY-OPEN-FLAG to "Y".
449200200420
449300200420      **** PRIME READ OF FIRST CONTRACT
449400200420
449500200420           INITIALIZE MFAACCCIP OF ACCOUNT-CONTRACT-INVEST2-REC.
449600200420
449700200420           MOVE WS-AC-ACCOUNT-NO
449800200420           TO   ACCOUNT-NO      OF ACCOUNT-CONTRACT-INVEST2-REC.
449900200420
450000200420           MOVE WS-AC-CONTRACT-NO
450100200420           TO   CONTRACT-NO     OF ACCOUNT-CONTRACT-INVEST2-REC.
450200200420
450300200420           MOVE SPACES
450400200420           TO   INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST2-REC.
450500200420
450600200420           START ACCOUNT-CONTRACT-INVESTMENT2
450700200420             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
450800200420             INVALID KEY
450900200420             GO TO CCRO-EXIT.
451000200420
451100200420           READ ACCOUNT-CONTRACT-INVESTMENT2 NEXT RECORD
451200200420             AT END
451300200420             GO TO CCRO-EXIT
451400200420           END-READ.
451500200420
451600200420           IF ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST2-REC NOT EQUAL
451700200420              WS-AC-ACCOUNT-NO OR
451800200420              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST2-REC NOT EQUAL
451900200420              WS-AC-CONTRACT-NO
452000200420                  GO TO CCRO-EXIT
452100200420           END-IF.
452200200420
452300200420      * Now we need to get the INVESTMENT-SEG-record in order
452400200420      * to get the CONTRACT-STATUS-SCHED-CODE.
452500200420
452600200420           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST2-REC
452700200420           TO   INVESTMENT-CODE OF INVESTMENT-SEG.
452800200420
452900200420           READ INVESTMENT-SEG
453000200420           INVALID KEY
453100200420               GO TO CCRO-EXIT
453200200420           END-READ.
453300200420      *RFS185170 - Begin
453400200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
453500200426                                   lb_AccountLevelGLWBYes
453600200426              MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST2-REC
453700200426                TO pi_ACCGLWBD_AccNo
453800200426              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST2-REC
453900200426                TO pc_ACCGLWBD_InvCode
454000200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
454100200426              PERFORM GetAccGLWBDetails
454200200426              IF pc_ACCGLWBD_Series NOT = SPACES
454300200426                 MOVE pc_ACCGLWBD_Series
454400200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
454500200426              END-IF
454600200426           END-IF.
454700200420      *RFS185170 - End
454800200420
454900200420      * Now we need the CONTRACT-STATUS-SCHED record to get the
455000200420      * CONTRACT-AGE value.
455100200420
455200200420           MOVE CONTRACT-STATUS-SCHED-CODE OF INVESTMENT-SEG
455300200420           TO   CONTRACT-STATUS-SCHED-CODE OF CONTRACT-STATUS-SCHED.
455400200420
455500200420           MOVE ZEROES TO START-DATE OF CONTRACT-STATUS-SCHED.
455600200420           MOVE ZEROES TO END-DATE   OF CONTRACT-STATUS-SCHED.
455700200420
455800200420           START CONTRACT-STATUS-SCHED
455900200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
456000200420           INVALID KEY
456100200420             GO TO CCRO-EXIT
456200200420           END-START.
456300200420
456400200420       CCRO-0010.
456500200420
456600200420           READ CONTRACT-STATUS-SCHED NEXT RECORD
456700200420           AT END
456800200420             GO TO CCRO-EXIT
456900200420           END-READ.
457000200420
457100200420           IF CONTRACT-STATUS-SCHED-CODE OF CONTRACT-STATUS-SCHED
457200200420           IS NOT EQUAL CONTRACT-STATUS-SCHED-CODE OF INVESTMENT-SEG
457300200420             GO TO CCRO-EXIT
457400200420           END-IF.
457500200420
457600200420           IF (START-DATE OF CONTRACT-STATUS-SCHED
457700200420               IS GREATER THAN WS-AC-START-DATE)            OR
457800200420              (END-DATE OF CONTRACT-STATUS-SCHED
457900200420               IS LESS THAN WS-AC-START-DATE)               OR
458000200420              (CONTRACT-STATUS OF CONTRACT-STATUS-SCHED
458100200420               IS NOT EQUAL "O")
458200200420               GO TO CCRO-0010
458300200420           END-IF.
458400200420
458500200420      * We will take the CONTRACT-AGE OF CONTRACT-STATUS-SCHED
458600200420      * (days) and add to the WS-AC-START-DATE, which will result
458700200420      * in the date this contract went "active" status.
458800200420
458900200420           INITIALIZE DR-G2J-PARMS.
459000210406      *RFS180708 - Start
459100210405           IF lb_BackdatedBuyContractYes AND lb_STRSMDYes
459200210405              MOVE WS-AC-START-DATE TO pd_STRSMD_PassedDate
459300210405              PERFORM GetSTRSMDDate
459400210405              MOVE pd_STRSMD_NewDate TO WS-AC-START-DATE
459500210405           END-IF.
459600210406      *RFS180708 - End
459700200420           MOVE WS-AC-START-DATE       TO  DGP-GREGORIAN.
459800200420           CALL    "DRG2J"          USING  DR-G2J-PARMS.
459900200420           CANCEL  "DRG2J".
460000200420           MOVE DGP-JULIAN             TO WS-JULIAN-TRADE-DATE.
460100200420
460200210605           MOVE    WS-JULIAN-TRADE-DATE
460300200420           TO      WS-AC-ACTIVE-DAYS.
460400200420
460500200420           COMPUTE WS-AC-ACTIVE-DAYS =
460600200420                   WS-AC-ACTIVE-DAYS +
460700200420      *RFS21175 Begin
460800200420                   CONTRACT-AGE OF CONTRACT-STATUS-SCHED - 1.
460900200420      *            CONTRACT-AGE OF CONTRACT-STATUS-SCHED.
461000200420      *RFS21175 End
461100200420
461200200420           INITIALIZE DR-J2G-PARMS.
461300200420           MOVE WS-AC-ACTIVE-DAYS TO  DJP-JULIAN.
461400200420           CALL    "DRJ2G"          USING  DR-J2G-PARMS.
461500200420           CANCEL  "DRJ2G".
461600200420           MOVE DJP-GREGORIAN          TO WS-AC-ACTIVE-DATE.
461700200420
46180020042096530      PERFORM  CHECK-GUAR-MAT-SCHED-CODE.
461900210616      *    IF (TRADE-DATE OF TRANS <= WS-AC-ACTIVE-DATE)
462000210616      *RFS187317 Start
462100210615           IF ((TRADE-DATE OF TRANS <= WS-AC-ACTIVE-DATE
462200210616                AND lb_OneDayProductNo) OR lb_OneDayProductYes)
462300210616      *RFS187317 End
462400200507      *RFS1021595 START
46250020050796530 *    AND Lc-Schcode-NO
462600200507           AND (Lc-Schcode-NO OR (TRANS-TYPE-CODE OF TRANS = "BUY" AND
462700200507               TRANS-ORIGIN-CODE OF TRANS = "MAT"))
462800200420      *RFS1021595 END
462900200420               MOVE "Y" TO WS-CONTRACT-RECENTLY-OPEN-FLAG
463000200420           END-IF.
463100200420
463200200420       CCRO-EXIT.
463300200420           EXIT.
463400200420
463500200420      *RFS 19058 End
463600200420      /
463700200420       CHECK-SAME-JURISDICTION SECTION.
463800200420
463900200420      *RFS 9092 BEGIN
464000200420
464100200420           MOVE "N"          TO WS-SAME-JURISDICTION-FOUND.
464200200420           IF WS-EDIT-SEG-JURISDICTION IS NOT EQUAL "Y"
464300200420             GO TO CSJ-EXIT
464400200420           END-IF.
464500200420           MOVE INVESTMENT-CODE OF TRANS
464600200420                             TO INVESTMENT-CODE
464700200420                             OF INVESTMENT-STRUCTURE-XREF.
464800200420           MOVE LOW-VALUES   TO INVESTMENT-STRUCTURE-CODE
464900200420                             OF INVESTMENT-STRUCTURE-XREF.
465000200420
465100200420           START INVESTMENT-STRUCTURE-XREF
465200200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
465300200420           INVALID KEY
465400200420             GO TO CSJ-EXIT
465500200420           END-START.
465600200420
465700200420       CSJ-0000.
465800200420
465900200420           READ INVESTMENT-STRUCTURE-XREF NEXT RECORD
466000200420           AT END
466100200420             GO TO CSJ-EXIT
466200200420           END-READ.
466300200420
466400200420           IF INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF
466500200420           IS NOT EQUAL INVESTMENT-CODE OF TRANS
466600200420             GO TO CSJ-EXIT
466700200420           END-IF.
466800200420
466900200420
467000200420       CSJ-0005.
467100200420           INITIALIZE  FUNCT-INV-STRUCT-XREF-REC.
467200200420           MOVE  "SEGLIC"           TO FUNCTION-CODE
467300200420                                    OF FUNCTION-INV-STRUCTURE-XREF.
467400200420           MOVE  INVESTMENT-STRUCTURE-CODE
467500200420                                    OF INVESTMENT-STRUCTURE-XREF
467600200420                 TO  INVESTMENT-STRUCTURE-CODE
467700200420                                    OF FUNCTION-INV-STRUCTURE-XREF.
467800200420
467900200420           READ  FUNCTION-INV-STRUCTURE-XREF
468000200420             INVALID KEY
468100200420                 GO TO CSJ-0000.
468200200420
468300200420           MOVE INVESTMENT-STRUCTURE-CODE
468400200420                             OF INVESTMENT-STRUCTURE-XREF
468500200420                             TO WS-INVESTMENT-STRUCTURE.
468600200420
468700200420           MOVE ACCOUNT-NO OF TRANS
468800200420                             TO ACCOUNT-NO OF ACCOUNT-INVESTMENT2.
468900200420           MOVE LOW-VALUES   TO INVESTMENT-CODE
469000200420                             OF ACCOUNT-INVESTMENT2.
469100200420           START ACCOUNT-INVESTMENT2
469200200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
469300200420           INVALID KEY
469400200420             GO TO CSJ-EXIT
469500200420           END-START.
469600200420
469700200420       CSJ-0010.
469800200420
469900200420           READ ACCOUNT-INVESTMENT2 NEXT RECORD
470000200420           AT END
470100200420             GO TO CSJ-EXIT
470200200420           END-READ.
470300200420
470400200420           IF ACCOUNT-NO OF ACCOUNT-INVESTMENT2
470500200420           IS NOT EQUAL ACCOUNT-NO OF TRANS
470600200420             GO TO CSJ-EXIT
470700200420           END-IF.
470800200420
470900200420           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT2
471000200420                             TO INVESTMENT-CODE
471100200420                             OF INVESTMENT-STRUCTURE-XREF.
471200200420
471300200420           MOVE WS-INVESTMENT-STRUCTURE
471400200420                             TO INVESTMENT-STRUCTURE-CODE
471500200420                             OF INVESTMENT-STRUCTURE-XREF.
471600200420
471700200420           READ INVESTMENT-STRUCTURE-XREF
471800200420           INVALID KEY
471900200420             GO TO CSJ-0010
472000200420           END-READ.
472100200420
472200200420           MOVE "Y"          TO WS-SAME-JURISDICTION-FOUND.
472300200420           GO TO CSJ-EXIT.
472400200420
472500200420       CSJ-EXIT.
472600200420           EXIT.
472700200420
472800200420      *RFS 9092 END
472900200420      /
473000200420       CREATE-NEW-SEG-CONTRACT SECTION.
473100200420      ******************************************************************
473200200420      *                                                                *
473300200420      *    C R E A T E   N E W   S E G   C O N T R A C T   R O U T I N E
473400200420      *                                                                *
473500200420      ******************************************************************
473600200420
473700200420           IF CONTRACTED OR
473800200420              UNCONFIRMED
473900200420             GO TO CNSC-EXIT
474000200420           END-IF.
474100200420
474200200420      * Check for dealer rep seg. authorization, including the
474300200420      * dealer nominee registered
474400200420
474500200420           IF NOMINEE OF ACCOUNT = "Y" AND
474600200420              ACCOUNT-DESIGNATION OF NOMINEE-FILE NOT = "2"
474700200420             GO TO CNSC-0010
474800200420           END-IF.
474900200420
475000200420      * RFS 121437 - Begins - Comment existing
475100200420      *RFS 7947 BEGIN
475200200420      * Check if dealer has seg. license authorization,
475300200420      * including dealer nominee registered.
475400200420
475500200420      *    IF WS-EDIT-SEG-CONTR-PROV = "Y"
475600200420      *      MOVE DEALER-CODE  OF TRANS
475700200420      *                        TO DEALER-CODE OF DEALER-PROV-LICENSE
475800200420      *      MOVE CONTRACT-PROV OF ACCOUNT-CONTRACT
475900200420      *                        TO PROVINCE-CODE
476000200420      *                        OF DEALER-PROV-LICENSE
476100200420      *
476200200420      *      READ DEALER-PROV-LICENSE
476300200420      *      INVALID KEY
476400200420      * RFS 10080
476500200420      *        MOVE "58"       TO REJECTION-CODE OF TRANS
476600200420      *        INITIALIZE MFADELPLP OF DEALER-PROV-LICENSE
476700200420      *        GO TO CNSC-EXIT
476800200420      * RFS 10080
476900200420      *      END-READ
477000200420      *
477100200420      *      IF EXPIRY-DATE OF DEALER-PROV-LICENSE <=
477200200420      *         TRADE-DATE OF TRANS
477300200420      *RFS 9092 BEGIN
477400200420      *        IF WS-EDIT-SEG-JURISDICTION = "Y"
477500200420      *          PERFORM CHECK-SAME-JURISDICTION
477600200420      *          IF WS-SAME-JURISDICTION-FOUND = "Y"
477700200420      *            GO TO CNSC-0005
477800200420      *          END-IF
477900200420      *        END-IF
478000200420      *RFS 9092 END
478100200420      *        MOVE "58"       TO REJECTION-CODE OF TRANS
478200200420      *        GO TO CNSC-EXIT
478300200420      *      END-IF
478400200420      *    END-IF.
478500200420      *RFS 7947 END
478600200420      * RFS 121437 - Continues - Replacing Activity
478700200420
478800200420           MOVE DEALER-CODE  OF TRANS
478900200420             TO Lc_ValidateDealer.
479000200420           MOVE SPACES
479100200420             TO Lc_ValidateDealerRep.
479200200420           MOVE CONTRACT-PROV OF ACCOUNT-CONTRACT
479300200420             TO Lc_ValidateProvince.
479400200420           PERFORM VALIDATE-DEALER-LICENSE.
479500200420           IF REJECTION-CODE OF TRANS = "58"
479600200420              GO TO CNSC-EXIT
479700200420           END-IF.
479800200420      * RFS 121437 - Ends
479900200420
480000200420       CNSC-0005.
480100200420
480200200420      * RFS 121437 - Begins - Comment Activity
480300200420      *    IF WS-BLANKET-INSURANCE-LICENSE = "Y"
480400200420      *      GO TO CNSC-0010
480500200420      *    END-IF.
480600200420      *
480700200420      * Test if dealer rep has seg. license authorization
480800200420      *
480900200420      *    MOVE DEALER-CODE  OF TRANS
481000200420      *                      TO DEALER-CODE OF DEALER-REP-PROV-LICENSE.
481100200420      *    MOVE DEALER-REP-CODE  OF TRANS
481200200420      *                      TO DEALER-REP-CODE
481300200420      *                      OF DEALER-REP-PROV-LICENSE.
481400200420      *    MOVE PROVINCE-CODE OF INVESTOR
481500200420      *                      TO PROVINCE-CODE
481600200420      *                      OF DEALER-REP-PROV-LICENSE.
481700200420      *
481800200420      *    READ DEALER-REP-PROV-LICENSE
481900200420      *    INVALID KEY
482000200420LYD   *RFS 9365 BEGIN
482100200420      *        INITIALIZE MFADERPLP OF DEALER-REP-PROV-LICENSE
482200200420LYD   *RFS 9365 END
482300200420LYD   *      MOVE "58"       TO REJECTION-CODE OF TRANS
482400200420LYD   *      GO TO CNSC-EXIT
482500200420      *    END-READ.
482600200420      *
482700200420      *    IF EXPIRY-DATE OF DEALER-REP-PROV-LICENSE <=
482800200420      *       TRADE-DATE OF TRANS
482900200420      *RFS 9092 BEGIN
483000200420      *        IF WS-EDIT-SEG-JURISDICTION = "Y"
483100200420      *          PERFORM CHECK-SAME-JURISDICTION
483200200420      *          IF WS-SAME-JURISDICTION-FOUND = "Y"
483300200420      *            GO TO CNSC-0010
483400200420      *          END-IF
483500200420      *        END-IF
483600200420      *RFS 9092 END
483700200420      * RFS35075 - Begin: do not reject if license expired
483800200420      *        IF lnc_EditCodeREPLICSetupYes
483900200420      *           AND lnc_origCodesForREPLIC
484000200420      *           AND PURCHASE-TRANSACTION
484100200420      *          GO TO CNSC-0010
484200200420      *        ELSE
484300200420      * RFS35075 - End
484400200420      *          MOVE "58"       TO REJECTION-CODE OF TRANS
484500200420      *          GO TO CNSC-EXIT
484600200420      * RFS35075 - Begin
484700200420      *        END-IF
484800200420      * RFS35075 - End
484900200420      *    END-IF.
485000200420      * RFS 121437 - Continues - Add new activity
485100200420           MOVE DEALER-CODE  OF TRANS
485200200420             TO Lc_ValidateDealer.
485300200420           MOVE DEALER-REP-CODE  OF TRANS
485400200420             TO Lc_ValidateDealerRep.
485500200420           MOVE PROVINCE-CODE OF INVESTOR
485600200420             TO Lc_ValidateProvince.
485700200420           PERFORM Validate-Dealer-Rep-License
485800200420           IF REJECTION-CODE OF TRANS = "58"
485900200420              GO TO CNSC-EXIT
486000200420           END-IF.
486100200420      * RFS 121437 - Ends
486200200420
486300200420       CNSC-0010.
486400200420
486500200420      * Create trans contract details
486600200420
486700200420           INITIALIZE MFATRCODP OF WS-TRANS-CONTRACT-DETAILS.
486800200420           MOVE PLACEMENT-DATE OF TRANS
486900200420                             TO PLACEMENT-DATE
487000200420                             OF WS-TRANS-CONTRACT-DETAILS.
487100200420           MOVE TRANS-NO OF TRANS
487200200420                             TO TRANS-NO
487300200420                             OF WS-TRANS-CONTRACT-DETAILS.
487400200420
487500200420           MOVE "CON#"       TO CONTROL-CODE OF CONTROL-FILE.
487600200420      * RFS20711 - Begin (Replaced "READ   " with "PERFORM ...")
487700200420           MOVE "CONTR FILE CON"   TO WS-TEMP-STR                       RFS9530
487800200420           PERFORM READ-CONTROL-FILE
487900200420      * RFS20711 - End
488000200420
488100200420           MOVE NEXT-NUMBER OF CONTROL-FILE
488200200420                             TO CONTRACT-NO
488300200420                             OF WS-TRANS-CONTRACT-DETAILS.
488400200420      * RFS83243 begin
488500200420      *    ADD 1             TO NEXT-NUMBER OF CONTROL-FILE.
488600200420
488700200420      ****     RFS 15847 Begin
488800200420      *    IF NOT SEG-VALIDATION-MODE
488900200420      * RFS20711 - Begin (Replaced "REWRITE" with "PERFORM ...")
489000200420      *        PERFORM REWRITE-CONTROL-FILE
489100200420      * RFS20711 - End
489200200420      *    END-IF.
489300200420      ****     RFS 15847 End
489400200420
489500200420           IF NOT SEG-VALIDATION-MODE
489600200420             ADD 1         TO NEXT-NUMBER OF CONTROL-FILE
489700200420           END-IF.
489800200420           PERFORM REWRITE-CONTROL-FILE.
489900200420      * RFS83243 end
490000200420
490100200420       CNSC-0150.
490200200420
490300200420      * Create account contract investment
490400200420
490500200420           INITIALIZE MFAACCCIP OF WS-ACCOUNT-CONTRACT-INVESTMENT.
490600200420           MOVE ACCOUNT-NO OF TRANS
490700200420                             TO ACCOUNT-NO
490800200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT.
490900200420
491000200420           MOVE INVESTMENT-CODE OF TRANS
491100200420                             TO INVESTMENT-CODE
491200200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT.
491300200420
491400200420           MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS
491500200420                             TO CONTRACT-NO
491600200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT.
491700200420           MOVE PASS-PROCESS-DATE-9
491800200420                             TO CREATION-DATE
491900200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT.
492000200420
492100200420       CNSC-0200.
492200200420
492300200420      * Create account contract
492400200420
492500200420           INITIALIZE MFAACCONP OF WS-ACCOUNT-CONTRACT.
492600200420110904     INITIALIZE   Li_ADLInvestor
492700200420110904                  Li_ADLAccountNo
492800200420110904                  Li_ADLContractNo.
492900200420
493000200420           MOVE ACCOUNT-NO OF TRANS
493100200420                             TO ACCOUNT-NO OF WS-ACCOUNT-CONTRACT
493200200420110904                          Li_ADLAccountNo.
493300200420           MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS
493400200420                             TO CONTRACT-NO
493500200420                             OF WS-ACCOUNT-CONTRACT
493600200420110904                          Li_ADLContractNo.
493700200420           MOVE "O"          TO CONTRACT-STATUS
493800200420                             OF WS-ACCOUNT-CONTRACT.
493900200420      *RFS116449-Start
494000200420           MOVE ACCOUNT-NO OF TRANS
494100200420                             TO ACCOUNT-NO OF ACCOUNT-MISC-DETAILS.
494200200420           READ ACCOUNT-MISC-DETAILS
494300200420128786            WITH NO LOCK
494400200420            INVALID KEY
494500200420              MOVE PROVINCE-CODE OF INVESTOR
494600200420                             TO CONTRACT-PROV
494700200420                             OF WS-ACCOUNT-CONTRACT
494800200420            NOT INVALID KEY
494900200420              IF JURISDICTION-PROVINCE-CODE  OF ACCOUNT-MISC-DETAILS
495000200420              NOT = " "
495100200420
495200200420                 MOVE JURISDICTION-PROVINCE-CODE  OF
495300200420                          ACCOUNT-MISC-DETAILS
495400200420                          TO CONTRACT-PROV
495500200420                          OF WS-ACCOUNT-CONTRACT
495600200420              ELSE
495700200420                 MOVE PROVINCE-CODE OF INVESTOR
495800200420                             TO CONTRACT-PROV
495900200420                             OF WS-ACCOUNT-CONTRACT
496000200420
496100200420              END-IF
496200200420
496300200420           END-READ.
496400200420      *    MOVE PROVINCE-CODE OF INVESTOR
496500200420      *                      TO CONTRACT-PROV
496600200420      *                      OF WS-ACCOUNT-CONTRACT.
496700200420      *RFS116449-End
496800200420110904     MOVE INVESTOR-NO   OF INVESTOR
496900200420110904                        TO Li_ADLInvestor.
497000200420           MOVE "N"          TO MATURITY-INSTRUCTION
497100200420                             OF WS-ACCOUNT-CONTRACT.
49720020042046707      IF lb_EditCodeANNDTHSetupYes
49730020042046707         MOVE lncc_N TO Death-Instruction OF Ws-Account-Contract
49740020042046707      ELSE
497500200420           MOVE "R"          TO DEATH-INSTRUCTION
497600200420                             OF WS-ACCOUNT-CONTRACT.
497700200420           MOVE TRADE-DATE   OF TRANS
497800200420                             TO START-DATE
497900200420                             OF WS-ACCOUNT-CONTRACT.
498000200420           MOVE PASS-PROCESS-DATE-9
498100200420                             TO CREATION-DATE
498200200420                             OF WS-ACCOUNT-CONTRACT.
498300200420      * RFS110904 - Start
498400200420           MOVE PASS-PROCESS-DATE-9
498500200420           TO CONT-INFORCE-DATE     OF WS-ACCOUNT-CONTRACT.
498600200420           MOVE 'N'
498700200420           TO GUAR-BENEFIT-ELIGIBLE OF WS-ACCOUNT-CONTRACT.
498800200420      * RFS110904 - End
498900200420
499000200420      * RFS52816.13 - Begin: Set the fields to N for new contract
49910020042052816      MOVE "N" to QUALIFYING-FLAG  OF WS-ACCOUNT-CONTRACT
49920020042052816      MOVE "N" to SPOUSAL-DOB-FLAG OF WS-ACCOUNT-CONTRACT
49930020042052816      MOVE "N" to RIF-MIN-DOB-USED OF WS-ACCOUNT-CONTRACT
499400200420      * RFS52816.13 - End
499500200420
499600210806      *RFS187471 Starts
49970021080644930 *    IF lb_EditCodeTGDVSetupYes
499800210806           IF (lb_EditCodeTGDVSetupYes OR lb_DepTDDthPercentYes)
499900210806      *RFS187471 End
50000020042055525         and lc_GlwbInvestment not= "Y"
50010020042044930         IF ln_NewGDVPercent = 0
50020020042044930            IF lnc_origCodeMat
50030020042044930               MOVE Ws-Seg-Array-GDV-Percent(1)
50040020042044930                 TO ln_NewGDVPercent
500500200420
500600200420      * RFS121426 - Start
500700200420
500800200420132067* Code changes of 121426 have been moved to new
500900200420132067* section Calculate-GDV-MAT-Value
501000200420
501100200420                   IF TRANS-TYPE-CODE OF TRANS = "BUY"
501200210724      * RFS1115261 Starts
501300210724132067*                PERFORM Calculate-GDV-MAT-Value
501400210724158648*                PERFORM CalculateGDVPercentage
501500210724                       PERFORM GetMATContractGDVPercent
501600210724      * RFS1115261 Ends
501700200420132067             END-IF
501800200420      * RFS 132067 - End
501900200420      * RFS121426 - End
50200020042044930            ELSE
50210020042044930               PERFORM CalculateGDVPercentage
50220020042044930            END-IF
50230020042044930         END-IF
50240020042044930         MOVE ln_NewGDVPercent
50250020042044930           TO Guarantee-Dth-Percent OF Ws-Account-Contract
50260020042044930      END-IF.
502700200420      *RFS129709 Starts
502800200420110904*    PERFORM createAuditLog.
502900200420           IF NOT SEG-VALIDATION-MODE
503000200420              PERFORM createAuditLog
503100200420           END-IF.
503200200420      *RFS129709 Ends
503300200420
503400200420      *RFS 13306 Begin
503500200420      * Create Trans Contract Target
503600200420
503700200420      *RFS 31912 Begin
503800200420           IF Switch-In-Transaction
503900200420               CONTINUE
504000200420           ELSE
504100200420               GO TO CNSC-0250
504200200420           END-IF.
504300200420      *RFS 31912 End
504400200420
504500200420           MOVE 0                   TO WS-TCT2.
504600200420           MOVE "W2"                TO WRITE-TRANS-CONTRACT-TARGET
504700200420
504800200420      *RFS 16812 Begin
504900200420           IF SWO-NOT-A-SEGFUND
505000200420
505100200420               MOVE 1               TO WS-TCT2
505200200420
505300200420               MOVE PLACEMENT-DATE OF TRANS
505400200420               TO PLACEMENT-DATE-2
505500200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
505600200420
505700200420               MOVE TRANS-NO OF TRANS
505800200420               TO TRANS-NO-2
505900200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
506000200420
506100200420               MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS
506200200420               TO CONTRACT-NO-2
506300200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
506400200420
506500200420               MOVE WS-SAVE-STDF-PLACEMENT-DATE
506600200420               TO PLACEMENT-DATE
506700200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
506800200420
506900200420               MOVE WS-SAVE-STDF-TRANS-NO
507000200420               TO TRANS-NO
507100200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
507200200420
507300200420               MOVE 0
507400200420               TO CONTRACT-NO
507500200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
507600200420
507700200420               GO TO CNSC-0250
507800200420
507900200420           END-IF.
508000200420
508100200420      *RFS 16812 End
508200200420
508300200420           PERFORM VARYING WS-SEG-ARRAY-CTR
508400200420      **** RFS15723 Begin
508500200420                       FROM 1 BY 1 UNTIL WS-SEG-ARRAY-CTR >
508600200420                       WS-SEG-OUT-NUMBER-OF-CONTRACTS
508700200420      ****             FROM WS-SEG-OUT-NUMBER-OF-CONTRACTS BY -1
508800200420      ****             UNTIL WS-SEG-ARRAY-CTR <= 0
508900200420      **** RFS15723 End
509000200420
509100200420               ADD 1                TO WS-TCT2
509200200420
509300200420               MOVE PLACEMENT-DATE OF TRANS
509400200420               TO PLACEMENT-DATE-2
509500200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
509600200420
509700200420               MOVE TRANS-NO OF TRANS
509800200420               TO TRANS-NO-2
509900200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
510000200420
510100200420               MOVE CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS
510200200420               TO CONTRACT-NO-2
510300200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
510400200420
510500200420               MOVE WS-SEG-ARRAY-PLACEMENT-DATE(WS-SEG-ARRAY-CTR)
510600200420               TO PLACEMENT-DATE
510700200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
510800200420
510900200420               MOVE WS-SEG-ARRAY-TRANS-NO(WS-SEG-ARRAY-CTR)
511000200420               TO TRANS-NO
511100200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
511200200420
511300200420               MOVE WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
511400200420               TO CONTRACT-NO
511500200420               OF WS-TRANS-CONTRACT-TARGET-2(WS-TCT2)
511600200420
511700200420           END-PERFORM.
511800200420
511900200420      *RFS 16812 Begin
512000200420       CNSC-0250.
512100200420      *RFS 16812 End
512200200420
512300200420      * Set write flags
512400200420      *RFS 13306 End
512500200420
512600200420           MOVE "W"          TO WRITE-TRANS-CONTRACT
512700200420                                WRITE-ACCOUNT-CONTRACT-INV
512800200420                                WRITE-ACCOUNT-CONTRACT.
512900200420
513000200420       CNSC-0300.
513100200420
513200200420      * Create account contract annuitant
513300200420
513400200420           IF WS-ACCOUNT-EXISTS NOT = "Y"
513500200420      * RFS 13306 Begin
513600210608115650*     OR SEG-TRANSFER-ANNUITANT
513700200420      * RFS 13306 End
513800210608      *RFS1115650 Start
513900210608           OR (SEG-TRANSFER-ANNUITANT
514000210608               AND NOT
514100210608               (lc_Policy = Lncc_A AND
514200210608               lb_EditCodeACINVGSetupYes AND
514300210608               NOT SEG-TRANSFER-EFFECTIVE-DATE))
514400210608      *RFS1115650 End
514500200420             GO TO CNSC-EXIT
514600200420           END-IF.
514700200420
514800200420           MOVE ACCOUNT-NO   OF TRANS
514900200420                             TO ACCOUNT-NO
515000200420                             OF ACCOUNT-ANNUITANT-DEFAULT.
515100200420EY         MOVE "P"          TO DEFAULT-FLAG
515200200420                             OF ACCOUNT-ANNUITANT-DEFAULT.
515300200420
515400200420           READ ACCOUNT-ANNUITANT-DEFAULT
515500200420           INVALID KEY
515600200420             GO TO CNSC-EXIT
515700200420           END-READ.
515800200420
515900200420           INITIALIZE MFAACCANP OF WS-ACCOUNT-CONT-ANNT.
516000200420
516100200420           MOVE ACCOUNT-NO   OF TRANS
516200200420                             TO ACCOUNT-NO OF WS-ACCOUNT-CONT-ANNT.
516300200420           MOVE CONTRACT-NO  OF WS-TRANS-CONTRACT-DETAILS
516400200420                             TO CONTRACT-NO OF WS-ACCOUNT-CONT-ANNT.
516500200420           MOVE ANNUITANT-SEQ-NO OF ACCOUNT-ANNUITANT-DEFAULT
516600200420                             TO ANNUITANT-SEQ-NO
516700200420                             OF WS-ACCOUNT-CONT-ANNT.
516800200420           MOVE "P"          TO ANNUITANT-TYPE-CODE
516900200420                             OF WS-ACCOUNT-CONT-ANNT.
517000200420           MOVE PASS-PROCESS-DATE-9
517100200420                             TO CREATION-DATE
517200200420                             OF WS-ACCOUNT-CONT-ANNT.
517300200420
517400200420           MOVE "W"          TO WRITE-ACCOUNT-CONT-ANNT.
517500200420
517600200420           MOVE SPACES
517700200420           TO MATURITY-DATE OF WS-ACCOUNT-CONTRACT.
517800200420107679     MOVE SPACES
517900200420107679     TO ORIGINAL-CMD  OF WS-ACCOUNT-CONTRACT.
518000200420
518100200420           PERFORM CALC-CONTRACT-MATURITY-DATE.
518200200420
518300200420           MOVE WS-MATURITY-DATE
518400200420           TO MATURITY-DATE OF WS-ACCOUNT-CONTRACT.
518500200420      * RFS124070 - START
518600200420           IF lc_Policy = "A"
518700200420             IF ((FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS) <=
518800200420              pi-MATAGContractMaturityDate ) AND
518900200420               ( pi-MATAGContractMaturityDate <
519000200420                 pi-MATAGAccMaturityDate) AND
519100200420               ( FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS > 0)
519200200420
519300200420                  MOVE FINAL-TOPUP-DATE OF ACCOUNT-MISC-DETAILS
519400200420                         TO MATURITY-DATE OF WS-ACCOUNT-CONTRACT
519500200420                            WS-MATURITY-DATE
519600200420             END-IF
519700200420              MOVE SPACES TO LC-INVSTRUCTURECODE,
519800200420                                 LC-GUARBENEFITELIGIBLE
519900200420
520000200420              CALL "FXSETPOL" USING PLACEMENT-DATE OF TRANS,
520100200420                                    TRANS-NO OF TRANS,
520200200420                                    LC-GUARBENEFITELIGIBLE,
520300200420                                    INVESTMENT-CODE OF TRANS,
520400200420                                    LC-INVSTRUCTURECODE
520500200420
520600200420               MOVE LC-INVSTRUCTURECODE TO CONTRACT-XREF
520700200420                                 OF WS-ACCOUNT-CONTRACT
520800200420           END-IF.
520900200420      * RFS124070 - END
521000200420107679     MOVE li_orgCntMaturity
521100200420107679     TO ORIGINAL-CMD  OF WS-ACCOUNT-CONTRACT.
521200200420
521300200420      * RFS52779 Start :Create Account Contract Annuitant for JointLife
521400200420       CNSC-0400.
521500200420           MOVE ACCOUNT-NO OF TRANS
521600200420                         TO ACCOUNT-NO    OF ACCOUNT-ANNUITANT-DEFAULT.
521700200420           MOVE "J"      TO DEFAULT-FLAG  OF ACCOUNT-ANNUITANT-DEFAULT.
521800200420
521900200420      * RFS83793 Start - Added logic to pick up only the 'A' Joint Annuitant
522000200420           START ACCOUNT-ANNUITANT-DEFAULT
522100200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
522200200420           INVALID KEY
522300200420             GO TO CNSC-EXIT
522400200420           END-START.
522500200420
522600200420       CNSC-0460.
522700200420           READ ACCOUNT-ANNUITANT-DEFAULT NEXT RECORD
522800200420           AT END
522900200420             GO TO CNSC-EXIT
523000200420           END-READ.
523100200420
52320020042083793 *    READ ACCOUNT-ANNUITANT-DEFAULT
523300200420  |   *    INVALID KEY
523400200420  |   *      GO TO CNSC-EXIT
52350020042083793 *    END-READ.
523600200420
523700200420           IF (ACCOUNT-NO OF ACCOUNT-ANNUITANT-DEFAULT    NOT =
523800200420               ACCOUNT-NO OF TRANS)                                   OR
523900200420              (DEFAULT-FLAG  OF ACCOUNT-ANNUITANT-DEFAULT NOT =  "J")
524000200420              GO TO CNSC-EXIT
524100200420           END-IF.
524200200420
524300200420           IF ANNUITANT-STATUS OF ACCOUNT-ANNUITANT-DEFAULT NOT =  "A"
524400200420      *89337.1 Begins create an inactive annuitant
524500200420           AND ANNUITANT-STATUS OF ACCOUNT-ANNUITANT-DEFAULT NOT =  "I"
524600200420      *89337.1 End
524700200420              GO TO CNSC-0460
524800200420           END-IF.
524900200420      *RFS83793 end
525000200420
525100200420           INITIALIZE MFAACCANP OF WS-ACCOUNT-CONT-ANNT-JL.
525200200420
525300200420           MOVE ACCOUNT-NO   OF TRANS
525400200420                        TO ACCOUNT-NO OF WS-ACCOUNT-CONT-ANNT-JL.
525500200420           MOVE CONTRACT-NO  OF WS-TRANS-CONTRACT-DETAILS
525600200420                        TO CONTRACT-NO OF WS-ACCOUNT-CONT-ANNT-JL.
525700200420           MOVE ANNUITANT-SEQ-NO OF ACCOUNT-ANNUITANT-DEFAULT
525800200420                        TO ANNUITANT-SEQ-NO OF WS-ACCOUNT-CONT-ANNT-JL.
525900200420           MOVE "J"  TO ANNUITANT-TYPE-CODE OF WS-ACCOUNT-CONT-ANNT-JL.
526000200420           MOVE PASS-PROCESS-DATE-9
526100200420                        TO CREATION-DATE OF WS-ACCOUNT-CONT-ANNT-JL.
526200200420
526300200420           MOVE "W"          TO WRITE-ACCOUNT-CONT-ANNT.
526400200420      * RFS52779 Ends
526500200420
526600200420      *89337.1 Begins exit if joint active found if inactive read file
526700200420      *89337.1 again
526800200420            IF DEFAULT-FLAG OF ACCOUNT-ANNUITANT-DEFAULT  =  "J"  AND
526900200420              ANNUITANT-STATUS OF ACCOUNT-ANNUITANT-DEFAULT  = "I"
527000200420              GO TO CNSC-0460
527100200420            END-IF.
527200200420      *89337.1 End
527300200420       CNSC-EXIT.
527400200420           EXIT.
527500200420      /
527600200420       PROCESS-SEG-SELL SECTION.
527700200420      ******************************************************************
527800200420      *                                                                *
527900200420      *    P R O C E S S   S E G   S E L L   R O U T I N E             *
528000200420      *                                                                *
528100200420      ******************************************************************
528200200420
528300200420      *RFS 15847 BEGIN
528400200420           IF SEG-OUT-PROCESSED
528500200420               GO TO PSS-EXIT
528600200420           END-IF
528700200420      *RFS 15847 End
528800200420
528900200420      *RFS 13306 BEGIN
529000200420           INITIALIZE WS-SEG-OUT-CONTRACT-ARR.
529100200420           MOVE 0 TO WS-SEG-ARRAY-CTR.
529200200420      *RFS 13306 END
529300200420
529400200420           MOVE UNIT-AMT OF TRANS
529500200420                             TO WS-SEG-UNITS-REDUCE.
529600200420
529700200420           IF WS-REQ-INDIV-CONTRACT = "Y"
529800200420             GO TO PSS-0050
529900200420           END-IF.
530000200420
530100200420           MOVE ACCOUNT-NO OF TRANS
530200200420                             TO ACCOUNT-NO OF ACCOUNT-CONT-AGE.
530300200420           MOVE ZEROES       TO START-DATE OF ACCOUNT-CONT-AGE.
530400200420
530500200420           START ACCOUNT-CONT-AGE
530600200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
530700200420           INVALID KEY
530800200420             GO TO PSS-EXIT
530900200420           END-START.
531000200420
531100210724      *RFS1115261 Starts
531200210724           IF SWITCH-OUT-TRANSACTION AND
531300210724              (lnc_origCodeMat OR lnc_origCodeRST)
531400210724              MOVE PLACEMENT-DATE OF TRANS
531500210724                   TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS,
531600210724                      li_TransContPlacementDate
531700210724              MOVE TRANS-NO OF TRANS
531800210724                   TO TRANS-NO OF TRANS-CONTRACT-DETAILS
531900210724                      li_TransContTransNo
532000210724              PERFORM GetTransContractDetails
532100210724           END-IF.
532200210724      *RFS1115261 Ends
532300210724
532400200420       PSS-0010.
532500200420
532600200420           READ ACCOUNT-CONT-AGE NEXT RECORD
532700200420           AT END
532800200420             GO TO PSS-EXIT
532900200420           END-READ.
533000200420
533100200420           IF ACCOUNT-NO OF ACCOUNT-CONT-AGE IS NOT EQUAL
533200200420           ACCOUNT-NO OF TRANS
533300200420             GO TO PSS-EXIT
533400200420           END-IF.
533500200420
533600210724      *RFS1115261 Starts
533700210724           IF SWITCH-OUT-TRANSACTION AND
533800210724             (lnc_origCodeMat OR lnc_origCodeRST) AND
533900210724              CONTRACT-NO OF TRANS-CONTRACT-DETAILS NOT = 0 AND
534000210724              CONTRACT-NO OF TRANS-CONTRACT-DETAILS NOT = CONTRACT-NO
534100210724              OF ACCOUNT-CONT-AGE
534200210724              GO TO PSS-0010
534300210724           END-IF.
534400210724      *RFS1115261 Ends
534500210724
534600200420       PSS-0020.
534700200420
534800200420           MOVE ACCOUNT-NO OF TRANS
534900200420                             TO ACCOUNT-NO
535000200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
535100200420
535200200420           MOVE INVESTMENT-CODE OF TRANS
535300200420                             TO INVESTMENT-CODE
535400200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
535500200420
535600200420           MOVE CONTRACT-NO OF ACCOUNT-CONT-AGE
535700200420                             TO CONTRACT-NO
535800200420167104*                      OF ACCOUNT-CONTRACT-INVESTMENT.
535900200420167104                       OF ACCOUNT-CONTRACT-INVESTMENT
536000200420167104                       li_ContractNum.
536100200420
536200200420           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
536300200420           INVALID KEY
536400200420             GO TO PSS-0010
536500200420           END-READ.
536600200420
536700200420           IF CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
536800200420           IS EQUAL 0
536900200420             GO TO PSS-0010
537000200420           END-IF.
537100200420
537200200420           INITIALIZE MFATRCODP OF WS-TRANS-CONTRACT-DETAILS.
537300200420           MOVE PLACEMENT-DATE OF TRANS
537400200420                             TO PLACEMENT-DATE
537500200420                             OF WS-TRANS-CONTRACT-DETAILS.
537600200420           MOVE TRANS-NO OF TRANS
537700200420                             TO TRANS-NO
537800200420                             OF WS-TRANS-CONTRACT-DETAILS.
537900200420      *RFS-146960-Start
538000200420           IF lc_ModuleSEGPOANOn
538100200420              SET lb_POANInvestNo  TO TRUE
538200200420      *RFS1014172 START - Initializing variable before validation routine
538300200420              INITIALIZE lc_SeriesType
538400200420      *RFS1014172 END
538500200420167104*       PERFORM CheckPOANRules
538600200420167104        PERFORM CheckIfInvIsPOANInv
538700200420              IF lc_SeriesType = lncc_POAN
538800200420               SET lb_POANInvestYes TO TRUE
538900200420              END-IF
539000200420             IF lb_POANInvestYes
539100200420      *RFS170108 - START
539200200420173604          INITIALIZE WS-AWD-SEQNO
539300200420                IF TRANS-ORIGIN-CODE OF TRANS = "AWE"
539400200420                  OR TRANS-ORIGIN-CODE OF TRANS = "AWC"
539500200420                   PERFORM GET-AWD-SEQNO
539600200420                END-IF
539700200420      *RFS170108 - END
539800200420               INITIALIZE MFAACCCSP OF ACCOUNT-CONTRACT-SPIA-REC
539900200420                MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
540000200420                TO  ACCOUNT-NO OF Account-Contract-SPIA
540100200420                MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
540200200420                TO CONTRACT-NO OF Account-Contract-SPIA
540300200420                PERFORM READ-ACCSP
540400200420                IF lncc_ReadNxtACCSP = lncc_Y
540500200420                   GO TO PSS-0010
540600200420                END-IF
540700200420             ELSE
540800200420              MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
540900200420                            TO CONTRACT-NO
541000200420                            OF WS-TRANS-CONTRACT-DETAILS
541100200420             END-IF
541200200420           ELSE
541300200420              MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
541400200420                            TO CONTRACT-NO
541500200420                            OF WS-TRANS-CONTRACT-DETAILS
541600200420           END-IF.
541700200420
541800200420
541900200420       PSS-0050.
542000200420
542100200420           SUBTRACT OUTSTANDING-REDEMPTION-BALANCE
542200200420                    OF ACCOUNT-CONTRACT-INVESTMENT
542300200420               FROM CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
542400200420             GIVING WS-SEG-UNITS-AVAILABLE.
542500200420
542600200420      * For "CON" SEL at contract time book the units in the
542700200420      * the outstanding redemption balance. Otherwise reduce
542800200420      * the units from current unit balance.
542900200420
543000200420           IF WS-SEG-UNITS-AVAILABLE
543100200420           IS LESS THAN WS-SEG-UNITS-REDUCE
543200200420
543300200420             MOVE WS-SEG-UNITS-AVAILABLE
543400200420                             TO ORIG-UNIT-BAL
543500200420                             OF WS-TRANS-CONTRACT-DETAILS
543600200420
543700200420             SUBTRACT WS-SEG-UNITS-AVAILABLE
543800200420                             FROM WS-SEG-UNITS-REDUCE
543900200420
544000200420             IF NOT CONTRACTED
544100200420
544200200420      *RFS 13306 BEGIN
544300200420
544400200420      ****     Create array for each seg contract out (we will use
544500200420      ****     this array later during seg in logic)
544600200420
544700200420               ADD 1 TO WS-SEG-ARRAY-CTR
544800200420      * RFS49699 - Array logging logic
544900200420
545000200420               IF WS-SEG-ARRAY-CTR  > WS-ARRAY7-MAX-USED
545100200420                   MOVE WS-SEG-ARRAY-CTR       TO WS-ARRAY7-MAX-USED
545200200420               END-IF
545300200420
545400200420      * RFS49699 - End
545500200420               MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
545600200420               TO   WS-SEG-ARRAY-ACCOUNT-NO(WS-SEG-ARRAY-CTR)
545700200420               MOVE PLACEMENT-DATE OF TRANS
545800200420               TO   WS-SEG-ARRAY-PLACEMENT-DATE(WS-SEG-ARRAY-CTR)
545900200420               MOVE TRANS-NO OF TRANS
546000200420               TO   WS-SEG-ARRAY-TRANS-NO(WS-SEG-ARRAY-CTR)
546100200420               MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
546200200420               TO   WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
546300200420               MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
546400200420               TO   WS-SEG-ARRAY-INVESTMENT-CODE(WS-SEG-ARRAY-CTR)
546500200420               MOVE WS-SEG-UNITS-AVAILABLE
546600200420               TO   WS-SEG-ARRAY-CONTRACT-UNITS(WS-SEG-ARRAY-CTR)
546700200420      *RFS18686 Begin
546800200420               MOVE UNIT-AMT   OF TRANS
546900200420               TO   WS-SEG-ARRAY-TOTAL-UNITS(WS-SEG-ARRAY-CTR)
547000200420      *RFS18686 End
547100200420               MOVE UNIT-PRICE OF TRANS
547200200420               TO   WS-SEG-ARRAY-UNIT-PRICE(WS-SEG-ARRAY-CTR)
547300210806      *RFS187471 Starts
54740021080644930 *        IF lb_EditCodeTGDVSetupYes
547500210806               IF (lb_EditCodeTGDVSetupYes OR lb_DepTDDthPercentYes)
547600210806      *RFS187471 End
54770020042055525             and lc_GlwbInvestment not= "Y"
54780020042044930             PERFORM GetDeathPercentFromOutTran
54790020042044930          END-IF
548000200420
548100200420      *RFS 13306 END
548200200420
548300200420               SUBTRACT WS-SEG-UNITS-AVAILABLE
548400200420                             FROM CURR-UNIT-BAL
548500200420                             OF ACCOUNT-CONTRACT-INVESTMENT
548600200420             ELSE
548700200420               ADD      WS-SEG-UNITS-AVAILABLE
548800200420                             TO OUTSTANDING-REDEMPTION-BALANCE
548900200420                             OF ACCOUNT-CONTRACT-INVESTMENT
549000200420             END-IF
549100200420
549200200420           ELSE
549300200420
549400200420             MOVE WS-SEG-UNITS-REDUCE
549500200420                             TO ORIG-UNIT-BAL
549600200420                             OF WS-TRANS-CONTRACT-DETAILS
549700200420
549800200420             IF NOT CONTRACTED
549900200420
550000200420      *RFS 13306 BEGIN
550100200420
550200200420      ****     Create array for each seg contract out (we will use
550300200420      ****     this array later during seg in logic)
550400200420
550500200420               ADD 1 TO WS-SEG-ARRAY-CTR
550600200420      * RFS49699 - Array logging logic
550700200420
550800200420               IF WS-SEG-ARRAY-CTR > WS-ARRAY7-MAX-USED
550900200420                   MOVE WS-SEG-ARRAY-CTR       TO WS-ARRAY7-MAX-USED
551000200420               END-IF
551100200420
551200200420      * RFS49699 - End
551300200420               MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
551400200420               TO   WS-SEG-ARRAY-ACCOUNT-NO(WS-SEG-ARRAY-CTR)
551500200420               MOVE PLACEMENT-DATE OF TRANS
551600200420               TO   WS-SEG-ARRAY-PLACEMENT-DATE(WS-SEG-ARRAY-CTR)
551700200420               MOVE TRANS-NO OF TRANS
551800200420               TO   WS-SEG-ARRAY-TRANS-NO(WS-SEG-ARRAY-CTR)
551900200420               MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
552000200420               TO   WS-SEG-ARRAY-CONTRACT-NO(WS-SEG-ARRAY-CTR)
552100200420               MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
552200200420               TO   WS-SEG-ARRAY-INVESTMENT-CODE(WS-SEG-ARRAY-CTR)
552300200420               MOVE WS-SEG-UNITS-REDUCE
552400200420               TO   WS-SEG-ARRAY-CONTRACT-UNITS(WS-SEG-ARRAY-CTR)
552500200420      *RFS18686 Begin
552600200420               MOVE UNIT-AMT   OF TRANS
552700200420               TO   WS-SEG-ARRAY-TOTAL-UNITS(WS-SEG-ARRAY-CTR)
552800200420      *RFS18686 End
552900200420               MOVE UNIT-PRICE OF TRANS
553000200420               TO   WS-SEG-ARRAY-UNIT-PRICE(WS-SEG-ARRAY-CTR)
553100210806      *RFS187471 Starts
55320021080644930 *        IF lb_EditCodeTGDVSetupYes
553300210806               IF (lb_EditCodeTGDVSetupYes OR lb_DepTDDthPercentYes)
553400210806      *RFS187471 End
55350020042055525             and lc_GlwbInvestment not= "Y"
55360020042044930             PERFORM GetDeathPercentFromOutTran
55370020042044930          END-IF
553800200420
553900200420
554000200420      *RFS 13306 END
554100200420
554200200420               SUBTRACT WS-SEG-UNITS-REDUCE
554300200420                             FROM CURR-UNIT-BAL
554400200420                             OF ACCOUNT-CONTRACT-INVESTMENT
554500200420             ELSE
554600200420               ADD      WS-SEG-UNITS-REDUCE
554700200420                             TO OUTSTANDING-REDEMPTION-BALANCE
554800200420                             OF ACCOUNT-CONTRACT-INVESTMENT
554900200420             END-IF
555000200420
555100200420             MOVE ZEROES     TO WS-SEG-UNITS-REDUCE
555200200420
555300200420           END-IF.
555400200420
55550020042040942      IF lc_ModuleSEGGLWBOn
55560020042081076         PERFORM SetSwitchIntoGlwb
55570020042040942         PERFORM CheckIfInvIsGLWBInv
55580020042060593 *MvdUp81076*** PERFORM SetSwitchIntoGlwb
55590020042040942 *50474  IF Investment-Series OF INVESTMENT-SEG NOT = SPACES
55600020042050474         IF lc_GlwbInvestment = "Y"
55610020042040942            IF NOT Seg-Validation-Mode AND
55620020042040942               HISTORY AND
556300200420r48630             (Sell-Transaction OR (Switch-Out-Transaction AND
556400200420r48630*R81076 Chg   (NOT Seg-Same-Account OR NotSameLoadStructure
556500200420R81076              (NOT Seg-Same-Account
556600200420def14                OR NotSameSegSeries)))
556700200420      * RFS48640 - Begin: add GLWB Condition-(For TRO and
556800200420      *   TRANSFER-GWB-FIEB Not = Y do not do the update)
55690020042050474 *           IF TRANSFER-OUT-TRANSACTION             AND
55700020042050474             IF SWITCH-OUT-TRANSACTION               AND
557100200420                     TRANSFER-GWB-FIEB OF SEG-SWITCH-TRF-OPT = lncc_Y
55720020042056974                AND SwitchIntoGlwbYes
557300200420                    CONTINUE
557400200420                  ELSE
557500200420                    PERFORM UpdateGLWBBucketSell
557600200420                  END-IF
55770020042040942 *             PERFORM UpdateGLWBBucketSell
557800200420      * RFS48640 - End
55790020042040942            END-IF
55800020042040942         END-IF
55810020042040942      END-IF.
558200200420
558300200420      **** RFS 15847 Begin
558400200420           IF NOT SEG-VALIDATION-MODE
558500200420               REWRITE ACCOUNT-CONTRACT-INVEST-REC
558600200420               INVALID KEY
558700200420                 CONTINUE
558800200420               END-REWRITE
558900200420               MOVE 'Y'      TO WS-SEG-OUT-PROCESSED-FLAG
559000200420               IF WS-FILE-STATUS IS NOT EQUAL TO "00"
559100200420                 MOVE "ACCOUNT CONTRACT INVESTMENT"
559200200420                                 TO WS-FILE-STATUS-FILE-NAME
55930020042058714            SET lncc_Err250  TO  TRUE
559400200420                 PERFORM LOG-FILE-STATUS
559500200420               END-IF
559600200420           END-IF.
559700200420      **** RFS 15847 End
559800200420
559900200420           IF WS-REQ-INDIV-CONTRACT IS NOT EQUAL "Y"
560000200420      ****   RFS 15847 Begin
560100200420             IF NOT SEG-VALIDATION-MODE
560200200420                 WRITE TRANS-CONTRACT-DETAILS-REC
560300200420                 FROM WS-TRANS-CONTRACT-DETAILS
560400200420                 INVALID KEY
560500200420                   CONTINUE
560600200420                 END-WRITE
560700200420                 IF WS-FILE-STATUS IS NOT EQUAL TO "00"
560800200420                   MOVE "TRANS CONT DTLS"
560900200420                                 TO WS-FILE-STATUS-FILE-NAME
56100020042058714              SET lncc_Err251  TO  TRUE
561100200420                   PERFORM LOG-FILE-STATUS
561200200420                 END-IF
561300200420             END-IF
561400200420      ****   RFS 15847 End
561500200420           ELSE
561600200420      ****   RFS 15847 Begin
561700200420               IF NOT SEG-VALIDATION-MODE
561800200420                 REWRITE TRANS-CONTRACT-DETAILS-REC
561900200420                 FROM WS-TRANS-CONTRACT-DETAILS
562000200420                 INVALID KEY
562100200420                   CONTINUE
562200200420                 END-REWRITE
562300200420                 IF WS-FILE-STATUS IS NOT EQUAL TO "00"
562400200420                   MOVE "TRANS CONT DTLS"
562500200420                                 TO WS-FILE-STATUS-FILE-NAME
56260020042058714              SET lncc_Err252  TO  TRUE
562700200420                   PERFORM LOG-FILE-STATUS
562800200420                 END-IF
562900200420             END-IF
563000200420      ****   RFS 15847 End
563100200420           END-IF.
563200200420
563300200420      *RFS 13306 BEGIN
563400200420
563500200420      **** Find out if NEW-CONTRACT flag is 'Y' on seg out.
563600200420
563700200420           IF SWITCH-OUT-TRANSACTION
563800200420               CONTINUE
563900200420           ELSE
564000200420      **** RFS 16054 Begin
564100200420      ****     GO TO PSS-EXIT
564200200420               GO TO PSS-0070
564300200420      **** RFS 16054 Begin
564400200420           END-IF.
564500200420
564600200420           MOVE "N"          TO WS-SEG-NEW-CONTRACT
564700210608115650                          lc-SEG-TRANSFER-EFFECTIVE-DATE
564800200420                                WS-SEG-TRANSFER-ANNUITANT
564900200420                                WS-SEG-TRANSFER-MATURITY-DATE.
565000200420
565100200420      *    IF TRANS-TYPE-CODE OF TRANS = 'SWO'
565200200420      *        GO TO PSS-0060
565300200420      *    END-IF.
565400200420      * def06 begins
565500200420R48640* def06 - Not getting the correct Switch Flag
565600200420  |   *  The Account No is of the IN a/c where as the flag require
565700200420  |   *  is of the OUT a/c.  At this point the Trans-No of Trans
565800200420  |   *  is of the OUT a/c.
565900200420  |   *    MOVE ACCOUNT-TYPE-CODE    OF  ACCOUNT
566000200420  |   *    TO   ACCOUNT-TYPE-CODE    OF  SEG-SWITCH-TRF-OPT.
566100200420  |   *
566200200420  |   *    IF NOMINEE OF ACCOUNT = 'Y'
566300200420  |   *
566400200420  |   *        MOVE ACCOUNT-NO       OF ACCOUNT
566500200420  |   *        TO   ACCOUNT-NO       OF ACCOUNT-NOMINEE
566600200420  |   *
566700200420  |   *        READ ACCOUNT-NOMINEE
566800200420  |   *        INVALID KEY
566900200420  |   *          GO TO PSS-0060
567000200420  |   *        END-READ
567100200420  |   *
567200200420  |   *        MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE
567300200420  |   *        TO   NOMINEE-ACCOUNT-TYPE OF SEG-SWITCH-TRF-OPT
567400200420  |
567500200420  |        MOVE ACCOUNT-NO       OF TRANS
567600200420  |        TO   ACCOUNT-NO       OF ACCOUNT2.
567700200420  |
567800200420  |        READ ACCOUNT2
567900200420  |        INVALID KEY
568000200420  |          GO TO PSS-0060
568100200420  |        END-READ.
568200200420  |
56830020042056974      Initialize Mfasgstop OF SEG-SWITCH-TRF-OPT-REC.
568400200420  |        MOVE ACCOUNT-TYPE-CODE    OF  ACCOUNT2
568500200420  |        TO   ACCOUNT-TYPE-CODE    OF  SEG-SWITCH-TRF-OPT.
568600200420  |
568700200420  |        IF NOMINEE OF ACCOUNT2 = 'Y'
568800200420  |
568900200420  |            MOVE ACCOUNT-NO       OF ACCOUNT2
569000200420  |            TO   ACCOUNT-NO       OF ACCOUNT-NOMINEE2
569100200420  |
569200200420  |            READ ACCOUNT-NOMINEE2
569300200420  |            INVALID KEY
569400200420  |              GO TO PSS-0060
569500200420  |            END-READ
569600200420  |
569700200420  |        MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE2
569800200420  |        TO   NOMINEE-ACCOUNT-TYPE OF SEG-SWITCH-TRF-OPT
569900200420R48640
570000200420      * def06 ends
570100200420           ELSE
570200200420               MOVE SPACES
570300200420               TO   NOMINEE-ACCOUNT-TYPE OF SEG-SWITCH-TRF-OPT
570400200420           END-IF.
570500200420
570600200420           MOVE TRANS-TYPE-CODE      OF TRANS
570700200420           TO   TRANS-TYPE-CODE      OF SEG-SWITCH-TRF-OPT.
570800200420
570900200420           MOVE TRANS-ORIGIN-CODE    OF TRANS
571000200420           TO   TRANS-ORIGIN-CODE    OF SEG-SWITCH-TRF-OPT.
571100200420
571200200420           MOVE CONTR-REDEM-CODE     OF TRANS
571300200420           TO   CONTR-REDEM-CODE     OF SEG-SWITCH-TRF-OPT.
571400200420
571500200420           READ SEG-SWITCH-TRF-OPT
571600200420           INVALID KEY
571700200420             GO TO PSS-0060
571800200420           END-READ.
571900200420
572000200420           MOVE NEW-CONTRACT           OF SEG-SWITCH-TRF-OPT
572100200420           TO WS-SEG-NEW-CONTRACT.
572200200420           MOVE TRANSFER-ANNUITANT     OF SEG-SWITCH-TRF-OPT
572300200420           TO WS-SEG-TRANSFER-ANNUITANT.
572400200420           MOVE TRANSFER-MATURITY-DATE OF SEG-SWITCH-TRF-OPT
572500200420           TO WS-SEG-TRANSFER-MATURITY-DATE.
572600210608      *RFS1115650 Start
572700210608           MOVE TRANSFER-EFFECTIVE-DATE OF SEG-SWITCH-TRF-OPT
572800210608           TO lc-SEG-TRANSFER-EFFECTIVE-DATE.
572900210608      *RFS1115650 End
573000200420
573100200420
573200200420153983* start
573300200420162813* start
573400200420      *    IF TRANS-TYPE-CODE OF TRANS = "SWO" OR
573500200420      *    TRANS-TYPE-CODE OF TRANS = "TRO"
573600200420      *      Move placement-date of trans to pd_PlacementDate
573700200420      *      Move trans-no of trans to pd_TransNo
573800200420      *      move spaces to pn_NewContractFlag
573900200420      *      CALL "FXCHKCON" USING pd_PlacementDate
574000200420      *                            pd_TransNo
574100200420      *                            pn_NewContractFlag
574200200420      *      If pn_NewContractFlag ='N'
574300200420      *       MOVE "N" TO WS-SEG-NEW-CONTRACT
574400200420      *      END-IF
574500200420      *    END-IF.
574600200420162813* end
574700200420153983* end
574800200420       PSS-0060.
574900200420
575000200420           MOVE INVESTMENT-CODE OF TRANS TO WS-SEG-OUT-INVESTMENT-CODE.
575100200420           MOVE ACCOUNT-NO      OF TRANS TO WS-SEG-OUT-ACCOUNT-NO.
575200200420
575300200420           MOVE WS-SEG-ARRAY-CTR TO WS-SEG-OUT-NUMBER-OF-CONTRACTS.
575400200420
575500200420      **** RFS 15847 Begin
575600200420      *    MOVE 'Y'                      TO WS-SEG-OUT-PROCESSED-FLAG.
575700200420      **** RFS 15847 End
575800200420
575900200420      *RFS 13306 END
576000200420
576100200420      *RFS 16054 Begin
576200200420       PSS-0070.
576300200420      *RFS 16054 End
576400200420
576500200420      *RFS 15656 Begin
576600200420           IF WS-REQ-INDIV-CONTRACT IS EQUAL "Y"
576700200420             GO TO PSS-EXIT
576800200420           END-IF.
576900200420
577000200420           IF WS-SEG-UNITS-REDUCE IS NOT EQUAL 0
577100200420             GO TO PSS-0010
577200200420           END-IF.
577300200420      *RFS 15656 End
577400200420
577500200420       PSS-EXIT.
577600200420           EXIT.
577700200420      /
577800200420       PROCESS-SEG-WO-SELL SECTION.
577900200420      ******************************************************************
578000200420      *                                                                *
578100200420      *    P R O C E S S   S E G   W O   S E L L   R O U T I N E       *
578200200420      *                                                                *
578300200420      ******************************************************************
578400200420           MOVE PLACEMENT-DATE OF TRANS
578500200420                             TO PLACEMENT-DATE
578600200420                             OF TRANS-CONTRACT-DETAILS.
578700200420           MOVE TRANS-NO OF TRANS
578800200420                             TO TRANS-NO
578900200420                             OF TRANS-CONTRACT-DETAILS.
579000200420           MOVE ZEROES       TO CONTRACT-NO
579100200420                             OF TRANS-CONTRACT-DETAILS.
579200200420
579300200420           START TRANS-CONTRACT-DETAILS
579400200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
579500200420           INVALID KEY
579600200420             GO TO PSWS-EXIT
579700200420           END-START.
579800200420
579900200420       PSWS-0010.
580000200420
580100200420           READ TRANS-CONTRACT-DETAILS NEXT RECORD
580200200420           WITH NO LOCK
580300200420           AT END
580400200420             GO TO PSWS-EXIT
580500200420           END-READ.
580600200420
580700200420           IF (PLACEMENT-DATE OF TRANS IS NOT EQUAL
580800200420           PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS) OR
580900200420           TRANS-NO OF TRANS IS NOT EQUAL
581000200420           TRANS-NO OF TRANS-CONTRACT-DETAILS
581100200420             GO TO PSWS-EXIT
581200200420           END-IF.
581300200420
581400200420           MOVE ACCOUNT-NO OF TRANS
581500200420                               TO ACCOUNT-NO
581600200420                               OF ACCOUNT-CONTRACT-INVESTMENT.
581700200420
581800200420           MOVE INVESTMENT-CODE OF TRANS
581900200420                               TO INVESTMENT-CODE
582000200420                               OF ACCOUNT-CONTRACT-INVESTMENT.
582100200420
582200200420           MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS
582300200420                               TO CONTRACT-NO
582400200420                               OF ACCOUNT-CONTRACT-INVESTMENT.
582500200420
582600200420           READ ACCOUNT-CONTRACT-INVESTMENT
582700200420           WITH NO LOCK
582800200420           INVALID KEY
582900200420             GO TO PSWS-EXIT
583000200420           END-READ.
583100200420
583200200420
583300200420      * For "CON" SEL at settlement time update the outstanding
583400200420      * redemption balance and current unit balance.
583500200420
583600200420           SUBTRACT      ORIG-UNIT-BAL
583700200420                         OF TRANS-CONTRACT-DETAILS
583800200420                         FROM OUTSTANDING-REDEMPTION-BALANCE
583900200420                         OF ACCOUNT-CONTRACT-INVESTMENT.
584000200420
584100200420           SUBTRACT      ORIG-UNIT-BAL
584200200420                         OF TRANS-CONTRACT-DETAILS
584300200420                         FROM CURR-UNIT-BAL
584400200420                         OF ACCOUNT-CONTRACT-INVESTMENT.
584500200420
584600200420
584700200420           REWRITE ACCOUNT-CONTRACT-INVEST-REC
584800200420           INVALID KEY
584900200420             CONTINUE
585000200420           END-REWRITE.
585100200420
585200200420           IF WS-FILE-STATUS IS NOT EQUAL TO "00"
585300200420             MOVE "ACCOUNT CONTRACT INVESTMENT"
585400200420                             TO WS-FILE-STATUS-FILE-NAME
58550020042058714        SET lncc_Err253  TO  TRUE
585600200420             PERFORM LOG-FILE-STATUS
585700200420           END-IF.
585800200420
58590020042040942      IF lc_ModuleSEGGLWBOn AND
58600020042040942 *      (Sell-Transaction OR Switch-Out-Transaction) AND           60638
58610020042040942 *       NOT Seg-Same-Account                                      60638
586200200420             (Sell-Transaction OR (Switch-Out-Transaction AND           60638
58630020042062320 *81076  (NOT Seg-Same-Account OR NotSameLoadStructure             60638
58640020042081076         (NOT Seg-Same-Account                                     60638
58650020042062320         OR NotSameSegSeries)))
58660020042081076         PERFORM SetSwitchIntoGlwb
58670020042040942         PERFORM CheckIfInvIsGLWBInv
58680020042060593 *MvdUp81076*** PERFORM SetSwitchIntoGlwb
58690020042040942 *50474  IF Investment-Series OF INVESTMENT-SEG NOT = SPACES
58700020042050474         IF lc_GlwbInvestment = "Y"
587100200420      * RFS48640 - Begin: add GLWB Condition-(For TRO and
587200200420      *   TRANSFER-GWB-FIEB Not = Y do not do the update)
58730020042050474 *           IF TRANSFER-OUT-TRANSACTION             AND
58740020042050474             IF SWITCH-OUT-TRANSACTION               AND
587500200420                     TRANSFER-GWB-FIEB OF SEG-SWITCH-TRF-OPT = lncc_Y
58760020042056974                AND SwitchIntoGlwbYes
587700200420                    CONTINUE
587800200420                  ELSE
587900200420                    PERFORM UpdateGLWBBucketSell
588000200420                  END-IF
58810020042040942 *             PERFORM UpdateGLWBBucketSell
588200200420      * RFS48640 - End
58830020042040942         END-IF
58840020042040942      END-IF.
588500200420
588600200420           GO TO PSWS-0010.
588700200420
588800200420       PSWS-EXIT.
588900200420           EXIT.
589000200420      /
589100200420      ******************************************************************
589200200420      *                                                                *
589300200420      *    V A L I D A T E   S E G   F U N D   D E T A I L S           *
589400200420      *                                                                *
589500200420      ******************************************************************
589600200420       VALIDATE-SEG-INDIV-REDEM SECTION.
589700200420
589800200420      ** Check to insure that seg fund contract exists
589900200420
590000200420           MOVE "N"          TO WS-REQ-INDIV-CONTRACT.
590100200420
590200200420       VSIR-0010.
590300200420
590400200420      * RFS102693 Start
590500200420           IF REDEMPTION-TRANSACTION AND SPLIT-OPTION-CODE OF
590600200420           TRANS NOT EQUAL "A" AND lncc_EWACDYes AND
590700200420           (REJECTION-CODE OF TRANS-REC = "00" OR SPACES) AND
590800200420           PASS-CDSC-CALCULATOR NOT = "C"
590900200420                PERFORM CheckEWAAmount
591000200420           END-IF.
591100200420
591200200420      * RFS102693 End
591300200420
591400200420           MOVE PLACEMENT-DATE OF TRANS
591500200420                             TO PLACEMENT-DATE
591600200420                             OF TRANS-CONTRACT-DETAILS.
591700200420           MOVE TRANS-NO OF TRANS
591800200420                             TO TRANS-NO
591900200420                             OF TRANS-CONTRACT-DETAILS.
592000200420           MOVE ZEROES       TO CONTRACT-NO
592100200420                             OF TRANS-CONTRACT-DETAILS.
592200200420
592300200420130780     SET lb_ValidKeyFlagNo  TO TRUE
592400200420
592500200420           START TRANS-CONTRACT-DETAILS
592600200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
592700200420           INVALID KEY
592800200420130780       SET lb_ValidKeyFlagYes TO TRUE
592900200420130780*      GO TO VSIR-EXIT
593000200420130780       GO TO VSIR-EXIT0
593100200420           END-START.
593200200420
593300200420           READ TRANS-CONTRACT-DETAILS NEXT RECORD
593400200420           WITH NO LOCK
593500200420           AT END
593600200420130780       SET lb_ValidKeyFlagYes TO TRUE
593700200420130780*      GO TO VSIR-EXIT
593800200420130780       GO TO VSIR-EXIT0
593900200420           END-READ.
594000200420
594100200420
594200200420      * RFS128950 - Start
594300200420      * RFS120931 - START
594400200420      *    MOVE ACCOUNT-NO OF TRANS
594500200420      *                    TO ACCOUNT-NO OF ACCOUNT-CONTRACT,
594600200420      *                             pi_AwdtAccountNo.
594700200420      *    MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS
594800200420      *                     TO CONTRACT-NO OF ACCOUNT-CONTRACT
594900200420      *    START ACCOUNT-CONTRACT
595000200420      *    KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
595100200420      *    INVALID KEY
595200200420      *      GO TO VSIR-EXIT
595300200420      *    END-START.
595400200420      *
595500200420      *    READ ACCOUNT-CONTRACT NEXT RECORD
595600200420      *    WITH NO LOCK
595700200420      *    AT END
595800200420      *      GO TO VSIR-EXIT
595900200420      *    END-READ.
596000200420      *    MOVE CONTRACT-NO OF ACCOUNT-CONTRACT
596100200420      *         TO  pi_AwdtContractNo.
596200200420      *    CALL "FXSEGMGCD" USING pi_AwdtAccountNo
596300200420      *                           pi_AwdtContractNo
596400200420      *                           li_MGCDDate.
596500200420      *
596600200420      *    IF  (li_MGCDDate > TRADE-DATE OF TRANS AND
596700200420      *          MAX-WITHDRAWAL-AMT OF ACCOUNT-CONTRACT > 0)
596800200420      *         CALL "FXSUMAWDT" USING pi_AwdtAccountNo,
596900200420      *                                pi_AwdtContractNo,
597000200420      *                                pc_Awdtmode,
597100200420      *                                pi_AwdtEndDate,
597200200420      *                                pi_AwdtAmount,
597300200420      *                                pc_AwdtIndependentGDV
597400200420      *         COMPUTE  lc_Awdtwithdrawsum = pi_AwdtAmount +
597500200420      *                                 Gross-Amt OF TRANS
597600200420      *
597700200420      *         IF  lc_Awdtwithdrawsum >
597800200420      *                     MAX-WITHDRAWAL-AMT OF ACCOUNT-CONTRACT
597900200420      *                 MOVE lnc_S57 TO REJECTION-CODE OF TRANS
598000200420      *         END-IF
598100200420      *    END-IF.
598200200420      * RFS128950 - End
598300200420      * RFS128950 - Start
598400200420130780      IF lc_GuarBenEligibleDate NOT = SPACES
598500200420130780          MOVE  lc_GuarBenEligibleDate    TO
598600200420130780                li_GuarBenEligibleDate
598700200420130780      ELSE
598800200420130780          MOVE  0 TO li_GuarBenEligibleDate
598900200420130780      END-IF.
599000200420130780      IF li_GuarBenEligibleDate > 0
599100200420
599200200420                INITIALIZE pi_PlacementDte
599300200420130780                     pi_TransNum
599400200420
599500200420                MOVE PLACEMENT-DATE OF TRANS
599600200420                                       TO pi_PlacementDte
599700200420                MOVE TRANS-NO OF TRANS
599800200420                                       TO pi_TransNum
599900200420
600000200420                CALL "FXSEGEXVA" USING pi_PlacementDte
600100200420                                       pi_TransNum
600200200420                                       pi_AwdtAmount
600300200420130780                                 pc_AwdtRejection
600400200420
600500200420
600600200420                IF pc_AwdtRejection  = "S57"
600700200420                        MOVE lnc_S57 TO REJECTION-CODE OF TRANS
600800200420                END-IF
600900200420      * RFS128950 -End
601000200420130780      END-IF.
601100200420
601200200420      * RFS120931 - END
601300200420
601400200420           IF (PLACEMENT-DATE OF TRANS IS NOT EQUAL
601500200420           PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS) OR
601600200420           TRANS-NO OF TRANS IS NOT EQUAL
601700200420           TRANS-NO OF TRANS-CONTRACT-DETAILS
601800200420             GO TO VSIR-EXIT
601900200420           END-IF.
602000200420
602100200420           MOVE ACCOUNT-NO OF TRANS
602200200420                               TO ACCOUNT-NO
602300200420                               OF ACCOUNT-CONTRACT-INVESTMENT.
602400200420
602500200420           MOVE INVESTMENT-CODE OF TRANS
602600200420                               TO INVESTMENT-CODE
602700200420                               OF ACCOUNT-CONTRACT-INVESTMENT.
602800200420
602900200420           MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS
603000200420                               TO CONTRACT-NO
603100200420                               OF ACCOUNT-CONTRACT-INVESTMENT.
603200200420
603300200420           READ ACCOUNT-CONTRACT-INVESTMENT
603400200420           WITH NO LOCK
603500200420           INVALID KEY
603600200420             MOVE "59"         TO REJECTION-CODE OF TRANS
603700200420             GO TO VSIR-EXIT
603800200420           END-READ.
603900200420
604000200420           SUBTRACT OUTSTANDING-REDEMPTION-BALANCE
604100200420                    OF ACCOUNT-CONTRACT-INVESTMENT
604200200420               FROM CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
604300200420             GIVING WS-SEG-UNITS-AVAILABLE.
604400200420
604500200420           IF WS-SEG-UNITS-AVAILABLE
604600200420           IS LESS THAN UNIT-AMT OF TRANS
604700200420             MOVE "11"         TO REJECTION-CODE OF TRANS
604800200420             GO TO VSIR-EXIT
604900200420           END-IF.
605000200420
605100200420           MOVE TRANS-CONTRACT-DETAILS-REC
605200200420                             TO WS-TRANS-CONTRACT-DETAILS.
605300200420           MOVE ACCOUNT-CONTRACT-INVEST-REC
605400200420                             TO WS-ACCOUNT-CONTRACT-INVESTMENT
605500200420           MOVE "Y"          TO WS-REQ-INDIV-CONTRACT.
605600200420
605700200420      * RFS96081 Start
605800200420      *    IF REDEMPTION-TRANSACTION AND SPLIT-OPTION-CODE OF
605900200420      *    TRANS NOT EQUAL "A" AND lncc_EWACDYes AND
606000200420      *    (REJECTION-CODE OF TRANS-REC = "00" OR SPACES)
606100200420      *         PERFORM CheckEWAAmount
606200200420      *    END-IF.
606300200420      * RFS96081 End
606400200420
606500200420      * RFS130780 - Start
606600200420       VSIR-EXIT0.
606700200420           IF lb_ValidKeyFlagYes
606800200420
606900200420            IF lc_GuarBenEligibleDate NOT = SPACES
607000200420                MOVE  lc_GuarBenEligibleDate    TO
607100200420                      li_GuarBenEligibleDate
607200200420            ELSE
607300200420                MOVE  0 TO li_GuarBenEligibleDate
607400200420            END-IF
607500200420
607600200420             IF li_GuarBenEligibleDate > 0
607700200420
607800200420                INITIALIZE pi_PlacementDte
607900200420                           pi_TransNum
608000200420
608100200420                MOVE PLACEMENT-DATE OF TRANS
608200200420                                       TO pi_PlacementDte
608300200420                MOVE TRANS-NO OF TRANS
608400200420                                       TO pi_TransNum
608500200420
608600200420                CALL "FXSEGEXVA" USING pi_PlacementDte
608700200420                                       pi_TransNum
608800200420                                       pi_AwdtAmount
608900200420                                       pc_AwdtRejection
609000200420
609100200420                IF pc_AwdtRejection  = "S57"
609200200420                        MOVE lnc_S57 TO REJECTION-CODE OF TRANS
609300200420                END-IF
609400200420
609500200420             END-IF
609600200420           END-IF.
609700200420
609800200420      * RFS130780 - End
609900200420       VSIR-EXIT.
610000200420           EXIT.
610100200420      /
610200200420      *RFS 16812 Begin
610300200420      ******************************************************************
610400200420      *                                                                *
610500200420      *    D E T E R M I N E  I F  S E G F U N D  S W O                *
610600200420      *                                                                *
610700200420      ******************************************************************
610800200420       DETERMINE-IF-SEGFUND-SWO SECTION.
610900200420
611000200420           MOVE PLACEMENT-DATE  OF TRANS
611100200420           TO WS-SAVE-STDF-PLACEMENT-DATE.
611200200420
611300200420           MOVE TRANS-NO        OF TRANS
611400200420           TO WS-SAVE-STDF-TRANS-NO.
611500200420
611600200420           MOVE INVESTMENT-CODE OF TRANS
611700200420           TO   INVESTMENT-CODE OF INVESTMENT-2.
611800200420
611900200420           READ INVESTMENT-2
612000200420           KEY IS EXTERNALLY-DESCRIBED-KEY
612100200420           INVALID KEY
612200200420             GO TO DISS-EXIT
612300200420           END-READ.
612400200420
612500200420           IF PRODUCT-TYPE-CODE OF INVESTMENT-2 = "SEG"
612600200420               MOVE "Y" TO WS-SEGFUND-SWO
612700200420           ELSE
612800200420               MOVE "N" TO WS-SEGFUND-SWO
612900210724           END-IF.
613000210724
613100210722      *RFS1116166 Start
613200210724           IF SWO-IS-A-SEGFUND AND lb_AccountLevelGLWBYes
613300210724             INITIALIZE  pi_CAccountNo,
613400210724                      pd_CPlacementDate, pi_CTransNo,
613500210712                      pc_CInvestCode, pd_CTradeDate,
613600210724                      pc_CContractFlag, pc_CContractMatch
613700210712
613800210712
613900210724             MOVE ACCOUNT-NO OF TRANS     TO pi_CAccountNo
614000210724             MOVE PLACEMENT-DATE OF TRANS TO pd_CPlacementDate
614100210724             MOVE TRANS-NO OF TRANS       TO pi_CTransNo
614200210724             MOVE INVESTMENT-CODE OF TRANS TO pc_CInvestCode
614300210724             MOVE TRADE-DATE OF TRANS     TO pd_CTradeDate
614400210724
614500210724             CALL "FXVALCONT" USING pi_CAccountNo
614600210712                                  pd_CPlacementDate
614700210712                                  pi_CTransNo
614800210712                                  pd_CTradeDate
614900210712                                  pc_CInvestCode
615000210712                                  pi_CContractNo
615100210712                                  pc_CContractFlag
615200210724                                  pc_CContractMatch
615300210712
615400210724             IF pc_CContractFlag = "X"
615500210724               MOVE "N" TO WS-SEGFUND-SWO
615600210724             END-IF
615700210724           END-IF.
615800210722      *RFS1116166 End
615900200420       DISS-EXIT.
616000200420           EXIT.
616100200420      *RFS 16812 End
616200200420      /
616300200420      * RFS 32873 Start.
61640020042032873  Check-WO-Trans-In-Same-Acct Section.
61650020042032873      MOVE lnc_EditCode1ACCONScreenCode
61660020042032873        TO pc_FunctionToProcess.
61670020042032873      MOVE Account-No OF Trans TO pi_AccountNo.
61680020042032873      MOVE Investment-Code OF Trans TO pc_InvestmentCode.
61690020042032873      MOVE Trade-Date OF Trans TO pi_TradeDate.
617000200420      * RFS64263 - Begin: added new parameters
617100200420           MOVE reversal-code   OF Trans TO pc_ReversalCode
617200200420           MOVE placement-date  OF Trans TO pi_placementDate
617300200420           MOVE trans-no        OF Trans TO pi_transNo
617400200420      * RFS64263 - End
617500200420
617600200420
617700200420R81399     MOVE Zeroes    TO pi_AccountOther.
617800200420R81399     MOVE Spaces    TO pc_InvestmentOther.
617900200420
618000200420      *RFS139286 - Start
618100200420           IF lb_POANInvestYes
618200200420              MOVE lncc_ProcessAnnuity
618300200420                     TO pc_FunctionToProcess
618400200420              MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-SPIA
618500200420                     TO pi_AccountOther
618600200420           END-IF.
618700200420      *RFS139386 - End
618800200420
61890020042032873      CALL "FXCHKSEGAT" USING pc_FunctionToProcess,
61900020042032873                              pi_InvestorNo,
61910020042032873                              pi_AccountNo,
61920020042032873                              pc_InvestmentCode,
61930020042032873                              pi_TradeDate,
61940020042032873                              pi_SystematicPlanSeqNo,
61950020042032873                              pi_InstructionDate,
61960020042032873                              pi_InstructionNo,
619700200420      * RFS64263 - Begin: added new parameters
619800200420                                   pc_ReversalCode,
619900200420                                   pi_placementDate,
620000200420                                   pi_transNo,
620100200420      * RFS64263 - End
62020020042032873                              pc_SegAttReturnMessage,
62030020042032873                              pc_SegAttReturnCode,
620400200420R81399                             pi_AccountOther,
620500200420R81399                             pc_InvestmentOther.
620600200420
620700200420
62080020042032873      IF pncc_SegAttReturnCodeFail
620900200420      * RFS64263 - Begin: added new rejection code for younger annuit.
621000200420            IF pncc_SegAttYoungerAnnuit
621001210929      *RFS1120699 Starts
621002210929            AND NOT (ENTERED-BY    OF TRANS IS EQUAL "SEGGENGPP"
621003210929                     AND TRANS-TYPE-CODE OF TRANS IS EQUAL "BAJ")
621004210929      *RFS1120699 Ends
621100200420              MOVE "63" TO Rejection-Code OF Trans
621200200420      * RFS64263 - End
621300200420            ELSE
62140020042032873         MOVE "04" TO Rejection-Code OF Trans
621500200420      * RFS64263 - Begin
621600200420            END-IF
621700200420      * RFS64263 - End
62180020042032873      END-IF.
621900200420      * RFS 32873 End.
622000200420      /
622100200420      * RFS 33574 begin.
622200200420       Popu-Contract-Invest Section.
622300200420           MOVE PLACEMENT-DATE   OF TRANS
622400200420             TO   PLACEMENT-DATE   OF TRANS-CONTRACT-DETAILS.
622500200420
622600200420           MOVE TRANS-NO       OF TRANS
622700200420             TO   TRANS-NO         OF TRANS-CONTRACT-DETAILS.
622800200420
622900200420           MOVE ZEROES       TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
623000200420
623100200420           START TRANS-CONTRACT-DETAILS
623200200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
623300200420           INVALID KEY
623400200420             INITIALIZE MFATRCODP OF TRANS-CONTRACT-DETAILS-REC
623500200420             MOVE PLACEMENT-DATE   OF TRANS
623600200420             TO   PLACEMENT-DATE   OF TRANS-CONTRACT-DETAILS
623700200420
623800200420             MOVE TRANS-NO       OF TRANS
623900200420             TO   TRANS-NO         OF TRANS-CONTRACT-DETAILS
624000200420           END-START.
624100200420
624200200420           READ TRANS-CONTRACT-DETAILS NEXT RECORD
624300200420           WITH NO LOCK
624400200420           AT END
624500200420             INITIALIZE MFATRCODP OF TRANS-CONTRACT-DETAILS-REC
624600200420             MOVE PLACEMENT-DATE   OF TRANS
624700200420             TO   PLACEMENT-DATE   OF TRANS-CONTRACT-DETAILS
624800200420
624900200420             MOVE TRANS-NO       OF TRANS
625000200420             TO   TRANS-NO         OF TRANS-CONTRACT-DETAILS
625100200420           NOT AT END
625200200420             CONTINUE
625300200420           END-READ.
625400200420           IF PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS =
625500200420              PLACEMENT-DATE OF TRANS  AND
625600200420              TRANS-NO       OF TRANS-CONTRACT-DETAILS =
625700200420              TRANS-NO       OF TRANS
625800200420              CONTINUE
625900200420           ELSE
626000200420             INITIALIZE MFATRCODP OF TRANS-CONTRACT-DETAILS-REC
626100200420           END-IF.
626200200420       PCI-0010.
626300200420           MOVE "R"          TO WRITE-ACCOUNT-CONTRACT-INV.
626400200420
626500200420           MOVE ACCOUNT-NO OF TRANS
626600200420                             TO ACCOUNT-NO
626700200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
626800200420           MOVE INVESTMENT-CODE OF TRANS
626900200420                             TO INVESTMENT-CODE
627000200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
627100200420           MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS
627200200420                             TO CONTRACT-NO
627300200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
627400200420
627500200420           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
627600200420              INVALID KEY
627700200420                INITIALIZE MFAACCCIP OF WS-ACCOUNT-CONTRACT-INVESTMENT
627800200420                MOVE ACCOUNT-NO OF TRANS
627900200420                             TO ACCOUNT-NO
628000200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT
628100200420                MOVE INVESTMENT-CODE OF TRANS
628200200420                             TO INVESTMENT-CODE
628300200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT
628400200420                MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS
628500200420                             TO CONTRACT-NO
628600200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT
628700200420                MOVE PASS-PROCESS-DATE-9
628800200420                             TO CREATION-DATE
628900200420                             OF WS-ACCOUNT-CONTRACT-INVESTMENT
629000200420                MOVE "W"        TO WRITE-ACCOUNT-CONTRACT-INV
629100200420              NOT INVALID KEY
629200200420                MOVE ACCOUNT-CONTRACT-INVEST-REC
629300200420                             TO WS-ACCOUNT-CONTRACT-INVESTMENT
629400200420                MOVE "R"        TO WRITE-ACCOUNT-CONTRACT-INV
629500200420           END-READ.
629600200420       PCI-EXIT.
629700200420           EXIT.
629800200420      * RFS 33574 End.
629900200420
63000020042040942  CheckIfInvIsGLWBInv.
63010020042056974      MOVE 'N' TO lc_GlwbInvestment.
63020020042040942      INITIALIZE MFAINVSGP OF INVESTMENT-SEG-REC.
63030020042040942      MOVE Investment-Code OF TRANS
63040020042040942        TO Investment-Code OF INVESTMENT-SEG.
630500200420
63060020042040942      READ INVESTMENT-SEG
63070020042040942           INVALID KEY CONTINUE
63080020042040942      END-READ.
630900200426      *RFS185170 - Begin
631000200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
631100200426                                   lb_AccountLevelGLWBYes
631200200426              MOVE ACCOUNT-NO      OF TRANS
631300200426                TO pi_ACCGLWBD_AccNo
631400200426              MOVE INVESTMENT-CODE OF TRANS
631500200426                TO pc_ACCGLWBD_InvCode
631600200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
631700200426              PERFORM GetAccGLWBDetails
631800200426              IF pc_ACCGLWBD_Series NOT = SPACES
631900200426                 MOVE pc_ACCGLWBD_Series
632000200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
632100200426              END-IF
632200200426           END-IF.
632300200420           MOVE ACCOUNT-NO OF TRANS TO pi-AccountNo.
632400200420      *RFS185170 - End
632500200420
63260020042046707      PERFORM CheckGLWBRules.
632700200420
63280020042050474      IF Investment-Series OF Investment-Seg NOT = SPACE
63290020042055414         AND pc-InvestmentSeriesFlag = "Y"
63300020042055414 ** Now FXGLWBRULE set the flag above to Y when Series_Type = GLWB
63310020042056974 * 56495 li-EligibleStartDftAge not = 0
63320020042050474         Move "Y" TO lc_GlwbInvestment
63330020042050474      END-IF.
633400200420
63350020042056471  CheckIfInvIsSPIAInv.
633600200420  |        SET lb_SPIAInvestNo  TO TRUE
633700200420  |        INITIALIZE MFAINVSGP OF INVESTMENT-SEG-REC
633800200420  |        MOVE Investment-Code OF TRANS
633900200420  |          TO Investment-Code OF INVESTMENT-SEG
634000200420  |
634100200420  |        READ INVESTMENT-SEG
634200200420  |             INVALID KEY CONTINUE
634300200420  |        END-READ.
634400200426      *RFS185170 - Begin
634500200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
634600200426                                   lb_AccountLevelGLWBYes
634700200426              MOVE ACCOUNT-NO      OF TRANS
634800200426                TO pi_ACCGLWBD_AccNo
634900200426              MOVE INVESTMENT-CODE OF TRANS
635000200426                TO pc_ACCGLWBD_InvCode
635100200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
635200200426              PERFORM GetAccGLWBDetails
635300200426              IF pc_ACCGLWBD_Series NOT = SPACES
635400200426                 MOVE pc_ACCGLWBD_Series
635500200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
635600200426              END-IF
635700200420           END-IF.
635800200420      *RFS185170 - End
635900200420
636000200420  |
636100200420  |        PERFORM CheckSPIARules.
636200200420  |        IF lc_SeriesType = "SPIA"
636300200420  |           SET lb_SPIAInvestYes TO TRUE
636400200420  |        END-IF.
636500200420  |
636600200420  |    CheckSPIARules.
636700200420  |        IF Investment-Series OF Investment-Seg NOT = SPACE AND
636800200420  |                             NOT = lc_SaveSPInvSeries
636900200420  |           MOVE Investment-Series OF Investment-Seg
637000200420  |                TO pc_passSpiaInvestmentSeries
637100200420  |           PERFORM CallFXSPIARULE
637200200420  |           MOVE Investment-Series OF Investment-Seg
637300200420  |             TO lc_SaveSPInvSeries
637400200420  |        END-IF.
637500200420  |
637600200420  |    CallFXSPIARULE.
637700200420  |        MOVE SPACES TO pc_retnSpiaSeriesRules,
637800200420  |                       pc_retnSpiaSeriesRulesRed,
637900200420  |                       lc_SeriesType.
638000200420  |        CALL "FXSPIARULE" USING pc_passSpiaInvestmentSeries
638100200420  |                                pc_retnSpiaSeriesRules
638200200420  |                                pc_retnSpiaErrCode.
638300200420  |        MOVE pc_AllowMultipleContracts  TO lc_AllowMultipleContracts
638400200420  |        MOVE pc_SeriesType              TO lc_SeriesType.
63850020042056471 *RFS56471 ends
638600200420
63870020042046707  CheckGLWBRules.
63880020042046707      IF Investment-Series OF Investment-Seg NOT = SPACE AND
63890020042046707         Investment-Series OF Investment-Seg NOT =
63900020042046707         lc_SaveInvSeries
63910020042046707         MOVE Investment-Code OF Investment-Seg
63920020042046707           TO pc-InvestmentCode
63930020042046707         MOVE SPACES TO pc-InvestmentSeriesCode
63940020042056471         MOVE SPACES TO pc-InvestmentSeriesFlag
63950020042046707         PERFORM CallFXGLWBRULE
63960020042046707         MOVE Investment-Series OF Investment-Seg
63970020042046707           TO lc_SaveInvSeries
63980020042046707      END-IF.
639900200420
64000020042040942  CALLFxglwbvldPurchase.
64010020042040942      INITIALIZE pi_GLWBVldAccountNo,
64020020042040942                 pi_GLWBVldContractNo,
64030020042040942                 pc_GLWBVldYearEndFlag.
640400200420
64050020042040942      MOVE Placement-Date OF TRANS TO pi_GLWBVldPlacementDate.
64060020042040942      MOVE Trans-No OF TRANS TO pi_GLWBVldTransNo.
64070020042040942      MOVE Ws-Contract-Match TO pc_GLWBVldContMatchFlag.
640800200420
64090020042040942      PERFORM CALLFxglwbvld.
641000200420
64110020042040942      IF NOT pb_GLWBVldRejectionOK
64120020042040942         MOVE pc_GLWBVldRejectionCode
64130020042040942           TO Rejection-Code OF TRANS
64140020042040942      END-IF.
641500200420
64160020042040942      IF pb_GLWBVldRejectionOK AND
64170020042077813         Not CONTRACTED AND Not UNCONFIRMED AND
64180020042040942         pb_GLWBVldInitPurchaseYes
641900200420      *RFS185169 Starts
642000200420              PERFORM SetGLWBIn
64210020052940942 *       PERFORM PopulateAccountContractGLWB
642200200529              PERFORM PopulateAccountContractGLWB
642300200420              PERFORM SetGLWBOutValues
642400200420      *RFS185169 Ends
64250020042040942      END-IF.
642600200420      *RFS107679 - START
642700200420           IF pb_GLWBVldRejectionOK AND
642800200420              Not CONTRACTED AND Not UNCONFIRMED AND
642900200420              pb_GLWBVldInitPurchaseYes
643000200420              AND NOT lc_FlagCallFXCNTMATAGYes
643100200420              MOVE ACCOUNT-NO OF WS-ACCOUNT-CONTRACT
643200200420                   TO pi-MATAGAccountNo
643300200420              MOVE CONTRACT-NO OF WS-ACCOUNT-CONTRACT
643400200420                   TO pi-MATAGContractNo
643500200420              MOVE Contract-Prov OF Ws-Account-Contract
643600200420                   TO pc-MATAGProvinceCode
643700200420              MOVE Investment-Code OF Trans
643800200420                   TO pc-MATAGInvestmentCode
643900200420              MOVE Zeroes
644000200420                   TO pi-MATAGStartDate
644100200420              PERFORM CallFXCNTMATAG
644200200420              IF pb-MATAGNoRejection AND pc-CMDOverride    = "Y"
644300200420      * RFS118636 - 13.6 Defect 34433 - start
644400200420                 AND NOT SEG-VALIDATION-MODE
644500200420      * RFS118636 - 13.6 Defect 34433 - end
644600200420                 MOVE ACCOUNT-NO OF WS-ACCOUNT-CONTRACT
644700200420                      TO pi_CNTMAGAccountNo
644800200420                 MOVE CONTRACT-NO OF WS-ACCOUNT-CONTRACT
644900200420                      TO pi_CNTMAGContractNo
645000200420                 MOVE li_orgCntMaturity
645100200420                      TO pi_CNTMAGOrgcntmatdate
645200200420                 MOVE  Ws-Maturity-Date
645300200420                      TO pi_CNTMAGCntmatdate
645400200420                 MOVE Trade-date OF Trans
645500200420                      TO pi_CNTMAGTradedate
645600200420                 MOVE ZEROS
645700200420                      TO pi_CNTMAGrejcode
645800200420              PERFORM CallFXORGCNTMAG
645900200420           END-IF.
646000200420      *RFS107679 - END
646100200420
646200200420def11      IF pb_GLWBVldRejectionOK AND
646300200420  ¦           li-EligibleStartDftAge > 0 AND
64640020042077813         Not CONTRACTED AND Not UNCONFIRMED AND
646500200420  ¦           Eligible-Date OF Ws-Account-Contract = 0
646600200420  ¦           COMPUTE Eligible-Date OF Ws-Account-Contract
646700200420  ¦                 = pi_GLWBVldEligDate
646800200420  ¦        END-IF.
646900200420  ¦
647000200420  ¦        IF pb_GLWBVldRejectionOK AND
64710020042077813         Not CONTRACTED AND Not UNCONFIRMED AND
647200200420  ¦           Investment-Series OF Ws-Account-Contract = SPACES
647300200420  ¦           MOVE Investment-Series OF INVESTMENT-SEG
647400200420  ¦             TO Investment-Series OF Ws-Account-Contract
647500200420def11      END-IF.
647600200420
647700200529      *RFS185169 STARTS
647800200529           IF pb_GLWBVldRejectionOK AND
647900200529              li-EligibleStartDftAge > 0 AND
648000200529              Not CONTRACTED AND Not UNCONFIRMED AND
648100200529              Eligible-Date OF Ws-Account-Benefits = 0
648200200529              COMPUTE Eligible-Date OF Ws-Account-Benefits
648300200529                    = pi_GLWBVldEligDate
648400200529           END-IF.
648500200529
648600200529           IF pb_GLWBVldRejectionOK AND
648700200529              Not CONTRACTED AND Not UNCONFIRMED AND
648800200529              Investment-Series OF Ws-Account-Benefits = SPACES
648900200529              MOVE Investment-Series OF INVESTMENT-SEG
649000200529                TO Investment-Series OF Ws-Account-Benefits
649100200529           END-IF.
649200200529      *RFS185169 ENDS
649300200529
64940020042040942  CALLFxglwbvldSell.
64950020042040942      INITIALIZE pi_GLWBVldPlacementDate,
64960020042040942                 pi_GLWBVldTransNo,
64970020042040942                 pc_GLWBVldContMatchFlag.
649800200420      *RFS185169 Starts
649900200501           IF Lb_AccountLevelGlwbYes
650000200420              MOVE Account-NO OF WS-Account-Benefits
650100200420                              TO pi_GLWBVldAccountNo
650200200420              MOVE ZEROS      TO pi_GLWBVldContractNo
650300200420           END-IF.
650400200420
650500200506           IF Lb_AccountLevelGlwbNo
65060020050640942 *    MOVE Account-No OF Account-Contract TO pi_GLWBVldAccountNo.
65070020050640942 *    MOVE Contract-No OF Account-Contract TO pi_GLWBVldContractNo.
65080020050640942 *    SET pb_GLWBVldYearEndNo TO TRUE.
650900200506
651000200506           MOVE Account-No OF Account-Contract TO pi_GLWBVldAccountNo
651100200506           MOVE Contract-No OF Account-Contract TO pi_GLWBVldContractNo
651200200506           SET pb_GLWBVldYearEndNo TO TRUE
651300200506           END-IF.
651400200420      *RFS185169 Ends
651500200420
651600200420
65170020042040942      PERFORM CALLFxglwbvld.
651800200420
65190020042040942  CALLFxglwbvld.
65200020042040942      CALL "FXGLWBVLD" USING pi_GLWBVldPlacementDate
65210020042040942                             pi_GLWBVldTransNo
65220020042040942                             pc_GLWBVldContMatchFlag
65230020042040942                             pi_GLWBVldAccountNo
65240020042040942                             pi_GLWBVldContractNo
65250020042040942                             pc_GLWBVldYearEndFlag
65260020042050474                             pc_GLWBVldInvestCode
652700200420 |                                pi_GLWBVldTradeDate
652800200420 |                                pc_GLWBVldReversalCode
65290020042050474                             pc_GLWBVldSameAcctSwitchFlag
65300020042040942                             pi_GLWBVldEligDate
65310020042040942                             pi_GLWBVldForceDate
65320020042040942                             pn_GLWBVldGWAPercent
65330020042040942                             pi_GLWBVldAnnuitantAge
65340020042040942                             pc_GLWBVldInitPurchaseFlag
65350020042040942                             pc_GLWBVldRejectionCode.
653600200420
65370020042040942  PopulateAccountContractGLWB.
65380020042040942 *46707IF pi_GLWBVldEligDate > 0
65390020042040942 *46707  COMPUTE Eligible-Date OF Ws-Account-Contract
65400020042040942 *46707        = pi_GLWBVldEligDate
65410020042040942 *46707  COMPUTE Force-Date OF Ws-Account-Contract
65420020042040942 *46707        = pi_GLWBVldForceDate
65430020042040942 *46707END-IF.
654400200420
654500200420      *RFS185169 Starts
654600200420
65470020042046707 *    IF li-EligibleStartDftAge > 0 AND
65480020042046707 *       Eligible-Date OF Ws-Account-Contract = 0
65490020042046707 *       COMPUTE Eligible-Date OF Ws-Account-Contract
65500020042046707 *             = pi_GLWBVldEligDate
65510020042046707 *    END-IF.
655200200420
655300200420           IF Li-EligibleStartDftAge > 0 AND Li_EligibleDateIn = 0
655400200420              COMPUTE Li_EligibleDateOut = pi_GLWBVldEligDate
655500200420           END-IF
655600200420
65570020042046707 *    IF li-ForceStartDftAge > 0 AND
65580020042046707 *       Force-Date OF Ws-Account-Contract = 0
65590020042046707 *       COMPUTE Force-Date OF Ws-Account-Contract
65600020042046707 *             = pi_GLWBVldForceDate
65610020042046707 *    END-IF.
656200200420
656300200511           IF li-ForceStartDftAge > 0 AND Li_ForceDateIn = 0
656400200420              COMPUTE Li_ForceDateOut = pi_GLWBVldForceDate
656500200420           END-IF.
656600200420
65670020042046707 *    IF Init-Deposit-Date OF Ws-Account-Contract = 0
65680020042046707 *       COMPUTE Init-Deposit-Date OF Ws-Account-Contract
65690020042046707 *             = Trade-Date OF Trans
65700020042046707 *    END-IF.
657100200420
657200200420           IF Li_InitDepositDateIn =  0
657300200420              COMPUTE Li_InitDepositDateOut = Trade-Date OF Trans
657400200420           END-IF.
657500200420
65760020042046707 *    IF Investment-Series OF Ws-Account-Contract = SPACES
65770020042046707 *       MOVE Investment-Series OF INVESTMENT-SEG
65780020042046707 *         TO Investment-Series OF Ws-Account-Contract
65790020042046707 *    END-IF.
658000200420
658100200420           IF Li_InvestmentSeriesIn = SPACES
658200200420              MOVE Investment-Series OF INVESTMENT-SEG
658300200420                                     TO Li_InvestmentSeriesOut
658400200420           END-IF.
658500200420
658600200420r54566*    IF Guar-withdrawal-percent OF Ws-Account-Contract > 0
658700200420r54566*       COMPUTE ln_InitialPurchaseGWAPercent =
658800200420r54566*               Guar-withdrawal-percent OF Ws-Account-Contract
658900200420r54566*    ELSE
65900020042040942 *    COMPUTE ln_InitialPurchaseGWAPercent
65910020042040942 *          = pn_GLWBVldGWAPercent
659200200505r54566*    END-IF.
659300200420
659400200420           IF Li_GuarWDPercentIn > 0
659500200420              COMPUTE ln_InitialPurchaseGWAPercent =
659600200420                      Li_GuarWDPercentIn
659700200420           ELSE
659800200420              COMPUTE ln_InitialPurchaseGWAPercent =
659900200420                      pn_GLWBVldGWAPercent
660000200505           END-IF.
660100200420
660200200420      *RFS185169 Ends
660300200505
660400200420      *RFS185169 Starts
660500200420       SetGLWBIn.
660600200504           IF Lb_AccountLevelGlwbYes
660700200504              MOVE Eligible-Date           of Ws-Account-Benefits
660800200504                   TO Li_EligibleDateIn
660900200504                      Li_EligibleDateOut
661000200504              MOVE Force-Date              of Ws-Account-Benefits
661100200504                   TO Li_ForceDateIn
661200200504                      Li_ForceDateOut
661300200504              MOVE Init-Deposit-Date       of Ws-Account-Benefits
661400200504                   TO Li_InitDepositDateIn
661500200504                      Li_InitDepositDateOut
661600200504              MOVE Investment-Series       of Ws-Account-Benefits
661700200504                   TO Li_InvestmentSeriesIn
661800200504                      Li_InvestmentSeriesOut
661900200420              MOVE Guar-withdrawal-percent of Ws-Account-Benefits
662000200504                   TO Li_GuarWDpercentIn
662100200929      *RFS1104547 Starts
662200200929                      Li_GuarWDPercentOut
662300200929      *RFS1104547 Ends
662400200504              MOVE Guar-Withdrawal-Amount  of Ws-Account-Benefits
662500200504                   TO Li_GuarWDAmountIn
662600200504                      Li_GuarWDAmountOut
662700200504              MOVE GWA-Start-Date          of Ws-Account-Benefits
662800200504                   TO LI_GWASTARTDATEIN
662900200504                      LI_GWASTARTDATEOUT
663000200504              MOVE YTD-Excess-Withdrawal   of Ws-Account-Benefits
663100200504                   TO LI_YTDEXCESSWDIN
663200200504                      LI_YTDEXCESSWDOUT
663300200504              MOVE YTD-Guar-Withdrawal-Amount of Ws-Account-Benefits
663400200504                   TO LI_YTDGUARWDAMOUNTIN
663500200420                      LI_YTDGUARWDAMOUNTOUT
663600200420           ELSE
663700200504              MOVE Eligible-Date of Ws-Account-Contract
663800200504                   TO Li_EligibleDateIn
663900200420                      Li_EligibleDateOut
664000200504              MOVE Force-Date        of Ws-Account-Contract
664100200504                   TO Li_ForceDateIn
664200200420                      Li_ForceDateOut
664300200504              MOVE Init-Deposit-Date of Ws-Account-Contract
664400200504                   TO Li_InitDepositDateIn
664500200420                      Li_InitDepositDateOut
664600200504              MOVE Investment-Series of Ws-Account-Contract
664700200504                   TO Li_InvestmentSeriesIn
664800200420                      Li_InvestmentSeriesOut
664900200420              MOVE Guar-withdrawal-percent of Ws-Account-Contract
665000200420                   TO Li_GuarWDPercentIn
665100200929      *RFS1104547 Starts
665200200929                      Li_GuarWDPercentOut
665300200929      *RFS1104547 Ends
665400200504              MOVE Guar-Withdrawal-Amount of Ws-Account-Contract
665500200504                   TO Li_GuarWDAmountIn
665600200504                      Li_GuarWDAmountOut
665700200504              MOVE GWA-Start-Date          of Ws-Account-Contract
665800200504                   TO LI_GWASTARTDATEIN
665900200504                      LI_GWASTARTDATEOUT
666000200504              MOVE YTD-Excess-Withdrawal   of Ws-Account-Contract
666100200504                   TO LI_YTDEXCESSWDIN
666200200504                      LI_YTDEXCESSWDOUT
666300200504              MOVE YTD-Guar-Withdrawal-Amount of Ws-Account-Contract
666400200504                   TO LI_YTDGUARWDAMOUNTIN
666500200420                      LI_YTDGUARWDAMOUNTOUT
666600200420           END-IF.
666700200420
666800200420       SetGLWBOutValues.
666900200420           IF Lb_AccountLevelGlwbYes
667000200420              MOVE Li_EligibleDateOUT
667100200420                   TO Eligible-Date           of Ws-Account-Benefits
667200200420              MOVE Li_ForceDateOut
667300200420                   TO Force-Date              of Ws-Account-Benefits
667400200420              MOVE Li_InitDepositDateOut
667500200420                   TO Init-Deposit-Date       of Ws-Account-Benefits
667600200420              MOVE Li_InvestmentSeriesOut
667700200506                   TO Investment-Series       of Ws-Account-Benefits
667800200506              MOVE Li_GuarWDPercentOut
667900200506                   TO Guar-Withdrawal-Percent of Ws-Account-Benefits
668000200504              MOVE LI_GuarWDAmountOut
668100200504                   TO Guar-Withdrawal-Amount  of Ws-Account-Benefits
668200200504              MOVE LI_GWASTARTDATEOUT
668300200504                   TO GWA-Start-Date          of Ws-Account-Benefits
668400200504              MOVE LI_YTDEXCESSWDOUT
668500200504                   TO YTD-Excess-Withdrawal   of Ws-Account-Benefits
668600200504              MOVE LI_YTDGUARWDAMOUNTOUT
668700200420                TO YTD-Guar-Withdrawal-Amount of Ws-Account-Benefits
668800200420           ELSE
668900200420              MOVE Li_EligibleDateOUT
669000200420                   TO Eligible-Date           of Ws-Account-Contract
669100200420              MOVE Li_ForceDateOut
669200200420                   TO Force-Date              of Ws-Account-Contract
669300200420              MOVE Li_InitDepositDateOut
669400200420                   TO Init-Deposit-Date       of Ws-Account-Contract
669500200420              MOVE Li_InvestmentSeriesOut
669600200506                   TO Investment-Series       of Ws-Account-Contract
669700200506              MOVE Li_GuarWDPercentOut
669800200504                   TO Guar-Withdrawal-Percent of Ws-Account-Contract
669900200504              MOVE LI_GUARWDAMOUNTOUT
670000200504                   TO Guar-Withdrawal-Amount  of Ws-Account-Contract
670100200504              MOVE LI_GWASTARTDATEOUT
670200200504                   TO GWA-Start-Date          of Ws-Account-Contract
670300200504              MOVE LI_YTDEXCESSWDOUT
670400200504                   TO YTD-Excess-Withdrawal   of Ws-Account-Contract
670500200504              MOVE LI_YTDGUARWDAMOUNTOUT
670600200420                TO YTD-Guar-Withdrawal-Amount of Ws-Account-Contract
670700200420           END-IF.
670800200420      *RFS185169 Ends
670900200420
67100020042040942  UpdateGLWBBucketSell.
67110020042040942      IF Wire-Order-Flag OF TRANS = lncc_Y
67120020042040942         MOVE Trans-Contract-Details-Rec
67130020042040942           TO Ws-Trans-Contract-Details
67140020042040942      END-IF.
671500200420
671600200420      *RFS185169 Starts
67170020042040942 *    PERFORM ReadAccountContractForGLWB.
671800200420
67190020042046707 *    IF li-EligibleStartDftAge > 0
67200020042040942 *    EVALUATE TRUE
67210020042040942 *        WHEN Guar-Withdrawal-Amount OF Account-Contract = 0
67220020042040942 *             COMPUTE YTD-Excess-Withdrawal OF Account-Contract
67230020042040942 *                   = YTD-Excess-Withdrawal OF Account-Contract
67240020042040942 *                   + Gross-Amt OF TRANS
67250020042040942 *             COMPUTE Guar-Withdrawal-Excess OF
67260020042040942 *                     Ws-Trans-Contract-Details
67270020042040942 *                   = Gross-Amt OF TRANS
67280020042040942 *             COMPUTE Guar-Withdrawal-Amount OF
67290020042040942 *                     Ws-Trans-Contract-Details
67300020042040942 *                   = 0
67310020042040942 *        WHEN Gross-Amt OF TRANS <=
67320020042040942 *            (Guar-Withdrawal-Amount OF Account-Contract -
67330020042040942 *             YTD-Guar-Withdrawal-Amount OF Account-Contract)
67340020042040942 *             COMPUTE YTD-Guar-Withdrawal-Amount OF
67350020042040942 *                     Account-Contract
67360020042040942 *                   = YTD-Guar-Withdrawal-Amount OF
67370020042040942 *                     Account-Contract
67380020042040942 *                   + Gross-Amt OF TRANS
67390020042040942 *             COMPUTE Guar-Withdrawal-Amount OF
67400020042040942 *                     Ws-Trans-Contract-Details
67410020042040942 *                   = Gross-Amt OF TRANS
67420020042040942 *             COMPUTE Guar-Withdrawal-Excess OF
67430020042040942 *                     Ws-Trans-Contract-Details
67440020042040942 *                   = 0
67450020042040942 *        WHEN OTHER
67460020042040942 *             COMPUTE Guar-Withdrawal-Amount OF
67470020042040942 *                     Ws-Trans-Contract-Details
67480020042040942 *                   = Guar-Withdrawal-Amount OF Account-Contract
67490020042040942 *                   - YTD-Guar-Withdrawal-Amount OF
67500020042040942 *                     Account-Contract
67510020042040942 *             COMPUTE Guar-Withdrawal-Excess OF
67520020042040942 *                     Ws-Trans-Contract-Details
67530020042040942 *                  =  Gross-Amt OF TRANS
67540020042040942 *                  -  Guar-Withdrawal-Amount OF
67550020042040942 *                     Ws-Trans-Contract-Details
67560020042040942 *             COMPUTE YTD-Excess-Withdrawal OF Account-Contract
67570020042040942 *                  =  YTD-Excess-Withdrawal OF Account-Contract
67580020042040942 *                  +  Guar-Withdrawal-Excess OF
67590020042040942 *                     Ws-Trans-Contract-Details
67600020042040942 *             COMPUTE YTD-Guar-Withdrawal-Amount OF
67610020042040942 *                     Account-Contract
67620020042040942 *                   = Guar-Withdrawal-Amount OF Account-Contract
67630020042040942 *    END-EVALUATE
67640020042046707 *    END-IF.
676500200420      *
67660020042040942 *    IF Trade-Date OF TRANS >= Eligible-Date OF Account-Contract
67670020042040942 *                                                             AND
67680020042040942 *       Guar-Withdrawal-Percent OF Account-Contract = 0
67690020042046707 *       AND pc-GLWARateLockingRule = lnci_Rule1
67700020042040942 *       PERFORM CALLFxglwbvldSell
67710020042040942 *       MOVE pn_GLWBVldGWAPercent
67720020042040942 *         TO Guar-Withdrawal-Percent OF Account-Contract
67730020042040942 *    END-IF.
677400200420      *
67750020042040942 *    IF GWA-Start-Date OF Account-Contract = 0 AND
67760020042040942 *       Trade-Date OF TRANS >= Eligible-Date OF Account-Contract
67770020042040942 *                                                             AND
67780020042040942 *       Guar-Withdrawal-Amount OF Ws-Trans-Contract-Details > 0
67790020042046707 *       AND pc-StartDateApplicable = lncc_Y
67800020042040942 *       MOVE Process-Date OF TRANS
67810020042040942 *        TO GWA-Start-Date OF Account-Contract
67820020042040942 *    END-IF.
678300200420      *RFS185169 Ends
678400200420
678500200420      *RFS185169 Starts
678600200420           IF Lb_AccountLevelGlwbYes
678700200420              Perform ReadAccountBenefits
678800200420           END-IF.
678900200420
679000200420           IF Lb_AccountLevelGlwbNo
679100200420              Perform ReadAccountContractForGLWB
679200200429           END-IF.
679300200429
679400200420           Perform SetGLWBIn
679500200824      * RFS 185171 - START
679600200824           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT
679700200824
679800200824           IF EXCLUDE-TRANS-FLAG = lncc_N
679900200420
680000200605           IF li-EligibleStartDftAge > 0
680100200420           Evaluate True
680200200420               WHEN Li_GuarWDAmountIn = 0
680300200624      ************************************************************
680400200624      **** Skip YTD values update when processing more than one
680500200624      **** TRCODP entry per transaction with account level GLWB
680600200624      **** They have been already been updated in 1st TRCODP entry
680700200624      ************************************************************
680800200624                  IF Lb_AccountLevelGlwbYes AND
680900200624                     Wire-Order-Flag OF TRANS NOT = lncc_Y AND
681000200624                     WS-SEG-ARRAY-CTR > 1
681100200824
681200200624                      COMPUTE Li_YTDExcessWDOut = Li_YTDExcessWDIn
681300200624                      COMPUTE Li_GuarWDExcessOut = Li_GuarWDExcessIn
681400200624                      COMPUTE Guar-Withdrawal-Excess OF
681500200624                              Ws-Trans-Contract-Details = 0
681600200624                  ELSE
681700200420                    COMPUTE Li_YTDExcessWDOut  =
681800200420                            Li_YTDExcessWDIn   + Gross-Amt OF TRANS
681900200420                    COMPUTE Li_GuarWDExcessOut =
682000200420                            Li_GuarWDExcessIn  + Gross-Amt OF TRANS
682100200605                    COMPUTE Guar-Withdrawal-Excess OF
682200200605                            Ws-Trans-Contract-Details
682300200605                          = Gross-Amt OF TRANS
682400200624                  END-IF
682500200605                    COMPUTE Guar-Withdrawal-Amount OF
682600200420                            Ws-Trans-Contract-Details = 0
682700200420
682800200420               WHEN Gross-Amt OF TRANS <= (Li_GuarWDAmountIn -
682900200420                            Li_YTDGuarWDAmountIn)
683000200420                    COMPUTE Li_YTDGuarWDAmountout
683100200420                          = Li_YTDGuarWDAmountIn
683200200420                          + Gross-Amt OF TRANS
683300200420                    COMPUTE Li_GuarWDExcessOut =
683400200420                            Li_GuarWDExcessIn  + Gross-Amt OF TRANS
683500200605                    COMPUTE Guar-Withdrawal-Amount OF
683600200605                            Ws-Trans-Contract-Details
683700200605                          = Gross-Amt OF TRANS
683800200605                    COMPUTE Guar-Withdrawal-Excess OF
683900200420                            Ws-Trans-Contract-Details = 0
684000200420               WHEN OTHER
684100210127      *RFS180721 Start
684200210127      *Retain GWA used on trade on below condition
684300210127                    IF NOT (pc-GWBDownAdjustmentRule = lcc_9 AND
684400210127                       Li_YTDGuarWDAmountIn > Li_GuarWDAmountIn)
684500210127      *RFS180721 End
684600200420                    COMPUTE Guar-Withdrawal-Amount OF
684700200420                            Ws-Trans-Contract-Details
684800200420                          = Li_GuarWDAmountIn
684900200420                          - Li_YTDGuarWDAmountIn
685000210127180721              END-IF
685100200624                    IF Lb_AccountLevelGlwbYes AND
685200200624                       Wire-Order-Flag OF TRANS NOT = lncc_Y AND
685300200624                       WS-SEG-ARRAY-CTR > 1
685400200624                         COMPUTE Li_GuarWDExcessOut =
685500200624                                   Li_GuarWDExcessIn
685600200624                         COMPUTE Guar-Withdrawal-Excess OF
685700200624                                 Ws-Trans-Contract-Details = 0
685800200624                         COMPUTE Li_YTDExcessWDOut
685900200624                               = Li_YTDExcessWDIn
686000200624                    ELSE
686100200420                    COMPUTE Li_GuarWDExcessOut
686200200420                          = Gross-Amt OF TRANS
686300200420                          - Guar-Withdrawal-Amount OF
686400200420                            Ws-Trans-Contract-Details
686500200605                    COMPUTE Guar-Withdrawal-Excess OF
686600200605                            Ws-Trans-Contract-Details
686700200605                         =  Gross-Amt OF TRANS
686800200605                         -  Guar-Withdrawal-Amount OF
686900200605                            Ws-Trans-Contract-Details
687000200420                    COMPUTE Li_YTDExcessWDOut
687100200420                          = Li_YTDExcessWDIn
687200200605                          + Guar-Withdrawal-Excess OF
687300200420                            Ws-Trans-Contract-Details
687400200624                    END-IF
687500210127      *RFS180721 Start
687600210127      *Retain GWA used on trade on below condition
687700210127                    IF NOT (pc-GWBDownAdjustmentRule = lcc_9 AND
687800210127                    Li_YTDGuarWDAmountIn > Li_GuarWDAmountIn)
687900210127      *RFS180721 End
688000200420                    COMPUTE Li_YTDGuarWDAmountout
688100200605                          = Li_GuarWDAmountIn
688200210127180721              END-IF
688300200605           End-Evaluate
688400200824           END-IF
688500200605           END-IF.
688600200420
688700200420           IF Trade-Date OF TRANS >= Li_EligibleDateIn AND
688800200420              Li_GuarWDPercentIn = 0 AND
688900200420              pc-GLWARateLockingRule = lnci_Rule1
689000200420              PERFORM CALLFxglwbvldSell
689100200420              MOVE pn_GLWBVldGWAPercent TO Li_GuarWDPercentOut
689200200420           END-IF.
689300200420
689400200420           IF Li_GWAStartdateIn = 0 AND
689500200420              Trade-Date OF TRANS >= Li_EligibleDateIn AND
689600200420             Guar-Withdrawal-Amount OF Ws-Trans-Contract-Details > 0
689700200420              AND pc-StartDateApplicable = lncc_Y
689800200420              MOVE Process-Date OF TRANS TO Li_GWAStartdateOut
689900200420           END-IF.
690000200420
690100200420           PERFORM SetGLWBOutValues
690200200506
690300200506           IF Lb_AccountLevelGlwbYes
690400200506              PERFORM UpdateGLWBBucketAccBenfits
690401210914119109        PERFORM UpdateGLWBBucketTransCon
690500200506           END-IF.
690600200420
690700200420           IF Lb_AccountLevelGlwbNo
690800200420              PERFORM UpdateGLWBBucketAccCon
690900200420              PERFORM UpdateGLWBBucketTransCon
691000200420           END-IF.
691100200420      *RFS185169 Ends
691200200506
691300200506      *RFS185169 Starts
691400200506       UpdateGLWBBucketAccBenfits.
691500200506           REWRITE ACCOUNT-BENEFITS-REC FROM
691600200506                WS-ACCOUNT-BENEFITS
691700200506           INVALID KEY
691800200506              CONTINUE
691900200506           END-REWRITE.
692000200506           IF Ws-File-Status IS NOT EQUAL TO "00"
692100200506              MOVE "ACCOUNT BENEFIST REWRITE"
692200200506                TO Ws-File-Status-File-Name
692300200506              SET lncc_Err254  TO  TRUE
692400200506              PERFORM Log-File-Status
692500200506           END-IF.
692600200506           MOVE SPACES  TO WRITE-ACCOUNT-BENEFITS.
692700200506      *RFS185169 Ends
692800200420
692900200420      *RFS185169 Starts
693000200420       UpdateGLWBBucketAccCon.
693100200420      *RFS185169 Ends
69320020042040942      REWRITE Account-Contract-Rec
693300200624185169     FROM Ws-Account-Contract
69340020042040942              INVALID KEY CONTINUE
69350020042040942      END-REWRITE.
69360020042040942      IF Ws-File-Status IS NOT EQUAL TO "00"
69370020042040942         MOVE "ACCOUNT CONTRACT"
69380020042040942           TO Ws-File-Status-File-Name
69390020042058714         SET lncc_Err254  TO  TRUE
69400020042040942         PERFORM Log-File-Status
69410020042040942      END-IF.
694200200420
694300200420      *RFS185169 Starts
694400200420       UpdateGLWBBucketTransCon.
694500200420      *RFS185169 Ends
69460020042040942      IF Wire-Order-Flag OF TRANS = lncc_Y
69470020042040942         REWRITE Trans-Contract-Details-Rec
69480020042040942         FROM Ws-Trans-Contract-Details
69490020042040942         INVALID KEY
69500020042040942           CONTINUE
69510020042040942         END-REWRITE
69520020042040942         IF Ws-File-Status IS NOT EQUAL TO "00"
69530020042040942            MOVE "TRANS CONT DTLS"
69540020042040942              TO Ws-File-Status-File-Name
69550020042058714            SET lncc_Err255  TO  TRUE
69560020042040942            PERFORM Log-File-Status
69570020042040942         END-IF
69580020042040942      END-IF.
695900200420
69600020042040942  ReadAccountContractForGLWB.
69610020042040942      INITIALIZE MFAACCONP OF Account-Contract-Rec.
696200200420
69630020042040942      MOVE Account-No OF TRANS
69640020042040942        TO Account-No OF Account-Contract.
69650020042040942      MOVE Contract-No OF Ws-Trans-Contract-Details
69660020042040942        TO Contract-No OF Account-Contract.
696700200420
69680020042040942      READ Account-Contract
69690020042040942           INVALID KEY CONTINUE
697000200420      *RFS185169 Starts
697100200420            NOT INVALID KEY
697200200420                MOVE ACCOUNT-CONTRACT-REC TO WS-ACCOUNT-CONTRACT
697300200420      *RFS185169 Ends
69740020042040942      END-READ.
697500200420
697501210914      *RFS1117913 - Starts
697502210914       ReadAccountContractForGLWB1.
697503210914           INITIALIZE MFAACCONP OF Account-Contract-Rec1.
697504210914
697505210914           MOVE Account-No OF TRANS
697506210914             TO Account-No OF Account-Contract1.
697507210914           MOVE Contract-No OF Ws-Trans-Contract-Details
697508210914             TO Contract-No OF Account-Contract1.
697509210914
697510210914           READ Account-Contract1
697511210914                INVALID KEY CONTINUE
697512210914           END-READ.
697513210914      *RFS1117913 - Ends
697514210914
69760020042040942  CheckIfAcctHasGLWBFund.
69770020042040942      INITIALIZE Mfaacconp OF Account-Cont-Age.
69780020042040942      MOVE Account-No OF Trans TO Account-No OF Account-Cont-Age.
69790020042040942      MOVE 0 TO Start-Date OF Account-Cont-Age.
698000200420
69810020042040942      START Account-Cont-Age
69820020042040942      KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
69830020042040942      NOT INVALID KEY
69840020042040942        READ Account-Cont-Age NEXT RECORD
69850020042040942          AT END CONTINUE
69860020042040942        END-READ
69870020042040942      END-START.
698800200420
69890020042040942  CalculateGWAAmount.
69900020042046707      IF pc-InitialDepositProRate = lncc_Y
69910020042046707         PERFORM CalculateGWAAmountProrate
69920020042046707      ELSE
699300200420      * RFS 118472 Begin
699400200420            IF pb-GrossdepositRule
699500200420              COMPUTE ln_GWAAmount ROUNDED
699600200420                     = Gross-Amt OF TRANS *
699700200420                       ln_InitialPurchaseGWAPercent / 100
699800200420            ELSE
699900200420             IF pb-NetDepositRule
700000200420      * RFS 118472 End
70010020042046707         COMPUTE ln_GWAAmount ROUNDED
70020020042046707               = Net-Amt OF TRANS *
70030020042046707                 ln_InitialPurchaseGWAPercent / 100
700400200420118472       END-IF
700500200420118472      END-IF
70060020042046707      END-IF.
700700200420
70080020042046707  CalculateGWAAmountProrate.
70090020042040942      INITIALIZE ln_GWAAmount.
70100020042040942      MOVE Trade-Date OF TRANS TO Ws-Wk-Trade-Date.
701100200420r48630*** begin - removed pro-rating of gwa for initial deposit
701200200420      * RFS 118472 Begin
701300200420           IF pb-GrossDepositRule
701400200420              COMPUTE ln_GWAAmount ROUNDED
701500200420                  = Gross-Amt OF TRANS *
701600200420                   (13 - Ws-Wkt-Month) / 12 *
701700200420                    ln_InitialPurchaseGWAPercent / 100
701800200420           ELSE
701900200420           IF pb-NetDepositRule
702000200420      * RFS 118472 End
70210020042040942      COMPUTE ln_GWAAmount ROUNDED
70220020042040942            = Net-Amt OF TRANS *
702300200420r48630*           (13 - Ws-Wkt-Month) / 12 *
70240020042050474             (13 - Ws-Wkt-Month) / 12 *
702500200420      * RFS 118472 Begin
702600200420r48630*            ln_InitialPurchaseGWAPercent / 100.
702700200420                   ln_InitialPurchaseGWAPercent / 100
702800200420           END-IF
702900200420           END-IF.
703000200420      * RFS 118472 End
703100200420r48630*** end
703200200420
70330020042044930  CheckIfGDVPercentageIsSame.
70340020042044930      MOVE Trans-Origin-Code OF Trans TO Ws-Trans-Origin-88.
703500200420
70360020042044930      IF lnc_origCodeRST
70370020042044930         SET lb_SameGDVPercentYes TO TRUE
70380020042044930      ELSE
70390020042044930         IF lb_DthPercentCalculatedNo
70400020042044930            SET lb_DthPercentCalculatedYes TO TRUE
70410020042044930            INITIALIZE ln_NewGDVPercent
70420020042044930            IF lnc_origCodeMat
704300200420      *RFS158648 Starts*
70440020042044930 *             MOVE Ws-Seg-Array-GDV-Percent(1)
70450020042044930 *               TO ln_NewGDVPercent
70460020042044930 *          ELSE
70470020042044930 *             PERFORM CalculateGDVPercentage
704800200420                    IF TRANS-TYPE-CODE OF TRANS = "BUY"
704900210724      *RFS1115261 Starts
705000210724      *                PERFORM CalculateGDVPercentage
705100210724                       PERFORM GetMATContractGDVPercent
705200210724      *RFS1115261 Ends
705300200420                    ELSE
705400200420                       MOVE Ws-Seg-Array-GDV-Percent(1)
705500200420                         TO ln_NewGDVPercent
705600200420                    END-IF
705700200420      *RFS158648 Ends*
705800200420      *RFS 161489 - Start
705900200420                 ELSE
706000200420                    PERFORM CalculateGDVPercentage
706100200420      *RFS 161489 - End
70620020042044930            END-IF
70630020042044930         END-IF
70640020042044930         PERFORM CompareGDVPercWithExistCont
70650020042044930      END-IF.
706600200420
70670020042044930  CalculateGDVPercentage.
70680020042044930      SET pb_DefaultAnnuit TO TRUE.
70690020042044930      MOVE Account-No OF Trans TO pi_AnnuitAccountNo.
707000200420
70710020042044930      CALL "FXACCANUIT" USING pc_AnnuitFlag,
70720020042044930                              pi_AnnuitAccountNo,
70730020042044930                              pi_AnnuitContractNo,
70740020042044930                              pi_AnnSequenceNo,
70750020042044930                              pc_AnnuitantStatus,
70760020042044930                              pi_DateOfBirth,
70770020042044930                              pc_FirstName,
70780020042044930                              pc_LastName,
707900200420      * RFS55414 - Begin: added new returned parameters
708000200420                                   pi_socialInsuranceNo,
708100200420                                   pc_sex,
708200200420      * RFS55414 - End
70830020042044930                              pc_AnnuitReturnCode.
708400200420
70850020042044930      IF pi_DateOfBirth > 0
708600210806      *RFS187471 Starts
708700210806           IF lb_EditCodeTGDVSetupYes
70880020042044930         PERFORM CalcAnnuitantAge
708900210806           ELSE
709000210806              PERFORM CalcAnnuitantAgeUsingDthSched
709100210806                 thru CAADS-EXIT
709200210806           END-IF
709300210806      *RFS187471 End
70940020042044930      ELSE
70950020042044930         INITIALIZE li_AnnuitantAge
709600200420173241        MOVE "S02" TO Rejection-Code OF TRANS
70970020042044930      END-IF.
709800200420
709900200420      *52328 Start
710000200420      * When creating a new contract and no existing contract has
710100200420      * been compared to, then Ws-Cmp-Guar-Death-Sched-Code
710200200420      * has not been refreshed for the current transaction yet.
710300200420           MOVE INVESTMENT-CODE OF TRANS
710400200420                               TO INVESTMENT-CODE OF INVESTMENT-SEG.
710500200420           READ INVESTMENT-SEG
710600200420           NOT INVALID KEY
710700200420               MOVE Guar-Death-Sched-Code OF INVESTMENT-SEG
710800200420                   TO Ws-Cmp-Guar-Death-Sched-Code
710900200420           END-READ.
711000200420      *52328 End
711100200426      *RFS185170 - Begin
711200200426           IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
711300200426                                   lb_AccountLevelGLWBYes
711400200426              MOVE ACCOUNT-NO      OF TRANS
711500200426                TO pi_ACCGLWBD_AccNo
711600200426              MOVE INVESTMENT-CODE OF TRANS
711700200426                TO pc_ACCGLWBD_InvCode
711800200426              MOVE lc_AccountLevelGLWB       TO pc_ACCGLWBD_AccLvlGLWB
711900200426              PERFORM GetAccGLWBDetails
712000200426              IF pc_ACCGLWBD_Series NOT = SPACES
712100200426                 MOVE pc_ACCGLWBD_Series
712200200426                   TO INVESTMENT-SERIES OF INVESTMENT-SEG
712300200426              END-IF
712400200420           END-IF.
712500200420      *RFS185170 - End
712600200420
71270020042044930      INITIALIZE MFAGDTHVP OF Guar-Death-Sched-Rec.
71280020042044930      MOVE Ws-Cmp-Guar-Death-Sched-Code
71290020042044930        TO Guar-Death-Sched-Code OF Guaranteed-Death-Value-Sched.
71300020042044930      MOVE Account-Type-Code OF Account
71310020042044930        TO Account-Type-Code OF Guaranteed-Death-Value-Sched.
713200200420
71330020042044930      START Guaranteed-Death-Value-Sched
71340020042044930      KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
71350020042044930      INVALID KEY INITIALIZE MFAGDTHVP OF Guar-Death-Sched-Rec
71360020042044930      NOT INVALID KEY
71370020042044930          SET Sw-Record-Found-No TO TRUE
71380020042044930          PERFORM CalculateGDVPercentageCont
71390020042044930            UNTIL Sw-Record-Found-Yes
71400020042044930      END-START.
714100200420
71420020042044930      IF pi_DateOfBirth = 0
71430020042044930         INITIALIZE ln_NewGDVPercent
71440020042044930      END-IF.
714500200420
71460020042044930  CalculateGDVPercentageCont.
71470020042044930      READ Guaranteed-Death-Value-Sched NEXT RECORD
71480020042044930        AT END SET Sw-Record-Found-Yes TO TRUE
71490020042044930      END-READ.
715000200420
71510020042044930      IF Sw-Record-Found-No AND
71520020042044930         Guar-Death-Sched-Code OF Guaranteed-Death-Value-Sched
71530020042044930         NOT = Ws-Cmp-Guar-Death-Sched-Code
71540020042044930         SET Sw-Record-Found-Yes TO TRUE
71550020042044930      END-IF.
715600200420
71570020042044930      IF Sw-Record-Found-No
71580020042044930         IF Guar-Death-Sched-Code OF Guaranteed-Death-Value-Sched
71590020042044930            = Ws-Cmp-Guar-Death-Sched-Code                     AND
71600020042044930            Start-Date OF Guaranteed-Death-Value-Sched
71610020042044930            <= Trade-Date OF Trans                             AND
71620020042044930            End-Date OF Guaranteed-Death-Value-Sched
71630020042044930            >= Trade-Date OF Trans                             AND
71640020042044930            Account-Type-Code OF Guaranteed-Death-Value-Sched
71650020042044930            = Account-Type-Code OF Account                     AND
716600210806      *RFS187471 Starts
716700210806                 ((
71680020042044930            Age-Threshold OF Guaranteed-Death-Value-Sched
71690020042044930            > li_AnnuitantAge
717000210806                 AND lb_EditCodeTGDVSetupYes)
717100210806                 OR
717200210806                 (Age-Threshold OF Guaranteed-Death-Value-Sched
717300210806                 >= li_AnnuitantAge_GDth
717400210806                 AND lb_DepTDDthPercentYes))
717500210806      *RFS187471 End
71760020042044930            MOVE Guarantee-Percent OF Guaranteed-Death-Value-Sched
71770020042044930              TO ln_NewGDVPercent
71780020042044930            SET Sw-Record-Found-Yes TO TRUE
71790020042044930         END-IF
71800020042044930      END-IF.
718100200420
71820020042044930  CalcAnnuitantAge.
71830020042044930      INITIALIZE MFAACCNMP OF Account-Nominee.
71840020042044930      IF Nominee OF Account = lncc_Y
71850020042044930         MOVE Account-No OF Account
71860020042044930           TO Account-No OF Account-Nominee
71870020042044930         READ Account-Nominee
71880020042044930           INVALID KEY CONTINUE
71890020042044930         END-READ
71900020042044930      END-IF.
719100200420
719200200420      * RFS156864 - Begin
719300200420
719400200420           MOVE INVESTMENT-CODE OF TRANS TO lc-InvestmentCode.
719500200420           MOVE SPACES       TO lc-InvestmentStructure.
719600200420
719700200420           CALL "FXINRSTRF"    USING
719800200420                               lc-InvestmentCode
719900200420                               lc-FunctionCode
720000200420                               lc-InvestmentStructure
720100200420                               lc-DeclareINRSTRF
720200200420      * RFS156864 - End
72030020042044930      INITIALIZE MFATAAGLP OF Trans-Annuitant-Age-Limit.
72040020042044930      MOVE Account-Type-Code OF Account
72050020042044930        TO Account-Type-Code OF Trans-Annuitant-Age-Limit.
72060020042044930      MOVE Account-Type-Code OF Account-Nominee
72070020042044930        TO Nominee-Account-Type OF Trans-Annuitant-Age-Limit.
72080020042044930      MOVE Province-Code OF Investor
72090020042044930        TO Province-Of-Agreement OF Trans-Annuitant-Age-Limit.
721000200420156864     MOVE lc-InvestmentStructure
721100200420156864       TO Investment-Structure-Code OF Trans-Annuitant-Age-Limit.
721200200420
72130020042044930      READ Trans-Annuitant-Age-Limit
72140020042044930        INVALID KEY SET lb_AnnuitantAgeCalcMethodY TO TRUE
721500200420156864                   SET lb_FirstReadFoundNo TO TRUE
72160020042044930        NOT INVALID KEY
72170020042044930           MOVE Which-Date-Flag OF Trans-Annuitant-Age-Limit
72180020042044930             TO lc_AnnuitantAgeCalcMethod
721900200420156864          SET lb_FirstReadFoundYes TO TRUE
72200020042044930      END-READ.
722100200420
722200200420      * RFS 156864 - Begin
722300200420           IF lb_FirstReadFoundNo
722400200420
722500200420             INITIALIZE MFATAAGLP OF Trans-Annuitant-Age-Limit
722600200420             MOVE Account-Type-Code OF Account
722700200420               TO Account-Type-Code OF Trans-Annuitant-Age-Limit
722800200420             MOVE Account-Type-Code OF Account-Nominee
722900200420               TO Nominee-Account-Type OF Trans-Annuitant-Age-Limit
723000200420             MOVE Province-Code OF Investor
723100200420               TO Province-Of-Agreement OF Trans-Annuitant-Age-Limit
723200200420             MOVE SPACES
723300200420               TO Investment-Structure-Code OF Trans-Annuitant-Age-Limit
723400200420
723500200420             READ Trans-Annuitant-Age-Limit
723600200420               INVALID KEY SET lb_AnnuitantAgeCalcMethodY TO TRUE
723700200420               NOT INVALID KEY
723800200420                  MOVE Which-Date-Flag OF Trans-Annuitant-Age-Limit
723900200420                    TO lc_AnnuitantAgeCalcMethod
724000200420             END-READ
724100200420
724200200420           END-IF.
724300200420      * RFS 156864 - End
72440020042044930      INITIALIZE li_AnnuitantAge.
72450020042044930      MOVE Trade-Date OF TRANS TO Ws-Wk-Trade-Date.
72460020042044930      MOVE pi_DateOfBirth TO li_TempDate.
724700200420
72480020042044930      IF lb_AnnuitantAgeCalcMethodY
72490020042044930         COMPUTE li_AnnuitantAge = Ws-Wkt-Year - li_TempDateYear
72500020042044930      END-IF.
725100200420
72520020042044930      IF lb_AnnuitantAgeCalcMethodB
72530020042044930         INITIALIZE li_TempDate
72540020042044930         COMPUTE li_TempDate = Trade-Date OF TRANS
72550020042044930                             - pi_DateOfBirth
72560020042044930         COMPUTE li_AnnuitantAge = li_TempDateYear
72570020042044930      END-IF.
725800200420
72590020042044930  CompareGDVPercWithExistCont.
726000200420
726100200420      * RFS121426 - Start
726200200420132067* Code changes of 121426 have been moved to new
726300200420132067* section Calculate-GDV-MAT-Value
726400200420
726500200420            IF lb_EditCodeTGDVSetupYes
726600210806187471      OR lb_DepTDDthPercentYes
726700200420              IF WS-CONTRACT-MATCH = 'N'
726800200420               IF lnc_origCodeMat AND
726900200420                  TRANS-TYPE-CODE OF TRANS = "BUY"
727000200420132067                 PERFORM Calculate-GDV-MAT-Value
727100200420132067         END-IF
727200200420              END-IF
727300200420
727400200420             IF WS-CONTRACT-MATCH = 'Y'
727500200420
727600200420132067*          INITIALIZE MFAACCONP OF ACCOUNT-CONTRACT-REC
727700200420
727800200420                 MOVE ACCOUNT-NO OF TRANS TO
727900200420                 ACCOUNT-NO OF ACCOUNT-CONTRACT
728000200420
728100200420                 MOVE CONTRACT-NO OF ACCOUNT-CONTRACT
728200200420                 TO CONTRACT-NO OF ACCOUNT-CONTRACT
728300200420
728400200420                 READ Account-Contract
728500200420                 INVALID KEY CONTINUE
728600200420                 NOT INVALID KEY
728700200420136374*             MOVE Guarantee-Dth-Percent OF
728800200420136374*                  Account-Contract
728900200420136374*                   TO ln_NewGDVPercent
729000200420136374              CONTINUE
729100200420                   END-READ
729200200420             END-IF
729300200420            END-IF.
729400200420      * RFS121426 - End
72950020042044930 *    IF Guarantee-Dth-Percent OF Account-Cont-Age =   defect #2
72960020042044930      IF Guarantee-Dth-Percent OF Account-Contract =
72970020042044930         ln_NewGDVPercent
72980020042044930         SET lb_SameGDVPercentYes TO TRUE
72990020042044930      END-IF.
730000200420
73010020042044930  GetDeathPercentFromOutTran.
73020020042044930      INITIALIZE MFAACCONP OF Account-Contract.
73030020042044930      MOVE Ws-Seg-Array-Account-No(Ws-Seg-Array-Ctr)
73040020042044930        TO Account-No OF Account-Contract.
73050020042044930      MOVE Ws-Seg-Array-Contract-No(Ws-Seg-Array-Ctr)
73060020042044930        TO Contract-No OF Account-Contract.
730700200420
73080020042044930      READ Account-Contract
73090020042044930      INVALID KEY CONTINUE
73100020042044930      NOT INVALID KEY
73110020042044930          MOVE Guarantee-Dth-Percent OF Account-Contract
73120020042044930            TO Ws-Seg-Array-GDV-Percent(Ws-Seg-Array-Ctr)
73130020042044930      END-READ.
731400200420
731500200420r48630 FindOutLoadStructure.
731600200420  ¦        MOVE "N" TO lc_SameLoadStructure
731700200420def14                  lc_SameSegSeries.
731800200420  ¦
731900200420  ¦   *    INITIALIZE Mfainvp OF Investment-rec.
732000200420  ¦        MOVE Ws-seg-in-investment-code
732100200420  ¦          TO Investment-code of Investment-2.
732200200420  ¦        READ Investment-2
732300200420  ¦             INVALID KEY
732400200420  ¦                MOVE " " TO lc_LoadStructureIn
732500200420  ¦             NOT INVALID KEY
732600200420  ¦                MOVE Load-structure OF Investment-2
732700200420  ¦                  TO lc_LoadStructureIn
732800200420  ¦        END-READ.
732900200420  ¦
73300020042060593b*    RFS60593 Begins (This part copied to SetSwitchIntoGlwb)
733100200420           PERFORM SetSwitchIntoGlwb.
733200200420def14b*    MOVE Ws-seg-in-investment-code
733300200420  ¦   *      TO Investment-code of Investment-seg.
733400200420  ¦   *    READ Investment-seg
733500200420  ¦   *         INVALID KEY
733600200420  ¦   *            MOVE SPACES TO lc_InvSeriesIn
733700200420  ¦   *         NOT INVALID KEY
733800200420  ¦   *            MOVE Investment-series of Investment-seg
733900200420  ¦   *              TO lc_InvSeriesIn
734000200420def14e*    END-READ.
734100200420
73420020042056974 * this is to find out whether the in-fund is a base series or not
734300200420  |   *    MOVE 'N' TO lc_SwitchIntoGlwb.
734400200420  |   *    PERFORM CheckGLWBRules.
734500200420  |   *    IF Investment-series of Investment-seg NOT = Spaces and
734600200420  |   *       li-EligibleStartDftAge > 0
73470020042056974 *       MOVE 'Y' TO lc_SwitchIntoGlwb
734800200420      *    END-IF.
73490020042060593e*    RFS60593 Ends
735000200420
735100200420  ¦        MOVE Ws-seg-out-investment-code
735200200420  ¦          TO Investment-code of Investment-2.
735300200420  ¦        READ Investment-2
735400200420  ¦             INVALID KEY
735500200420  ¦                MOVE " " TO lc_LoadStructureOut
735600200420  ¦             NOT INVALID KEY
735700200420  ¦                MOVE Load-structure OF Investment-2
735800200420  ¦                  TO lc_LoadStructureOut
735900200420  ¦        END-READ.
736000200420  ¦
736100200420def14b     MOVE Ws-seg-out-investment-code
736200200420  ¦          TO Investment-code of Investment-seg.
736300200420  ¦        READ Investment-seg
736400200420  ¦             INVALID KEY
736500200420  ¦                MOVE SPACES TO lc_InvSeriesOut
736600200420  ¦             NOT INVALID KEY
736700200426      *RFS185170 - Begin
736800200426                 IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
736900200426                                         lb_AccountLevelGLWBYes
737000200426                    MOVE WS-SEG-OUT-ACCOUNT-NO
737100200426                      TO pi_ACCGLWBD_AccNo
737200200426                    MOVE Ws-seg-out-investment-code
737300200426                      TO pc_ACCGLWBD_InvCode
737400200426                    MOVE lc_AccountLevelGLWB TO pc_ACCGLWBD_AccLvlGLWB
737500200426                    PERFORM GetAccGLWBDetails
737600200426                    IF pc_ACCGLWBD_Series NOT = SPACES
737700200426                       MOVE pc_ACCGLWBD_Series
737800200426                         TO INVESTMENT-SERIES OF INVESTMENT-SEG
737900200426                    END-IF
738000200420                 END-IF
738100200420      *RFS185170 - End
738200200420
738300200420  ¦                MOVE Investment-series of Investment-seg
738400200420  ¦                  TO lc_InvSeriesOut
738500200420def14e     END-READ.
738600200420
738700200420  ¦        IF lc_LoadStructureIn = lc_LoadStructureOut
738800200420  ¦           MOVE "Y" TO lc_SameLoadStructure
738900200420r48630     END-IF.
739000200420
739100200420def14      IF lc_InvSeriesOut = lc_InvSeriesIn
739200200420def14         MOVE "Y" TO lc_SameSegSeries
739300200420def14      END-IF.
739400200420
73950020042060593  SetSwitchIntoGlwb.
739600200420  |
739700200420  |        MOVE Ws-seg-in-investment-code
739800200420  |          TO Investment-code of Investment-seg.
739900200420  |        READ Investment-seg
740000200420  |             INVALID KEY
740100200420  |                MOVE SPACES TO lc_InvSeriesIn
740200200420  |             NOT INVALID KEY
740300200426      *RFS185170 - Begin
740400200426                 IF INVESTMENT-SERIES OF INVESTMENT-SEG = SPACES AND
740500200426                                         lb_AccountLevelGLWBYes
740600200426                    MOVE WS-SEG-IN-ACCOUNT-NO
740700200426                      TO pi_ACCGLWBD_AccNo
740800200426                    MOVE Ws-seg-in-investment-code
740900200426                      TO pc_ACCGLWBD_InvCode
741000200426                    MOVE lc_AccountLevelGLWB TO pc_ACCGLWBD_AccLvlGLWB
741100200426                    PERFORM GetAccGLWBDetails
741200200426                    IF pc_ACCGLWBD_Series NOT = SPACES
741300200426                       MOVE pc_ACCGLWBD_Series
741400200426                         TO INVESTMENT-SERIES OF INVESTMENT-SEG
741500200426                    END-IF
741600200420                 END-IF
741700200420      *RFS185170 - End
741800200420
741900200420  |                MOVE Investment-series of Investment-seg
742000200420  |                  TO lc_InvSeriesIn
742100200420  |        END-READ.
742200200420  |
742300200420  |   * this is to find out whether the in-fund is a base series or not
742400200420  |        MOVE 'N' TO lc_SwitchIntoGlwb.
74250020042085029 *    IF lc_InvSeriesIn NOT = " " AND SWO-SWI-TRANSACTION
74260020042085029      IF lc_InvSeriesIn NOT = " " AND SWITCH-TRANSACTION
742700200420185170     MOVE WS-SEG-IN-ACCOUNT-NO to pi-AccountNo
742800200420  |         PERFORM CheckGLWBRules
742900200420  |         IF Investment-series of Investment-seg NOT = Spaces and
743000200420  |           li-EligibleStartDftAge > 0
743100200420  |           MOVE 'Y' TO lc_SwitchIntoGlwb
74320020042060593       END-IF
74330020042081076      END-IF.
743400200420
74350020042046707  CallFXGLWBRULE.
743600200420      *RFS185170 -Begin
743700200615           INITIALIZE  pc-InvestmentSeriesCode.
743800200615
743900200609           IF lb_AccountLevelGLWBYes AND Switch-In-Transaction AND
744000200609              TRANSFER-GWB-FIEB OF SEG-SWITCH-TRF-OPT = lncc_Y
744100200609               MOVE Ws-Seg-Out-Account-No TO pi-AccountNo
744200200609           END-IF.
744300200609
74440020060946707 *    CALL "FXGLWBRULE" USING pc-InvestmentCode
744500200420           CALL "FXGLWBRULE" USING pi-AccountNo
744600200420                                   pc-InvestmentCode
744700200420      *RFS185170 -End
74480020042046707                              pc-InvestmentSeriesCode
74490020042046707                              pc-InvestmentSeriesFlag
74500020042046707                              pc-RFGWRULErules
74510020042046707                              pc-RejectionCode.
745200200420
74530020042046707        If pc-EligibleStartDftAge not = SPACES
745400200420  ¦             Move pc-EligibleStartDftAge TO li-EligibleStartDftAge
745500200420  ¦          End-If
74560020042046707
74570020042046707        If pc-ForceStartDftAge  not = SPACES
745800200420  ¦             Move pc-ForceStartDftAge TO li-ForceStartDftAge
74590020042046707        End-If.
746000200420
746100200824      *RFS186430 - Begin
746200200814       ReadAccountBenefits.
746300200814           INITIALIZE MFAACLBENP OF Ws-Account-Benefits
746400200814           INITIALIZE MFAACLBENP OF ACCOUNT-BENEFITS-REC
746500200814           MOVE SPACES     TO WRITE-ACCOUNT-BENEFITS
746600200814           Move ACCOUNT-NO OF TRANS
746700200814                           TO ACCOUNT-NO    OF ACCOUNT-BENEFITS
746800200814
746900200814           READ ACCOUNT-BENEFITS
747000200814                INVALID KEY
747100200814                   MOVE 'W' TO WRITE-ACCOUNT-BENEFITS
747200200814                   MOVE ACCOUNT-NO OF TRANS
747300200814                            TO ACCOUNT-NO OF Ws-Account-Benefits
747400200814            NOT INVALID KEY
747500200814                   MOVE 'R' TO WRITE-ACCOUNT-BENEFITS
747600200814                   MOVE ACCOUNT-BENEFITS-REC TO Ws-Account-Benefits
747700200814           END-READ.
747800210127      *RFS180721 START
747900210127           IF Switch-In-Transaction AND
748000210127              WRITE-ACCOUNT-BENEFITS = 'W'
748100210127              SET lb_accountbenetitsexistsfalse TO TRUE
748200210127           ELSE
748300210127              SET lb_accountbenetitsexiststrue TO TRUE
748400210127           END-IF.
748500210127      *RFS180721 END
748600210127
748700200824      *RFS186430 - End
748701210914
748702210914      *RFS1117913 - Starts
748703210914       ReadAccountBenefits1.
748704210914           INITIALIZE MFAACLBENP OF ACCOUNT-BENEFITS-REC1
748705210914           Move ACCOUNT-NO OF TRANS
748706210914                   TO ACCOUNT-NO    OF ACCOUNT-BENEFITS1
748707210914
748708210914           READ ACCOUNT-BENEFITS1
748709210914                INVALID KEY
748710210914                   CONTINUE
748711210914           END-READ.
748712210914      *RFS1117913 - Ends
748713210914
74880020042046707  GetQualifiedGLWBContract.
74890020042046707      INITIALIZE MFAACCONP OF Account-Cont-Age.
74900020042046707      MOVE Account-No OF Trans TO Account-No OF Account-Cont-Age.
74910020042046707      MOVE 0 TO Start-Date OF Account-Cont-Age.
749200200420
74930020042046707      START Account-Cont-Age
74940020042046707      KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
74950020042046707      INVALID KEY CONTINUE
74960020042046707      NOT INVALID KEY
74970020042046707          SET Sw-Record-Found-No TO TRUE
74980020042046707          PERFORM GetQualifiedGLWBContractCont
74990020042046707            UNTIL Sw-Record-Found-Yes
75000020042046707      END-START.
750100200420
75020020042046707  GetQualifiedGLWBContractCont.
75030020042046707      READ Account-Cont-Age NEXT RECORD
75040020042046707        AT END SET Sw-Record-Found-Yes TO TRUE
75050020042046707      END-READ.
750600200420
75070020042046707      IF Sw-Record-Found-No AND
75080020042046707         Account-No OF Trans NOT= Account-No OF Account-Cont-Age
75090020042046707         SET Sw-Record-Found-Yes TO TRUE
75100020042046707      END-IF.
751100200420
75120020042046707      IF Sw-Record-Found-No
75130020042046707         IF Investment-Series OF Investment-Seg =
75140020042046707            Investment-Series OF Account-Cont-Age AND
75150020042046707            Contract-Status OF Account-Cont-Age = lncc_Open
75160020042046707            PERFORM CheckIfContractEmpty
75170020042046707         END-IF
75180020042046707      END-IF.
751900200420
75200020042046707  CheckIfContractEmpty.
75210020042046707      INITIALIZE MFAACCCIP OF Account-Contract-Investment.
75220020042046707      MOVE Account-No OF Account-Cont-Age
75230020042046707        TO Account-No OF Account-Contract-Investment.
75240020042046707      MOVE Contract-No OF Account-Cont-Age
75250020042046707        TO Contract-No OF Account-Contract-Investment.
752600200420
75270020042046707      START Account-Contract-Investment
75280020042046707      KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
75290020042046707      INVALID KEY
75300020042046707        SET Sw-Record-Found-Yes TO TRUE
75310020042046707        MOVE lncc_Y TO Ws-Edit-Specific-Contract
75320020042046707      NOT INVALID KEY
75330020042046707        READ Account-Contract-Investment NEXT RECORD
75340020042046707        WITH NO LOCK
75350020042046707        AT END
75360020042046707          SET Sw-Record-Found-Yes TO TRUE
75370020042046707          MOVE lncc_Y TO Ws-Edit-Specific-Contract
75380020042046707        NOT AT END
75390020042046707          IF Account-No OF Account-Cont-Age NOT =
75400020042046707             Account-No OF Account-Contract-Investment OR
75410020042046707             Contract-No OF Account-Cont-Age NOT =
75420020042046707             Contract-No OF Account-Contract-Investment
75430020042046707             SET Sw-Record-Found-Yes TO TRUE
75440020042046707             MOVE lncc_Y TO Ws-Edit-Specific-Contract
75450020042046707          END-IF
75460020042046707        END-READ
75470020042046707      END-START.
754800200420
75490020042046707      IF Ws-Edit-Specific-Contract = lncc_Y
75500020042046707         MOVE Contract-No OF Account-Cont-Age
75510020042046707           TO Contract-No OF Trans-Contract-Details
75520020042046707      END-IF.
755300200420
755400200420      *RFS 52328 Begin
755500200420      *------------------------------------------------------
755600200420       init-gdv-percent.
755700200420
755800210806      *RFS187471 Starts
755900210806      *    if lb_EditCodeTGDVSetupYes and
756000210806           if (lb_EditCodeTGDVSetupYes OR lb_DepTDDthPercentYes)
756100210806           AND
756200210806      *RFS187471 End
756300200420              TRANSFER-GBV OF SEG-SWITCH-TRF-OPT = "Y"
756400200420              set lb_DthPercentCalculatedYes to true
756500200420              move Ws-Seg-Array-GDV-Percent(WS-SEG-ARRAY-CTR)
756600200420                   to ln_NewGDVPercent
756700200420           else
756800200420              set lb_DthPercentCalculatedNo to true
756900200420              move 0 to ln_NewGDVPercent
757000200420           end-if.
757100200420
757200200420      *------------------------------------------------------
757300200420       carryover-gdv-consolidate.
757400200420
757500200420           perform varying WS-SEG-ARRAY-CTR
757600200420           from 1 by 1 until WS-SEG-ARRAY-CTR >
757700200420           WS-SEG-OUT-NUMBER-OF-CONTRACTS
757800200420
757900200420              set lb_DthPercentCalculatedYes to true
758000200420              move Ws-Seg-Array-GDV-Percent(ws-seg-array-ctr)
758100200420                   to ln_NewGDVPercent
758200200420
758300200420              move "Y" to WS-CREATE-TCT-FLAG
758400200420              move "Y" to WS-CREATE-TCD-FLAG
758500200420              move "Y" to WS-CREATE-AC-FLAG
758600200420              move "Y" to WS-CREATE-ACI-FLAG
758700200420
758800200420              move 0 to WS-OVERRIDE-CONTRACT-NO
758900200420              perform CONVERT-SWO-TO-SWI-UNITS
759000200420
759100200420              perform try-consolidate
759200200420              if ws-can-consolidate = "N"
759300200420                 move "N" to WS-EDIT-SPECIFIC-CONTRACT
759400200420                 perform find-seg-contract-match
759500200420                 if ws-contract-match = "Y"
759600200420                    move CONTRACT-NO OF ACCOUNT-CONT-AGE
759700200420                         to WS-OVERRIDE-CONTRACT-NO
759800200420                    move "N" to WS-CREATE-AC-FLAG
759900200420                    perform find-acc-cont-inv
760000200420                 end-if
760100200420              end-if
760200200420
760300200420              perform CREATE-MULT-SEG-CONTRACTS
760400200420
760500200420              if ws-can-consolidate = "Y"
760600200420                 move WS-TCD2-TOTAL to WS-TCD2
760700200420              end-if
760800200420
760900200420           end-perform.
761000200420
761100200420      *------------------------------------------------------
761200200420       try-consolidate.
761300200420
761400200420           move "N" to ws-can-consolidate.
761500200420
761600200420           perform varying ws-index
761700200420           from 1 by 1 until ws-index = ws-seg-array-ctr
761800200420           or ws-can-consolidate = "Y"
761900200420              if Ws-Seg-Array-GDV-Percent(ws-index)
762000200420                 = ln_NewGDVPercent
762100200420                 move "Y" to ws-can-consolidate
762200200420                 move "N" to WS-CREATE-AC-FLAG
762300200420                 move "N" to WS-CREATE-ACI-FLAG
762400200420                 move "N" to WS-CREATE-TCD-FLAG
762500200420                 add WS-SEG-ARRAY-OUT-PERC(ws-seg-array-ctr)
762600200420                  to WS-SEG-ARRAY-OUT-PERC(ws-index)
762700200420                 move WS-TCD2  to WS-TCD2-TOTAL
762800200420                 move ws-index to WS-TCD2
762900200420              end-if
763000200420           end-perform.
763100200420
763200200420           if ws-can-consolidate = "N"
763300200420              move Ws-Seg-Array-GDV-Percent(ws-seg-array-ctr)
763400200420                to Ws-Seg-Array-GDV-Percent(WS-ACI2 + 1)
763500200420              move WS-SEG-ARRAY-OUT-PERC(ws-seg-array-ctr)
763600200420                to WS-SEG-ARRAY-OUT-PERC(WS-ACI2 + 1)
763700200420           end-if.
763800200420
763900200420      *------------------------------------------------------
764000200420       find-acc-cont-inv.
764100200420
764200200420           MOVE ACCOUNT-NO  OF TRANS
764300200420             to ACCOUNT-NO  OF ACCOUNT-CONTRACT-INVESTMENT.
764400200420           MOVE WS-OVERRIDE-CONTRACT-NO
764500200420             to CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
764600200420           MOVE INVESTMENT-CODE OF TRANS
764700200420             to INVESTMENT-CODE  OF ACCOUNT-CONTRACT-INVESTMENT.
764800200420
764900200420           READ ACCOUNT-CONTRACT-INVESTMENT
765000200420            NOT INVALID KEY
765100200420              ADD 1 TO WS-ACI2
765200200420              IF WS-ACI2 > WS-ARRAY8-MAX-USED
765300200420                  MOVE WS-ACI2 TO WS-ARRAY8-MAX-USED
765400200420              END-IF
765500200420              MOVE ACCOUNT-CONTRACT-INVEST-REC
765600200420                TO WS-ACCOUNT-CONTRACT-INVEST-2(WS-ACI2)
765700200420              MOVE "R" TO WS-WRITE-REWRITE-ACI2(WS-ACI2)
765800200420              MOVE "R2" TO WRITE-ACCOUNT-CONTRACT-INV
765900200420              move "N" to WS-CREATE-ACI-FLAG
766000200420           END-READ.
766100200420
766200200420      *RFS 52328 End
766300200420
766400200420      * RFS139286 - Begin
766500200420      *------------------------------------------------------
766600200420       CheckIfInvIsPOANInv.
766700200420      *------------------------------------------------------
766800200420             SET lb_POANInvestNo  TO TRUE
766900200420
767000200420             INITIALIZE MFAACCCSP OF ACCOUNT-CONTRACT-SPIA
767100200420             MOVE ACCOUNT-NO      OF TRANS
767200200420                TO ACCOUNT-NO     OF ACCOUNT-CONTRACT-SPIA
767300200420167104*      MOVE
767400200420167104*      CONTRACT-NO OF TRANS-CONTRACT-DETAILS-REC
767500200420167104       MOVE li_ContractNum
767600200420                TO CONTRACT-NO    OF ACCOUNT-CONTRACT-SPIA
767700200420
767800200420             READ ACCOUNT-CONTRACT-SPIA
767900200420                  NOT INVALID KEY
768000200420                      PERFORM CheckPOANRules
768100200420                      IF lc_SeriesType = 'POAN'
768200200420                         SET lb_POANInvestYes TO TRUE
768300200420                      END-IF
768400200420                  INVALID KEY
768500200420                      INITIALIZE MFAACCCSP
768600200420                              OF ACCOUNT-CONTRACT-SPIA
768700200420             END-READ.
768800200420
768900200420      *------------------------------------------------------
769000200420       CheckPOANRules.
769100200420      *------------------------------------------------------
769200200420146960*     IF Investment-Series OF ACCOUNT-CONTRACT-SPIA
769300200420146960*        NOT = SPACES AND  NOT = lc_SaveANInvSeries
769400200420146960      IF (Investment-Series OF ACCOUNT-CONTRACT-SPIA
769500200513      *RFS1027904 - Start.
769600200513146960*               NOT = SPACES) AND
769700200513                      NOT = SPACES)
769800200513146960*        (Investment-Series OF ACCOUNT-CONTRACT-SPIA
769900200513146960*               NOT = lc_SaveANInvSeries)
770000200513      *RFS1027904 - End.
770100200420              MOVE Investment-Series OF ACCOUNT-CONTRACT-SPIA
770200200420                      TO pc_passPOANInvestmentSeries
770300200420
770400200420              PERFORM CALLFXPOANRULE
770500200420              MOVE Investment-Series OF ACCOUNT-CONTRACT-SPIA
770600200420                   TO lc_SaveANInvSeries
770700200420            END-IF.
770800200420
770900200420      *------------------------------------------------------
771000200420       CALLFXPOANRULE.
771100200420      *------------------------------------------------------
771200200420             INITIALIZE  pc_retnPoanSeriesRules,
771300200420                         pc_retnPoanErrCode,
771400200420                         lc_SeriesType.
771500200420
771600200420             CALL "FXPOANRULE" USING pc_passPoanInvestmentSeries,
771700200420                                     pc_retnPoanSeriesRules,
771800200420                                     pc_retnPoanErrCode.
771900200420
772000200420             MOVE pc_PoanAllowMultiContracts TO
772100200420                                 lc_AllowMultipleContracts
772200200420             MOVE pc_PoanSeriesType TO lc_SeriesType.
772300200420
772400200420
772500200420      * RFS139286 - End
772600200420      *RFS96081 Starts
772700200420      *------------------------------------------------------
772800200420       CheckEWAAmount.
772900200420      *------------------------------------------------------
773000200420
773100200420             INITIALIZE pi_GWREDAccountNo
773200200420                        pc_GWREDInvestmentCode
773300200420                        pi_GWREDPlacementDate
773400200420                        pi_GWREDTransNo
773500200420                        pi_GWREDAmount
773600200420                        pi_GWREDUnits
773700200420                        pn_GWREDPercent
773800200420                        pi_GWREDGrosNet
773900200420R99550                  pc_GWREDRedemcode
774000200420R99550                  pc_GWREDSplitOption
774100200420R99550                  pi_GWREDToAccountNo
774200200420R99550                  pc_GWREDToInvestmentCode
774300200420133282                  pi_GWREDTradeDate
774400200420                        pc_GWREDRejection.
774500200420
774600200420
774700200420              PERFORM CheckIfInvIsGLWBInv.
774800200420
774900200420              IF lc_GlwbInvestment = "Y"
775000200420
775100200420                 MOVE ACCOUNT-NO OF TRANS TO pi_GWREDAccountNo
775200200420                 MOVE INVESTMENT-CODE OF TRANS TO
775300200420                                               pc_GWREDInvestmentCode
775400200420                 MOVE PLACEMENT-DATE OF TRANS  TO pi_GWREDPlacementDate
775500200420                 MOVE TRANS-NO OF TRANS       TO pi_GWREDTransNo
775600200420                 MOVE GROSS-AMT OF TRANS      TO pi_GWREDAmount
775700200420      * RFS 108168 - Start
775800200420                 MOVE CONTR-REDEM-CODE  OF TRANS TO pc_GWREDRedemcode
775900200420      * RFS 108168 - End
776000200420133282           MOVE TRADE-DATE OF TRANS TO pi_GWREDTradeDate
776100200420                 CALL "FXGWREDV" USING pi_GWREDAccountNo
776200200420                                       pc_GWREDInvestmentCode
776300200420                                       pi_GWREDPlacementDate
776400200420                                       pi_GWREDTransNo
776500200420                                       pi_GWREDAmount
776600200420                                       pi_GWREDUnits
776700200420                                       pn_GWREDPercent
776800200420                                       pi_GWREDGrosNet
776900200420R99550                                 pc_GWREDRedemcode
777000200420R99550                                 pc_GWREDSplitOption
777100200420R99550                                 pi_GWREDToAccountNo
777200200420R99550                                 pc_GWREDToInvestmentCode
777300200420133282                                 pi_GWREDTradeDate
777400200420                                       pc_GWREDRejection
777500200420              END-IF.
777600200420
777700200420              IF pc_GWREDRejection not EQUAL "00" and
777800200420                 pc_GWREDRejection not EQUAL SPACES
777900200420                MOVE pc_GWREDRejection TO REJECTION-CODE OF TRANS-REC
778000200420              END-IF.
778100200420
778200200420      *RFS96081 End
778300200420      *RFS96530 - START
778400200420       CHECK-GUAR-MAT-SCHED-CODE.
778500200420           INITIALIZE  GUAR-MAT-SCHED-REC.
778600200420
778700200420           MOVE GUAR-MAT-SCHED-CODE   OF INVESTMENT-SEG
778800200420             TO GUAR-MAT-SCHED-CODE   OF
778900200420                     GUARANTEED-MAT-VALUE-SCHED.
779000200420           MOVE ZEROES  TO START-DATE OF GUARANTEED-MAT-VALUE-SCHED.
779100200420           MOVE ZEROES  TO END-DATE   OF GUARANTEED-MAT-VALUE-SCHED.
779200200420           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT
779300200420             TO ACCOUNT-TYPE-CODE     OF GUARANTEED-MAT-VALUE-SCHED.
779400200420           MOVE ZEROES  TO AGE-THRESHOLD
779500200420                                      OF GUARANTEED-MAT-VALUE-SCHED.
779600200420
779700200420           START GUARANTEED-MAT-VALUE-SCHED
779800200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
779900200420           INVALID KEY
780000200420             SET  Lc-Schcode-NO      TO TRUE
780100200420           NOT INVALID KEY
780200200420             SET Lc-EOF-Schcode-No   TO TRUE
780300200420             SET  Lc-Schcode-NO      TO TRUE
780400200420             PERFORM CHECK-SCHED-CODE-PRESENT  UNTIL
780500200420                                       Lc-EOF-Schcode-Yes.
780600200420       CHECK-SCHED-CODE-PRESENT.
780700200420             READ GUARANTEED-MAT-VALUE-SCHED NEXT RECORD
780800200420             AT END
780900200420                SET  Lc-Schcode-NO      TO TRUE
781000200420                SET  Lc-EOF-Schcode-Yes TO TRUE
781100200420             NOT END
781200200420             IF  GUAR-MAT-SCHED-CODE OF GUARANTEED-MAT-VALUE-SCHED IS
781300200420             EQUAL TO GUAR-MAT-SCHED-CODE
781400200420                                     OF INVESTMENT-SEG
781500200420             AND ACCOUNT-TYPE-CODE   OF GUARANTEED-MAT-VALUE-SCHED IS
781600200420             EQUAL TO ACCOUNT-TYPE-CODE
781700200420                                     OF ACCOUNT
781800200420             AND (CONTRACT-STATUS     OF ACCOUNT-CONTRACT           IS
781900200420             EQUAL "A"
782000200420             OR  CONTRACT-STATUS OF ACCOUNT-CONT-AGE               IS
782100200420             EQUAL "A")
782200200420             AND YEARS-TO-MATURITY   OF GUARANTEED-MAT-VALUE-SCHED IS
782300200420             >  0
782400200420                 SET  Lc-Schcode-Yes     TO TRUE
782500200420                 SET  Lc-EOF-Schcode-Yes TO TRUE
782600200420             END-IF
782700200420             END-READ.
782800200420      *RFS96530 - END
782900200420
783000200420      * RFS113773 - Starts
783100200420      *------------------------------
783200200420       CHECK-SEG-GIC-AGE-LIMIT.
783300200420      *------------------------------
783400200420      * RFS119916 - Start
783500200420           IF PRODUCT-TYPE-CODE OF INVESTMENT = lnc_Dii
783600200420142611         AND TRANS-ORIGIN-CODE OF TRANS IS NOT EQUAL "MAT"
783700200420
783800200420              INITIALIZE GIC-SEG-ATT-FLAG OF INVESTMENT-GIC-DETAILS
783900200420              GO TO CALL-TRNANNAG
784000200420           END-IF
784100200420      * RFS119916 - End
784200200420           IF INVESTMENT-CODE OF TRANS  NOT =
784300200420              INVESTMENT-CODE OF INVESTMENT-GIC-DETAILS
784400200420              MOVE INVESTMENT-CODE OF TRANS TO
784500200420                INVESTMENT-CODE OF INVESTMENT-GIC-DETAILS
784600200420              READ INVESTMENT-GIC-DETAILS
784700200420              INVALID KEY
784800200420              INITIALIZE MFAGIIDLP OF INVESTMENT-GIC-DETAILS
784900200420              GO TO SEG-GIC-AGE-EXIT
785000200420              NOT INVALID KEY
785100200420              CONTINUE
785200200420              END-READ
785300200420           END-IF.
785400200420
785500200420           IF GIC-SEG-ATT-FLAG OF INVESTMENT-GIC-DETAILS NOT = lncc_Y
785600200420              GO TO SEG-GIC-AGE-EXIT
785700200420           END-IF.
785800200420
785900200420      * RFS119916 - Start
786000200420           CALL-TRNANNAG.
786100200420      *    IF GIC-SEG-ATT-FLAG OF INVESTMENT-GIC-DETAILS = lncc_Y
786200200420           IF ((GIC-SEG-ATT-FLAG OF INVESTMENT-GIC-DETAILS = lncc_Y)
786300200420             OR (PRODUCT-TYPE-CODE OF INVESTMENT   = lnc_Dii))
786400200420      * RFS119916 - End
786500200420              IF WS-SEG-ANNUIT-AGE-THRESH = lncc_Y
786600200420                 AND REJECTION-CODE OF TRANS = lncc_00
786700200420142611           AND TRANS-ORIGIN-CODE OF TRANS IS NOT EQUAL "MAT"
786701210929      *RFS1120699 Starts
786702210929                 AND NOT (ENTERED-BY    OF TRANS IS EQUAL "SEGGENGPP"
786703210929                          AND TRANS-TYPE-CODE OF TRANS IS EQUAL "BAJ")
786704210929      *RFS1120699 Ends
786800200420
786900200420                 CALL "TRNANNAG" USING
787000200420                                 ACCOUNT-NO        OF TRANS
787100200420                                 lnc_ContractNo
787200200420                                 ACCOUNT-TYPE-CODE OF ACCOUNT
787300200420                                 ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE
787400200420                                 PROVINCE-CODE     OF INVESTOR
787500200420                                 TRADE-DATE        OF TRANS
787600200420                                 REJECTION-CODE    OF TRANS
787700200420                                 INVESTMENT-CODE   OF TRANS
787800200420                 CANCEL "TRNANNAG"
787900200420
788000200420                 IF REJECTION-CODE OF TRANS NOT = lncc_00
788100200420                    GO TO SEG-GIC-AGE-EXIT
788200200420                 END-IF
788300200420              END-IF
788400200420           END-IF.
788500200420
788600200420      * RFS119916 - Start
788700200420      *    IF li_Age_Res_Con_St_Date  >  0
788800200420      *       AND PURCHASE-TRANSACTION
788900200420      *       AND REJECTION-CODE OF TRANS = lncc_00
789000200420      *
789100200420      *       MOVE ACCOUNT-NO OF TRANS     TO pi_AGEVLDAccountNo
789200200420      *       MOVE ZEROES                  TO pi_AGEVLDContractNo
789300200420      *       MOVE TRADE-DATE OF TRANS     TO Pi_AGEVLDEffectiveDate
789400200420      *       MOVE PLACEMENT-DATE OF TRANS TO Pi_AGEVLDPlacementDate
789500200420      *       MOVE TRANS-NO OF TRANS       TO Pi_AGEVLDTransNo
789600200420      *       MOVE lncc_00                 TO pc_AGEVLDRejection
789700200420      *
789800200420      *       CALL "FXSGAGEVLD" USING      pi_AGEVLDAccountNo
789900200420      *                                    pi_AGEVLDContractNo
790000200420      *                                    Pi_AGEVLDEffectiveDate
790100200420      *                                    Pi_AGEVLDPlacementDate
790200200420      *                                    pi_AGEVLDTransNo
790300200420      *                                    pc_AGEVLDRejection
790400200420      *       CANCEL "FXSGAGEVLD"
790500200420      *    END-IF.
790600200420      *
790700200420      *    IF pc_AGEVLDRejection = lncc_99
790800200420      *       MOVE lnc_63   TO  REJECTION-CODE OF TRANS
790900200420      *       GO TO SEG-GIC-AGE-EXIT
791000200420      *    END-IF.
791100200420      * RFS119916 - End
791200200420
791300200420       SEG-GIC-AGE-EXIT.
791400200420           EXIT.
791500200420      * RFS113773 - Ends
791600200420      * RFS110904 - Starts
791700200420        createAuditLog.
791800200420           MOVE 'ID' TO Lc-Audit-Log-Ind.
791900200420           PERFORM createContractChangeLog.
792000200420           PERFORM createContractDataLog.
792100200420           MOVE 'GB' TO Lc-Audit-Log-Ind.
792200200420           PERFORM createContractChangeLog.
792300200420           PERFORM createContractDataLog.
792400200420
792500200420        createContractChangeLog.
792600200420           INITIALIZE MFACTCLP OF CONTRACT-CHANGE-LOG-REC.
792700200420129784     ACCEPT WS-SYSTIME         FROM  TIME.
792800200420
792900200420           MOVE Li_ADLInvestor
793000200420                               TO INVESTOR-NO OF CONTRACT-CHANGE-LOG.
793100200420           MOVE Li_ADLAccountNo
793200200420                               TO ACCOUNT-NO OF CONTRACT-CHANGE-LOG.
793300200420           MOVE Li_ADLContractNo
793400200420                               TO CONTRACT-NO OF CONTRACT-CHANGE-LOG.
793500200420           MOVE WS-SYSDATE   TO AUDIT-DATE OF CONTRACT-CHANGE-LOG.
793600200420           MOVE WS-SYSTIME   TO LOG-TIME OF CONTRACT-CHANGE-LOG.
793700200420           MOVE "JOBDAILY"   TO AUDIT-USER OF CONTRACT-CHANGE-LOG.
793800200420           MOVE SPACES       TO SCREEN-CODE OF CONTRACT-CHANGE-LOG.
793900200420           MOVE SPACES       TO INVESTMENT-CODE OF CONTRACT-CHANGE-LOG.
794000200420           IF Lc-Audit-Log-Ind = 'ID'
794100200420              MOVE "CONT. INFORCE DATE" TO CHANGE-CATEGORY
794200200420                         OF   CONTRACT-CHANGE-LOG
794300200420           ELSE
794400200420              MOVE "GUAR. BENE ELIGIBLE" TO CHANGE-CATEGORY
794500200420                        OF   CONTRACT-CHANGE-LOG
794600200420           END-IF.
794700200420
794800200420           WRITE CONTRACT-CHANGE-LOG-REC
794900200420             INVALID KEY
795000200420                CONTINUE
795100200420           END-WRITE.
795200200420        createContractDataLog.
795300200420      * Create Contract Data log record
795400200420           INITIALIZE MFACTDLP OF CONTRACT-DATA-LOG-REC.
795500200420
795600200420           MOVE Li_ADLInvestor
795700200420                               TO INVESTOR-NO OF CONTRACT-DATA-LOG.
795800200420           MOVE Li_ADLAccountNo
795900200420                               TO ACCOUNT-NO OF CONTRACT-DATA-LOG.
796000200420           MOVE Li_ADLContractNo
796100200420                               TO CONTRACT-NO OF CONTRACT-DATA-LOG.
796200200420           MOVE SPACES         TO INVESTMENT-CODE OF CONTRACT-DATA-LOG.
796300200420           MOVE SPACES         TO ORIG-VALUE      OF CONTRACT-DATA-LOG.
796400200420           IF Lc-Audit-Log-Ind = 'ID'
796500200420             MOVE PASS-PROCESS-DATE-9
796600200420                               TO NEW-VALUE       OF CONTRACT-DATA-LOG
796700200420             MOVE "024"        TO ELEMENT-CODE    OF CONTRACT-DATA-LOG
796800200420           ELSE
796900200420             MOVE "N"
797000200420
797100200420                               TO NEW-VALUE       OF CONTRACT-DATA-LOG
797200200420             MOVE "025"        TO ELEMENT-CODE    OF CONTRACT-DATA-LOG
797300200420           END-IF.
797400200420           MOVE "JOBDAILY"     TO AUDIT-USER   OF CONTRACT-DATA-LOG.
797500200420           MOVE lncc_N         TO AUDIT-STATUS OF CONTRACT-DATA-LOG.
797600200420           MOVE SPACES         TO SCREEN-CODE OF CONTRACT-DATA-LOG.
797700200420           MOVE WS-SYSTIME     TO LOG-TIME OF CONTRACT-DATA-LOG.
797800200420           MOVE WS-SYSDATE     TO AUDIT-DATE OF CONTRACT-DATA-LOG.
797900200420
798000200420           WRITE CONTRACT-DATA-LOG-REC
798100200420             INVALID KEY
798200200420                CONTINUE
798300200420           END-WRITE.
798400200420      * RFS110904 - Ends
798500200420      * RFS121437 - Begins - Add new procedures
798600200420      *--------------------------------
798700200420       VALIDATE-DEALER-LICENSE SECTION.
798800200420      *--------------------------------
798900200420
799000200420           IF WS-EDIT-SEG-CONTR-PROV = "Y"
799100200420             MOVE Lc_ValidateDealer
799200200420                               TO DEALER-CODE OF DEALER-PROV-LICENSE
799300200420      *RFS116449 Start
799400200420             MOVE ACCOUNT-NO OF TRANS TO ACCOUNT-NO
799500200420                             OF ACCOUNT-MISC-DETAILS
799600200420
799700200420             READ ACCOUNT-MISC-DETAILS
799800200420128786            WITH NO LOCK
799900200420              NOT INVALID KEY
800000200420               IF JURISDICTION-PROVINCE-CODE OF ACCOUNT-MISC-DETAILS
800100200420               NOT = " "
800200200420                   MOVE JURISDICTION-PROVINCE-CODE
800300200420                             OF ACCOUNT-MISC-DETAILS
800400200420                             TO Lc_ValidateProvince
800500200420               END-IF
800600200420             END-READ
800700200420      *RFS116449 End.
800800200420             MOVE Lc_ValidateProvince
800900200420                               TO PROVINCE-CODE
801000200420                               OF DEALER-PROV-LICENSE
801100200420
801200200420             READ DEALER-PROV-LICENSE
801300200420               INVALID KEY
801400200420                 INITIALIZE MFADELPLP OF DEALER-PROV-LICENSE
801500200420             END-READ
801600200420
801700200420             IF EXPIRY-DATE OF DEALER-PROV-LICENSE <=
801800200420                TRADE-DATE OF TRANS
801900200420
802000200420               IF WS-EDIT-SEG-JURISDICTION = "Y"
802100200420                 PERFORM CHECK-SAME-JURISDICTION
802200200420                   IF WS-SAME-JURISDICTION-FOUND = "Y"
802300200420                     CONTINUE
802400200420                   ELSE
802500200420                     MOVE "58"       TO REJECTION-CODE OF TRANS
802600200420                   END-IF
802700200420               ELSE
802800200420                 MOVE "58"       TO REJECTION-CODE OF TRANS
802900200420               END-IF
803000200420
803100200420             END-IF
803200200420
803300200420           END-IF.
803400200420      *rfs139287-START
803500200420
803600200420           IF TRANS-ORIGIN-CODE OF TRANS = lnc_DTH
803700200420              INITIALIZE PI_PLMNT_DATE1
803800200420                         PI_TRANS_NO1
803900200420                        PC_POANDLRFLG
804000200420            IF  REJECTION-CODE OF TRANS = "58"
804100200420
804200200420              MOVE PLACEMENT-DATE OF TRANS TO Pi_Plmnt_Date1
804300200420              MOVE TRANS-NO OF TRANS       TO pi_Trans_No1
804400200420
804500200420              CALL "FXANDLRVAL" USING  PI_PLMNT_DATE1
804600200420                                    PI_TRANS_NO1
804700200420                                    PC_POANDLRFLG
804800200420              MOVE PC_POANDLRFLG TO lc_DLRValidFLG
804900200420              IF lc_DLRValidFLG = lncc_N
805000200420               MOVE "00"       TO REJECTION-CODE OF TRANS
805100200420              END-IF
805200200420            END-IF
805300200420           END-IF.
805400200420      *rfs139287-End
805500200420
805600200420       VDL-EXIT.
805700200420           EXIT.
805800200420
805900200420      *------------------------------------
806000200420       VALIDATE-DEALER-REP-LICENSE SECTION.
806100200420      *------------------------------------
806200200420      * Test if dealer rep has seg. license authorization
806300200420
806400200420           IF WS-BLANKET-INSURANCE-LICENSE = "Y"
806500200420              CONTINUE
806600200420           ELSE
806700200420             MOVE Lc_ValidateDealer
806800200420               TO DEALER-CODE OF DEALER-REP-PROV-LICENSE
806900200420             MOVE Lc_ValidateDealerRep
807000200420               TO DEALER-REP-CODE
807100200420               OF DEALER-REP-PROV-LICENSE
807200200420      *RFS116449 Start
807300200420             MOVE ACCOUNT-NO OF TRANS TO ACCOUNT-NO
807400200420                             OF ACCOUNT-MISC-DETAILS
807500200420             READ ACCOUNT-MISC-DETAILS
807600200420128786            WITH NO LOCK
807700200420             NOT INVALID KEY
807800200420              IF JURISDICTION-PROVINCE-CODE OF ACCOUNT-MISC-DETAILS
807900200420              NOT = " "
808000200420                   MOVE JURISDICTION-PROVINCE-CODE
808100200420                              OF ACCOUNT-MISC-DETAILS
808200200420                              TO lc_ValidateProvince
808300200420              END-IF
808400200420             END-READ
808500200420      *RFS116449 End
808600200420
808700200420             MOVE lc_ValidateProvince
808800200420                               TO PROVINCE-CODE
808900200420                               OF DEALER-REP-PROV-LICENSE
809000200420
809100200420             READ DEALER-REP-PROV-LICENSE
809200200420             INVALID KEY
809300200420                 INITIALIZE MFADERPLP OF DEALER-REP-PROV-LICENSE
809400200420             END-READ
809500200420
809600200420             IF EXPIRY-DATE OF DEALER-REP-PROV-LICENSE <=
809700200420                TRADE-DATE OF TRANS
809800200420                 IF WS-EDIT-SEG-JURISDICTION = "Y"
809900200420                   PERFORM CHECK-SAME-JURISDICTION
810000200420                 ELSE
810100200420                   MOVE "N" TO WS-SAME-JURISDICTION-FOUND
810200200420                 END-IF
810300200420
810400200420                 IF (lnc_EditCodeREPLICSetupYes
810500200420                     AND lnc_origCodesForREPLIC
810600200420                     AND PURCHASE-TRANSACTION)
810700200420                     OR
810800200420                     WS-SAME-JURISDICTION-FOUND = "Y"
810900200420                   CONTINUE
811000200420                 ELSE
811100200420                   MOVE "58"       TO REJECTION-CODE OF TRANS
811200200420                 END-IF
811300200420             END-IF
811400200420
811500200420      *    "BLANKET" END-IF
811600200420           END-IF.
811700200420      *rfs139287-START
811800200420
811900200420           IF TRANS-ORIGIN-CODE OF TRANS = lnc_DTH
812000200420               INITIALIZE PI_PLMNT_DATE1
812100200420                          PI_TRANS_NO1
812200200420                          PC_POANDLRFLG
812300200420             IF  REJECTION-CODE OF TRANS = "58"
812400200420
812500200420               MOVE PLACEMENT-DATE OF TRANS TO Pi_Plmnt_Date1
812600200420               MOVE TRANS-NO OF TRANS       TO pi_Trans_No1
812700200420
812800200420               CALL "FXANDLRVAL" USING  PI_PLMNT_DATE1
812900200420                                        PI_TRANS_NO1
813000200420                                        PC_POANDLRFLG
813100200420               MOVE PC_POANDLRFLG TO lc_DLRValidFLG
813200200420              IF lc_DLRValidFLG = lncc_N
813300200420               MOVE "00"       TO REJECTION-CODE OF TRANS
813400200420              END-IF
813500200420             END-IF
813600200420           END-IF.
813700200420      *rfs139287-End
813800200420
813900200420       VDRL-EXIT.
814000200420           EXIT.
814100200420      * RFS121437 - Ends
814200200420
814300200420      * RFS 132067 - START
814400200420      *------------------------------------
814500200420       Calculate-GDV-MAT-Value SECTION.
814600200420      *------------------------------------
814700200420
814800200420               INITIALIZE MFATRCTGP OF TRANS-CONTRACT-TARGET-REC
814900200420
815000200420               MOVE PLACEMENT-DATE   OF TRANS
815100200420               TO PLACEMENT-DATE OF TRANS-CONTRACT-TARGET
815200200420
815300200420               MOVE TRANS-NO         OF TRANS
815400200420               TO TRANS-NO OF TRANS-CONTRACT-TARGET
815500200420
815600200420               MOVE ZEROES
815700200420               TO  CONTRACT-NO  OF TRANS-CONTRACT-TARGET
815800200420
815900200420               MOVE PLACEMENT-DATE   OF TRANS
816000200420               TO PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET
816100200420
816200200420               MOVE TRANS-NO    OF TRANS
816300200420               TO TRANS-NO-2    OF TRANS-CONTRACT-TARGET
816400200420
816500200420               MOVE ZEROES
816600200420               TO CONTRACT-NO-2    OF TRANS-CONTRACT-TARGET
816700200420
816800200420               START TRANS-CONTRACT-TARGET
816900200420               KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
817000200420               INVALID KEY
817100200420                 PERFORM CGMV-EXIT
817200200420               END-START
817300200420
817400200420               READ TRANS-CONTRACT-TARGET NEXT RECORD
817500200420               WITH NO LOCK
817600200420               AT END
817700200420                 PERFORM CGMV-EXIT
817800200420               NOT AT END
817900200420
818000200420                 IF ((PLACEMENT-DATE OF TRANS  = PLACEMENT-DATE OF
818100200420                 TRANS-CONTRACT-TARGET) AND (TRANS-NO OF TRANS =
818200200420                 TRANS-NO OF TRANS-CONTRACT-TARGET))
818300200420
818400200420                   INITIALIZE MFAACCONP OF ACCOUNT-CONTRACT-REC
818500200420
818600200420                   MOVE ACCOUNT-NO OF TRANS TO
818700200420                   ACCOUNT-NO OF ACCOUNT-CONTRACT
818800200420
818900200420                   MOVE CONTRACT-NO OF TRANS-CONTRACT-TARGET  TO
819000200420                   CONTRACT-NO OF ACCOUNT-CONTRACT
819100200420
819200200420                   READ Account-Contract
819300200420                   INVALID KEY
819400200420                     PERFORM CGMV-EXIT
819500200420                   NOT INVALID KEY
819600200420136374*             MOVE Guarantee-Dth-Percent OF
819700200420136374*              Account-Contract
819800200420136374*                   TO ln_NewGDVPercent
819900200420136374              CONTINUE
820000200420                   END-READ
820100200420                 END-IF
820200200420               END-READ.
820300200420
820400200420       CGMV-EXIT.
820500200420            EXIT.
820600200420      * RFS 132067 - End
820700200420      * RFS 139288 - Start
820800200420       GET-INSURANCE-FEE  SECTION.
820900200420      * RFS 146960 - Start
821000200420      *RFS170108 - START
821100200420      *     INITIALIZE WS-INSURANCE-FEE
821200200420           INITIALIZE WS-INSURANCE-FEE.
821300200420      *MOVING LOGIC TO GET AWD-SEQNO TO NEW SECTION GET-AWD-SEQNO
821400200420      *                Pi_Plmnt_Date
821500200420      *                Pi_Trans_No
821600200420      *                Pc_AwdSeqNo
821700200420      *                WS-AWD-SEQNO.
821800200420      *
821900200420      *    MOVE PLACEMENT-DATE OF TRANS TO Pi_Plmnt_Date.
822000200420      *    MOVE TRANS-NO OF TRANS       TO pi_Trans_No.
822100200420160885*    MOVE ACCOUNT-NO OF TRANS     TO PI_Account_Num.
822200200420      *
822300200420      *    CALL "FXAWDSEQ" USING  Pi_Plmnt_Date
822400200420      *                           Pi_Trans_No
822500200420160885*                           PI_Account_Num
822600200420      *                           Pc_AwdSeqNo.
822700200420      *    MOVE Pc_AwdSeqNo TO WS-AWD-SEQNO.
822800200420           PERFORM GET-AWD-SEQNO.
822900200420      *RFS170108 - END
823000200420      * RFS 146960 - End
823100200420160885     INITIALIZE MFAACCONP OF ACCOUNT-CONT-AGE-REC.
823200200420
823300200420           MOVE ACCOUNT-NO OF TRANS
823400200420                             TO ACCOUNT-NO OF ACCOUNT-CONT-AGE.
823500200420           MOVE ZEROES       TO START-DATE OF ACCOUNT-CONT-AGE.
823600200420
823700200420           START ACCOUNT-CONT-AGE
823800200420           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
823900200420           INVALID KEY
824000200420             GO TO GETINS-EXIT
824100200420           END-START.
824200200420
824300200420       GSS-0010.
824400200420
824500200420           READ ACCOUNT-CONT-AGE NEXT RECORD
824600200420           AT END
824700200420             GO TO GETINS-EXIT
824800200420           END-READ.
824900200420
825000200420           IF ACCOUNT-NO OF ACCOUNT-CONT-AGE IS NOT EQUAL
825100200420           ACCOUNT-NO OF TRANS
825200200420             GO TO GETINS-EXIT
825300200420           END-IF.
825400200420
825500200420       GSS-0020.
825600200420
825700200420           MOVE ACCOUNT-NO OF TRANS
825800200420                             TO ACCOUNT-NO
825900200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
826000200420
826100200420           MOVE INVESTMENT-CODE OF TRANS
826200200420                             TO INVESTMENT-CODE
826300200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
826400200420
826500200420           MOVE CONTRACT-NO OF ACCOUNT-CONT-AGE
826600200420                             TO CONTRACT-NO
826700200420                             OF ACCOUNT-CONTRACT-INVESTMENT.
826800200420
826900200420           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
827000200420           INVALID KEY
827100200420             GO TO GSS-0010
827200200420           END-READ.
827300200420
827400200420           IF CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
827500200420           IS EQUAL 0
827600200420             GO TO GSS-0010
827700200420           END-IF.
827800200420           INITIALIZE MFAACCCSP OF ACCOUNT-CONTRACT-SPIA-REC.
827900200420
828000200420           MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
828100200420                TO  ACCOUNT-NO OF Account-Contract-SPIA.
828200200420           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
828300200420                TO CONTRACT-NO OF Account-Contract-SPIA.
828400200420              READ Account-Contract-SPIA
828500200420                INVALID KEY MOVE SPACES TO WS-INSURANCE-FEE
828600200420                NOT INVALID KEY
828700200420146960          IF AWD-SEQ-NO OF ACCOUNT-CONTRACT-SPIA =
828800200420146960                           WS-AWD-SEQNO
828900200420                  MOVE INSURANCE-FEE OF Account-Contract-SPIA
829000200420                   TO WS-INSURANCE-FEE
829100200420                   GO TO GETINS-EXIT
829200200420146960          ELSE
829300200420146960            GO TO GSS-0010
829400200420146960          END-IF
829500200420              END-READ.
829600200420       GETINS-EXIT.
829700200420           EXIT.
829800200420      * RFS 139288 - End
829900200420      * RFS 146960 - Start
830000200420       READ-ACCSP SECTION.
830100200420           INITIALIZE lncc_ReadNxtACCSP.
830200200420           READ ACCOUNT-CONTRACT-SPIA
830300200420             NOT INVALID KEY
830400200420             IF AWD-SEQ-NO OF ACCOUNT-CONTRACT-SPIA =
830500200420                                WS-AWD-SEQNO
830600200420170108         OR WS-AWD-SEQNO = 0
830700200420               MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-SPIA
830800200420               TO CONTRACT-NO OF WS-TRANS-CONTRACT-DETAILS
830900200420               GO TO READ-ACCSP-EXT
831000200420             ELSE
831100200420                MOVE lncc_Y TO lncc_ReadNxtACCSP
831200200420             END-IF
831300200420             INVALID KEY
831400200420               GO TO READ-ACCSP-EXT
831500200420           END-READ.
831600200420       READ-ACCSP-EXT.
831700200420           EXIT.
831800200420      *RFS146960-ENd
831900200420      *RFS170108 - START
832000200420       GET-AWD-SEQNO SECTION.
832100200420           INITIALIZE  Pi_Plmnt_Date
832200200420                       Pi_Trans_No
832300200420                       Pc_AwdSeqNo
832400200420                       WS-AWD-SEQNO.
832500200420
832600200420           MOVE PLACEMENT-DATE OF TRANS TO Pi_Plmnt_Date.
832700200420           MOVE TRANS-NO OF TRANS       TO pi_Trans_No.
832800200420160885     MOVE ACCOUNT-NO OF TRANS     TO PI_Account_Num.
832900200420
833000200420           CALL "FXAWDSEQ" USING  Pi_Plmnt_Date
833100200420                                  Pi_Trans_No
833200200420160885                            PI_Account_Num
833300200420                                  Pc_AwdSeqNo.
833400200420           MOVE Pc_AwdSeqNo TO WS-AWD-SEQNO.
833500200426      *RFS170108 - END
833600200426
833700200426      *RFS185170 - START
833800200426       GetAccGLWBDetails SECTION.
833900200426           INITIALIZE pc_ACCGLWBD_Series
834000200426                      pc_ACCGLWBD_RiderApplicable.
834100210127180721*    IF lb_AccountLevelGLWBYes AND Switch-In-Transaction AND
834200210127180721     IF lb_AccountLevelGLWBYes AND SWITCH-TRANSACTION AND
834300210127180721        TRANSFER-GWB-FIEB OF SEG-SWITCH-TRF-OPT = lncc_Y AND
834400210127180721        lb_accountbenetitsexistsfalse
834500200609              MOVE Ws-Seg-Out-Account-No TO pi_ACCGLWBD_AccNo
834600200609           END-IF.
834700200426           CALL "FXACCGLWBD" USING pi_ACCGLWBD_AccNo,
834800200426                                   pc_ACCGLWBD_InvCode,
834900200426                                   pc_ACCGLWBD_AccLvlGLWB,
835000200426                                   pc_ACCGLWBD_Series,
835100200426                                   pc_ACCGLWBD_RiderApplicable.
835200999999      *RFS185170 - END
835300200706      *RFS184676-Starts
835400200706       DEP-DTH-VAL-CHECK SECTION.
835500200706           IF pc_DepLvlTracking_GDth  = SPACES
835600200706              INITIALIZE pi_AnnAge_GDth,
835700200706                         pi_DepAge_GDth,
835800200706                         li_AnnuitantContractAge
835900200706              MOVE Guar-Death-Sched-Code OF INVESTMENT-SEG
836000200706                   TO pc_SchedCode_GDth
836100200706              MOVE Trade-Date OF TRANS TO pd_SchedDate_Gdth
836200200706              MOVE Account-Type-Code OF ACCOUNT TO pc_AccType_GDth
836300200706              MOVE li_AnnuitantContractAge TO pi_AnnAge_GDth
836400200706              CALL "FXCHKGDTHV" USING pc_SchedCode_GDth,
836500200706                                      pd_SchedDate_Gdth,
836600200706                                      pc_AccType_GDth,
836700200706                                      pi_AnnAge_GDth,
836800200706                                      pi_DepAge_GDth,
836900200706                                      pc_DepLvlTracking_GDth,
837000200706                                      pi_AnnAgeThres_GDth,
837100200706                                      pi_Percent_GDth,
837200200824185172*                               pc_TrackingRule_GDth
837300200824185172                                pc_TrackingRule_GDth,
837400200706185172                                pc_AnnAgeRule_GDth
837500200706
837600200706               IF pc_DepLvlTracking_GDth = "Y"
837700200706                  SET pb_YoungerAnnuit TO TRUE
837800200706                  MOVE Account-No OF Trans TO pi_AnnuitAccountNo
837900200706                  CALL "FXACCANUIT" USING pc_AnnuitFlag,
838000200706                                          pi_AnnuitAccountNo,
838100200706                                          pi_AnnuitContractNo,
838200200706                                          pi_AnnSequenceNo,
838300200706                                          pc_AnnuitantStatus,
838400200706                                          pi_DateOfBirth,
838500200706                                          pc_FirstName,
838600200706                                          pc_LastName,
838700200706                                          pi_socialInsuranceNo,
838800200706                                          pc_sex,
838900200706                                          pc_AnnuitReturnCode
839000200706                  IF pi_DateOfBirth > 0
839100200706                     MOVE pi_DateOfBirth TO ld_YoungerAnnDOB
839200201023      * RFS1104392 - Start
839300201023                     IF lb_STRSMDYes
839400201023                        MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT TO
839500201023                                        pi_STRSMD_AccountNo
839600201023                        MOVE CONTRACT-XREF OF ACCOUNT-CONTRACT TO
839700201023                                        pc_STRSMD_ContractXref
839800201023                        MOVE TRADE-DATE OF TRANS TO
839900201023                                        pd_STRSMD_PassedDate
840000201023                        PERFORM GetSTRSMDDate
840100201023                        COMPUTE li_AnnuitantAge_GDth =
840200201023                        (pd_STRSMD_NewDate - ld_YoungerAnnDOB) / 10000
840300201023                     ELSE
840400201023      * RFS1104392 - End
840500201023                        COMPUTE li_AnnuitantAge_GDth =
840600201001      * RFS185172 - Begin
840700201001      *              (PASS-PROCESS-DATE-9 - ld_YoungerAnnDOB) / 10000
840800201023                        (Trade-Date OF TRANS - ld_YoungerAnnDOB) / 10000
840900201023104392               END-IF
841000200706                     IF pc_AnnAgeRule_GDth NOT = "2"
841100200706                       COMPUTE li_AnnuitantAge_GDth =
841200200706                           FUNCTION INTEGER-PART(li_AnnuitantAge_GDth)
841300200706                     END-IF
841400200706      * RFS185172 - End
841500200706                  END-IF
841600200706               END-IF
841700200706           END-IF.
841800200706
841900200706           IF pc_DepLvlTracking_GDth = "Y" AND ld_YoungerAnnDOB > 0
842000201026      * RFS1104392 - Start
842100201023              IF lb_STRSMDYes AND
842200201023                 CREATION-DATE OF ACCOUNT-CONTRACT = PASS-PROCESS-DATE-9
842300201023                 MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT TO
842400201023                                   pi_STRSMD_AccountNo
842500201023                 MOVE CONTRACT-XREF OF ACCOUNT-CONTRACT TO
842600201023                                   pc_STRSMD_ContractXref
842700201023                 MOVE START-DATE OF ACCOUNT-CONTRACT TO
842800201023                                   pd_STRSMD_PassedDate
842900201023                 PERFORM GetSTRSMDDate
843000201023                 COMPUTE li_AnnuitantContractAge =
843100201023                         (pd_STRSMD_NewDate - ld_YoungerAnnDOB) / 10000
843200201023              ELSE
843300201023      *RFS1104392 - End
843400201023                 COMPUTE li_AnnuitantContractAge =
843500201023                (START-DATE OF ACCOUNT-CONTRACT - ld_YoungerAnnDOB)
843600201023                 / 10000
843700201023104392        END-IF
843800200706      * RFS185172 - Begin
843900200706              IF pc_AnnAgeRule_GDth NOT = "2"
844000200706                COMPUTE li_AnnuitantContractAge =
844100200706                    FUNCTION INTEGER-PART(li_AnnuitantContractAge)
844200200706              END-IF
844300200706      * RFS185172 - End
844400200706              INITIALIZE pd_SchedDate_Gdth,
844500200706                         pi_AnnAge_GDth,
844600200706                         pi_DepAge_GDth
844700200706              MOVE START-DATE OF ACCOUNT-CONTRACT TO pd_SchedDate_Gdth
844800200706              MOVE li_AnnuitantContractAge TO pi_AnnAge_GDth
844900200706              CALL "FXCHKGDTHV" USING pc_SchedCode_GDth,
845000200706                                      pd_SchedDate_Gdth,
845100200706                                      pc_AccType_GDth,
845200200706                                      pi_AnnAge_GDth,
845300200706                                      pi_DepAge_GDth,
845400200706                                      pc_DepLvlTracking_GDth,
845500200706                                      pi_AnnAgeThres_GDth,
845600200824                                      pi_Percent_GDth,
845700200824185172*                               pc_TrackingRule_GDth
845800200824185172                                pc_TrackingRule_GDth,
845900200706185172                                pc_AnnAgeRule_GDth
846000200706
846100200706              IF li_AnnuitantAge_GDth > pi_AnnAgeThres_GDth
846200200706                 MOVE lncc_N TO WS-CONTRACT-MATCH
846300200706                 IF Ws-Edit-Specific-Contract NOT = lncc_Y
846400200706                    GO TO FSCM-0015
846500200706                 ELSE
846600200706                    GO TO FSCM-EXIT
846700200706                 END-IF
846800200706              END-IF
846900200706              IF li_AnnuitantAge_GDth <= pi_AnnAgeThres_GDth
847000200706                 GO TO FSCM-0090
847100200706              END-IF
847200200706           END-IF.
847300210127      *RFS184676-Ends
847400210127
847500210127      *RFS186198 START
847600210127       GET-SETPOL-STRUCTURE SECTION.
847700210127      *CALL FXSETPOL JUST USING INVESTMENT TO GET SETPOL STRUCTURE
847800210127           CALL "FXSETPOL" USING li_FXSETPOL_PlacementDate,
847900210127                                 li_FXSETPOL_TransNo,
848000210127                                 lc_FXSETPOL_GuarBeneElig,
848100210127                                 lc_FXSETPOL_InvCode,
848200210127                                 lc_FXSETPOL_InvStrucCode.
848300210127      *RFS186198 END
848400210127      *** RFS 185455 starts ***
848500210127      * ---------------------------------
848501210914      *RFS1117962 - Starts
848502210914      *RecalculateRiderResetDate.
848503210914       RecalculateRiderResetDate SECTION.
848700210127      * ---------------------------------
848800210127
848801210914       RRRD-0010.
848802210914      *RFS1117962 - End
848900210127           MOVE Lc_AccountLevelGLWB     TO Lc_Accountguarantee
849000210127           IF Lb_AccountguaranteeYes
849001210914      *RFS1117962 - Starts
849002210914           SET lc_DBRSTExistNo to true
849003210914           MOVE lncc_DBRST to lc_rstattributes
849004210914           PERFORM ReadAccountattributes thru
849005210914                   RAA-Exit
849006210914           IF lc_DBRSTExistNo
849007210914              SET lc_MBRSTExistNo to true
849008210914              MOVE lncc_MBRST to lc_rstattributes
849009210914              PERFORM ReadAccountattributes thru
849010210914                      RAA-Exit
849011210914           END-IF
849012210914           IF (lc_DBRSTExistYes OR lc_MBRSTExistYes)
849013210914      *RFS1117962- End
849100210127           INITIALIZE  pi_FXRESETDTE_AccountNo
849200210127                       pc_FXRESETDTE_Mode
849300210127                       Pc_FXRESETDTE_RiderTypeAdded
849400210127                       pc_FXRESETDTE_Calledfrom
849500210127                       pi_FXRESETDTE_DBGNextResetDte
849600210127                       pi_FXRESETDTE_DBGFinalResetDte
849700210127                       pi_FXRESETDTE_MBGNextResetDte
849800210127                       pi_FXRESETDTE_MBGFinalResetDte
849900210127                       pc_FXRESETDTE_ReturnCode
850000210127
850100210127           MOVE ACCOUNT-NO  OF TRANS TO pi_FXRESETDTE_AccountNo
850200210127           MOVE lncc_B              TO pc_FXRESETDTE_Mode
850300210127           MOVE lncc_TRNPST         TO pc_FXRESETDTE_Calledfrom
850400210127
850500210127           CALL "FXRESETDTE" USING pi_FXRESETDTE_AccountNo
850600210127                                   pc_FXRESETDTE_Mode
850700210127                                   Pc_FXRESETDTE_RiderTypeAdded
850800210127                                   pc_FXRESETDTE_Calledfrom
850900210127                                   pi_FXRESETDTE_DBGNextResetDte
851000210127                                   pi_FXRESETDTE_DBGFinalResetDte
851100210127                                   pi_FXRESETDTE_MBGNextResetDte
851200210127                                   pi_FXRESETDTE_MBGFinalResetDte
851300210127                                   pc_FXRESETDTE_ReturnCode
851301210914      *RFS1117962 - Start
851302210914           END-IF
851303210914      *RFS1117962 - End
851400210127           END-IF.
851500210127
851501210914      *RFS1117962 - Starts
851502210914       RRRD-Exit.
851503210914           Exit.
851504210914      *RFS1117962 - End
851505210914
851600210127      *** RFS 185455 Ends ***
851700210127
851800201023      *RFS1104392 - Start
851900201023       GetSTRSMDDate SECTION.
852000201023           INITIALIZE pd_STRSMD_NewDate
852100201023           CALL "GETSTRSMDD" USING pi_STRSMD_AccountNo,
852200201023                                   pc_STRSMD_ContractXref,
852300201023                                   pd_STRSMD_PassedDate,
852400201023                                   pd_STRSMD_NewDate
852500201023           .
852600201023      *RFS1104392 - End
852700210510      *RFS186888 - Starts
852800210512      * -------------------------------------------
852900210510       getRider SECTION.
853000210512      * -------------------------------------------
853100210512      * Populate account and investment from TRNS
853200210510           MOVE ACCOUNT-NO      OF TRANS TO pi_ACCGLWBD_AccNo
853300210510           MOVE INVESTMENT-CODE OF TRANS TO pc_ACCGLWBD_InvCode
853400210510           MOVE lc_AccountLevelGLWB      TO pc_ACCGLWBD_AccLvlGLWB
853500210512           CALL "FXACCGLWBD"   USING pi_ACCGLWBD_AccNo,
853600210512                                     pc_ACCGLWBD_InvCode,
853700210512                                     pc_ACCGLWBD_AccLvlGLWB,
853800210512                                     pc_ACCGLWBD_Series,
853900210512                                     pc_ACCGLWBD_RiderApplicable.
854000210510
854100210512      * -------------------------------------------
854200210510       getExcessThreshold SECTION.
854300210512      * -------------------------------------------
854400210512      * Get threshold
854500210510           INITIALIZE pn-ExcessThreshold
854600210510           Move  Investment-Code of Trans To
854700210510                        pc-InvestmentCode
854800210510           Move ACCOUNT-NO OF TRANS To pi-AccountNo
854801210914      *RFS1117962 - Starts
854802210914      *    PERFORM CallFXGLWBRULE
854803210914           PERFORM CallFXGLWBRULE.
854804210914      *RFS1117962 - End
855000210510      *RFS186888 - Ends
855100210724      *RFS1115261 Starts
855200210724        .
855300210724      * -------------------------------------------
855400210724       GetMATContractGDVPercent SECTION.
855500210724      * -------------------------------------------
855600210724           MOVE "DSR" TO WS-RELATIONSHIP-CODE.
855700210724
855800210724           PERFORM GET-TARGET-2.
855900210724
856000210724           IF WS-TARGET-NOT-FOUND = "Y"
856100210724              GO TO GMCG-EXIT
856200210724           END-IF.
856300210724
856400210724           MOVE TRANS-CONTRACT-DETAILS-REC TO
856500210724                                TRANS-CONTRACT-DTL-REC.
856600210724
856700210724           MOVE ACCOUNT-CONTRACT-REC TO
856800210724                                ACCOUNT-CONTRACT1-REC.
856900210724
857000210724           INITIALIZE MFATRCODP OF TRANS-CONTRACT-DETAILS-REC,
857100210724                      MFAACCONP OF ACCOUNT-CONTRACT-REC.
857200210724
857300210724           MOVE PLACEMENT-DATE OF TRANS-TARGET-2 TO
857400210724                        PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS,
857500210724                        li_TransContPlacementDate.
857600210724           MOVE TRANS-NO OF TRANS-TARGET-2  TO
857700210724                        TRANS-NO OF TRANS-CONTRACT-DETAILS,
857800210724                        li_TransContTransNo.
857900210724
858000210724           PERFORM GetTransContractDetails.
858100210724
858200210724           MOVE ACCOUNT-NO OF TRANS TO
858300210724                        ACCOUNT-NO OF ACCOUNT-CONTRACT.
858400210724           MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS TO
858500210724                        CONTRACT-NO OF ACCOUNT-CONTRACT.
858600210724
858700210724           READ ACCOUNT-CONTRACT
858800210724           WITH NO LOCK
858900210724           AT END
859000210724              INITIALIZE MFAACCONP OF ACCOUNT-CONTRACT
859100210724           NOT AT END
859200210724              IF ACCOUNT-NO  OF ACCOUNT-CONTRACT =
859300210724                 ACCOUNT-NO  OF TRANS  AND
859400210724                 CONTRACT-NO OF ACCOUNT-CONTRACT =
859500210724                 CONTRACT-NO OF TRANS-CONTRACT-DETAILS
859600210724                   MOVE GUARANTEE-DTH-PERCENT OF ACCOUNT-CONTRACT
859700210724                                              TO ln_NewGDVPercent
859800210724              ELSE
859900210724                 INITIALIZE MFAACCONP OF
860000210724                            ACCOUNT-CONTRACT
860100210724              END-IF
860200210724           END-READ.
860300210724
860400210724           MOVE TRANS-CONTRACT-DTL-REC TO
860500210724                                TRANS-CONTRACT-DETAILS-REC.
860600210724
860700210724           MOVE ACCOUNT-CONTRACT1-REC TO
860800210724                                ACCOUNT-CONTRACT-REC.
860900210724
861000210724       GMCG-EXIT.
861100210724           EXIT.
861200210724
861300210724      * -------------------------------------------
861400210724       GetTransContractDetails SECTION.
861500210724      * -------------------------------------------
861600210724           MOVE ZEROES TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
861700210724           START TRANS-CONTRACT-DETAILS
861800210724              KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
861900210724              INVALID KEY
862000210724                  INITIALIZE MFATRCODP OF TRANS-CONTRACT-DETAILS-REC
862100210724              NOT INVALID KEY
862200210724                  READ TRANS-CONTRACT-DETAILS NEXT RECORD
862300210724                  WITH NO LOCK
862400210724                  AT END
862500210724                   INITIALIZE MFATRCODP OF TRANS-CONTRACT-DETAILS-REC
862600210724                  NOT AT END
862700210724                   IF PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS NOT =
862800210724                      li_TransContPlacementDate    OR
862900210724                      TRANS-NO       OF TRANS-CONTRACT-DETAILS NOT =
863000210724                      li_TransContTransNo
863100210724                      INITIALIZE MFATRCODP OF
863200210724                                    TRANS-CONTRACT-DETAILS-REC
863300210724                   END-IF
863400210724                  END-READ
863500210724           END-START.
863600210724      *RFS1115261 Ends
863601210914      * RFS1117962 - Starts
863602210914      *----------------------------------------------
863603210914       ReadAccountattributes SECTION.
863604210914      *----------------------------------------------
863605210914
863606210914       RAA-0010.
863607210914           INITIALIZE MFAACCATP OF ACCOUNT-ATTRIBUTES-REC
863608210914           MOVE ACCOUNT-NO OF TRANS  TO ACCOUNT-NO
863609210914                                     OF ACCOUNT-ATTRIBUTES
863610210914           MOVE lc_rstattributes     TO ACCOUNT-ATTRIBUTE-CODE
863611210914                                     OF ACCOUNT-ATTRIBUTES
863612210914           READ ACCOUNT-ATTRIBUTES
863613210914           INVALID KEY
863614210914             CONTINUE
863615210914           NOT INVALID KEY
863616210914             IF lc_rstattributes = lncc_DBRST
863617210914                SET lc_DBRSTExistYes TO TRUE
863618210914             END-IF
863619210914             IF lc_rstattributes = lncc_MBRST
863620210914                SET lc_MBRSTExistYes TO TRUE
863621210929             END-IF
863622210929            END-READ. 
863623210914       RAA-Exit.
863624210929           Exit.
863625210929      * RFS1117962 - End
871200210914      
871300210914      *RFS187471 Starts
871400210914      *----------------------------------------------
871500210914       CalcAnnuitantAgeUsingDthSched SECTION.
871600210914      *----------------------------------------------
871700210914
871800210914       CAADS-0010.
871900210914
872000210914           INITIALIZE li_AnnuitantAge_GDth
872100210914                      li_Tempdate
872200210914                      Ws-Wk-Trade-Date.
872300210914           MOVE Trade-Date OF TRANS TO Ws-Wk-Trade-Date.
872400210914           MOVE pi_DateOfBirth TO li_TempDate.
872500210914           IF lc_AnnuitantAgeCalcRule = lncc_1
872600210914              COMPUTE li_AnnuitantAge_GDth = Ws-Wkt-Year -
872700210914                                             li_TempDateYear
872800210914           ELSE
872900210914              COMPUTE li_AnnuitantAge_GDth = (Trade-Date OF TRANS
873000210914                          - pi_DateOfBirth) / lnci_10000
873100210914           END-IF.
873200210914
873300210914       CAADS-Exit.
873400210914           Exit.
873500210914
873600210914       GetInvSegAttributes section.
873700210914
873800210914       GISA-0010.
873900210914
874000210914           Initialize Ws-Cmp-Guar-Death-Sched-Code.
874100210914           MOVE INVESTMENT-CODE OF TRANS
874200210914           TO   INVESTMENT-CODE OF INVESTMENT-SEG.
874300210914
874400210914           READ INVESTMENT-SEG
874500210914                INVALID KEY
874600210914                    Initialize Ws-Cmp-Guar-Death-Sched-Code
874700210914                NOT INVALID KEY
874800210914                    MOVE Guar-Death-Sched-Code of INVESTMENT-SEG
874900210914                      TO Ws-Cmp-Guar-Death-Sched-Code
875000210914           END-READ.
875100210914
875200210914       GISA-Exit.
875300210914            Exit.
875400210914
875500210914       GetGDTHVSCV section.
875600210914
875700210914       GDTHVSCV-0010.
875800210914
875900210914            Initialize pc_Schedulecode,
876000210914                       pi_Scheduledate,
876100210914                       pc_Accounttypecode,
876200210914                       pc_trackingrule,
876300210914                       pc_Annuitantagerule,
876400210914                       pc_Applypercentatdeposittd,
876500210914                       lb_DepTDDthPercentFlag,
876600210914                       lc_AnnuitantAgeCalcRule,
876700210914                       li_prevaccountno.
876800210914
876900210914            MOVE Ws-Cmp-Guar-Death-Sched-Code to pc_Schedulecode.
877000210914            MOVE trade-date of trans   to pi_Scheduledate.
877100210914            MOVE account-type-code of account to pc_Accounttypecode.
877200210914
877300210914            CALL "FXGDTHVSCV" using pc_Schedulecode,
877400210914                                    pi_Scheduledate,
877500210914                                    pc_Accounttypecode,
877600210914                                    pc_trackingrule,
877700210914                                    pc_Annuitantagerule,
877800210914                                    pc_Applypercentatdeposittd.
877900210914
878000210914            MOVE pc_Annuitantagerule to lc_AnnuitantAgeCalcRule.
878100210914            MOVE Account-no of trans to li_prevaccountno.
878200210914
878300210914            IF pc_Applypercentatdeposittd = lnc_Y
878400210914               SET lb_DepTDDthPercentYes to true
878500210914            END-IF.
878600210914
878700210914       GDTHVSCV-Exit.
878800210914           Exit.
878900210914      *RFS187471 End