000001170313      * %ATTR DBGVIEW(*SOURCE)
000101000000       IDENTIFICATION DIVISION.
000201000000       PROGRAM-ID.    DLRSACAL.
000301000000       AUTHOR.        REECE TAM
000401000000       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000501000000       DATE-WRITTEN.  APR   2001.
000601000000       DATE-COMPILED.
000701000000      ******************************************************************
000801000000      *                                                                *
000901000000      *    Dealer Reps Sales Assets Calculation                        *
001001000000      *                                                                *
001101000000      ******************************************************************
001201000000      *    C H A N G E   H I S T O R Y                                 *
001301000000      ******************************************************************
001401000000      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
001501000000      ******************************************************************
001601000000      * Reece Tam  * 2001/04/11   * RFS9627 - Calculate dealer reps'   *
001701000000      *            *              * sales and assets.                  *
001801011105      * Reece Tam  * 2001/11/05   * RFS11661- Use As-at-date for both  *
001901011105      *            *              * daily & conversion processes to get*
002001011105      *            *              * the exchange rate. Apply exchange  *
002101011105      *            *              * to the amount fields if fund is not*
002201011105      *            *              * in base currency. Include all CON  *
002301011108      *            *              * trades in the system in Assets for *
002401011108      *            *              * the daily process. Also, exclude   *
002501011108      *            *              * cancelled CON trades from Assets   *
002601011108      *            *              * due to CON changed to CAN upon     *
002701011108      *            *              * cancellation (1 trade left) unlike *
002801011108      *            *              * RVS that has 2 trades - HST & RVS. *
002901011130      * Daisy Ly   * 2001/11/30   * RFS12281- recompile                *
003001020531      * Fatema Haji* 2002/05/31   * RFS 13619 - Modified the insert
003101020531      *            *              * into the table DINVTRN so contracte
003201020531      *            *              * buys are reported in the extract on
003301020531      *            *              * subsequent days if it is the first
003401020531      *            *              * time a dealer rep is buying into an
003501020531      *            *              * investment.
003601020719      ******************************************************************
003701020719      * Tony       * 2002/07/11   * RFS14355-                          *
003801020719      * Punzalan   *              * -Use the YTD's instead of DLY's    *
003901020719      *            *              *  to validate the to skip record if *
004001020719      *            *              *  no transaction.                   *
004101020719      *            *              *                                    *
004201020821      * Shu Yin    * 2002/08/21   * RFS14731-                          *
004301020821      *            *              * -Include HST transactions in       *
004401020821      *            *              *  QTEMP/DINVTRN for the             *
004501020821      *            *              *  dealer/rep/investment that are not*
004601020821      *            *              *  in QTEMP/DLRINV.                  *
004701080117      ******************************************************************
004801080117      * Ade A      * 2008/01/21   * Rfs 42749 Modify to exclude DISTRI-*
004901080117      *            *              * BUTIION-FLAG = "S"                 *
005001080418      ******************************************************************
005101080418      * Pawel A.   * 2008/04/17   * RFS51170- Chenged program to       *
005201080418      *            *              * *MODULE and *PGM to apply          *
005301080418      *            *              * activation level QILE instead of   *
005401080418      *            *              * default *NEW                       *
005501080117      ******************************************************************
005601090715      * Brian L.   * 2009/07/15   * RFS68593- Added Distribution       *
005701090715      *            *              * transactions                       *
005801090902      ******************************************************************
005901090902      * Andy Chan  * 2009/09/02   * RFS73100- Extract daily distri trns*
006001090902      *            *              * to QTEMP for DLRSATRN to use       *
006101090921      ******************************************************************
006201090922      * Andy Chan  * 2009/09/21   * RFS73768  Do not jump to EOJ-EXIT  *
006301090929      ******************************************************************
006401090929      * Andy Chan  * 2009/09/29   * RFS74281- Fix 68593 to add MFATRNIDP
006501090929      ******************************************************************
006601091110      * M. Anwar   * 2009/11/10   * RFS74289- Make the following arrays*
006701091110      *            *              * variable sized                     *
006801091110      *            *              * 1) IV-INVESTMENT                   *
006901091110      *            *              * 2) II-INVESTMENT-ARRAY             *
007001100627      * Fatema Haji* 2010/06/25   * RFS83999- Extract trns             *
007101100627      *            *              * to QTEMP for DLRSATRN to use       *
007102161121      * Shaik Rabs * 2016/11/15   * RFS164535 - Fix decimal data error *
007103161121      *            *              * when there is a missing price on   *
007104161121      *            *              * an Inactive Investment.            *
007201091110      ******************************************************************
007301000000
007401000000       ENVIRONMENT DIVISION.
007501000000       CONFIGURATION SECTION.
007601000000       SOURCE-COMPUTER. IBM-AS400.
007701000000       OBJECT-COMPUTER. IBM-AS400.
007801000000       SPECIAL-NAMES.
007901000000           LOCAL-DATA IS WS-LOCAL.
008001000000      /
008101000000       INPUT-OUTPUT SECTION.
008201000000       FILE-CONTROL.
008301000000      **
008401000000           SELECT  DEALER-REP-SALES-ASSETS
008501000000                   ASSIGN          TO DATABASE-MFADLRSAP
008601000000                   ORGANIZATION    IS INDEXED
008701000000                   ACCESS          IS DYNAMIC
008801000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
008901000000                   FILE STATUS     IS WS-FILE-STATUS.
009001000000
009101000000           SELECT  DEALER-REP-SALES-ASSETS-EXT
009201000000                   ASSIGN          TO DATABASE-MFADLRSAXP
009301090719                   ORGANIZATION    IS SEQUENTIAL
009401090720R68593             ACCESS          IS SEQUENTIAL
009501090720R68593             FILE STATUS     IS WS-FILE-STATUS.
009601000000
009701000000           SELECT  INVESTMENT
009801000000                   ASSIGN          TO DATABASE-MFAINVP
009901000000                   ORGANIZATION    IS INDEXED
010001000000                   ACCESS          IS DYNAMIC
010101000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
010201000000                   FILE STATUS     IS WS-FILE-STATUS.
010301000000
010401000000           SELECT  INVESTMENT-NAME
010501000000                   ASSIGN          TO DATABASE-MFAINVNMP
010601000000                   ORGANIZATION    IS INDEXED
010701000000                   ACCESS          IS DYNAMIC
010801000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
010901000000                   FILE STATUS     IS WS-FILE-STATUS.
011001000000
011101000000           SELECT  INVESTMENT-LAST-UNIT-PRICE
011201000000                   ASSIGN          TO DATABASE-MFAINVLPP
011301000000                   ORGANIZATION    IS INDEXED
011401000000                   ACCESS          IS DYNAMIC
011501000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
011601000000                   FILE STATUS     IS WS-FILE-STATUS.
011701000000
011801000000           SELECT  INVESTMENT-UNIT-PRICE
011901000000                   ASSIGN          TO DATABASE-MFAINVUPLH
012001000000                   ORGANIZATION    IS INDEXED
012101000000                   ACCESS          IS DYNAMIC
012201000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
012301000000                                      WITH DUPLICATES
012401000000                   FILE STATUS     IS WS-FILE-STATUS.
012501000000
012601000000           SELECT  INVESTMENT-GROUP
012701000000                   ASSIGN          TO DATABASE-MFAINVGRP
012801000000                   ORGANIZATION    IS INDEXED
012901000000                   ACCESS          IS DYNAMIC
013001000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
013101000000                   FILE STATUS     IS WS-FILE-STATUS.
013201000000
013301000000           SELECT  PROGRAM-EXCHANGE-RATE
013401000000                   ASSIGN          TO DATABASE-MFAPRGERP
013501000000                   ORGANIZATION    IS INDEXED
013601000000                   ACCESS          IS DYNAMIC
013701000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
013801000000                   FILE STATUS     IS WS-FILE-STATUS.
013901000000
014001000000           SELECT  EXCHANGE-RATE-M
014101000000                   ASSIGN          TO DATABASE-MFAEXRHMP
014201000000                   ORGANIZATION    IS INDEXED
014301000000                   ACCESS          IS DYNAMIC
014401000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
014501000000                   FILE STATUS     IS WS-FILE-STATUS.
014601000000
014701000000           SELECT  CURRENCY-CODE
014801000000                   ASSIGN          TO DATABASE-MFACURP
014901000000                   ORGANIZATION    IS INDEXED
015001000000                   ACCESS          IS DYNAMIC
015101000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
015201000000                   FILE STATUS     IS WS-FILE-STATUS.
015301000000
015401000000           SELECT  DEALER-MAILING-INSTR
015501000000                   ASSIGN          TO DATABASE-MFADEAMIP
015601000000                   ORGANIZATION    IS INDEXED
015701000000                   ACCESS          IS DYNAMIC
015801000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
015901000000                   FILE STATUS     IS WS-FILE-STATUS.
016001000000
016101000000           SELECT  DEALER-REP-MAILING-INSTR
016201000000                   ASSIGN          TO DATABASE-MFADERMIP
016301000000                   ORGANIZATION    IS INDEXED
016401000000                   ACCESS          IS DYNAMIC
016501000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
016601000000                   FILE STATUS     IS WS-FILE-STATUS.
016701000000
016801000000           SELECT  DEALER-REP
016901000000                   ASSIGN          TO DATABASE-MFADEAREP
017001000000                   ORGANIZATION    IS INDEXED
017101000000                   ACCESS          IS DYNAMIC
017201000000                   RECORD KEY      IS EXTERNALLY-DESCRIBED-KEY
017301000000                   FILE STATUS     IS WS-FILE-STATUS.
017401000000
017501000000
017601000000       DATA DIVISION.
017701000000       FILE SECTION.
017801000000      **
017901000000       FD  DEALER-REP-SALES-ASSETS
018001000000           LABEL RECORDS ARE STANDARD.
018101000000       01  DEALER-REP-SALES-ASSETS-REC.
018201000000                                 COPY DD-ALL-FORMATS OF MFADLRSAP.
018301000000
018401000000       FD  DEALER-REP-SALES-ASSETS-EXT
018501000000           LABEL RECORDS ARE STANDARD.
018601000000       01  DLR-REP-SALES-ASSETS-EXT-REC.
018701000000                                 COPY DD-ALL-FORMATS OF MFADLRSAXP.
018801000000
018901000000       FD  INVESTMENT
019001000000           LABEL RECORDS ARE STANDARD.
019101000000       01  INVESTMENT-REC.       COPY DD-ALL-FORMATS OF MFAINVP.
019201000000
019301000000       FD  INVESTMENT-NAME
019401000000           LABEL RECORDS ARE STANDARD.
019501000000       01  INVESTMENT-NAME-REC.  COPY DD-ALL-FORMATS OF MFAINVNMP.
019601000000
019701000000       FD  INVESTMENT-LAST-UNIT-PRICE
019801000000           LABEL RECORDS ARE STANDARD.
019901000000       01  INVESTMENT-LAST-UNIT-PRICE-REC.
020001000000                                 COPY DD-ALL-FORMATS OF MFAINVLPP.
020101000000
020201000000       FD  INVESTMENT-UNIT-PRICE
020301000000           LABEL RECORDS ARE STANDARD.
020401000000       01  INVESTMENT-UNIT-PRICE-REC.
020501000000                                 COPY DD-ALL-FORMATS OF MFAINVUPLH.
020601000000
020701000000       FD  INVESTMENT-GROUP
020801000000           LABEL RECORDS ARE STANDARD.
020901000000       01  INVESTMENT-GROUP-REC. COPY DD-ALL-FORMATS OF MFAINVGRP.
021001000000
021101000000       FD  PROGRAM-EXCHANGE-RATE
021201000000           LABEL RECORDS ARE STANDARD.
021301000000       01  PROGRAM-EXCHANGE-RATE-REC.
021401000000                                 COPY DD-ALL-FORMATS OF MFAPRGERP.
021501000000
021601000000       FD  EXCHANGE-RATE-M
021701000000           LABEL RECORDS ARE STANDARD.
021801000000       01  EXCHANGE-RATE-M-REC.  COPY DD-ALL-FORMATS OF MFAEXRHMP.
021901000000
022001000000       FD  CURRENCY-CODE
022101000000           LABEL RECORDS ARE STANDARD.
022201000000       01  CURRENCY-CODE-REC.    COPY DD-ALL-FORMATS OF MFACURP.
022301000000
022401000000       FD  DEALER-MAILING-INSTR
022501000000           LABEL RECORDS ARE STANDARD.
022601000000       01  DEALER-MAILING-INSTR-REC.
022701000000                                 COPY DD-ALL-FORMATS OF MFADEAMIP.
022801000000
022901000000       FD  DEALER-REP-MAILING-INSTR
023001000000           LABEL RECORDS ARE STANDARD.
023101000000       01  DEALER-REP-MAILING-INSTR-REC.
023201000000                                 COPY DD-ALL-FORMATS OF MFADERMIP.
023301000000
023401000000       FD  DEALER-REP
023501000000           LABEL RECORDS ARE STANDARD.
023601000000       01  DEALER-REP-REC.       COPY DD-ALL-FORMATS OF MFADEAREP.
023701000000
023801000000      /
023901000000       WORKING-STORAGE SECTION.
024001000000
024101000000           EXEC SQL
024201000000              INCLUDE SQLCA
024301000000              END-EXEC.
024401000000
024501000000       01 QCMDEXC-AREA.
024601000000          03 CLRPFM-DLRINV-COMMAND       PIC X(40)
024701000000             VALUE "CLRPFM QTEMP/DLRINV".
024801000000
024901000000          03 CLRPFM-DINVTRN-COMMAND      PIC X(40)
025001000000             VALUE "CLRPFM QTEMP/DINVTRN".
025101000000
025201000000          03 QCMDEXC-LENGTH              PIC S9(10)V9(5) COMP-3
025301000000                                         VALUE 40.
025401000000
025501000000       01 CURR-CONTROLS.
025601000000          03 CURR-LEVEL1.
025701000000             05 CURR-LEVEL2.
025801000000               07 CURR-DEALER-REP-CODE   PIC X(6).
025901000000               07 CURR-LEVEL3.
026001000000                 09 CURR-DEALER-CODE     PIC X(4).
026101000000             05 CURR-INVESTMENT-CODE     PIC X(5).
026201000000
026301000000       01 PREV-CONTROLS.
026401000000          03 PREV-LEVEL1.
026501000000             05 PREV-LEVEL2.
026601000000               07 PREV-DEALER-REP-CODE   PIC X(6).
026701000000               07 PREV-LEVEL3.
026801000000                 09 PREV-DEALER-CODE     PIC X(4).
026901000000             05 PREV-INVESTMENT-CODE     PIC X(5).
027001000000
027101000000       01 PROGRAM-ID-CODE                PIC X(10) VALUE "DLRSACAL".
027201000000       01 ENGLISH-LANG                   PIC X(3)  VALUE "E".
027301000000       01 FRENCH-LANG                    PIC X(3)  VALUE "F".
027401000000       01 END-OF-DATA                    PIC X(3)  VALUE "EOD".
027501000000       01 DEFAULT-CODE                   PIC X(8)  VALUE "DEFAULT".
027601000000       01 UNITRAX-BASE-CURRENCY          PIC X(3).
027701000000       01 OPEN-FILES-ONCE                PIC X(1)  VALUE "Y".
027801000000
027901000000       01 SUPPRESS-FORM-CODE             PIC X(10) VALUE "SPSSA".
028001000000       01 WS-DEALER-SUPPRESS-FLAG        PIC X.
028101000000          88 DEALER-SUPPRESSED           VALUE "Y".
028201000000          88 DEALER-NOT-SUPPRESSED       VALUE "N".
028301000000       01 WS-REP-SUPPRESS-FLAG           PIC X.
028401000000          88 REP-SUPPRESSED              VALUE "Y".
028501000000          88 REP-NOT-SUPPRESSED          VALUE "N".
028601000000
028701000000       01 WRITE-DEALER-REP-SALES-ASSETS  PIC X.
028801000000
028901000000       01 PERIOD-WK                      PIC X(2) VALUE "WK".
029001000000       01 PERIOD-MO                      PIC X(2) VALUE "MO".
029101000000       01 PERIOD-QT                      PIC X(2) VALUE "QT".
029201000000       01 PERIOD-AN                      PIC X(2) VALUE "AN".
029301000000
029401000000       01 WS-FILES-OPENED                PIC X(1).
029501000000       01 WS-ERROR-LINE                  PIC X(80).
029601000000       01 WS-FILE-STATUS                 PIC X(2).
029701000000       01 WS-FILE-STATUS-FILE-NAME       PIC X(15).
029801000000       01 WS-INL-HIGH-VALUES             PIC X(1).
029901000000
030001000000       01 WS-PROCESS-YEAR                PIC S9(5) COMP-3.
030101000000
030201000000       01 WS-PROCESS-DATE-MINUS-ONE      PIC S9(8).
030301000000       01 WS-FORMAT-DATE-IN              FORMAT DATE "@Y%m%d".
030401000000       01 WS-FORMAT-DATE-OUT             FORMAT DATE "@Y%m%d".
030501000000
030601000000       01 WS-WEEK-END-AREA.
030701000000          03 WS-WEEK-END-FLAG            PIC X(1).
030801000000          03 WS-WEEK-START-DATE          PIC 9(8).
030901000000          03 WS-WEEK-END-DATE            PIC 9(8).
031001000000          03 WS-WEEK-TO-DATE             PIC 9(8).
031101000000          03 WS-WEEK-ERROR-FLAG          PIC X(1).
031201000000          03 WS-WEEK-ERROR-CODE          PIC X(3).
031301000000          03 WS-WEEK-ERROR-MESSAGE       PIC X(40).
031401000000
031501000000       01 WS-MONTH-END-AREA.
031601000000          03 WS-MONTH-END-FLAG           PIC X(1).
031701000000          03 WS-MONTH-START-DATE         PIC 9(8).
031801000000          03 WS-MONTH-END-DATE           PIC 9(8).
031901000000          03 WS-MONTH-TO-DATE            PIC 9(8).
032001000000          03 WS-MONTH-ERROR-FLAG         PIC X(1).
032101000000          03 WS-MONTH-ERROR-CODE         PIC X(3).
032201000000          03 WS-MONTH-ERROR-MESSAGE      PIC X(40).
032301000000
032401000000       01 WS-QUARTER-END-AREA.
032501000000          03 WS-QUARTER-END-FLAG         PIC X(1).
032601000000          03 WS-QUARTER-START-DATE       PIC 9(8).
032701000000          03 WS-QUARTER-END-DATE         PIC 9(8).
032801000000          03 WS-QUARTER-TO-DATE          PIC 9(8).
032901000000          03 WS-QUARTER-ERROR-FLAG       PIC X(1).
033001000000          03 WS-QUARTER-ERROR-CODE       PIC X(3).
033101000000          03 WS-QUARTER-ERROR-MESSAGE    PIC X(40).
033201000000
033301000000       01 WS-YEAR-END-AREA.
033401000000          03 WS-YEAR-END-FLAG            PIC X(1).
033501000000          03 WS-YEAR-START-DATE          PIC 9(8).
033601000000          03 WS-YEAR-END-DATE            PIC 9(8).
033701000000          03 WS-YEAR-TO-DATE             PIC 9(8).
033801000000          03 WS-YEAR-ERROR-FLAG          PIC X(1).
033901000000          03 WS-YEAR-ERROR-CODE          PIC X(3).
034001000000          03 WS-YEAR-ERROR-MESSAGE       PIC X(40).
034101000000
034201000000       01 WS-PERIOD                      PIC X(2).
034301000000       01 WS-PERIOD-ERROR-CODE           PIC X(3).
034401000000       01 WS-PERIOD-ERROR-MESSAGE        PIC X(40).
034501000000
034601000000       01 WS-START-DATE                  PIC 9(8).
034701000000       01 WS-START-TO-DATE               PIC 9(8).
034801000000       01 WS-END-DATE                    PIC 9(8).
034901000000
035001000000       01 WS-HISTORY-FLAG                PIC X(3).
035101000000
035201000000       01 WS-DATE                        PIC 9(8).
035301000000       01 WS-DATE-X REDEFINES WS-DATE.
035401000000          03 WS-DATE-YEAR                PIC 9(4).
035501000000          03 WS-DATE-MONTH               PIC 9(2).
035601000000          03 WS-DATE-DAY                 PIC 9(2).
035701000000
035801000000       01 WS-CURRENCY-CODE               PIC X(3).
035901000000       01 WS-EXCHANGE-RATE               PIC S9(4)V9(7)  COMP-3.
036001000000       01 WS-TRADE-DATE                  PIC S9(9)       COMP-3.
036101000000
036201000000       01 WS-TOTAL-AREA.
036301000000          03 WS-DETAIL-CNT-TOTAL         PIC S9(10)      COMP-3.
036401000000          03 WS-DETAIL-ASSETS-AMT-TOTAL  PIC S9(15)V9(2) COMP-3.
036501000000
036601000000       01 WS-DLR-REP-SALES-ASSETS-HEADER.
036701000000          03 SA-RECORD-TYPE              PIC X(3).
036801000000          03 PROCESS-DATE                PIC 9(8).
036901000000          03 WEEK-END                    PIC X(1).
037001000000          03 MONTH-END                   PIC X(1).
037101000000          03 QUARTER-END                 PIC X(1).
037201000000          03 YEAR-END                    PIC X(1).
037301000000          03 EXCHANGE-RATE               PIC 9(3)V9(7).
037401090720R68593*   03 FILLER                      PIC X(753).
037501090720R68593    03 FILLER                      PIC X(781).
037601000000
037701000000       01 WS-DLR-REP-SALES-ASSETS-TRAIL.
037801000000          03 SA-RECORD-TYPE              PIC X(3).
037901000000          03 SA-DETAIL-CNT               PIC 9(10).
038001000000          03 ASSETS-AMT                  PIC 9(13)V9(2).
038101090720R68593*   03 FILLER                      PIC X(750).
038201090720R68593    03 FILLER                      PIC X(778).
038301000000
038401000000       01 WS-HEADER-LEVEL-AREA.
038501000000          03 WS-HEADER-CURRENCY-CODE     PIC X(3).
038601000000          03 WS-HEADER-EXCHANGE-RATE     PIC S9(4)V9(7)  COMP-3.
038701000000          03 WS-HEADER-TRADE-DATE        PIC S9(9)       COMP-3.
038801000000          03 WS-HEADER-WRITTEN           PIC X(1).
038901000000
039001000000       01 WS-INVESTMENT-LEVEL-AREA.
039101000000          03 WS-INV-INDUSTRY-FUND-CODE   PIC X(5).
039201000000          03 WS-INV-NAME-LONG            PIC X(35).
039301000000          03 WS-INV-CURRENCY             PIC X(3).
039401000000          03 WS-INV-UNIT-PRICE           PIC S9(5)V9(4)  COMP-3.
039501000000          03 WS-INV-EXCHANGE-RATE        PIC S9(4)V9(7)  COMP-3.
039601000000          03 WS-INV-TRADE-DATE           PIC S9(9)       COMP-3.
039701000000          03 WS-INV-FOUND-FLAG           PIC X.
039801000000             88 WS-INV-FOUND             VALUE "Y".
039901000000             88 WS-INV-NOT-FOUND         VALUE "N".
040001000000          03 WS-INV-UNIT-PRICE-X         PIC Z(4)9.9(4)-.
040101000000          03 WS-INV-EXCHANGE-RATE-X      PIC Z(3)9(1).9(7)-.
040201000000          03 WS-INV-TRADE-DATE-X         PIC Z(8)9(1).
040301000000          03 WS-INV-MSG                  PIC X(10).
040401000000
040501000000      *   Account investments summary per each dealer rep investment:
040601000000
040701000000       01 WS-WORKING-FETCH-FLDS.
040801000000          02 WS-DLRINV-FETCH.
040901000000            05 WS-DEALER-CODE          PIC X(4).
041001000000            05 WS-DEALER-REP-CODE      PIC X(6).
041101000000            05 WS-INVESTMENT-CODE      PIC X(5).
041201000000            05 WS-CURR-UNIT-BAL        PIC S9(10)V9(03) PACKED-DECIMAL.
041301000000
041401000000
041501000000       01 DIC-CNT                      PIC S9(5) COMP-3.
041601000000       01 DIC-IDX-MAX                  PIC S9(5) COMP-3 VALUE 500.
041701090929       01 ln_Array-Size                PIC S9(09).
041801000000       01 DIC-FETCH-TABLE.
041901090929          02 DIC-FETCH-ARRAY OCCURS 500 TIMES.
042001000000            05 DIC-DEALER-CODE         PIC X(4).
042101000000            05 DIC-DEALER-REP-CODE     PIC X(6).
042201000000            05 DIC-INVESTMENT-CODE     PIC X(5).
042301000000
042401000000
042501000000       01 DID-CNT                      PIC S9(5) COMP-3.
042601000000       01 DID-IDX-MAX                  PIC S9(5) COMP-3 VALUE 500.
042701000000       01 DID-FETCH-TABLE.
042801000000          02 DID-FETCH-ARRAY OCCURS 500 TIMES.
042901000000            05 DID-DEALER-CODE         PIC X(4).
043001000000            05 DID-DEALER-REP-CODE     PIC X(6).
043101000000            05 DID-INVESTMENT-CODE     PIC X(5).
043201000000            05 DID-CURR-UNIT-BAL       PIC S9(10)V9(03) PACKED-DECIMAL.
043301000000
043401000000
043501000000      *   Trans summary per each dealer rep investment:
043601000000
043701000000       01 WS-TRANS-SUMMARY-AREA.
043801000000
043901000000      *   BUY trans
044001000000
044101000000          03 WS-BUY-HST-NET-AMT          PIC S9(13)V9(2) COMP-3.
044201000000          03 WS-BUY-HST-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
044301000000          03 WS-BUY-HST-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
044401000000          03 WS-BUY-HST-TRANS-CNT        PIC S9(9)       COMP-3.
044501000000          03 WS-BUY-CON-NET-AMT          PIC S9(13)V9(2) COMP-3.
044601000000          03 WS-BUY-CON-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
044701000000          03 WS-BUY-CON-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
044801000000          03 WS-BUY-CON-TRANS-CNT        PIC S9(9)       COMP-3.
044901000000          03 WS-BUY-RVS-NET-AMT          PIC S9(13)V9(2) COMP-3.
045001000000          03 WS-BUY-RVS-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
045101000000          03 WS-BUY-RVS-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
045201000000          03 WS-BUY-RVS-TRANS-CNT        PIC S9(9)       COMP-3.
045301000000          03 WS-BUY-CAN-NET-AMT          PIC S9(13)V9(2) COMP-3.
045401000000          03 WS-BUY-CAN-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
045501000000          03 WS-BUY-CAN-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
045601000000          03 WS-BUY-CAN-TRANS-CNT        PIC S9(9)       COMP-3.
045701011108R11661*      All contracted buys in the TRANS file, any process date.
045801011105R11661    03 WS-BUY-CON-NET-NOW          PIC S9(13)V9(2) COMP-3.
045901011105R11661    03 WS-BUY-CON-GROSS-NOW        PIC S9(13)V9(2) COMP-3.
046001011105R11661    03 WS-BUY-CON-UNIT-NOW         PIC S9(12)V9(3) COMP-3.
046101011105R11661    03 WS-BUY-CON-TRANS-NOW        PIC S9(9)       COMP-3.
046201000000
046301000000      *   SEL or COD trans
046401000000
046501000000          03 WS-SEL-HST-NET-AMT          PIC S9(13)V9(2) COMP-3.
046601000000          03 WS-SEL-HST-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
046701000000          03 WS-SEL-HST-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
046801000000          03 WS-SEL-HST-TRANS-CNT        PIC S9(9)       COMP-3.
046901000000          03 WS-SEL-CON-NET-AMT          PIC S9(13)V9(2) COMP-3.
047001000000          03 WS-SEL-CON-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
047101000000          03 WS-SEL-CON-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
047201000000          03 WS-SEL-CON-TRANS-CNT        PIC S9(9)       COMP-3.
047301000000          03 WS-SEL-RVS-NET-AMT          PIC S9(13)V9(2) COMP-3.
047401000000          03 WS-SEL-RVS-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
047501000000          03 WS-SEL-RVS-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
047601000000          03 WS-SEL-RVS-TRANS-CNT        PIC S9(9)       COMP-3.
047701000000          03 WS-SEL-CAN-NET-AMT          PIC S9(13)V9(2) COMP-3.
047801000000          03 WS-SEL-CAN-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
047901000000          03 WS-SEL-CAN-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
048001000000          03 WS-SEL-CAN-TRANS-CNT        PIC S9(9)       COMP-3.
048101011108R11661*      All contracted sells in the TRANS file, any process date.
048201011105R11661    03 WS-SEL-CON-NET-NOW          PIC S9(13)V9(2) COMP-3.
048301011105R11661    03 WS-SEL-CON-GROSS-NOW        PIC S9(13)V9(2) COMP-3.
048401011105R11661    03 WS-SEL-CON-UNIT-NOW         PIC S9(12)V9(3) COMP-3.
048501011105R11661    03 WS-SEL-CON-TRANS-NOW        PIC S9(9)       COMP-3.
048601000000
048701000000      *   TRO trans
048801000000
048901000000          03 WS-TRO-HST-NET-AMT          PIC S9(13)V9(2) COMP-3.
049001000000          03 WS-TRO-HST-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
049101000000          03 WS-TRO-HST-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
049201000000          03 WS-TRO-HST-TRANS-CNT        PIC S9(9)       COMP-3.
049301000000          03 WS-TRO-RVS-NET-AMT          PIC S9(13)V9(2) COMP-3.
049401000000          03 WS-TRO-RVS-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
049501000000          03 WS-TRO-RVS-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
049601000000          03 WS-TRO-RVS-TRANS-CNT        PIC S9(9)       COMP-3.
049701000000
049801000000      *   TRI trans
049901000000
050001000000          03 WS-TRI-HST-NET-AMT          PIC S9(13)V9(2) COMP-3.
050101000000          03 WS-TRI-HST-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
050201000000          03 WS-TRI-HST-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
050301000000          03 WS-TRI-HST-TRANS-CNT        PIC S9(9)       COMP-3.
050401000000          03 WS-TRI-RVS-NET-AMT          PIC S9(13)V9(2) COMP-3.
050501000000          03 WS-TRI-RVS-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
050601000000          03 WS-TRI-RVS-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
050701000000          03 WS-TRI-RVS-TRANS-CNT        PIC S9(9)       COMP-3.
050801000000
050901000000      *   SWO trans
051001000000
051101000000          03 WS-SWO-HST-NET-AMT          PIC S9(13)V9(2) COMP-3.
051201000000          03 WS-SWO-HST-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
051301000000          03 WS-SWO-HST-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
051401000000          03 WS-SWO-HST-TRANS-CNT        PIC S9(9)       COMP-3.
051501000000          03 WS-SWO-RVS-NET-AMT          PIC S9(13)V9(2) COMP-3.
051601000000          03 WS-SWO-RVS-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
051701000000          03 WS-SWO-RVS-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
051801000000          03 WS-SWO-RVS-TRANS-CNT        PIC S9(9)       COMP-3.
051901000000
052001000000      *   SWI trans
052101000000
052201000000          03 WS-SWI-HST-NET-AMT          PIC S9(13)V9(2) COMP-3.
052301000000          03 WS-SWI-HST-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
052401000000          03 WS-SWI-HST-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
052501000000          03 WS-SWI-HST-TRANS-CNT        PIC S9(9)       COMP-3.
052601000000          03 WS-SWI-RVS-NET-AMT          PIC S9(13)V9(2) COMP-3.
052701000000          03 WS-SWI-RVS-GROSS-AMT        PIC S9(13)V9(2) COMP-3.
052801000000          03 WS-SWI-RVS-UNIT-AMT         PIC S9(12)V9(3) COMP-3.
052901000000          03 WS-SWI-RVS-TRANS-CNT        PIC S9(9)       COMP-3.
053001000000
053101090715R68593*   Distribution trans
053201090715  |
053301090715  |       03 WS-Dis-Reinv-HST-AMT        PIC S9(13)V9(2) COMP-3.
053401090715  |       03 WS-Dis-Reinv-RVS-AMT        PIC S9(13)V9(2) COMP-3.
053501090715  v       03 WS-Dis-Cash-HST-AMT         PIC S9(13)V9(2) COMP-3.
053601090715R68593    03 WS-Dis-Cash-RVS-AMT         PIC S9(13)V9(2) COMP-3.
053701090715
053801000000      *   Calculated values per each dealer rep investment:
053901000000
054001000000       01 WS-SALES-ASSETS-AREA.
054101000000          03 WS-PURCHASE-AMT             PIC S9(13)V9(2) COMP-3.
054201000000          03 WS-PURCHASE-CNT             PIC S9(9)       COMP-3.
054301000000          03 WS-REDEMPTION-AMT           PIC S9(13)V9(2) COMP-3.
054401000000          03 WS-REDEMPTION-CNT           PIC S9(9)       COMP-3.
054501000000          03 WS-TRANSFER-OUT-AMT         PIC S9(13)V9(2) COMP-3.
054601000000          03 WS-TRANSFER-OUT-CNT         PIC S9(9)       COMP-3.
054701000000          03 WS-TRANSFER-IN-AMT          PIC S9(13)V9(2) COMP-3.
054801000000          03 WS-TRANSFER-IN-CNT          PIC S9(9)       COMP-3.
054901000000          03 WS-SWITCH-OUT-AMT           PIC S9(13)V9(2) COMP-3.
055001000000          03 WS-SWITCH-OUT-CNT           PIC S9(9)       COMP-3.
055101000000          03 WS-SWITCH-IN-AMT            PIC S9(13)V9(2) COMP-3.
055201000000          03 WS-SWITCH-IN-CNT            PIC S9(9)       COMP-3.
055301000000          03 WS-NET-SALES-AMT            PIC S9(13)V9(2) COMP-3.
055401000000          03 WS-ASSETS-UNIT              PIC S9(14)V9(3) COMP-3.
055501000000          03 WS-ASSETS-AMT               PIC S9(15)V9(2) COMP-3.
055601090715R68593    03 WS-Dist-Reinv-Amt           PIC S9(13)V9(2) COMP-3.
055701090715R68593    03 WS-Dist-Cash-Amt            PIC S9(13)V9(2) COMP-3.
055801000000
055901000000
056001000000      *   Parms to get trans summary per each dealer rep investment
056101000000      *   by calling DLRSATRN.
056201000000
056301000000       01 DLRSATRN-PARM                  PIC X(200).
056401000000       01 DLRSATRN-PARM-BUFFER REDEFINES DLRSATRN-PARM.
056501000000          03 DLRSATRN-PROCESS-OPTION     PIC X(1).
056601000000          03 DLRSATRN-ACTION-OPTION      PIC X(1).
056701000000          03 DLRSATRN-PROCESS-DATE       PIC S9(8).
056801000000          03 DLRSATRN-START-DATE         PIC S9(8).
056901000000          03 DLRSATRN-END-DATE           PIC S9(8).
057001000000          03 DLRSATRN-DEALER-CODE        PIC X(4).
057101000000          03 DLRSATRN-DEALER-REP-CODE    PIC X(6).
057201000000          03 DLRSATRN-INVESTMENT-CODE    PIC X(5).
057301000000          03 DLRSATRN-RETURN-CODE        PIC X(3).
057401000000          03 DLRSATRN-TRANS-TYPE-CODE    PIC X(3).
057501000000          03 DLRSATRN-TRANS-STATUS-CODE  PIC X(3).
057601000000          03 DLRSATRN-NET-AMT            PIC S9(13)V9(2).
057701000000          03 DLRSATRN-GROSS-AMT          PIC S9(13)V9(2).
057801000000          03 DLRSATRN-UNIT-AMT           PIC S9(12)V9(3).
057901000000          03 DLRSATRN-TRANS-CNT          PIC S9(9).
058001000000
058101000000
058201000000      *   Parms to get dealer rep investment unit balance
058301000000      *   by calling DLRSAUBL.
058401000000
058501000000       01 DLRSAUBL-PARM                  PIC X(200).
058601000000       01 DLRSAUBL-PARM-BUFFER REDEFINES DLRSAUBL-PARM.
058701000000          03 DLRSAUBL-PROCESS-OPTION     PIC X(1).
058801000000          03 DLRSAUBL-PROCESS-DATE       PIC S9(8).
058901000000          03 DLRSAUBL-DEALER-CODE        PIC X(4).
059001000000          03 DLRSAUBL-DEALER-REP-CODE    PIC X(6).
059101000000          03 DLRSAUBL-INVESTMENT-CODE    PIC X(5).
059201000000          03 DLRSAUBL-RETURN-CODE        PIC X(3).
059301000000          03 DLRSAUBL-UNIT-AMT           PIC S9(12)V9(3).
059401000000
059501000000
059601000000      *   Parms to call CALPEDATE to get period end information.
059701000000
059801000000       01 CALPEDATE-PARM                 PIC X(200).
059901000000       01 CALPEDATE-PARM-BUFFER REDEFINES CALPEDATE-PARM.
060001000000          03 CALPEDATE-PROCESS-DATE      PIC S9(8).
060101000000          03 CALPEDATE-PERIOD-OPTION     PIC X(2).
060201000000          03 CALPEDATE-RETURN-CODE       PIC X(3).
060301000000          03 CALPEDATE-PERIOD-START-DATE PIC S9(8).
060401000000          03 CALPEDATE-PERIOD-END-DATE   PIC S9(8).
060501000000          03 CALPEDATE-PERIOD-END-FLAG   PIC X(1).
060601000000          03 CALPEDATE-RETURN-MESSAGE    PIC X(40).
060701000000
060801000000
060901000000      *   Internal Investment array
061001000000
061101000000       01 IV-CNT                         PIC S9(5) COMP-3.
06120109111074289**01 IV-IDX-MAX                     PIC S9(5) COMP-3 VALUE 1024.
06130109111074289  01 IV-IDX-MAX                     PIC S9(5) COMP-3 VALUE 30000.
06140109111074289  01 ln_Array-Size-IV               PIC S9(09).
061501000000       01 IV-INVESTMENT-ARRAY.
06160109111074289**   05 IV-INVESTMENT OCCURS 1024 TIMES
06170109111074289**                    ASCENDING KEY IS IV-INVESTMENT-CODE
061801091110          05 IV-INVESTMENT OCCURS 1 TO 30000
061901091110                           DEPENDING ON ln_Array-Size-IV
062001091110                           ASCENDING KEY IS IV-INVESTMENT-CODE
062101000000                           INDEXED BY IV-IDX.
062201000000             07 IV-INVESTMENT-CODE       PIC X(5).
062301000000             07 IV-INDUSTRY-FUND-CODE    PIC X(5).
062401000000             07 IV-INVESTMENT-NAME-LONG  PIC X(35).
062501000000             07 IV-FIXED-OR-VARIABLE     PIC X.
062601000000             07 IV-CURRENCY              PIC X(3).
062602161121      *RFS164535 Begin
062701161121      *      07 IV-UNIT-PRICE            PIC S9(5)V9(4) COMP-3.
062801161121      *      07 IV-TRADE-DATE            PIC S9(9)      COMP-3.
062901161121      *      07 IV-EXCHANGE-RATE         PIC S9(4)V9(7) COMP-3.
062902161121             07 IV-UNIT-PRICE            PIC S9(5)V9(4) COMP-3 VALUE 0.
062903161121             07 IV-TRADE-DATE            PIC S9(9)      COMP-3 VALUE 0.
062904161121             07 IV-EXCHANGE-RATE         PIC S9(4)V9(7) COMP-3 VALUE 0.
062905161121      *RFS164535 End
063001000000             07 IV-INFO-LOGGED           PIC X(1).
063101000000
063201000000      *   Invalid Investment array
063301000000
063401000000       01 II-CNT                         PIC S9(5) COMP-3.
06350109111074289**01 II-IDX-MAX                     PIC S9(5) COMP-3 VALUE 100.
06360109111074289  01 II-IDX-MAX                     PIC S9(5) COMP-3 VALUE 30000.
06370109111074289  01 ln_Array-Size-II               PIC S9(09).
063801000000       01 II-INVESTMENT-ARRAY.
06390109111074289**   05 II-INVESTMENT OCCURS 100 TIMES
06400109111074289     05 II-INVESTMENT OCCURS 1 TO 30000
06410109111074289                      DEPENDING ON ln_Array-Size-II
064201000000                           INDEXED BY II-IDX.
064301000000             07 II-INVESTMENT-CODE       PIC X(5).
064401000000
064501000000
064601000000       01 WS-LOCAL-DATA-AREA.
064701000000          05 FILLER                      PIC X(998).
064801000000          05 PASS-AUTHORIZATION          PIC X(1).
064901000000          05 FILLER                      PIC X(25).
065001000000
065101000000
065201000000       01 ERR-ID-X                       PIC X(2).
065301000000       01 ERR-ID REDEFINES ERR-ID-X      PIC 9(2).
065401000000       01 ERROR-MSG-TABLE.
065501000000          03 FILLER                      PIC X(40)
065601000000             VALUE "SPECIAL MODULE AUTHORIZATION IS REQUIRED".
065701000000          03 FILLER                      PIC X(40)
065801000000             VALUE "INVALID PROCESS OPTION CODE             ".
065901000000          03 FILLER                      PIC X(40)
066001000000             VALUE "INVALID AS AT DATE                      ".
066101000000          03 FILLER                      PIC X(40)
066201000000             VALUE "INVALID PROCESS DATE                    ".
066301000000          03 FILLER                      PIC X(40)
066401000000             VALUE "SQL ERROR                               ".
066501000000          03 FILLER                      PIC X(40)
066601000000             VALUE "PERIOD END ERROR                        ".
066701000000          03 FILLER                      PIC X(40)
066801000000             VALUE "NO INVESTMENT FOUND                     ".
066901000000          03 FILLER                      PIC X(40)
067001000000             VALUE "INVESTMENT ARRAY SIZE EXCEEDED ERROR    ".
067101000000          03 FILLER                      PIC X(40)
067201000000             VALUE "                                        ".
067301000000          03 FILLER                      PIC X(40)
067401000000             VALUE "                                        ".
067501000000
067601000000       01 ERROR-MSG-ARRAY REDEFINES ERROR-MSG-TABLE.
067701000000          03 ERROR-MSG                   PIC X(40)
067801000000                                         OCCURS 10 TIMES
067901000000                                         INDEXED BY ERR-IDX.
068001000000
068101080201      *Rfs42749 begins
068201080201       01 lc_Constants.
068301080201          03  lc_S                       Pic X(01)  Value "S".
068401080201      *Rfs42749 ends
068501000000
068601000000      /
068701000000       LINKAGE SECTION.
068801000000        01 COMM-AREA                     PIC X(200).
068901000000        01 COMM-AREA-BUFFER REDEFINES COMM-AREA.
069001000000           03 COMM-PROCESS-OPTION        PIC X(1).
069101000000      * Process option:
069201000000      *   'D' - Daily process
069301000000      *   'C' - Conversion process
069401000000
069501000000           03 COMM-AS-AT-DATE            PIC S9(8).
069601000000      * As At Date is the current actual process date in the system
069701000000
069801000000           03 COMM-PROCESS-DATE          PIC S9(8).
069901000000      * For a daily process, it equals to As At Date.
070001000000      * For a conversion process, it may be any process date.
070101000000
070201000000      * Period end options:
070301000000           03 COMM-WEEK-END              PIC X(1).
070401000000      * 'Y' - Indicate week end, 'N' - otherwise
070501000000           03 COMM-MONTH-END             PIC X(1).
070601000000      * 'Y' - Indicate month end, 'N' - otherwise
070701000000           03 COMM-QUARTER-END           PIC X(1).
070801000000      * 'Y' - Indicate quarter end, 'N' - otherwise
070901000000           03 COMM-YEAR-END              PIC X(1).
071001000000      * 'Y' - Indicate year end, 'N' - otherwise
071101000000
071201000000      * Conversion options:
071301000000           03 COMM-CALC-WTD              PIC X(1).
071401000000      * 'Y' - Calculate start of week to (process date - 1)
071501000000           03 COMM-CALC-MTD              PIC X(1).
071601000000      * 'Y' - Calculate start of month to (process date - 1)
071701000000           03 COMM-CALC-QTD              PIC X(1).
071801000000      * 'Y' - Calculate start of quarter to (process date - 1)
071901000000           03 COMM-CALC-YTD              PIC X(1).
072001000000      * 'Y' - Calculate start of year to (process date - 1)
072101000000
072201000000           03 COMM-ADD-MTD-TO-QTD        PIC X(1).
072301000000      * 'Y' - Add month to date (start of month to (process date - 1))
072401000000      *       to quarter to date for efficiency.
072501000000      *       COMM-CALC-QTD should not be 'Y' if this option is chosen.
072601000000
072701000000           03 COMM-ADD-MTD-TO-YTD        PIC X(1).
072801000000      * 'Y' - Add month to date (start of month to (process date - 1))
072901000000      *       to year to date for efficiency.
073001000000      *       COMM-CALC-YTD should not be 'Y' if this option is chosen.
073101000000
073201000000           03 COMM-LOG-INVESTMENT-OPT    PIC X(1).
073301000000      * 'Y' - To log the investment information, 'N' - otherwise.
073401000000
073501000000           03 COMM-RETURN-CODE           PIC X(3).
073601000000      * Return code:
073701000000      *   '  ' - no error
073801000000      *   '01' - special module authorization is required
073901000000      *   '02' - invalid process option code, must be 'D' or 'C'
074001000000      *   '03' - invalid as at date
074101000000      *   '04' - invalid process date
074201000000      *   '05' - SQL error
074301000000      *   '06' - period end error encountered
074401000000      *   '07' - empty investment file
074501000000      *   '08' - internal investment array size exceeded error
074601000000
074701000000       PROCEDURE DIVISION USING  COMM-AREA.
074801000000      *----------------------------------
074901000000       MAINLINE SECTION.
075001000000      *----------------------------------
075101000000       ML-0000.
075201000000           PERFORM INITIAL-LOGIC.
075301000000           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
075401000000              GO TO ML-1200.
075501000000       ML-0010.
075601000000           PERFORM GET-CURRENT-RECORD.
075701000000       ML-0020.
075801000000           IF PREV-LEVEL1 IS EQUAL TO CURR-LEVEL1
075901000000              GO TO ML-1100.
076001000000           IF PREV-CONTROLS IS EQUAL TO LOW-VALUES
076101000000              GO TO ML-0040.
076201000000       ML-0030.
076301000000           PERFORM LEVEL-SUMMARY-1.
076401000000           IF PREV-LEVEL2 IS EQUAL TO CURR-LEVEL2
076501000000              GO TO ML-0100.
076601000000           PERFORM LEVEL-SUMMARY-2.
076701000000       ML-0035.
076801000000           IF PREV-LEVEL3 IS EQUAL TO CURR-LEVEL3
076901000000              GO TO ML-0090.
077001000000           PERFORM LEVEL-SUMMARY-3.
077101000000       ML-0040.
077201000000           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
077301000000              GO TO ML-1200.
077401000000       ML-0080.
077501000000           PERFORM LEVEL-REINIT-3.
077601000000       ML-0090.
077701000000           PERFORM LEVEL-REINIT-2.
077801000000       ML-0100.
077901000000           PERFORM LEVEL-REINIT-1.
078001000000           MOVE CURR-CONTROLS          TO PREV-CONTROLS.
078101000000       ML-1100.
078201000000           PERFORM DETAIL-PROCESSING.
078301000000           GO TO ML-0010.
078401000000       ML-1200.
078501000000           PERFORM END-JOB.
078601000000           GOBACK.
078701000000      /
078801000000      *----------------------------------
078901000000       INITIAL-LOGIC SECTION.
079001000000      *----------------------------------
079101000000
079201000000       INL-0010.
079301000000
079401000000           MOVE SPACES       TO COMM-RETURN-CODE.
079501000000
079601000000           MOVE LOW-VALUES   TO  CURR-CONTROLS
079701000000                                 PREV-CONTROLS.
079801000000
079901000000           INITIALIZE WS-HEADER-LEVEL-AREA.
080001000000           INITIALIZE WS-TOTAL-AREA.
080101000000
080201000000           MOVE "N"          TO WS-FILES-OPENED.
080301000000           MOVE "N"          TO WS-INL-HIGH-VALUES.
080401000000
080501000000
080601000000      *    Check special module authorization
080701000000
080801000000           ACCEPT WS-LOCAL-DATA-AREA FROM WS-LOCAL.
080901000000
081001000000           IF PASS-AUTHORIZATION NOT = "Y"
081101000000              MOVE "01"      TO COMM-RETURN-CODE
081201000000              GO TO INL-HIGH-VALUES.
081301000000
081401000000
081501000000           IF COMM-PROCESS-OPTION NOT = "D" AND "C"
081601000000              MOVE "02"      TO COMM-RETURN-CODE
081701000000              GO TO INL-HIGH-VALUES.
081801000000
081901000000
082001000000           IF COMM-AS-AT-DATE IS NOT NUMERIC OR
082101000000              COMM-AS-AT-DATE IS = 0
082201000000              MOVE "03"      TO COMM-RETURN-CODE
082301000000              GO TO INL-HIGH-VALUES.
082401000000
082501000000
082601000000           IF COMM-PROCESS-DATE IS NOT NUMERIC OR
082701000000              COMM-PROCESS-DATE = 0
082801000000              MOVE "04"      TO COMM-RETURN-CODE
082901000000              GO TO INL-HIGH-VALUES.
083001000000
083101000000
083201000000
083301000000           IF OPEN-FILES-ONCE NOT = "Y"
083401000000              GO TO INL-0020.
083501000000
083601000000
083701000000           EXEC SQL
083801000000           WHENEVER SQLERROR CONTINUE
083901000000           END-EXEC.
084001100628
084101100627      *    RFS 83999 Begins
084201100627           Exec SQL
084301100627              Drop Table QTEMP/SQTRNP
084401100627           End-Exec
084501100627
084601100627           Exec SQL
084701100627              Create Table QTEMP/SQTRNP  as (
084801100627                 Select TRANS_TYPE_CODE, TRANS_STATUS_CODE,
084901100627                        NET_AMT, GROSS_AMT,  UNIT_AMT,
085001100627                        DEALER_CODE, DEALER_REP_CODE, INVESTMENT_CODE
085101100627                   From MFATRNP ) with no data
085201100627           End-Exec
085301100627
085401100628           Perform Extract-Daily-Trns    Thru EDT-Exit
085501100628      *    RFS 83999 Ends
085601100627
08570109090273100      IF COMM-PROCESS-OPTION = "D"
08580109090273100         Perform Extract-ReInvest-Trns Thru ERT-Exit
08590109090273100      END-IF.
086001000000
086101000000      *    Dealer Rep Investment Account table and index
086201000000
086301000000           EXEC SQL
086401000000           CREATE TABLE QTEMP/DLRINV (DEALER_CODE CHAR ( 4) NOT NULL
086501000000           WITH DEFAULT, DEALER_REP_CODE CHAR ( 6) NOT NULL WITH
086601000000           DEFAULT, INVESTMENT_CODE CHAR ( 5) NOT NULL WITH DEFAULT,
086701000000           ACCOUNT_NO NUMERIC ( 9) NOT NULL WITH DEFAULT, CURR_UNIT_BAL
086801000000           DEC ( 13, 3) NOT NULL WITH DEFAULT)
086901000000           END-EXEC.
087001000000
087101000000
087201000000           EXEC SQL
087301000000           CREATE INDEX QTEMP/DLRINVIDX ON QTEMP/DLRINV (DEALER_CODE
087401000000           ASC, DEALER_REP_CODE ASC, INVESTMENT_CODE ASC)
087501000000           END-EXEC.
087601000000
087701000000
087801000000           CALL "QCMDEXC" USING CLRPFM-DLRINV-COMMAND,
087901000000                                QCMDEXC-LENGTH.
088001000000
088101000000
088201000000
088301000000      *    Dealer Rep Investment table
088401000000
088501000000           EXEC SQL
088601000000           CREATE TABLE QTEMP/DINVTRN (DEALER_CODE CHAR ( 4) NOT NULL
088701000000           WITH DEFAULT, DEALER_REP_CODE CHAR ( 6) NOT NULL WITH
088801000000           DEFAULT, INVESTMENT_CODE CHAR ( 5) NOT NULL WITH DEFAULT)
088901000000           END-EXEC.
089001000000
089101000000
089201000000
089301000000           EXEC SQL
089401000000           WHENEVER SQLERROR GOTO STOPPGM-0010
089501000000           END-EXEC.
089601000000
089701000000           EXEC SQL
089801000000           WHENEVER NOT FOUND GOTO INL-HIGH-VALUES
089901000000           END-EXEC.
090001000000
090101000000
090201000000           EXEC SQL
090301000000           INSERT INTO QTEMP/DLRINV (DEALER_CODE, DEALER_REP_CODE,
090401000000           INVESTMENT_CODE, ACCOUNT_NO, CURR_UNIT_BAL) SELECT
090501000000           A.DEALER_CODE, A.DEALER_REP_CODE, B.INVESTMENT_CODE,
090601000000           A.ACCOUNT_NO, B.CURR_UNIT_BAL FROM MFAACCNTP A, MFAACCIVP B
090701000000           WHERE A.ACCOUNT_NO = B.ACCOUNT_NO
090801000000           END-EXEC.
090901000000
091001000000
091101000000
091201000000           OPEN INPUT  INVESTMENT
091301000000                       INVESTMENT-NAME
091401000000                       INVESTMENT-LAST-UNIT-PRICE
091501000000                       INVESTMENT-UNIT-PRICE
091601000000                       INVESTMENT-GROUP
091701000000                       PROGRAM-EXCHANGE-RATE
091801000000                       EXCHANGE-RATE-M
091901000000                       CURRENCY-CODE
092001000000                       DEALER-MAILING-INSTR
092101000000                       DEALER-REP-MAILING-INSTR
092201000000                       DEALER-REP.
092301000000
092401000000
092501000000           MOVE "N"          TO OPEN-FILES-ONCE.
092601000000
092701000000       INL-0020.
092801000000
092901000000
093001000000           OPEN I-O    DEALER-REP-SALES-ASSETS
093101000000                OUTPUT DEALER-REP-SALES-ASSETS-EXT.
093201000000
093301000000           MOVE "Y"          TO WS-FILES-OPENED.
093401000000
093501000000
093601000000
093701000000      *    Remove dealer rep investments that have no account number
093801000000      *    from a conversion process.
093901000000
094001000000           EXEC SQL
094101000000           WHENEVER SQLERROR CONTINUE
094201000000           END-EXEC.
094301000000
094401000000
094501000000           EXEC SQL
094601000000           WHENEVER NOT FOUND GOTO INL-0030
094701000000           END-EXEC.
094801000000
094901000000
095001000000           EXEC SQL
095101000000           DELETE FROM QTEMP/DLRINV WHERE ACCOUNT_NO = 0
095201000000           END-EXEC.
095301000000
095401000000
095501000000       INL-0030.
095601000000
095701000000
095801000000      *    Extract dealer rep investments from Trans that have
095901000000      *    no account investments and include them in the process.
096001000000
096101000000           CALL "QCMDEXC" USING CLRPFM-DINVTRN-COMMAND,
096201000000                                QCMDEXC-LENGTH.
096301000000
096401000000
096501000000           EXEC SQL
096601000000           WHENEVER NOT FOUND GOTO INL-0040
096701000000           END-EXEC.
096801000000
096901000000
097001000000           EXEC SQL
097101000000           INSERT INTO QTEMP/DINVTRN (DEALER_CODE, DEALER_REP_CODE,
097201000000           INVESTMENT_CODE) SELECT DISTINCT DEALER_CODE,
097301000000           DEALER_REP_CODE, INVESTMENT_CODE FROM MFATRNP WHERE
09740102053113619 *    PROCESS_DATE = :comm-process-date
09750102053113619      PROCESS_DATE <= :comm-process-date AND
09760102082113619 *    TRANS_STATUS_CODE IN ("CON","SET","UNC","PND","VER")
09770102082114731      TRANS_STATUS_CODE IN ("CON","SET","UNC","PND","VER","HST")
097801000000           END-EXEC.
097901000000
098001000000
098101000000           EXEC SQL
098201000000           INSERT INTO QTEMP/DLRINV (DEALER_CODE, DEALER_REP_CODE,
098301000000           INVESTMENT_CODE) SELECT A.DEALER_CODE, A.DEALER_REP_CODE,
098401000000           A.INVESTMENT_CODE FROM QTEMP/DINVTRN A EXCEPTION JOIN
098501000000           QTEMP/DLRINV B ON A.DEALER_CODE = B.DEALER_CODE AND
098601000000           A.DEALER_REP_CODE = B.DEALER_REP_CODE AND A.INVESTMENT_CODE
098701000000           = B.INVESTMENT_CODE
098801000000           END-EXEC.
098901000000
099001000000
099101000000
099201000000       INL-0040.
099301000000
099401020719R14355
099501020719           EXEC SQL
099601020719           WHENEVER NOT FOUND GOTO INL-0040-0010
099701020719           END-EXEC.
099801020719R14355
099901020719           EXEC SQL
100001020719           INSERT INTO QTEMP/DLRINV  (DEALER_CODE, DEALER_REP_CODE,
100101020719           INVESTMENT_CODE) SELECT DISTINCT A.DEALER_CODE,
100201020719           A.DEALER_REP_CODE, A.INVESTMENT_CODE
100301020719           FROM MFADLRSAP A
100401020719              WHERE
100501020719                ( YTD_PURCHASE_AMT     >  0  OR
100601020719                  YTD_PURCHASE_CNT     >  0  OR
100701020719                  YTD_REDEMPTION_AMT   >  0  OR
100801020719                  YTD_REDEMPTION_CNT   >  0  OR
100901020719                  YTD_TRANSFER_OUT_AMT >  0  OR
101001020719                  YTD_TRANSFER_OUT_CNT >  0  OR
101101020719                  YTD_TRANSFER_IN_AMT  >  0  OR
101201020719                  YTD_TRANSFER_IN_CNT  >  0  OR
101301020719                  YTD_SWITCH_OUT_AMT   >  0  OR
101401020719                  YTD_SWITCH_OUT_CNT   >  0  OR
101501020719                  YTD_SWITCH_IN_AMT    >  0  OR
101601020719                  YTD_SWITCH_IN_CNT    >  0  OR
101701020719                  YTD_NET_SALES_AMT    >  0  )
101801020719              AND
101901020719                  NOT EXISTS
102001020719                 ( SELECT * FROM QTEMP/DLRINV  B
102101020719                   WHERE
102201020719                        A.DEALER_CODE     =  B.DEALER_CODE     AND
102301020719                        A.DEALER_REP_CODE =  B.DEALER_REP_CODE AND
102401020719                        A.INVESTMENT_CODE =  B.INVESTMENT_CODE )
102501020719           END-EXEC.
102601020719R14355
102701020719
102801020719       INL-0040-0010.
102901020719R14355
103001000000
103101000000           EXEC SQL
103201000000           WHENEVER SQLERROR GOTO STOPPGM-0010
103301000000           END-EXEC.
103401000000
103501000000           EXEC SQL
103601000000           WHENEVER NOT FOUND GOTO INL-HIGH-VALUES
103701000000           END-EXEC.
103801000000
103901000000
104001000000
104101000000           MOVE ZEROS        TO DID-CNT
104201000000                                DIC-CNT.
104301000000
104401000000
104501000000      *    Extract Dealer Rep Investments for daily process
104601000000      *    - using the current unit balance in the account investments.
104701000000
104801000000           IF COMM-PROCESS-OPTION = "D"
104901000000
105001000000           EXEC SQL
105101000000           DECLARE DLRINDCUR CURSOR FOR SELECT DEALER_CODE,
105201000000           DEALER_REP_CODE, INVESTMENT_CODE, SUM(CURR_UNIT_BAL) FROM
105301000000           QTEMP/DLRINV GROUP BY DEALER_CODE, DEALER_REP_CODE,
105401000000           INVESTMENT_CODE ORDER BY DEALER_CODE, DEALER_REP_CODE,
105501000000           INVESTMENT_CODE FOR READ ONLY
105601000000           END-EXEC
105701000000
105801000000
105901000000           EXEC SQL
106001000000           OPEN DLRINDCUR
106101000000           END-EXEC
106201000000
106301000000           END-IF.
106401000000
106501000000
106601000000
106701000000      *    Extract Dealer Rep Investments for conversion process
106801000000      *    - the unit balance will be calculated.
106901000000
107001000000           IF COMM-PROCESS-OPTION = "C"
107101000000
107201000000           EXEC SQL
107301000000           DECLARE DLRINCCUR CURSOR FOR SELECT DISTINCT DEALER_CODE,
107401000000           DEALER_REP_CODE, INVESTMENT_CODE FROM QTEMP/DLRINV ORDER BY
107501000000           DEALER_CODE, DEALER_REP_CODE, INVESTMENT_CODE FOR READ ONLY
107601000000           END-EXEC
107701000000
107801000000
107901000000           EXEC SQL
108001000000           OPEN DLRINCCUR
108101000000           END-EXEC
108201000000
108301000000           END-IF.
108401000000
108501000000
108601000000
108701000000
108801000000           MOVE COMM-PROCESS-DATE
108901000000                             TO WS-DATE
109001000000           MOVE WS-DATE-YEAR TO WS-PROCESS-YEAR.
109101000000
109201000000
109301000000           PERFORM LOAD-BASE-CURRENCY-EXCHANGE.
109401000000
109501000000
109601000000           PERFORM LOAD-PERIOD-END-AREAS.
109701000000
109801000000           IF WS-INL-HIGH-VALUES = "Y"
109901000000              GO TO INL-HIGH-VALUES.
110001000000
110101000000
110201000000           PERFORM LOAD-INVESTMENT-ARRAY.
110301000000
110401000000           IF WS-INL-HIGH-VALUES = "Y"
110501000000              GO TO INL-HIGH-VALUES.
110601000000
110701000000
110801000000           PERFORM OUTPUT-SALES-ASSETS-HEADER.
110901000000
111001000000           GO TO INL-EXIT.
111101000000
111201000000
111301000000       INL-HIGH-VALUES.
111401000000
111501000000           MOVE HIGH-VALUES  TO CURR-CONTROLS.
111601000000
111701000000       INL-EXIT.
111801000000           EXIT.
111901000000      /
112001000000      *----------------------------------
112101000000       LOAD-PERIOD-END-AREAS SECTION.
112201000000      *----------------------------------
112301000000
112401000000       LPE-0010.
112501000000
112601000000           INITIALIZE WS-WEEK-END-AREA
112701000000                      WS-MONTH-END-AREA
112801000000                      WS-QUARTER-END-AREA
112901000000                      WS-YEAR-END-AREA.
113001000000
113101000000           MOVE COMM-PROCESS-DATE
113201000000                             TO WS-FORMAT-DATE-IN.
113301000000
113401000000           MOVE FUNCTION SUBTRACT-DURATION
113501000000                (WS-FORMAT-DATE-IN DAYS 1)
113601000000                             TO WS-FORMAT-DATE-OUT.
113701000000
113801000000           MOVE WS-FORMAT-DATE-OUT
113901000000                             TO WS-PROCESS-DATE-MINUS-ONE
114001000000                                WS-WEEK-TO-DATE
114101000000                                WS-MONTH-TO-DATE
114201000000                                WS-QUARTER-TO-DATE
114301000000                                WS-YEAR-TO-DATE.
114401000000
114501000000
114601000000      *    Get week end information
114701000000
114801000000           INITIALIZE CALPEDATE-PARM-BUFFER.
114901000000
115001000000           MOVE COMM-PROCESS-DATE
115101000000                             TO CALPEDATE-PROCESS-DATE.
115201000000           MOVE PERIOD-WK    TO CALPEDATE-PERIOD-OPTION.
115301000000
115401000000           CALL "CALPEDATE" USING CALPEDATE-PARM.
115501000000
115601000000           IF CALPEDATE-RETURN-CODE NOT = SPACES
115701000000              MOVE "Y"       TO WS-WEEK-ERROR-FLAG
115801000000              MOVE CALPEDATE-RETURN-CODE
115901000000                             TO WS-WEEK-ERROR-CODE
116001000000              MOVE CALPEDATE-RETURN-MESSAGE
116101000000                             TO WS-WEEK-ERROR-MESSAGE
116201000000           ELSE
116301000000              MOVE CALPEDATE-PERIOD-END-FLAG
116401000000                             TO WS-WEEK-END-FLAG
116501000000              MOVE CALPEDATE-PERIOD-START-DATE
116601000000                             TO WS-WEEK-START-DATE
116701000000              MOVE CALPEDATE-PERIOD-END-DATE
116801000000                             TO WS-WEEK-END-DATE.
116901000000
117001000000
117101000000      *    Get month end information
117201000000
117301000000           INITIALIZE CALPEDATE-PARM-BUFFER.
117401000000
117501000000           MOVE COMM-PROCESS-DATE
117601000000                             TO CALPEDATE-PROCESS-DATE.
117701000000           MOVE PERIOD-MO    TO CALPEDATE-PERIOD-OPTION.
117801000000
117901000000           CALL "CALPEDATE" USING CALPEDATE-PARM.
118001000000
118101000000           IF CALPEDATE-RETURN-CODE NOT = SPACES
118201000000              MOVE "Y"       TO WS-MONTH-ERROR-FLAG
118301000000              MOVE CALPEDATE-RETURN-CODE
118401000000                             TO WS-MONTH-ERROR-CODE
118501000000              MOVE CALPEDATE-RETURN-MESSAGE
118601000000                             TO WS-MONTH-ERROR-MESSAGE
118701000000           ELSE
118801000000              MOVE CALPEDATE-PERIOD-END-FLAG
118901000000                             TO WS-MONTH-END-FLAG
119001000000              MOVE CALPEDATE-PERIOD-START-DATE
119101000000                             TO WS-MONTH-START-DATE
119201000000              MOVE CALPEDATE-PERIOD-END-DATE
119301000000                             TO WS-MONTH-END-DATE.
119401000000
119501000000
119601000000      *    Get quarter end information
119701000000
119801000000           INITIALIZE CALPEDATE-PARM-BUFFER.
119901000000
120001000000           MOVE COMM-PROCESS-DATE
120101000000                             TO CALPEDATE-PROCESS-DATE.
120201000000           MOVE PERIOD-QT    TO CALPEDATE-PERIOD-OPTION.
120301000000
120401000000           CALL "CALPEDATE" USING CALPEDATE-PARM.
120501000000
120601000000           IF CALPEDATE-RETURN-CODE NOT = SPACES
120701000000              MOVE "Y"       TO WS-QUARTER-ERROR-FLAG
120801000000              MOVE CALPEDATE-RETURN-CODE
120901000000                             TO WS-QUARTER-ERROR-CODE
121001000000              MOVE CALPEDATE-RETURN-MESSAGE
121101000000                             TO WS-QUARTER-ERROR-MESSAGE
121201000000           ELSE
121301000000              MOVE CALPEDATE-PERIOD-END-FLAG
121401000000                             TO WS-QUARTER-END-FLAG
121501000000              MOVE CALPEDATE-PERIOD-START-DATE
121601000000                             TO WS-QUARTER-START-DATE
121701000000              MOVE CALPEDATE-PERIOD-END-DATE
121801000000                             TO WS-QUARTER-END-DATE.
121901000000
122001000000
122101000000      *    Get year end information
122201000000
122301000000           INITIALIZE CALPEDATE-PARM-BUFFER.
122401000000
122501000000           MOVE COMM-PROCESS-DATE
122601000000                             TO CALPEDATE-PROCESS-DATE.
122701000000           MOVE PERIOD-AN    TO CALPEDATE-PERIOD-OPTION.
122801000000
122901000000           CALL "CALPEDATE" USING CALPEDATE-PARM.
123001000000
123101000000           IF CALPEDATE-RETURN-CODE NOT = SPACES
123201000000              MOVE "Y"       TO WS-YEAR-ERROR-FLAG
123301000000              MOVE CALPEDATE-RETURN-CODE
123401000000                             TO WS-YEAR-ERROR-CODE
123501000000              MOVE CALPEDATE-RETURN-MESSAGE
123601000000                             TO WS-YEAR-ERROR-MESSAGE
123701000000           ELSE
123801000000              MOVE CALPEDATE-PERIOD-END-FLAG
123901000000                             TO WS-YEAR-END-FLAG
124001000000              MOVE CALPEDATE-PERIOD-START-DATE
124101000000                             TO WS-YEAR-START-DATE
124201000000              MOVE CALPEDATE-PERIOD-END-DATE
124301000000                             TO WS-YEAR-END-DATE.
124401000000
124501000000
124601000000           IF COMM-CALC-WTD         = "Y" AND
124701000000              WS-WEEK-ERROR-FLAG    = "Y"
124801000000              MOVE "Y"       TO WS-INL-HIGH-VALUES
124901000000              MOVE PERIOD-WK TO WS-PERIOD
125001000000              MOVE WS-WEEK-ERROR-CODE
125101000000                             TO WS-PERIOD-ERROR-CODE
125201000000              MOVE WS-WEEK-ERROR-MESSAGE
125301000000                             TO WS-PERIOD-ERROR-MESSAGE
125401000000              PERFORM PERIOD-MESSAGE-HANDLING.
125501000000
125601000000
125701000000           IF COMM-CALC-MTD         = "Y" AND
125801000000              WS-MONTH-ERROR-FLAG   = "Y"
125901000000              MOVE "Y"       TO WS-INL-HIGH-VALUES
126001000000              MOVE PERIOD-MO TO WS-PERIOD
126101000000              MOVE WS-MONTH-ERROR-CODE
126201000000                             TO WS-PERIOD-ERROR-CODE
126301000000              MOVE WS-MONTH-ERROR-MESSAGE
126401000000                             TO WS-PERIOD-ERROR-MESSAGE
126501000000              PERFORM PERIOD-MESSAGE-HANDLING.
126601000000
126701000000
126801000000           IF COMM-CALC-QTD         = "Y" AND
126901000000              WS-QUARTER-ERROR-FLAG = "Y"
127001000000              MOVE "Y"       TO WS-INL-HIGH-VALUES
127101000000              MOVE PERIOD-QT TO WS-PERIOD
127201000000              MOVE WS-QUARTER-ERROR-CODE
127301000000                             TO WS-PERIOD-ERROR-CODE
127401000000              MOVE WS-QUARTER-ERROR-MESSAGE
127501000000                             TO WS-PERIOD-ERROR-MESSAGE
127601000000              PERFORM PERIOD-MESSAGE-HANDLING.
127701000000
127801000000
127901000000           IF COMM-CALC-YTD         = "Y" AND
128001000000              WS-YEAR-ERROR-FLAG    = "Y"
128101000000              MOVE "Y"       TO WS-INL-HIGH-VALUES
128201000000              MOVE PERIOD-AN TO WS-PERIOD
128301000000              MOVE WS-YEAR-ERROR-CODE
128401000000                             TO WS-PERIOD-ERROR-CODE
128501000000              MOVE WS-YEAR-ERROR-MESSAGE
128601000000                             TO WS-PERIOD-ERROR-MESSAGE
128701000000              PERFORM PERIOD-MESSAGE-HANDLING.
128801000000
128901000000
129001000000           IF WS-INL-HIGH-VALUES = "Y"
129101000000              MOVE "06"      TO COMM-RETURN-CODE.
129201000000
129301000000       LPE-EXIT.
129401000000           EXIT.
129501000000      /
129601000000      *----------------------------------
129701000000       LOAD-BASE-CURRENCY-EXCHANGE SECTION.
129801000000      *----------------------------------
129901000000
130001000000       LBC-0010.
130101000000
130201000000           PERFORM GET-DEFAULT-EXCHANGE-TYPE.
130301000000
130401000000           MOVE "CAD"        TO UNITRAX-BASE-CURRENCY.
130501000000
130601000000           INITIALIZE MFACURP OF CURRENCY-CODE.
130701000000
130801000000           START CURRENCY-CODE
130901000000           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
131001000000           INVALID KEY
131101000000             GO TO LBC-END.
131201000000
131301000000       LBC-0020.
131401000000
131501000000           READ CURRENCY-CODE NEXT
131601000000           AT END
131701000000             GO TO LBC-END.
131801000000
131901000000           IF CURRENCY-STATUS OF CURRENCY-CODE NOT = "A"
132001000000              GO TO LBC-0020.
132101000000
132201000000           IF BASE-CURRENCY OF CURRENCY-CODE = "Y"
132301000000              MOVE CURRENCY-DDS OF CURRENCY-CODE
132401000000                             TO UNITRAX-BASE-CURRENCY
132501000000              GO TO LBC-0020.
132601000000
132701000000           MOVE CURRENCY-DDS OF CURRENCY-CODE
132801000000                             TO WS-CURRENCY-CODE
132901000000
133001000000           PERFORM GET-EXCHANGE-RATE.
133101000000
133201000000           IF WS-HEADER-CURRENCY-CODE NOT = SPACES
133301000000              GO TO LBC-0020.
133401000000
133501000000           MOVE WS-CURRENCY-CODE
133601000000                             TO WS-HEADER-CURRENCY-CODE.
133701000000           MOVE WS-EXCHANGE-RATE
133801000000                             TO WS-HEADER-EXCHANGE-RATE.
133901000000           MOVE WS-TRADE-DATE
134001000000                             TO WS-HEADER-TRADE-DATE.
134101000000
134201000000           GO TO LBC-0020.
134301000000
134401000000       LBC-END.
134501000000
134601000000           IF WS-HEADER-CURRENCY-CODE NOT = SPACES
134701000000              GO TO LBC-EXIT.
134801000000
134901000000      *    If no foreign currency found, default to 'USD'
135001000000
135101000000           MOVE "USD"        TO WS-CURRENCY-CODE.
135201000000
135301000000           PERFORM GET-EXCHANGE-RATE.
135401000000
135501000000           MOVE WS-CURRENCY-CODE
135601000000                             TO WS-HEADER-CURRENCY-CODE.
135701000000           MOVE WS-EXCHANGE-RATE
135801000000                             TO WS-HEADER-EXCHANGE-RATE.
135901000000           MOVE WS-TRADE-DATE
136001000000                             TO WS-HEADER-TRADE-DATE.
136101000000
136201000000       LBC-EXIT.
136301000000           EXIT.
136401000000      /
136501000000      *----------------------------------
136601000000       GET-DEFAULT-EXCHANGE-TYPE SECTION.
136701000000      *----------------------------------
136801000000
136901000000       GDE-0010.
137001000000
137101000000           INITIALIZE MFAPRGERP OF PROGRAM-EXCHANGE-RATE.
137201000000
137301000000           MOVE PROGRAM-ID-CODE
137401000000                             TO PROGRAM-CODE OF PROGRAM-EXCHANGE-RATE.
137501000000           MOVE DEFAULT-CODE TO PROGRAM-ACTION
137601000000                             OF PROGRAM-EXCHANGE-RATE.
137701000000
137801000000           READ PROGRAM-EXCHANGE-RATE
137901000000           INVALID KEY
138001000000             MOVE "N"        TO EXCHANGE-RATE-TYPE
138101000000                             OF PROGRAM-EXCHANGE-RATE.
138201000000
138301000000       GDE-EXIT.
138401000000           EXIT.
138501000000      /
138601000000      *----------------------------------
138701000000       GET-EXCHANGE-RATE SECTION.
138801000000      *----------------------------------
138901000000
139001000000       GER-0010.
139101000000
139201000000           MOVE ZEROS        TO WS-EXCHANGE-RATE
139301000000                                WS-TRADE-DATE.
139401000000
139501000000           IF WS-CURRENCY-CODE = SPACES
139601000000              GO TO GER-EXIT.
139701000000
139801000000           INITIALIZE MFAEXRHMP OF EXCHANGE-RATE-M.
139901000000
140001000000           MOVE WS-CURRENCY-CODE
140101000000                             TO CURRENCY-DDS OF EXCHANGE-RATE-M.
140201011105R11661*    MOVE COMM-PROCESS-DATE
140301011105R11661*                      TO TRADE-DATE OF EXCHANGE-RATE-M.
140401011105R11661     MOVE COMM-AS-AT-DATE
140501011105R11661                       TO TRADE-DATE OF EXCHANGE-RATE-M.
140601000000           MOVE EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
140701000000                             TO EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M.
140801000000
140901000000           READ EXCHANGE-RATE-M
141001000000           INVALID KEY
141101000000             PERFORM GET-LAST-EXCHANGE
141201000000             GO TO GER-EXIT.
141301000000
141401000000           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M
141501000000                             TO WS-EXCHANGE-RATE.
141601000000           MOVE TRADE-DATE OF EXCHANGE-RATE-M
141701000000                             TO WS-TRADE-DATE.
141801000000
141901000000       GER-EXIT.
142001000000           EXIT.
142101000000
142201000000      /
142301000000      *----------------------------------
142401000000       GET-LAST-EXCHANGE SECTION.
142501000000      *----------------------------------
142601000000
142701000000       GLE-0010.
142801000000
142901000000           MOVE ZEROS        TO WS-EXCHANGE-RATE
143001000000                                WS-TRADE-DATE.
143101000000
143201000000           IF WS-CURRENCY-CODE = SPACES
143301000000              GO TO GLE-EXIT.
143401000000
143501000000           INITIALIZE MFAEXRHMP OF EXCHANGE-RATE-M.
143601000000
143701000000           MOVE WS-CURRENCY-CODE
143801000000                             TO CURRENCY-DDS OF EXCHANGE-RATE-M.
143901011105R11661*    MOVE COMM-PROCESS-DATE
144001011105R11661*                      TO TRADE-DATE OF EXCHANGE-RATE-M.
144101011105R11661     MOVE COMM-AS-AT-DATE
144201011105R11661                       TO TRADE-DATE OF EXCHANGE-RATE-M.
144301000000           MOVE EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
144401000000                             TO EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M.
144501000000
144601000000           START EXCHANGE-RATE-M
144701000000           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
144801000000           INVALID KEY
144901000000             GO TO GLE-0020.
145001000000
145101000000           GO TO GLE-0030.
145201000000
145301000000       GLE-0020.
145401000000
145501000000           READ EXCHANGE-RATE-M LAST
145601000000           AT END
145701000000             GO TO GLE-EXIT.
145801000000
145901000000           GO TO GLE-0040.
146001000000
146101000000       GLE-0030.
146201000000
146301000000           READ EXCHANGE-RATE-M PRIOR
146401000000           AT END
146501000000             GO TO GLE-EXIT.
146601000000
146701000000       GLE-0040.
146801000000
146901000000           IF CURRENCY-DDS OF EXCHANGE-RATE-M NOT = WS-CURRENCY-CODE
147001000000              GO TO GLE-EXIT.
147101000000
147201011105R11661*    IF TRADE-DATE OF EXCHANGE-RATE-M > COMM-PROCESS-DATE
147301011105R11661     IF TRADE-DATE OF EXCHANGE-RATE-M > COMM-AS-AT-DATE
147401000000              GO TO GLE-0030.
147501000000
147601000000           IF EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M NOT =
147701000000              EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
147801000000              GO TO GLE-0030.
147901000000
148001000000           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M
148101000000                             TO WS-EXCHANGE-RATE.
148201000000           MOVE TRADE-DATE OF EXCHANGE-RATE-M
148301000000                             TO WS-TRADE-DATE.
148401000000
148501000000       GLE-EXIT.
148601000000           EXIT.
148701000000
148801000000      /
148901000000      *----------------------------------
149001000000       LOAD-INVESTMENT-ARRAY SECTION.
149101000000      *----------------------------------
149201000000
149301000000       LIA-0010.
149401000000
149501000000           PERFORM VARYING IV-CNT FROM 1 BY 1 UNTIL IV-CNT > IV-IDX-MAX
149601000000             INITIALIZE          IV-INVESTMENT      (IV-CNT)
149701000000             MOVE HIGH-VALUES TO IV-INVESTMENT-CODE (IV-CNT)
149801000000           END-PERFORM.
149901000000
150001000000
150101000000           PERFORM VARYING II-CNT FROM 1 BY 1 UNTIL II-CNT > II-IDX-MAX
150201000000             INITIALIZE          II-INVESTMENT      (II-CNT)
150301000000           END-PERFORM.
150401000000
150501000000
150601000000       LIA-0020.
150701000000
150801000000           INITIALIZE MFAINVP OF INVESTMENT.
150901000000
151001000000           MOVE LOW-VALUES   TO INVESTMENT-CODE OF INVESTMENT.
151101000000
151201000000           START INVESTMENT
151301000000           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
151401000000           INVALID KEY
151501000000             MOVE "07"       TO COMM-RETURN-CODE
151601000000             MOVE "Y"        TO WS-INL-HIGH-VALUES
151701000000             GO TO LIA-EXIT.
151801000000
151901000000           SET IV-IDX        TO 1.
152001091110R74289     MOVE  1    TO ln_Array-Size-IV.
152101000000
152201000000       LIA-0030.
152301000000
152401000000           READ INVESTMENT NEXT
152501000000           AT END
152601000000             GO TO LIA-EXIT.
152701000000
152801000000           IF INVESTMENT-CODE OF INVESTMENT = SPACES
152901000000              GO TO LIA-0030.
153001000000
153101000000           IF IV-IDX > IV-IDX-MAX
153201000000              MOVE "08"      TO COMM-RETURN-CODE
153301000000              MOVE "Y"       TO WS-INL-HIGH-VALUES
153401000000              GO TO LIA-EXIT.
153501000000
153601000000           MOVE INVESTMENT-CODE OF INVESTMENT
153701000000                             TO IV-INVESTMENT-CODE    (IV-IDX).
153801000000           MOVE INDUSTRY-FUND-CODE OF INVESTMENT
153901000000                             TO IV-INDUSTRY-FUND-CODE (IV-IDX).
154001000000           MOVE CURRENCY-DDS OF INVESTMENT
154101000000                             TO IV-CURRENCY           (IV-IDX).
154201000000
154301000000       LIA-0040.
154401000000
154501000000           INITIALIZE MFAINVNMP OF INVESTMENT-NAME.
154601000000
154701000000           MOVE INVESTMENT-CODE OF INVESTMENT
154801000000                             TO INVESTMENT-CODE OF INVESTMENT-NAME.
154901000000           MOVE ENGLISH-LANG TO LANGUAGE-CODE OF INVESTMENT-NAME.
155001000000
155101000000           READ INVESTMENT-NAME
155201000000           INVALID KEY
155301000000             CONTINUE.
155401000000
155501000000           MOVE INVESTMENT-NAME-LONG OF INVESTMENT-NAME
155601000000                             TO IV-INVESTMENT-NAME-LONG (IV-IDX).
155701000000
155801000000       LIA-0050.
155901000000
156001000000           INITIALIZE MFAINVGRP OF INVESTMENT-GROUP.
156101000000
156201000000           MOVE INVESTMENT-GROUP-CODE OF INVESTMENT
156301000000                             TO INVESTMENT-GROUP-CODE
156401000000                             OF INVESTMENT-GROUP.
156501000000
156601000000           READ INVESTMENT-GROUP
156701000000           INVALID KEY
156801000000             CONTINUE.
156901000000
157001000000           MOVE FIXED-OR-VARIABLE OF INVESTMENT-GROUP
157101000000                             TO IV-FIXED-OR-VARIABLE (IV-IDX).
157201000000
157301000000           IF FIXED-OR-VARIABLE OF INVESTMENT-GROUP = "F"
157401000000              MOVE FIXED-PRICE OF INVESTMENT-GROUP
157501000000                             TO IV-UNIT-PRICE        (IV-IDX).
157601000000
157701000000       LIA-0060.
157801000000
157901000000           IF COMM-PROCESS-OPTION NOT = "D" OR
158001000000              COMM-PROCESS-DATE   NOT = COMM-AS-AT-DATE
158101000000              GO TO LIA-0070.
158201000000
158301000000
158401000000      *    For current process date, use price from Investment
158501000000      *    Last Unit Price file. If not found, get the last price
158601000000      *    from Investment Unit Price
158701000000
158801000000           INITIALIZE MFAINVLPP OF INVESTMENT-LAST-UNIT-PRICE.
158901000000           MOVE INVESTMENT-CODE OF INVESTMENT
159001000000                             TO INVESTMENT-CODE
159101000000                             OF INVESTMENT-LAST-UNIT-PRICE.
159201000000
159301000000           READ INVESTMENT-LAST-UNIT-PRICE
159401000000           INVALID KEY
159501000000             GO TO LIA-0070.
159601000000
159701000000           MOVE UNIT-PRICE OF INVESTMENT-LAST-UNIT-PRICE
159801000000                             TO IV-UNIT-PRICE (IV-IDX).
159901000000           MOVE TRADE-DATE OF INVESTMENT-LAST-UNIT-PRICE
160001000000                             TO IV-TRADE-DATE (IV-IDX).
160101000000           GO TO LIA-0090.
160201000000
160301000000
160401000000       LIA-0070.
160501000000
160601000000      *    For any prior process dates, use price from Investment
160701000000      *    Unit Price file.
160801000000
160901000000           INITIALIZE MFAINVUPP OF INVESTMENT-UNIT-PRICE.
161001000000
161101000000           MOVE INVESTMENT-CODE OF INVESTMENT
161201000000                             TO INVESTMENT-CODE
161301000000                             OF INVESTMENT-UNIT-PRICE.
161401000000           MOVE COMM-PROCESS-DATE
161501000000                             TO TRADE-DATE
161601000000                             OF INVESTMENT-UNIT-PRICE.
161701000000           MOVE "Y"          TO DISTRIBUTION-FLAG
161801000000                             OF INVESTMENT-UNIT-PRICE.
161901000000
162001000000           START INVESTMENT-UNIT-PRICE
162101000000           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
162201000000           INVALID KEY
162301000000             MOVE "INVESTMENT UNIT PRICE"
162401000000                             TO WS-FILE-STATUS-FILE-NAME
162501000000             PERFORM LOG-FILE-STATUS
162601000000             GO TO LIA-0090.
162701000000
162801000000
162901000000       LIA-0080.
163001000000
163101000000           READ INVESTMENT-UNIT-PRICE NEXT
163201000000           AT END
163301000000             MOVE "INVESTMENT UNIT PRICE"
163401000000                             TO WS-FILE-STATUS-FILE-NAME
163501000000             PERFORM LOG-FILE-STATUS
163601000000             GO TO LIA-0090.
163701000000
163801000000           IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE NOT =
163901000000              INVESTMENT-CODE OF INVESTMENT
164001000000              GO TO LIA-0090.
164101000000
164201080111      *Rfs42749 begins
164301080201      *If the price retrieved is of type "S" go get another one.
164401080204           IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE  = lc_S
164501080201              AND INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE  =
164601080201              INVESTMENT-CODE OF INVESTMENT
164701080201              GO TO LIA-0080
164801080201           END-IF.
164901080111      *Rfs42749 ends
165001080111
165101000000           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
165201000000                             TO IV-UNIT-PRICE (IV-IDX).
165301000000           MOVE TRADE-DATE OF INVESTMENT-UNIT-PRICE
165401000000                             TO IV-TRADE-DATE (IV-IDX).
165501000000
165601000000
165701000000       LIA-0090.
165801000000
165901000000           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
166001000000              MOVE 1.0       TO IV-EXCHANGE-RATE (IV-IDX)
166101000000
166201000000           ELSE IF CURRENCY-DDS OF INVESTMENT = WS-HEADER-CURRENCY-CODE
166301000000              MOVE WS-HEADER-EXCHANGE-RATE
166401000000                             TO IV-EXCHANGE-RATE (IV-IDX)
166501000000           ELSE
166601000000              MOVE CURRENCY-DDS OF INVESTMENT
166701000000                             TO WS-CURRENCY-CODE
166801000000              PERFORM GET-EXCHANGE-RATE
166901000000              MOVE WS-EXCHANGE-RATE
167001000000                             TO IV-EXCHANGE-RATE (IV-IDX).
167101000000
167201000000
167301000000           SET IV-IDX        UP BY 1.
16740109111074289      IF  IV-IDX >= ln_Array-Size-IV
16750109111074289          COMPUTE ln_Array-Size-IV  = ln_Array-Size-IV   + 1
16760109111074289      END-IF.
167701000000           GO TO LIA-0030.
167801000000
167901000000       LIA-EXIT.
168001000000           EXIT.
168101000000      /
168201000000      *----------------------------------
168301000000       GET-CURRENT-RECORD SECTION.
168401000000      *----------------------------------
168501000000
168601000000       GCR-0010.
168701000000
168801000000           EVALUATE COMM-PROCESS-OPTION
168901000000
169001000000           WHEN "D"
169101000000                PERFORM GET-DAILY-PROCESS
169201000000
169301000000           WHEN "C"
169401000000                PERFORM GET-CONVERSION-PROCESS
169501000000
169601000000           WHEN OTHER
169701000000                MOVE HIGH-VALUES
169801000000                             TO CURR-CONTROLS.
169901000000
170001000000       GCR-EXIT.
170101000000           EXIT.
170201000000      /
170301000000      *----------------------------------
170401000000       GET-DAILY-PROCESS SECTION.
170501000000      *----------------------------------
170601000000
170701000000       GDP-0010.
170801000000
170901000000           EXEC SQL
171001000000           WHENEVER SQLERROR GO TO GDP-END
171101000000           END-EXEC.
171201000000
171301000000           EXEC SQL
171401000000           WHENEVER NOT FOUND GO TO GDP-END
171501000000           END-EXEC.
171601000000
171701000000
171801000000           IF DID-CNT = ZEROS
171901000000              GO TO GDP-0020.
172001000000
172101000000           IF DID-CNT > DID-IDX-MAX
172201000000              GO TO GDP-0020.
172301000000
172401000000           IF DID-DEALER-CODE     (DID-CNT) NOT = SPACES OR
172501000000              DID-DEALER-REP-CODE (DID-CNT) NOT = SPACES OR
172601000000              DID-INVESTMENT-CODE (DID-CNT) NOT = SPACES
172701000000              GO TO GDP-0030.
172801000000
172901000000           GO TO GDP-END.
173001000000
173101000000       GDP-0020.
173201000000
173301000000           PERFORM VARYING DID-CNT FROM 1 BY 1
173401000000             UNTIL DID-CNT > DID-IDX-MAX
173501000000             INITIALIZE      DID-FETCH-ARRAY (DID-CNT)
173601000000           END-PERFORM.
173701000000
173801000000
173901000000           EXEC SQL
174001000000           FETCH DLRINDCUR FOR 500 ROWS INTO :did-fetch-array
174101000000           END-EXEC.
174201000000
174301000000           MOVE 1            TO DID-CNT.
174401000000
174501000000       GDP-0030.
174601000000
174701000000           INITIALIZE WS-DLRINV-FETCH.
174801000000
174901000000           MOVE DID-DEALER-CODE     (DID-CNT)
175001000000                             TO WS-DEALER-CODE.
175101000000           MOVE DID-DEALER-REP-CODE (DID-CNT)
175201000000                             TO WS-DEALER-REP-CODE.
175301000000           MOVE DID-INVESTMENT-CODE (DID-CNT)
175401000000                             TO WS-INVESTMENT-CODE.
175501000000           MOVE DID-CURR-UNIT-BAL   (DID-CNT)
175601000000                             TO WS-CURR-UNIT-BAL.
175701000000           ADD  1            TO DID-CNT.
175801000000
175901000000
176001000000           MOVE WS-DEALER-CODE
176101000000                             TO CURR-DEALER-CODE.
176201000000           MOVE WS-DEALER-REP-CODE
176301000000                             TO CURR-DEALER-REP-CODE.
176401000000           MOVE WS-INVESTMENT-CODE
176501000000                             TO CURR-INVESTMENT-CODE.
176601000000
176701000000           GO TO GDP-EXIT.
176801000000
176901000000       GDP-END.
177001000000
177101000000           MOVE HIGH-VALUES  TO CURR-CONTROLS.
177201000000
177301000000       GDP-EXIT.
177401000000           EXIT.
177501000000      /
177601000000      *----------------------------------
177701000000       GET-CONVERSION-PROCESS SECTION.
177801000000      *----------------------------------
177901000000
178001000000       GCP-0010.
178101000000
178201000000           EXEC SQL
178301000000           WHENEVER SQLERROR GO TO GCP-END
178401000000           END-EXEC.
178501000000
178601000000           EXEC SQL
178701000000           WHENEVER NOT FOUND GO TO GCP-END
178801000000           END-EXEC.
178901000000
179001000000
179101000000           IF DIC-CNT = ZEROS
179201000000              GO TO GCP-0020.
179301000000
179401000000           IF DIC-CNT > DIC-IDX-MAX
179501000000              GO TO GCP-0020.
179601000000
179701000000           IF DIC-DEALER-CODE     (DIC-CNT) NOT = SPACES OR
179801000000              DIC-DEALER-REP-CODE (DIC-CNT) NOT = SPACES OR
179901000000              DIC-INVESTMENT-CODE (DIC-CNT) NOT = SPACES
180001000000              GO TO GCP-0030.
180101000000
180201000000           GO TO GCP-END.
180301000000
180401000000       GCP-0020.
180501000000
180601000000           PERFORM VARYING DIC-CNT FROM 1 BY 1
180701000000             UNTIL DIC-CNT > DIC-IDX-MAX
180801000000             INITIALIZE      DIC-FETCH-ARRAY (DIC-CNT)
180901000000           END-PERFORM.
181001000000
181101000000
181201090929           EXEC SQL
181301090929           FETCH DLRINCCUR FOR 500 ROWS INTO :dic-fetch-array
181401090929           END-EXEC.
181501000000
181601000000           MOVE 1            TO DIC-CNT.
181701000000
181801000000       GCP-0030.
181901000000
182001000000           INITIALIZE WS-DLRINV-FETCH.
182101000000
182201000000           MOVE DIC-DEALER-CODE     (DIC-CNT)
182301000000                             TO WS-DEALER-CODE.
182401000000           MOVE DIC-DEALER-REP-CODE (DIC-CNT)
182501000000                             TO WS-DEALER-REP-CODE.
182601000000           MOVE DIC-INVESTMENT-CODE (DIC-CNT)
182701000000                             TO WS-INVESTMENT-CODE.
182801000000           ADD  1            TO DIC-CNT.
182901000000
183001000000
183101000000           INITIALIZE DLRSAUBL-PARM-BUFFER.
183201000000
183301000000           MOVE "C"          TO DLRSAUBL-PROCESS-OPTION.
183401000000           MOVE COMM-PROCESS-DATE
183501000000                             TO DLRSAUBL-PROCESS-DATE.
183601000000           MOVE WS-DEALER-CODE
183701000000                             TO DLRSAUBL-DEALER-CODE.
183801000000           MOVE WS-DEALER-REP-CODE
183901000000                             TO DLRSAUBL-DEALER-REP-CODE.
184001000000           MOVE WS-INVESTMENT-CODE
184101000000                             TO DLRSAUBL-INVESTMENT-CODE.
184201000000
184301000000
184401000000      *    Get unit balance for the dealer rep investment
184501000000      *    at the end of the business day.
184601000000
184701000000           CALL "DLRSAUBL" USING DLRSAUBL-PARM.
184801000000
184901000000
185001000000           MOVE DLRSAUBL-UNIT-AMT
185101000000                             TO WS-CURR-UNIT-BAL.
185201000000
185301000000           MOVE WS-DEALER-CODE
185401000000                             TO CURR-DEALER-CODE.
185501000000           MOVE WS-DEALER-REP-CODE
185601000000                             TO CURR-DEALER-REP-CODE.
185701000000           MOVE WS-INVESTMENT-CODE
185801000000                             TO CURR-INVESTMENT-CODE.
185901000000
186001000000           GO TO GCP-EXIT.
186101000000
186201000000       GCP-END.
186301000000
186401000000           MOVE HIGH-VALUES  TO CURR-CONTROLS.
186501000000
186601000000
186701000000       GCP-EXIT.
186801000000           EXIT.
186901000000      /
187001000000      *----------------------------------
187101000000       DETAIL-PROCESSING SECTION.
187201000000      *----------------------------------
187301000000
187401000000       DPR-0010.
187501000000
187601000000           EVALUATE COMM-PROCESS-OPTION
187701000000
187801000000           WHEN "D"
187901000000                PERFORM DETAIL-DAILY-PROCESS
188001000000
188101000000           WHEN "C"
188201000000                PERFORM DETAIL-CONVERSION-PROCESS
188301000000
188401000000           WHEN OTHER
188501000000                CONTINUE.
188601000000
188701000000       DPR-EXIT.
188801000000           EXIT.
188901000000
189001000000      /
189101000000      *----------------------------------
189201000000       DETAIL-DAILY-PROCESS SECTION.
189301000000      *----------------------------------
189401000000
189501000000       DDP-0010.
189601000000
189701000000           INITIALIZE WS-TRANS-SUMMARY-AREA.
189801000000           INITIALIZE WS-SALES-ASSETS-AREA.
189901000000
190001000000           INITIALIZE DLRSATRN-PARM-BUFFER.
190101000000
190201000000           MOVE "D"          TO DLRSATRN-PROCESS-OPTION.
190301000000           MOVE "S"          TO DLRSATRN-ACTION-OPTION.
190401000000
190501000000           MOVE COMM-PROCESS-DATE
190601000000                             TO DLRSATRN-PROCESS-DATE.
190701000000           MOVE WS-DEALER-CODE
190801000000                             TO DLRSATRN-DEALER-CODE.
190901000000           MOVE WS-DEALER-REP-CODE
191001000000                             TO DLRSATRN-DEALER-REP-CODE.
191101000000           MOVE WS-INVESTMENT-CODE
191201000000                             TO DLRSATRN-INVESTMENT-CODE.
191301100628
191401000000       DDP-0020.
191501000000
191601000000           CALL "DLRSATRN" USING DLRSATRN-PARM.
191701000000
191801000000           IF DLRSATRN-RETURN-CODE = "EOD"
191901011106R11661        GO TO DDP-0030.
192001000000
192101000000           PERFORM CAPTURE-TRANS-SUMMARY.
192201000000
192301000000           MOVE "F"          TO DLRSATRN-ACTION-OPTION.
192401000000           MOVE SPACES       TO DLRSATRN-RETURN-CODE.
192501000000
192601000000           GO TO DDP-0020.
192701000000
192801011106R11661 DDP-0030.
192901011108R11661
193001011108R11661*    Get all existing contracted buys and sells in the TRANS file
193101011106R11661
193201011106R11661     INITIALIZE DLRSATRN-PARM-BUFFER.
193301011106R11661
193401011106R11661     MOVE "C"          TO DLRSATRN-PROCESS-OPTION.
193501011106R11661     MOVE "S"          TO DLRSATRN-ACTION-OPTION.
193601011106R11661
193701011106R11661     MOVE COMM-PROCESS-DATE
193801011106R11661                       TO DLRSATRN-PROCESS-DATE.
193901011106R11661     MOVE WS-DEALER-CODE
194001011106R11661                       TO DLRSATRN-DEALER-CODE.
194101011106R11661     MOVE WS-DEALER-REP-CODE
194201011106R11661                       TO DLRSATRN-DEALER-REP-CODE.
194301011106R11661     MOVE WS-INVESTMENT-CODE
194401011106R11661                       TO DLRSATRN-INVESTMENT-CODE.
194501011106R11661
194601011106R11661 DDP-0040.
194701100627
194801011106R11661     CALL "DLRSATRN" USING DLRSATRN-PARM.
194901011106R11661
195001011106R11661     IF DLRSATRN-RETURN-CODE = "EOD"
195101011106R11661        GO TO DDP-END.
195201011106R11661
195301011106R11661     PERFORM CAPTURE-CON-SUMMARY.
195401011106R11661
195501011106R11661     MOVE "F"          TO DLRSATRN-ACTION-OPTION.
195601011106R11661     MOVE SPACES       TO DLRSATRN-RETURN-CODE.
195701011106R11661
195801011106R11661     GO TO DDP-0040.
195901011106R11661
196001000000       DDP-END.
196101000000
196201000000           PERFORM CALCULATE-SALES-AMOUNTS.
196301000000
196401000000           PERFORM CALCULATE-ASSETS-AMOUNTS.
196501000000
196601000000           PERFORM GET-SALES-ASSETS-RECORD.
196701000000
196801000000           PERFORM UPDATE-DAILY-SALES-ASSETS.
196901000000
197001000000           PERFORM OUTPUT-SALES-ASSETS-DETAIL.
197101000000
197201000000       DDP-EXIT.
197301000000           EXIT.
197401000000
197501000000      /
197601000000      *----------------------------------
197701000000       DETAIL-CONVERSION-PROCESS SECTION.
197801000000      *----------------------------------
197901000000
198001000000       DCP-0010.
198101000000
198201000000           PERFORM GET-SALES-ASSETS-RECORD.
198301000000
198401000000      *    Capture historical data - WTD, MTD, QTD, YTD prior to
198501000000      *    the process date.
198601000000
198701000000           IF COMM-CALC-WTD = "Y"
198801000000              IF WS-WEEK-START-DATE < COMM-PROCESS-DATE AND
198901000000                 WS-WEEK-TO-DATE    < COMM-PROCESS-DATE
199001000000                 MOVE "WTD"  TO WS-HISTORY-FLAG
199101000000                 MOVE WS-WEEK-START-DATE
199201000000                             TO WS-START-DATE
199301000000                 MOVE WS-WEEK-TO-DATE
199401000000                             TO WS-END-DATE
199501000000                 PERFORM CAPTURE-HISTORY-TRANS
199601000000              END-IF
199701000000           END-IF.
199801000000
199901000000
200001000000           IF COMM-CALC-MTD = "Y"
200101000000              IF WS-MONTH-START-DATE < COMM-PROCESS-DATE AND
200201000000                 WS-MONTH-TO-DATE    < COMM-PROCESS-DATE
200301000000                 MOVE "MTD"  TO WS-HISTORY-FLAG
200401000000                 MOVE WS-MONTH-START-DATE
200501000000                             TO WS-START-DATE
200601000000                 MOVE WS-MONTH-TO-DATE
200701000000                             TO WS-END-DATE
200801000000                 PERFORM CAPTURE-HISTORY-TRANS
200901000000              END-IF
201001000000           END-IF.
201101000000
201201000000
201301000000           IF COMM-CALC-QTD = "Y"
201401000000              IF WS-QUARTER-START-DATE < COMM-PROCESS-DATE AND
201501000000                 WS-QUARTER-TO-DATE    < COMM-PROCESS-DATE
201601000000                 MOVE "QTD"  TO WS-HISTORY-FLAG
201701000000                 MOVE WS-QUARTER-START-DATE
201801000000                             TO WS-START-DATE
201901000000                 MOVE WS-QUARTER-TO-DATE
202001000000                             TO WS-END-DATE
202101000000                 PERFORM CAPTURE-HISTORY-TRANS
202201000000              END-IF
202301000000           END-IF.
202401000000
202501000000
202601000000           IF COMM-CALC-YTD = "Y"
202701000000              IF WS-YEAR-START-DATE < COMM-PROCESS-DATE AND
202801000000                 WS-YEAR-TO-DATE    < COMM-PROCESS-DATE
202901000000                 MOVE "YTD"  TO WS-HISTORY-FLAG
203001000000                 MOVE WS-YEAR-START-DATE
203101000000                             TO WS-START-DATE
203201000000                 MOVE WS-YEAR-TO-DATE
203301000000                             TO WS-END-DATE
203401000000                 PERFORM CAPTURE-HISTORY-TRANS
203501000000              END-IF
203601000000           END-IF.
203701000000
203801000000
203901000000      *    For efficiency, use Add MTD to QTD, and YTD options.
204001000000
204101000000           IF COMM-CALC-QTD      NOT = "Y"
204201000000              IF COMM-ADD-MTD-TO-QTD = "Y"
204301000000                 PERFORM ADD-HISTORY-MTD-TO-QTD
204401000000              END-IF
204501000000           END-IF.
204601000000
204701000000
204801000000           IF COMM-CALC-YTD      NOT = "Y"
204901000000              IF COMM-ADD-MTD-TO-YTD = "Y"
205001000000                 PERFORM ADD-HISTORY-MTD-TO-YTD
205101000000              END-IF
205201000000           END-IF.
205301000000
205401000000
205501000000      *    Now capture data for the given process date
205601000000
205701000000           INITIALIZE WS-TRANS-SUMMARY-AREA.
205801000000           INITIALIZE WS-SALES-ASSETS-AREA.
205901000000
206001000000           INITIALIZE DLRSATRN-PARM-BUFFER.
206101000000
206201000000           MOVE "R"          TO DLRSATRN-PROCESS-OPTION.
206301000000           MOVE "S"          TO DLRSATRN-ACTION-OPTION.
206401000000
206501000000           MOVE COMM-PROCESS-DATE
206601000000                             TO DLRSATRN-PROCESS-DATE
206701000000                                DLRSATRN-START-DATE
206801000000                                DLRSATRN-END-DATE.
206901000000
207001000000           MOVE WS-DEALER-CODE
207101000000                             TO DLRSATRN-DEALER-CODE.
207201000000           MOVE WS-DEALER-REP-CODE
207301000000                             TO DLRSATRN-DEALER-REP-CODE.
207401000000           MOVE WS-INVESTMENT-CODE
207501000000                             TO DLRSATRN-INVESTMENT-CODE.
207601100628
207701000000       DCP-0020.
207801100627
207901000000           CALL "DLRSATRN" USING DLRSATRN-PARM.
208001000000
208101000000           IF DLRSATRN-RETURN-CODE = "EOD"
208201000000              GO TO DCP-END.
208301000000
208401000000           PERFORM CAPTURE-TRANS-SUMMARY.
208501000000
208601000000           MOVE "F"          TO DLRSATRN-ACTION-OPTION.
208701100627           MOVE SPACES       TO DLRSATRN-RETURN-CODE.
208801000000
208901000000           GO TO DCP-0020.
209001000000
209101000000       DCP-END.
209201000000
209301000000           PERFORM CALCULATE-SALES-AMOUNTS.
209401000000
209501000000           PERFORM CALCULATE-ASSETS-AMOUNTS.
209601000000
209701000000           PERFORM UPDATE-DAILY-SALES-ASSETS.
209801000000
209901000000           PERFORM OUTPUT-SALES-ASSETS-DETAIL.
210001000000
210101000000       DCP-EXIT.
210201000000           EXIT.
210301000000      /
210401000000      *----------------------------------
210501000000       CAPTURE-HISTORY-TRANS SECTION.
210601000000      *----------------------------------
210701000000
210801000000       CHT-0010.
210901000000
211001000000           INITIALIZE WS-TRANS-SUMMARY-AREA.
211101000000           INITIALIZE WS-SALES-ASSETS-AREA.
211201000000
211301000000           INITIALIZE DLRSATRN-PARM-BUFFER.
211401000000
211501000000           MOVE "R"          TO DLRSATRN-PROCESS-OPTION.
211601000000           MOVE "S"          TO DLRSATRN-ACTION-OPTION.
211701000000
211801000000           MOVE COMM-PROCESS-DATE
211901000000                             TO DLRSATRN-PROCESS-DATE.
212001000000           MOVE WS-START-DATE
212101000000                             TO DLRSATRN-START-DATE.
212201000000           MOVE WS-END-DATE  TO DLRSATRN-END-DATE.
212301000000
212401000000           MOVE WS-DEALER-CODE
212501000000                             TO DLRSATRN-DEALER-CODE.
212601000000           MOVE WS-DEALER-REP-CODE
212701000000                             TO DLRSATRN-DEALER-REP-CODE.
212801000000           MOVE WS-INVESTMENT-CODE
212901000000                             TO DLRSATRN-INVESTMENT-CODE.
213001100628
213101000000       CHT-0020.
213201000000
213301000000           CALL "DLRSATRN" USING DLRSATRN-PARM.
213401000000
213501000000           IF DLRSATRN-RETURN-CODE = "EOD"
213601000000              GO TO CHT-END.
213701000000
213801000000           PERFORM CAPTURE-TRANS-SUMMARY.
213901000000
214001000000           MOVE "F"          TO DLRSATRN-ACTION-OPTION.
214101000000           MOVE SPACES       TO DLRSATRN-RETURN-CODE.
214201000000
214301000000           GO TO CHT-0020.
214401000000
214501000000       CHT-END.
214601000000
214701000000           PERFORM CALCULATE-SALES-AMOUNTS.
214801000000
214901000000           PERFORM UPDATE-HISTORY-SALES.
215001000000
215101000000       CHT-EXIT.
215201000000           EXIT.
215301000000      /
215401000000      *----------------------------------
215501000000       CAPTURE-TRANS-SUMMARY SECTION.
215601000000      *----------------------------------
215701000000
215801000000       CTS-0010.
215901000000
216001000000           IF DLRSATRN-TRANS-TYPE-CODE        = "BUY" AND
216101000000              DLRSATRN-TRANS-STATUS-CODE      = "HST"
216201000000
216301000000              MOVE DLRSATRN-NET-AMT
216401000000                             TO WS-BUY-HST-NET-AMT
216501000000              MOVE DLRSATRN-GROSS-AMT
216601000000                             TO WS-BUY-HST-GROSS-AMT
216701000000              MOVE DLRSATRN-UNIT-AMT
216801000000                             TO WS-BUY-HST-UNIT-AMT
216901000000              MOVE DLRSATRN-TRANS-CNT
217001000000                             TO WS-BUY-HST-TRANS-CNT
217101000000
217201000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "BUY" AND
217301000000                   DLRSATRN-TRANS-STATUS-CODE = "CON"
217401000000
217501000000              MOVE DLRSATRN-NET-AMT
217601000000                             TO WS-BUY-CON-NET-AMT
217701000000              MOVE DLRSATRN-GROSS-AMT
217801000000                             TO WS-BUY-CON-GROSS-AMT
217901000000              MOVE DLRSATRN-UNIT-AMT
218001000000                             TO WS-BUY-CON-UNIT-AMT
218101000000              MOVE DLRSATRN-TRANS-CNT
218201000000                             TO WS-BUY-CON-TRANS-CNT
218301000000
218401000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "BUY" AND
218501000000                   DLRSATRN-TRANS-STATUS-CODE = "RVS"
218601000000
218701000000              MOVE DLRSATRN-NET-AMT
218801000000                             TO WS-BUY-RVS-NET-AMT
218901000000              MOVE DLRSATRN-GROSS-AMT
219001000000                             TO WS-BUY-RVS-GROSS-AMT
219101000000              MOVE DLRSATRN-UNIT-AMT
219201000000                             TO WS-BUY-RVS-UNIT-AMT
219301000000              MOVE DLRSATRN-TRANS-CNT
219401000000                             TO WS-BUY-RVS-TRANS-CNT
219501000000
219601000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "BUY" AND
219701000000                   DLRSATRN-TRANS-STATUS-CODE = "CAN"
219801000000
219901000000              MOVE DLRSATRN-NET-AMT
220001000000                             TO WS-BUY-CAN-NET-AMT
220101000000              MOVE DLRSATRN-GROSS-AMT
220201000000                             TO WS-BUY-CAN-GROSS-AMT
220301000000              MOVE DLRSATRN-UNIT-AMT
220401000000                             TO WS-BUY-CAN-UNIT-AMT
220501000000              MOVE DLRSATRN-TRANS-CNT
220601000000                             TO WS-BUY-CAN-TRANS-CNT
220701000000
220801000000           ELSE IF (DLRSATRN-TRANS-TYPE-CODE   = "SEL" OR "CQD") AND
220901000000                    DLRSATRN-TRANS-STATUS-CODE = "HST"
221001000000
221101000000              ADD  DLRSATRN-NET-AMT
221201000000                             TO WS-SEL-HST-NET-AMT
221301000000              ADD  DLRSATRN-GROSS-AMT
221401000000                             TO WS-SEL-HST-GROSS-AMT
221501000000              ADD  DLRSATRN-UNIT-AMT
221601000000                             TO WS-SEL-HST-UNIT-AMT
221701000000              ADD  DLRSATRN-TRANS-CNT
221801000000                             TO WS-SEL-HST-TRANS-CNT
221901000000
222001000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "SEL" AND
222101000000                   DLRSATRN-TRANS-STATUS-CODE = "CON"
222201000000
222301000000              MOVE DLRSATRN-NET-AMT
222401000000                             TO WS-SEL-CON-NET-AMT
222501000000              MOVE DLRSATRN-GROSS-AMT
222601000000                             TO WS-SEL-CON-GROSS-AMT
222701000000              MOVE DLRSATRN-UNIT-AMT
222801000000                             TO WS-SEL-CON-UNIT-AMT
222901000000              MOVE DLRSATRN-TRANS-CNT
223001000000                             TO WS-SEL-CON-TRANS-CNT
223101000000
223201000000           ELSE IF (DLRSATRN-TRANS-TYPE-CODE   = "SEL" OR "CQD") AND
223301000000                    DLRSATRN-TRANS-STATUS-CODE = "RVS"
223401000000
223501000000              ADD  DLRSATRN-NET-AMT
223601000000                             TO WS-SEL-RVS-NET-AMT
223701000000              ADD  DLRSATRN-GROSS-AMT
223801000000                             TO WS-SEL-RVS-GROSS-AMT
223901000000              ADD  DLRSATRN-UNIT-AMT
224001000000                             TO WS-SEL-RVS-UNIT-AMT
224101000000              ADD  DLRSATRN-TRANS-CNT
224201000000                             TO WS-SEL-RVS-TRANS-CNT
224301000000
224401000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "SEL" AND
224501000000                   DLRSATRN-TRANS-STATUS-CODE = "CAN"
224601000000
224701000000              MOVE DLRSATRN-NET-AMT
224801000000                             TO WS-SEL-CAN-NET-AMT
224901000000              MOVE DLRSATRN-GROSS-AMT
225001000000                             TO WS-SEL-CAN-GROSS-AMT
225101000000              MOVE DLRSATRN-UNIT-AMT
225201000000                             TO WS-SEL-CAN-UNIT-AMT
225301000000              MOVE DLRSATRN-TRANS-CNT
225401000000                             TO WS-SEL-CAN-TRANS-CNT
225501000000
225601000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "TRO" AND
225701000000                   DLRSATRN-TRANS-STATUS-CODE = "HST"
225801000000
225901000000              MOVE DLRSATRN-NET-AMT
226001000000                             TO WS-TRO-HST-NET-AMT
226101000000              MOVE DLRSATRN-GROSS-AMT
226201000000                             TO WS-TRO-HST-GROSS-AMT
226301000000              MOVE DLRSATRN-UNIT-AMT
226401000000                             TO WS-TRO-HST-UNIT-AMT
226501000000              MOVE DLRSATRN-TRANS-CNT
226601000000                             TO WS-TRO-HST-TRANS-CNT
226701000000
226801000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "TRO" AND
226901000000                   DLRSATRN-TRANS-STATUS-CODE = "RVS"
227001000000
227101000000              MOVE DLRSATRN-NET-AMT
227201000000                             TO WS-TRO-RVS-NET-AMT
227301000000              MOVE DLRSATRN-GROSS-AMT
227401000000                             TO WS-TRO-RVS-GROSS-AMT
227501000000              MOVE DLRSATRN-UNIT-AMT
227601000000                             TO WS-TRO-RVS-UNIT-AMT
227701000000              MOVE DLRSATRN-TRANS-CNT
227801000000                             TO WS-TRO-RVS-TRANS-CNT
227901000000
228001000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "TRI" AND
228101000000                   DLRSATRN-TRANS-STATUS-CODE = "HST"
228201000000
228301000000              MOVE DLRSATRN-NET-AMT
228401000000                             TO WS-TRI-HST-NET-AMT
228501000000              MOVE DLRSATRN-GROSS-AMT
228601000000                             TO WS-TRI-HST-GROSS-AMT
228701000000              MOVE DLRSATRN-UNIT-AMT
228801000000                             TO WS-TRI-HST-UNIT-AMT
228901000000              MOVE DLRSATRN-TRANS-CNT
229001000000                             TO WS-TRI-HST-TRANS-CNT
229101000000
229201000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "TRI" AND
229301000000                   DLRSATRN-TRANS-STATUS-CODE = "RVS"
229401000000
229501000000              MOVE DLRSATRN-NET-AMT
229601000000                             TO WS-TRI-RVS-NET-AMT
229701000000              MOVE DLRSATRN-GROSS-AMT
229801000000                             TO WS-TRI-RVS-GROSS-AMT
229901000000              MOVE DLRSATRN-UNIT-AMT
230001000000                             TO WS-TRI-RVS-UNIT-AMT
230101000000              MOVE DLRSATRN-TRANS-CNT
230201000000                             TO WS-TRI-RVS-TRANS-CNT
230301000000
230401000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "SWO" AND
230501000000                   DLRSATRN-TRANS-STATUS-CODE = "HST"
230601000000
230701000000              MOVE DLRSATRN-NET-AMT
230801000000                             TO WS-SWO-HST-NET-AMT
230901000000              MOVE DLRSATRN-GROSS-AMT
231001000000                             TO WS-SWO-HST-GROSS-AMT
231101000000              MOVE DLRSATRN-UNIT-AMT
231201000000                             TO WS-SWO-HST-UNIT-AMT
231301000000              MOVE DLRSATRN-TRANS-CNT
231401000000                             TO WS-SWO-HST-TRANS-CNT
231501000000
231601000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "SWO" AND
231701000000                   DLRSATRN-TRANS-STATUS-CODE = "RVS"
231801000000
231901000000              MOVE DLRSATRN-NET-AMT
232001000000                             TO WS-SWO-RVS-NET-AMT
232101000000              MOVE DLRSATRN-GROSS-AMT
232201000000                             TO WS-SWO-RVS-GROSS-AMT
232301000000              MOVE DLRSATRN-UNIT-AMT
232401000000                             TO WS-SWO-RVS-UNIT-AMT
232501000000              MOVE DLRSATRN-TRANS-CNT
232601000000                             TO WS-SWO-RVS-TRANS-CNT
232701000000
232801000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "SWI" AND
232901000000                   DLRSATRN-TRANS-STATUS-CODE = "HST"
233001000000
233101000000              MOVE DLRSATRN-NET-AMT
233201000000                             TO WS-SWI-HST-NET-AMT
233301000000              MOVE DLRSATRN-GROSS-AMT
233401000000                             TO WS-SWI-HST-GROSS-AMT
233501000000              MOVE DLRSATRN-UNIT-AMT
233601000000                             TO WS-SWI-HST-UNIT-AMT
233701000000              MOVE DLRSATRN-TRANS-CNT
233801000000                             TO WS-SWI-HST-TRANS-CNT
233901000000
234001000000           ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "SWI" AND
234101000000                   DLRSATRN-TRANS-STATUS-CODE = "RVS"
234201000000
234301000000              MOVE DLRSATRN-NET-AMT
234401000000                             TO WS-SWI-RVS-NET-AMT
234501000000              MOVE DLRSATRN-GROSS-AMT
234601000000                             TO WS-SWI-RVS-GROSS-AMT
234701000000              MOVE DLRSATRN-UNIT-AMT
234801000000                             TO WS-SWI-RVS-UNIT-AMT
234901000000              MOVE DLRSATRN-TRANS-CNT
235001090715R68593                       TO WS-SWI-RVS-TRANS-CNT
235101090715  |        ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "DSR" AND
235201090724  |              ( DLRSATRN-TRANS-STATUS-CODE = "HST" or
235301090724  |                DLRSATRN-TRANS-STATUS-CODE = "HSC")
235401090715  |           MOVE DLRSATRN-GROSS-AMT
235501090715  |                          TO WS-Dis-Reinv-HST-AMT
235601090715  |        ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "DSR" AND
235701090715  |                DLRSATRN-TRANS-STATUS-CODE = "RVS"
235801090715  |           MOVE DLRSATRN-GROSS-AMT
235901090715  |                          TO WS-Dis-Reinv-RVS-AMT
236001090715  |        ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "DSC" AND
236101090724  |              ( DLRSATRN-TRANS-STATUS-CODE = "HST" or
236201090724  |                DLRSATRN-TRANS-STATUS-CODE = "HSC")
236301090715  |           MOVE DLRSATRN-GROSS-AMT
236401090715  |                          TO WS-Dis-Cash-HST-AMT
236501090715  |        ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "DSC" AND
236601090715  |                DLRSATRN-TRANS-STATUS-CODE = "RVS"
236701090715  |           MOVE DLRSATRN-GROSS-AMT
236801090715  v                          TO WS-Dis-Cash-RVS-AMT
236901090715R68593     END-IF.
237001090715
237101000000       CTS-EXIT.
237201000000           EXIT.
237301000000      /
237401011106R11661*----------------------------------
237501011106R11661 CAPTURE-CON-SUMMARY SECTION.
237601011106R11661*----------------------------------
237701011106R11661
237801011106R11661 CCS-0010.
237901011106R11661
238001011106R11661     IF DLRSATRN-TRANS-TYPE-CODE   = "BUY" AND
238101011106R11661        DLRSATRN-TRANS-STATUS-CODE = "CON"
238201011106R11661
238301011106R11661        MOVE DLRSATRN-NET-AMT
238401011106R11661                       TO WS-BUY-CON-NET-NOW
238501011106R11661        MOVE DLRSATRN-GROSS-AMT
238601011106R11661                       TO WS-BUY-CON-GROSS-NOW
238701011106R11661        MOVE DLRSATRN-UNIT-AMT
238801011106R11661                       TO WS-BUY-CON-UNIT-NOW
238901011106R11661        MOVE DLRSATRN-TRANS-CNT
239001011106R11661                       TO WS-BUY-CON-TRANS-NOW
239101011106R11661
239201011106R11661     ELSE IF DLRSATRN-TRANS-TYPE-CODE   = "SEL" AND
239301011106R11661             DLRSATRN-TRANS-STATUS-CODE = "CON"
239401011106R11661
239501011106R11661        MOVE DLRSATRN-NET-AMT
239601011106R11661                       TO WS-SEL-CON-NET-NOW
239701011106R11661        MOVE DLRSATRN-GROSS-AMT
239801011106R11661                       TO WS-SEL-CON-GROSS-NOW
239901011106R11661        MOVE DLRSATRN-UNIT-AMT
240001011106R11661                       TO WS-SEL-CON-UNIT-NOW
240101011106R11661        MOVE DLRSATRN-TRANS-CNT
240201011106R11661                       TO WS-SEL-CON-TRANS-NOW.
240301011106R11661
240401011106R11661 CCS-EXIT.
240501011106R11661     EXIT.
240601011106      /
240701000000      *----------------------------------
240801000000       CALCULATE-SALES-AMOUNTS SECTION.
240901000000      *----------------------------------
241001000000
241101000000       CSA-0010.
241201000000
241301000000           COMPUTE WS-PURCHASE-AMT =
241401000000                   WS-BUY-HST-NET-AMT +
241501000000                   WS-BUY-CON-NET-AMT -
241601000000                   WS-BUY-RVS-NET-AMT -
241701000000                   WS-BUY-CAN-NET-AMT.
241801000000
241901000000           COMPUTE WS-PURCHASE-CNT =
242001000000                   WS-BUY-HST-TRANS-CNT +
242101000000                   WS-BUY-CON-TRANS-CNT +
242201000000                   WS-BUY-RVS-TRANS-CNT +
242301000000                   WS-BUY-CAN-TRANS-CNT.
242401000000
242501000000           COMPUTE WS-REDEMPTION-AMT =
242601000000                   WS-SEL-HST-GROSS-AMT +
242701000000                   WS-SEL-CON-GROSS-AMT -
242801000000                   WS-SEL-RVS-GROSS-AMT -
242901000000                   WS-SEL-CAN-GROSS-AMT.
243001000000
243101000000           COMPUTE WS-REDEMPTION-CNT =
243201000000                   WS-SEL-HST-TRANS-CNT +
243301000000                   WS-SEL-CON-TRANS-CNT +
243401000000                   WS-SEL-RVS-TRANS-CNT +
243501000000                   WS-SEL-CAN-TRANS-CNT.
243601000000
243701000000           COMPUTE WS-TRANSFER-OUT-AMT =
243801000000                   WS-TRO-HST-GROSS-AMT -
243901000000                   WS-TRO-RVS-GROSS-AMT.
244001000000
244101000000           COMPUTE WS-TRANSFER-OUT-CNT =
244201000000                   WS-TRO-HST-TRANS-CNT +
244301000000                   WS-TRO-RVS-TRANS-CNT.
244401000000
244501000000           COMPUTE WS-TRANSFER-IN-AMT =
244601000000                   WS-TRI-HST-GROSS-AMT -
244701000000                   WS-TRI-RVS-GROSS-AMT.
244801000000
244901000000           COMPUTE WS-TRANSFER-IN-CNT =
245001000000                   WS-TRI-HST-TRANS-CNT +
245101000000                   WS-TRI-RVS-TRANS-CNT.
245201000000
245301000000           COMPUTE WS-SWITCH-OUT-AMT =
245401000000                   WS-SWO-HST-GROSS-AMT -
245501000000                   WS-SWO-RVS-GROSS-AMT.
245601000000
245701000000           COMPUTE WS-SWITCH-OUT-CNT =
245801000000                   WS-SWO-HST-TRANS-CNT +
245901000000                   WS-SWO-RVS-TRANS-CNT.
246001000000
246101000000           COMPUTE WS-SWITCH-IN-AMT =
246201000000                   WS-SWI-HST-GROSS-AMT -
246301000000                   WS-SWI-RVS-GROSS-AMT.
246401000000
246501000000           COMPUTE WS-SWITCH-IN-CNT =
246601000000                   WS-SWI-HST-TRANS-CNT +
246701000000                   WS-SWI-RVS-TRANS-CNT.
246801000000
246901090715R68593     COMPUTE WS-Dist-Reinv-Amt =
247001090715  |                WS-Dis-Reinv-HST-AMT -
247101090715  |                WS-Dis-Reinv-RVS-AMT.
247201090715  |
247301090715  |        COMPUTE WS-Dist-Cash-Amt =
247401090715  v                WS-Dis-Cash-HST-AMT -
247501090715R68953             WS-Dis-Cash-RVS-AMT.
247601090715
247701011105R11661     IF WS-INV-CURRENCY = UNITRAX-BASE-CURRENCY
247801011105R11661        GO TO CSA-CONT.
247901011105R11661
248001011105R11661     COMPUTE WS-PURCHASE-AMT ROUNDED =
248101011105R11661             WS-PURCHASE-AMT / WS-INV-EXCHANGE-RATE.
248201011105R11661
248301011105R11661     COMPUTE WS-REDEMPTION-AMT ROUNDED =
248401011105R11661             WS-REDEMPTION-AMT / WS-INV-EXCHANGE-RATE.
248501011105R11661
248601011105R11661     COMPUTE WS-TRANSFER-OUT-AMT ROUNDED =
248701011105R11661             WS-TRANSFER-OUT-AMT / WS-INV-EXCHANGE-RATE.
248801011105R11661
248901011105R11661     COMPUTE WS-TRANSFER-IN-AMT ROUNDED =
249001011105R11661             WS-TRANSFER-IN-AMT / WS-INV-EXCHANGE-RATE.
249101011105R11661
249201011105R11661     COMPUTE WS-SWITCH-OUT-AMT ROUNDED =
249301011105R11661             WS-SWITCH-OUT-AMT / WS-INV-EXCHANGE-RATE.
249401011105R11661
249501011105R11661     COMPUTE WS-SWITCH-IN-AMT ROUNDED =
249601011105R11661             WS-SWITCH-IN-AMT / WS-INV-EXCHANGE-RATE.
249701011105R11661
249801090715R68593     COMPUTE WS-Dist-Reinv-Amt ROUNDED =
249901090715  |                WS-Dist-Reinv-Amt / WS-INV-EXCHANGE-RATE.
250001090715  |
250101090715  V        COMPUTE WS-Dist-Cash-Amt ROUNDED =
250201090715R68593             WS-Dist-Cash-Amt / WS-INV-EXCHANGE-RATE.
250301090715
250401011105R11661 CSA-CONT.
250501011105R11661
250601000000           COMPUTE WS-NET-SALES-AMT =
250701000000                   WS-PURCHASE-AMT -
250801000000                   WS-REDEMPTION-AMT.
250901000000       CSA-EXIT.
251001000000           EXIT.
251101000000      /
251201000000      *----------------------------------
251301000000       CALCULATE-ASSETS-AMOUNTS SECTION.
251401000000      *----------------------------------
251501000000
251601000000       CAA-0010.
251701000000
251801011105R11661*    COMPUTE WS-ASSETS-UNIT =
251901011105R11661*            WS-CURR-UNIT-BAL +
252001011105R11661*            WS-BUY-CON-UNIT-AMT -
252101011105R11661*            WS-BUY-CAN-UNIT-AMT -
252201011105R11661*            WS-SEL-CON-UNIT-AMT +
252301011105R11661*            WS-SEL-CAN-UNIT-AMT.
252401000000
252501011105R11661     COMPUTE WS-ASSETS-UNIT =
252601011105R11661             WS-CURR-UNIT-BAL +
252701011105R11661             WS-BUY-CON-UNIT-NOW -
252801011105R11661             WS-SEL-CON-UNIT-NOW.
252901011105
253001000000
253101000000           IF WS-INV-CURRENCY = UNITRAX-BASE-CURRENCY
253201000000              COMPUTE WS-ASSETS-AMT ROUNDED =
253301000000                      WS-ASSETS-UNIT * WS-INV-UNIT-PRICE
253401000000           ELSE
253501000000              IF WS-INV-CURRENCY NOT = SPACES
253601000000                 COMPUTE WS-ASSETS-AMT ROUNDED =
253701000000                         WS-ASSETS-UNIT * WS-INV-UNIT-PRICE /
253801000000                         WS-INV-EXCHANGE-RATE.
253901000000
254001000000
254101000000           IF WS-ASSETS-AMT < 0
254201000000              MOVE ZEROS     TO WS-ASSETS-AMT.
254301000000
254401000000       CAA-EXIT.
254501000000           EXIT.
254601000000      /
254701000000      *----------------------------------
254801000000       GET-SALES-ASSETS-RECORD SECTION.
254901000000      *----------------------------------
255001000000
255101000000       GSA-0010.
255201000000
255301000000           INITIALIZE MFADLRSAP OF DEALER-REP-SALES-ASSETS.
255401000000
255501000000           MOVE WS-DEALER-CODE
255601000000                             TO DEALER-CODE OF DEALER-REP-SALES-ASSETS.
255701000000           MOVE WS-DEALER-REP-CODE
255801000000                             TO DEALER-REP-CODE
255901000000                             OF DEALER-REP-SALES-ASSETS.
256001000000           MOVE WS-INVESTMENT-CODE
256101000000                             TO INVESTMENT-CODE
256201000000                             OF DEALER-REP-SALES-ASSETS.
256301000000           MOVE WS-PROCESS-YEAR
256401000000                             TO YEAR OF DEALER-REP-SALES-ASSETS.
256501000000
256601000000           MOVE "R"          TO WRITE-DEALER-REP-SALES-ASSETS.
256701000000
256801000000           READ DEALER-REP-SALES-ASSETS
256901000000           INVALID KEY
257001000000             MOVE "W"        TO WRITE-DEALER-REP-SALES-ASSETS.
257101000000
257201000000       GSA-EXIT.
257301000000           EXIT.
257401000000      /
257501000000      *----------------------------------
257601000000       UPDATE-DAILY-SALES-ASSETS SECTION.
257701000000      *----------------------------------
257801000000
257901000000       UDS-0010.
258001000000
258101000000      *    Daily figures
258201000000
258301000000           MOVE WS-PURCHASE-AMT
258401000000                             TO DLY-PURCHASE-AMT
258501000000                             OF DEALER-REP-SALES-ASSETS.
258601000000           MOVE WS-PURCHASE-CNT
258701000000                             TO DLY-PURCHASE-CNT
258801000000                             OF DEALER-REP-SALES-ASSETS.
258901000000
259001000000           MOVE WS-REDEMPTION-AMT
259101000000                             TO DLY-REDEMPTION-AMT
259201000000                             OF DEALER-REP-SALES-ASSETS.
259301000000           MOVE WS-REDEMPTION-CNT
259401000000                             TO DLY-REDEMPTION-CNT
259501000000                             OF DEALER-REP-SALES-ASSETS.
259601000000
259701000000           MOVE WS-TRANSFER-OUT-AMT
259801000000                             TO DLY-TRANSFER-OUT-AMT
259901000000                             OF DEALER-REP-SALES-ASSETS.
260001000000           MOVE WS-TRANSFER-OUT-CNT
260101000000                             TO DLY-TRANSFER-OUT-CNT
260201000000                             OF DEALER-REP-SALES-ASSETS.
260301000000
260401000000           MOVE WS-TRANSFER-IN-AMT
260501000000                             TO DLY-TRANSFER-IN-AMT
260601000000                             OF DEALER-REP-SALES-ASSETS.
260701000000           MOVE WS-TRANSFER-IN-CNT
260801000000                             TO DLY-TRANSFER-IN-CNT
260901000000                             OF DEALER-REP-SALES-ASSETS.
261001000000
261101000000           MOVE WS-SWITCH-OUT-AMT
261201000000                             TO DLY-SWITCH-OUT-AMT
261301000000                             OF DEALER-REP-SALES-ASSETS.
261401000000           MOVE WS-SWITCH-OUT-CNT
261501000000                             TO DLY-SWITCH-OUT-CNT
261601000000                             OF DEALER-REP-SALES-ASSETS.
261701000000
261801000000           MOVE WS-SWITCH-IN-AMT
261901000000                             TO DLY-SWITCH-IN-AMT
262001000000                             OF DEALER-REP-SALES-ASSETS.
262101000000           MOVE WS-SWITCH-IN-CNT
262201000000                             TO DLY-SWITCH-IN-CNT
262301000000                             OF DEALER-REP-SALES-ASSETS.
262401000000
262501000000           MOVE WS-NET-SALES-AMT
262601000000                             TO DLY-NET-SALES-AMT
262701000000                             OF DEALER-REP-SALES-ASSETS.
262801000000           MOVE WS-ASSETS-AMT
262901000000                             TO ASSETS-AMT
263001000000                             OF DEALER-REP-SALES-ASSETS.
263101000000           MOVE COMM-PROCESS-DATE
263201000000                             TO PROCESS-DATE
263301000000                             OF DEALER-REP-SALES-ASSETS.
263401000000
263501090715R68593     MOVE WS-Dist-Reinv-Amt
263601090715  |                          TO DLY-REINVEST-DIS
263701090715  |                          OF DEALER-REP-SALES-ASSETS.
263801090715  |        MOVE WS-Dist-Cash-Amt
263901090715  v                          TO DLY-CASH-DIS
264001090715R68593                       OF DEALER-REP-SALES-ASSETS.
264101090715
264201000000      *    Accumulate daily figures to Month to date, Year to date,
264301000000      *    Week to date, Quarter to date
264401000000
264501000000           ADD  DLY-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS
264601000000                             TO MTD-PURCHASE-AMT
264701000000                             OF DEALER-REP-SALES-ASSETS
264801000000                                YTD-PURCHASE-AMT
264901000000                             OF DEALER-REP-SALES-ASSETS
265001000000                                WTD-PURCHASE-AMT
265101000000                             OF DEALER-REP-SALES-ASSETS
265201000000                                QTD-PURCHASE-AMT
265301000000                             OF DEALER-REP-SALES-ASSETS.
265401000000
265501000000           ADD  DLY-PURCHASE-CNT OF DEALER-REP-SALES-ASSETS
265601000000                             TO MTD-PURCHASE-CNT
265701000000                             OF DEALER-REP-SALES-ASSETS
265801000000                                YTD-PURCHASE-CNT
265901000000                             OF DEALER-REP-SALES-ASSETS
266001000000                                WTD-PURCHASE-CNT
266101000000                             OF DEALER-REP-SALES-ASSETS
266201000000                                QTD-PURCHASE-CNT
266301000000                             OF DEALER-REP-SALES-ASSETS.
266401000000
266501000000           ADD  DLY-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS
266601000000                             TO MTD-REDEMPTION-AMT
266701000000                             OF DEALER-REP-SALES-ASSETS
266801000000                                YTD-REDEMPTION-AMT
266901000000                             OF DEALER-REP-SALES-ASSETS
267001000000                                WTD-REDEMPTION-AMT
267101000000                             OF DEALER-REP-SALES-ASSETS
267201000000                                QTD-REDEMPTION-AMT
267301000000                             OF DEALER-REP-SALES-ASSETS.
267401000000
267501000000           ADD  DLY-REDEMPTION-CNT OF DEALER-REP-SALES-ASSETS
267601000000                             TO MTD-REDEMPTION-CNT
267701000000                             OF DEALER-REP-SALES-ASSETS
267801000000                                YTD-REDEMPTION-CNT
267901000000                             OF DEALER-REP-SALES-ASSETS
268001000000                                WTD-REDEMPTION-CNT
268101000000                             OF DEALER-REP-SALES-ASSETS
268201000000                                QTD-REDEMPTION-CNT
268301000000                             OF DEALER-REP-SALES-ASSETS.
268401000000
268501000000           ADD  DLY-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS
268601000000                             TO MTD-TRANSFER-OUT-AMT
268701000000                             OF DEALER-REP-SALES-ASSETS
268801000000                                YTD-TRANSFER-OUT-AMT
268901000000                             OF DEALER-REP-SALES-ASSETS
269001000000                                WTD-TRANSFER-OUT-AMT
269101000000                             OF DEALER-REP-SALES-ASSETS
269201000000                                QTD-TRANSFER-OUT-AMT
269301000000                             OF DEALER-REP-SALES-ASSETS.
269401000000
269501000000           ADD  DLY-TRANSFER-OUT-CNT OF DEALER-REP-SALES-ASSETS
269601000000                             TO MTD-TRANSFER-OUT-CNT
269701000000                             OF DEALER-REP-SALES-ASSETS
269801000000                                YTD-TRANSFER-OUT-CNT
269901000000                             OF DEALER-REP-SALES-ASSETS
270001000000                                WTD-TRANSFER-OUT-CNT
270101000000                             OF DEALER-REP-SALES-ASSETS
270201000000                                QTD-TRANSFER-OUT-CNT
270301000000                             OF DEALER-REP-SALES-ASSETS.
270401000000
270501000000           ADD  DLY-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS
270601000000                             TO MTD-TRANSFER-IN-AMT
270701000000                             OF DEALER-REP-SALES-ASSETS
270801000000                                YTD-TRANSFER-IN-AMT
270901000000                             OF DEALER-REP-SALES-ASSETS
271001000000                                WTD-TRANSFER-IN-AMT
271101000000                             OF DEALER-REP-SALES-ASSETS
271201000000                                QTD-TRANSFER-IN-AMT
271301000000                             OF DEALER-REP-SALES-ASSETS.
271401000000
271501000000           ADD  DLY-TRANSFER-IN-CNT OF DEALER-REP-SALES-ASSETS
271601000000                             TO MTD-TRANSFER-IN-CNT
271701000000                             OF DEALER-REP-SALES-ASSETS
271801000000                                YTD-TRANSFER-IN-CNT
271901000000                             OF DEALER-REP-SALES-ASSETS
272001000000                                WTD-TRANSFER-IN-CNT
272101000000                             OF DEALER-REP-SALES-ASSETS
272201000000                                QTD-TRANSFER-IN-CNT
272301000000                             OF DEALER-REP-SALES-ASSETS.
272401000000
272501000000           ADD  DLY-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS
272601000000                             TO MTD-SWITCH-OUT-AMT
272701000000                             OF DEALER-REP-SALES-ASSETS
272801000000                                YTD-SWITCH-OUT-AMT
272901000000                             OF DEALER-REP-SALES-ASSETS
273001000000                                WTD-SWITCH-OUT-AMT
273101000000                             OF DEALER-REP-SALES-ASSETS
273201000000                                QTD-SWITCH-OUT-AMT
273301000000                             OF DEALER-REP-SALES-ASSETS.
273401000000
273501000000           ADD  DLY-SWITCH-OUT-CNT OF DEALER-REP-SALES-ASSETS
273601000000                             TO MTD-SWITCH-OUT-CNT
273701000000                             OF DEALER-REP-SALES-ASSETS
273801000000                                YTD-SWITCH-OUT-CNT
273901000000                             OF DEALER-REP-SALES-ASSETS
274001000000                                WTD-SWITCH-OUT-CNT
274101000000                             OF DEALER-REP-SALES-ASSETS
274201000000                                QTD-SWITCH-OUT-CNT
274301000000                             OF DEALER-REP-SALES-ASSETS.
274401000000
274501000000           ADD  DLY-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS
274601000000                             TO MTD-SWITCH-IN-AMT
274701000000                             OF DEALER-REP-SALES-ASSETS
274801000000                                YTD-SWITCH-IN-AMT
274901000000                             OF DEALER-REP-SALES-ASSETS
275001000000                                WTD-SWITCH-IN-AMT
275101000000                             OF DEALER-REP-SALES-ASSETS
275201000000                                QTD-SWITCH-IN-AMT
275301000000                             OF DEALER-REP-SALES-ASSETS.
275401000000
275501000000           ADD  DLY-SWITCH-IN-CNT OF DEALER-REP-SALES-ASSETS
275601000000                             TO MTD-SWITCH-IN-CNT
275701000000                             OF DEALER-REP-SALES-ASSETS
275801000000                                YTD-SWITCH-IN-CNT
275901000000                             OF DEALER-REP-SALES-ASSETS
276001000000                                WTD-SWITCH-IN-CNT
276101000000                             OF DEALER-REP-SALES-ASSETS
276201000000                                QTD-SWITCH-IN-CNT
276301000000                             OF DEALER-REP-SALES-ASSETS.
276401000000
276501000000           ADD  DLY-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS
276601000000                             TO MTD-NET-SALES-AMT
276701000000                             OF DEALER-REP-SALES-ASSETS
276801000000                                YTD-NET-SALES-AMT
276901000000                             OF DEALER-REP-SALES-ASSETS
277001000000                                WTD-NET-SALES-AMT
277101000000                             OF DEALER-REP-SALES-ASSETS
277201000000                                QTD-NET-SALES-AMT
277301000000                             OF DEALER-REP-SALES-ASSETS.
277401000000
277501000000
277601000000      * Reserving disk consumption - do not create a new record
277701000000      * if a dealer rep has no assets on the process date and
277801000000      * no transactions encountered for the investment since
277901000000      * the beginning of the year.
278001000000
278101000000           IF WRITE-DEALER-REP-SALES-ASSETS = "W"
278201000000            IF NOT (ASSETS-AMT OF DEALER-REP-SALES-ASSETS          > 0
278301000000               OR  YTD-PURCHASE-CNT OF DEALER-REP-SALES-ASSETS     > 0
278401000000               OR  YTD-REDEMPTION-CNT OF DEALER-REP-SALES-ASSETS   > 0
278501000000               OR  YTD-TRANSFER-OUT-CNT OF DEALER-REP-SALES-ASSETS > 0
278601000000               OR  YTD-TRANSFER-IN-CNT OF DEALER-REP-SALES-ASSETS  > 0
278701000000               OR  YTD-SWITCH-OUT-CNT OF DEALER-REP-SALES-ASSETS   > 0
278801000000               OR  YTD-SWITCH-IN-CNT OF DEALER-REP-SALES-ASSETS    > 0)
278901000000              GO TO UDS-EXIT.
279001000000
279101000000
279201000000           IF WRITE-DEALER-REP-SALES-ASSETS = "W"
279301000000              WRITE DEALER-REP-SALES-ASSETS-REC
279401000000              INVALID KEY
279501000000                CONTINUE
279601000000              END-WRITE
279701000000           ELSE
279801000000              REWRITE DEALER-REP-SALES-ASSETS-REC
279901000000              INVALID KEY
280001000000                CONTINUE
280101000000              END-REWRITE
280201000000           END-IF.
280301000000
280401000000           IF WS-FILE-STATUS IS NOT EQUAL TO "00"
280501000000              MOVE "DEALER REP SALES ASSETS"
280601000000                             TO WS-FILE-STATUS-FILE-NAME
280701000000              PERFORM LOG-FILE-STATUS
280801000000           END-IF.
280901000000
281001000000       UDS-EXIT.
281101000000           EXIT.
281201000000      /
281301000000      *----------------------------------
281401000000       OUTPUT-SALES-ASSETS-DETAIL SECTION.
281501000000      *----------------------------------
281601000000
281701000000       OSD-0010.
281801000000
281901000000      * Bypass if a dealer or rep is suppressed for record creation.
282001000000
282101000000           IF DEALER-SUPPRESSED OR
282201000000              REP-SUPPRESSED
282301000000              GO TO OSD-EXIT.
282401000000
282501000000
282601000000      * No output record will be generated if a dealer rep has
282701000000      * no assets and no transactions encountered for the
282801000000      * investment on the process date.
282901000000
283001000000           IF NOT (ASSETS-AMT OF DEALER-REP-SALES-ASSETS           > 0
283101020719R14355         OR  YTD-PURCHASE-CNT OF DEALER-REP-SALES-ASSETS     > 0
283201020719R14355         OR  YTD-REDEMPTION-CNT OF DEALER-REP-SALES-ASSETS   > 0
283301020719R14355         OR  YTD-TRANSFER-OUT-CNT OF DEALER-REP-SALES-ASSETS > 0
283401020719R14355         OR  YTD-TRANSFER-IN-CNT OF DEALER-REP-SALES-ASSETS  > 0
283501020719R14355         OR  YTD-SWITCH-OUT-CNT OF DEALER-REP-SALES-ASSETS   > 0
283601020719R14355         OR  YTD-SWITCH-IN-CNT OF DEALER-REP-SALES-ASSETS    > 0)
283701000000              GO TO OSD-EXIT.
283801000000
283901000000
284001000000           INITIALIZE MFADLRSAXP OF DEALER-REP-SALES-ASSETS-EXT.
284101000000
284201000000           MOVE "DTL"        TO SA-RECORD-TYPE
284301000000                             OF DEALER-REP-SALES-ASSETS-EXT.
284401000000
284501000000           MOVE CORR MFADLRSAP OF DEALER-REP-SALES-ASSETS
284601000000                             TO MFADLRSAXP
284701000000                             OF DEALER-REP-SALES-ASSETS-EXT.
284801000000
284901000000           MOVE BRANCH-CODE OF DEALER-REP
285001000000                             TO BRANCH-CODE
285101000000                             OF DEALER-REP-SALES-ASSETS-EXT.
285201000000           MOVE WS-INV-NAME-LONG
285301000000                             TO INVESTMENT-NAME-LONG
285401000000                             OF DEALER-REP-SALES-ASSETS-EXT.
285501000000           MOVE WS-INV-INDUSTRY-FUND-CODE
285601000000                             TO INDUSTRY-FUND-CODE
285701000000                             OF DEALER-REP-SALES-ASSETS-EXT.
285801000000
285901000000
286001000000      *    +/- for Daily amounts
286101000000
286201000000           IF DLY-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS     < 0
286301000000              MOVE "-"       TO DLY-PURCHASE-AMT-IND
286401000000                             OF DEALER-REP-SALES-ASSETS-EXT
286501000000              COMPUTE
286601000000                DLY-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS-EXT =
286701000000                DLY-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS * -1
286801000000           END-IF.
286901000000
287001000000           IF DLY-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS   < 0
287101000000              MOVE "-"       TO DLY-REDEMPTION-AMT-IND
287201000000                             OF DEALER-REP-SALES-ASSETS-EXT
287301000000              COMPUTE
287401000000                DLY-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS-EXT =
287501000000                DLY-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS * -1
287601000000           END-IF.
287701000000
287801000000           IF DLY-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS < 0
287901000000              MOVE "-"       TO DLY-TRANSFER-OUT-AMT-IND
288001000000                             OF DEALER-REP-SALES-ASSETS-EXT
288101000000              COMPUTE
288201000000                DLY-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
288301000000                DLY-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
288401000000           END-IF.
288501000000
288601000000           IF DLY-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS  < 0
288701000000              MOVE "-"       TO DLY-TRANSFER-IN-AMT-IND
288801000000                             OF DEALER-REP-SALES-ASSETS-EXT
288901000000              COMPUTE
289001000000                DLY-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
289101000000                DLY-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
289201000000           END-IF.
289301000000
289401000000           IF DLY-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS   < 0
289501000000              MOVE "-"       TO DLY-SWITCH-OUT-AMT-IND
289601000000                             OF DEALER-REP-SALES-ASSETS-EXT
289701000000              COMPUTE
289801000000                DLY-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
289901000000                DLY-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
290001000000           END-IF.
290101000000
290201000000           IF DLY-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS    < 0
290301000000              MOVE "-"       TO DLY-SWITCH-IN-AMT-IND
290401000000                             OF DEALER-REP-SALES-ASSETS-EXT
290501000000              COMPUTE
290601000000                DLY-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
290701000000                DLY-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
290801000000           END-IF.
290901000000
291001000000           IF DLY-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS    < 0
291101000000              MOVE "-"       TO DLY-NET-SALES-AMT-IND
291201000000                             OF DEALER-REP-SALES-ASSETS-EXT
291301000000              COMPUTE
291401000000                DLY-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS-EXT =
291501000000                DLY-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS * -1
291601000000           END-IF.
291701000000
291801090719R68593     IF DLY-REINVEST-DIS OF DEALER-REP-SALES-ASSETS     < 0
291901090719  ]           MOVE "-"       TO DLY-REINVEST-DIS-IND
292001090719  ]                          OF DEALER-REP-SALES-ASSETS-EXT
292101090719  ]           COMPUTE
292201090719  ]             DLY-REINVEST-DIS OF DEALER-REP-SALES-ASSETS-EXT =
292301090719  ]             DLY-REINVEST-DIS OF DEALER-REP-SALES-ASSETS * -1
292401090719  ]        END-IF.
292501090719  ]
292601090719  ]        IF DLY-CASH-DIS     OF DEALER-REP-SALES-ASSETS     < 0
292701090719  ]           MOVE "-"       TO DLY-CASH-DIS-IND
292801090719  ]                          OF DEALER-REP-SALES-ASSETS-EXT
292901090719  ]           COMPUTE
293001090719  ]             DLY-CASH-DIS OF DEALER-REP-SALES-ASSETS-EXT =
293101090719  V             DLY-CASH-DIS OF DEALER-REP-SALES-ASSETS * -1
293201090719R68593     END-IF.
293301090719
293401000000      *    +/- for Month to date amounts
293501000000
293601000000           IF MTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS     < 0
293701000000              MOVE "-"       TO MTD-PURCHASE-AMT-IND
293801000000                             OF DEALER-REP-SALES-ASSETS-EXT
293901000000              COMPUTE
294001000000                MTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS-EXT =
294101000000                MTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS * -1
294201000000           END-IF.
294301000000
294401000000           IF MTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS   < 0
294501000000              MOVE "-"       TO MTD-REDEMPTION-AMT-IND
294601000000                             OF DEALER-REP-SALES-ASSETS-EXT
294701000000              COMPUTE
294801000000                MTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS-EXT =
294901000000                MTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS * -1
295001000000           END-IF.
295101000000
295201000000           IF MTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS < 0
295301000000              MOVE "-"       TO MTD-TRANSFER-OUT-AMT-IND
295401000000                             OF DEALER-REP-SALES-ASSETS-EXT
295501000000              COMPUTE
295601000000                MTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
295701000000                MTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
295801000000           END-IF.
295901000000
296001000000           IF MTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS  < 0
296101000000              MOVE "-"       TO MTD-TRANSFER-IN-AMT-IND
296201000000                             OF DEALER-REP-SALES-ASSETS-EXT
296301000000              COMPUTE
296401000000                MTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
296501000000                MTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
296601000000           END-IF.
296701000000
296801000000           IF MTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS   < 0
296901000000              MOVE "-"       TO MTD-SWITCH-OUT-AMT-IND
297001000000                             OF DEALER-REP-SALES-ASSETS-EXT
297101000000              COMPUTE
297201000000                MTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
297301000000                MTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
297401000000           END-IF.
297501000000
297601000000           IF MTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS    < 0
297701000000              MOVE "-"       TO MTD-SWITCH-IN-AMT-IND
297801000000                             OF DEALER-REP-SALES-ASSETS-EXT
297901000000              COMPUTE
298001000000                MTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
298101000000                MTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
298201000000           END-IF.
298301000000
298401000000           IF MTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS    < 0
298501000000              MOVE "-"       TO MTD-NET-SALES-AMT-IND
298601000000                             OF DEALER-REP-SALES-ASSETS-EXT
298701000000              COMPUTE
298801000000                MTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS-EXT =
298901000000                MTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS * -1
299001000000           END-IF.
299101000000
299201000000
299301000000      *    +/- for Year to date amounts
299401000000
299501000000           IF YTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS     < 0
299601000000              MOVE "-"       TO YTD-PURCHASE-AMT-IND
299701000000                             OF DEALER-REP-SALES-ASSETS-EXT
299801000000              COMPUTE
299901000000                YTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS-EXT =
300001000000                YTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS * -1
300101000000           END-IF.
300201000000
300301000000           IF YTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS   < 0
300401000000              MOVE "-"       TO YTD-REDEMPTION-AMT-IND
300501000000                             OF DEALER-REP-SALES-ASSETS-EXT
300601000000              COMPUTE
300701000000                YTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS-EXT =
300801000000                YTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS * -1
300901000000           END-IF.
301001000000
301101000000           IF YTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS < 0
301201000000              MOVE "-"       TO YTD-TRANSFER-OUT-AMT-IND
301301000000                             OF DEALER-REP-SALES-ASSETS-EXT
301401000000              COMPUTE
301501000000                YTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
301601000000                YTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
301701000000           END-IF.
301801000000
301901000000           IF YTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS  < 0
302001000000              MOVE "-"       TO YTD-TRANSFER-IN-AMT-IND
302101000000                             OF DEALER-REP-SALES-ASSETS-EXT
302201000000              COMPUTE
302301000000                YTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
302401000000                YTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
302501000000           END-IF.
302601000000
302701000000           IF YTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS   < 0
302801000000              MOVE "-"       TO YTD-SWITCH-OUT-AMT-IND
302901000000                             OF DEALER-REP-SALES-ASSETS-EXT
303001000000              COMPUTE
303101000000                YTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
303201000000                YTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
303301000000           END-IF.
303401000000
303501000000           IF YTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS    < 0
303601000000              MOVE "-"       TO YTD-SWITCH-IN-AMT-IND
303701000000                             OF DEALER-REP-SALES-ASSETS-EXT
303801000000              COMPUTE
303901000000                YTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
304001000000                YTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
304101000000           END-IF.
304201000000
304301000000           IF YTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS    < 0
304401000000              MOVE "-"       TO YTD-NET-SALES-AMT-IND
304501000000                             OF DEALER-REP-SALES-ASSETS-EXT
304601000000              COMPUTE
304701000000                YTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS-EXT =
304801000000                YTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS * -1
304901000000           END-IF.
305001000000
305101000000
305201000000       OSD-0020.
305301000000
305401000000           IF COMM-WEEK-END = "Y"
305501000000              GO TO OSD-0030.
305601000000
305701000000           MOVE ZEROS        TO
305801000000                WTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS-EXT
305901000000                WTD-PURCHASE-CNT OF DEALER-REP-SALES-ASSETS-EXT
306001000000                WTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS-EXT
306101000000                WTD-REDEMPTION-CNT OF DEALER-REP-SALES-ASSETS-EXT
306201000000                WTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT
306301000000                WTD-TRANSFER-OUT-CNT OF DEALER-REP-SALES-ASSETS-EXT
306401000000                WTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT
306501000000                WTD-TRANSFER-IN-CNT OF DEALER-REP-SALES-ASSETS-EXT
306601000000                WTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT
306701000000                WTD-SWITCH-OUT-CNT OF DEALER-REP-SALES-ASSETS-EXT
306801000000                WTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT
306901000000                WTD-SWITCH-IN-CNT OF DEALER-REP-SALES-ASSETS-EXT
307001000000                WTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS-EXT.
307101000000
307201000000           GO TO OSD-0040.
307301000000
307401000000       OSD-0030.
307501000000
307601000000      *    +/- for Week to date amounts
307701000000
307801000000           IF WTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS     < 0
307901000000              MOVE "-"       TO WTD-PURCHASE-AMT-IND
308001000000                             OF DEALER-REP-SALES-ASSETS-EXT
308101000000              COMPUTE
308201000000                WTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS-EXT =
308301000000                WTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS * -1
308401000000           END-IF.
308501000000
308601000000           IF WTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS   < 0
308701000000              MOVE "-"       TO WTD-REDEMPTION-AMT-IND
308801000000                             OF DEALER-REP-SALES-ASSETS-EXT
308901000000              COMPUTE
309001000000                WTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS-EXT =
309101000000                WTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS * -1
309201000000           END-IF.
309301000000
309401000000           IF WTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS < 0
309501000000              MOVE "-"       TO WTD-TRANSFER-OUT-AMT-IND
309601000000                             OF DEALER-REP-SALES-ASSETS-EXT
309701000000              COMPUTE
309801000000                WTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
309901000000                WTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
310001000000           END-IF.
310101000000
310201000000           IF WTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS  < 0
310301000000              MOVE "-"       TO WTD-TRANSFER-IN-AMT-IND
310401000000                             OF DEALER-REP-SALES-ASSETS-EXT
310501000000              COMPUTE
310601000000                WTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
310701000000                WTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
310801000000           END-IF.
310901000000
311001000000           IF WTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS   < 0
311101000000              MOVE "-"       TO WTD-SWITCH-OUT-AMT-IND
311201000000                             OF DEALER-REP-SALES-ASSETS-EXT
311301000000              COMPUTE
311401000000                WTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
311501000000                WTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
311601000000           END-IF.
311701000000
311801000000           IF WTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS    < 0
311901000000              MOVE "-"       TO WTD-SWITCH-IN-AMT-IND
312001000000                             OF DEALER-REP-SALES-ASSETS-EXT
312101000000              COMPUTE
312201000000                WTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
312301000000                WTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
312401000000           END-IF.
312501000000
312601000000           IF WTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS    < 0
312701000000              MOVE "-"       TO WTD-NET-SALES-AMT-IND
312801000000                             OF DEALER-REP-SALES-ASSETS-EXT
312901000000              COMPUTE
313001000000                WTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS-EXT =
313101000000                WTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS * -1
313201000000           END-IF.
313301000000
313401000000       OSD-0040.
313501000000
313601000000           IF COMM-QUARTER-END = "Y"
313701000000              GO TO OSD-0050.
313801000000
313901000000           MOVE ZEROS        TO
314001000000                QTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS-EXT
314101000000                QTD-PURCHASE-CNT OF DEALER-REP-SALES-ASSETS-EXT
314201000000                QTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS-EXT
314301000000                QTD-REDEMPTION-CNT OF DEALER-REP-SALES-ASSETS-EXT
314401000000                QTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT
314501000000                QTD-TRANSFER-OUT-CNT OF DEALER-REP-SALES-ASSETS-EXT
314601000000                QTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT
314701000000                QTD-TRANSFER-IN-CNT OF DEALER-REP-SALES-ASSETS-EXT
314801000000                QTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT
314901000000                QTD-SWITCH-OUT-CNT OF DEALER-REP-SALES-ASSETS-EXT
315001000000                QTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT
315101000000                QTD-SWITCH-IN-CNT OF DEALER-REP-SALES-ASSETS-EXT
315201000000                QTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS-EXT.
315301000000
315401000000           GO TO OSD-0060.
315501000000
315601000000       OSD-0050.
315701000000
315801000000      *    +/- for Quarter to date amounts
315901000000
316001000000           IF QTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS     < 0
316101000000              MOVE "-"       TO QTD-PURCHASE-AMT-IND
316201000000                             OF DEALER-REP-SALES-ASSETS-EXT
316301000000              COMPUTE
316401000000                QTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS-EXT =
316501000000                QTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS * -1
316601000000           END-IF.
316701000000
316801000000           IF QTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS   < 0
316901000000              MOVE "-"       TO QTD-REDEMPTION-AMT-IND
317001000000                             OF DEALER-REP-SALES-ASSETS-EXT
317101000000              COMPUTE
317201000000                QTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS-EXT =
317301000000                QTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS * -1
317401000000           END-IF.
317501000000
317601000000           IF QTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS < 0
317701000000              MOVE "-"       TO QTD-TRANSFER-OUT-AMT-IND
317801000000                             OF DEALER-REP-SALES-ASSETS-EXT
317901000000              COMPUTE
318001000000                QTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
318101000000                QTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
318201000000           END-IF.
318301000000
318401000000           IF QTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS  < 0
318501000000              MOVE "-"       TO QTD-TRANSFER-IN-AMT-IND
318601000000                             OF DEALER-REP-SALES-ASSETS-EXT
318701000000              COMPUTE
318801000000                QTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
318901000000                QTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
319001000000           END-IF.
319101000000
319201000000           IF QTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS   < 0
319301000000              MOVE "-"       TO QTD-SWITCH-OUT-AMT-IND
319401000000                             OF DEALER-REP-SALES-ASSETS-EXT
319501000000              COMPUTE
319601000000                QTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS-EXT =
319701000000                QTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS * -1
319801000000           END-IF.
319901000000
320001000000           IF QTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS    < 0
320101000000              MOVE "-"       TO QTD-SWITCH-IN-AMT-IND
320201000000                             OF DEALER-REP-SALES-ASSETS-EXT
320301000000              COMPUTE
320401000000                QTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS-EXT =
320501000000                QTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS * -1
320601000000           END-IF.
320701000000
320801000000           IF QTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS    < 0
320901000000              MOVE "-"       TO QTD-NET-SALES-AMT-IND
321001000000                             OF DEALER-REP-SALES-ASSETS-EXT
321101000000              COMPUTE
321201000000                QTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS-EXT =
321301000000                QTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS * -1
321401000000           END-IF.
321501000000
321601000000
321701000000       OSD-0060.
321801000000
321901000000           WRITE DLR-REP-SALES-ASSETS-EXT-REC.
322001000000
322101000000           ADD  1            TO WS-DETAIL-CNT-TOTAL.
322201000000           ADD  WS-ASSETS-AMT
322301000000                             TO WS-DETAIL-ASSETS-AMT-TOTAL.
322401000000
322501000000       OSD-EXIT.
322601000000           EXIT.
322701000000      /
322801000000      *----------------------------------
322901000000       UPDATE-HISTORY-SALES SECTION.
323001000000      *----------------------------------
323101000000
323201000000       UHS-0010.
323301000000
323401000000           IF WS-HISTORY-FLAG NOT = "WTD"
323501000000              GO TO UHS-0020.
323601000000
323701000000      *    Set week to date history figures
323801000000
323901000000           MOVE WS-PURCHASE-AMT
324001000000                             TO WTD-PURCHASE-AMT
324101000000                             OF DEALER-REP-SALES-ASSETS.
324201000000           MOVE WS-PURCHASE-CNT
324301000000                             TO WTD-PURCHASE-CNT
324401000000                             OF DEALER-REP-SALES-ASSETS.
324501000000
324601000000           MOVE WS-REDEMPTION-AMT
324701000000                             TO WTD-REDEMPTION-AMT
324801000000                             OF DEALER-REP-SALES-ASSETS.
324901000000           MOVE WS-REDEMPTION-CNT
325001000000                             TO WTD-REDEMPTION-CNT
325101000000                             OF DEALER-REP-SALES-ASSETS.
325201000000
325301000000           MOVE WS-TRANSFER-OUT-AMT
325401000000                             TO WTD-TRANSFER-OUT-AMT
325501000000                             OF DEALER-REP-SALES-ASSETS.
325601000000           MOVE WS-TRANSFER-OUT-CNT
325701000000                             TO WTD-TRANSFER-OUT-CNT
325801000000                             OF DEALER-REP-SALES-ASSETS.
325901000000
326001000000           MOVE WS-TRANSFER-IN-AMT
326101000000                             TO WTD-TRANSFER-IN-AMT
326201000000                             OF DEALER-REP-SALES-ASSETS.
326301000000           MOVE WS-TRANSFER-IN-CNT
326401000000                             TO WTD-TRANSFER-IN-CNT
326501000000                             OF DEALER-REP-SALES-ASSETS.
326601000000
326701000000           MOVE WS-SWITCH-OUT-AMT
326801000000                             TO WTD-SWITCH-OUT-AMT
326901000000                             OF DEALER-REP-SALES-ASSETS.
327001000000           MOVE WS-SWITCH-OUT-CNT
327101000000                             TO WTD-SWITCH-OUT-CNT
327201000000                             OF DEALER-REP-SALES-ASSETS.
327301000000
327401000000           MOVE WS-SWITCH-IN-AMT
327501000000                             TO WTD-SWITCH-IN-AMT
327601000000                             OF DEALER-REP-SALES-ASSETS.
327701000000           MOVE WS-SWITCH-IN-CNT
327801000000                             TO WTD-SWITCH-IN-CNT
327901000000                             OF DEALER-REP-SALES-ASSETS.
328001000000
328101000000           MOVE WS-NET-SALES-AMT
328201000000                             TO WTD-NET-SALES-AMT
328301000000                             OF DEALER-REP-SALES-ASSETS.
328401000000
328501000000       UHS-0020.
328601000000
328701000000           IF WS-HISTORY-FLAG NOT = "MTD"
328801000000              GO TO UHS-0030.
328901000000
329001000000
329101000000      *    Set month to date history figures
329201000000
329301000000           MOVE WS-PURCHASE-AMT
329401000000                             TO MTD-PURCHASE-AMT
329501000000                             OF DEALER-REP-SALES-ASSETS.
329601000000           MOVE WS-PURCHASE-CNT
329701000000                             TO MTD-PURCHASE-CNT
329801000000                             OF DEALER-REP-SALES-ASSETS.
329901000000
330001000000           MOVE WS-REDEMPTION-AMT
330101000000                             TO MTD-REDEMPTION-AMT
330201000000                             OF DEALER-REP-SALES-ASSETS.
330301000000           MOVE WS-REDEMPTION-CNT
330401000000                             TO MTD-REDEMPTION-CNT
330501000000                             OF DEALER-REP-SALES-ASSETS.
330601000000
330701000000           MOVE WS-TRANSFER-OUT-AMT
330801000000                             TO MTD-TRANSFER-OUT-AMT
330901000000                             OF DEALER-REP-SALES-ASSETS.
331001000000           MOVE WS-TRANSFER-OUT-CNT
331101000000                             TO MTD-TRANSFER-OUT-CNT
331201000000                             OF DEALER-REP-SALES-ASSETS.
331301000000
331401000000           MOVE WS-TRANSFER-IN-AMT
331501000000                             TO MTD-TRANSFER-IN-AMT
331601000000                             OF DEALER-REP-SALES-ASSETS.
331701000000           MOVE WS-TRANSFER-IN-CNT
331801000000                             TO MTD-TRANSFER-IN-CNT
331901000000                             OF DEALER-REP-SALES-ASSETS.
332001000000
332101000000           MOVE WS-SWITCH-OUT-AMT
332201000000                             TO MTD-SWITCH-OUT-AMT
332301000000                             OF DEALER-REP-SALES-ASSETS.
332401000000           MOVE WS-SWITCH-OUT-CNT
332501000000                             TO MTD-SWITCH-OUT-CNT
332601000000                             OF DEALER-REP-SALES-ASSETS.
332701000000
332801000000           MOVE WS-SWITCH-IN-AMT
332901000000                             TO MTD-SWITCH-IN-AMT
333001000000                             OF DEALER-REP-SALES-ASSETS.
333101000000           MOVE WS-SWITCH-IN-CNT
333201000000                             TO MTD-SWITCH-IN-CNT
333301000000                             OF DEALER-REP-SALES-ASSETS.
333401000000
333501000000           MOVE WS-NET-SALES-AMT
333601000000                             TO MTD-NET-SALES-AMT
333701000000                             OF DEALER-REP-SALES-ASSETS.
333801000000
333901000000       UHS-0030.
334001000000
334101000000           IF WS-HISTORY-FLAG NOT = "QTD"
334201000000              GO TO UHS-0040.
334301000000
334401000000
334501000000      *    Set quarter to date history figures
334601000000
334701000000           MOVE WS-PURCHASE-AMT
334801000000                             TO QTD-PURCHASE-AMT
334901000000                             OF DEALER-REP-SALES-ASSETS.
335001000000           MOVE WS-PURCHASE-CNT
335101000000                             TO QTD-PURCHASE-CNT
335201000000                             OF DEALER-REP-SALES-ASSETS.
335301000000
335401000000           MOVE WS-REDEMPTION-AMT
335501000000                             TO QTD-REDEMPTION-AMT
335601000000                             OF DEALER-REP-SALES-ASSETS.
335701000000           MOVE WS-REDEMPTION-CNT
335801000000                             TO QTD-REDEMPTION-CNT
335901000000                             OF DEALER-REP-SALES-ASSETS.
336001000000
336101000000           MOVE WS-TRANSFER-OUT-AMT
336201000000                             TO QTD-TRANSFER-OUT-AMT
336301000000                             OF DEALER-REP-SALES-ASSETS.
336401000000           MOVE WS-TRANSFER-OUT-CNT
336501000000                             TO QTD-TRANSFER-OUT-CNT
336601000000                             OF DEALER-REP-SALES-ASSETS.
336701000000
336801000000           MOVE WS-TRANSFER-IN-AMT
336901000000                             TO QTD-TRANSFER-IN-AMT
337001000000                             OF DEALER-REP-SALES-ASSETS.
337101000000           MOVE WS-TRANSFER-IN-CNT
337201000000                             TO QTD-TRANSFER-IN-CNT
337301000000                             OF DEALER-REP-SALES-ASSETS.
337401000000
337501000000           MOVE WS-SWITCH-OUT-AMT
337601000000                             TO QTD-SWITCH-OUT-AMT
337701000000                             OF DEALER-REP-SALES-ASSETS.
337801000000           MOVE WS-SWITCH-OUT-CNT
337901000000                             TO QTD-SWITCH-OUT-CNT
338001000000                             OF DEALER-REP-SALES-ASSETS.
338101000000
338201000000           MOVE WS-SWITCH-IN-AMT
338301000000                             TO QTD-SWITCH-IN-AMT
338401000000                             OF DEALER-REP-SALES-ASSETS.
338501000000           MOVE WS-SWITCH-IN-CNT
338601000000                             TO QTD-SWITCH-IN-CNT
338701000000                             OF DEALER-REP-SALES-ASSETS.
338801000000
338901000000           MOVE WS-NET-SALES-AMT
339001000000                             TO QTD-NET-SALES-AMT
339101000000                             OF DEALER-REP-SALES-ASSETS.
339201000000
339301000000       UHS-0040.
339401000000
339501000000           IF WS-HISTORY-FLAG NOT = "YTD"
339601000000              GO TO UHS-0050.
339701000000
339801000000
339901000000      *    Set year to date history figures
340001000000
340101000000           MOVE WS-PURCHASE-AMT
340201000000                             TO YTD-PURCHASE-AMT
340301000000                             OF DEALER-REP-SALES-ASSETS.
340401000000           MOVE WS-PURCHASE-CNT
340501000000                             TO YTD-PURCHASE-CNT
340601000000                             OF DEALER-REP-SALES-ASSETS.
340701000000
340801000000           MOVE WS-REDEMPTION-AMT
340901000000                             TO YTD-REDEMPTION-AMT
341001000000                             OF DEALER-REP-SALES-ASSETS.
341101000000           MOVE WS-REDEMPTION-CNT
341201000000                             TO YTD-REDEMPTION-CNT
341301000000                             OF DEALER-REP-SALES-ASSETS.
341401000000
341501000000           MOVE WS-TRANSFER-OUT-AMT
341601000000                             TO YTD-TRANSFER-OUT-AMT
341701000000                             OF DEALER-REP-SALES-ASSETS.
341801000000           MOVE WS-TRANSFER-OUT-CNT
341901000000                             TO YTD-TRANSFER-OUT-CNT
342001000000                             OF DEALER-REP-SALES-ASSETS.
342101000000
342201000000           MOVE WS-TRANSFER-IN-AMT
342301000000                             TO YTD-TRANSFER-IN-AMT
342401000000                             OF DEALER-REP-SALES-ASSETS.
342501000000           MOVE WS-TRANSFER-IN-CNT
342601000000                             TO YTD-TRANSFER-IN-CNT
342701000000                             OF DEALER-REP-SALES-ASSETS.
342801000000
342901000000           MOVE WS-SWITCH-OUT-AMT
343001000000                             TO YTD-SWITCH-OUT-AMT
343101000000                             OF DEALER-REP-SALES-ASSETS.
343201000000           MOVE WS-SWITCH-OUT-CNT
343301000000                             TO YTD-SWITCH-OUT-CNT
343401000000                             OF DEALER-REP-SALES-ASSETS.
343501000000
343601000000           MOVE WS-SWITCH-IN-AMT
343701000000                             TO YTD-SWITCH-IN-AMT
343801000000                             OF DEALER-REP-SALES-ASSETS.
343901000000           MOVE WS-SWITCH-IN-CNT
344001000000                             TO YTD-SWITCH-IN-CNT
344101000000                             OF DEALER-REP-SALES-ASSETS.
344201000000
344301000000           MOVE WS-NET-SALES-AMT
344401000000                             TO YTD-NET-SALES-AMT
344501000000                             OF DEALER-REP-SALES-ASSETS.
344601000000
344701000000       UHS-0050.
344801000000
344901000000       UHS-EXIT.
345001000000           EXIT.
345101000000
345201000000      /
345301000000      *----------------------------------
345401000000       ADD-HISTORY-MTD-TO-QTD SECTION.
345501000000      *----------------------------------
345601000000
345701000000       AMQ-0010.
345801000000
345901000000      *    Accumulate month to date figures to Quarter to date buckets
346001000000
346101000000           ADD  MTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS
346201000000                             TO QTD-PURCHASE-AMT
346301000000                             OF DEALER-REP-SALES-ASSETS.
346401000000
346501000000           ADD  MTD-PURCHASE-CNT OF DEALER-REP-SALES-ASSETS
346601000000                             TO QTD-PURCHASE-CNT
346701000000                             OF DEALER-REP-SALES-ASSETS.
346801000000
346901000000           ADD  MTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS
347001000000                             TO QTD-REDEMPTION-AMT
347101000000                             OF DEALER-REP-SALES-ASSETS.
347201000000
347301000000           ADD  MTD-REDEMPTION-CNT OF DEALER-REP-SALES-ASSETS
347401000000                             TO QTD-REDEMPTION-CNT
347501000000                             OF DEALER-REP-SALES-ASSETS.
347601000000
347701000000           ADD  MTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS
347801000000                             TO QTD-TRANSFER-OUT-AMT
347901000000                             OF DEALER-REP-SALES-ASSETS.
348001000000
348101000000           ADD  MTD-TRANSFER-OUT-CNT OF DEALER-REP-SALES-ASSETS
348201000000                             TO QTD-TRANSFER-OUT-CNT
348301000000                             OF DEALER-REP-SALES-ASSETS.
348401000000
348501000000           ADD  MTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS
348601000000                             TO QTD-TRANSFER-IN-AMT
348701000000                             OF DEALER-REP-SALES-ASSETS.
348801000000
348901000000           ADD  MTD-TRANSFER-IN-CNT OF DEALER-REP-SALES-ASSETS
349001000000                             TO QTD-TRANSFER-IN-CNT
349101000000                             OF DEALER-REP-SALES-ASSETS.
349201000000
349301000000           ADD  MTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS
349401000000                             TO QTD-SWITCH-OUT-AMT
349501000000                             OF DEALER-REP-SALES-ASSETS.
349601000000
349701000000           ADD  MTD-SWITCH-OUT-CNT OF DEALER-REP-SALES-ASSETS
349801000000                             TO QTD-SWITCH-OUT-CNT
349901000000                             OF DEALER-REP-SALES-ASSETS.
350001000000
350101000000           ADD  MTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS
350201000000                             TO QTD-SWITCH-IN-AMT
350301000000                             OF DEALER-REP-SALES-ASSETS.
350401000000
350501000000           ADD  MTD-SWITCH-IN-CNT OF DEALER-REP-SALES-ASSETS
350601000000                             TO QTD-SWITCH-IN-CNT
350701000000                             OF DEALER-REP-SALES-ASSETS.
350801000000
350901000000           ADD  MTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS
351001000000                             TO QTD-NET-SALES-AMT
351101000000                             OF DEALER-REP-SALES-ASSETS.
351201000000
351301000000       AMQ-EXIT.
351401000000           EXIT.
351501000000      /
351601000000      *----------------------------------
351701000000       ADD-HISTORY-MTD-TO-YTD SECTION.
351801000000      *----------------------------------
351901000000
352001000000       AMY-0010.
352101000000
352201000000      *    Accumulate month to date figures to Year to date buckets
352301000000
352401000000           ADD  MTD-PURCHASE-AMT OF DEALER-REP-SALES-ASSETS
352501000000                             TO YTD-PURCHASE-AMT
352601000000                             OF DEALER-REP-SALES-ASSETS.
352701000000
352801000000           ADD  MTD-PURCHASE-CNT OF DEALER-REP-SALES-ASSETS
352901000000                             TO YTD-PURCHASE-CNT
353001000000                             OF DEALER-REP-SALES-ASSETS.
353101000000
353201000000           ADD  MTD-REDEMPTION-AMT OF DEALER-REP-SALES-ASSETS
353301000000                             TO YTD-REDEMPTION-AMT
353401000000                             OF DEALER-REP-SALES-ASSETS.
353501000000
353601000000           ADD  MTD-REDEMPTION-CNT OF DEALER-REP-SALES-ASSETS
353701000000                             TO YTD-REDEMPTION-CNT
353801000000                             OF DEALER-REP-SALES-ASSETS.
353901000000
354001000000           ADD  MTD-TRANSFER-OUT-AMT OF DEALER-REP-SALES-ASSETS
354101000000                             TO YTD-TRANSFER-OUT-AMT
354201000000                             OF DEALER-REP-SALES-ASSETS.
354301000000
354401000000           ADD  MTD-TRANSFER-OUT-CNT OF DEALER-REP-SALES-ASSETS
354501000000                             TO YTD-TRANSFER-OUT-CNT
354601000000                             OF DEALER-REP-SALES-ASSETS.
354701000000
354801000000           ADD  MTD-TRANSFER-IN-AMT OF DEALER-REP-SALES-ASSETS
354901000000                             TO YTD-TRANSFER-IN-AMT
355001000000                             OF DEALER-REP-SALES-ASSETS.
355101000000
355201000000           ADD  MTD-TRANSFER-IN-CNT OF DEALER-REP-SALES-ASSETS
355301000000                             TO YTD-TRANSFER-IN-CNT
355401000000                             OF DEALER-REP-SALES-ASSETS.
355501000000
355601000000           ADD  MTD-SWITCH-OUT-AMT OF DEALER-REP-SALES-ASSETS
355701000000                             TO YTD-SWITCH-OUT-AMT
355801000000                             OF DEALER-REP-SALES-ASSETS.
355901000000
356001000000           ADD  MTD-SWITCH-OUT-CNT OF DEALER-REP-SALES-ASSETS
356101000000                             TO YTD-SWITCH-OUT-CNT
356201000000                             OF DEALER-REP-SALES-ASSETS.
356301000000
356401000000           ADD  MTD-SWITCH-IN-AMT OF DEALER-REP-SALES-ASSETS
356501000000                             TO YTD-SWITCH-IN-AMT
356601000000                             OF DEALER-REP-SALES-ASSETS.
356701000000
356801000000           ADD  MTD-SWITCH-IN-CNT OF DEALER-REP-SALES-ASSETS
356901000000                             TO YTD-SWITCH-IN-CNT
357001000000                             OF DEALER-REP-SALES-ASSETS.
357101000000
357201000000           ADD  MTD-NET-SALES-AMT OF DEALER-REP-SALES-ASSETS
357301000000                             TO YTD-NET-SALES-AMT
357401000000                             OF DEALER-REP-SALES-ASSETS.
357501000000
357601000000       AMY-EXIT.
357701000000           EXIT.
357801000000      /
357901000000      *----------------------------------
358001000000       OUTPUT-SALES-ASSETS-HEADER SECTION.
358101000000      *----------------------------------
358201000000
358301000000       OSH-0010.
358401000000
358501000000           INITIALIZE WS-DLR-REP-SALES-ASSETS-HEADER.
358601000000
358701000000           MOVE "HDR"        TO SA-RECORD-TYPE
358801000000                             OF WS-DLR-REP-SALES-ASSETS-HEADER.
358901000000
359001000000           MOVE COMM-PROCESS-DATE
359101000000                             TO PROCESS-DATE
359201000000                             OF WS-DLR-REP-SALES-ASSETS-HEADER.
359301000000           MOVE COMM-WEEK-END
359401000000                             TO WEEK-END
359501000000                             OF WS-DLR-REP-SALES-ASSETS-HEADER.
359601000000           MOVE COMM-MONTH-END
359701000000                             TO MONTH-END
359801000000                             OF WS-DLR-REP-SALES-ASSETS-HEADER.
359901000000           MOVE COMM-QUARTER-END
360001000000                             TO QUARTER-END
360101000000                             OF WS-DLR-REP-SALES-ASSETS-HEADER.
360201000000           MOVE COMM-YEAR-END
360301000000                             TO YEAR-END
360401000000                             OF WS-DLR-REP-SALES-ASSETS-HEADER.
360501000000           MOVE WS-HEADER-EXCHANGE-RATE
360601000000                             TO EXCHANGE-RATE
360701000000                             OF WS-DLR-REP-SALES-ASSETS-HEADER.
360801000000
360901000000           WRITE DLR-REP-SALES-ASSETS-EXT-REC
361001000000                 FROM WS-DLR-REP-SALES-ASSETS-HEADER.
361101000000
361201000000           MOVE "Y"          TO WS-HEADER-WRITTEN.
361301000000
361401000000       OSH-EXIT.
361501000000           EXIT.
361601000000      /
361701000000      *----------------------------------
361801000000       OUTPUT-SALES-ASSETS-TRAIL SECTION.
361901000000      *----------------------------------
362001000000
362101000000       OST-0010.
362201000000
362301000000           INITIALIZE WS-DLR-REP-SALES-ASSETS-TRAIL.
362401000000
362501000000           MOVE "TRL"        TO SA-RECORD-TYPE
362601000000                             OF WS-DLR-REP-SALES-ASSETS-TRAIL.
362701000000
362801000000           MOVE WS-DETAIL-CNT-TOTAL
362901000000                             TO SA-DETAIL-CNT
363001000000                             OF WS-DLR-REP-SALES-ASSETS-TRAIL.
363101000000           MOVE WS-DETAIL-ASSETS-AMT-TOTAL
363201000000                             TO ASSETS-AMT
363301000000                             OF WS-DLR-REP-SALES-ASSETS-TRAIL.
363401000000
363501000000           WRITE DLR-REP-SALES-ASSETS-EXT-REC
363601000000                 FROM WS-DLR-REP-SALES-ASSETS-TRAIL.
363701000000
363801000000       OST-EXIT.
363901000000           EXIT.
364001000000      /
364101000000      *----------------------------------
364201000000       LEVEL-REINIT-1 SECTION.
364301000000      *----------------------------------
364401000000
364501000000       LR1-0010.
364601000000
364701000000           INITIALIZE WS-INVESTMENT-LEVEL-AREA.
364801000000
364901000000           MOVE "N"          TO WS-INV-FOUND-FLAG.
365001000000
365101000000           SEARCH ALL IV-INVESTMENT
365201000000           WHEN IV-INVESTMENT-CODE (IV-IDX) = CURR-INVESTMENT-CODE
365301000000                MOVE "Y"     TO WS-INV-FOUND-FLAG.
365401000000
365501000000
365601000000           IF WS-INV-FOUND
365701000000              MOVE IV-INDUSTRY-FUND-CODE   (IV-IDX)
365801000000                             TO WS-INV-INDUSTRY-FUND-CODE
365901000000              MOVE IV-INVESTMENT-NAME-LONG (IV-IDX)
366001000000                             TO WS-INV-NAME-LONG
366101000000              MOVE IV-CURRENCY             (IV-IDX)
366201000000                             TO WS-INV-CURRENCY
366301000000              MOVE IV-UNIT-PRICE           (IV-IDX)
366401000000                             TO WS-INV-UNIT-PRICE
366501000000              MOVE IV-EXCHANGE-RATE        (IV-IDX)
366601000000                             TO WS-INV-EXCHANGE-RATE
366701000000              MOVE IV-TRADE-DATE           (IV-IDX)
366801000000                             TO WS-INV-TRADE-DATE
366901000000
367001000000              IF WS-INV-CURRENCY          = SPACES OR
367101000000                 WS-INV-UNIT-PRICE        = ZEROS  OR
367201000000                 WS-INV-EXCHANGE-RATE     = ZEROS  OR
367301000000                 COMM-LOG-INVESTMENT-OPT  = "Y"
367401000000
367501000000                 IF IV-INFO-LOGGED (IV-IDX) NOT = "Y"
367601000000                    MOVE "Y" TO IV-INFO-LOGGED (IV-IDX)
367701000000
367801000000                    IF WS-INV-CURRENCY      = SPACES OR
367901000000                       WS-INV-UNIT-PRICE    = ZEROS  OR
368001000000                       WS-INV-EXCHANGE-RATE = ZEROS
368101000000                       MOVE "ERROR" TO WS-INV-MSG
368201000000                    ELSE
368301000000                       MOVE "INFO"  TO WS-INV-MSG
368401000000                    END-IF
368501000000
368601000000                    PERFORM LOG-INVESTMENT-INFO
368701000000                 END-IF
368801000000              END-IF
368901000000           ELSE
369001000000              PERFORM LOG-INVALID-INVESTMENT
369101000000           END-IF.
369201000000
369301000000       LR1-EXIT.
369401000000           EXIT.
369501000000      /
369601000000      *----------------------------------
369701000000       LEVEL-REINIT-2 SECTION.
369801000000      *----------------------------------
369901000000
370001000000       LR2-0010.
370101000000
370201000000           INITIALIZE MFADEAREP OF DEALER-REP.
370301000000
370401000000           MOVE CURR-DEALER-CODE
370501000000                             TO DEALER-CODE OF DEALER-REP.
370601000000           MOVE CURR-DEALER-REP-CODE
370701000000                             TO DEALER-REP-CODE OF DEALER-REP.
370801000000
370901000000           READ DEALER-REP
371001000000           INVALID KEY
371101000000             CONTINUE.
371201000000
371301000000       LR2-0020.
371401000000
371501000000           MOVE "N"          TO WS-REP-SUPPRESS-FLAG.
371601000000
371701000000           INITIALIZE MFADERMIP OF DEALER-REP-MAILING-INSTR.
371801000000
371901000000           MOVE CURR-DEALER-CODE
372001000000                             TO DEALER-CODE
372101000000                             OF DEALER-REP-MAILING-INSTR.
372201000000           MOVE CURR-DEALER-REP-CODE
372301000000                             TO DEALER-REP-CODE
372401000000                             OF DEALER-REP-MAILING-INSTR.
372501000000           MOVE SUPPRESS-FORM-CODE
372601000000                             TO FORM-CODE OF DEALER-REP-MAILING-INSTR.
372701000000
372801000000           START DEALER-REP-MAILING-INSTR
372901000000           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
373001000000           INVALID KEY
373101000000             GO TO LR2-EXIT.
373201000000
373301000000       LR2-0030.
373401000000
373501000000           READ DEALER-REP-MAILING-INSTR NEXT
373601000000           AT END
373701000000             GO TO LR2-EXIT.
373801000000
373901000000           IF DEALER-CODE OF DEALER-REP-MAILING-INSTR NOT =
374001000000              CURR-DEALER-CODE
374101000000              GO TO LR2-EXIT.
374201000000
374301000000           IF DEALER-REP-CODE OF DEALER-REP-MAILING-INSTR NOT =
374401000000              CURR-DEALER-REP-CODE
374501000000              GO TO LR2-EXIT.
374601000000
374701000000           IF FORM-CODE OF DEALER-REP-MAILING-INSTR NOT =
374801000000              SUPPRESS-FORM-CODE
374901000000              GO TO LR2-EXIT.
375001000000
375101000000           MOVE "Y"          TO WS-REP-SUPPRESS-FLAG.
375201000000
375301000000       LR2-EXIT.
375401000000           EXIT.
375501000000      /
375601000000      *----------------------------------
375701000000       LEVEL-REINIT-3 SECTION.
375801000000      *----------------------------------
375901000000
376001000000       LR3-0010.
376101000000
376201000000           MOVE "N"          TO WS-DEALER-SUPPRESS-FLAG.
376301000000
376401000000           INITIALIZE MFADEAMIP OF DEALER-MAILING-INSTR.
376501000000
376601000000           MOVE CURR-DEALER-CODE
376701000000                             TO DEALER-CODE OF DEALER-MAILING-INSTR.
376801000000           MOVE SUPPRESS-FORM-CODE
376901000000                             TO FORM-CODE OF DEALER-MAILING-INSTR.
377001000000
377101000000           START DEALER-MAILING-INSTR
377201000000           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
377301000000           INVALID KEY
377401000000             GO TO LR3-EXIT.
377501000000
377601000000       LR3-0020.
377701000000
377801000000           READ DEALER-MAILING-INSTR NEXT
377901000000           AT END
378001000000             GO TO LR3-EXIT.
378101000000
378201000000           IF DEALER-CODE OF DEALER-MAILING-INSTR NOT =
378301000000              CURR-DEALER-CODE
378401000000              GO TO LR3-EXIT.
378501000000
378601000000           IF FORM-CODE OF DEALER-MAILING-INSTR NOT =
378701000000              SUPPRESS-FORM-CODE
378801000000              GO TO LR3-EXIT.
378901000000
379001000000           MOVE "Y"          TO WS-DEALER-SUPPRESS-FLAG.
379101000000
379201000000       LR3-EXIT.
379301000000           EXIT.
379401000000      /
379501000000      *----------------------------------
379601000000       LEVEL-SUMMARY-1 SECTION.
379701000000      *----------------------------------
379801000000       LS1-EXIT.
379901000000           EXIT.
380001000000      /
380101000000      *----------------------------------
380201000000       LEVEL-SUMMARY-2 SECTION.
380301000000      *----------------------------------
380401000000       LS2-EXIT.
380501000000           EXIT.
380601000000      /
380701000000      *----------------------------------
380801000000       LEVEL-SUMMARY-3 SECTION.
380901000000      *----------------------------------
381001000000       LS3-EXIT.
381101000000           EXIT.
381201000000      /
381301000000      *----------------------------------
381401000000       END-JOB SECTION.
381501000000      *----------------------------------
381601000000
381701000000       EOJ-0010.
381801000000
381901000000           EXEC SQL
382001000000            WHENEVER SQLERROR GOTO EOJ-EXIT
382101000000           END-EXEC.
382201000000
382301000000           EXEC SQL
382401000000           WHENEVER NOT FOUND GO TO EOJ-EXIT
382501000000           END-EXEC.
382601000000
382701000000
382801000000           IF COMM-RETURN-CODE NOT = SPACES
382901000000              PERFORM ERROR-MESSAGE-HANDLING
383001000000              IF WS-FILES-OPENED NOT = "Y"
383101000000                 GO TO EOJ-EXIT.
383201000000
383301000000
383401000000           IF WS-HEADER-WRITTEN = "Y"
383501000000              PERFORM OUTPUT-SALES-ASSETS-TRAIL.
383601000000
383701000000
383801000000           IF COMM-PROCESS-OPTION = "D"
383901000000
384001000000           EXEC SQL
384101000000           CLOSE DLRINDCUR
384201000000           END-EXEC
384301000000
384401000000           END-IF.
384501000000
384601000000
384701000000           IF COMM-PROCESS-OPTION = "C"
384801000000
384901000000           EXEC SQL
385001000000           CLOSE DLRINCCUR
385101000000           END-EXEC
385201000000
385301000000           END-IF.
385401000000
385501000000
385601000000           CLOSE       DEALER-REP-SALES-ASSETS
385701000000                       DEALER-REP-SALES-ASSETS-EXT.
385801000000
385901000000      *    CLOSE       INVESTMENT
386001000000      *                INVESTMENT-NAME
386101000000      *                INVESTMENT-LAST-UNIT-PRICE
386201000000      *                INVESTMENT-UNIT-PRICE
386301000000      *                INVESTMENT-GROUP
386401000000      *                PROGRAM-EXCHANGE-RATE
386501000000      *                EXCHANGE-RATE-M
386601000000      *                CURRENCY-CODE
386701000000      *                DEALER-MAILING-INSTR
386801000000      *                DEALER-REP-MAILING-INSTR
386901000000      *                DEALER-REP.
387001000000
387101000000
387201000000       EOJ-EXIT.
387301000000           EXIT.
387401000000
387501000000      /
387601000000      *----------------------------------
387701000000       LOG-INVESTMENT-INFO SECTION.
387801000000      *----------------------------------
387901000000
388001000000      *    Log only once, any subsequent errors/info for the same
388101000000      *    investment will be skipped.
388201000000
388301000000
388401000000       LIE-0010.
388501000000
388601000000           MOVE SPACES       TO WS-ERROR-LINE.
388701000000
388801000000           MOVE WS-INV-UNIT-PRICE
388901000000                             TO WS-INV-UNIT-PRICE-X.
389001000000           MOVE WS-INV-EXCHANGE-RATE
389101000000                             TO WS-INV-EXCHANGE-RATE-X.
389201000000           MOVE WS-INV-TRADE-DATE
389301000000                             TO WS-INV-TRADE-DATE-X.
389401000000
389501000000           STRING "PROGRAM "                       DELIMITED BY SIZE
389601000000                  PROGRAM-ID-CODE                  DELIMITED BY " "
389701000000                  " "                              DELIMITED BY SIZE
389801000000                  WS-INV-MSG                       DELIMITED BY " "
389901000000                  " "                              DELIMITED BY SIZE
390001000000                  "INVESTMENT CODE "               DELIMITED BY SIZE
390101000000                  CURR-INVESTMENT-CODE             DELIMITED BY " "
390201000000                  " "                              DELIMITED BY SIZE
390301000000                  "CURRENCY "                      DELIMITED BY SIZE
390401000000                  WS-INV-CURRENCY                  DELIMITED BY SIZE
390501000000                  " "                              DELIMITED BY SIZE
390601000000                  "UNIT PRICE "                    DELIMITED BY SIZE
390701000000                  WS-INV-UNIT-PRICE-X              DELIMITED BY SIZE
390801000000                             INTO WS-ERROR-LINE.
390901000000
391001000000           DISPLAY WS-ERROR-LINE.
391101000000
391201000000           MOVE SPACES       TO WS-ERROR-LINE.
391301000000
391401000000           STRING "EXCHANGE RATE "                 DELIMITED BY SIZE
391501000000                  WS-INV-EXCHANGE-RATE-X           DELIMITED BY SIZE
391601000000                  " "                              DELIMITED BY SIZE
391701000000                  "TRADE DATE "                    DELIMITED BY SIZE
391801000000                  WS-INV-TRADE-DATE-X              DELIMITED BY SIZE
391901000000                             INTO WS-ERROR-LINE.
392001000000
392101000000           DISPLAY WS-ERROR-LINE.
392201000000
392301000000       LIE-EXIT.
392401000000           EXIT.
392501000000      /
392601000000      *----------------------------------
392701000000       LOG-INVALID-INVESTMENT SECTION.
392801000000      *----------------------------------
392901000000
393001000000      *    Log only once, any subsequent errors for the same
393101000000      *    investment will be skipped.
393201000000
393301000000       LII-0010.
393401000000
393501000000           MOVE 0            TO II-CNT.
393601000000
393701000000       LII-0020.
393801000000
393901000000           ADD  1            TO II-CNT.
394001091110
39410109111074289      IF II-CNT >= ln_Array-Size-II
39420109111074289         COMPUTE   ln_Array-Size-II  = ln_Array-Size-II + 1
39430109111074289      END-IF
394401091110
394501000000           IF II-CNT > II-IDX-MAX
394601000000              GO TO LII-EXIT.
394701000000           IF II-INVESTMENT-CODE (II-CNT) = CURR-INVESTMENT-CODE
394801000000              GO TO LII-EXIT.
394901000000           IF II-INVESTMENT-CODE (II-CNT) = SPACES
395001000000              GO TO LII-0030.
395101000000
395201000000           GO TO LII-0020.
395301000000
395401000000       LII-0030.
395501000000
395601000000           MOVE CURR-INVESTMENT-CODE
395701000000                             TO II-INVESTMENT-CODE (II-CNT).
395801000000
395901000000           MOVE SPACES       TO WS-ERROR-LINE.
396001000000
396101000000           STRING "PROGRAM "                       DELIMITED BY SIZE
396201000000                  PROGRAM-ID-CODE                  DELIMITED BY " "
396301000000                  " "                              DELIMITED BY SIZE
396401000000                  "INVESTMENT NOT FOUND "          DELIMITED BY SIZE
396501000000                  CURR-INVESTMENT-CODE             DELIMITED BY " "
396601000000                             INTO WS-ERROR-LINE.
396701000000
396801000000           DISPLAY WS-ERROR-LINE.
396901000000
397001000000       LII-EXIT.
397101000000           EXIT.
397201000000      /
397301000000      *----------------------------------
397401000000       LOG-FILE-STATUS SECTION.
397501000000      *----------------------------------
397601000000
397701000000       LFS-0000.
397801000000
397901000000           MOVE SPACES       TO WS-ERROR-LINE.
398001000000
398101000000           STRING "PROGRAM "                       DELIMITED BY SIZE
398201000000                  PROGRAM-ID-CODE                  DELIMITED BY " "
398301000000                  " "                              DELIMITED BY SIZE
398401000000                  "ERROR OCCURRED ON FILE "        DELIMITED BY SIZE
398501000000                  WS-FILE-STATUS-FILE-NAME         DELIMITED BY "  "
398601000000                  ". FILE STATUS VALUE "           DELIMITED BY SIZE
398701000000                  WS-FILE-STATUS                   DELIMITED BY SIZE
398801000000                             INTO WS-ERROR-LINE.
398901000000
399001000000           DISPLAY WS-ERROR-LINE.
399101000000
399201000000       LFS-EXIT.
399301000000           EXIT.
399401000000      /
399501000000      *----------------------------------
399601000000       STOPPGM SECTION.
399701000000      *----------------------------------
399801000000
399901000000       STOPPGM-0010.
400001000000
400101000000           MOVE "05"         TO COMM-RETURN-CODE.
400201000000           PERFORM ERROR-MESSAGE-HANDLING.
400301000000           STOP RUN.
400401000000
400501000000       STOPRUN-EXIT.
400601000000           EXIT.
400701000000
400801000000      /
400901000000      *----------------------------------
401001000000       ERROR-MESSAGE-HANDLING SECTION.
401101000000      *----------------------------------
401201000000
401301000000       EMH-0010.
401401000000
401501000000           MOVE SPACES       TO WS-ERROR-LINE.
401601000000           MOVE COMM-RETURN-CODE (1:2)
401701000000                             TO ERR-ID-X.
401801000000
401901000000           IF ERR-ID-X IS NUMERIC
402001000000              STRING "PROGRAM "                    DELIMITED BY SIZE
402101000000                      PROGRAM-ID-CODE              DELIMITED BY " "
402201000000                     " "                           DELIMITED BY SIZE
402301000000                     "ERROR CODE "                 DELIMITED BY SIZE
402401000000                      COMM-RETURN-CODE             DELIMITED BY " "
402501000000                     " "                           DELIMITED BY SIZE
402601000000                      ERROR-MSG (ERR-ID)           DELIMITED BY "  "
402701000000                             INTO WS-ERROR-LINE
402801000000           ELSE
402901000000              STRING "PROGRAM "                    DELIMITED BY SIZE
403001000000                      PROGRAM-ID-CODE              DELIMITED BY " "
403101000000                     " "                           DELIMITED BY SIZE
403201000000                     "ERROR CODE "                 DELIMITED BY SIZE
403301000000                      COMM-RETURN-CODE             DELIMITED BY " "
403401000000                             INTO WS-ERROR-LINE
403501000000           END-IF.
403601000000
403701000000           DISPLAY WS-ERROR-LINE.
403801000000
403901000000       EMH-EXIT.
404001000000           EXIT.
404101000000
404201000000      /
404301000000      *----------------------------------
404401000000       PERIOD-MESSAGE-HANDLING SECTION.
404501000000      *----------------------------------
404601000000
404701000000       PMH-0010.
404801000000
404901000000           MOVE SPACES       TO WS-ERROR-LINE.
405001000000           MOVE COMM-PROCESS-DATE
405101000000                             TO WS-DATE.
405201000000           STRING "PROGRAM "                       DELIMITED BY SIZE
405301000000                   PROGRAM-ID-CODE                 DELIMITED BY " "
405401000000                  " "                              DELIMITED BY SIZE
405501000000                  "DATE "                          DELIMITED BY SIZE
405601000000                   WS-DATE-X                       DELIMITED BY SIZE
405701000000                  " "                              DELIMITED BY SIZE
405801000000                  "PERIOD "                        DELIMITED BY SIZE
405901000000                   WS-PERIOD                       DELIMITED BY SIZE
406001000000                  " "                              DELIMITED BY SIZE
406101000000                  "ERROR "                         DELIMITED BY SIZE
406201000000                   WS-PERIOD-ERROR-CODE            DELIMITED BY " "
406301000000                  " "                              DELIMITED BY SIZE
406401000000                   WS-PERIOD-ERROR-MESSAGE         DELIMITED BY "  "
406501000000                             INTO WS-ERROR-LINE.
406601000000
406701000000           DISPLAY WS-ERROR-LINE.
406801000000
406901000000       PMH-EXIT.
407001000000           EXIT.
407101090902
40720109090273100 *----------------------------------
40730109090273100  Extract-ReInvest-Trns SECTION.
40740109090273100 *----------------------------------
407501090902
40760109090273100  ERT-0010.
407701090902
40780109090273100      EXEC SQL
40790109090273100      WHENEVER SQLERROR CONTINUE
40800109090273100      END-EXEC.
408101090902
40820109092173768      EXEC SQL
40830109092173768      WHENEVER NOT FOUND CONTINUE
40840109092173768      END-EXEC.
408501090921
40860109090273100      Exec SQL
40870109090273100         Drop Table QTEMP/SQDSTRN
40880109090273100      End-Exec.
40890109090273100
40900109090273100      Exec SQL
40910109090273100         Create Table QTEMP/SQDSTRN as (
40920109090273100            Select TRANS_TYPE_CODE, TRANS_STATUS_CODE,
40930109090273100                   DEALER_CODE, DEALER_REP_CODE, INVESTMENT_CODE,
40940109090273100                   NET_AMT, GROSS_AMT,  UNIT_AMT
40950109090273100              From MFATRNP ) with no data
40960109090273100      End-Exec.
40970109090273100
40980109090273100      Exec SQL
40990109090273100        Insert into QTEMP/SQDSTRN (
41000109090273100        SELECT
41010109090273100           CASE
41020109092973100 * 74281   When (Trnddp.DISTR_OPTION_CODE = "R"  OR
41030109092973100 * 74281        (Trnp.Unit_Amt > 0 AND
41040109092973100 * 74281         trnddp.DISTR_OPTION_CODE = " "))  THEN "DSR"
41050109092973100 * 74281   When Trnddp.DISTR_OPTION_CODE = "C"     THEN "DSC"
41060109092974281           When (Coalesce(Trnddp.DISTR_OPTION_CODE, " ") = "R"  OR
41070109092974281                 Coalesce(Trnidp.DISTR_OPTION_CODE, " ") = "R"  OR
41080109092974281                (Trnp.Unit_Amt > 0 AND
41090109092974281                (Coalesce(trnddp.DISTR_OPTION_CODE,"X") = " "  OR
41100109092974281                 Coalesce(trnidp.DISTR_OPTION_CODE,"X") = " ")))
41110109092974281                 THEN "DSR"
41120109092974281           When Coalesce(Trnddp.DISTR_OPTION_CODE, " ") = "C" OR
41130109092974281                Coalesce(Trnidp.DISTR_OPTION_CODE, " ") = "C"
41140109092974281                THEN "DSC"
41150109090273100           Else Trnp.TRANS_TYPE_CODE End, Trnp.TRANS_STATUS_CODE,
41160109090273100           trnp.DEALER_CODE, trnp.DEALER_REP_CODE,
41170109090273100           trnp.INVESTMENT_CODE,
41180109090273100           Trnp.NET_AMT,  Trnp.GROSS_AMT,  Trnp.UNIT_AMT
41190109090273100
41200109090273100        FROM MFATRNP Trnp
41210109090273100
41220109090273100        LEFT OUTER JOIN MFATRNDDP Trnddp ON
41230109090273100             trnddp.placement_date = Trnp.placement_date AND
41240109090273100             trnddp.trans_no       = Trnp.trans_no
41250109090273100
41260109092974281        LEFT OUTER JOIN MFATRNIDP Trnidp ON
41270109092974281             trnidp.placement_date = Trnp.placement_date AND
41280109092974281             trnidp.trans_no       = Trnp.trans_no
41290109092974281
41300109090273100        WHERE
41310109090273100             Trnp.PROCESS_DATE    = :comm-process-date    and
41320109090273100             Trnp.TRANS_TYPE_CODE in ("INC","CPG","INT") and
41330109090273100             Trnp.TRANS_STATUS_CODE in ("HST", "HSC", "RVS")  )
41340109090273100      End-Exec.
41350109090273100
41360109090273100  ERT-EXIT.
41370109090273100      EXIT.
413801090902
413901100627      * RFS 83999 Begins
414001100625      *----------------------------------
414101100625       Extract-Daily-Trns SECTION.
414201100625      *----------------------------------
414301100625
414401100625       EDT-0010.
414501100625
414601100625           EXEC SQL
414701100625             Insert into QTEMP/SQTRNP  (
414801100627            SELECT
414901100625                CASE
415001100625                WHEN (Trans_Type_Code = "BUY" AND Contr_Redem_Code =
415101100625                      "CFMIK") THEN "TRI" ELSE Trans_Type_Code END,
415201100625                Trans_Status_Code, Net_Amt, Gross_Amt,
415301100625                Unit_Amt, Dealer_Code, Dealer_Rep_Code, Investment_Code
415401100627            FROM MFATRNP
415501100627            WHERE
415601100627            PROCESS_DATE    = :comm-process-date and
415701100627           ((TRANS_TYPE_CODE in ("BUY", "SEL","CQD") and
415801100627             TRANS_STATUS_CODE = "HST" and
415901100627             WIRE_ORDER_FLAG <> "Y") or (TRANS_TYPE_CODE in ("BUY",
416001100625           "SEL") and TRANS_STATUS_CODE = "CON") or (TRANS_TYPE_CODE in
416101100625           ("BUY", "SEL", "CQD") and TRANS_STATUS_CODE = "RVS") or
416201100625           (TRANS_TYPE_CODE in ("BUY", "SEL") and TRANS_STATUS_CODE =
416301100625           "CAN") or (TRANS_TYPE_CODE in ("TRO", "TRI", "SWI", "SWO")
416401100625           and TRANS_STATUS_CODE in ("HST", "RVS"))))
416501100625
416601100628           END-EXEC.
416701100627
416801100625       EDT-EXIT.
416901100625           EXIT.
417001100627      * RFS 83999 Ends
