000100170402      * %ATTR COMMIT(*CHG) DBGVIEW(*SOURCE)
000200190122       IDENTIFICATION DIVISION.
000300200203       PROGRAM-ID.     ESGPARSER INITIAL.
000400200203       INSTALLATION.   CitiGroup CIB.
000500211006       AUTHOR.         ABDIRISAK HASSAN.
000600190510       DATE-WRITTEN.   SEPTEMBER 07, 2001.
000700200930       DATE-COMPILED.
000800190226      *****************************************************************
000900040507      *    PURPOSE:    To process the received NFU XML message in     *
001000040507      *                batch mode.  Preliminary edits are performed.  *
001100180706      *                                                               *
001200170418      *
001300041005      * COMPILE OPTION: When compiling this module ensure the         *
001400210512      *                 Commitment Control parameter is set to *CHG.  *
001500170412      *                                                               *
001600041005      *                 To create *PGM, refer CRESGXMSRV & CRESGXMPGM.*
001700041005      *                                                               *
001800000000      *****************************************************************
001900000000      /
002000000000      *****************************************************************
002100000000      *    C H A N G E   H I S T O R Y                                *
002200000000      *****************************************************************
002300000000      *****************************************************************
002400040914      * PROGRAMMER *YYYY/MM/DD* DESCRIPTION OF CHANGE
002500041005      *****************************************************************
002600050607      * Karen Eng  *2005/03/31* RFS# 26599 - changed program to handle*
002700050607      *            *          * updates to Global tables for business *
002800050607      *            *          * process Advisory changes (AddModRep & *
002900050607      *            *          * InaRep).                              *
003000050607      *---------------------------------------------------------------*
003100050607      * John Rab   *2005/03/28* RFS 26004 - ESG 16 - Advisor NFU
003200050607      *            *          * -Add two business process calls:
003300050607      *            *          * 1) ESGPREPDTL to process AddModRep.
003400050607      *            *          * 2) ESGPINAREP to process InaRep.
003500050607      *****************************************************************
003600050607      * Brian Z    *2005/02/07* RFS 26171
003700050607      *            *          * -XML special entities handling.
003800050607      *****************************************************************
003900041007      * Clement Lui*2004/10/05* RFS 24590 issue#267
004000041005      *            *          * -Fix the wrong tag in response file.
004100040914      *****************************************************************
004200040916      * Abdi       *2004/09/14* RFS 24237
004300040914      * Hassan     *          * -Extract version number regardless of
004400040914      *            *          * spaces or lack of space between word
004500040914      *            *          * Version and the number in the quotes.
004600040804      *****************************************************************
004700040830      * Michael   *040830*23543* - Added the MessageId to the         *
004800040830      * Mondoux   *      *     *   response.                          *
004900040830      *****************************************************************
005000040805      * Michael   *040804*23609* - Commit after writting into         *
005100040805      * Mondoux   *      *     *   MFANFULGP (NFU LOG).               *
005200040805      *           *      *       - Added Version# 15.5.               *
005300031218      *****************************************************************
005400040518      * C.Lentini *040421*20032* - ESG15 - Change copy book from      *
005500040421      *           *      *     *   CPYXMLTAG to CPXMLTAG15.           *
005600040422      *           *      *     * - Remove parsing of dlr. & inter.lkup*
005700040422      *           *      *     * - Parse source type in get-source rtn*
005800040518      *           *      *     * - Rework logic.                      *
005900040421      *****************************************************************
006000040402      * C.LENTINI *040401*21360* - COMMIT accepted & not supported.   *
006100040402      *           *      *     *   ROLLBACK rejected messages.        *
006200040401      *****************************************************************
006300031218      * Tony P.   *031218*17089* - Reject the XML messages (DEALER/   *
006400031218      *           *      *     *   Intemediary) when the Dealer/      *
006500031218      *           *      *     *   Intermediary is not authorized to  *
006600031218      *           *      *     *   to process the requested XML       *
006700031218      *           *      *     *   business process.                  *
006800030422      *****************************************************************
006900031008      * A. Hassan *031008*18629* - FXSCEDTALW was modified to return  *
007000031008      *           *      *     *   SCREEN-EDITS-ALLOWED record.       *P)*
007100031008      *           *      *     *                                      *P)*
007200031022      *****************************************************************
007300031022      * Tony P.   *030917*18255* - If ModDistribution process then set*
007400031022      *           *      *     *   the WS-LEVEL-PROCESS to 'AIV"      *
007500031022      *           *      *     *                                      *
007600031008      *****************************************************************
007700030718      * C.LENTINI *030718*16785* - Change reject code from            *
007800030718      *           *      *     *   904 - ERR-XML-INV-TARGET-CODE  to  *
007900030718      *           *      *     *   980 - ERR-XML-NOT-SUPPORTED or     *
008000030718      *           *      *     *   918 - ERR-XML-MIS-ACCT-LKUP        *
008100030718      *****************************************************************
008200030606      * Karen Eng *030605*17666* ESG14                                *
008300030606      *           *      *     * -The parameter for XXMIXMLEL didn't  *
008400030606      *           *      *     *  include the WS-REJECT-FLAG.         *
008500030606      *****************************************************************
008600030527      *  Michael   *  2003/05/27  * RFS 17553 (ESG 14.1.1.)           *
008700030527      *  Mondoux   *              * - Removed the AcctConfirm section *
008800030527      *            *              *   from rejected messages.         *
008900030527      *****************************************************************
009000030425      *  C.LENTINI *  2003/04/25  * RFS 13764 (ESG 14)                *
009100030425      *            *              * -AcctSetup process added.         *
009200030425      *****************************************************************
009300030422      *  Tony  P.  *  2003/04/22  * RFS 13768 (ESG 14)                *
009400030422      *            *              * -Added to process new business    *
009500030422      *            *              *  process (ADDPAC)                 *
009600030507      *            *              * - Increase size of the MFAESGXMIP *
009700030507      *            *              *   and MFAESGXMOP files.           *
009800030507      *            *              * - Changed all reference of        *
009900030507      *            *              *   WS-SIZE-5000 to WS-SIZE-32766.  *
010000030507      *            *              * - Increased WS-MESSAGE to 32766   *
010100030507      *            *              *   bytes.                          *
010200030422      *            *              *                                   *
010300000000      *****************************************************************
010400030404      *  Karen Eng *  2003/03/31  * RFS 16144                         *
010500030404      *            *              * - Added Management Company Lookup.*
010600030404      *            *              * - Modified Write-Response routine.*
010700030404      *            *              * - Replace Ws-Return-Code with     *
010800030404      *            *              *    Ws-Reject-Flag.                *
010900030404      *            *              * - Execute Business-Call-Rountine  *
011000030404      *            *              *   when Ws-Reject-Flag <> 'Y'.     *
011100030523      *            *              * - Group Flag and Spousal Flag will*
011200030523      *            *              *   be parsed if entered.           *
011300030404      *****************************************************************
011400030211      *  Karen Eng *  2003/02/11  * RFS 16311                         *
011500030211      *            *              * - Added ESGLOOKUP.                *
011600030211      *            *              * - Added ESGXMLERR.                *
011700030211      *****************************************************************
011800030306      *  Karen Eng *  2003/03/06  * RFS 16685                         *
011900030306      *            *              * - Recompile only.                 *
012000030306      *****************************************************************
012100021030      *  Michael   *  2002/10/21  * RFS 15231                         *
012200021030      *  Mondoux   *              * - Set pre-fixes to the clerk id.  *
012300021030      *            *              * - Add default clerk id.           *
012400021030      *****************************************************************
012500021001      *  Michael   *  2002/10/01  * RFS 15120                         *
012600021001      *  Mondoux   *              * - Increase the size of the        *
012700021001      *            *              *   following;                      *
012800021001      *            *              *   a. MFAESGXMOP file - MSG-OUT.   *
012900021001      *            *              *   b. WS-RESPONSE work field.      *
013000021001      *****************************************************************
013100020905      *C.Lentini   *  2002/09/05  * RFS 13766 ESG 13 Compliance Mods. *
013200020905      *            *              * - AddBeneficiary business process.*
013300020912      *            *              * - Increase ws-business-process to *
013400020912      *            *              *   5000 bytes.                     *
013500020905      *****************************************************************
013600020822      *C.LENTINI   *  2002/08/22  * RFS 14359 ESG 13 Compliance Mods. *
013700020822      *            *              * - Change error code to 980 in     *
013800020822      *            *              *   get-business-type rtn.          *
013900020822      *            *              * - Field Ws-Not-Supported added &  *
014000020824      *            *              *   used in response message.       *
014100020822      *            *              * - Pass Ws-Not-Supported to all    *
014200020824      *            *              *   business types as a parm.       *
014300021001      *****************************************************************
014400021001      *  Michael   *  2002/08/29  * RFS 14515                         *
014500021001      *  Mondoux   *              * - Fix the error code assignment.  *
014600020920      *****************************************************************
014700020920      *  Michael   *  2002/04/18  * RFS 13140                         *
014800020920      *  Mondoux   *              * - Removed additional spaces in the*
014900020920      *            *              *   response message elements.      *
015000020920      *****************************************************************
015100020920      *  Michael   *  2002/04/18  * RFS 12998                         *
015200020920      *  Mondoux   *              * - Added the ModDistributions      *
015300020920      *            *              *   processes for ESG 12.0.         *
015400020920      *****************************************************************
015500020417      *A.Hassan   *   2001/09/120 * RFS 11281 - Created Program       *
015600050329      *****************************************************************
015700050607      * Waldi R.   * 2005/03/30   * RFS26514 - recompile due to
015800050607      *            *              * CPYOERES copy book changes.
015900050607      *****************************************************************
016000050607      * Tony       *2005/03/31*RFS26013 recompiled only ESG 16         *
016100050607      * Punzalan   *          *                                        *
016200050607      ******************************************************************
016300050607      * Ewa K.     *2005/04/01* RFS25997 recompile source.             *
016400050607      ******************************************************************
016500050607      * L. Wong    * 2005/04/21   * RFS 26732 - Recompile - changes to
016600050607      *            *              * OEREDAMT.
016700050607      *****************************************************************
016800050607      * Abdi Hassan*2005/05/29* RFS# 28015 - Move CHECK-OVERRIDE      *
016900050607      *            *          * routine after business type is found. *
017000050607      *            *          * Then, either delete or keep override  *
017100050607      *            *          * if exist after message type if found. *
017200050607      *****************************************************************
017300050607      * Tony P.    *2005/06/01* RFS# 28043 - recompiled               *
017400050607      *****************************************************************
017500050608      * Tony P.    *2005/06/06* RFS# 28287 - recompiled               *
017600050608      *****************************************************************
017700050329      * Don O.     *  2005/03/29  * RFS 26193 - Fixed a code bug in   *
017800050330      *            *              * the INITIAL-LOGIC rtn.  Added     *
017900050330      *            *              * code to map XML updates from the  *
018000050330      *            *              * master account.                   *
018100050601      *****************************************************************
018200050601      * C.Lentini  *  2005/06/01  * RFS 26193 - Remove special module *
018300050601      *            *              * authorization.  Not required.     *
018400020917      *****************************************************************
018500051117      * Abdi Hassan* 2005/08/08   * RFS29004 - When advisor is not     *
018600051117      *            *              * found reject with "077" Invalid    *
018700051117      *            *              * Dealer.                            *
018800051117      *****************************************************************
018900051117      * Tony P.    * 2005/10/03   * RFS# 29891 - recompile            *
019000051117      *****************************************************************
019100051117      * Bojana J.  * 2005/09/14   * RFS 28121 - Recompile; file change *
019200051117      *****************************************************************
019300051117      * Reece Tam  * 2005/09/14   * RFS 29378-Recompile; OETRNSWTR chg*
019400051117      ******************************************************************
019500051117      * Fatima Y   * 2005/10/26   * RFS 27570-Recompile; ADDRSCRUB1chg*
019600051117      ******************************************************************
019700051117      * Pubudu Jay *2005/11/17    * RFS 27046 - Recompile only.       *
019800060302      ******************************************************************
019900060302      * Marek T    * 2005/11/18   * RFS30985-Recompile; Req. CESG chg.*
020000060302      ******************************************************************
020100060302      * Reece Tam  * 2005/12/22   * RFS 31187-Add valid version 17.   *
020200060302      *****************************************************************
020300060302      * Frank Hong * 2006/01/06   * RFS29179 - Recompile,OEBANKEFT chg*
020400060302      *****************************************************************
020500060302      * Shu Yin    * 2006/01/10   * RFS 25177-Recompile; OECOMRBT  chg*
020600060302      *****************************************************************
020700060302      * Abdi Hassan* 2006/01/13   * RFS 29313-Recompile; OEREDAMT  chg*
020800060302      *****************************************************************
020900060302      * Frank Hong * 2006/01/17   * RFS29614.
021000060302      *            *              * Call new procedure NFUDERCHG from
021100060302      *            *              * this program. NFUDERCHG is created
021200060302      *            *              * to process ModBulkRep.
021300060302      *****************************************************************
021400060302      * Abdi Hassan* 2006/01/18 * RFS 30622 - Display Advisor          *
021500060302      *            *            * Message Id on DERNON screen.         *
021600060302      *****************************************************************
021700060302      * Tony Valeri*2006/01/16    * RFS 32174 -Recompile; ESGACCCRT chg
021800060302      *****************************************************************
021900060302      * Kahkashan P*2006/01/31    * RFS 31053 -Recompile; OEACCTINF chg
022000060302      ******************************************************************
022100060511      * Fatema Haji*2006/03/01    * RFS 30796 -Recompile - ESGPREPDTL
022200060511      *            *              * changed
022300060511      ******************************************************************
022400060302      * C.Lentini  *2006/03/02    * RFS 29617 -Recompile only
022500060302      ******************************************************************
022600060306      * Fatima Y   *2006/03/06    * RFS 30666 -Recompile only
022700060316      ******************************************************************
022800060316      * Fatima Y   *2006/03/16    * RFS 33276 -Recompile only
022900060328      ******************************************************************
023000060328      * Frank Hong *2006/03/28    * RFS 29616 -Recompile only
023100060306      ******************************************************************
023200060331      * A. Hassan  *2006/03/31* RFS31180 - Recompile 4 defect 3
023300060412      *****************************************************************
023400060412      * Lorne B    *2006/03/26    * RFS 33685-Alter OPEN of MSG-OUT
023500060412      *                           * to avoid contention.
023600060412      *****************************************************************
023700060412      * Truong L.  * 2006/04/03   * RFS31282 - Recompile.             *
023800060413      ******************************************************************
023900060511      * Esin A.    * 2006/04/28   * RFS33664 - Recompile only.        *
024000060511      ******************************************************************
024100060428      * Daisy Ly   * 2006/04/24   * RFS28557 - Recompile.             *
024200060428      ******************************************************************
024300060511      * Ewa K.     * 2006/05/02   * RFS33495 - Recompile.             *
024400060511      ******************************************************************
024500060517      * A.Hassan   * 2006/05/17   * RFS30807 - Recompile.             *
024600060517      ******************************************************************
024700060517      * C.Lentini  * 2006/05/17   * RFS33781 - Recompile.             *
024800060517      ******************************************************************
024900060606      * A.Hassan   * 2006/05/25   * RFS34888 - Recompile.             *
025000060606      *****************************************************************
025100060413      * Waldi R.   *2006/03/14    * RFS 29080 -Recompile only
025200060331      ******************************************************************
025300060428      * Bojana J.  * 2006/03/28   * RFS 32201 - Recompile for GETCTLNUM*
025400060428      *            *              * module change.                    *
025500060428      ******************************************************************
025600060428      * Esin  A.   *2006/03/23    * RFS 31514 -Recompile only
025700060428      ******************************************************************
025800060418      * L. Wong    * 2006/04/07   * RFS30190 - Recompile for MFATRNREP
025900060418      *****************************************************************
026000060511      * Lorne B.   * 2006/05/12   * RFS32417-Recompile;MFAACCESP expand
026100060511      *****************************************************************
026200060502      * L. Wong    * 2006/05/02   * RFS32616 - Recompile
026300060612      ******************************************************************
026400060612      * A.Hassan   * 2006/05/26   * RFS30796 - Recompile.             *
026500060612      ******************************************************************
026600060612      * C.Lentini  * 2006/06/08   * RFS31062 - Recompile.             *
026700060612      ******************************************************************
026800060612      * Ewa K.     * 2006/06/08   * RFS35046 - Recompile.             *
026900060626      ******************************************************************
027000060626      * Abdi Hassan* 2006/06/16   * RFS35151 - Recompile.             *
027100060626      ******************************************************************
027200060626      * Abdi Hassan* 2006/06/23   * RFS35333 - Recompile.             *
027300060811      *****************************************************************
027400060811      * P. Anielski* 2006/08/02   * RFS35555 - Recompile
027500060811      *****************************************************************
027600060811      * Ewa K.     * 2006/08/02   * RFS36007 - Recompile.             *
027700060626      ******************************************************************
027800060626      * Ade A.     * 2006/06/23   * RFS30538 - Recompile.             *
027900060628      ******************************************************************
028000060628      ******************************************************************
028100060628      * Angela N.  * 2006/06/28   * RFS32615 - Recompile.             *
028200060626      *****************************************************************
028300060801      * Ewa K.     * 2006/08/01   * RFS33392 - Recompile.             *
028400060801      *****************************************************************
028500060831      * Frank Hong * 2006/06/26   * RFS32873 - Recompile.             *
028600061025      *****************************************************************
028700061025      * Bharti   M * 2006/09/05   * RFS33876 - Recompile.             *
028800061025      *****************************************************************
028900070116      * Raymond Mui* 2006/09/29   * RFS34934 - Recompile.             *
029000061010      * Abdi Hassan* 2006/10/10   * RFS37253 - Recompile.             *
029100061106      *****************************************************************
029200061106      * K.Parveen  * 2006/11/06   * RFS37770 - Recompile.             *
029300070112      *****************************************************************
029400070112      * Andy Lo    * 2006/11/14   * RFS38265 - Change compile option
029500070112      *                           * with COMMIT(*CHG).
029600060831      *****************************************************************
029700070102      * Angela N.  * 2006/11/30   * RFS35193 - Recompile.             *
029800070102      *****************************************************************
029900070116      * Richard S  * 2006/11/16   * RFS34577 - Recompile.             *
030000070116      *****************************************************************
030100070116      * Waldi R.   * 2006/12/18   * RFS35959 - Recompile.             *
030200070116      *****************************************************************
030300070116      * Waldi R.   * 2006/12/18   * RFS35960 - Recompile.             *
030400070206      * Abdi Hassan* 2007/01/15   * RFS32789 - Recompile.             *
030500070208      * Halle S    * 2007/02/11   * RFS36212 - Recompile. Retrofit    *
030600070220      ******************************************************************
030700070220      * Pawel A.   * 2007/02/20   * RFS 38717-Add valid version 18.   *
030800070315      ******************************************************************
030900070315      * Waldi R.   * 2007/03/15   * RFS 38247 - Add a call to new     *
031000070315      *            *              *             Investor Split module.*
031100070116      *****************************************************************
031200070529      * Raymond Mui* 2007/05/29   * RFS38394 - Recompile.             *
031300070529      *****************************************************************
031400070627      * C.Lentini  * 2007/06/27   * RFS40090 - Set pc_Called_From     *
031500070627      *            *              * to FSRVNFU instead of ESGPARSER.  *
031600070704      *            *              * - Add new Investor No. parameter  *
031700070704      *            *              * to FXIVRSPLT module. New parm is  *
031800070704      *            *              * required by the IVRSPLIT screen.  *
031900070814      *****************************************************************
032000070814      * Lorne B    * 2007/06/25   * RFS 42682 - eGL Extract; Recompile
032100071001      * Abdi H.    * 2007/10/01   * RFS44177 - recompile
032200071126      * Raymond Mui* 2007/11/26   * RFS45845 - Recompile.             *
032300080220      * Marek T    * 2008/01/14   * RFS45287 - Recompile.             *
032400080220      * Andy Lo    * 2008/01/22   * RFS44973 - Recompile.             *
032500080124      * Raymond Mui* 2008/01/24   * RFS47312 - Recompile.             *
032600080320      * Marek T    * 2008/03/20   * RFS49848 - Recompile.             *
032700080430      * Shu Yin    * 2008/04/30   * RFS51392 - Recompile for MFAACPCGP
032800080721      * Sanjeev P  * 2008/07/21   * RFS50474 - Recompile.             *
032900080908      * Sanjeev P  * 2008/09/08   * RFS56645 - Recompile.             *
033000080919      * Andy Chan  * 2008/07/30   * RFS45133 - Recompile.             *
033100081103      * Andy Chan  * 2008/11/03   * RFS57375 - Recompile.             *
033200090126      * Andy Chan  * 2009/01/26   * RFS63755 - Recompile              *
033300090205      * Abdi H.    * 2009/02/05   * RFS60353 - Change schema version
033400090205      *            *              * to 19
033500090306      * L MARTIN   * 2009/02/05   * RFS64042 - RECOMPILE FOR ESG19
033600090325      * C.Lentini  * 2009/03/25   * RFS60351 - Initialize index.
033700090331      * Abdi H.    * 2009/03/31 * RFS60351 - esg19 - increase
033800090331      *            * 2009/03/31 * COMM-BUSINESS-PROCESS-2 to 5000
033900090507      * Tony Valeri* 2009/04/23   * RFS65597 - Recompile              *
034000090608      * Emma. Yala * 2009/06/08   * RFS 58589 - Recompile only        *
034100090626      * Bathuu L   * 2009/06/16 * RFS59853 - Recompile for MFATRNMSCP.*
034200090908      * Bathuu L   * 2009/07/03 * RFS69179 - Recompile only.          *
034300090917      * Kevin Shen * 2009/09/17 * RFS54431 - Check RDSP special module
034400090917      *            *            * authorization
034500091229      * Esin A.    * 2009/12/23 * RFS64263 - Recompile only.          *
034600100412      * Esin A.    * 2010/03/26 * RFS81279 - Recompile only.          *
034700100213      * M. Anwar   * 2010/02/13 * RFS72399 Add valid Version 20       *
034800100222      * C. Lentini * 2010/02/22 * RFS72399 ESG20 - New CUSIP logic.   *
034900100513      * Esin A.    * 2010/04/26 * RFS68035 - Recompile only.          *
035000100823      * Esin A.    * 2010/10/29 * RFS81399 - Recompile only.          *
035100100819      * Abdi Hassan* 2010/08/18 * RFS86137 - Fix Cusip Joint issue.
035200100819      *            *            * Only one joint owner is written.
035300100916      * Emma. Yala * 2010/09/16 * RFS85040 - Recompile only           *
035400101215      * Pawel A.   * 2010/11/22 * RFS85040 - Recompile and change     *
035500101122      *            *            *            implicit join            *
035600110411      * Santanu D  * 2011/03/29 * RFS92487 - NFU update handling.     *
035700110411      *            *            * Disallow for specific dealer reps   *
035800110411      *            *            * to update only AddModRep NFU        *
035900110411      *            *            * transaction.                        *
036000110421      * a Decepida * 2011/04/21 * RFS84184 - ESG 21                   *
036100110520      * a Decepida * 2011/05/20 * RFS92487.1 - Literal change from    *
036200110520      *            *            * "NONFU" to "NOAMR"                  *
036300110623      * Thilaga. K * 2011/06/23 * RFS92465 - Recompile for MFAACCASP  *
036400110817      * Manohar J. * 2011/08/17 * RFS92917 - Changes to EXTQESI module*
036500110817      *            *            * authorization
036600110907      * Daniel M   *            * Remove indentation limitation
036700111024      * Daniel M   * 2011/10/12 * RFS92917.20 Expand COMM-BUSINESS-PROCESS-2
036800120220      * K Naveen   * 2012/02/22 * RFS97573 - UTAS ESG 22 To Add 22 and*
036900120220      *            *            *            remove 17, 18, 19.       *
037000120723      * TVN Deepthi* 2012/07/23 * RFS98805 - Recompile                *
037100120910      * Vinsfy J   * 2012/09/10 * RFS91272 - Recompile                *
037200130103      * Ambikapathy* 2012/10/24 * RFS118161   RECOMPILE               *
037300130109      * Ambikapathy* 2013/01/09 * RFS105992 - RECOMPILE for CPXMLTAG15
037400130122      * Poornima V * 2013/01/09 * RFS118185 - Recompile               *
037500130211      * Suresh G.  * 2013/02/03 * RFS118744 - Recompile for MFAINVPTP *
037600130527      * Suresh G.  * 2013/02/15 * RFS113777 - Recompile.              *
037700130221      * Ganbold L  * 2013/02/21 * RFS119993 - Recompile MFATRNMSCP    *
037800130227      * Pradeep R  * 2013/02/01 * RFS 114676 - Added ESG23 with NFU   *
037900130227      *            *            * process a new message that will set *
038000130227      *            *            * up shell accounts.                  *
038100130610      * Sherene N. * 2013/05/14 * RFS121657 - recompile for MFAFINSCP *
038200130610      *            *            *           - and MFACOMRPP           *
038300130607      * Ewa K      * 2013/06/07 * RFS 123278 - Update CUSIP reponse   *
038400130607      *            *            * at cusip#/dealer level.             *
038500130718      * Sushmita J *  2013/07/17* RFS125792 - Recompile for MFANFUP.  *
038600130730      * Uday K A   * 2013/07/26 * RFS125878 - Recompile for CPYOE15CS *
038700130916      * Sairam     * 2013/09/13 * RFS127038 - Recompile.              *
038800131011      * Abhisek M  * 2013/09/11 * RFS121109 - AddModFatca business    *
038900131011      *            *            * process changes                     *
039000131121      * Thilaga K  * 2013/08/28 * RFS127129- Recompile                *
039100140417      * Thilaga K   * 2014/01/21 * RFS133150 - Recompile for MFATRCODP
039200140417      * Boopathy D * 2014/02/26 * RFS132733- Recompile                *
039300140307      * Manjusha V * 2014/03/06   * RFS131418-Fetch the Version Number
039400140530      * Sairam DC  * 2014/03/17 * RFS134768 - Recompile for MFADMATLGP*
039500140307      *            *              * from MFAESGPARM.
039600140430      * Thilaga K  * 2014/04/16   * RFS134936 - Recompile for MFAACCNNP
039700140507      *            *              *                           MFATRNREP
039800140508      * Sushmita J * 2014/04/01   * RFS134626 - Recompile for MFAACMDP.
039900140509      * Tamilselvi * 2014/05/09   * RFS136015- Recompile for MFAACMDP.
040000140602      * Sairam DC  * 2014/03/17   *RFS134768 - Recompile for MFADMATLGP*
040100140620      * Vinsfy J   * 2014/06/20   * RFS136634 -Recompile for MFAACCATP*
040200140623      * Sushmita J * 2014/05/09   * RFS136702 - Recompile for MFAADTNP*
040300140624      * Vinsfy J   * 2014/06/24   * RFS137829- Recompile for MFAACCONIP
040400140826      * Nagamnai S * 2014/08/13   * RFS139007 - Recompile for CPGLWBRULE
040500141105      * Manjusha V * 2014/11/05   * RFS142052- Recompile for MFAORDACCP.
040600150106      * Sangeetha V* 2014/12/29   * RFS143909 - Recompile for MFAPRGTHP
040700150317      * Gomathi S  * 2015/03/17   * RFS145882- Recompile for MFAORDC15P.
040800150416      * K Naveen   * 2015/04/17   * RFS146251- Recompile for MFAESGPARM.
040900150818      * Thilaga K  * 2015/05/12   * RFS145136 - Recompile for MFAACCCSP
041000150512      *Muthulakshmi* 2015/04/06 * RFS145157 - Recompile MFAACBHRP
041100151102      * Prashant Y * 2015/09/30 * RFS151276 - Recompile MFAIVRFCP,
041200151102      *            *            *             MFAIVRMDP
041300160111      * K Naveen.  * 2016/01/11   * RFS153523- Recompile for CPYESBRECS
041400160111      *            *              *            and CPYESBFATC.
041500160128      * V Lakshmi  *2016/01/28    *RFS151549-recompile for CPYESGERR
041600160128      *            *              * CPYOE15 ,CPXMLTAG15
041700160129      * K Naveen.  * 2016/02/02   * RFS151548-ESG26 Extract ACB value.
041800160208      * K Naveen.  * 2016/02/08   * RFS151550- AddAwd and TerPAC & AWD.
041900160317      * Emmanuel Y * 2016/03/18   * RFS151549- Expanded sizes related
042000160317      *            *              * to CommBusProc and CommBusProc2
042100160405      * V.L.Prasanna* 2016/04/05 * RFS155708-Recompile for MFACSIPRLP,
042200160512      *V L Prasanna*2016/05/12 * RFS158785- recompile for MFAOELC15P,
042300160512      *            *           *    MFAORDC15P,WRKOEUTXP
042400160405      *                                           MFACSIPRLA
042500160614      *  -------------------------------------------------------------
042600160614      * Abdi Hassan  * 2016-06-09 * Rfs160643 - Restrict client name
042700160614      *              *            * for all Income type accounts.
042800160705      * K Naveen     * 2016-06-23 * RFS160405-Added Acct Desg validation.
042900160614      *              *            *
043000160902      *V L Prasanna *2016/09/02 * RFS162576- recompile for MFAORDACCP,
043100160902      *             *           * MFAORLACCP
043200160907      * Sushmita J   * 2016/09/07 * RFS162922 - Recompile for MFAINVACP.
043300160614      *              *            *
043400160614      *              *            *
043500160614      *              *            *
043600170302      * Divya  V     * 2017/03/01 * RFS166545 - Recompile for MFATRTXRP
043700170328      * Lavanya V    * 2017/03/10 * RFS164272 - ESG 27 Changes
043800170327      * Ewa K.       * 2017/03/21 * RFS168893 -Recompile for MFAORDD15P*
043900170327      *              *            * MFAOELD15P,MFAORDACCP,MFAORLACCP   *
044000170329      * K Naveen     * 2017-03-27 * RFS169193 - Updated MFANFULGP file
044100170329      *              *            * When Audit-date and time is ZERO.
044200170818      * Suresh G.    * 2017/07/21 * RFS171752 - Recompile of MFABNKACP
044300180208      * Gomathi S    * 2018/02/08 * RFS174736 - ESG28 Fee rate process
044400180514      * B Vergara   * 2018/05/14* RFS1002691 - Recompile for MFAOELICTP.
044500180612      *Janapriya J * 2018/05/25   * RFS179223 - Recompile for MFAIVRHDP*
044600181016      * Sethu B    * 2018/08/16   * RFS180381 - Recompile for MFAIVRHDP*
044700181227      * Sachin Soman* 2018/11/23 * RFS180293 - Recompile for MFACOMRPP*
044800181212      * Lavanya V  * 2019/12/12   * RFS179108 - Recompile for MFAJACTP *
044900190213      * Lavanya V  * 2019/02/13   * RFS181062 - ESG29 Changes          *
045000190226      * Kavya K    * 2019/02/26   * RFS181057 - Recompile for MFAORDA15P*
045100190603      * Kavya K    * 2019/06/03   * RFS182833 - Recompile for MFAORDACCP*
045200190603      *            *              *          and MFAORLACCP             *
045300190708      * Lavanya V  * 2019/07/08   * RFS182833 Recompile only            *
045400191124      * Priya N    * 2019/11/15   * RFS185037 - Recompile of MFABNKACP  *
045500200203      * Kavya K    * 2020/01/31   * RFS181057 - Recompile for ESGv30    *
045600200420      * Mayilsamy D* 2020/04/20   * RFS185774 - Recompile for MFAIVRHDP *
045700200722      * Mayilsamy D* 2020/07/04   * RFS186092 - Recompile               *
045800200722      * Vignesh    * 2020/06/24   * RFS183812 - Recompile of MFAFINSCP  *
045900200722      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP *
046000200721      * Kavya K    * 2020/07/17   * RFS1101025- Investor Split          *
046100200721      *            *              * Functionality incorrectly triggered *
046200200721      *            *              * via NFU Ben Address Change          *
046300200812      * Rajesh R   * 2020/08/12   * RFS185178 - Recompile for MFAFEECDP,*
046400200812      *            *              * MFASEGIRLP, MFAFEESCLP              *
046500201008      * Lavanya V  * 2020/09/08 * RFS186077 - Reject NFU AddModAddress  *
046600201008      *            *            * only when a/c is terminated           *
046700201203      * Ewa K.     * 2020/11/13 * RFS185174 Recompile for CPWSYSPARM.   *
046800201109      * Lavanya V  * 2020/11/09 * RFS186497 - Added error code 600      *
046900201222      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
047000210112      * Aarthi M   * 2021/01/12   * RFS185897 - Recompile for MFACOMRPP.*
047100210128      * Lavanya V  * 2020/01.29   * RFS186088 - ESGv31 changes          *
047200210301      * Rajesh R   * 2021/02/05   * RFS187018 - Recompile for MFAIVRHDP *
047300210408      * Ashwini B  * 2021/04/08   * RFS187046 - Recompile for MFATRNREP,
047400210408      *            *              * MFAFEECDP                           *
047500210408      * Vignesh    * 2021/02/17   * RFS185894 -Recompile for MFASEGIRLP*
047600210409      * Gomathi S  *  2021/01/07 * RFS1101968- Recompile               *
047700210609      * Mayilsamy  * 2021/06/09   * RFS187292 -DMC RFS187160 Recompile
047800210706      * Bagathsingh* 2021/05/13   * RFS180927 -Recompile for MFAACCAARP*
047900210707      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
048000210805      * Poojasri M * 2021/08/05   * RFS187659 - Recompile for MFAROLP
048100210828      *Mayilsamy D * 2021/08/28   * RFS187441 - Recompile for MFAMRSCHP
048200210927      * Rajesh R   * 2021/09/17   * RFS187775 - Recompile for MFAIVRHDP
048300200722      *******************************************************************
048400060302      /
048500210805       ENVIRONMENT DIVISION.
048600070315       CONFIGURATION SECTION.
048700000000       SOURCE-COMPUTER. IBM-AS400.
048800000000       OBJECT-COMPUTER. IBM-AS400.
048900030211       SPECIAL-NAMES.
049000030408            LINKAGE TYPE IS PROCEDURE FOR "ESGLOOKUP"
049100040518            LINKAGE TYPE IS PROCEDURE FOR "ESGPCLTINF"
049200040518            LINKAGE TYPE IS PROCEDURE FOR "ESGPADDINF"
049300030211            LINKAGE TYPE IS PROCEDURE FOR "ESGPACCATT"
049400030211            LINKAGE TYPE IS PROCEDURE FOR "ESGPDISINF"
049500030211            LINKAGE TYPE IS PROCEDURE FOR "ESGPBENINF"
049600050607R26004      LINKAGE TYPE IS PROCEDURE FOR "ESGPREPDTL"
049700050607R26004      LINKAGE TYPE IS PROCEDURE FOR "ESGPINAREP"
049800050607R26599      LINKAGE TYPE IS PROCEDURE FOR "FXOVRFIL"
049900030227            LINKAGE TYPE IS PROCEDURE FOR "ESGXMLERR"
050000040429            LINKAGE TYPE IS PROCEDURE FOR "ESGPADDPAC"
050100040511            LINKAGE TYPE IS PROCEDURE FOR "ESGPACCSET"
050200040511            LINKAGE TYPE IS PROCEDURE FOR "FXSCEDTALW"
050300210204186088      LINKAGE TYPE IS PROCEDURE FOR "ESGADDCDIC"
050400050607            LINKAGE TYPE IS PROCEDURE FOR "XXMPFND"
050500060302R26171      LINKAGE TYPE IS PROCEDURE FOR "FXXMLENT"
05060006030229614       LINKAGE TYPE IS PROCEDURE FOR "NFUDERCHG"
050700070315R38247      LINKAGE TYPE IS PROCEDURE FOR "FXIVRSPLT"
050800100301R72399      LINKAGE TYPE IS PROCEDURE FOR "ESGPCUSIP"
050900110306R84184      LINKAGE TYPE IS PROCEDURE FOR "ESGTFSASUC"
051000131011121109      LINKAGE TYPE IS PROCEDURE FOR "ESGUPFATCA"
051100170413164272      LINKAGE TYPE IS PROCEDURE FOR "ESGFATCRSP"
051200160220151550      LINKAGE TYPE IS PROCEDURE FOR "ESGADDAWD"
051300160219151550      LINKAGE TYPE IS PROCEDURE FOR "TERAWDPAC"
051400180208174736      LINKAGE TYPE IS PROCEDURE FOR "ESGADDFEE"
051500201109186497      LINKAGE TYPE IS PROCEDURE FOR "ESGFATCRSV"
051600140307131418      DATA-AREA  IS WS-DATA-MFAESGPARM
051700100310R26599      DATA-AREA IS WS-DATA-AREA.
051800000000
051900000000       INPUT-OUTPUT SECTION.
052000000000      *****************************************************************
052100000000      *    I N P U T   /   O U T P U T   S E C T I O N                *
052200000000      *****************************************************************
052300000000       FILE-CONTROL.
052400000000      *****
052500000000      *****    File Control.
052600000000      *****
052700020110           SELECT  MSG-IN
052800010927                   ASSIGN TO DATABASE-MFAESGXMIP.
052900020110           SELECT  MSG-OUT
053000010927                   ASSIGN TO DATABASE-MFAESGXMOP.
053100000000           SELECT  NFU-LOG-IN
053200000000                   ASSIGN TO DATABASE-MFAMSGLGIP.
053300000000           SELECT  NFU-LOG-OUT
053400000000                   ASSIGN TO DATABASE-MFAMSGLGOP.
053500040511
053600040511           SELECT  NFU-ESG-LOG
053700040511                   ASSIGN TO DATABASE-MFANFULGP
053800040511                   ORGANIZATION IS SEQUENTIAL
053900040511                   ACCESS IS SEQUENTIAL
054000040511                   FILE STATUS IS WS-FILE-STATUS.
054100040511
054200051117R29004     SELECT  DEALER
054300051117  ¦                ASSIGN TO DATABASE-MFADEAP
054400051117  ¦                ORGANIZATION IS INDEXED
054500051117  ¦                ACCESS IS RANDOM
054600051117  ¦                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
054700051117  ¦                FILE STATUS IS WS-FILE-STATUS.
054800051117R29004
054900100301      *** R72399 - Begin
055000100303           SELECT Order-Entry-Detail
055100100301                  ASSIGN TO DATABASE-MFAORDE15P
055200100301                  ACCESS       IS SEQUENTIAL
055300100301                  FILE STATUS  IS WS-FILE-STATUS.
055400100301
055500100303           SELECT Order-Entry-Account
055600100301                  ASSIGN TO DATABASE-MFAORDA15P
055700100301                  ACCESS       IS SEQUENTIAL
055800100301                  FILE STATUS  IS WS-FILE-STATUS.
055900100301
056000100303           SELECT Order-Entry-Demographics
056100100301                  ASSIGN TO DATABASE-MFAORDD15P
056200100301                  ACCESS       IS SEQUENTIAL
056300100301                  FILE STATUS  IS WS-FILE-STATUS.
056400100305
056500100305           SELECT Cusip-Message-Details
056600160204151548*           ASSIGN TO DATABASE-MFACUSIP
056700160204151548            ASSIGN TO DATABASE-WRKCUSIP
056800100305                  ACCESS       IS SEQUENTIAL
056900100305                  FILE STATUS  IS WS-FILE-STATUS.
057000100307
057100100307      ******  Used to Read only
057200100307           SELECT Cusip-Message-Details-Input
057300130607      *RFS123278 starts
057400130607      *           ASSIGN TO DATABASE-MFACUSIP
057500130607      *           ACCESS       IS SEQUENTIAL
057600160205151548*           ASSIGN TO DATABASE-MFACUSILB
057700160205151548            ASSIGN TO DATABASE-WRKCUSILB
057800130607                  ORGANIZATION IS INDEXED
057900130607                  ACCESS       IS DYNAMIC
058000130607                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
058100130607                  WITH DUPLICATES
058200130607      *RFS123278 ends
058300100307                  FILE STATUS  IS WS-FILE-STATUS.
058400100307
058500100307           SELECT Order-Entry-Detail-Input
058600100307                  ASSIGN TO DATABASE-MFAORDE15D
058700100307                  ORGANIZATION IS INDEXED
058800100307                  ACCESS       IS RANDOM
058900100307                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
059000100307                  WITH DUPLICATES
059100100307                  FILE STATUS  IS Ws-File-Status.
059200100301      *** R72399 - End
059300000000      /
059400000000       DATA DIVISION.
059500000000      *****************************************************************
059600000000      *    D A T A   D I V I S I O N                                  *
059700000000      *****************************************************************
059800000000       FILE SECTION.
059900000000
060000110520       FD  MSG-IN.
060100020110       01  MSG-IN-REC.   COPY DD-ALL-FORMATS OF MFAESGXMIP.
060200000000      /
060300110520       FD  MSG-OUT.
060400020110       01  MSG-OUT-REC.  COPY DD-ALL-FORMATS OF MFAESGXMOP.
060500000000      /
060600110520       FD  NFU-LOG-IN.
060700010925       01  NFU-LOG-IN-REC.   COPY DD-ALL-FORMATS OF MFAMSGLGIP.
060800000000      /
060900110520       FD  NFU-LOG-OUT.
061000010925       01  NFU-LOG-OUT-REC.  COPY DD-ALL-FORMATS OF MFAMSGLGOP.
061100000000      /
061200110520       FD  NFU-ESG-LOG.
061300040511       01  NFU-ESG-LOG-REC. COPY DD-ALL-FORMATS OF MFANFULGP.
061400040511      /
061500110520R29004 FD  DEALER.
061600051117  ¦    01  DEALER-REC.      COPY DD-ALL-FORMATS OF MFADEAP.
061700051117R29004/
061800100301      *** R72399 - Begin
061900110520       FD  Order-Entry-Detail.
062000100301       01  Order-Entry-Dtl-Rec. COPY DD-ALL-FORMATS OF MFAORDE15P.
062100100301      /
062200110520       FD  Order-Entry-Account.
062300100301       01  Order-Entry-Account-Rec. COPY DD-ALL-FORMATS OF MFAORDA15P.
062400100301      /
062500110520       FD  Order-Entry-Demographics.
062600100301       01  Order-Entry-Demo-Rec. COPY DD-ALL-FORMATS OF MFAORDD15P.
062700100301      /
062800110520       FD  Cusip-Message-Details.
062900160204151548*01  Cusip-Message-Dtls-Rec. COPY DD-ALL-FORMATS OF MFACUSIP.
063000160204151548 01  Cusip-Message-Dtls-Rec. COPY DD-ALL-FORMATS OF WRKCUSIP.
063100100305      /
063200110520       FD  Cusip-Message-Details-Input.
063300130607123278*01  Cusip-Message-Input-Rec. COPY DD-ALL-FORMATS OF MFACUSIP.
063400160205      * RFS 151548 - Start
063500160205123278*01  Cusip-Message-Input-Rec. COPY DD-ALL-FORMATS OF MFACUSILB.
063600160205151548 01  Cusip-Message-Input-Rec. COPY DD-ALL-FORMATS OF WRKCUSILB.
063700160205      * RFS 151548 - End
063800100307      /
063900110520       FD  Order-Entry-Detail-Input.
064000100307       01  Order-Entry-Input-Rec. COPY DD-ALL-FORMATS OF MFAORDE15D.
064100100307      /
064200100301      *** R72399 - End
064300000000       WORKING-STORAGE SECTION.
064400000000      *****************************************************************
064500000000      *    W O R K I N G   S T O R A G E   S E C T I O N              *
064600000000      *****************************************************************
064700040511      *******************************
064800040511      *** CopyBooks - Work Fields ***
064900040511      *******************************
065000040427       COPY CPXMLTAG15.
065100040427       COPY CPYESGERR.
065200040427       COPY CPYOE15.
065300040427       COPY CPYOERESWS.
065400040501       COPY CPYOE15FLD.
065500110411R72399 COPY CPWSYSPARM.
065600110411R92487 COPY CPYSQLFLD
065700110411R92487      REPLACING    "CURRENT_PROGRAM"  BY "ESGPARSER".
065800040511      ************************************
065900040511      *** Record Structures - External ***
066000040511      ************************************
066100040511       01 ACCOUNT-REC EXTERNAL. COPY DD-ALL-FORMATS OF MFAACCNTP.
066200040511       01 INVESTOR-REC EXTERNAL. COPY DD-ALL-FORMATS OF MFAIVRP.
066300040511
066400100305      ************************************
066500100305      *** Record Structures            ***
066600100305      ************************************
066700160204      * RFS 151548 - Start
066800160204R72399*01 Cusip-Msg-Dtls-Rec. COPY DD-ALL-FORMATS OF MFACUSIP.
066900160204       01 Cusip-Msg-Dtls-Rec. COPY DD-ALL-FORMATS OF WRKCUSIP.
067000160204      * RFS 151548 - End
067100100305
067200040511      ************************************
067300040511      *** Work Fields - External       ***
067400040511      ************************************
067500160317151549*01 COMM-BUSINESS-PROCESS   PIC X(5000)  EXTERNAL.
067600160317151549 01 COMM-BUSINESS-PROCESS   PIC X(32766) EXTERNAL.
067700111024      *   RFS92917.20 - Begins - Expand size
067800111012r60351*01 COMM-BUSINESS-PROCESS-2 PIC X(5000) EXTERNAL.
067900160309151549*01 COMM-BUSINESS-PROCESS-2 PIC X(20000) EXTERNAL.
068000160309151549 01 COMM-BUSINESS-PROCESS-2 PIC X(32000) EXTERNAL.
068100111024      *   RFS92917.20 - Ends
068200040501       01 COMM-MSG-DTL            PIC X(100)   EXTERNAL.
068300050607R26004 01 ADVISOR-DEALER-CODE     PIC X(4)     EXTERNAL.
068400050607R26004 01 ADVISOR-DEALER-REP-CODE PIC X(5)     EXTERNAL.
068500050607R26004 01 ADVISOR-BRANCH-CODE     PIC X(5)     EXTERNAL.
068600040501
068700050607R26171 01 WS-FXXMLENT-PARMS.
068800111024      *   RFS92917.20 - Begins - Expand Size
068900111024      *   03 WS-STRING-BEFORE        PIC X(5000).
069000111024      *   03 WS-STRING-AFTER         PIC X(5000).
069100111024          03 WS-STRING-BEFORE        PIC X(20000).
069200111024          03 WS-STRING-AFTER         PIC X(20000).
069300111024      *   RFS92917.20 - Ends
069400050607
069500010924       01 WS-FILE-STATUS         PIC X(2).
069600010924       01 WS-END-OF-FILE         PIC 1 VALUE B"0".
069700010926          88 AT-END-OF-FILE            VALUE B"1".
069800000000
069900050607R26599***** Begin
070000050607       01 WS-OVRRIDES-TEMP-FIELDS.
070100050607          03  WS-OVR-DONE                   PIC X.
070200050607              88  OVERRIDE-ALREADY          VALUE "Y".
070300050607              88  OVERRIDE-NOT-DONE         VALUE "N".
070400050607          03  WS-OVR-REQUIRED               PIC X.
070500050607              88  OVERRIDE-REQUIRED         VALUE "Y".
070600050607              88  OVERRIDE-NOT-REQUIRED     VALUE "N".
070700050607          03  WS-GBL-LIB                    PIC X(10).
070800050607          03  WS-ACTION                     PIC X(5).
070900050607          03  WS-OVR                        PIC X(5) VALUE "OVR".
071000050607          03  WS-RMV                        PIC X(5) VALUE "RMV".
071100050607R26599***** End
071200050607
071300000000      ***** Temp Fields
071400000000      *****
071500010924       01 TEMP-FIELD.
071600040501          03 WS-XML-AUTHORIZATION-CODE PIC X(06).
071700040501          03 WS-XML-ALLOWED            PIC X(01).
071800040511          03 WS-EXTERNAL-NOMINEE-CODE  PIC X(05).
071900040501          03 WS-BUSINESS-PROCESS-MODE  PIC X(40).
072000040501          03 WS-DEALER-CODE            PIC X(05).
072100040501          03 WS-PROGRAM-CODE           PIC X(08) VALUE "ORDEN2.2".
072200031219
072300040501          03 WS-MESSAGE               PIC X(32766).
072400040501          03 WS-CREATE-MESSAGE        PIC X(32766).
072500010928          03 WS-XML-MSG-HEADER        PIC X(1000).
072600010928          03 WS-XML-HEADER            PIC X(500).
072700010928          03 WS-MSG-HEADER            PIC X(500).
072800010929          03 WS-MSG-HEADER-1          PIC X(500).
072900050607R26004    03 WS-ADVISOR-SECTION       PIC X(500).
073000030407          03 WS-TEMP-FIELD-5000.
073100030407             05 WS-TEMP-FIELD-1-5000     PIC X(5000).
073200030407             05 WS-TEMP-FIELD-2-5000     PIC X(5000).
073300030407             05 WS-TEMP-FIELD-3-5000     PIC X(5000).
073400040501             05 WS-TEMP-FIELD-1-20000    PIC X(20000).
073500040501             05 WS-TEMP-FIELD-2-20000    PIC X(20000).
073600021021          03 WS-OTHER-ID              PIC X(8).
073700040501          03 WS-RESPONSE              PIC X(32766).
073800040904R23543    03 WS-MESSAGEID             PIC X(50).
073900040904R23543    03 WS-SRCID                 PIC X(50).
074000160614160643    03 lc_AccType                PIC X(05).
074100000000
074200091001      *RFS 26193 start
074300091001      * rfs 26193 - CL - Begin
074400091001      *01  WS-MODULE1                  PIC X(10) VALUE "MASTERACCT".
074500091001      *01  WS-MODULE                   PIC X(10) VALUE SPACES.
074600091001      *01  WS-MODULE-AUTH              PIC X(1) VALUE SPACES.
074700091001      * rfs 26193 - CL - End
074800091001
074900091001      *RFS 26193 end
075000091001
075100091001R54431*Begins
075200090917       01  WS-MODULE                   PIC X(10) VALUE SPACES.
075300090917       01  WS-MODULE-AUTH              PIC X(1) VALUE SPACES.
075400091001R54431*Ends
075500050330
075600040429      *****
075700040429      ***** Version Numbers
075800040429      *****
075900120220       01 WS-VERSION               PIC X(4).
076000090205          88 VALID-VERSION            VALUES
076100120220      *RFS97573 - Start
076200110314R72399                                "20  " "  20"
076300120220R84184*                               "21  " "  21".
076400120220R84184                                "21  " "  21"
076500130227      * RFS 114676 - Start
076600130227      *                               "22  " "  22".
076700130227                                      "22  " "  22"
076800130227                                      "23  " "  23".
076900130227      * RFS 114676 - End
077000140307      *RFS131418 Start
077100140307       01 lc_ESGParms.
077200140307          03 lc_Filler1                 PIC  X(166)  VALUE SPACES.
077300140307          03 lc_VersionNo               PIC  X(002)  VALUE SPACES.
077400140307          03 lc_Filler2                 PIC  X(932)  VALUE SPACES.
077500140307      *RFS131418 End
077600120220      *RFS97573 - End.
077700040501       01  WS-ACCOUNT-NO-JRIGHT       PIC X(9) JUSTIFIED RIGHT.
077800040518
077900040518       01  WS-ACCOUNT-FORMAT-1.
078000040518           05 WS-ACCOUNT-NO9             PIC 9(9).
078100040518           05 WS-ACCOUNT-PARTS REDEFINES WS-ACCOUNT-NO9.
078200040518              07 WS-ACCOUNT-NO1          PIC 9(1).
078300040518              07 WS-ACCOUNT-NO8          PIC 9(8).
078400040518           05 WS-ACCOUNT-NO6             PIC X(6).
078500040518
078600040518       01  WS-ACCOUNT-FORMAT-2.
078700040518           05 WS-ACCOUNT-NO8             PIC 9(8).
078800040518           05 WS-ACCOUNT-NO7             PIC X(7).
078900040518
079000160205151548 01  ln_ACBValue                   PIC  S9(16)V9(02).
079100160205
079200000000      ***** Numeric Section.
079300000000      *****
079400000000       01 WORK-NUMERIC-FIELDS.
079500010927          03 WS-REC-LENGTH       PIC S9(5) PACKED-DECIMAL.
079600010927          03 WS-LENGTH-1         PIC S9(5) PACKED-DECIMAL.
079700010927          03 WS-LENGTH-2         PIC S9(5) PACKED-DECIMAL.
079800010927          03 WS-TALLY            PIC S9(5) PACKED-DECIMAL.
079900010927          03 WS-COUNT-1          PIC S9(5) PACKED-DECIMAL.
080000130227          03 WS-COUNT-2          PIC S9(5) PACKED-DECIMAL.
080100130227114676    03 ln_Count3           PIC S9(5) PACKED-DECIMAL.
080200010927          03 WS-MESSAGE-POINTER  PIC S9(5) PACKED-DECIMAL.
080300010927          03 WS-RESPONSE-POINTER PIC S9(5) PACKED-DECIMAL.
080400040501          03 WS-XML-HDR-POINTER  PIC S9(5) PACKED-DECIMAL.
080500040501          03 WS-SIZE-5000        PIC S9(5) PACKED-DECIMAL VALUE 5000.
080600040501          03 WS-SIZE-32766       PIC S9(5) PACKED-DECIMAL VALUE 32766.
080700040428          03 WS-REJ-CNT          PIC S9(2).
080800040428          03 WS-NSP-CNT          PIC S9(2).
080900100303      ** R72399 - Begin
081000100303          03 WS-AMOUNT-VALUE                PIC X(12).
081100160205          03 WS-FIELD-LENGTH                PIC 9(03).
081200100303          03 WS-START-POS                   PIC 9(03).
081300100303          03 WS-ALPHA-TO-NUMERIC.
081400100303             05 WS-ALPHA-NUM                PIC X(12).
081500100303             05 WS-NUMERIC REDEFINES WS-ALPHA-NUM PIC 9(12).
081600100303             05 WS-ALPHA-DEC                PIC X(04).
081700100303             05 WS-DEC REDEFINES WS-ALPHA-DEC PIC V9999.
081800100303          03 WS-NUM     REDEFINES WS-ALPHA-TO-NUMERIC.
081900100303             05 WS-NUMDEC                   PIC 9(12)V9999.
082000100303          03 WS-WHOLE-ALPHA                 PIC X(12).
082100100303          03 WS-WHOLE-NUM REDEFINES
082200100303                        WS-WHOLE-ALPHA      PIC 9(12).
082300100303          03 WS-DEC-ALPHA                   PIC X(04).
082400100303          03 WS-DEC-NUM REDEFINES
082500100303                        WS-DEC-ALPHA        PIC 9(04).
082600100303          03 WS-WHOLE-DEC                   PIC 9(12)V9999.
082700100307      ** R72399 - End
082800160205
082900000000
083000000000      *****
083100000000      ***** Flag Section.
083200000000      *****
083300000000       01 WS-YES-NO-FLAG.
083400110306      *Rfs84184 - Start Add TFSA Successor
083500110306          03 lc-AddSuc-Flag            PIC X.
083600110306             88 Add-TFSA-Successor     VALUE "Y".
083700110306      *Rfs84184 - End
083800000000          03 WS-NAME-FLAG              PIC X.
083900200908186077*** 03 WS-ADDRESS-FLAG           PIC X.
084000050428      *** 03 WS-ACCT-ATTRIB-FLAG       PIC X.
084100040501          03 WS-DISTRIBUTION-FLAG      PIC X.
084200000000          03 WS-BUSINESS-FOUND         PIC X.
084300010926          03 WS-START-MESSAGE-FLAG     PIC X.
084400010926             88 MESSAGE-START-FOUND    VALUE "Y".
084500010926          03 WS-END-MESSAGE-FLAG       PIC X.
084600010926             88 MESSAGE-END-FOUND      VALUE "Y".
084700000000          03 WS-CLERK-FOUND            PIC X.
084800040501          03 WS-BENE-FLAG              PIC X.
084900040501          03 WS-ADDPAC-FLAG            PIC X.
085000040501          03 WS-ACCTSETUP-FLAG         PIC X.
085100050607R26004    03 WS-ADDMODREP-FLAG         PIC X.
085200050607R26004    03 WS-INAREP-FLAG            PIC X.
08530006030229614     03 lc-ModBulkRepFlag         PIC X.
085400100307      *** RFS 72399 - Begin
085500100310          03 lc-CusipProcess           PIC X.
085600100310             88 ncc-CusipProcess       VALUE "Y".
085700100310          03 lc-RspCusipStatus         PIC X.
085800100307          03 lc-EndOfRsp               PIC X(1).
085900100307             88 ncc-EndOfRsp           VALUE "Y".
086000130227114676    03 lc_AddNewAcctFlag         PIC X(1).
086100131011121109    03 WS-FATCA-FLAG             PIC X(1).
086200160209151550    03 lc_AddAwdFlag             PIC X(1).
086300180208174736    03 lc_AddModFee              PIC X(1).
086400160209151550    03 lc_TerAwdPACFlag          PIC X(1).
086500210128186088    03 lc_AddModCDICFlag         PIC X(1).
086600160212151550    03 li_ReqLen                 PIC 9(05) COMP-3.
086700160212151550    03 lc_XMLErrCode             PIC X(02).
086800160212151550      88  lnc_XMLErrCodeOk                 VALUE "00".
086900160212151550      88  lnc_XMLErrCode99                 VALUE "99".
087000160614160643    03 lc_TerAwdFlag             PIC X(1).
087100170329169193    03 lc_AuditDT                PIC S9(8).
087200170329169193    03 lc_AuditTi                PIC S9(6).
087300100310
087400100310       01  lc-RspCusipNo             PIC X(9) VALUE SPACES.
087500130607123278 01  lc-RspDrealerCde          PIC X(04) VALUE SPACES.
087600100307      *** RFS 72399 - End
087700110411      *RFS 92487 Start
087800110411       01 lc-DealerCode              PIC X(04).
087900110411       01 lc-DealerRepCode           PIC X(05).
088000110520      *** RFS92487.1 - Starts
088100110520     **01 lc-NONFU-RowExists         PIC X(01)  VALUE SPACES.
088200110520       01 lc-NOAMR-RowExists         PIC X(01)  VALUE SPACES.
088300110520      *** RFS92487.1 - Ends
088400110411      *RFS 92487 End
088500181127
088600050428      *RFS 26193 start
088700050428       01  WS-ACCT-ATTRIB-FLAG       PIC X EXTERNAL.
088800050428      *RFS 26193 end
088900060302
089000200908      *RFS 186077 start
089100200908       01  WS-ADDRESS-FLAG           PIC X EXTERNAL.
089200200908      *RFS 186077 end
089300200908
08940006030229614  01  Constants.
08950006030229614      03  ncc-Yes                 PIC X(01) VALUE "Y".
089600181126180147     03 lnc_FSDATA               PIC X(10) VALUE "FSDATA".
089700050428
089800031223       01  CURR-CONTROLS         PIC X(1).
089900030404
090000030404        01 WS-SQL-ERROR-FIELDS.
090100030404           05 WS-CALLING-PROGRAM     PIC X(10)   VALUE "ESGPARSER ".
090200030404           05 WS-SQLERR-STATEMENT    PIC X(25)   VALUE " ".
090300030404           05 WS-SQLERR-DATA         PIC X(1780) VALUE " ".
090400030404           05 WS-SQL-STATS           PIC X(1966) VALUE " ".
090500030404           05 WS-SQLERR-REPLY        PIC X(1)    VALUE " ".
090600030404
090700070315      * RFS 38247 - begins.
090800070627R40090 01  lncc_FSRVNFU              PIC  X(08)  VALUE "FSRVNFU".
090900070316       01  lncc_PAR10                PIC  X(05)  VALUE "PAR10".
091000070315       01  lncc_MSG                  PIC  X(03)  VALUE "MSG".
091100070315       01  lncc_CLT                  PIC  X(03)  VALUE "CLT".
091200070315       01  lncc_ADR                  PIC  X(03)  VALUE "ADR".
091300070315       01  lncc_00                   PIC  X(02)  VALUE "00".
091400070315       01  lncc_99                   PIC  X(02)  VALUE "99".
091500070315       01  lncc_Y                    PIC  X(01)  VALUE "Y".
091600110411R92487 01  lncc_PAR20                PIC  X(05)  VALUE "PAR20".
091700110520      *** RFS92487.1 - Starts
091800110520R92487*01  lncc_NONFU                PIC  X(05)  VALUE "NONFU".
091900110520R92487 01  lncc_NOAMR                PIC  X(05)  VALUE "NOAMR".
092000110520      *** RFS92487.1 - Ends
092100100305
092200100305      **** R72399 - Begins
092300100226       01  lc-JNT                    PIC  X(03)  VALUE "JNT".
092400100226       01  lc-BEN                    PIC  X(03)  VALUE "BEN".
092500100226       01  lc-ITF                    PIC  X(03)  VALUE "ITF".
092600100226       01  lc-JAN                    PIC  X(03)  VALUE "JAN".
092700100226       01  lc-Rec                    PIC  X(03)  VALUE SPACES.
092800100307       01  lncc-248                  PIC  X(03)  VALUE "248".
092900100307       01  lncc-000                  PIC  X(03)  VALUE "000".
093000100226      **** R72399 - Ends
093100070315
093200070315       01  pc_Investor_Split_Parms.
093300070315           05  pn_Account_No         PIC S9(09).
093400070703R40090     05  pn_Investor_No        PIC S9(09).
093500070315           05  pc_Called_From        PIC  X(10).
093600070315           05  pc_User_Id            PIC  X(10).
093700070315           05  pc_User_Id2 REDEFINES pc_User_id.
093800070315               10  pc_MSG_Prefix     PIC  X(03).
093900070315               10  pc_MSG_Id         PIC  X(07).
094000070315           05  pc_XML_MSG_Type       PIC  X(03).
094100070315           05  pc_Return_Code        PIC  X(02).
094200070315      * RFS 38247 - ends.
094300090917
094400090917R54431*Begins
094500090917       01 lc-RDSPModule             PIC X(10) VALUE "RDSP".
094600090917       01 ex-RDSPModule             PIC X(1)  EXTERNAL.
094700090917R54431*Ends
094800130227
094900201113      *RFS186497 - Start
095000201123       01 lc-FATCAModule             PIC X(10) VALUE "FATCAMOD".
095100201113       01 ex-FATCAModule             PIC X(1)  EXTERNAL.
095200201123       01 lc-CRSModule               PIC X(10) VALUE "CRSMOD".
095300201113       01 ex-CRSModule               PIC X(1)  EXTERNAL.
095400201113      *RFS186497 - Ends
095500201113
095600130227      *RFS114676 - Start
095700130227       01 lc-SEGFUNDModule          PIC X(10) VALUE "SEGFUND".
095800130227       01 ex-SEGFUNDModule          PIC X(1)  EXTERNAL.
095900130227      *RFS114676 - End
096000130227
096100110817      * RFS 92917 - Starts
096200110817       01 lc-EXTQESIModule          PIC X(10) VALUE "EXTQESI".
096300110901       01 lc_TempCheck PIC X(1000).
096400110830       01 ex-EXTQESIModule          PIC X(01) EXTERNAL.
096500110907       01 Lc_TrimOut                PIC X(32766).
096600110817      * RFS 92917 - End
096700201109
096800201109      *RFS186497 Starts
096900201110       01 Lc_ExtraValidation   PIC X(05) EXTERNAL.
097000201109         88 lb_FatcaValidation_Type1 VALUE "FCRS1".
097100201210       01 lc_CusipTinVal       PIC X(01)  EXTERNAL VALUE SPACES.
097200201208         88 lb_CusipTinVal_Fail      VALUE "N".
097300201109      *RFS186497 Ends
097400201210
097500200720      *RFS1101025 - Starts
097600200720
097700200720       01  WS-ADDRESS-FIELDS.
097800200720         03  WS-ADDR-CODE           PIC X(01).
097900200720           88  VALID-ADDRESS-CODE   VALUE "2" "3" "7" "D" "A".
098000200720           88  VALID-ADDRESS-SPLT   VALUE "2" "7" "A".
098100200720           88  OWNER-ADDR           VALUE "2".
098200200720           88  ANNUT-ADDR           VALUE "3".
098300200720           88  PAYMNT-ADDR          VALUE "6".
098400200720           88  JOINT-ADDR           VALUE "7".
098500200720           88  CERT-ADDR            VALUE "8".
098600200720           88  BEN-ADDR             VALUE "D".
098700200720           88  IVR-ALTERNATE-ADDR   VALUE "A".
098800200720
098900200720      *RFS1101025 - Ends
099000200720
099100030404           EXEC SQL
099200030404             INCLUDE SQLCA
099300030404           END-EXEC.
099400030404
099500030404           EXEC SQL
099600030404             INCLUDE SQLDA
099700030404            END-EXEC.
099800030404
099900000000      /
100000000000       LINKAGE SECTION.
100100000000       01 COMM-FUND-COMPANY      PIC X(3).
100200020110       01 COMM-REC-LEN           PIC X(5).
100300020110       01 REC-LEN  REDEFINES COMM-REC-LEN PIC 9(5).
100400000000
100500020110       PROCEDURE DIVISION USING  COMM-FUND-COMPANY
100600020110                                 COMM-REC-LEN.
100700000000      *****************************************************************
100800000000      *    P R O C E D U R E   D I V I S I O N                        *
100900000000      *****************************************************************
101000000000       MAINLINE.
101100000000      *****************************************************************
101200000000      *    D E T A I L   P R O C E S S I N G   R O U T I N E          *
101300000000      *****************************************************************
101400030404           EXEC SQL
101500030404             WHENEVER SQLERROR GOTO SQLLOG
101600030404           END-EXEC.
101700040511
101800010924           MOVE LOW-VALUES  TO CURR-CONTROLS.
101900110411           INITIALIZE COMM-ProcessDate.
102000110411           CALL "RTVPRCDTP" USING COMM-ProcessDate.
102100010924
102200051117           OPEN INPUT     MSG-IN,
102300100307R72399                    Cusip-Message-Details-Input
102400100307R72399                    Order-Entry-Detail-Input
102500051117R29004                    DEALER.
102600060412R33685     OPEN EXTEND    MSG-OUT.
102700010924           OPEN EXTEND    NFU-LOG-IN
102800040512                          NFU-LOG-OUT
102900100301      ***  R72399 - Begin
103000100301                          Order-Entry-Detail
103100100301                          Order-Entry-Account
103200100301                          Order-Entry-Demographics
103300100305                          Cusip-Message-Details
103400100301      ***  R72399 - End
103500040512                          NFU-ESG-LOG.
103600201123
103700201123      *RFS186497 - Start
103800201123           MOVE lc-FATCAModule TO WS-MODULE.
103900201123           PERFORM SPECIAL-MODULE-AUTHORIZATION THRU SMA-EXIT.
104000201123           MOVE WS-MODULE-AUTH TO ex-FATCAModule.
104100201123
104200201123           MOVE lc-CRSModule TO WS-MODULE.
104300201123           PERFORM SPECIAL-MODULE-AUTHORIZATION THRU SMA-EXIT.
104400201123           MOVE WS-MODULE-AUTH TO ex-CRSModule.
104500201123      *RFS186497 - Ends
104600201123
104700010927           MOVE ALL "N" TO WS-YES-NO-FLAG
104800050428R26193                     WS-ACCT-ATTRIB-FLAG
104900050428
105000010927           MOVE 1 TO WS-MESSAGE-POINTER
105100010927                     WS-XML-HDR-POINTER
105200010927                     WS-RESPONSE-POINTER.
105300010927
105400050607R26004     INITIALIZE  ADVISOR-DEALER-CODE,
105500050607R26004                 ADVISOR-DEALER-REP-CODE,
105600050607R26004                 ADVISOR-BRANCH-CODE,
105700050607R26004                 WS-ADVISOR-SECTION.
105800050607R28015***** Start
105900050607           MOVE "N" TO WS-OVR-DONE, WS-OVR-REQUIRED.
106000050607           ACCEPT WS-GBL-LIB FROM WS-DATA-AREA FOR "MFAGBLDTA".
106100050607           IF WS-GBL-LIB IS NOT = SPACES
106200050607              MOVE "Y" TO WS-OVR-REQUIRED
106300050607              MOVE WS-RMV TO WS-ACTION
106400050607              CALL "FXOVRFIL" USING WS-ACTION, WS-GBL-LIB
106500050607           END-IF.
106600050607R28015***** End
106700050607
106800140307      *RFS131418 Start
106900140307           ACCEPT lc_ESGParms FROM WS-DATA-MFAESGPARM
107000140307                                      FOR "MFAESGPARM".
107100140307      *RFS131418 End
107200140307
107300090917R54431*Begins - Check for authorized RDSP module.
107400090917           MOVE lc-RDSPModule TO WS-MODULE.
107500090917           PERFORM SPECIAL-MODULE-AUTHORIZATION THRU SMA-EXIT.
107600090917           MOVE WS-MODULE-AUTH TO ex-RDSPModule.
107700090917R54431*Ends
107800130227      *RFS114676 - Start
107900130227           MOVE lc-SEGFUNDModule TO WS-MODULE.
108000130227           PERFORM SPECIAL-MODULE-AUTHORIZATION THRU SMA-EXIT.
108100130227           MOVE WS-MODULE-AUTH TO ex-SEGFUNDModule.
108200130227      *RFS114676 - End
108300050607
108400110817      * RFS 92917 - Starts Check for authorized EXTQESI module.
108500110817           MOVE lc-EXTQESIModule TO WS-MODULE.
108600110817           PERFORM SPECIAL-MODULE-AUTHORIZATION THRU SMA-EXIT.
108700110817           MOVE WS-MODULE-AUTH TO ex-EXTQESIModule.
108800110817      * RFS 92917 - End
108900110817
109000020110           MOVE REC-LEN TO WS-REC-LENGTH.
109100040501           IF WS-REC-LENGTH IS > WS-SIZE-32766
109200020110              DISPLAY "File length too long"
109300020110              GO TO DPR-9999
109400020110           END-IF.
109500030404
109600010925       DPR-0010.
109700020110           READ MSG-IN
109800010924            AT END
109900010926             GO TO DPR-9999
110000010924           END-READ.
110100010926
110200010925           MOVE ZEROES TO WS-TALLY.
110300020110           INSPECT MSG-IN-REC TALLYING WS-TALLY
110400010925                   FOR CHARACTERS BEFORE INITIAL MSG-TAG0.
110500010927           IF WS-TALLY IS >= WS-REC-LENGTH
110600020110              STRING MSG-IN-REC DELIMITED BY "          "
110700011005                " " DELIMITED BY SIZE
110800010928                INTO WS-XML-MSG-HEADER
110900010928                     WITH POINTER WS-XML-HDR-POINTER
111000010926              END-STRING
111100010925              GO TO DPR-0010
111200010925           ELSE
111300010927              IF WS-TALLY > 0 AND WS-TALLY < WS-REC-LENGTH
111400020110                 STRING MSG-IN-REC(1:WS-TALLY) DELIMITED BY SIZE
111500011005                " " DELIMITED BY SIZE
111600010928                  INTO WS-XML-MSG-HEADER
111700010928                       WITH POINTER WS-XML-HDR-POINTER
111800010926                 END-STRING
111900010925              END-IF
112000010925           END-IF.
112100010927
112200010927      ***** Write Header
112300010929           MOVE SPACES TO WS-XML-HEADER WS-MSG-HEADER WS-MSG-HEADER-1.
112400010928           UNSTRING WS-XML-MSG-HEADER DELIMITED BY MSG-SET-TAG0
112500010928               INTO WS-XML-HEADER
112600010929                    WS-MSG-HEADER-1
112700010928           END-UNSTRING.
112800010928
112900020110           MOVE WS-XML-HEADER TO MSG-OUT-REC.
113000020110           WRITE MSG-OUT-REC.
113100010929           STRING MSG-SET-TAG0 DELIMITED BY SIZE
113200010929                  " " DELIMITED BY SIZE
113300010929                  WS-MSG-HEADER-1 DELIMITED BY "        "
113400010929             INTO WS-MSG-HEADER
113500010929           END-STRING.
113600010929
113700020110           MOVE WS-MSG-HEADER TO MSG-OUT-REC.
113800020110           WRITE MSG-OUT-REC.
113900010925
114000040511           PERFORM INITIAL-LOGIC THRU INL-EXIT.
114100040511
114200010926       DPR-0020.
114300010926           PERFORM GET-MESSAGES THRU GM-EXIT.
114400010926           IF MESSAGE-START-FOUND AND MESSAGE-END-FOUND
114500040501              PERFORM PROCESS-MESSAGE-LOGIC THRU PML-EXIT
114600040501           ELSE
114700040501              PERFORM READ-NEXT-RECORD THRU RNR-EXIT
114800040501           END-IF.
114900010926
115000010926           IF AT-END-OF-FILE
115100010926              GO TO DPR-8888
115200010926           END-IF.
115300010926
115400040501           MOVE  "00"    TO COMM-RETURN-CODE.
115500010926           GO TO DPR-0020.
115600010926
115700010926       DPR-8888.
115800010928      *****Close Message Set
115900100301      *** R72399 - Begin
116000100310           CALL "ESGPCUSIP".
116100160205151548*    INITIALIZE Mfacusip OF Cusip-Message-Input-Rec
116200160205151548     INITIALIZE Wrkcusip OF Cusip-Message-Input-Rec
116300100310                      lc-RspCusipNo lc-RspCusipStatus
116400130607123278                lc-RspDrealerCde
116500100310           MOVE ncc-Yes TO lc-CusipProcess
116600100310           PERFORM Create-Cusip-Response UNTIL ncc-EndOfRsp.
116700100301      *** R72399 - End
116800040511           MOVE MSG-SET-TAG1 TO MSG-OUT-REC.
116900020110           WRITE MSG-OUT-REC.
117000010926
117100010926       DPR-9999.
117200020110           CLOSE   MSG-IN
117300020110                   MSG-OUT
117400010924                   NFU-LOG-IN
117500040511                   NFU-LOG-OUT
117600100305      * R72399 - Begin
117700100305                   Order-Entry-Detail
117800100305                   Order-Entry-Account
117900100305                   Order-Entry-Demographics
118000100305                   Cusip-Message-Details
118100100307                   Cusip-Message-Details-Input
118200100307                   Order-Entry-Detail-Input
118300100305      * R72399 - End
118400040511                   NFU-ESG-LOG.
118500170329
118600170329      * RFS 169193 - Start
118700170329            INITIALIZE lc_AuditDT
118800170329                       lc_AuditTi
118900170329                       .
119000170329           MOVE COMM-SYSDATE TO lc_AuditDT.
119100170329           MOVE COMM-SYSTIME-HHMMSS TO lc_AuditTi.
119200170329            EXEC SQL
119300170329              UPDATE MFANFULGP
119400170329              SET     AUDIT_DATE = :lc_AuditDT
119500170329              WHERE   AUDIT_DATE = 0
119600170329            END-EXEC.
119700170329
119800170329            EXEC SQL
119900170329              UPDATE MFANFULGP
120000170329              SET    LOG_TIME   = :lc_AuditTi
120100170329              WHERE  LOG_TIME   =0
120200170329            END-EXEC.
120300170329
120400170329            COMMIT.
120500170329      * RFS 169193 - End
120600170329
120700010924
120800010926       DPR-EXIT.
120900170329169193*    EXIT PROGRAM.
121000170329169193*    STOP RUN.
121100170329169193     GOBACK.
121200010926      /
121300010926       READ-NEXT-RECORD.
121400020110           READ MSG-IN
121500010926             AT END
121600010926               SET AT-END-OF-FILE TO TRUE
121700010926           END-READ.
121800160212
121900010926       RNR-EXIT.
122000010926           EXIT.
122100010925      /
122200030211       GET-MESSAGES.
122300000000      *****************************************************************
122400000000      *    G E T   M E S S A G E S                                    *
122500000000      *****************************************************************
122600030502           MOVE ZEROES TO WS-LENGTH-1
122700030502                          WS-LENGTH-2
122800000000                          WS-COUNT-1
122900000000                          WS-COUNT-2.
123000030502
123100030502      **** Find Begin & End Tags <Message>
123200030502           INSPECT MSG-IN-REC TALLYING WS-COUNT-1
123300030502                   FOR CHARACTERS BEFORE INITIAL MSG-TAG0.
123400030502           INSPECT MSG-IN-REC TALLYING WS-COUNT-2
123500030502                   FOR CHARACTERS BEFORE INITIAL MSG-TAG1.
123600030502
123700030502       GM-BEG-END-TAG.
123800030502      **** When both Begin & End Tags are found in MSG-IN-REC
123900030502      ****     <Message> xxxxxxxxxxxx </Message>
124000030502           IF (WS-COUNT-1 < WS-REC-LENGTH) AND
124100030502              (WS-COUNT-2 < WS-REC-LENGTH)
124200030502              IF WS-COUNT-1 < WS-COUNT-2
124300030502                COMPUTE WS-LENGTH-1 =
124400030502                        (WS-COUNT-2 + MSG-TAG1-SIZE) - WS-COUNT-1
124500030502                ADD 1 TO WS-COUNT-1 WS-COUNT-2
124600030502                MOVE SPACES TO WS-MESSAGE
124700030502                MOVE MSG-IN-REC(WS-COUNT-1:WS-LENGTH-1) TO WS-MESSAGE
124800030502                MOVE SPACES TO MSG-IN-REC(WS-COUNT-1:WS-LENGTH-1)
124900030502                MOVE "Y" TO WS-START-MESSAGE-FLAG
125000030502                MOVE "Y" TO WS-END-MESSAGE-FLAG
125100030502                GO TO GM-0010
125200030502              END-IF
125300030502           END-IF.
125400030502
125500030502       GM-END-TAG.
125600030502      **** IF End Tag or both End & Begin Tags are found in MSG-IN-REC
125700030502      ****     </Message><Message>
125800030502      **** Get the End Tag only, this pgm  will come back for Begin tag
125900030502           IF (WS-COUNT-2 < WS-REC-LENGTH)
126000030502              ADD 1 TO WS-COUNT-2
126100030502              MOVE MSG-TAG1-SIZE TO WS-LENGTH-2
126200030502              STRING MSG-IN-REC(WS-COUNT-2: WS-LENGTH-2)
126300030502                               DELIMITED BY SIZE
126400030502                INTO WS-MESSAGE
126500030502                WITH POINTER WS-MESSAGE-POINTER
126600030502              END-STRING
126700030502              MOVE "Y" TO WS-END-MESSAGE-FLAG
126800040501              MOVE SPACES TO MSG-IN-REC(WS-COUNT-2: WS-LENGTH-2)
126900030502              GO TO GM-EXIT
127000030502           END-IF.
127100030502
127200030502       GM-BEG-TAG.
127300030502      **** Get the Begin Tag + the rest of message
127400030502           IF (WS-COUNT-1 < WS-REC-LENGTH)
127500030502              COMPUTE WS-LENGTH-1 = WS-REC-LENGTH - WS-COUNT-1
127600030502              ADD 1 TO WS-COUNT-1
127700030502              MOVE 1 TO WS-MESSAGE-POINTER
127800030502              MOVE SPACES TO WS-MESSAGE
127900030502              STRING MSG-IN-REC(WS-COUNT-1:WS-LENGTH-1)
128000030502                     DELIMITED BY "          "
128100030502                 INTO  WS-MESSAGE WITH POINTER WS-MESSAGE-POINTER
128200030502              END-STRING
128300030502              MOVE "Y" TO WS-START-MESSAGE-FLAG
128400040501              MOVE SPACES TO MSG-IN-REC(WS-COUNT-1:WS-LENGTH-1)
128500030502              GO TO GM-0010
128600030502           END-IF.
128700030502
128800040501      ***  Get Message Details
128900030502           IF (WS-COUNT-1 >= WS-REC-LENGTH AND
129000030502               WS-COUNT-2 >= WS-REC-LENGTH) AND MESSAGE-START-FOUND
129100110907      *        RFS92917 - Begins - Remove limitation
129200110907      *        STRING MSG-IN-REC DELIMITED BY "                    "
129300110907               STRING FUNCTION TRIM(MSG-IN-REC) "   "
129400110907                              DELIMITED BY SIZE
129500110907      *        RFS92917 - Ends
129600110906                 INTO WS-MESSAGE
129700110906                 WITH POINTER WS-MESSAGE-POINTER
129800110906              END-STRING
129900030502              GO TO GM-EXIT
130000030502           END-IF.
130100030502
130200030502           GO TO GM-EXIT.
130300010926
130400010926       GM-0010.
130500000000      *****Set Response Message tag
130600010926           MOVE 1 TO WS-RESPONSE-POINTER.
130700040501           STRING MSG-TAG0     DELIMITED BY SIZE
130800010926             INTO WS-RESPONSE
130900010926                  WITH POINTER WS-RESPONSE-POINTER
131000010926           END-STRING.
131100000000
131200000000       GM-EXIT.
131300000000           EXIT.
131400000000      /
131500030211       GET-CREATE-MESSAGE.
131600000000      *****************************************************************
131700000000      *    G E T   C R E A T E    M E S S A G E                       *
131800000000      *****************************************************************
131900000000           MOVE ZEROES TO WS-LENGTH-1
132000000000                          WS-LENGTH-2
132100000000                          WS-COUNT-1
132200000000                          WS-COUNT-2.
132300000000
132400000000      ***** Extract Create Message
132500040501           MOVE SPACE TO WS-TEMP-FIELD-5000.
132600010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
132700000000                   FOR CHARACTERS BEFORE INITIAL MSG-CREATE-TAG0.
132800010928           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
132900010928                   FOR CHARACTERS BEFORE INITIAL MSG-CREATE-TAG1.
133000030507           IF (WS-COUNT-1 >= WS-SIZE-32766) OR
133100040501              (WS-COUNT-2 >= WS-SIZE-32766)
133200040501              INITIALIZE WS-TEMP-FIELD-5000
133300040429              MOVE "PAR00"                TO COMM-ERROR-PTR
133400040501              MOVE ERR-XML-INV-MSG-CREATE TO COMM-RETURN-DESC
133500040501              PERFORM ESG-REJECTION THRU ERJ-EXIT
133600020917              GO TO GCM-EXIT
133700020917           END-IF.
133800000000
133900000000      *****Set Response Create Message
134000040501           STRING MSG-CREATE-TAG0  DELIMITED BY SIZE
134100010926             INTO WS-RESPONSE
134200010926                  WITH POINTER WS-RESPONSE-POINTER
134300010926           END-STRING.
134400010926
134500040501           STRING DATE-TAG0        DELIMITED BY SIZE
134600040511                  COMM-SYSDATE     DELIMITED BY SIZE
134700040501                  DATE-TAG1        DELIMITED BY SIZE
134800010926             INTO WS-RESPONSE
134900010926                  WITH POINTER WS-RESPONSE-POINTER
135000000000           END-STRING.
135100010925
135200040511           STRING TIME-TAG0              DELIMITED BY SIZE
135300040511                  COMM-SYSTIME-HHMMSS    DELIMITED BY SIZE
135400040511                  TIME-TAG1              DELIMITED BY SIZE
135500040511             INTO WS-RESPONSE
135600010926                  WITH POINTER WS-RESPONSE-POINTER
135700010925           END-STRING.
135800010925
135900010925       GCM-EXIT.
136000010925           EXIT.
136100010925      /
136200040429       GET-VERSION-NUMBER.
136300040429      *****************************************************************
136400040429      *    G E T   V E R S I O N    N U M B E R                       *
136500040429      *****************************************************************
136600040429           MOVE ZEROES TO WS-LENGTH-1
136700040429                          WS-LENGTH-2
136800040429                          WS-COUNT-1
136900040429                          WS-COUNT-2.
137000040429
137100040429           MOVE ZEROES TO WS-COUNT-1.
137200040429           INSPECT WS-MSG-HEADER TALLYING WS-COUNT-1
137300040916R24237             FOR CHARACTERS BEFORE INITIAL "Version".
137400040429           MOVE ZEROES TO WS-COUNT-2.
137500040429           INSPECT WS-MSG-HEADER TALLYING WS-COUNT-2
137600040429                   FOR CHARACTERS BEFORE INITIAL ">".
137700040916R24237     IF (WS-COUNT-1 < 500) AND
137800040916R24237        (WS-COUNT-2 < 500)
137900040429              GO TO GVN-0010
138000040429           END-IF.
138100040429           MOVE "PAR01"              TO COMM-ERROR-PTR.
138200040429           MOVE ERR-INVALID-VERSION  TO COMM-RETURN-DESC.
138300040429           PERFORM ESG-REJECTION THRU ERJ-EXIT.
138400040429
138500040429           GO TO GVN-EXIT.
138600040429
138700040429
138800040429       GVN-0010.
138900040429      ***** Extract Version number
139000040429           UNSTRING WS-MSG-HEADER DELIMITED
139100040916R24237              BY "Version" OR ">"
139200040429               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
139300040429                    WS-CREATE-MESSAGE COUNT IN WS-LENGTH-2
139400040429           END-UNSTRING.
139500040429           MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2.
139600040429           UNSTRING WS-CREATE-MESSAGE DELIMITED
139700040429                    BY QUOTE OR QUOTE
139800040429               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
139900040429                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
140000040429           END-UNSTRING.
140100040429           IF WS-LENGTH-2 IS NOT = ZEROES
140200040429              MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
140300040429                   TO VERSION-NUMBER OF ESG-OE-DTL-REC
140400120220                      WS-VERSION
140500040429           END-IF.
140600040429
140700040429           IF NOT VALID-VERSION
140800140307131418       AND  VERSION-NUMBER OF ESG-OE-DTL-REC
140900140307131418                 IS NOT EQUAL TO lc_VersionNo
141000040429              MOVE "PAR02"              TO COMM-ERROR-PTR
141100040429              MOVE ERR-INVALID-VERSION  TO COMM-RETURN-DESC
141200040429              PERFORM ESG-REJECTION THRU ERJ-EXIT
141300040429           END-IF.
141400040429
141500040429       GVN-EXIT.
141600040429           EXIT.
141700040429      /
141800030211       GET-SOURCE.
141900010926      *****************************************************************
142000010926      *    G E T   M E S S A G E    S O U R C E                       *
142100010926      *****************************************************************
142200000000           MOVE ZEROES TO WS-LENGTH-1
142300000000                          WS-LENGTH-2
142400000000                          WS-COUNT-1
142500000000                          WS-COUNT-2.
142600021021
142700040501           MOVE SPACES TO WS-OTHER-ID.
142800000000
142900010926           MOVE ZEROES TO WS-COUNT-1.
143000010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
143100010926                   FOR CHARACTERS BEFORE INITIAL SOURCE-TAG0.
143200010926           MOVE ZEROES TO WS-COUNT-2.
143300010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
143400010926                   FOR CHARACTERS BEFORE INITIAL SOURCE-TAG1.
143500030507           IF (WS-COUNT-1 < WS-SIZE-32766) AND
143600030507              (WS-COUNT-2 < WS-SIZE-32766)
143700010926              GO TO GMS-0010
143800010926           END-IF.
143900040429           MOVE "PAR03"              TO COMM-ERROR-PTR.
144000040501           MOVE ERR-XML-INV-SRC-CODE TO COMM-RETURN-DESC.
144100040501           PERFORM ESG-REJECTION THRU ERJ-EXIT.
144200010926
144300010926           GO TO GMS-EXIT.
144400010926
144500010926       GMS-0010.
144600000000      ***** Extract Message Source
144700040422           UNSTRING WS-MESSAGE DELIMITED
144800040422                    BY SOURCE-TAG0 OR SOURCE-TAG1
144900040422               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
145000040422                    WS-CREATE-MESSAGE COUNT IN WS-LENGTH-2
145100040422           END-UNSTRING.
145200040422           MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2.
145300040422           UNSTRING WS-CREATE-MESSAGE DELIMITED
145400040501                    BY SOURCETYPE-TAG0 OR SOURCETYPE-TAG1
145500040422               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
145600040422                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
145700040422           END-UNSTRING.
145800040422           IF WS-LENGTH-2 IS NOT = ZEROES
145900040427              MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
146000040501                   TO ORDER-SOURCE OF ESG-OE-DTL-REC
146100040422           END-IF.
146200040423
146300040501           IF ORDER-SOURCE OF ESG-OE-DTL-REC NOT = "D" AND "I"
146400040429              MOVE "PAR04"              TO COMM-ERROR-PTR
146500040429              MOVE ERR-XML-INV-SRC-TYPE TO COMM-RETURN-DESC
146600040427              STRING
146700040427                   SOURCETYPE-TAG0                DELIMITED BY SIZE
146800040428                   ORDER-SOURCE OF ESG-OE-DTL-REC DELIMITED BY SIZE
146900040427                   SOURCETYPE-TAG1                DELIMITED BY SIZE
147000040427                   INTO COMM-RESPONSE-DATA
147100040427              END-STRING
147200040427              PERFORM ESG-REJECTION THRU ERJ-EXIT
147300011003           END-IF.
147400011009
147500010926           MOVE ZEROES TO WS-COUNT-1.
147600010926           INSPECT WS-CREATE-MESSAGE TALLYING WS-COUNT-1
147700010926                   FOR CHARACTERS BEFORE INITIAL INTER-CODE-TAG0.
147800040501           IF (WS-COUNT-1 < WS-SIZE-32766) AND
147900040429              ORDER-SOURCE OF ESG-OE-DTL-REC = "I"
148000010926              GO TO GMS-INTERMED
148100010926           END-IF.
148200010926           MOVE ZEROES TO WS-COUNT-1.
148300010926           INSPECT WS-CREATE-MESSAGE TALLYING WS-COUNT-1
148400010926                   FOR CHARACTERS BEFORE INITIAL DLR-CODE-TAG0.
148500040501           IF (WS-COUNT-1 < WS-SIZE-32766) AND
148600040429              ORDER-SOURCE OF ESG-OE-DTL-REC = "D"
148700010926              GO TO GMS-DEALER
148800010926           END-IF.
148900040429           MOVE "PAR05"              TO COMM-ERROR-PTR.
149000040501           MOVE ERR-XML-INV-SRC-TYPE TO COMM-RETURN-DESC.
149100040501           PERFORM ESG-REJECTION THRU ERJ-EXIT.
149200010926           GO TO GMS-EXIT.
149300010926
149400010925       GMS-DEALER.
149500010926           UNSTRING WS-CREATE-MESSAGE DELIMITED
149600010926                    BY DLR-CODE-TAG0 OR DLR-CODE-TAG1
149700030214               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
149800030214                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
149900010926           END-UNSTRING.
150000010926           IF WS-LENGTH-2 IS NOT = ZEROES
150100040428              MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
150200040501                   TO DEALER-CODE OF ESG-OE-DTL-REC
150300040501                      WS-OTHER-ID
150400011002           END-IF.
150500011002
150600010926           GO TO GMS-0020.
150700010925
150800010925       GMS-INTERMED.
150900010926           MOVE ZEROES TO WS-LENGTH-2
151000010926           UNSTRING WS-CREATE-MESSAGE DELIMITED
151100010926                    BY INTER-CODE-TAG0 OR INTER-CODE-TAG1
151200030214               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
151300030214                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
151400010926           END-UNSTRING.
151500010926           IF WS-LENGTH-2 IS NOT = ZEROES
151600040428              MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
151700040428                   TO INTERMEDIARY-NO OF ESG-OE-DTL-REC
151800040428                      WS-OTHER-ID
151900010926           END-IF.
152000011002
152100010926       GMS-0020.
152200010925      *****Set Response Source tag
152300040501           STRING SOURCE-TAG0            DELIMITED BY SIZE
152400040501                  SOURCETYPE-TAG0        DELIMITED BY SIZE
152500040501                  "F"                    DELIMITED BY SIZE
152600040501                  SOURCETYPE-TAG1        DELIMITED BY SIZE
152700040501                  FUND-COMPANY-TAG0      DELIMITED BY SIZE
152800040501                  COMM-FUND-COMPANY      DELIMITED BY SIZE
152900040501                  FUND-COMPANY-TAG1      DELIMITED BY SIZE
153000040501                  SOURCE-TAG1            DELIMITED BY SIZE
153100010926             INTO WS-RESPONSE WITH POINTER WS-RESPONSE-POINTER
153200010925           END-STRING.
153300010925
153400010925       GMS-EXIT.
153500010925           EXIT.
153600010925      /
153700030211       GET-TARGET.
153800010926      *****************************************************************
153900010926      *    G E T    T A R G E T    R O U T I N E                      *
154000010926      *****************************************************************
154100000000           MOVE ZEROES TO WS-LENGTH-1
154200000000                          WS-LENGTH-2
154300000000                          WS-COUNT-1
154400000000                          WS-COUNT-2.
154500000000
154600010926           MOVE ZEROES TO WS-COUNT-1.
154700010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
154800010926                   FOR CHARACTERS BEFORE INITIAL TARGET-TAG0.
154900010926           MOVE ZEROES TO WS-COUNT-2.
155000010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
155100010926                   FOR CHARACTERS BEFORE INITIAL TARGET-TAG1.
155200030507           IF (WS-COUNT-1 < WS-SIZE-32766) AND
155300030507              (WS-COUNT-2 < WS-SIZE-32766)
155400010926              GO TO GMT-0010
155500010926           END-IF.
155600040429           MOVE "PAR06"                 TO COMM-ERROR-PTR.
155700040501           MOVE ERR-XML-INV-TARGET-CODE TO COMM-RETURN-DESC.
155800040501           PERFORM ESG-REJECTION THRU ERJ-EXIT.
155900011002
156000010926           GO TO GMT-EXIT.
156100000000
156200010926       GMT-0010.
156300010926      *****Get Response Target
156400010926           MOVE SPACES TO WS-CREATE-MESSAGE.
156500010926           UNSTRING WS-MESSAGE DELIMITED
156600010926                    BY TARGET-TAG0 OR TARGET-TAG1
156700030214               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
156800010926                    WS-CREATE-MESSAGE COUNT IN WS-LENGTH-2
156900010926           END-UNSTRING.
157000040501           UNSTRING WS-CREATE-MESSAGE DELIMITED
157100040501                    BY TARGETTYPE-TAG0 OR TARGETTYPE-TAG1
157200040501             INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
157300040501                  WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
157400040501           END-UNSTRING.
157500040501           IF ((WS-LENGTH-2 >= WS-SIZE-32766 AND WS-LENGTH-2 <= 1) OR
157600040501               (WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2) NOT = "F"))
157700040429               MOVE "PAR07"                 TO COMM-ERROR-PTR
157800040501               MOVE ERR-XML-INV-TARGET-CODE TO COMM-RETURN-DESC
157900040501               PERFORM ESG-REJECTION THRU ERJ-EXIT
158000040501               GO TO GMT-EXIT
158100040501           END-IF.
158200040422
158300040422           UNSTRING WS-CREATE-MESSAGE DELIMITED
158400040422                    BY FUND-COMPANY-TAG0 OR FUND-COMPANY-TAG1
158500040422             INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
158600040422                  WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
158700040422           END-UNSTRING.
158800030507           IF WS-LENGTH-2 >= WS-SIZE-32766 AND WS-LENGTH-2 <= 1
158900040429              MOVE "PAR08"                 TO COMM-ERROR-PTR
159000040427              MOVE ERR-XML-INV-TARGET-CODE TO COMM-RETURN-DESC
159100040427              PERFORM ESG-REJECTION THRU ERJ-EXIT
159200010927           ELSE
159300040428              MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
159400040428                   TO MANAGEMENT-COMPANY-CODE OF ESG-OE-DTL-REC
159500040428              IF ORDER-SOURCE OF ESG-OE-DTL-REC = "F"
159600040501                 MOVE MANAGEMENT-COMPANY-CODE OF ESG-OE-DTL-REC
159700040428                   TO WS-OTHER-ID
159800021021              END-IF
159900010927           END-IF.
160000010927
160100040501           IF ORDER-SOURCE OF ESG-OE-DTL-REC = "D"
160200040501              STRING TARGET-TAG0        DELIMITED BY SIZE
160300040501                     TARGETTYPE-TAG0    DELIMITED BY SIZE
160400040501                     ORDER-SOURCE OF ESG-OE-DTL-REC DELIMITED BY SIZE
160500040501                     TARGETTYPE-TAG1    DELIMITED BY SIZE
160600040501                     DLR-CODE-TAG0      DELIMITED BY SIZE
160700040501                     DEALER-CODE OF ESG-OE-DTL-REC DELIMITED BY SPACE
160800040501                     DLR-CODE-TAG1      DELIMITED BY SIZE
160900040501                     TARGET-TAG1        DELIMITED BY SIZE
161000040501                     MSG-CREATE-TAG1    DELIMITED BY SIZE
161100010926                 INTO WS-RESPONSE WITH POINTER WS-RESPONSE-POINTER
161200000000              END-STRING
161300000000           ELSE
161400040501              STRING TARGET-TAG0        DELIMITED BY SIZE
161500040501                     TARGETTYPE-TAG0    DELIMITED BY SIZE
161600040501                     ORDER-SOURCE OF ESG-OE-DTL-REC DELIMITED BY SIZE
161700040501                     TARGETTYPE-TAG1    DELIMITED BY SIZE
161800040501                     INTER-CODE-TAG0    DELIMITED BY SIZE
161900040501                     INTERMEDIARY-NO OF ESG-OE-DTL-REC
162000040501                                        DELIMITED BY SPACE
162100040501                     INTER-CODE-TAG1    DELIMITED BY SIZE
162200040501                     TARGET-TAG1        DELIMITED BY SIZE
162300040501                     MSG-CREATE-TAG1    DELIMITED BY SIZE
162400010926                 INTO WS-RESPONSE WITH POINTER WS-RESPONSE-POINTER
162500000000              END-STRING
162600000000           END-IF.
162700010925
162800010925       GMT-EXIT.
162900000000           EXIT.
163000000000      /
163100030211       GET-MESSAGE-TYPE.
163200000000      *****************************************************************
163300000000      *    G E T   M E S S A G E   T Y P E                            *
163400000000      *****************************************************************
163500030509           MOVE "N" TO WS-ADDRESS-FLAG,
163600030509                       WS-NAME-FLAG,
163700030509                       WS-ACCT-ATTRIB-FLAG,
163800030509                       WS-CLERK-FOUND,
163900040501                       WS-DISTRIBUTION-FLAG,
164000040501                       WS-BENE-FLAG,
164100050607R26004                 WS-ADDMODREP-FLAG,
164200050607R26004                 WS-INAREP-FLAG,
16430006030229614                  lc-ModBulkRepFlag,
16440010031072399                  lc-CusipProcess,
164500110306R84184                 lc-AddSuc-Flag
164600131011121109*                WS-ADDPAC-FLAG.
164700131011                       WS-ADDPAC-FLAG,
164800160209151550                 lc_AddAwdFlag,
164900180208174736                 lc_AddModFee,
165000160209151550                 lc_TerAwdPACFlag,
165100160614160643                 lc_TerAwdFlag,
165200210128121109                 WS-FATCA-FLAG,
165300210128186088                 lc_AddModCDICFlag.
165400100222
165500100222           MOVE ZEROES TO WS-LENGTH-1
165600100222                          WS-LENGTH-2
165700100222                          WS-COUNT-1
165800100222                          WS-COUNT-2.
165900100222
166000100222      ***** Extract Message Type
166100100222           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
166200100222                   FOR CHARACTERS BEFORE INITIAL MSG-TYPE-TAG0.
166300100222           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
166400100222                   FOR CHARACTERS BEFORE INITIAL MSG-TYPE-TAG1.
166500100222           IF (WS-COUNT-1 >= WS-SIZE-32766 OR WS-COUNT-2  >=
166600100222                                                WS-SIZE-32766)
166700040429              MOVE "PAR09"               TO COMM-ERROR-PTR
166800040428              MOVE ERR-XML-INV-MSG-TYPE  TO COMM-RETURN-DESC
166900040428              PERFORM ESG-REJECTION THRU ERJ-EXIT
167000010926           END-IF.
167100010926
167200010926      ***** Extract Clerk Id
167300010926           MOVE ZEROES TO WS-LENGTH-1
167400010926                          WS-LENGTH-2
167500010926                          WS-COUNT-1
167600010926                          WS-COUNT-2.
167700010926
167800010926           UNSTRING WS-MESSAGE DELIMITED
167900010926                    BY CLERK-TAG0 OR CLERK-TAG1
168000030214             INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
168100030214                  WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
168200010926           END-UNSTRING.
168300040422
168400040501           IF WS-LENGTH-2 >= WS-SIZE-32766 OR WS-LENGTH-2 < 1
168500021021              STRING "X" DELIMITED BY SIZE
168600040428                     ORDER-SOURCE OF ESG-OE-DTL-REC DELIMITED BY SIZE
168700021021                     WS-OTHER-ID DELIMITED BY SIZE
168800040427                     INTO CLERK-ID OF ESG-OE-DTL-REC
168900021021              END-STRING
169000021021              MOVE "N" TO WS-CLERK-FOUND
169100021021           ELSE
169200021021              STRING "X" DELIMITED BY SIZE
169300040428                     ORDER-SOURCE OF ESG-OE-DTL-REC DELIMITED BY SIZE
169400030214                     WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2) DELIMITED BY
169500021021                                                         SIZE
169600040427                     INTO CLERK-ID OF ESG-OE-DTL-REC
169700021021              END-STRING
169800021021              MOVE "Y" TO WS-CLERK-FOUND
169900021021           END-IF.
170000010926
170100010926           MOVE ZEROES TO WS-LENGTH-1
170200010926                          WS-LENGTH-2
170300010926                          WS-COUNT-1
170400010926                          WS-COUNT-2.
170500010926
170600010926      *****Extract Response Message ID
170700010926           IF WS-CLERK-FOUND IS = "Y"
170800010926              UNSTRING WS-MESSAGE DELIMITED
170900040501                    BY REQUEST-TAG0 OR CLERK-TAG0
171000030214                INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
171100030214                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
171200010926              END-UNSTRING
171300010926           ELSE
171400010926              UNSTRING WS-MESSAGE DELIMITED
171500040501                    BY REQUEST-TAG0 OR ACCOUNT-TAG0
171600030214                INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
171700030214                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
171800010926              END-UNSTRING
171900010926           END-IF.
172000010926
172100010926           MOVE ZEROES TO WS-LENGTH-1
172200010926                          WS-LENGTH-2
172300010926                          WS-COUNT-1
172400010926                          WS-COUNT-2.
172500010926
172600010926           MOVE ZEROES TO WS-COUNT-2.
172700040423           UNSTRING WS-TEMP-FIELD-2-5000 DELIMITED
172800040501                    BY SRCID-TAG0  OR SRCID-TAG1
172900030214               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
173000040423                    WS-TEMP-FIELD-3-5000 COUNT IN WS-LENGTH-2
173100010926           END-UNSTRING.
173200040428           MOVE WS-TEMP-FIELD-3-5000(1:WS-LENGTH-2)
173300040503                TO SOURCE-NUMBER-2 OF ESG-OE-DTL-REC.
173400010926
173500040904R23543*** Set SrcId
173600040904R23543     IF SOURCE-NUMBER-2 OF ESG-OE-DTL-REC NOT = SPACES
173700040904              STRING SRCID-TAG0     DELIMITED BY SIZE
173800040904                     SOURCE-NUMBER-2 OF ESG-OE-DTL-REC
173900040904                                    DELIMITED BY SPACE
174000040904                     SRCID-TAG1     DELIMITED BY SIZE
174100040904                 INTO WS-SRCID
174200040904              END-STRING
174300040904           END-IF.
174400040904
174500010926       GMY-EXIT.
174600010926           EXIT.
174700040503      /
174800040503       GET-NETWORK.
174900040503      *****************************************************************
175000040503      *    G E T   N E T W O R K                                      *
175100040503      *****************************************************************
175200040503           MOVE ZEROES TO WS-LENGTH-1
175300040503                          WS-LENGTH-2
175400040503                          WS-COUNT-1
175500040503                          WS-COUNT-2.
175600040503
175700040503       GNW-NTWK.
175800040503      ***** Extract Network Info
175900040503           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
176000040503                   FOR CHARACTERS BEFORE INITIAL NTWK-TAG0.
176100040503           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
176200040503                   FOR CHARACTERS BEFORE INITIAL NTWK-TAG1.
176300040503           IF (WS-COUNT-1 >= WS-SIZE-32766 OR WS-COUNT-2  >=
176400040503                                                WS-SIZE-32766)
176500040503              GO TO GNW-EXIT
176600040503           END-IF.
176700040503
176800040503           MOVE ZEROES TO WS-LENGTH-1
176900040503                          WS-LENGTH-2
177000040503                          WS-COUNT-1
177100040503                          WS-COUNT-2.
177200040503
177300040503           MOVE SPACES TO WS-CREATE-MESSAGE.
177400040503           UNSTRING WS-MESSAGE DELIMITED
177500040503                    BY NTWK-TAG0 OR NTWK-TAG1
177600040503               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
177700040503                    WS-CREATE-MESSAGE COUNT IN WS-LENGTH-2
177800040503           END-UNSTRING.
177900040503
178000040503       GNW-NTWK-ID.
178100040503      ***** Extract Network Id
178200040503           UNSTRING WS-CREATE-MESSAGE DELIMITED
178300040503                    BY NTWKID-TAG0 OR NTWKID-TAG1
178400040503             INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
178500040503                  WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
178600040503           END-UNSTRING.
178700040503           IF WS-LENGTH-2 >= WS-SIZE-32766 AND WS-LENGTH-2 <= 1
178800040503               GO TO GNW-NTWK-DATE
178900040503           ELSE
179000040503               MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
179100040503                 TO NETWORK-ID  OF ESG-OE-DTL-REC
179200040503           END-IF.
179300040503
179400040503       GNW-NTWK-DATE.
179500040503      ***** Extract Network date
179600040503           MOVE ZEROES TO WS-LENGTH-1
179700040503                          WS-LENGTH-2
179800040503                          WS-COUNT-1
179900040503                          WS-COUNT-2.
180000040503
180100040503           UNSTRING WS-CREATE-MESSAGE DELIMITED
180200040503                    BY DATE-TAG0 OR DATE-TAG1
180300040503             INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
180400040503                  WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
180500040503           END-UNSTRING.
180600040503           IF WS-LENGTH-2 >= WS-SIZE-32766 AND WS-LENGTH-2 <= 1
180700040503              GO TO GNW-NTWK-TIME
180800040503           ELSE
180900040503             IF WS-LENGTH-2 IS NOT = ZEROES AND
181000040503                WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2) IS NUMERIC
181100040503                MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
181200040503                     TO ORDER-DATE  OF ESG-OE-DTL-REC
181300040503             END-IF
181400040503           END-IF.
181500040503
181600040503       GNW-NTWK-TIME.
181700040503           MOVE ZEROES TO WS-LENGTH-1
181800040503                          WS-LENGTH-2
181900040503                          WS-COUNT-1
182000040503                          WS-COUNT-2.
182100040503
182200040503           UNSTRING WS-CREATE-MESSAGE DELIMITED
182300040503                    BY TIME-TAG0 OR TIME-TAG1
182400040503             INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
182500040503                  WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
182600040503           END-UNSTRING.
182700040503           IF WS-LENGTH-2 >= WS-SIZE-32766 AND WS-LENGTH-2 <= 1
182800040503              GO TO GNW-NTWK-MSG-ID
182900040503           ELSE
183000040503             IF WS-LENGTH-2 IS NOT = ZEROES AND
183100040503                WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2) IS NUMERIC
183200040503                MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
183300040503                     TO ORDER-TIME2 OF ESG-OE-DTL-REC
183400040503             END-IF
183500040503           END-IF.
183600040503
183700040503
183800040503       GNW-NTWK-MSG-ID.
183900040503           MOVE ZEROES TO WS-LENGTH-1
184000040503                          WS-LENGTH-2
184100040503                          WS-COUNT-1
184200040503                          WS-COUNT-2.
184300040503
184400040503      *****Extract Message ID
184500040503           UNSTRING WS-CREATE-MESSAGE DELIMITED
184600040503                    BY MESSAGEID-TAG0 OR MESSAGEID-TAG1
184700040503              INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
184800040503                   WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
184900040503           END-UNSTRING.
185000040503           IF WS-LENGTH-2 IS NOT = ZEROES
185100040503              MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
185200040503                TO NETWORK-ORDER-NO OF ESG-OE-DTL-REC
185300040503           END-IF.
185400040503
185500040904R23543*****Set MessageID
185600040830           IF NETWORK-ORDER-NO OF ESG-OE-DTL-REC NOT = SPACES
185700040830              STRING MESSAGEID-TAG0 DELIMITED BY SIZE
185800040830                     NETWORK-ORDER-NO OF ESG-OE-DTL-REC
185900040830                                    DELIMITED BY SPACE
186000040830                     MESSAGEID-TAG1 DELIMITED BY SIZE
186100040904                 INTO WS-MESSAGEID
186200040830              END-STRING
186300040830           END-IF.
186400040830
186500040503       GNW-EXIT.
186600040503           EXIT.
186700010926      /
186800030211       GET-BUSINESS-TYPE.
186900010926      *****************************************************************
187000010926      *    G E T   B U S I N E S S   T Y P E                          *
187100010926      *****************************************************************
187200040501           MOVE SPACES   TO  WS-BUSINESS-PROCESS-MODE.
187300010928           MOVE "N" TO WS-BUSINESS-FOUND.
187400010926           MOVE ZEROES TO WS-LENGTH-1
187500010926                          WS-LENGTH-2
187600010926                          WS-COUNT-1
187700010926                          WS-COUNT-2.
187800010926
187900010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
188000010926                   FOR CHARACTERS BEFORE INITIAL BUSINESS-TAG0.
188100010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
188200010926                   FOR CHARACTERS BEFORE INITIAL BUSINESS-TAG1.
188300030507           IF (WS-COUNT-1 >= WS-SIZE-32766)
188400030507           OR (WS-COUNT-2 >= WS-SIZE-32766)
188500040429              MOVE "PAR10"                 TO COMM-ERROR-PTR
188600040428              MOVE ERR-XML-NOT-SUPPORTED   TO COMM-RETURN-DESC
188700040428              PERFORM ESG-REJECTION THRU ERJ-EXIT
188800010926           END-IF.
188900010926
189000010928           MOVE "Y" TO WS-BUSINESS-FOUND.
189100010926           ADD 1 TO WS-COUNT-1.
189200010926           ADD 1 TO WS-COUNT-2.
189300010926           ADD BUSINESS-TAG1-SIZE TO WS-COUNT-2.
189400010926
189500010926      ***** This check is for program safety
189600030507           IF WS-COUNT-2 > WS-SIZE-32766
189700030507              MOVE WS-SIZE-32766 TO WS-COUNT-2
189800010926           END-IF.
189900030507           IF WS-COUNT-1 > WS-SIZE-32766
190000010926              MOVE 1 TO WS-COUNT-1
190100010926           END-IF.
190200010926
190300010926           MOVE WS-MESSAGE(WS-COUNT-1:WS-COUNT-2 - WS-COUNT-1) TO
190400040501                COMM-BUSINESS-PROCESS.
190500010926
190600110915      * RFS92917 - Begins - Move activity to a procedure
190700111024           INITIALIZE WS-STRING-BEFORE
190800111024                      WS-STRING-AFTER.
190900111024           MOVE COMM-BUSINESS-PROCESS TO WS-STRING-BEFORE.
191000110915           PERFORM Replace-XML-Special-Entities.
191100160317151549     MOVE WS-STRING-AFTER(1:20000) TO COMM-BUSINESS-PROCESS.
191200050607R26171**** Replace the XML special Entities
191300050607      **** &amp; &apos; &lt; &gt; &quot;
191400110915      *    INITIALIZE WS-STRING-BEFORE
191500110915      *               WS-STRING-AFTER.
191600110915      *    MOVE COMM-BUSINESS-PROCESS TO WS-STRING-BEFORE.
191700110915      *    CALL "FXXMLENT" USING WS-STRING-BEFORE
191800110915      *                          WS-STRING-AFTER.
191900110915      *    MOVE WS-STRING-AFTER TO COMM-BUSINESS-PROCESS.
192000110915      * RFS92917 - Begins - Move activity to a procedure
192100050607
192200200720      *RFS1101025 - Starts
192300200720      ***** Get Address Code
192400200720           MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2.
192500200720           MOVE SPACE  TO WS-ADDR-CODE.
192600200720           UNSTRING COMM-BUSINESS-PROCESS DELIMITED
192700200720                 BY ADDRESS-CODE-TAG0 OR ADDRESS-CODE-TAG1
192800200720               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
192900200720                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
193000200720           END-UNSTRING.
193100200720           IF WS-LENGTH-2 IS NOT = ZEROES
193200200720              MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2) TO
193300200720                                             WS-ADDR-CODE
193400200720           END-IF.
193500200720           MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2.
193600200720
193700200720      *RFS1101025 - Ends
193800200720
193900010926      ***** Determine Business Type
194000010926           MOVE ZEROES TO WS-LENGTH-1
194100010926                          WS-LENGTH-2
194200010926                          WS-COUNT-1
194300010926                          WS-COUNT-2.
194400010926
194500040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
194600010926                   FOR CHARACTERS BEFORE INITIAL ADDRESS-TAG0.
194700040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
194800010926                   FOR CHARACTERS BEFORE INITIAL ADDRESS-TAG1.
194900160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
195000160317151549                                              WS-SIZE-32766)
195100010926              MOVE "Y" TO WS-ADDRESS-FLAG
195200040501              MOVE  ADDRESS-TAG0       TO  WS-BUSINESS-PROCESS-MODE
195300010926              GO TO GBT-EXIT
195400010926           END-IF.
195500010926
195600010926           MOVE ZEROES TO WS-COUNT-1.
195700010926           MOVE ZEROES TO WS-COUNT-2.
195800040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
195900010926                   FOR CHARACTERS BEFORE INITIAL CLIENT-TAG0.
196000040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
196100010926                   FOR CHARACTERS BEFORE INITIAL CLIENT-TAG1.
196200160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
196300160317151549                                          WS-SIZE-32766)
196400010926              MOVE "Y" TO WS-NAME-FLAG
196500040501              MOVE  CLIENT-TAG0        TO  WS-BUSINESS-PROCESS-MODE
196600010926              GO TO GBT-EXIT
196700010926           END-IF.
196800010926
196900010926           MOVE ZEROES TO WS-COUNT-1.
197000010926           MOVE ZEROES TO WS-COUNT-2.
197100040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
197200010926                   FOR CHARACTERS BEFORE INITIAL ACCT-ATTRIB-TAG0.
197300040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
197400010926                   FOR CHARACTERS BEFORE INITIAL ACCT-ATTRIB-TAG1.
197500160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
197600160317151549                                          WS-SIZE-32766)
197700010926              MOVE "Y" TO WS-ACCT-ATTRIB-FLAG
197800040501              MOVE  ACCT-ATTRIB-TAG0   TO  WS-BUSINESS-PROCESS-MODE
197900010926              GO TO GBT-EXIT
198000010926           END-IF.
198100010926
198200040501           MOVE ZEROES TO WS-COUNT-1.
198300040501           MOVE ZEROES TO WS-COUNT-2.
198400040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
198500040501                   FOR CHARACTERS BEFORE INITIAL DISTRIBUTION-TAG0.
198600040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
198700040501                   FOR CHARACTERS BEFORE INITIAL DISTRIBUTION-TAG1.
198800160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
198900160317151549                                          WS-SIZE-32766)
199000040501              MOVE "Y" TO WS-DISTRIBUTION-FLAG
199100040501              MOVE  DISTRIBUTION-TAG0  TO  WS-BUSINESS-PROCESS-MODE
199200040501              GO TO GBT-EXIT
199300040501           END-IF.
199400020418
199500040501           MOVE ZEROES TO WS-COUNT-1.
199600040501           MOVE ZEROES TO WS-COUNT-2.
199700040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
199800040501                   FOR CHARACTERS BEFORE INITIAL ADD-BEN-TAG0.
199900040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
200000040501                   FOR CHARACTERS BEFORE INITIAL ADD-BEN-TAG1.
200100160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
200200160317151549                                           WS-SIZE-32766)
200300040501              MOVE "Y" TO WS-BENE-FLAG
200400040501              MOVE  ADD-BEN-TAG0       TO  WS-BUSINESS-PROCESS-MODE
200500040501              GO TO GBT-EXIT
200600040501           END-IF.
200700030422
200800040501           MOVE ZEROES TO WS-COUNT-1.
200900040501           MOVE ZEROES TO WS-COUNT-2.
201000040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
201100040501                   FOR CHARACTERS BEFORE INITIAL ADD-PAC-TAG0.
201200040501           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
201300040501                   FOR CHARACTERS BEFORE INITIAL ADD-PAC-TAG1.
201400160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
201500160317151549                                           WS-SIZE-32766)
201600040501              MOVE "Y" TO WS-ADDPAC-FLAG
201700040501              MOVE  ADD-PAC-TAG0       TO  WS-BUSINESS-PROCESS-MODE
201800040501              GO TO GBT-EXIT
201900040501           END-IF.
202000050607R26004
202100050607R26004     MOVE ZEROES TO WS-COUNT-1.
202200050607R26004     MOVE ZEROES TO WS-COUNT-2.
202300050607R26004     INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
202400050607R26004             FOR CHARACTERS BEFORE INITIAL ADDMODREP-TAG0.
202500050607R26004     INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
202600050607R26004             FOR CHARACTERS BEFORE INITIAL ADDMODREP-TAG1.
202700160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
202800160317151549                                          WS-SIZE-32766)
202900050607R26004        MOVE "Y" TO WS-ADDMODREP-FLAG
203000050607R26004        MOVE  ADDMODREP-TAG0   TO  WS-BUSINESS-PROCESS-MODE
203100050607R26004        GO TO GBT-EXIT
203200050607R26004     END-IF.
203300050607R26004
203400050607R26004     MOVE ZEROES TO WS-COUNT-1.
203500050607R26004     MOVE ZEROES TO WS-COUNT-2.
203600050607R26004     INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
203700050607R26004             FOR CHARACTERS BEFORE INITIAL INAREP-TAG0.
203800050607R26004     INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
203900050607R26004             FOR CHARACTERS BEFORE INITIAL INAREP-TAG1.
204000160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
204100160317151549                                          WS-SIZE-32766)
204200050607R26004        MOVE "Y" TO WS-INAREP-FLAG
204300050607R26004        MOVE  INAREP-TAG0   TO  WS-BUSINESS-PROCESS-MODE
204400050607R26004        GO TO GBT-EXIT
204500050607R26004     END-IF.
204600050607
204700060302R26004     MOVE ZEROES TO WS-COUNT-1.
204800060302R26004     MOVE ZEROES TO WS-COUNT-2.
204900060302R26004     INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
205000060302R26004             FOR CHARACTERS BEFORE INITIAL INAREP-TAG0-1.
205100060302R26004     ADD WS-COUNT-1 9 GIVING WS-COUNT-2.
205200160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
205300160317151549                                          WS-SIZE-32766)
205400060302R26004        MOVE "Y" TO WS-INAREP-FLAG
205500060302R26004        MOVE  INAREP-TAG0   TO  WS-BUSINESS-PROCESS-MODE
205600060302R26004        GO TO GBT-EXIT
205700060302R26004     END-IF.
205800060302
20590006030229614      INITIALIZE Ws-Count-1, Ws-Count-2.
20600006030229614      INSPECT Comm-Business-Process TALLYING Ws-Count-1
20610006030229614              FOR CHARACTERS BEFORE INITIAL lc-ModBulkRepTag0.
20620006030229614      INSPECT Comm-Business-Process TALLYING Ws-Count-2
20630006030229614              FOR CHARACTERS BEFORE INITIAL lc-ModBulkRepTag1.
206400160317151549     IF (Ws-Count-1 < WS-SIZE-32766 AND Ws-Count-2 <
206500160317151549                                          WS-SIZE-32766)
20660006030229614         MOVE ncc-Yes TO lc-ModBulkRepFlag
20670006030229614         MOVE lc-ModBulkRepTag0 TO Ws-Business-Process-Mode
20680006030229614         GO TO Gbt-Exit
20690006030229614      END-IF.
207000050607
207100100222      *** R72399 - Begin
207200100222           INITIALIZE Ws-Count-1, Ws-Count-2.
207300100222           INSPECT Comm-Business-Process TALLYING Ws-Count-1
207400100222                   FOR CHARACTERS BEFORE INITIAL CRR-TAG0.
207500100222           INSPECT Comm-Business-Process TALLYING Ws-Count-2
207600100222                   FOR CHARACTERS BEFORE INITIAL CRR-TAG1.
207700160317151549     IF (Ws-Count-1 < WS-SIZE-32766 AND Ws-Count-2 <
207800160317151549                                          WS-SIZE-32766)
207900100310              MOVE ncc-Yes TO lc-CusipProcess
208000100223                              COMM-EDIT-ONLY
208100100222              MOVE CRR-TAG0 TO Ws-Business-Process-Mode
208200100228
208300100228      ***** Extract CUSIP number
208400100228              UNSTRING WS-MESSAGE DELIMITED
208500100228                    BY CRR-TAG0 OR CRR-TAG1
208600100228               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
208700100228                    WS-CREATE-MESSAGE COUNT IN WS-LENGTH-2
208800100228              END-UNSTRING
208900100228              MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2
209000100228              UNSTRING WS-CREATE-MESSAGE DELIMITED
209100100228                    BY CUSIP-TAG0 OR CUSIP-TAG1
209200100228               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
209300100228                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
209400100228              END-UNSTRING
209500100228              IF WS-LENGTH-2 IS NOT = ZEROES
209600100228                 MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
209700100305                   TO Cusip-No OF Cusip-Msg-Dtls-Rec
209800100228              ELSE
209900100228                 MOVE "PARXX" TO COMM-ERROR-PTR
210000100228                 MOVE Err-Dbase-Not-Availab TO COMM-RETURN-DESC
210100100228                 PERFORM ESG-REJECTION THRU ERJ-EXIT
210200100228                 GO TO Gbt-Exit
210300100228              END-IF
210400160205
210500160205      * RFS 151548 - Start
210600160205      ***** Extract CUSIP ACB Value
210700160205              MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2
210800160205              UNSTRING WS-CREATE-MESSAGE DELIMITED
210900160205                    BY ACB-TAG0 OR ACB-TAG1
211000160205               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
211100160205                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
211200160205              END-UNSTRING
211300160205              IF WS-LENGTH-2 IS NOT = ZEROES
211400160205                 PERFORM GetDecimalAmount
211500160205                 MOVE ln_ACBValue
211600160205                   TO CUSIP-ACB OF Cusip-Msg-Dtls-Rec
211700160205              END-IF
211800160205      * RFS 151548 - End
211900160205
212000100228      ***** Extract Cusip Units
212100100228              MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2
212200100228              UNSTRING WS-CREATE-MESSAGE DELIMITED
212300100228                    BY RUP-TAG0 OR RUP-TAG1
212400100228               INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
212500100228                    WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
212600100228              END-UNSTRING
212700100303              IF WS-LENGTH-2 IS NOT = ZEROES
212800100228                 MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
212900100303                   TO WS-AMOUNT-VALUE
213000100228              ELSE
213100100228                 MOVE "PARXX" TO COMM-ERROR-PTR
213200100228                 MOVE Err-Dbase-Not-Availab TO COMM-RETURN-DESC
213300100228                 PERFORM ESG-REJECTION THRU ERJ-EXIT
213400100228                 GO TO Gbt-Exit
213500100228              END-IF
213600100303              MOVE WS-AMOUNT-VALUE TO WS-ALPHA-NUM
213700100303              MOVE 12 TO WS-FIELD-LENGTH
213800100305              PERFORM EDIT-NUMERIC-MESSAGES
213900100305              MOVE Ws-Whole-Dec
214000100305                TO Nfu-Actual-Units OF Cusip-Msg-Dtls-Rec
214100100228              GO TO Gbt-Exit
214200100228           END-IF.
214300100228      *** R72399 - End
214400100222
214500110306      *Rfs84184 - Start
214600110306           MOVE ZEROES TO Ws-Count-1.
214700110306           MOVE ZEROES TO Ws-Count-2.
214800110306           INSPECT Comm-Business-Process TALLYING Ws-Count-1
214900110328                   FOR CHARACTERS BEFORE INITIAL AddTFSASuccTag0.
215000110306           INSPECT Comm-Business-Process TALLYING Ws-Count-2
215100110328                   FOR CHARACTERS BEFORE INITIAL AddTFSASuccTag1.
215200160317151549     IF (Ws-Count-1 < WS-SIZE-32766
215300160317151549     AND Ws-Count-2 < WS-SIZE-32766)
215400110306              MOVE "Y" TO lc-AddSuc-Flag
215500110328              MOVE AddTFSASuccTag0 TO Ws-Business-Process-Mode
215600110306              GO TO Gbt-Exit
215700110306           END-IF.
215800130305      *Rfs84184 - End
215900130305
216000130305      *--RFS114676 - Starts
216100130305           MOVE ZEROES TO ln_Count3.
216200130305           INSPECT WS-MESSAGE TALLYING ln_Count3
216300130305                   FOR ALL ADDNEWACCT-TAG1
216400130305                           ADDNEWACCT-TAG2.
216500130305           IF  ln_Count3 > ZEROES
216600130305               MOVE ncc-Yes TO lc_AddNewAcctFlag
216700130305               MOVE ADDNEWACCT-TAG0 TO Ws-Business-Process-Mode
216800130305               GO TO Gbt-Exit
216900130305           END-IF.
217000130305      *--RFS114676 - Starts
217100100222
217200131011      *RFS121109-Start
217300131011
217400131011           MOVE ZEROES TO WS-COUNT-1.
217500131011           MOVE ZEROES TO WS-COUNT-2.
217600131011           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
217700170328164272*           FOR CHARACTERS BEFORE INITIAL AddModFATCA-TAG0.
217800170328164272            FOR CHARACTERS BEFORE INITIAL AddModFATCA-CRS-TAG0.
217900131011           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
218000170328164272*          FOR CHARACTERS BEFORE INITIAL AddModFATCA-TAG1.
218100170328164272           FOR CHARACTERS BEFORE INITIAL AddModFATCA-CRS-TAG1.
218200160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
218300160317151549                                         WS-SIZE-32766)
218400131011               MOVE "Y" TO WS-FATCA-FLAG
218500170328164272*        MOVE  AddModFATCA-TAG0   TO  WS-BUSINESS-PROCESS-MODE
218600170328164272         MOVE  AddModFATCA-CRS-TAG0 TO  WS-BUSINESS-PROCESS-MODE
218700131011               GO TO GBT-EXIT
218800131011           END-IF.
218900131011
219000131011      *RFS121109-End
219100160209      *RFS 151550 - Start
219200160209           MOVE ZEROES TO WS-COUNT-1.
219300160209           MOVE ZEROES TO WS-COUNT-2.
219400160209           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
219500160209                  FOR CHARACTERS BEFORE INITIAL ADD-AWD-TAG0.
219600160209           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
219700160209                 FOR CHARACTERS BEFORE INITIAL ADD-AWD-TAG1.
219800160317151549     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
219900160317151549                                         WS-SIZE-32766)
220000160209               MOVE "Y" TO lc_AddAwdFlag
220100160209               MOVE  ADD-AWD-TAG0   TO  WS-BUSINESS-PROCESS-MODE
220200160209               GO TO GBT-EXIT
220300160209           END-IF.
220400160209
220500160209           MOVE ZEROES TO WS-COUNT-1.
220600160209           MOVE ZEROES TO WS-COUNT-2.
220700160220           INSPECT COMM-BUSINESS-PROCESS   TALLYING WS-COUNT-1
220800160220                  FOR ALL  TER-AWD-TAG0
220900160220           IF WS-COUNT-1 > ZEROES
221000160209               MOVE "Y" TO lc_TerAwdPACFlag
221100160614160643                     lc_TerAwdFlag
221200160219               MOVE  TER-AWD-TAG0        TO WS-BUSINESS-PROCESS-MODE
221300160209               GO TO GBT-EXIT
221400160209           END-IF.
221500160220           INSPECT COMM-BUSINESS-PROCESS   TALLYING WS-COUNT-2
221600160220                  FOR ALL  TER-PAC-TAG0
221700160220           IF WS-COUNT-2 > ZEROES
221800160220               MOVE "Y" TO lc_TerAwdPACFlag
221900160220               MOVE  TER-PAC-TAG0        TO WS-BUSINESS-PROCESS-MODE
222000160220               GO TO GBT-EXIT
222100160220           END-IF.
222200160209      *RFS 151550 - End
222300160209
222400180208      *RFS174736 - Start
222500180208           MOVE ZEROES TO WS-COUNT-1.
222600180208           MOVE ZEROES TO WS-COUNT-2.
222700180208           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
222800180208                  FOR CHARACTERS BEFORE INITIAL ADD-MOD-FEE0.
222900180208           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
223000180208                 FOR CHARACTERS BEFORE INITIAL ADD-MOD-FEE1.
223100180208           IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
223200180208                                               WS-SIZE-32766)
223300180208               MOVE "Y" TO lc_AddModFee
223400180208               MOVE  ADD-MOD-FEE0   TO  WS-BUSINESS-PROCESS-MODE
223500180208               GO TO GBT-EXIT
223600180208           END-IF.
223700180208      *RFS174736 - End
223800180208
223900210128      *RFS186088 - Start
224000210128           MOVE ZEROES TO WS-COUNT-1.
224100210128           MOVE ZEROES TO WS-COUNT-2.
224200210128           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-1
224300210128                  FOR CHARACTERS BEFORE INITIAL ADD-MOD-CDI0.
224400210128           INSPECT COMM-BUSINESS-PROCESS TALLYING WS-COUNT-2
224500210128                 FOR CHARACTERS BEFORE INITIAL ADD-MOD-CDI1.
224600210128           IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
224700210128                                               WS-SIZE-32766)
224800210128               MOVE "Y" TO lc_AddModCDICFlag
224900210128               MOVE  ADD-MOD-CDI0   TO  WS-BUSINESS-PROCESS-MODE
225000210128               GO TO GBT-EXIT
225100210128           END-IF.
225200210128      *RFS186088 - End
225300210128
225400040501       GBT-NOT-SUPPORTED.
225500040429           MOVE "PAR11"               TO COMM-ERROR-PTR.
225600040428           MOVE ERR-XML-NOT-SUPPORTED TO COMM-RETURN-DESC.
225700040428           PERFORM ESG-REJECTION THRU ERJ-EXIT.
225800010926
225900010926       GBT-EXIT.
226000010926           EXIT.
226100010926      /
226200030211       GET-ACCOUNT-LOOKUP.
226300000000      *****************************************************************
226400010926      *    G E T    A C C O U N T    L O O K U P                      *
226500000000      *****************************************************************
226600040501           MOVE ZEROES TO COMM-ACCOUNT-NO.
226700000000           MOVE ZEROES TO WS-LENGTH-1
226800000000                          WS-LENGTH-2
226900000000                          WS-COUNT-1
227000130529                          WS-COUNT-2.
227100040501      **** AcctSetup Start.
227200040511           MOVE SPACES TO WS-ACCTSETUP-FLAG.
227300030425           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
227400030425                   FOR CHARACTERS BEFORE INITIAL ACCT-SETUP-TAG0.
227500030425           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
227600030425                   FOR CHARACTERS BEFORE INITIAL ACCT-SETUP-TAG1.
227700030507           IF (WS-COUNT-1 >= WS-SIZE-32766 OR WS-COUNT-2>=
227800030507                                                 WS-SIZE-32766)
227900030425              GO TO GAL-ACCT-LOOKUP
228000030425           END-IF.
228100030425
228200030425           MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2
228300030425                          WS-COUNT-1  WS-COUNT-2.
228400030425
228500030425           UNSTRING WS-MESSAGE DELIMITED
228600030427                    BY ACCT-SETUP-TAG0 OR ACCT-SETUP-TAG1
228700030530              INTO WS-TEMP-FIELD-1-20000 COUNT IN WS-LENGTH-1
228800090331R60351**           WS-TEMP-FIELD-2-20000 COUNT IN WS-LENGTH-2
228900090331                   COMM-BUSINESS-PROCESS-2 COUNT IN WS-LENGTH-2
229000030425           END-UNSTRING.
229100030427           IF WS-LENGTH-2 IS NOT = ZEROES
229200130304114676     OR (lc_AddNewAcctFlag = ncc-Yes)
229300090331R60351**      MOVE WS-TEMP-FIELD-2-20000(1:WS-LENGTH-2)
229400090331R60351**        TO COMM-BUSINESS-PROCESS-2
229500030425              MOVE "Y" TO  WS-ACCTSETUP-FLAG
229600030425           ELSE
229700040511              MOVE "PAR12" TO COMM-ERROR-PTR
229800040428              MOVE ERR-XML-MIS-ACCT-SETUP  TO COMM-RETURN-DESC
229900040428              PERFORM ESG-REJECTION THRU ERJ-EXIT
230000030425              GO TO GAL-EXIT
230100030425           END-IF.
230200030425
230300030425           GO TO GAL-EXIT.
230400030425
230500030425       GAL-ACCT-LOOKUP.
230600110520      *** RFS92487.1 - Starts
230700110520           CONTINUE.
230800110520      *** RFS92487.1 - Ends
230900030425
231000030523       GAL-ACCT-LOOKUP-TAG.
231100040501      **** Account Lookup Tag
231200030505           MOVE ZEROES TO WS-COUNT-1.
231300030505           MOVE ZEROES TO WS-COUNT-2.
231400010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
231500010926                   FOR CHARACTERS BEFORE INITIAL ACCT-LOOKUP-TAG0.
231600010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
231700010926                   FOR CHARACTERS BEFORE INITIAL ACCT-LOOKUP-TAG1.
231800030507           IF (WS-COUNT-1 >= WS-SIZE-32766 OR WS-COUNT-2>=
231900030507                                                WS-SIZE-32766)
232000040429              MOVE "PAR13"                 TO COMM-ERROR-PTR
232100040428              MOVE ERR-XML-MIS-ACCT-LKUP   TO COMM-RETURN-DESC
232200040428              PERFORM ESG-REJECTION THRU ERJ-EXIT
232300010926              GO TO GAL-EXIT
232400010926           END-IF.
232500030408
232600160705      * RFS 160405 - Start
232700160705      * Account Designation
232800160705           MOVE ZEROES TO WS-COUNT-1.
232900160705           MOVE ZEROES TO WS-COUNT-2.
233000160705           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
233100160705                   FOR CHARACTERS BEFORE INITIAL ACCT-DESIG-TAG0.
233200160705           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
233300160705                   FOR CHARACTERS BEFORE INITIAL ACCT-DESIG-TAG1.
233400160705           IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
233500160705                                                    WS-SIZE-32766)
233600160705              MOVE ZEROES TO WS-LENGTH-1
233700160705                             WS-LENGTH-2
233800160705              UNSTRING WS-MESSAGE DELIMITED
233900160705                          BY ACCT-DESIG-TAG0 OR ACCT-DESIG-TAG1
234000160705                  INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
234100160705                       WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
234200160705              END-UNSTRING
234300160705              IF WS-LENGTH-2 IS NOT = ZEROES
234400160705                 MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
234500160705                           TO ACCOUNT-DESIGNATION OF ESG-OE-DTL-REC
234600160705              END-IF
234700160705           END-IF.
234800160705      * RFS 160405 - End
234900040501      **** Fund Account Lookup
235000010926           MOVE ZEROES TO WS-COUNT-1.
235100010926           MOVE ZEROES TO WS-COUNT-2.
235200010926           INSPECT WS-MESSAGE TALLYING WS-COUNT-1
235300000000                   FOR CHARACTERS BEFORE INITIAL FUND-ACCT-TAG0.
235400010927           INSPECT WS-MESSAGE TALLYING WS-COUNT-2
235500010926                   FOR CHARACTERS BEFORE INITIAL FUND-ACCT-TAG1.
235600030507           IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
235700030507                                                    WS-SIZE-32766)
235800010926              GO TO GAL-ACCOUNT
235900000000           END-IF.
236000030408
236100040501      **** Invalid Account Lookup Tag
236200040429           MOVE "PAR14"               TO COMM-ERROR-PTR.
236300040428           MOVE ERR-XML-MIS-ACCT-LKUP TO COMM-RETURN-DESC.
236400040428           PERFORM ESG-REJECTION THRU ERJ-EXIT.
236500010926           GO TO GAL-EXIT.
236600000000
236700010926       GAL-ACCOUNT.
236800000000           MOVE ZEROES TO WS-LENGTH-1
236900000000                          WS-LENGTH-2
237000000000                          WS-COUNT-1
237100000000                          WS-COUNT-2.
237200000000
237300010926           UNSTRING WS-MESSAGE DELIMITED
237400000000                    BY FUND-ACCT-TAG0 OR FUND-ACCT-TAG1
237500030214              INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
237600030214                   WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
237700000000           END-UNSTRING.
237800010926           IF WS-LENGTH-2 IS NOT = ZEROES AND
237900030214              WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2) IS NUMERIC
238000040501              MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
238100040511                TO FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
238200000000           ELSE
238300040511              MOVE "PAR15" TO COMM-ERROR-PTR
238400040428              MOVE ERR-XML-INV-FND-ACCT-ID TO COMM-RETURN-DESC
238500040428              PERFORM ESG-REJECTION THRU ERJ-EXIT
238600010926              GO TO GAL-EXIT
238700000000           END-IF.
238800040501
238900040501           UNSTRING FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
239000040501           DELIMITED BY " " INTO WS-ACCOUNT-NO-JRIGHT.
239100040501
239200040501           INSPECT WS-ACCOUNT-NO-JRIGHT REPLACING ALL " " BY "0".
239300040501
239400040501           IF WS-ACCOUNT-NO-JRIGHT NOT NUMERIC
239500040501               MOVE "999999999" TO WS-ACCOUNT-NO-JRIGHT
239600040501           END-IF.
239700040501
239800040501           MOVE WS-ACCOUNT-NO-JRIGHT TO COMM-ACCOUNT-NO.
239900040501
240000040501           IF WS-ACCOUNT-NO-JRIGHT IS EQUAL TO "000000000"
240100040501             MOVE SPACES TO FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
240200040501           END-IF.
240300000000
240400040511           MOVE COMM-ACCOUNT-NO TO ACCOUNT-NO OF ACCOUNT-REC.
240500040511
240600010926       GAL-EXIT.
240700000000           EXIT.
240800050607R26004/
240900050607R26004 GET-ADVISOR.
241000050607R26004*****************************************************************
241100050607R26004*    G E T    A D V I S O R                                     *
241200050607R26004*****************************************************************
241300050607R26004     MOVE ZEROES TO WS-LENGTH-1
241400050607R26004                    WS-LENGTH-2
241500050607R26004                    WS-COUNT-1
241600050607R26004                    WS-COUNT-2.
241700050607R26004
241800050607R26004 GA-ADVISOR-TAG.
241900050607R26004**** Advisor Tag
242000050607R26004     MOVE ZEROES TO WS-COUNT-1.
242100050607R26004     MOVE ZEROES TO WS-COUNT-2.
242200050607R26004     INSPECT WS-MESSAGE TALLYING WS-COUNT-1
242300050607R26004             FOR CHARACTERS BEFORE INITIAL ADVISOR-TAG0.
242400050607R26004     INSPECT WS-MESSAGE TALLYING WS-COUNT-2
242500050607R26004             FOR CHARACTERS BEFORE INITIAL ADVISOR-TAG1.
242600050607R26004     IF (WS-COUNT-1 >= WS-SIZE-32766 OR WS-COUNT-2>=
242700050607R26004                                          WS-SIZE-32766)
242800050607R26004        MOVE "PAR16"                 TO COMM-ERROR-PTR
242900050607R26004        MOVE ERR-MIS-INV-ADVISOR     TO COMM-RETURN-DESC
243000050607R26004        PERFORM ESG-REJECTION THRU ERJ-EXIT
243100050607R26004        GO TO GAL-EXIT
243200050607R26004     END-IF.
243300050607R26004
243400050607R26004     MOVE ZEROES TO WS-LENGTH-1 WS-LENGTH-2
243500050607R26004                    WS-COUNT-1  WS-COUNT-2.
243600050607R26004
243700050607R26004     UNSTRING WS-MESSAGE DELIMITED
243800050607R26004              BY ADVISOR-TAG0 OR ADVISOR-TAG1
243900050607R26004        INTO WS-TEMP-FIELD-1-20000 COUNT IN WS-LENGTH-1
244000050607R26004             WS-TEMP-FIELD-2-20000 COUNT IN WS-LENGTH-2
244100050607R26004     END-UNSTRING.
244200050607R26004     IF WS-LENGTH-2 IS NOT = ZEROES
244300050607R26004        MOVE WS-TEMP-FIELD-2-20000(1:WS-LENGTH-2)
244400050607R26004          TO WS-ADVISOR-SECTION
244500050607R26004     ELSE
244600050607R26004        MOVE "PAR16" TO COMM-ERROR-PTR
244700050607R26004        MOVE ERR-MIS-INV-ADVISOR TO COMM-RETURN-DESC
244800050607R26004        PERFORM ESG-REJECTION THRU ERJ-EXIT
244900050607R26004        GO TO GA-EXIT
245000050607R26004     END-IF.
245100050607R26004
245200050607R26004 GA-DLRCODE-TAG.
245300050607R26004**** Advisor Dealer
245400050607R26004     MOVE ZEROES TO WS-COUNT-1.
245500050607R26004     MOVE ZEROES TO WS-COUNT-2.
245600050607R26004     INSPECT WS-ADVISOR-SECTION TALLYING WS-COUNT-1
245700050607R26004             FOR CHARACTERS BEFORE INITIAL DLR-CODE-TAG0.
245800050607R26004     INSPECT WS-ADVISOR-SECTION TALLYING WS-COUNT-2
245900050607R26004             FOR CHARACTERS BEFORE INITIAL DLR-CODE-TAG1.
246000050607R26004     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
246100050607R26004                                              WS-SIZE-32766)
246200050607R26004        GO TO GA-DEALER-CODE
246300050607R26004     END-IF.
246400050607R26004
246500050607R26004 GA-DEALER-CODE.
246600050607R26004     MOVE ZEROES TO WS-LENGTH-1
246700050607R26004                    WS-LENGTH-2
246800050607R26004                    WS-COUNT-1
246900050607R26004                    WS-COUNT-2.
247000050607R26004
247100050607R26004     UNSTRING WS-ADVISOR-SECTION DELIMITED
247200050607R26004              BY DLR-CODE-TAG0 OR DLR-CODE-TAG1
247300050607R26004        INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
247400050607R26004             WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
247500050607R26004     END-UNSTRING.
247600050607R26004     IF WS-LENGTH-2 IS NOT = ZEROES
247700050607R26004        MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
247800050607R26004          TO ADVISOR-DEALER-CODE
247900050607R26004     ELSE
248000050607R26004        MOVE "PAR17" TO COMM-ERROR-PTR
248100050607R26004        MOVE ERR-INVALID-DLR TO COMM-RETURN-DESC
248200050607R26004        PERFORM ESG-REJECTION THRU ERJ-EXIT
248300050607R26004        GO TO GA-EXIT
248400050607R26004     END-IF.
248500060315
24860006031529614 * If the XML message is ModBulkRep, don't check if the from dealer
24870006031529614 * exists in the system or not.
24880006031529614      IF lc-ModBulkRepFlag = ncc-Yes
24890006031529614         GO TO Ga-Repcode-Tag
24900006031529614      END-IF.
249100051117
249200051117R29004**** Validate dealer code.
249300051117  ¦        MOVE ADVISOR-DEALER-CODE TO DEALER-CODE OF DEALER-REC.
249400051117  ¦        READ DEALER
249500051117  ¦         INVALID KEY
249600051117  ¦           MOVE "PAR19" TO COMM-ERROR-PTR
249700051117  ¦           MOVE ERR-INVALID-DLR TO COMM-RETURN-DESC
249800051117  ¦           PERFORM ESG-REJECTION THRU ERJ-EXIT
249900051117  ¦           GO TO GA-EXIT
250000051117  ¦        END-READ.
250100051117R29004******
250200051117
250300050607R26004 GA-REPCODE-TAG.
250400050607R26004**** Advisor Rep
250500050607R26004     MOVE ZEROES TO WS-COUNT-1.
250600050607R26004     MOVE ZEROES TO WS-COUNT-2.
250700050607R26004     INSPECT WS-ADVISOR-SECTION TALLYING WS-COUNT-1
250800050607R26004             FOR CHARACTERS BEFORE INITIAL REP-CODE-TAG0.
250900050607R26004     INSPECT WS-ADVISOR-SECTION TALLYING WS-COUNT-2
251000050607R26004             FOR CHARACTERS BEFORE INITIAL REP-CODE-TAG1.
251100050607R26004     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
251200050607R26004                                              WS-SIZE-32766)
251300050607R26004        GO TO GA-REP-CODE
251400050607R26004     END-IF.
251500050607R26004
251600050607R26004 GA-REP-CODE.
251700050607R26004     MOVE ZEROES TO WS-LENGTH-1
251800050607R26004                    WS-LENGTH-2
251900050607R26004                    WS-COUNT-1
252000050607R26004                    WS-COUNT-2.
252100050607R26004
252200050607R26004     UNSTRING WS-ADVISOR-SECTION DELIMITED
252300050607R26004              BY REP-CODE-TAG0 OR REP-CODE-TAG1
252400050607R26004        INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
252500050607R26004             WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
252600050607R26004     END-UNSTRING.
252700050607R26004     IF WS-LENGTH-2 IS NOT = ZEROES
252800050607R26004        MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
252900050607R26004          TO ADVISOR-DEALER-REP-CODE
253000050607R26004     ELSE
253100050607R26004        MOVE "PAR18" TO COMM-ERROR-PTR
253200050607R26004        MOVE ERR-INVALID-REP TO COMM-RETURN-DESC
253300050607R26004        PERFORM ESG-REJECTION THRU ERJ-EXIT
253400050607R26004        GO TO GA-EXIT
253500050607R26004     END-IF.
253600050607R26004
253700050607R26004 GA-BRANCHCODE-TAG.
253800050607R26004**** Advisor BranchCode
253900050607R26004     MOVE ZEROES TO WS-COUNT-1.
254000050607R26004     MOVE ZEROES TO WS-COUNT-2.
254100050607R26004     INSPECT WS-ADVISOR-SECTION TALLYING WS-COUNT-1
254200050607R26004             FOR CHARACTERS BEFORE INITIAL BRANCHCODE-TAG0.
254300050607R26004     INSPECT WS-ADVISOR-SECTION TALLYING WS-COUNT-2
254400050607R26004             FOR CHARACTERS BEFORE INITIAL BRANCHCODE-TAG1.
254500050607R26004     IF (WS-COUNT-1 < WS-SIZE-32766 AND WS-COUNT-2 <
254600050607R26004                                              WS-SIZE-32766)
254700050607R26004        GO TO GA-BRANCHCODE
254800050607R26004     END-IF.
254900050607R26004
255000050607R26004 GA-BRANCHCODE.
255100050607R26004     MOVE ZEROES TO WS-LENGTH-1
255200050607R26004                    WS-LENGTH-2
255300050607R26004                    WS-COUNT-1
255400050607R26004                    WS-COUNT-2.
255500050607R26004
255600050607R26004     UNSTRING WS-ADVISOR-SECTION DELIMITED
255700050607R26004              BY BRANCHCODE-TAG0 OR BRANCHCODE-TAG1
255800050607R26004        INTO WS-TEMP-FIELD-1-5000 COUNT IN WS-LENGTH-1
255900050607R26004             WS-TEMP-FIELD-2-5000 COUNT IN WS-LENGTH-2
256000050607R26004     END-UNSTRING.
256100050607R26004     IF WS-LENGTH-2 IS NOT = ZEROES
256200050607R26004        MOVE WS-TEMP-FIELD-2-5000(1:WS-LENGTH-2)
256300050607R26004          TO ADVISOR-BRANCH-CODE
256400050607R26004     END-IF.
256500050607R26004
256600050607R26004 GA-EXIT.
256700050607R26004     EXIT.
256800010925      /
256900110411      *RFS 92487 Start
257000110520      *** RFS92487.1 - Starts
257100110520     **CheckDealerRep-NONFU-Attibute.
257200110520       CheckDealerRep-NOAMR-Attibute.
257300110411      *****************************************************************
257400110520      *    Check Dealer Rep code  for NOAMR  Attribute                *
257500110411      *****************************************************************
257600110520      *****INITIALIZE lc-NONFU-RowExists.
257700110520           INITIALIZE lc-NOAMR-RowExists.
257800110411           MOVE ADVISOR-DEALER-CODE       TO lc-DealerCode.
257900110411           MOVE ADVISOR-DEALER-REP-CODE   TO lc-DealerRepCode.
258000110411
258100110411           EXEC SQL
258200110411            SELECT "Y"
258300110520      ******INTO :lc-NONFU-RowExists
258400110520            INTO :lc-NOAMR-RowExists
258500110411            FROM  MFADRAATP
258600110411            WHERE
258700110411                DEALER_CODE               = :lc-DealerCode
258800110411            AND DEALER_REP_CODE           = :lc-DealerRepCode
258900110520      ******AND DEALER_REP_ATTRIBUTE_CODE = :lncc_NONFU
259000110520            AND DEALER_REP_ATTRIBUTE_CODE = :lncc_NOAMR
259100110411           END-EXEC
259200110411
259300110411           MOVE SQLSTATE TO lc_sqlStates.
259400110411           EVALUATE TRUE
259500110411              WHEN lncc_sqlSuccessful
259600110411                 MOVE lncc_PAR20 TO COMM-ERROR-PTR
259700110520      *** RFS92487.1 - Starts
259800110520      ***********MOVE lc-InappDealerCode-350  TO COMM-RETURN-DESC
259900110520                 MOVE ERR-NOT-AUT-PLC-EO      TO COMM-RETURN-DESC
260000110520      *** RFS92487.1 - Ends
260100110411                 DISPLAY COMM-ERROR-PTR
260200110411                 PERFORM ESG-REJECTION THRU ERJ-EXIT
260300110411                 GO TO CDRNA-EXIT
260400110411              WHEN OTHER
260500110411                 CONTINUE
260600110411           END-EVALUATE.
260700110520      *** RFS92487.1 - Ends
260800110411
260900110411       CDRNA-EXIT.
261000110411              EXIT.
261100110411      /
261200110411      *RFS 92487 End
261300110411
261400010925       BUSINESS-CALL-ROUTINE.
261500010925      *****************************************************************
261600010926      *    B U S I N E S S    C A L L     R O U T I N T E             *
261700010925      *****************************************************************
261800050607R28015****Start
261900050607R26599***** Start
262000050607      ***** Override files for Advisory updates to Global library.
262100050607      ***   PERFORM CHECK-OVERRIDE THRU CO-EXIT.
262200050607R26599***** End
262300050607R28015****End
262400100223
262500100223      **** R72399 - Begin
262600100310            IF ncc-CusipProcess
262700100304               PERFORM LOAD-CUSIP-INFO
262800100223            END-IF.
262900100223      **** R72399 - End
263000100223
263100010925           IF WS-BUSINESS-FOUND IS = "Y" AND
263200010925              WS-NAME-FLAG IS = "Y"
263300040501              CALL "ESGPCLTINF"
263400010925           END-IF.
263500030404
263600010925           IF WS-BUSINESS-FOUND IS = "Y" AND
263700010925              WS-ADDRESS-FLAG IS = "Y"
263800040501              CALL "ESGPADDINF"
263900010925           END-IF.
264000030404
264100010925           IF WS-BUSINESS-FOUND IS = "Y" AND
264200010925              WS-ACCT-ATTRIB-FLAG IS = "Y"
264300040501              CALL "ESGPACCATT"
264400010925           END-IF.
264500010926
264600020418           IF WS-BUSINESS-FOUND IS = "Y" AND
264700020418              WS-DISTRIBUTION-FLAG IS = "Y"
264800040501              CALL "ESGPDISINF"
264900020418           END-IF.
265000020905
265100040501           IF WS-BUSINESS-FOUND IS = "Y" AND
265200020905              WS-BENE-FLAG IS = "Y"
265300040501              CALL "ESGPBENINF"
265400020905           END-IF.
265500030422
265600040501           IF WS-BUSINESS-FOUND IS = "Y" AND
265700030422              WS-ADDPAC-FLAG IS = "Y"
265800040501              CALL "ESGPADDPAC"
265900030422           END-IF.
266000050607R26004
266100050607R26004     IF WS-BUSINESS-FOUND IS = "Y" AND
266200050607R26004        WS-ADDMODREP-FLAG IS = "Y"
266300050607R26004        CALL "ESGPREPDTL"
266400050607R26004     END-IF.
266500050607R26004
266600050607R26004     IF WS-BUSINESS-FOUND IS = "Y" AND
266700050607R26004        WS-INAREP-FLAG IS = "Y"
266800050607R26004        CALL "ESGPINAREP"
266900050607R26004     END-IF.
267000050607
26710006030229614      IF Ws-Business-Found = ncc-Yes AND
26720006030229614         lc-ModBulkRepFlag = ncc-Yes
26730006030229614         CALL "NFUDERCHG"
26740006030229614      END-IF.
267500110306
267600110306      *Rfs84184 - Start
267700110306           IF Ws-Business-Found = ncc-Yes
267800110306           AND Add-TFSA-Successor
267900110306              CALL "ESGTFSASUC"
268000110306           END-IF.
268100110306      *Rfs84184 - End
268200131011      *RFS121109-Start
268300131011           IF WS-BUSINESS-FOUND IS = "Y" AND
268400131011              WS-FATCA-FLAG IS = "Y"
268500170406164272*       CALL "ESGUPFATCA"
268600170406  |           COMPUTE li_ReqLen  =
268700170406  |                   FUNCTION LENGTH(FUNCTION TRIM(WS-MESSAGE))
268800170406  |           CALL "ESGFATCRSP"  USING WS-MESSAGE,
268900170406  |                                   li_ReqLen,
269000170406164272                                lc_XMLErrCode
269100131011           END-IF.
269200131011      *RFS121109-End
269300060302
269400160209      *RFS 151550 - Start
269500160215           IF WS-BUSINESS-FOUND IS = "Y" AND
269600160215              lc_AddAwdFlag = "Y"
269700160215              COMPUTE li_ReqLen  =
269800160215                      FUNCTION LENGTH(FUNCTION TRIM(WS-MESSAGE))
269900160215              CALL "ESGADDAWD"  USING WS-MESSAGE,
270000160215                                      li_ReqLen,
270100160215                                      lc_XMLErrCode
270200160215           END-IF.
270300160219
270400160219           IF WS-BUSINESS-FOUND IS = "Y" AND
270500160219              lc_TerAwdPACFlag = "Y"
270600160219              COMPUTE li_ReqLen  =
270700160219                      FUNCTION LENGTH(FUNCTION TRIM(WS-MESSAGE))
270800160219              CALL "TERAWDPAC"  USING WS-MESSAGE,
270900160219                                      li_ReqLen,
271000160219                                      lc_XMLErrCode
271100160219           END-IF.
271200160209      *RFS 151550 - End
271300180208
271400180208      *RFS147360 - Start
271500180208           IF WS-BUSINESS-FOUND IS = "Y" AND
271600180208              lc_AddModFee  = "Y"
271700180209              COMPUTE li_ReqLen  =
271800180209                      FUNCTION LENGTH(FUNCTION TRIM(WS-MESSAGE))
271900180209              CALL "ESGADDFEE"  USING WS-MESSAGE,
272000180209                                      li_ReqLen,
272100180209                                      lc_XMLErrCode
272200180208           END-IF.
272300180208      *RFS147360 - End
272400160209
272500210128      *RFS186088 - Start
272600210128           IF WS-BUSINESS-FOUND IS = "Y" AND
272700210128              lc_AddModCDICFlag = "Y"
272800210128              COMPUTE li_ReqLen  =
272900210128                      FUNCTION LENGTH(FUNCTION TRIM(WS-MESSAGE))
273000210202              CALL "ESGADDCDIC"  USING WS-MESSAGE,
273100210202                                       li_ReqLen,
273200210202                                       lc_XMLErrCode
273300210128           END-IF.
273400210128      *RFS186088 - End
273500210128
273600010926       BCR-EXIT.
273700010925           EXIT.
273800040428
273900040428       ACCOUNT-LOOKUP.
274000040428      *****************************************************************
274100040428      *    A C C O U N T   L O O K U P  - ESGLOOKUP                   *
274200040428      *****************************************************************
274300040428           IF WS-ACCTSETUP-FLAG = "Y"
274400040428              CALL "ESGPACCSET"
274500040428              GO TO AL-EXIT
274600040428           END-IF.
274700040428
274800040428      ** Get <Fund> information for MODDISTRIBUTION
274900040428           IF WS-DISTRIBUTION-FLAG NOT = "Y"
275000040428              GO TO AL-SKIP-FUND-ID
275100040428           END-IF.
275200040428
275300040501           CALL "XXMPFND" USING COMM-BUSINESS-PROCESS.
275400040428
275500040428
275600040428       AL-SKIP-FUND-ID.
275700040501           MOVE SPACES TO COMM-PROCESS-OPTION.
275800040501           IF WS-DISTRIBUTION-FLAG IS = "Y"
275900040501              MOVE "AIV"  TO COMM-PROCESS-OPTION
276000040501           ELSE
276100040501              MOVE "IVR"  TO COMM-PROCESS-OPTION
276200031022           END-IF.
276300070315
276400070315      * RFS - 38247 - begins.
276500070315      * Setup Investor Split Parameters and call Investor Split module.
276600070315
276700070315           INITIALIZE pc_Investor_Split_Parms.
276800070315           MOVE Comm-Account-No                    TO pn_Account_No.
276900070703R40090     MOVE ZEROES                             TO pn_Investor_No.
277000070315           MOVE lncc_MSG                           TO pc_MSG_Prefix.
277100070315           MOVE Network-Order-No OF Esg-OE-Dtl-Rec TO pc_MSG_Id.
277200070627R40090     MOVE lncc_FSRVNFU                       TO pc_Called_From.
277300070315           MOVE lncc_00                            TO pc_Return_Code.
277400070315           IF Ws-Name-Flag = lncc_Y
277500070315              MOVE lncc_CLT                        TO pc_XML_MSG_Type
277600070315           END-IF.
277700070315           IF Ws-Address-Flag = lncc_Y
277800070315              MOVE lncc_ADR                        TO pc_XML_MSG_Type
277900070315           END-IF.
278000070315
278100070315           IF Ws-Business-Found = lncc_Y AND
278200200720101025*      (Ws-Name-Flag = lncc_Y OR  Ws-Address-Flag = lncc_Y)
278300200720101025       (Ws-Name-Flag = lncc_Y OR VALID-ADDRESS-SPLT)
278400070315              CALL "FXIVRSPLT" USING pc_Investor_Split_Parms
278500070315           END-IF.
278600070315
278700070315           IF pc_Return_Code = lncc_99
278800070316              MOVE lncc_PAR10             TO Comm-Error-Ptr
278900070316              MOVE Err-Dbase-Not-Availab  TO Comm-Return-Desc
279000070316              PERFORM ESG-REJECTION THRU ERJ-EXIT
279100070315              GO TO AL-EXIT
279200070315           END-IF.
279300070315      * RFS - 38247 - ends.
279400201202
279500201202      *RFS186497 Starts
279600201202           IF WS-BUSINESS-FOUND IS = "Y"  AND
279700201202              WS-FATCA-FLAG IS NOT = "Y"  AND
279800201202              WS-ACCTSETUP-FLAG NOT = "Y"
279900201202              IF (ex-FATCAModule = "Y" OR ex-CRSModule = "Y")
280000201202                 SET lb_FatcaValidation_Type1 TO TRUE
280100201202                 CALL "ESGFATCRSV"
280200201202              END-IF
280300201202           END-IF.
280400201208
280500201202      *RFS186497 Ends
280600070315
280700100223      ** R72399 - Begin
280800100310           IF ncc-CusipProcess
280900100223               GO TO AL-EXIT
281000100223           END-IF.
281100100223      ** R72399 - End
281200040501           CALL "ESGLOOKUP".
281300201205
281400201208           PERFORM COMMON-VALIDATION THRU CV-EXIT
281500040501
281600040501       AL-EXIT.
281700040501           EXIT.
281800040501
281900040428       COMMON-VALIDATION.
282000040428      *****************************************************************
282100040428      *    C O M M O N   V A L I D A T I O N                          *
282200040428      *****************************************************************
282300040428      **** This program checks common edits for all business type.
282400040501           CALL  "ESGXMLERR".
282500040501
282600040428           IF COMM-RETURN-CODE = "99"
282700040429              MOVE "PAR17"              TO COMM-ERROR-PTR
282800040428              MOVE ERR-XML-INV-SRC-CODE TO COMM-RETURN-DESC
282900040428              PERFORM ESG-REJECTION THRU ERJ-EXIT
283000040428              GO TO CV-EXIT
283100040428           END-IF.
283200040428
283300160614      *Rfs160643 - Start
283400160614           IF NOMINEE OF ACCOUNT-REC = "N"
283500190401181062*    AND (lc_AddAwdFlag = "Y" OR
283600190401181062*         lc_TerAwdFlag = "Y")
283700190401              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC
283800160614                   TO lc_AccType
283900190401              MOVE ZEROES  TO  ln_Count3
284000190401181062        IF   lc_TerAwdFlag = "Y"
284100160614              EXEC SQL
284200160614               SELECT COUNT(XACTCP.ACCOUNT_TYPE_CODE)
284300160614                 INTO :ln_Count3
284400160614                 FROM MFAXACTCP XACTCP
284500160614                WHERE XACTCP.PROGRAM_CODE  = :WS-PROGRAM-CODE  AND
284600160614                      XACTCP.ACCOUNT_TYPE_CODE = :lc_AccType   AND
284700160614                      XACTCP.NOMINEE_ACCOUNT_TYPE = " "        AND
284800160614                      TRIM(XACTCP.EXTERNAL_ACCOUNT_TYPE_CODE)
284900190401                      IN ("04", "10", "12", "14", "19")
285000190401              END-EXEC
285100190401      *RFS181062 Starts
285200190401              ELSE IF lc_AddAwdFlag =  "Y"
285300190401                EXEC SQL
285400190401                  SELECT COUNT(XACTCP.ACCOUNT_TYPE_CODE)
285500190401                    INTO :ln_Count3
285600190401                    FROM MFAXACTCP XACTCP
285700190401                    WHERE XACTCP.PROGRAM_CODE  = :WS-PROGRAM-CODE  AND
285800190401                          XACTCP.ACCOUNT_TYPE_CODE = :lc_AccType   AND
285900190401                          XACTCP.NOMINEE_ACCOUNT_TYPE = " "        AND
286000190401                          TRIM(XACTCP.EXTERNAL_ACCOUNT_TYPE_CODE)
286100190401                          IN ("10", "12", "14", "19")
286200190401                END-EXEC
286300190401              END-IF
286400190401              END-IF
286500190401      *RFS181062 Ends
286600160614
286700160614              IF ln_Count3  > ZEROES
286800160614                 MOVE "PAR10"                 TO COMM-ERROR-PTR
286900160614                 MOVE ERR-XML-NOT-SUPPORTED   TO COMM-RETURN-DESC
287000160614                 PERFORM ESG-REJECTION THRU ERJ-EXIT
287100160614                 DISPLAY "Rejected --> "  COMM-ERROR-PTR
287200160614              END-IF
287300160614
287400160614           END-IF.
287500160614      *Rfs160643 - End
287600201109
287700160614
287800040428       CV-EXIT.
287900040428           EXIT.
288000040428      /
288100040511      *******************************
288200040511      *** CopyBooks - Routines    ***
288300040511      *******************************
288400040428       COPY CPYOERES.
288500040428      /
288600030211       WRITE-RESPONSE.
288700010925      *****************************************************************
288800010926      *    W R I T E    R E S P O N S E    R O U T I N E              *
288900040429      *    Write response messages and NFU Logs.                      *
289000010925      *****************************************************************
289100170329      * RFS 169193-Start
289200170329169193     PERFORM NFULGP-COMMONLOGIC.
289300170329      *    INITIALIZE MFANFULGP OF NFU-ESG-LOG-REC.
289400170329      *
289500170329      *    MOVE INVESTOR-NO OF INVESTOR-REC
289600170329      *      TO INVESTOR-NO OF NFU-ESG-LOG-REC.
289700170329      *    MOVE ACCOUNT-NO OF ACCOUNT-REC
289800170329      *      TO ACCOUNT-NO OF NFU-ESG-LOG-REC.
289900170329      *    MOVE CLERK-ID OF ESG-OE-DTL-REC
290000170329      *      TO AUDIT-USER OF NFU-ESG-LOG-REC.
290100170329      *    MOVE "N" TO AUDIT-STATUS OF NFU-ESG-LOG-REC.
290200170329      *    MOVE "PARSER" TO SCREEN-CODE OF NFU-ESG-LOG-REC
290300170329      *                     SECTION-ID OF NFU-ESG-LOG-REC.
290400170329      *    MOVE SOURCE-NUMBER-2 OF ESG-OE-DTL-REC
290500170329      *      TO MESSAGE-IDENTIFIER OF NFU-ESG-LOG-REC.
290600170329      *    MOVE COMM-SYSDATE TO AUDIT-DATE OF NFU-ESG-LOG-REC.
290700170329      *    MOVE COMM-SYSTIME-HHMMSS TO LOG-TIME OF NFU-ESG-LOG-REC.
290800170329      *
290900170329      *    IF COMM-MSG-DTL = SPACE
291000170329      *       MOVE COMM-BUSINESS-PROCESS
291100170329      *         TO DETAIL-SECTION OF NFU-ESG-LOG-REC
291200170329      *    END-IF.
291300170329      * RFS 169193-End
291400040423
291500130301
291600040511           IF COMM-RETURN-CODE = "99"
291700100310      *** R72399 - Begin
291800100310              IF NOT ncc-CusipProcess
291900100310                 ROLLBACK
292000100310              END-IF
292100100310      *** R72399 - End
292200040804              PERFORM WRITE-RESPONSE-F99 THRU WRF99-EXIT
292300040429           ELSE
292400040511              PERFORM WRITE-RESPONSE-F00 THRU WRF00-EXIT
292500040429           END-IF.
292600040804
292700100314           COMMIT.
292800100310
292900010926       WRR-EXIT.
293000010925           EXIT.
293100040422      /
293200040429       WRITE-RESPONSE-F99.
293300040429      *****************************************************************
293400040429      * Write response message for rejected request                  *
293500040429      *****************************************************************
293600040429            COMPUTE WS-REJ-CNT = INDX-REJ.
293700040429            COMPUTE INDX-REJ = 0.
293800040429
293900040429           STRING RSPNSRC-TAG0        DELIMITED BY SIZE
294000040429                  "F"                 DELIMITED BY SIZE
294100040429                  RSPNSRC-TAG1        DELIMITED BY SIZE
294200040429                  RTNCODE-TAG0        DELIMITED BY SIZE
294300040429                    "99"              DELIMITED BY SIZE
294400040429                  RTNCODE-TAG1        DELIMITED BY SIZE
294500040429                  ERRORS-TAG0         DELIMITED BY "  "
294600040429               INTO WS-RESPONSE
294700040429               WITH POINTER WS-RESPONSE-POINTER
294800040429            END-STRING.
294900040429
295000040429       WRF99-NEXT.
295100040429           ADD 1 TO INDX-REJ.
295200040429
295300040429           IF INDX-REJ > WS-REJ-CNT
295400040429              GO TO WRF99-END
295500040429           END-IF.
295600040429
295700170329169193     PERFORM NFULGP-COMMONLOGIC.
295800040511           MOVE ERROR-MESSAGE OF ESG-OE-RESPONSE-REJ-REC(INDX-REJ)
295900040511             TO DETAIL-SECTION OF NFU-ESG-LOG-REC.
296000040511
296100040511           MOVE RETURN-CODE-DDS OF ESG-OE-RESPONSE-REJ-REC(INDX-REJ)
296200040511             TO RETURN-CODE-DDS OF NFU-ESG-LOG-REC.
296300040511
296400040511           MOVE MSG-CODE1 OF ESG-OE-RESPONSE-REJ-REC(INDX-REJ)
296500040511             TO REJECTION-CODE OF NFU-ESG-LOG-REC.
296600040429
296700040511           IF ERROR-MESSAGE OF ESG-OE-RESPONSE-REJ-REC(INDX-REJ)
296800040511                                                   NOT = SPACES
296900040429              STRING ERRORDETAILS-TAG0       DELIMITED BY SIZE
297000040429                     ERRORCODE-TAG0          DELIMITED BY SIZE
297100040511                     MSG-CODE1 OF ESG-OE-RESPONSE-REJ-REC(INDX-REJ)
297200040429                                             DELIMITED BY "  "
297300040429                     ERRORCODE-TAG1          DELIMITED BY SIZE
297400040429                     FIELD-TAG0              DELIMITED BY SIZE
297500040511                     ERROR-MESSAGE OF ESG-OE-RESPONSE-REJ-REC(INDX-REJ)
297600040429                                             DELIMITED BY "  "
297700040429                     FIELD-TAG1              DELIMITED BY SIZE
297800040429                     ERRORDETAILS-TAG1       DELIMITED BY SIZE
297900040429                INTO WS-RESPONSE
298000040429                WITH POINTER WS-RESPONSE-POINTER
298100040429              END-STRING
298200040429           ELSE
298300040429              STRING ERRORDETAILS-TAG0       DELIMITED BY SIZE
298400040429                     ERRORCODE-TAG0          DELIMITED BY SIZE
298500040511                     MSG-CODE1 OF ESG-OE-RESPONSE-REJ-REC(INDX-REJ)
298600040429                                             DELIMITED BY SPACE
298700040429                     ERRORCODE-TAG1          DELIMITED BY SIZE
298800040429                     ERRORDETAILS-TAG1       DELIMITED BY SIZE
298900040429                INTO WS-RESPONSE
299000040429                WITH POINTER WS-RESPONSE-POINTER
299100040429              END-STRING
299200040429           END-IF.
299300040429
299400040511           WRITE NFU-ESG-LOG-REC.
299500040511
299600040429           GO TO WRF99-NEXT.
299700040429
299800040429       WRF99-END.
299900040429           STRING ERRORS-TAG1          DELIMITED BY SIZE
300000040429                  RESPONSE-TAG1        DELIMITED BY SIZE
300100040429                  MSG-TYPE-TAG1        DELIMITED BY SIZE
300200040429                  MSG-TAG1             DELIMITED BY SIZE
300300040429             INTO WS-RESPONSE
300400040429             WITH POINTER WS-RESPONSE-POINTER
300500040429           END-STRING.
300600040429
300700040429       WRF99-EXIT.
300800040429             EXIT.
300900040429      /
301000040429       WRITE-RESPONSE-F00.
301100040429      *****************************************************************
301200040429      * Write response message for accepted request                  *
301300040429      *****************************************************************
301400050607R26004     IF WS-ADDMODREP-FLAG = "Y" OR
301500050607R26004        WS-INAREP-FLAG = "Y"
30160006030229614         OR lc-ModBulkRepFlag = ncc-Yes
301700050607R26004        STRING RSPNSRC-TAG0        DELIMITED BY SIZE
301800050607R26004               "F"                 DELIMITED BY SIZE
301900050607R26004               RSPNSRC-TAG1        DELIMITED BY SIZE
302000050607R26004               RTNCODE-TAG0        DELIMITED BY SIZE
302100050607R26004               "00"                DELIMITED BY SIZE
302200050607R26004               RTNCODE-TAG1        DELIMITED BY SIZE
302300050607R26004        INTO WS-RESPONSE
302400050607R26004             WITH POINTER WS-RESPONSE-POINTER
302500050607R26004        END-STRING
302600050607R26004     ELSE
302700050607R26004*    PERFORM FORMAT-FUND-ACCOUNT-NO THRU FFAN-EXIT.
302800050607R26004        PERFORM FORMAT-FUND-ACCOUNT-NO THRU FFAN-EXIT
302900040518
303000050607              STRING ACCTCONFIRM-TAG0    DELIMITED BY SIZE
303100050607                     FUND-ACCT-TAG0      DELIMITED BY SIZE
303200050607                     FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
303300050607                                         DELIMITED BY SPACE
303400050607                     FUND-ACCT-TAG1      DELIMITED BY SIZE
303500050607                     ACCTCONFIRM-TAG1    DELIMITED BY SIZE
303600050607                     RSPNSRC-TAG0        DELIMITED BY SIZE
303700050607                     "F"                 DELIMITED BY SIZE
303800050607                     RSPNSRC-TAG1        DELIMITED BY SIZE
303900050607                     RTNCODE-TAG0        DELIMITED BY SIZE
304000050607                     "00"                DELIMITED BY SIZE
304100050607                     RTNCODE-TAG1        DELIMITED BY SIZE
304200050607              INTO WS-RESPONSE
304300050607                   WITH POINTER WS-RESPONSE-POINTER
304400050607R26004*    END-STRING.
304500050607R26004        END-STRING
304600050607R26004     END-IF.
304700040429
304800040429           IF INDX-NSP = 0
304900040429              STRING RESPONSE-TAG1       DELIMITED BY SIZE
305000040429                     MSG-TYPE-TAG1       DELIMITED BY SIZE
305100040429                     MSG-TAG1            DELIMITED BY SIZE
305200040429                INTO WS-RESPONSE
305300040429                WITH POINTER WS-RESPONSE-POINTER
305400040429              END-STRING
305500130409114676        WRITE NFU-ESG-LOG-REC
305600040429              GO TO WRF00-EXIT
305700040429           END-IF.
305800040429
305900040429           STRING NOTSUPPRTD-TAG0 DELIMITED BY "  "
306000040429             INTO WS-RESPONSE
306100040429             WITH POINTER WS-RESPONSE-POINTER
306200040429           END-STRING.
306300040429
306400040429           COMPUTE WS-NSP-CNT = INDX-NSP.
306500040429           COMPUTE INDX-NSP = 0.
306600040429
306700040429       WRF00-NEXT.
306800040429           ADD 1 TO INDX-NSP.
306900040429
307000040429           IF INDX-NSP > WS-NSP-CNT
307100040429              GO TO WRF00-END
307200040429           END-IF.
307300170329169193     PERFORM NFULGP-COMMONLOGIC.
307400040429
307500040511           MOVE ERROR-MESSAGE OF ESG-OE-RESPONSE-NSP-REC(INDX-NSP)
307600040511             TO DETAIL-SECTION OF NFU-ESG-LOG-REC.
307700040511
307800040511           MOVE RETURN-CODE-DDS OF ESG-OE-RESPONSE-NSP-REC(INDX-NSP)
307900040511             TO RETURN-CODE-DDS OF NFU-ESG-LOG-REC.
308000040511
308100040511           MOVE MSG-CODE1 OF ESG-OE-RESPONSE-NSP-REC(INDX-NSP)
308200040511             TO REJECTION-CODE OF NFU-ESG-LOG-REC.
308300040429
308400040511           IF ERROR-MESSAGE OF ESG-OE-RESPONSE-NSP-REC(INDX-NSP)
308500040511                                                   NOT = SPACES
308600040429              STRING FIELD-TAG0       DELIMITED BY SIZE
308700040511                     ERROR-MESSAGE OF ESG-OE-RESPONSE-NSP-REC(INDX-NSP)
308800040429                                      DELIMITED BY "  "
308900041007R24590*******        FIELD-TAG0       DELIMITED BY SIZE
309000041007R24590               FIELD-TAG1       DELIMITED BY SIZE
309100040429                INTO WS-RESPONSE
309200040429                WITH POINTER WS-RESPONSE-POINTER
309300040429              END-STRING
309400040429           END-IF.
309500040511
309600040511           WRITE NFU-ESG-LOG-REC.
309700040429
309800040429           GO TO WRF00-NEXT.
309900040429
310000040429       WRF00-END.
310100040429           STRING NOTSUPPRTD-TAG1      DELIMITED BY SIZE
310200040429                  RESPONSE-TAG1        DELIMITED BY SIZE
310300040429                  MSG-TYPE-TAG1        DELIMITED BY SIZE
310400040429                  MSG-TAG1             DELIMITED BY SIZE
310500040429             INTO WS-RESPONSE
310600040429             WITH POINTER WS-RESPONSE-POINTER
310700040429           END-STRING.
310800040429
310900040429       WRF00-EXIT.
311000040429             EXIT.
311100040429      /
311200040501       CHECK-XML-MESSAGE-ALLOWED.
311300040501      *****************************************************************
311400040501      * C H E C K    X M L    M E S S A G E    A L L O W E D
311500040501      *****************************************************************
311600040511           MOVE SPACES TO WS-XML-AUTHORIZATION-CODE.
311700040511           MOVE DEALER-CODE OF ESG-OE-DTL-REC TO WS-DEALER-CODE.
311800040511
311900040511           IF ORDER-SOURCE OF ESG-OE-DTL-REC NOT = "D"
312000040511              GO TO CXMA-0020
312100040511           END-IF.
312200040511
312300040511        CXMA-0010.
312400040511           EXEC SQL
312500040511             SELECT XML_AUTHORIZATION_CODE
312600040511             INTO :WS-XML-AUTHORIZATION-CODE
312700040511             FROM  MFADEAMDP
312800040511             WHERE
312900040511               DEALER_CODE = :WS-DEALER-CODE
313000040511           END-EXEC.
313100040501
313200050607R28015*** add invalid dealer
313300050607           IF SQLCODE NOT = 0
313400050607              MOVE "PAR18" TO COMM-ERROR-PTR
313500050607              MOVE ERR-INVALID-DLR TO COMM-RETURN-DESC
313600050607              PERFORM ESG-REJECTION THRU ERJ-EXIT
313700050607              GO TO CXMA-EXIT
313800050607           END-IF.
313900050607
314000040511       CXMA-0020.
314100040511           IF ORDER-SOURCE OF ESG-OE-DTL-REC NOT = "I"
314200040511              GO TO CXMA-0030
314300040511           END-IF.
314400040511
314500040511           MOVE INTERMEDIARY-NO OF ESG-OE-DTL-REC
314600040511             TO WS-EXTERNAL-NOMINEE-CODE.
314700040511
314800040511           EXEC SQL
314900040511             SELECT NOMMDP.XML_AUTHORIZATION_CODE
315000040511             INTO :WS-XML-AUTHORIZATION-CODE
31510010121585040        FROM MFAXNMCDP XNMCDP
315200101122  |          INNER JOIN MFANOMMDP NOMMDP ON
31530010121585040        NOMMDP.NOMINEE_CODE = XNMCDP.NOMINEE_CODE
315400040511             WHERE
315500040511               XNMCDP.PROGRAM_CODE = :WS-PROGRAM-CODE AND
315600040511               XNMCDP.EXTERNAL_NOMINEE_CODE
315700101122                                   = :WS-EXTERNAL-NOMINEE-CODE
31580010121585040 *        NOMMDP.NOMINEE_CODE = XNMCDP.NOMINEE_CODE
315900040511           END-EXEC.
316000040501
316100040511       CXMA-0030.
316200040511           MOVE SPACES TO WS-XML-ALLOWED.
316300040511           MOVE ZEROES TO WS-COUNT-1.
316400040501           INSPECT WS-BUSINESS-PROCESS-MODE TALLYING WS-COUNT-1
316500040501                   FOR CHARACTERS BEFORE INITIAL ">".
316600040511           COMPUTE WS-COUNT-1 = WS-COUNT-1  - 1.
316700040511           MOVE WS-BUSINESS-PROCESS-MODE(2:WS-COUNT-1)
316800040511             TO WS-BUSINESS-PROCESS-MODE.
316900040511
317000040501           EXEC SQL
317100040511             SELECT DISTINCT CHAR("Y",1)
317200040511             INTO :WS-XML-ALLOWED
317300040511             FROM MFAXMLAUP
317400040511             WHERE
317500040511               XML_AUTHORIZATION_CODE = :WS-XML-AUTHORIZATION-CODE AND
317600040511               MESSAGE = :WS-BUSINESS-PROCESS-MODE
317700040501           END-EXEC.
317800040501
317900040511           IF WS-XML-ALLOWED NOT = "Y"
318000040511              MOVE "PAR18" TO COMM-ERROR-PTR
318100040511              MOVE ERR-XML-NOT-SUPPORTED TO COMM-RETURN-DESC
318200040501              PERFORM ESG-REJECTION THRU ERJ-EXIT
318300040501           END-IF.
318400040501
318500040501       CXMA-EXIT.
318600040501            EXIT.
318700040429      /
318800030404       SQLLOG.
318900030404***********************************************************************
319000030404******* SQLLOG
319100030404***********************************************************************
319200030404           CALL "SQLLOG"     USING WS-CALLING-PROGRAM
319300030404                                   WS-SQLERR-STATEMENT
319400030404                                   SQLCODE
319500030404                                   SQLERRD(1)
319600030404                                   SQLERRD(2)
319700030404                                   SQLERRD(3)
319800030404                                   SQLERRD(4)
319900030404                                   SQLERRD(5)
320000030404                                   SQLERRD(6)
320100030404                                   SQLSTATE
320200030404                                   WS-SQLERR-DATA
320300030404                                   WS-SQL-STATS
320400030404                                   WS-SQLERR-REPLY.
320500030404           CANCEL "SQLLOG".
320600030404
320700030404           GOBACK.
320800030404       SQLLOG-EXIT.
320900030404           EXIT.
321000040427      /
321100040511       INITIAL-LOGIC.
321200040427***********************************************************************
321300040511******* INITIAL LOGIC
321400040427***********************************************************************
321500040511           MOVE "00" TO COMM-RETURN-CODE.
321600050329
321700050401      *RFS 26193: removed the period from end COMM-MASTER-ACCOUNT-NO
321800050329
321900050329           MOVE ZEROES TO COMM-MASTER-ACCOUNT-NO
322000040511                          COMM-ACCOUNT-NO.
322100050401      *RFS 26193 end
322200050401
322300040505           MOVE SPACES TO COMM-MASTER-ACCOUNT.
322400040512           MOVE "N" TO COMM-EDIT-ONLY.
322500040428
322600040904R23543     MOVE SPACES TO WS-MESSAGEID
322700040904                          WS-SRCID.
322800040904
322900201123186497     MOVE SPACES TO Lc_ExtraValidation
323000201123
323100040503           ACCEPT COMM-SYSTIME FROM TIME.
323200040503           MOVE FUNCTION CURRENT-DATE(1:8) TO COMM-SYSDATE.
323300040503
323400040430           INITIALIZE MFAORDE15P OF ESG-OE-DTL-REC
323500040430                      MFAORDA15P OF ESG-ACCOUNT-REC
323600040430                      MFAORDD15P OF ESG-SPOUSAL-REC
323700040430                      MFAORDD15P OF ESG-ANNUITANT-REC
323800040430                      MFAORDR15P OF ESG-OE-RESPONSE-REC
323900100305      *** R72399 - Begin
324000100305                      MFAORDD15P OF Esg-Successor-Rec
324100100305                      MFAORDD15P OF Esg-Seg-Succr-Owner-Rec
324200160204151548*               MFACUSIP   OF Cusip-Msg-Dtls-Rec
324300160204151548                WRKCUSIP   OF Cusip-Msg-Dtls-Rec
324400100305      *** R72399 - End
324500040511                      COMM-RESPONSE-COPYBOOK-FIELDS
324600040511                      MFAACCNTP OF ACCOUNT-REC
324700040511                      MFAIVRP OF INVESTOR-REC.
324800100310
324900160215      * RFS 151550 - Start
325000160215           INITIALIZE li_ReqLen.
325100160215           SET lnc_XMLErrCodeOk  TO TRUE.
325200160215      * RFS 151550 - End
325300160215
325400100310      **** RFS 72399 - Begin
325500100310           ACCEPT CPWSYSPARM-LINKAGE FROM WS-DATA-AREA
325600100310                                      FOR "MFASYSPARM".
325700100310           MOVE CPWSYSPARM-LINKAGE(46:4) TO COMM-SETTLE-SCHEDULE.
325800100310           MOVE SYSPARM-AAP-STF-ACC-SEP TO COMM-ACCOUNT-SEPARATOR.
325900100310           IF  CPWSYSPARM-LINKAGE(109:2) NOT NUMERIC
326000100310               MOVE ZEROES TO COMM-RRSP-AGE-LIMIT
326100100310           ELSE
326200100310               MOVE CPWSYSPARM-LINKAGE(109:2) TO COMM-RRSP-AGE-LIMIT
326300100310           END-IF.
326400100310      **** RFS 72399 - End
326500040430
326600040430           COMPUTE INDX-JNT     = 0.
326700040430           COMPUTE INDX-BEN     = 0.
326800040430           COMPUTE INDX-ITF     = 0.
326900040430           COMPUTE INDX-REJ     = 0.
327000040430           COMPUTE INDX-NSP     = 0.
327100040501           COMPUTE INDX-WRN     = 0.
327200090325R60351     COMPUTE Indx-Jnt-Suc = 0.
327300110411R84184     COMPUTE Indx-PCG     = 0.
327400040430           COMPUTE INDX-JNT-MAX = 5.
327500040430           COMPUTE INDX-REJ-MAX = 5.
327600040430           COMPUTE INDX-NSP-MAX = 5.
327700040501           COMPUTE INDX-WRN-MAX = 5.
327800090325R60350     COMPUTE Indx-Jnt-Suc-Max = 5.
327900110411R84184     COMPUTE INDX-PCG-MAX = 2.
328000160322      *    RFS151549 - Expand to 14 (10 DTH/PRIM + 4 CNTGT)
328100160322151549*    COMPUTE INDX-BEN-MAX = 10.
328200160322151549     COMPUTE INDX-BEN-MAX = 14.
328300040430           COMPUTE INDX-ITF-MAX = 10.
328400111012
328500111012      *    RFS92917.20 - Begins - Expand to 30 benes if EXTQESI
328600111012           IF ex-EXTQESIModule = lncc_Y
328700111012               COMPUTE INDX-BEN-MAX = 30
328800111012           END-IF.
328900111012      *    RFS92917.20 - ends
329000040430
329100040430           COMPUTE WS-INDX      = 0.
329200040430           PERFORM INIT-JNT UNTIL WS-INDX = INDX-JNT-MAX.
329300040430
329400040430           COMPUTE WS-INDX = 0.
329500040430           PERFORM INIT-BEN UNTIL WS-INDX = INDX-BEN-MAX.
329600040430
329700040430           COMPUTE WS-INDX = 0.
329800040430           PERFORM INIT-ITF UNTIL WS-INDX = INDX-ITF-MAX.
329900090325
330000090325      **Rfs60351 - Start
330100090325           COMPUTE WS-INDX = 0.
330200090325           PERFORM JntSucAnnuitants UNTIL WS-INDX = Indx-Jnt-Suc-Max.
330300090325      **Rfs60351 - End
330400110411      *** RFS84184 - Starts
330500110411           MOVE 0  TO  WS-INDX.
330600110411           PERFORM Init-ESG-Care-Giver UNTIL WS-INDX = Indx-PCG-Max.
330700110411      *** RFS84184 - Ends
330800110411
330900040430           COMPUTE WS-INDX = 0.
331000040430           PERFORM INIT-REJ UNTIL WS-INDX = INDX-REJ-MAX.
331100040430
331200040430           COMPUTE WS-INDX = 0.
331300040430           PERFORM INIT-NSP UNTIL WS-INDX = INDX-NSP-MAX.
331400040501
331500040501           COMPUTE WS-INDX = 0.
331600040501           PERFORM INIT-WRN UNTIL WS-INDX = INDX-WRN-MAX.
331700040430           COMPUTE WS-INDX = 0.
331800090325
331900181126      *RFS180147 -Starts
332000181126           MOVE lnc_FSDATA             TO WS-MODULE.
332100181126           PERFORM SPECIAL-MODULE-AUTHORIZATION THRU SMA-EXIT.
332200181126           MOVE WS-MODULE-AUTH         TO COMM-FSDATA-MODULE.
332300181126      *RFS180147 -Ends
332400040511       INL-EXIT.
332500040428           EXIT.
332600040430      /
332700040430       INIT-JNT.
332800040430            ADD 1  TO WS-INDX.
332900040430            INITIALIZE MFAORDD15P OF ESG-JOINT-REC(WS-INDX).
333000040430
333100040430       INIT-BEN.
333200040430            ADD 1  TO WS-INDX.
333300040430            INITIALIZE MFAORDD15P OF ESG-BENEFICIARY-REC(WS-INDX).
333400040430
333500040430       INIT-ITF.
333600040430            ADD 1  TO WS-INDX.
333700040430            INITIALIZE MFAORDD15P OF ESG-ITF-REC(WS-INDX).
333800090325
333900090325      **Rfs60351 - Start
334000090325       JntSucAnnuitants.
334100090325            ADD 1  TO WS-INDX.
334200090325            INITIALIZE MFAORDD15P OF Esg-Jnt-Suc-Ann-Rec(WS-INDX).
334300090325      **Rfs60351 - End
334400110411      *** RFS84184 - Starts
334500110411       Init-ESG-Care-Giver.
334600110411            ADD 1  TO WS-INDX.
334700110411            INITIALIZE     MFAORDD15P OF ESG-Care-Giver-Rec(WS-INDX).
334800110411      *** RFS84184 - Ends
334900040430
335000040430       INIT-REJ.
335100040430            ADD 1  TO WS-INDX.
335200040430            INITIALIZE MFAORRD15P OF ESG-OE-RESPONSE-REJ-REC(WS-INDX).
335300040430
335400040430       INIT-NSP.
335500040430            ADD 1  TO WS-INDX.
335600040430            INITIALIZE MFAORRD15P OF ESG-OE-RESPONSE-NSP-REC(WS-INDX).
335700040501
335800040501       INIT-WRN.
335900040501            ADD 1  TO WS-INDX.
336000040501            INITIALIZE MFAORRD15P OF ESG-OE-RESPONSE-WRN-REC(WS-INDX).
336100090325
336200040501      /
336300040501       PROCESS-MESSAGE-LOGIC.
336400040501***********************************************************************
336500040501*******  PROCESS MESSAGE LOGIC
336600040501***********************************************************************
336700110817      * RFS 92917 - Starts
336800110817            IF ex-EXTQESIModule NOT = lncc_Y
336900110817               PERFORM GET-VERSION-NUMBER THRU GVN-EXIT
337000110817            END-IF
337100110817      *     PERFORM GET-VERSION-NUMBER THRU GVN-EXIT.
337200110817      * RFS 92917 - End
337300040501            IF COMM-RETURN-CODE = "99"
337400040501               GO TO PML-RESPONSE
337500040501            END-IF.
337600040511
337700040501            PERFORM GET-CREATE-MESSAGE THRU GCM-EXIT.
337800040511
337900110817      * RFS 92917 - Starts
338000110818            IF ex-EXTQESIModule = lncc_Y
338100110818               STRING MSG-TYPE-TAG0         DELIMITED BY SIZE
338200110818                      RESPONSE-TAG0         DELIMITED BY SIZE
338300110818                      WS-MESSAGEID          DELIMITED BY SPACE
338400110818                      WS-SRCID              DELIMITED BY SPACE
338500110818               INTO   WS-RESPONSE
338600110818                      WITH POINTER WS-RESPONSE-POINTER
338700110818               END-STRING
338800110818               PERFORM GET-ACCOUNT-LOOKUP THRU GAL-EXIT
338900110818               IF COMM-RETURN-CODE = "99"
339000110818                  GO TO PML-RESPONSE
339100110818               END-IF
339200111024      *        RFS92917.20 - Begins - Edit for entire message
339300111024               INITIALIZE WS-STRING-BEFORE
339400111024                          WS-STRING-AFTER
339500111024               MOVE COMM-BUSINESS-PROCESS-2 TO WS-STRING-BEFORE
339600111024dm             PERFORM Replace-XML-Special-Entities
339700111024               MOVE WS-STRING-AFTER TO COMM-BUSINESS-PROCESS-2
339800111024      *        RFS92917.20 - Ends
339900110818               GO TO PML-0010
340000110817            END-IF.
340100110818      * RFS 92917 - End
340200110818
340300110818            PERFORM GET-SOURCE THRU GMS-EXIT.
340400110818            PERFORM GET-TARGET THRU GMT-EXIT.
340500040501            IF COMM-RETURN-CODE = "99"
340600040501               GO TO PML-RESPONSE
340700040501            END-IF.
340800040511
340900040501            PERFORM GET-MESSAGE-TYPE THRU GMY-EXIT.
341000040511
341100040511            PERFORM GET-NETWORK THRU GNW-EXIT.
341200110818
341300040511
341400040904      *****Set MessageType
341500040904           STRING MSG-TYPE-TAG0         DELIMITED BY SIZE
341600040904                  RESPONSE-TAG0         DELIMITED BY SIZE
341700040904                  WS-MESSAGEID          DELIMITED BY SPACE
341800040904                  WS-SRCID              DELIMITED BY SPACE
341900040904             INTO WS-RESPONSE
342000040904                  WITH POINTER WS-RESPONSE-POINTER
342100040904           END-STRING.
342200050607R26004      PERFORM GET-BUSINESS-TYPE THRU GBT-EXIT.
342300050607R26004      IF COMM-RETURN-CODE = "99"
342400050607R26004         GO TO PML-RESPONSE
342500050607R26004      END-IF.
342600050607R26004
342700050607
342800050607R28015***** Override files for Advisory updates to Global library.
342900050607R28015      PERFORM CHECK-OVERRIDE THRU CO-EXIT.
343000050607
343100050607R26004      IF WS-ADDMODREP-FLAG = "Y" OR
343200050607R26004         WS-INAREP-FLAG = "Y"
34330006030229614          OR lc-ModBulkRepFlag = ncc-Yes
343400050607R26004         PERFORM GET-ADVISOR THRU GA-EXIT
343500050607               IF COMM-RETURN-CODE = "99"
343600050607                  GO TO PML-RESPONSE
343700050607R26004         END-IF
343800110411      *RFS 92487 Start
343900110520      *** RFS92487.1 - Starts
344000110520      ******** PERFORM CheckDealerRep-NONFU-Attibute THRU CDRNA-EXIT
344100110520               PERFORM CheckDealerRep-NOAMR-Attibute THRU CDRNA-EXIT
344200110520      *** RFS92487.1 - Ends
344300110411               IF COMM-RETURN-CODE = "99"
344400110411                  GO TO PML-RESPONSE
344500110411               END-IF
344600110411      *RFS 92487 End
344700050607R26004      ELSE
344800050607R26004         PERFORM GET-ACCOUNT-LOOKUP THRU GAL-EXIT
344900050607R26004         IF COMM-RETURN-CODE = "99"
345000050607R26004            GO TO PML-RESPONSE
345100050607R26004         END-IF
345200040501            END-IF.
345300040511
345400040501            PERFORM CHECK-XML-MESSAGE-ALLOWED THRU CXMA-EXIT.
345500040501            IF COMM-RETURN-CODE = "99"
345600040501               GO TO PML-RESPONSE
345700040501            END-IF.
345800050330
345900110818      * RFS 92917 - Starts
346000110818       PML-0010.
346100110818            IF ex-EXTQESIModule = lncc_Y
346200110818               PERFORM ACCOUNT-LOOKUP THRU AL-EXIT
346300110818               IF COMM-RETURN-CODE = "99"
346400110818                  GO TO PML-RESPONSE
346500110818               END-IF
346600110818               GO TO PML-0020
346700110818            END-IF.
346800110818      * RFS 92917 - End
346900110818
347000050607R26004      IF WS-ADDMODREP-FLAG NOT = "Y" AND
347100050607R26004         WS-INAREP-FLAG NOT = "Y"
34720006030229614          AND lc-ModBulkRepFlag NOT = ncc-Yes
347300050607R26004         PERFORM ACCOUNT-LOOKUP THRU AL-EXIT
347400050607R26004         IF COMM-RETURN-CODE = "99"
347500050607R26004            GO TO PML-RESPONSE
347600050607R26004         END-IF
347700050607R26004      END-IF.
347800040501
347900110818R92917 PML-0020.
348000110818
348100040501            PERFORM BUSINESS-CALL-ROUTINE THRU BCR-EXIT.
348200040501
348300040501       PML-RESPONSE.
348400100305      *** R72399 - Begin
348500100310            IF ncc-CusipProcess
348600201209186497      AND NOT lb_CusipTinVal_Fail
348700100305               GO TO Pml-Response-Skip
348800100305            END-IF.
348900100305      *** R72399 - End
349000040501            PERFORM WRITE-RESPONSE THRU WRR-EXIT.
349100100303            MOVE SPACES TO MSG-OUT-REC  NFU-LOG-OUT-REC.
349200100303            MOVE WS-RESPONSE(1:WS-RESPONSE-POINTER - 1) TO
349300040501                 MSG-OUT-REC  NFU-LOG-OUT-REC.
349400040501            WRITE MSG-OUT-REC.
349500040501            WRITE NFU-LOG-OUT-REC.
349600100308      *** R72399 - Begin
349700100308       Pml-Response-Skip.
349800100308      *** R72399 - End
349900201209186497      MOVE SPACES TO lc_CusipTinVal.
350000040501            MOVE WS-MESSAGE TO NFU-LOG-IN-REC.
350100040501            WRITE NFU-LOG-IN-REC.
350200040501            MOVE "N" TO WS-START-MESSAGE-FLAG
350300040501                          WS-END-MESSAGE-FLAG.
350400040511            PERFORM INITIAL-LOGIC THRU INL-EXIT.
350500040501
350600040501       PML-EXIT.
350700040501           EXIT.
350800040511      /
350900040518       FORMAT-FUND-ACCOUNT-NO.
351000040518***********************************************************************
351100040518*******  FORMAT  FUND ACCOUNT NUMBER
351200040518***********************************************************************
351300040518            IF COMM-MASTER-ACCOUNT-NO NOT = ZEROES
351400040518               MOVE COMM-MASTER-ACCOUNT-NO
351500040518                           TO WS-ACCOUNT-NO9 OF WS-ACCOUNT-FORMAT-1
351600040518            ELSE
351700040518               MOVE COMM-ACCOUNT-NO
351800040518                           TO WS-ACCOUNT-NO9 OF WS-ACCOUNT-FORMAT-1
351900040518            END-IF.
352000040518
352100040518            IF WS-ACCOUNT-NO1 IS EQUAL ZEROES
352200040518               MOVE WS-ACCOUNT-NO8 OF WS-ACCOUNT-FORMAT-1
352300040518                 TO WS-ACCOUNT-NO8 OF WS-ACCOUNT-FORMAT-2
352400040518               MOVE WS-ACCOUNT-FORMAT-2
352500040518                           TO FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
352600040518            ELSE
352700040518               MOVE WS-ACCOUNT-FORMAT-1
352800040518                           TO FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
352900040518            END-IF.
353000040518
353100040518       FFAN-EXIT.
353200040518            EXIT.
353300050607
353400050607R26599***** Start
353500050607       CHECK-OVERRIDE.
353600050607      *****************************************************************
353700050607      * Overrides should be done for AddModRep and InaRep only.
353800050607      * WS-OVR-DONE flag indicates that overrides were already done
353900050607      * so, no need to do it again. WS-OVERRIDE-REQUIRED indicates that
354000050607      * the Global Library Name data area is populated.
354100050607      * If overrides is required and override is not done and this is
354200050607      * AddModRep or InaRep, override the files.
354300050607      *
354400050607      * If overrides were already done and this is not AddModRep and
354500050607      * not InaRep, remove the overrides.
354600050607      *****************************************************************
354700050607           IF OVERRIDE-REQUIRED
354800050607              IF OVERRIDE-ALREADY
354900050607                 IF WS-ADDMODREP-FLAG IS NOT = "Y" AND
355000050607                    WS-INAREP-FLAG IS NOT = "Y"
355100050607                    MOVE WS-RMV TO WS-ACTION
355200050607                    CALL "FXOVRFIL" USING WS-ACTION, WS-GBL-LIB
355300050607                    MOVE "N" TO WS-OVR-DONE
355400050607                 END-IF
355500050607              ELSE
355600050607                 IF WS-ADDMODREP-FLAG IS = "Y" OR
355700050607                    WS-INAREP-FLAG IS = "Y"
355800050607                    MOVE WS-OVR TO WS-ACTION
355900050607                    CALL "FXOVRFIL" USING WS-ACTION, WS-GBL-LIB
356000050607                    MOVE "Y" TO WS-OVR-DONE
356100050607                 END-IF
356200050607              END-IF
356300050607           END-IF.
356400050607       CO-EXIT.
356500050607            EXIT.
356600050607R26599***** End
356700091001
356800091001      /
356900091001      *RFS 26193 start
357000091001      * rfs 26193 Begin - CL
357100091001
357200091001      *SPECIAL-MODULE-AUTHORIZATION.
357300091001
357400091001      *    MOVE   SPACES             TO WS-MODULE-AUTH.
357500091001      *    CALL  "RTVMODAUTH"  USING WS-MODULE  WS-MODULE-AUTH.
357600091001
357700091001      *SMA-EXIT.
357800091001      *    EXIT.
357900091001      * rfs 26193 End - CL
358000091001      *RFS 26193 end
358100050607
358200091001R54431*Begins
358300090917       SPECIAL-MODULE-AUTHORIZATION.
358400090917           MOVE   SPACES             TO WS-MODULE-AUTH.
358500090917           CALL  "RTVMODAUTH"  USING WS-MODULE  WS-MODULE-AUTH.
358600090917       SMA-EXIT.
358700090917           EXIT.
358800091001R54431*Ends
358900100223
359000100223R72399***** Begin
359100100223       LOAD-CUSIP-INFO.
359200100223      *****************************************************************
359300100223      * This section will load and save the parsed account info and
359400100223      * cusip details into QTEMP library.  The cusip messages will be
359500100223      * processed at the end when all other business messages have
359600100223      * completed.
359700100223      *****************************************************************
359800100304           MOVE Source-Number-2 OF Esg-Oe-Dtl-Rec
359900100305             TO Msg-Id OF Esg-Oe-Dtl-Rec
360000100305                Msg-Id OF Cusip-Msg-Dtls-Rec.
360100100305           MOVE Dealer-Code OF Esg-Oe-Dtl-Rec
360200100305             TO Dealer-Code OF Cusip-Msg-Dtls-Rec.
360300100305            MOVE Comm-Account-No
360400100305             TO  Account-No OF Cusip-Msg-Dtls-Rec.
360500100305
360600100305      *** Save Order Details
360700100819           WRITE Order-Entry-Dtl-Rec FROM Esg-Oe-Dtl-Rec
360800110520      *** RFS92487.1 - Starts - Inappropriate for file org type
360900100819      *Rfs86137 - Start
361000110520      *******INVALID KEY
361100110520      *********DISPLAY "Fail on MFAORDE15P"
361200100819           END-WRITE.
361300100819      *Rfs86137 - End
361400110520      *** RFS92487.1 - Ends
361500100304
361600100304           IF Comm-Account-No = ZEROES
361700100304      *** Save Account Details
361800100309              MOVE lncc_Y TO Acct-Setup
361900100309                          OF Cusip-Msg-Dtls-Rec
362000100305              MOVE Msg-Id OF Esg-Oe-Dtl-Rec
362100100305                TO Msg-Id OF Esg-Account-Rec
362200100304              WRITE Order-Entry-Account-Rec FROM Esg-Account-Rec
362300110520      *** RFS92487.1 - Starts - Inappropriate for file org type
362400100819      *Rfs86137 - Start
362500110520      *********INVALID KEY
362600110520      ***********DISPLAY "Fail on MFAORDA15P"
362700110520      *** RFS92487.1 - Ends   - Inappropriate for file org type
362800100819              END-WRITE
362900100819      *Rfs86137 - End
363000100304
363100100224      *** Save Demographics Details ***
363200100224      *** Save Spouse Details
363300100304              IF Record-Id OF Esg-Spousal-Rec NOT = SPACES
363400100305                 MOVE Msg-Id OF Esg-Oe-Dtl-Rec
363500100305                   TO Msg-Id OF ESG-Spousal-Rec
363600100304                 WRITE Order-Entry-Demo-Rec FROM Esg-Spousal-Rec
363700100819      *Rfs86137 - Start
363800110520      *** RFS92487.1 - Starts - Inappropriate for file org type
363900110520      ***********INVALID KEY
364000110520      *************DISPLAY "Fail on Spouse"
364100110520      *** RFS92487.1 - Ends   - Inappropriate for file org type
364200100819                 END-WRITE
364300100819      *Rfs86137 - End
364400100304              END-IF
364500100224
364600100304              IF Record-Id OF Esg-Annuitant-Rec NOT = SPACES
364700100305                 MOVE Msg-Id OF Esg-Oe-Dtl-Rec
364800100305                   TO Msg-Id OF Esg-Annuitant-Rec
364900100304                 WRITE Order-Entry-Demo-Rec FROM Esg-Annuitant-Rec
365000100820      *Rfs86137 - Start
365100110520      *** RFS92487.1 - Starts - Inappropriate for file org type
365200110520      ***********INVALID KEY
365300110520      *************DISPLAY "Fail on Annuitant"
365400110520      *** RFS92487.1 - Ends   - Inappropriate for file org type
365500100820                 END-WRITE
365600100820      *Rfs86137 - End
365700100304              END-IF
365800100226
365900100304              IF Record-Id OF Esg-Seg-Succr-Owner-Rec NOT = SPACES
366000100305                 MOVE Msg-Id OF Esg-Oe-Dtl-Rec
366100100305                   TO Msg-Id OF Esg-Seg-Succr-Owner-Rec
366200100304                 WRITE Order-Entry-Demo-Rec
366300100304                                   FROM Esg-Seg-Succr-Owner-Rec
366400110520      *** RFS92487.1 - Starts - Inappropriate for file org type
366500100819      *Rfs86137 - Start
366600110520      ***********INVALID KEY
366700110520      *************DISPLAY "Fail on Succ Owner"
366800110520      *** RFS92487.1 - Ends   - Inappropriate for file org type
366900100819                 END-WRITE
367000100819      *Rfs86137 - End
367100100304              END-IF
367200100304
367300100304              IF Record-Id OF Esg-Successor-Rec NOT = SPACES
367400100305                 MOVE Msg-Id OF Esg-Oe-Dtl-Rec
367500100305                   TO Msg-Id OF Esg-Successor-Rec
367600100304                 WRITE Order-Entry-Demo-Rec
367700100304                                   FROM Esg-Successor-Rec
367800110520      *** RFS92487.1 - Starts - Inappropriate for file org type
367900100820      *Rfs86137 - Start
368000110520      ***********INVALID KEY
368100110520      *************DISPLAY "Fail on Succ"
368200110520      *** RFS92487.1 - Ends   - Inappropriate for file org type
368300100820                 END-WRITE
368400100820      *Rfs86137 - End
368500100304              END-IF
368600100224
368700100304              COMPUTE Ws-Indx = 0
368800100304              IF INDX-JNT > 0
368900100304                 MOVE lc-JNT TO lc-Rec
369000100304                 PERFORM Save-Multi-Demographics
369100100226                                         UNTIL WS-INDX = INDX-JNT
369200100304              END-IF
369300100224
369400100304              COMPUTE Ws-Indx = 0
369500100304              IF INDX-BEN > 0
369600100304                 MOVE lc-BEN TO lc-Rec
369700100304                 PERFORM Save-Multi-Demographics
369800100226                                         UNTIL WS-INDX = INDX-BEN
369900100304              END-IF
370000100224
370100100304              COMPUTE Ws-Indx = 0
370200100304              IF INDX-ITF > 0
370300100304                 MOVE lc-ITF TO lc-Rec
370400100304                 PERFORM Save-Multi-Demographics
370500100226                                         UNTIL WS-INDX = INDX-ITF
370600100304              END-IF
370700100224
370800100304              COMPUTE Ws-Indx = 0
370900100304              IF Indx-Jnt-Suc > 0
371000100304                 MOVE lc-JAN TO lc-Rec
371100100304                 PERFORM Save-Multi-Demographics
371200100226                                         UNTIL WS-INDX = Indx-Jnt-Suc
371300100304              END-IF
371400100304           END-IF.
371500100224
371600100317           MOVE lncc-000  TO Msg-Code1 OF Cusip-Msg-Dtls-Rec.
371700100304           MOVE Ws-Response(1:Ws-Response-Pointer - 1) TO
371800100305                Response-Message OF Cusip-Msg-Dtls-Rec
371900100305
372000100305           WRITE Cusip-Message-Dtls-Rec
372100100820            FROM Cusip-Msg-Dtls-Rec
372200110520      *** RFS92487.1 - Starts - Inappropriate for file org type
372300100820      *Rfs86137 - Start
372400110520      ******INVALID KEY
372500110520      *********DISPLAY "Fail on Cisip Dtl"
372600110520      *** RFS92487.1 - Ends   - Inappropriate for file org type
372700100820           END-WRITE.
372800100820      *Rfs86137 - End
372900100307
373000100301       Save-Multi-Demographics.
373100100226      *****************************************************************
373200100226      * This section will process multiple demographics records and
373300100226      * save them into QTEMP library.
373400100226      *****************************************************************
373500100226           ADD 1 TO Ws-Indx.
373600100226
373700100305           INITIALIZE Mfaordd15p OF Order-Entry-Demo-Rec.
373800100226           EVALUATE lc-Rec
373900100226               WHEN lc-JNT
374000100226                  MOVE CORR Mfaordd15p OF Esg-Joint-Rec(Ws-Indx)
374100100301                         TO Mfaordd15p OF Order-Entry-Demo-Rec
374200100819      *Rfs86137 - Start
374300100818                  MOVE INDX-JNT  TO MULTI-LINE-RECORD-TOTAL
374400100818                       OF Order-Entry-Demo-Rec
374500100819      *Rfs86137 - End
374600100226               WHEN lc-BEN
374700100226                  MOVE CORR Mfaordd15p OF Esg-Beneficiary-Rec(Ws-Indx)
374800100301                         TO Mfaordd15p OF Order-Entry-Demo-Rec
374900100819      *Rfs86137 - Start
375000100818                  MOVE INDX-BEN TO MULTI-LINE-RECORD-TOTAL
375100100819      *Rfs86137 - End
375200100818                       OF Order-Entry-Demo-Rec
375300100226               WHEN lc-ITF
375400100226                  MOVE CORR Mfaordd15p OF Esg-Itf-Rec(Ws-Indx)
375500100301                         TO Mfaordd15p OF Order-Entry-Demo-Rec
375600100819      *Rfs86137 - Start
375700100818                  MOVE INDX-ITF TO MULTI-LINE-RECORD-TOTAL
375800100818                       OF Order-Entry-Demo-Rec
375900100819      *Rfs86137 - End
376000100226               WHEN lc-JAN
376100100226                  MOVE CORR Mfaordd15p OF Esg-Jnt-Suc-Ann-Rec(Ws-Indx)
376200100304                         TO Mfaordd15p OF Order-Entry-Demo-Rec
376300100819      *Rfs86137 - Start
376400100818                  MOVE Indx-Jnt-Suc TO MULTI-LINE-RECORD-TOTAL
376500100818                       OF Order-Entry-Demo-Rec
376600100819      *Rfs86137 - End
376700100226           END-EVALUATE.
376800100226
376900100819      *Rfs86137 - Start
377000100818           MOVE Ws-Indx TO MULTI-LINE-RECORD-NUMBER
377100100818                OF Order-Entry-Demo-Rec.
377200100819      *Rfs86137 - End
377300100305           MOVE Msg-Id OF Esg-Oe-Dtl-Rec
377400100305             TO Msg-Id OF Order-Entry-Demo-Rec.
377500100819           WRITE Order-Entry-Demo-Rec
377600110520      *** RFS92487.1 - Starts - Inappropriate for file org type
377700100819      *Rfs86137 - Start
377800110520      *******INVALID KEY
377900110520      *********DISPLAY "Fail on Succ Owner"
378000110520      *** RFS92487.1 - Ends   - Inappropriate for file org type
378100100819           END-WRITE.
378200100819      *Rfs86137 - End
378300100819
378400100303       Edit-Numeric-Messages.
378500100303      *****************************************************************
378600100303      *    E D I T   N U M E R I C   M E S S A G E S                  *
378700100303      *****************************************************************
378800100303           MOVE ZEROES TO WS-COUNT-1  WS-START-POS
378900100303                          WS-COUNT-2.
379000100303           MOVE SPACES TO WS-WHOLE-ALPHA  WS-DEC-ALPHA.
379100100303
379200100303           INSPECT WS-ALPHA-NUM          TALLYING WS-COUNT-1
379300100303                   FOR CHARACTERS BEFORE INITIAL ".".
379400100303
379500100303           IF WS-COUNT-1 > 0
379600100303              COMPUTE WS-START-POS = (WS-FIELD-LENGTH -
379700100303                                      WS-COUNT-1) + 1
379800100303              MOVE WS-ALPHA-NUM(1:WS-COUNT-1)
379900100303                   TO WS-WHOLE-ALPHA(WS-START-POS:WS-COUNT-1)
380000100303           END-IF.
380100100303
380200100303           INSPECT WS-ALPHA-NUM          TALLYING WS-COUNT-2
380300100303                   FOR CHARACTERS AFTER  INITIAL ".".
380400100303
380500100303           IF WS-COUNT-2 > 0
380600100303              COMPUTE WS-START-POS =  (WS-FIELD-LENGTH -
380700100303                                      WS-COUNT-2) + 1
380800100303              MOVE WS-ALPHA-NUM(WS-START-POS:WS-COUNT-2)
380900100303                    TO WS-DEC-ALPHA
381000100303           END-IF.
381100100303
381200100303           INSPECT WS-WHOLE-ALPHA REPLACING ALL SPACE BY "0".
381300100303           INSPECT WS-DEC-ALPHA   REPLACING ALL SPACE BY "0".
381400100303
381500100303           COMPUTE WS-WHOLE-DEC  = WS-WHOLE-NUM  +
381600100303                                   (WS-DEC-NUM  * .0001).
381700100305      /
381800100310       Create-Cusip-Response.
381900100305      *****************************************************************
382000100310      *    C R E A T E    C U S I P     R E S P O N S E S             *
382100100305      *****************************************************************
382200100310           READ Cusip-Message-Details-Input  NEXT RECORD
382300100305              AT END
382400100307                 MOVE lncc_Y TO lc-EndOfRsp
382500100310              NOT AT END
382600100307                 MOVE Msg-Id OF Cusip-Message-Input-Rec
382700100307                   TO Msg-Id OF Order-Entry-Input-Rec
382800100308                 READ Order-Entry-Detail-Input
382900100308                   INTO Esg-Oe-Dtl-Rec
383000100307                   INVALID KEY
383100100307                      INITIALIZE Mfaorde15p OF Esg-Oe-Dtl-Rec
383200100308                  END-READ
383300100310           END-READ.
383400100310
383500100310           IF NOT ncc-EndOfRsp
383600100310              COMPUTE Indx-Rej = 0
383700100310              PERFORM Cusip-Response-Details
383800100310           END-IF.
383900100310
384000100310       Cusip-Response-Details.
384100100310      *****************************************************************
384200100310      *    C U S I P     R E S P O N S E S                            *
384300100310      *****************************************************************
384400100310           IF Cusip-No OF Cusip-Message-Input-Rec NOT = lc-RspCusipNo
384500130607123278        OR Dealer-Code OF Cusip-Message-Input-Rec NOT =
384600130607123278        lc-RspDrealerCde
384700100310              Move Cusip-No OF Cusip-Message-Input-Rec
384800100310                TO lc-RspCusipNo
384900130607123278        Move Dealer-Code OF Cusip-Message-Input-Rec
385000130607123278          TO lc-RspDrealerCde
385100100310              PERFORM Check-Cusip-Rsp-Status
385200100310           END-IF.
385300100310
385400100310           MOVE 1 TO Ws-Response-Pointer.
385500100310           STRING Response-Message OF Cusip-Message-Input-Rec
385600100310                   DELIMITED BY "  "
385700100310              INTO Ws-Response
385800100310              WITH POINTER Ws-Response-Pointer
385900100310           END-STRING.
386000100310           IF Comm-Return-Code = lncc_99
386100100310              COMPUTE Indx-Rej = 1
386200100310              INITIALIZE Mfaorrd15p OF
386300100310                         Esg-Oe-Response-Rej-Rec(Indx-Rej)
386400100819              MOVE lncc_99  TO Return-Code-DDS OF
386500100819                         Esg-Oe-Response-Rej-Rec(Indx-Rej)
386600100310              IF Msg-Code1
386700100310                 OF Cusip-Message-Input-Rec = lncc-000
386800100310                 MOVE lncc-248 TO Msg-Code1
386900100310                               OF Esg-Oe-Response-Rej-Rec(Indx-Rej)
387000100310              ELSE
387100100310                 MOVE Msg-Code1 OF Cusip-Message-Input-Rec
387200100310                   TO Msg-Code1 OF
387300100308                       Esg-Oe-Response-Rej-Rec(Indx-Rej)
387400100310              END-IF
387500100310              IF Acct-Setup OF Cusip-Message-Input-Rec = lncc_Y
387600100310                 MOVE ZEROES TO Account-No  OF Cusip-Message-Input-Rec
387700100310                                Investor-NO OF Cusip-Message-Input-Rec
387800100310              END-IF
387900100310           END-IF.
388000100310           MOVE Account-No OF Cusip-Message-Input-Rec
388100100314             TO Account-No OF Account-Rec, Comm-Account-No.
388200100310           MOVE Investor-No OF Cusip-Message-Input-Rec
388300100310             TO Investor-No OF Investor-Rec.
388400190116181865     COMPUTE INDX-NSP = 0
388500100310           PERFORM Write-Response THRU Wrr-Exit.
388600100310           MOVE SPACES TO Msg-Out-Rec  Nfu-Log-Out-Rec
388700100310           MOVE Ws-Response(1:Ws-Response-Pointer - 1)
388800100310             TO Msg-Out-Rec  Nfu-Log-Out-Rec.
388900100310           WRITE Msg-Out-Rec.
389000100310           WRITE Nfu-Log-Out-Rec.
389100100305
389200100310       Check-Cusip-Rsp-Status.
389300100310      *****************************************************************
389400100310      *    C H E C K   C U S I P   R E S P O N S E   S T A T U S      *
389500100310      *****************************************************************
389600100310           MOVE lncc_00 TO Comm-Return-Code.
389700100820R86137     MOVE " "     TO lc-RspCusipStatus.
389800100310
389900100310           EXEC SQL
390000100310             SELECT DISTINCT CHAR("Y",1)
390100100310             INTO :lc-RspCusipStatus
390200160204151548*      FROM Mfacusip
390300160204151548       FROM Wrkcusip
390400100310             WHERE
390500100310               Cusip_No = :lc-RspCusipNo AND
390600130607123278         Dealer_Code = :lc-RspDrealerCde AND
390700100310               Msg_Code1 <> :lncc-000
390800100310           END-EXEC.
390900100310
391000100310           IF lc-RspCusipStatus = lncc_Y
391100100310              MOVE lncc_99 TO Comm-Return-Code
391200100310           END-IF.
391300110915
391400160205      * RFS 151548 - Start
391500160205      *----------------------------------
391600160205       GetDecimalAmount.
391700160205      *----------------------------------
391800160205           EXEC SQL
391900160205             SET :ln_ACBValue =
392000160205                 DECIMAL(TRIM(:WS-TEMP-FIELD-2-5000),16,2)
392100160205           END-EXEC
392200160205           .
392300160205      /
392400160205      * RFS 151548 - End
392500170329      * RFS 169193 - Start
392600170329      *------------------*
392700170329       NFULGP-COMMONLOGIC.
392800170329      *------------------*
392900170329           INITIALIZE MFANFULGP OF NFU-ESG-LOG-REC.
393000170329
393100170329           MOVE INVESTOR-NO OF INVESTOR-REC
393200170329             TO INVESTOR-NO OF NFU-ESG-LOG-REC.
393300170329           MOVE ACCOUNT-NO OF ACCOUNT-REC
393400170329             TO ACCOUNT-NO OF NFU-ESG-LOG-REC.
393500170329           MOVE CLERK-ID OF ESG-OE-DTL-REC
393600170329             TO AUDIT-USER OF NFU-ESG-LOG-REC.
393700170329           MOVE "N" TO AUDIT-STATUS OF NFU-ESG-LOG-REC.
393800170329           MOVE "PARSER" TO SCREEN-CODE OF NFU-ESG-LOG-REC
393900170329                            SECTION-ID OF NFU-ESG-LOG-REC.
394000170329           MOVE SOURCE-NUMBER-2 OF ESG-OE-DTL-REC
394100170329             TO MESSAGE-IDENTIFIER OF NFU-ESG-LOG-REC.
394200170329           MOVE COMM-SYSDATE TO AUDIT-DATE OF NFU-ESG-LOG-REC.
394300170329           MOVE COMM-SYSTIME-HHMMSS TO LOG-TIME OF NFU-ESG-LOG-REC.
394400170329
394500170329           IF COMM-MSG-DTL = SPACE
394600170329              MOVE COMM-BUSINESS-PROCESS
394700170329                TO DETAIL-SECTION OF NFU-ESG-LOG-REC
394800170329           END-IF
394900170329           .
395000170329      /
395100170329      * RFS 169193 - End.
395200110915      * RFS92917 - Begins - Move activity to a procedure
395300110915       Replace-XML-Special-Entities.
395400110915      *****************************************************************
395500110915      *    R E P L A C E   XML   S P E C I A L   E N T I T I E S      *
395600110915      *****************************************************************
395700110915
395800110915      **** Replace the XML special Entities
395900110915      **** &amp; &apos; &lt; &gt; &quot;
396000110915           CALL "FXXMLENT" USING WS-STRING-BEFORE
396100110915                                 WS-STRING-AFTER.
396200110915
396300110915      * RFS92917 - Ends
