000100200615      * %ATTR DBGVIEW(*SOURCE) CLOSQLCSR(*ENDACTGRP)
000200210806       IDENTIFICATION DIVISION.
000300200615       PROGRAM-ID.     INTCLC.
000400200615       INSTALLATION.   JEWELSTONE SYSTEMS INC.
000500200615       AUTHOR.         MARC BASTARACHE.
000600200615       DATE-WRITTEN.   MAY 2000.
000700200615       DATE-COMPILED.
000800210729
000900200615      ******************************************************************
001000200615      *                                                                *
001100200615      *    INTCLC:     CALCULATE ACCRUED INTEREST FOR GIC AND DII      *
001200200615      *                INVESTMENTS                                     *
001300200615      *                                                                *
001400200615      *    PURPOSE:    USED IN BATCH OR ONLINE ROUTINES. WILL POPULATE *
001500200615      *                FILE: GIC-INT-WORKFILE WITH DESIRED RECORDS     *
001600200615      *                                                                *
001700200615      *    LEVELS:     None.                                           *
001800200615      *                                                                *
001900200615      *    USAGE:      AN EXAMPLE OF A PROGRAM WHICH CALLS THIS
002000200615      *                ROUTINE IS A QUICK SCREEN CALLED ACILST
002100200615      *                WITHIN USE FILE: USACILST2
002200200615      *
002300200615      *                CHECK TRNPST FOR A COBOL CALL EXAMPLE
002400200615      *
002500200615      *
002600200615      *  PASS       REQUIRED     CALCULATE OUT OUT  WRKF  MODE
002700200615      *  MODE        INPUT         UNTIL   LVL PUT  OPEN  DESC
002800200615      *  ----   ---------------- --------- --- ---- ----- -------------
002900200615      *
003000200615      *  "A " - PASS ACCOUNT     TODAY     INV WRKF WRITE ACCT ONLINE
003100200615      * RFS12320 - Begin
003200200615      *  "A1" - PASS ACCOUNT     NEW YEARS N/A RETN N/A   ACCT ANY
003300200615      * RFS12320 - End
003400200615      *  "AE" - PASS ACCOUNT     PASS DATE INV WRKF WRITE ACCT REDEMPTN
003500200615      *  "EE" - PASS ACCOUNT     PASS DATE INV WRKF WRITE ACCT ESTATE
003600200615      *  "AM" - PASS ACCOUNT     MATURITY  INV WRKF WRITE ACCT MATURITY
003700200615      *  "C " - PASS ACC/INV/CRT TODAY     CRT WRKF WRITE CERT ONLINE
003800200615      *  "CE" - PASS ACC/INV/CRT PASS DATE CRT WRKF WRITE CERT REDEMPTN
003900200615      *  "CM" - PASS ACC/INV/CRT MATURITY  CRT WRKF WRITE CERT MATURITY
004000200615      *  "V " - PASS ACC/INV     TODAY     INV WRKF WRITE INVT ONLINE
004100200615      *  "VE" - PASS ACC/INV     PASS DATE INV WRKF WRITE INVT REDEMPTN
004200200615      *  "VM" - PASS ACC/INV     MATURITY  INV WRKF WRITE INVT MATURITY
004300200615      *  "D " - WRKF ACC/INV     NEW YEARS INV WRKF I-O   DII BATCH
004400200615      *  "DE" - WRKF ACC/INV     PASS DATE INV WRKF I-O   DII BATCH-RDM
004500200615      *  "G " - WRKF ACC/INV/CRT NEXT PMNT CRT WRKF I-O   GIC BATCH
004600200615      *  "GE" - WRKF ACC/INV/CRT PASS DATE CRT WRKF I-O   GIC BATCH-RDM
004700200615      *  "GM" - WRKF ACC/INV/CRT MATURITY  CRT WRKF I-O   GIC BATCH-MAT
004800200615      *  "TE" - PASS ACC/INV/CRT PASS DATE CRT RETN N/A   TRNPST PENALT
004900200615      *  "IE" - PASS ACC/INV/OPT PASS DATE N/A RETN N/A   TRNPST INTERE
005000200615      *  "SE" - PASS ACC/INV/OPT PASS DATE N/A RETN N/A   STMT   INTERE RFS11106
005100200615      *  SE - Statement extract for GIC, the end-date received is       RFS11106
005200200615      *  actually the END-DATE + 1.                                     RFS11106
005300200615      *  END-DATE should be included in calculation interest, but       RFS11106
005400200615      *  transaction will be selected by condition:                     RFS11106
005500200615      * PROCESS-DATE < END-DATE                                         RFS11106
005600200615      *  "EG" - PASS ACC/INV/OPT PASS DATE N/A RETN N/A   ESTATE/GIC    RFS15421
005700200615      *  "V2" - PASS ACC/INV/END DATE RETN total accrual interest back RFS137231
005800200615      *         for the account investment on return parameter that    RFS137231
005900200615      *         the calculation of accrual interest include closed     RFS137231
006000200615      *         certificate if the certificate is still open based on  RFS137231
006100200615      *         the End Date.                                          RFS137231
006200200615      *  "V3" - PASS ACC/INV/END DATE RETN total accrual interest back 1017021
006300200615      *         for the account investment on return parameter that    1017021
006400200615      *         the calculation of accrual interest include closed     1017021
006500200615      *         certificate if the certificate is still open based on  1017021
006600200615      *         the End Date. This is built for GI/DI ACB calculation  1017021
006700200615      *         based on "V2" with exception that it will not include  1017021
006800200615      *         transactions happend on the End Date passed in.        1017021
006900200615      *  ----   ---------------- --------- --- ---- ----- -------------
007000200615      *  PASS       REQUIRED     CALCULATE OUT OUT  WRKF  MODE
007100200615      *  MODE        INPUT         UNTIL   LVL PUT  OPEN  DESC
007200200615      *  ----   ---------------- --------- --- ---- ----- -------------
007300200615      * RFS8582 1. Parameters are passing thru LDA, from position 901
007400200615      *         2. In a batch mode, the calling program is responsible
007500200615      *         for the restoring LDA.
007600200615      *  "PD" - PASS PLD/TRN     TOD       N/A LDA  N/A  DII Adjustment
007700200615      *
007800200615      ******************************************************************
007900200615      *    D e c o d i n g (In Aleph-Bet Order)                       *
008000200615      *  LDA - Uing LDA                                               *
008100200615      *  PLD - Placement Date                                         *
008200200615      *  TRN - Transaction Number                                     *
008300200615      *  TOD - To Date                                                *
008400200615      ******************************************************************
008500200615      *****************************************************************
008600200615      ****
008700200615      **** NOTES:      The program was changed from CBL to CBLLE and  *
008800200615      ****             a Module must be created while create a PGM.   *
008900200615      ****                                                            *
009000200615      **** COMPILE PGM: 1) Use option 15 to create module.            *
009100200615      ****              2) CRTPGM prompt F4                           *
009200200615      ****                 program: INTCLC                            *
009300200615      ****                 library: ie. MFADEVPKOJ                    *
009400200615      ****                 Module : INTCLC                            *
009500200615      ****                 library: ie. MFADEVPKOJ                    *
009600200615      ****                 Prompt F10 (additional parameters)         *
009700200615      ****                 program entry...:INTCLC                    *
009800200615      ****                 library: ie. MFADEVPKOJ                    *
009900200615      ****                                                            *
010000200615      ****       THE COMMENTS MUST BE REMOVED FROM YOUR PACKAGE       *
010100200615      ****       FRAME TO EXECUTE THE CRTSTMTSRV, CRTSTMTPGM          *
010200200615      ****       PROGRAMS FOR THE CREATION OF STATEMENT/CONFIRM       *
010300200615      ****       PROGRAMS.                                            *
010400200615      ****
010500200615      ******************************************************************
010600200615      ******************************************************************
010700200615      *                                                                *
010800200615      *    C H A N G E   H I S T O R Y                                 *
010900200615      *                                                                *
011000200615      ******************************************************************
011100200615      ******************************************************************
011200200615      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
011300200615      ******************************************************************
011400200615      * MARC B.      2000/08/22      ADDED ESTATE-EARLY-REDEMPTION-MODE
011500200615      * MARC B.      2000/08/23      DRTRMDT FIELD NAME CHANGES
011600200615      * MARC B.      2000/09/23      ADDED MFAGICJLA LOGIC RFS 7806
011700200615      * MARC B.      2000/10/27      ADDED LOGIC FOR DII-RATE-SET
011800200615      * MARC B.      2000/12/15      NO PENALTY/REDEMPTION IF FLAG=Y
011900200615      *
012000200615      *                              X - Paragraphs for data processing
012100200615      *                              XW- Error paragraphs
012200200615      *
012300200615      * Lev  O.      2001/01/19      1. RFS8371 -- Change logic for thefor
012400200615      *                              rate calculation,    only for "TE"
012500200615      *                              passed parameter.
012600200615      *                              2. Fix decimal data error MSGW
012700200615      *                              3. When determining the penalty
012800200615      *                              rate or the penalty minimum to
012900200615      *                              apply the system should match the
013000200615      *                              trade date of the redemption
013100200615      *                              against the effective date of
013200200615      *                              the GIC Penalty Table.
013300200615      *
013400200615      * Lev  O.      2001/02/02      1. RFS9224 Problem: accounts,
013500200615      *                              that have future buys and complite
013600200615      *                              redemptions are not generating the
013700200615      *                              corect interest payment.
013800200615      *                              Fixed the problem.
013900200615      *
014000200615      * Lev  O.      2001/02/02      1. RFS9029 Do not send   error
014100200615      *                             "First trade date is not equal
014200200615      *                              issue date" for HSC transactions.
014300200615      *                              2. Check TOTAL.HSC against
014400200615      *                                 initial amount
014500200615      *
014600200615      * Lev  O.      2001/02/06      1. RFS9240 Accrued interest is
014700200615      *                              not calculated properly when
014800200615      *                              exist more than 1 sertificate and
014900200615      *                              one of them (not the first) has
015000200615      *                              interest transaction.
015100200615      *
015200200615      * Lev  O.      2001/02/14      FIX01
015300200615      *                              Do not call GICINTJOIN twice
015400200615      *
015500200615      * Lev  O.      2001/02/14      FIX02
015600200615      *                              Problem: in GIC/DII batch mode
015700200615      *                              work file is used as I/O and
015800200615      *                              operation should be REWRITE.
015900200615      *                              Solution:
016000200615      *                                fix bug for GIC/DII batch mode
016100200615      *
016200200615      * Lev  O.      2001/02/14      FIX03
016300200615      *                              1. Problem: in GIC/DII batch mode
016400200615      *                              the program exits from process,
016500200615      *                              if data not valid.
016600200615      *                              Solution:
016700200615      *                                continue process on the next
016800200615      *                                record, in case of non-valid
016900200615      *                                input data.
017000200615      *                              2. Add file status to work file
017100200615      *                              and rejection file
017200200615      *
017300200615      * Lev  O.      2001/02/14      FIX04
017400200615      *                              1. Problem: in GIC/DII batch mode
017500200615      *                              rejected data is not written to
017600200615      *                              the rejection file.
017700200615      *                              Solution: write rejected data
017800200615      *                              to the rejection file for GIC/DII
017900200615      *                              batch mode
018000200615      *
018100200615      * Lev  O.      2001/02/20      FIX05 Correct "write-return logic
018200200615      *                              for DII.
018300200615      *
018400200615      * Lev  O.      2001/02/20      FIX06 Correct precision
018500200615      *
018600200615      * Lev  O.      2001/02/20      FIX07 Change DAILY-RATE and
018700200615      *                              related variables to ...V9(9)
018800200615      *
018900200615      * Lev  O.      2001/03/05      RFS9657
019000200615      *                              Do not calculate interest for
019100200615      *                              closed certificates.
019200200615      *
019300200615      * Lev  O.      2001/03/05      FIX08 Initialize returned data
019400200615      *
019500200615      * Lev  O.      2001/03/06      RFS8582
019600200615      *                              1. DII Interest Calculation for
019700200615      *                              Adjustment.
019800200615      *                              2. Check reinvestment interest for
019900200615      *                              DII interest calculation and use
020000200615      *                              the amount for calculaton.
020100200615      *
020200200615      * Lev  O.      2001/03/06      FIX09 Comment some code that is
020300200615      *                              not in use
020400200615      *
020500200615      * Lev  O.      2001/03/12      1. RFS9603 When a sell transaction
020600200615      *                              is placed on Dec 31, a second
020700200615      *                              DII interest payment is generated
020800200615      *                              for the entire period.
020900200615      *
021000200615      * Lev  O.      2001/03/27      FIX10 Eliminate computing on non-
021100200615      *                              native records.
021200200615      *            *              *
021300200615      * Lev O.     * 2001/05/15   * RFS10258
021400200615      *            *              * Reconciliation the amount
021500200615      *            *              *
021600200615      * Lev O.     * 2001/06/01   * RFS10382
021700200615      *            *              * DII interest Adjustment transaction
021800200615      *            *              * s with Adjustment reason code DADJ
021900200615      *            *              * should be treated like buys.
022000200615      * Lev  O.    * 2001/06/08   * RFS10404 - Fix:Decimal data error  for
022100200615      *            *              *                                    for
022200200615      * Lev O.     * 2001/07/06   * RFS10563
022300200615      *            *              * When calculating interest take
022400200615      *            *              * into account issue and maturity
022500200615      *            *              * Dates, to know, if Feb 29 should
022600200615      *            *              * be included in the term calculation
022700200615      *            *              *                                    for
022800200615      * Lev O.     * 2001/07/14   * RFS10620
022900200615      *            *              * For nominee account types
023000200615      *            *              * an error message "DII Rate set not
023100200615      *            *              * found is displayed an interest
023200200615      *            *              * not be calculated
023300200615      *            *              *                                    for
023400200615      * Lev O.     * 2001/07/19   * RFS10737
023500200615      *            *              * Return balance for Certificate
023600200615      *            *              *                                    for
023700200615      * Lev O.     * 2001/08/13   * RFS11106
023800200615      *            *              * New Mode ,                          RFS11106
023900200615      *            *              * SE - Statement extract for GIC  +   RFS11106
024000200615      *            *              * For this mode check: when the       RFS11106
024100200615      *            *              * certificate was closed to know if   RFS11106
024200200615      *            *              * the certificate valid/invalid.      RFS11106
024300200615      *            *              *                                    for
024400200615      * Lev O.     * 2001/09/04   * RFS11324
024500200615      *            *              * Enhancment, return Next Anniversary RFS11106
024600200615      *            *              * date                                RFS11106
024700200615      *            *              *                                    for
024800200615      * Lev O.     * 2001/09/13   * RFS11367 - Correcting
024900200615      *            *              * Reconciliation process (RFS10258-
025000200615      *            *              * this RFS doesn't take into account
025100200615      *            *              * any purchase/redemption transaction
025200200615      *            *              * while doing reconciliation)
025300200615      *            *              *                                    for
025400200615      * Lev O.     * 2001/09/25   * RFS11592 - Skip reconciliation if
025500200615      *            *              * exists SAJ transaction type for the
025600200615      *            *              * certificate.
025700200615      *            *              *                                    for
025800200615      * Lev O.     * 2001/11/13   * RFS11986 - When calculating
025900200615      *            *              * interest for DII the program is
026000200615      *            *              * going through TRANS file and first
026100200615      *            *              * could be Interest Adjustment.
026200200615      *            *              * (Such transaction will be
026300200615      *            *              * considered active to start interest
026400200615      *            *              * calculation).
026500200615      *            *              *                                    for
026600200615      * Lev O.     * 2001/11/15   * RFS12054 - Related to RFS8582,
026700200615      *            *              * consider interest
026800200615      *            *              *          transactions with PAYMENT-
026900200615      *            *              * TYPE = 'N' and DISTRIBUTION-OPTION-
027000200615      *            *              * CODE = 'R' as Reinvested.
027100200615      *            *              *
027200200615      * Lev O.     * 2001/11/13   * RFS12320 - Added new mode - A1,
027300200615      *            *              * same as A, only total interest
027400200615      *            *              * through linkage, calculation up to
027500200615      *            *              * Jan 1 next year,
027600200615      *            *              * skip DII(it will be paid at Dec 31)
027700200615      *            *              *
027800200615      * Jane D.    * 2002/01/17   * RFS 12353,12384,12326 - exclude INT
027900200615      *            *              * trans with CHQ status in resetting
028000200615      *            *              * accrual amount to zero on payment
028100200615      *            *              * date
028200200615      * JOHN M     * 2002/02/07   * RFS 12754 - RECOMPILE ONLY
028300200615      * Jane D.    * 2002/03/12   * RFS 12825 - Include GIC interest
028400200615      *            *              * adjustment in reporting accrued
028500200615      *            *              * interest for statement mode
028600200615      * R MIGUEL   * 2002/03/19   * RFS 12631 - Date of Death FMV should
028700200615      *            *              * include accrued interest.
028800200615      * Jane D.    * 2002/04/09   * RFS 13492 - Remove changes made to
028900200615      *            *              * RFS 12353 & 12384 , it will be fix
029000200615      *            *              * on the screen and on the maturity
029100200615      *            *              * notice report instead of INTCLC.   ans
029200200615      *            *              *                                    for
029300200615      * B. Lu      * 2002/04/18   * RFS12715 - Change the type from
029400200615      *            *              * CBL to CBLLE and create Module for
029500200615      *            *              * Stateement performance improvement.
029600200615      *            *              *                                    for
029700200615      * Lev O.     * 2002/05/23   * RFS13747 - 1.Only for the Statement
029800200615      *            *              * Mode (SE), When calculating
029900200615      *            *              * WS-TOTAL-INT-PAID
030000200615      *            *              * exclude interest with
030100200615      *            *              * TRANS-STATUS-CODE = "CHQ".
030200200615      *            *              * 2. Only for the Statement
030300200615      *            *              * Mode (SE), When calculating
030400200615      *            *              * RETN-BALANCE, exclude SEL
030500200615      *            *              * transaction with
030600200615      *            *              * TRANS-STATUS-CODE = "CHQ".
030700200615      *            *              *
030800200615      * Lev O.     * 2002/05/29   * RFS13910 - Change program not to
030900200615      *            *              * loop for DII, when no more data
031000200615      *            *              * in TRANS file.
031100200615      * Jane D.    * 2002/06/12   * RFS 13300 - Remove the conversion
031200200615      *            *              * of accrued interest to positive
031300200615      * Darena G.  * 2002/06/12   * RFS 13301 - Add reconciliation for
031400200615      *            *              * the capital payment transaction
031500200615      * R MIGUEL   * 2002/07/31   * RFS 14016 - For Estate Redemption mode,
031600200615      *            *              * (EE), it should validate the trade date
031700200615      *            *              * instead of process date.
031800200615      *            *              * This will exclude INT trans that has been
031900200615      *            *              * paid when FMV is calculated at the DOD.
032000200615      * Marc B.    * 2002/10/19   * RFS 14156 - Perform CALC-GIC-ADJ   ode,
032100200615      *            *              * if in MATURITY-SELL-MODE.
032200200615      *            *              *
032300200615      * Nguyen A.  * 2003/03/10   * RFS16609 - Change program to check
032400200615      *            *              * Investment-code while accessing
032500200615      *            *              * GIC-TERM table.
032600200615      * Mona N.    * 2003/03/25   * RFS 15421 - Added ESTATE/GIC
032700200615      *            *              * Mode (EG).
032800200615      * Jane D.    * 2004/04/26   * RFS 21211 - Change the declaration
032900200615      *            *              * of ws-total-int-calculated to
033000200615      *            *              * 2 decimal places
033100200615      * Chandana R.* 2004/09/22   * RFS 23365 - Performance improvement
033200200615      *            *              * measures.
033300200615      *            *              * 1) Execute static calls to the
033400200615      *            *              *    following programs instead of
033500200615      *            *              *    the dynamic calls.
033600200615      *            *              *    GICTRNJOIN
033700200615      *            *              *    GRTOJUPRG
033800200615      *            *              *    JUTOGRPRG
033900200615      *            *              *    GICCALC
034000200615      * Chandana R.* 2004/10/11   * RFS 25181 - Initialize the CURR-
034100200615      *            *              * CONTROLS variable so that the
034200200615      *            *              * program will execute correctly for
034300200615      *            *              * subsequent calls when bound to
034400200615      *            *              * ANNSTMTJSI.
034500200615      ******************************************************************
034600200615      * Brian L.  .* 2005/09/27   * RFS14153 - Optimize Statement run
034700200615      *            *              *  - Open the files one time
034800200615      *            *              *  - No calls to GICTRNJOIN
034900200615      *            *              *  - Implement START for MFAGICJLA
035000200615      * Kahkashan P* 2006/05/03   * RFS32982 - Use the Account Type
035100200615      *            *              *  Code to retrieve
035200200615      *            *              *  GIC-TERM-GROUP-ACCOUNT-TYPES.
035300200615      * Richard Shi* 2011/02/14   * RFS84184 - ESG 21
035400200615      *            *              *  recompiled for MFAACCNMP.
035500200615      *Alan Andrade* 2013/03/06   * RFS112133- Introduce a new mode "V1"
035600200615      *            *              *  to provide the same accrual
035700200615      *            *              *  calculation as mode "V" with the
035800200615      *            *              *  exception of returning the result
035900200615      *            *              *  in parameters and not writing the
036000200615      *            *              *  results to a temporary outfile.
036100200615      * Geeta S.   * 2013/01/10   * RFS 113783 - Include MVA method of
036200200615      *            *              * calculating Penalty for GIC early redem.
036300200615      * Daisy Ly   * 2013/03/18   * -include accrual interest in MVA
036400200615      * JEYARAJAN  * 2013/04/05   * RFS120002 - Recompile for MFAGICDP
036500200615      * Tony V     * 2013/04/18   * RFS121668 - MVA penalty is not
036600200615      *            *              * applied on GIC redemption
036700200615      * L Martin   * 2013/05/09   * RFS123287 - get gic rates
036800200615      *            *              * (fix for 121668)
036900200615      * Michael Fan* 2014/04/25   * RFS136361 - For join file MFAGICJLA,
037000200615      *            *              * it should be close the file first
037100200615      *            *              * in this program and then call
037200200615      *            *              * GICTRNJOIN to close the OPNQRYF.
037300200615      * Michael Fan* 2014/06/05   * RFS137231 - Add a new V2 mode that
037400200615      *            *              * is based on V1 mode that calculate
037500200615      *            *              * accrual interest based on the pass
037600200615      *            *              * in End Date parameter.  The calculation
037700200615      *            *              * of accrual in V2 mode will include closed
037800200615      *            *              * certificate if the certificate is not
037900200615      *            *              * matured based on the end date while V1
038000200615      *            *              * mode only include active certificate on
038100200615      *            *              * the calculation of accrual interest.
038200200615      *            *              * V2 mode is created to use by market value
038300200615      *            *              * calculator MKTVALTD.
038400200615      * Michael Fan* 2014/07/07   * RFS138130 - For Empire MVA calculation,
038500200615      *            *              * always use the Term code from the
038600200615      *            *              * certificate to determine Current Base
038700200615      *            *              * Rate for penalty & Replacement amount
038800200615      *            *              * calculate (Do not use remaining term to
038900200615      *            *              * determine Current Base Rate).
039000200615      * R Miguel   * 2014/07/16   * RFS 138307 - OVRDBF on MFAGICJLA file
039100200615      *            *              * on GICTRNJOIN program does not select
039200200615      *            *              * specific certificates thus giving
039300200615      *            *              * rejection.
039400200615      * Nagamani S * 2014/07/21   * RFS139054 - To fix MSGW caused due to
039500200615      *            *              * file GICJLATMP not closed in few
039600200615      *            *              * places
039700200615      * Michael Fan* 2014/07/18   * RFS 137833 - Bypass the logic to check
039800200615      *            *              * if issue date of certificate = first
039900200615      *            *              * trade date and initial amount of
040000200615      *            *              * certificate = gross amount of the first
040100200615      *            *              * trade if the trade is transfer in kind
040200200615      *            *              * (transfer-certificatedtls of
040300200615      *            *              * seg-switch-trf-opt(MFASGSTOP) = 'Y')
040400200615      * Rupesh Kr  * 2014/09/02   * RFS138276 - MVA to use Interest Rate
040500200615      *            *              * /Banded rate/Promotional Rate
040600200615      *            *              * for MVA calculation
040700200615      * Daisy Ly   * 2014/09/05   * RFS 140341 - delete the GICJLATMP  le
040800200615      *            *              * file before inserting instead of
040900200615      *            *              * deleting rec because when acct hold
041000200615      *            *              * multiple cert, the order of trade
041100200615      *            *              * insert in GICJLATMP is incorrect
041200200615      * Michael Fan* 2014/10/07   * RFS 141057 - Set switch to indicate it
041300200615      *            *              * is the last period calculation before
041400200615      *            *              * GICCALC is called.  So that GICCALC will
041500200615      *            *              * use the new routine to calculate accrual
041600200615      *            *              * interest based on certificate next
041700200615      *            *              * anniversary date.
041800200615      * Daisy Ly   * 2014/10/23   * RFS 140722 - add rounding when      it
041900200615      *            *              * returnt he accrual interest for A1 crual
042000200615      *            *              * and V2 mode
042100200615      * Michael Fan* 2014/10/23   * RFS 141855 - Due to changes on 141057 to
042200200615      *            *              * projected accrual interest on last period,
042300200615      *            *              * accrual interest is double count on the
042400200615      *            *              * actual interest transaction generation.
042500200615      *            *              * Fix to only pass previous calculated
042600200615      *            *              * accrual interest to GICCALC if the last
042700200615      *            *              * transaction for the certificate is NOT an
042800200615      *            *              * INT transaction.  If the last transaction
042900200615      *            *              * is INT transaction, accrual interest should
043000200615      *            *              * already included in the certificate balance.
043100200615      *            *              * Here no need to consider previous calculated
043200200615      *            *              * accrual interest on last previous interest
043300200615      *            *              * calculation.
043400200615      *            *              * Also, this fix on accrual interest
043500200615      *            *              * projection is only apply to reinvest
043600200615      *            *              * interest on interest payment, that is
043700200615      *            *              * compounded interest on certificate.
043800200615      * TamilSelvi * 2014/10/23   * RFS 141325 - Defect  Fix for        it
043900200615      *            *              * LIF account is receiving the error
044000200615      *            *              * "First trade date is not equal issu
044100200615      *            *              * e  date" on ACIGCLST when GIC cert-
044200200615      *            *              * ificated are transferred from LIRA
044300200615      *            *              * to LIF.
044400200615      * Michael Fan* 2014/11/06   * RFS 142432 - Pull out changes on 141325
044500200615      *            *              *  that change the sorting criteria on
044600200615      *            *              *  work file MFAGICJLA by using process date
044700200615      *            *              *  since the changes do not work in all cases
044800200615      *            *              *  and it cause issue on 140721. It will need
044900200615      *            *              *  further analysis to fix the issue reported
045000200615      *            *              *  on 141325.
045100200615      * Michael Fan* 2014/10/23   * RFS 141725 - In V2 mode, return calculated
045200200615      *            *              * total certificates balance in parameter
045300200615      *            *              * RETN-BALANCE field for the account/INV.
045400200615      *            *              * For DII, also return the total balance on
045500200615      *            *              * RETN-BALANCE field.
045600200615      * Michael Fan* 2014/11/18   * RFS 142609 - Fix original issue report on
045700200615      *            *              * 141325 by reordering the transaction by
045800200615      *            *              * trade date and processing date and process
045900200615      *            *              * seq.
046000200615      * Michael Fan* 2014/11/18   * RFS 142623 - Fix the issue that Interest
046100200615      *            *              * paid is included in the calculation of
046200200615      *            *              * accrual interest on transaction after the
046300200615      *            *              * interest paid transaction. For example,
046400200615      *            *              * it could be a partial SELL.
046500200615      * Praveen E  * 2014/11/27   * RFS142159- Accumulate Accrual interest
046600200615      *            *              * for each GIC with 2 decimal places.
046700200615      * Praveen E  * 2015/01/14   * RFS142508 - Market Value on Jan1 is
046800200615      *            *              * not including GIC int Adjustments
046900200615      * Michael Fan* 2015/02/27   * RFS 140269 - Defect #40142
047000200615      *            *              * Add logic to allow re-calculate of interest
047100200615      *            *              * amount even though there is already an
047200200615      *            *              * interest transaction created for the date
047300200615      *            *              * but the transaction is not processed yet.
047400200615      *            *              * This will be only use in 'IE' in TRNPST to
047500200615      *            *              * re-calculate interest amount on GIM INT
047600200615      *            *              * transaction when a backdated redemption
047700200615      *            *              * is processed on the same date as the GIM
047800200615      *            *              * INT transaction.
047900200615      * Praveen E  * 2015/04/28   * RFS143882 - Accrual interest calculated
048000200615      *            *              * From GICCALC for interest period calc
048100200615      *            *              * instead add the int adjustment at end of
048200200615      *            *              * total accrual interest, applicable only
048300200615      *            *              * for GM mode and int payment option to 'A'
048400200615      * Thilaga K  * 2015/07/15   * RFS148358 - Added New mode 'GD'
048500200615      *            *              * and will be called for SEG Data
048600200615      *            *              * warehouse extract.
048700200615      * Jeyarajan  * 2015/08/18   * RFS150674 - In GD mode accrued interest
048800200615      *            *              * calculated wrongly for both GIC & DII
048900200615      * Michael Fan* 2016/02/22   * RFS152312 - Add new mode 'SA' that is
049000200615      *            *              * call from statement program.  It will
049100200615      *            *              * produce a work file WKGICINT in QTEMP
049200200615      *            *              * that contains accrual interest on
049300200615      *            *              * start date, end date and
049400200615      *            *              * maturity date(for GIC) from the parameters
049500200615      *            *              * pass in for an account investment. It will
049600200615      *            *              * override to 'SE' mode to process within the
049700200615      *            *              * program.  PASS-END-DATE-OPTION = start date,
049800200615      *            *              * PASS-CERTIFICATE-ID-NO = end date.
049900200615      * Michael Fan* 2016/08/12   * RFS162392 - work file WKGICINT added 2
050000200615      *            *              * records for the same account/investment on
050100200615      *            *              * DII fund. If is because current logic
050200200615      *            *              * on Detail Process is execute routine
050300200615      *            *              * GET-ACCOUNT-INVESTMENT one more time even
050400200615      *            *              * though it is already at the end of the
050500200615      *            *              * account investment file MFAACCIVP. So if
050600200615      *            *              * the last record on MFAACCIVP is a DII fund
050700200615      *            *              * order by account investment. Statement
050800200615      *            *              * program will goes to MSGW when it read the
050900200615      *            *              * work file.  Check the logic to NOT create
051000200615      *            *              * work file record when it is already at the
051100200615      *            *              * end of file (MFAACCIVP).
051200200615      * Digvijay   *  2016/12/28  * RFS 164509 - Optimization of
051300200615      *            *              * runtime - changing compiler option
051400200615      *            *              * and commenting CANCEL
051500200615      * Sethu B    *  2017/12/11  * RFS175247 - Incorrect ACB Reporting
051600200615      *            *              * due to Issues with GIC Interest Calc
051700200615      * Jeyarajan V*  2018/11/26  * RFS1005534 -Statement Previous closing
051800200615      *            *              * balance does not match following opening
051900200615      *            *              * balance.
052000200615      * Michael Fan* 2018/12/13   * RFS 1004070 - Under V2 mode, if pass in
052100200615      *            *              * end date parameter is = the trade date of
052200200615      *            *              * last transaction pickup for interest
052300200615      *            *              * calculation.  This transaction will not
052400200615      *            *              * consider in the interest calculation.
052500200615      * Ashwini B  * 2019/10/18   * RFS1017021 - Gain calculation on
052600200615      *            *              * disposition transactions from GI/DI not
052700200615      *            *              * working as expected
052800200615      * Chaya SP   * 2019/12/23   * RFS185374 - Modify to include
052900200615      *            *              * calculated accrual interest from
053000200615      *            *              * period to running total of GIC
053100200615      *            *              * balance for the frequency code
053200200615      *            *              *  'CD'
053300200615      * Chaya SP   * 2020/02/11   * RFS185066 - Recompile for MFAGICDP
053400200615      * Niranjan   * 2020/03/14   * RFS185941 - Unitrax interest calculation
053500200615      *            *              * formula enhancement for migrated
053600200615      *            *              * GIC certificates and DII funds
053700200615      * Niranjan   * 2020/05/18   * RFS1100588 - Incorrect INT and MV after
053800200615      *            *              * first anniversary date for frequency
053900200615      *            *              * code "CD"
054000200615      * Niranjan   * 2020/05/26   * RFS1100976 - Negative INT generated
054100200615      *            *              * for DII fund when there is transaction
054200200615      *            *              * with trade date same as Start date in
054300200615      *            *              * MFAINTSCDP and no Interest will be
054400200615      *            *              * calculated when Start date in MFAINTSCDP
054500200615      *            *              * greater than Current System date
054600200615      * Vignesh    * 2020/06/15   * RFS1021425 - Modified to check
054700200615      *            *              * DII-BATCH-MODE
054800200615      *            *              * EARLY-REDEMPTION-MODE   of
054900200615      *            *              * the DII Investments first
055000200615      *            *              * transaction is beyond the interest
055100200615      *            *              * calculation end date
055200200622      * Niranjan   * 2020/06/22   * RFS1101805-First annual DII interest
055300200622      *            *              * post migration is overstated by 1 day
055400201012      * Vignesh    *  2020/06/25  * RFS183812 - Recompile for MFASGSTOP
055500200703      * Michael Fan* 2020/07/03   * RFS1099872 - When full redemption date
055600200703      *            *              * passed in as end date option, should
055700200703      *            *              * return interest amount from the interest
055800200703      *            *              * transaction that link to the full redemption
055900200703      *            *              * transaction in V3 mode for DII fund.
056000200703      *            *              * V3 mode is used by ACB calculation only.
056100201203      * Kamal T    * 2020/11/30   * RFS1107791 - Accrual intereset is not
056200201203      *            *              * added to GIC balance parameter as it
056300201203      *            *              * should only have transaction gross amt
056400210708      * Vignesh    * 2021/07/07   * RFS1115367 - Fixed the issue of
056500210708      *            *              * difference in the opening balance of
056600210708      *            *              * current statement and closing state
056700210818      *            *              * ment of the last statement
056701211005      * Aarthi M   * 2021/05/31   * RFS1112849 - Fix: Gain not
056702211005      *            *              * calculating correctly.
056800200615      ************************** *Last* ********************************
056900200615      /
057000200615       ENVIRONMENT DIVISION.
057100200615       CONFIGURATION SECTION.
057200200615       SOURCE-COMPUTER. IBM-AS400.
057300200615       OBJECT-COMPUTER. IBM-AS400.
057400200615       SPECIAL-NAMES.
057500200615R23365     LINKAGE TYPE IS PROCEDURE FOR "GICTRNJOIN"
057600200615R23365     LINKAGE TYPE IS PROCEDURE FOR "GRTOJUPRG"
057700200615R23365     LINKAGE TYPE IS PROCEDURE FOR "JUTOGRPRG"
057800200615R23365     LINKAGE TYPE IS PROCEDURE FOR "GICCALC"
057900200615113783     LINKAGE TYPE IS PROCEDURE FOR "FXMVAPNLTY"
058000200615           LOCAL-DATA IS WS-LOCAL.
058100200615      /
058200200615       INPUT-OUTPUT SECTION.
058300200615
058400200615      ******************************************************************
058500200615      *                                                                *
058600200615      *    I N P U T   /   O U T P U T   S E C T I O N                 *
058700200615      *                                                                *
058800200615      ******************************************************************
058900200615
059000200615       FILE-CONTROL.
059100200615
059200200615      *****
059300200615      *****    File Control.
059400200615      *****
059500200615      * ---------------------------------
059600200615      * RFS 138307 - begin
059700200615      * Change READ of SORTED-GTR to GIC-JLA-TMP
059800200615      *    SELECT SORTED-GTR
059900200615      *           ASSIGN       TO DATABASE-MFAGICJLA
060000200615      *           ORGANIZATION IS INDEXED
060100200615      *           ACCESS       IS DYNAMIC
060200200615      *           RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
060300200615      *           FILE STATUS  IS WS-FILE-STATUS.
060400200615      * RFS 138307 - end
060500200615      * ---------------------------------
060600200615      * RFS 138307 - begin
060700200615           SELECT GIC-JLA-TMP
060800200615                  ASSIGN       TO DATABASE-GICJLATMP
060900200615                  ACCESS       IS SEQUENTIAL.
061000200615      * RFS 138307 - end
061100200615      * ---------------------------------
061200200615
061300200615      *    SELECT ACCOUNT-TYPE
061400200615      *           ASSIGN       TO DATABASE-MFAACCTYP
061500200615      *           ORGANIZATION IS INDEXED
061600200615      *           ACCESS       IS RANDOM
061700200615      *           RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
061800200615      *           FILE STATUS  IS WS-FILE-STATUS.
061900200615
062000200615           SELECT ACCOUNT-NOMINEE
062100200615                  ASSIGN       TO DATABASE-MFAACCNMP
062200200615                  ORGANIZATION IS INDEXED
062300200615                  ACCESS       IS RANDOM
062400200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
062500200615                  FILE STATUS  IS WS-FILE-STATUS.
062600200615
062700200615           SELECT DII-RATE-SET
062800200615                  ASSIGN       TO DATABASE-MFADIIRSLA
062900200615                  ORGANIZATION IS INDEXED
063000200615                  ACCESS       IS RANDOM
063100200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
063200200615                  FILE STATUS  IS WS-FILE-STATUS.
063300200615
063400200615           SELECT TRANS-INTEREST-DETAILS
063500200615                  ASSIGN       TO DATABASE-MFATRNIDP
063600200615                  ORGANIZATION IS INDEXED
063700200615                  ACCESS       IS RANDOM
063800200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
063900200615                  FILE STATUS  IS WS-FILE-STATUS.
064000200615
064100200615           SELECT PAYMENT-TYPE-CODES
064200200615                  ASSIGN       TO DATABASE-MFAPMTTYP
064300200615                  ORGANIZATION IS INDEXED
064400200615                  ACCESS       IS RANDOM
064500200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
064600200615                  FILE STATUS  IS WS-FILE-STATUS.
064700200615
064800200615           SELECT GIC-RATES
064900200615                  ASSIGN       TO DATABASE-MFAGIRTP
065000200615                  ORGANIZATION IS INDEXED
065100200615                  ACCESS       IS DYNAMIC
065200200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
065300200615                  FILE STATUS  IS WS-FILE-STATUS.
065400200615
065500200615           SELECT GIC-PENALTY-RATE-SCHEDULE
065600200615                  ASSIGN       TO DATABASE-MFAGIPRSP
065700200615                  ORGANIZATION IS INDEXED
065800200615                  ACCESS       IS DYNAMIC
065900200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
066000200615                  FILE STATUS  IS WS-FILE-STATUS.
066100200615
066200200615           SELECT GIC-TERM
066300200615                  ASSIGN       TO DATABASE-MFAGITP
066400200615                  ORGANIZATION IS INDEXED
066500200615                  ACCESS       IS RANDOM
066600200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
066700200615                  FILE STATUS  IS WS-FILE-STATUS.
066800200615                                                                        RFS8371
066900200615           SELECT GIC-TERM-IDX2                                         RFS8371
067000200615                  ASSIGN       TO DATABASE-MFAGITLA                     RFS8371
067100200615                  ORGANIZATION IS INDEXED                               RFS8371
067200200615                  ACCESS       IS DYNAMIC                               RFS8371
067300200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY              RFS8371
067400200615                  DUPLICATES                                            RFS8371
067500200615                  FILE STATUS  IS WS-FILE-STATUS.                       RFS8371
067600200615
067700200615           SELECT GIC-TERM-GRP-CODES-ALW-IDXL                           RFS8371
067800200615                  ASSIGN       TO DATABASE-MFAGITGAL                    RFS8371
067900200615                  ORGANIZATION IS INDEXED                               RFS8371
068000200615                  ACCESS       IS DYNAMIC                               RFS8371
068100200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY              RFS8371
068200200615                  FILE STATUS  IS WS-FILE-STATUS.                       RFS8371
068300200615
068400200615           SELECT GIC-TERM-GROUP                                        RFS8371
068500200615                  ASSIGN       TO DATABASE-MFAGITGP                     RFS8371
068600200615                  ORGANIZATION IS INDEXED                               RFS8371
068700200615                  ACCESS       IS DYNAMIC                               RFS8371
068800200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY              RFS8371
068900200615                  FILE STATUS  IS WS-FILE-STATUS.                       RFS8371
069000200615
069100200615           SELECT GIC-TERM-GROUP-ACCOUNT-TYPES                          RFS8371
069200200615                  ASSIGN       TO DATABASE-MFAGITACP                    RFS8371
069300200615                  ORGANIZATION IS INDEXED                               RFS8371
069400200615                  ACCESS       IS DYNAMIC                               RFS8371
069500200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY              RFS8371
069600200615                  FILE STATUS  IS WS-FILE-STATUS.                       RFS8371
069700200615
069800200615           SELECT INVESTMENT-DII-RATES
069900200615                  ASSIGN       TO DATABASE-MFADIIIRP
070000200615                  ORGANIZATION IS INDEXED
070100200615                  ACCESS       IS DYNAMIC
070200200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
070300200615                  FILE STATUS  IS WS-FILE-STATUS.
070400200615
070500200615           SELECT INVESTMENT
070600200615                  ASSIGN       TO DATABASE-MFAINVP
070700200615                  ORGANIZATION IS INDEXED
070800200615                  ACCESS       IS RANDOM
070900200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
071000200615                  FILE STATUS  IS WS-FILE-STATUS.
071100200615
071200200615           SELECT PRODUCT-TYPE-CODES
071300200615                  ASSIGN       TO DATABASE-MFAPRTCDP
071400200615                  ORGANIZATION IS INDEXED
071500200615                  ACCESS       IS RANDOM
071600200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
071700200615                  FILE STATUS  IS WS-FILE-STATUS.
071800200615
071900200615           SELECT ACCOUNT-INVESTMENT
072000200615                  ASSIGN       TO DATABASE-MFAACCIVP
072100200615                  ORGANIZATION IS INDEXED
072200200615                  ACCESS       IS DYNAMIC
072300200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
072400200615                  FILE STATUS  IS WS-FILE-STATUS.
072500200615
072600200615           SELECT ACCOUNT
072700200615                  ASSIGN       TO DATABASE-MFAACCNTP
072800200615                  ORGANIZATION IS INDEXED
072900200615                  ACCESS       IS RANDOM
073000200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
073100200615                  FILE STATUS  IS WS-FILE-STATUS.
073200200615
073300200615           SELECT GIC-CERTIFICATE-DETAILS-1
073400200615                  ASSIGN       TO DATABASE-MFAGICDLA
073500200615                  ORGANIZATION IS INDEXED
073600200615                  ACCESS       IS DYNAMIC
073700200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
073800200615                                  WITH DUPLICATES
073900200615                  FILE STATUS  IS WS-FILE-STATUS.
074000200615
074100200615           SELECT GIC-CERTIFICATE-DETAILS-2
074200200615                  ASSIGN       TO DATABASE-MFAGICDP
074300200615                  ORGANIZATION IS INDEXED
074400200615                  ACCESS       IS RANDOM
074500200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
074600200615                  FILE STATUS  IS WS-FILE-STATUS.
074700200615
074800200615           SELECT TRANS
074900200615                  ASSIGN       TO DATABASE-MFATRNP
075000200615                  ORGANIZATION IS INDEXED
075100200615                  ACCESS       IS RANDOM
075200200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
075300200615                  FILE STATUS  IS WS-FILE-STATUS.
075400200615
075500200615           SELECT TRANS-2
075600200615                  ASSIGN       TO DATABASE-MFATRNLZ
075700200615                  ORGANIZATION IS INDEXED
075800200615                  ACCESS       IS DYNAMIC
075900200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
076000200615                               WITH DUPLICATES
076100200615                  FILE STATUS  IS WS-FILE-STATUS.
076200200615
076300200615           SELECT GIC-INT-WORKFILE
076400200615                  ACCESS       IS SEQUENTIAL
076500200615                  ASSIGN TO DATABASE-MFAGIWRP
076600200615                  FILE STATUS  IS WS-FILE-STATUS.
076700200615
076800200615           SELECT INTCLC-REJECTION
076900200615                  ACCESS       IS SEQUENTIAL
077000200615                  ASSIGN TO DATABASE-MFAGICREJ
077100200615                  FILE STATUS  IS WS-FILE-STATUS.
077200200615
077300200615           SELECT GIC-INT-ADJUST-REASON-DTL-IDX2                        RFS10258
077400200615                  ASSIGN       TO DATABASE-MFAGIARDLA                   RFS10258
077500200615                  ORGANIZATION IS INDEXED                               RFS10258
077600200615                  ACCESS       IS DYNAMIC                               RFS10258
077700200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY              RFS10258
077800200615                                  WITH DUPLICATES                       RFS10258
077900200615                  FILE STATUS  IS WS-FILE-STATUS.                       RFS10258
078000200615
078100200615      *RFS 12825 - START
078200200615
078300200615           SELECT GIC-INT-ADJUST-REASON-DTL-IDXL                        RFS10258
078400200615                  ASSIGN       TO DATABASE-MFAGIARDL                    RFS10258
078500200615                  ORGANIZATION IS INDEXED                               RFS10258
078600200615                  ACCESS       IS DYNAMIC                               RFS10258
078700200615                  RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY              RFS10258
078800200615                  FILE STATUS  IS WS-FILE-STATUS.                       RFS10258
078900200615      *RFS 12825 - END
079000200615      * RFS138276 Starts
079100200615           SELECT  INVESTOR
079200200615             ASSIGN       TO DATABASE-MFAIVRP
079300200615             ORGANIZATION IS INDEXED
079400200615             ACCESS       IS RANDOM
079500200615             RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
079600200615             FILE STATUS  IS WS-FILE-STATUS.
079700200615
079800200615           SELECT ACCOUNT-GROUP
079900200615             ASSIGN       TO DATABASE-MFAACCGPLA
080000200615             ORGANIZATION IS INDEXED
080100200615             ACCESS       IS RANDOM
080200200615             RECORD KEY   IS EXTERNALLY-DESCRIBED-KEY
080300200615             FILE STATUS  IS WS-FILE-STATUS.
080400200615      * RFS138276 Ends
080500200615
080600200615      /
080700200615       DATA DIVISION.
080800200615
080900200615      ******************************************************************
081000200615      *                                                                *
081100200615      *    D A T A   D I V I S I O N                                   *
081200200615      *                                                                *
081300200615      ******************************************************************
081400200615      /
081500200615       FILE SECTION.
081600200615
081700200615      ******************************************************************
081800200615      *                                                                *
081900200615      *    F I L E   S E C T I O N                                     *
082000200615      *                                                                *
082100200615      ******************************************************************
082200200615
082300200615      * RFS 138307 - begin
082400200615      * Change READ of SORTED-GTR to GIC-JLA-TMP
082500200615      *FD  SORTED-GTR
082600200615      *    LABEL RECORDS ARE STANDARD.
082700200615      *
082800200615      *01  SORTED-GTR-REC.                    COPY DD-ALL-FORMATS
082900200615      *                                       OF MFAGICJLA.
083000200615      * RFS 138307 - end
083100200615      * RFS 138307 - begin
083200200615       FD  GIC-JLA-TMP
083300200615           LABEL RECORDS ARE STANDARD.
083400200615       01  GIC-JLA-TMP-REC.                   COPY DD-ALL-FORMATS
083500200615                                              OF GICJLATMP.
083600200615      * RFS 138307 - end
083700200615
083800200615       FD  ACCOUNT-NOMINEE
083900200615           LABEL RECORDS ARE STANDARD.
084000200615
084100200615       01  ACCOUNT-NOMINEE-REC.          COPY DD-ALL-FORMATS
084200200615                                         OF MFAACCNMP.
084300200615
084400200615       FD  DII-RATE-SET
084500200615           LABEL RECORDS ARE STANDARD.
084600200615
084700200615       01  DII-RATE-SET-REC.             COPY DD-ALL-FORMATS
084800200615                                         OF MFADIIRSLA.
084900200615
085000200615      *FD  ACCOUNT-TYPE
085100200615      *    LABEL RECORDS ARE STANDARD.
085200200615      *
085300200615      *01  ACCOUNT-TYPE-REC.             COPY DD-ALL-FORMATS
085400200615      *                                  OF MFAACCTYP.
085500200615
085600200615       FD  TRANS-INTEREST-DETAILS
085700200615           LABEL RECORDS ARE STANDARD.
085800200615
085900200615       01  TID-REC.                      COPY DD-ALL-FORMATS
086000200615                                         OF MFATRNIDP.
086100200615
086200200615       FD  PAYMENT-TYPE-CODES
086300200615           LABEL RECORDS ARE STANDARD.
086400200615
086500200615       01  PAYMENT-TYPE-CODES-REC.       COPY DD-ALL-FORMATS
086600200615                                         OF MFAPMTTYP.
086700200615
086800200615       FD  GIC-RATES
086900200615           LABEL RECORDS ARE STANDARD.
087000200615
087100200615       01  GIC-RATES-REC.                     COPY DD-ALL-FORMATS
087200200615                                              OF MFAGIRTP.
087300200615
087400200615       FD  GIC-PENALTY-RATE-SCHEDULE
087500200615           LABEL RECORDS ARE STANDARD.
087600200615
087700200615       01  GIC-PENALTY-RATE-SCHEDULE-REC. COPY DD-ALL-FORMATS
087800200615                                              OF MFAGIPRSP.
087900200615
088000200615       FD  GIC-TERM
088100200615           LABEL RECORDS ARE STANDARD.
088200200615
088300200615       01  GIC-TERM-REC.                 COPY DD-ALL-FORMATS
088400200615                                             OF MFAGITP.
088500200615                                                                        RFS8371
088600200615       FD  GIC-TERM-IDX2                                                RFS8371
088700200615           LABEL RECORDS ARE STANDARD.                                  RFS8371
088800200615       01  GIC-TERM-IDX2-REC.            COPY DD-ALL-FORMATS            RFS8371
088900200615                                             OF MFAGITLA.               RFS8371
089000200615
089100200615                                                                        RFS8371
089200200615       FD  GIC-TERM-GRP-CODES-ALW-IDXL                                  RFS8371
089300200615           LABEL RECORDS ARE STANDARD.                                  RFS8371
089400200615       01  GIC-TERM-GRP-CODES-ALW-IDXL-R. COPY DD-ALL-FORMATS           RFS8371
089500200615                                             OF MFAGITGAL.              RFS8371
089600200615
089700200615       FD  GIC-TERM-GROUP                                               RFS8371
089800200615           LABEL RECORDS ARE STANDARD.                                  RFS8371
089900200615       01  GIC-TERM-GROUP-REC.          COPY DD-ALL-FORMATS             RFS8371
090000200615                                             OF MFAGITGP.               RFS8371
090100200615
090200200615       FD  GIC-TERM-GROUP-ACCOUNT-TYPES                                 RFS8371
090300200615           LABEL RECORDS ARE STANDARD.                                  RFS8371
090400200615       01  GIC-TERM-GROUP-ACCOUNT-TYPES-R. COPY DD-ALL-FORMATS          RFS8371
090500200615                                             OF MFAGITACP.              RFS8371
090600200615
090700200615       FD  INVESTMENT-DII-RATES
090800200615           LABEL RECORDS ARE STANDARD.
090900200615
091000200615       01  INVESTMENT-DII-RATES-REC.     COPY DD-ALL-FORMATS
091100200615                                             OF MFADIIIRP.
091200200615
091300200615       FD  INVESTMENT
091400200615           LABEL RECORDS ARE STANDARD.
091500200615
091600200615       01  INVESTMENT-REC.               COPY DD-ALL-FORMATS
091700200615                                             OF MFAINVP.
091800200615
091900200615       FD  PRODUCT-TYPE-CODES
092000200615           LABEL RECORDS ARE STANDARD.
092100200615
092200200615       01  PRODUCT-TYPE-CODES-REC.       COPY DD-ALL-FORMATS
092300200615                                             OF MFAPRTCDP.
092400200615
092500200615       FD  ACCOUNT-INVESTMENT
092600200615           LABEL RECORDS ARE STANDARD.
092700200615
092800200615       01  ACCOUNT-INVESTMENT-REC.       COPY DD-ALL-FORMATS
092900200615                                             OF MFAACCIVP.
093000200615
093100200615       FD  ACCOUNT
093200200615           LABEL RECORDS ARE STANDARD.
093300200615
093400200615       01  ACCOUNT-REC.                  COPY DD-ALL-FORMATS
093500200615                                             OF MFAACCNTP.
093600200615
093700200615       FD  GIC-CERTIFICATE-DETAILS-1
093800200615           LABEL RECORDS ARE STANDARD.
093900200615
094000200615       01  GIC-CERTIFICATE-DETAILS-1-REC. COPY DD-ALL-FORMATS
094100200615                                             OF MFAGICDLA.
094200200615
094300200615       FD  GIC-CERTIFICATE-DETAILS-2
094400200615           LABEL RECORDS ARE STANDARD.
094500200615
094600200615       01  GIC-CERTIFICATE-DETAILS-2-REC. COPY DD-ALL-FORMATS
094700200615                                             OF MFAGICDP.
094800200615
094900200615       FD  TRANS
095000200615           LABEL RECORDS ARE STANDARD.
095100200615
095200200615       01  TRANS-REC.                    COPY DD-ALL-FORMATS
095300200615                                             OF MFATRNP.
095400200615
095500200615       FD  TRANS-2
095600200615           LABEL RECORDS ARE STANDARD.
095700200615
095800200615       01  TRANS-2-REC.                  COPY DD-ALL-FORMATS
095900200615                                             OF MFATRNLZ.
096000200615
096100200615       FD  GIC-INT-WORKFILE
096200200615           LABEL RECORDS ARE STANDARD.
096300200615
096400200615       01  GIC-INT-WORKFILE-REC.
096500200615           06 ACCOUNT-NO            PIC 9(09).
096600200615           06 INVESTMENT-CODE       PIC X(05).
096700200615           06 CERTIFICATE-ID-NO     PIC 9(10).
096800200615           06 ACCRUAL-AMT           PIC S9(11)V99 COMP-3.
096900200615
097000200615       FD  INTCLC-REJECTION
097100200615           LABEL RECORDS ARE STANDARD.
097200200615
097300200615       01  INTCLC-REJECTION-REC.
097400200615           06 REJ-ACCOUNT-NO             PIC 9(09).
097500200615           06 REJ-INVESTMENT-CODE        PIC X(05).
097600200615           06 REJ-CERTIFICATE-ID-NO      PIC 9(10).
097700200615           06 REJ-REJECTION-CODE         PIC X(03).
097800200615
097900200615      *RFS 12825 - START
098000200615       FD  GIC-INT-ADJUST-REASON-DTL-IDXL                               RFS10258
098100200615           LABEL RECORDS ARE STANDARD.                                  RFS10258
098200200615       01  GIC-INT-ADJUST-REASON-REC.                                   RFS10258
098300200615           COPY DD-ALL-FORMATS               OF MFAGIARDL.              RFS10258
098400200615      *RFS 12825 - END
098500200615
098600200615       FD  GIC-INT-ADJUST-REASON-DTL-IDX2                               RFS10258
098700200615           LABEL RECORDS ARE STANDARD.                                  RFS10258
098800200615       01  GIC-INT-ADJUST-REASON-DTL-REC.                               RFS10258
098900200615           COPY DD-ALL-FORMATS               OF MFAGIARDLA.             RFS10258
099000200615
099100200615      * RFS138276 Starts
099200200615       FD  INVESTOR
099300200615           LABEL RECORDS ARE STANDARD.
099400200615       01  INVESTOR-REC.         COPY DD-ALL-FORMATS OF MFAIVRP.
099500200615
099600200615       FD  ACCOUNT-GROUP
099700200615           LABEL RECORDS ARE STANDARD.
099800200615       01  ACCOUNT-GROUP-REC.    COPY DD-ALL-FORMATS OF MFAACCGPLA.
099900200615      * RFS138276 Ends
100000200615      /
100100200615       WORKING-STORAGE SECTION.
100200200615
100300200615      ******************************************************************
100400200615      *                                                                *
100500200615      *    W O R K I N G   S T O R A G E   S E C T I O N               *
100600200615      *                                                                *
100700200615      ******************************************************************
100800200615R14153 01 WS-OPEN-FILE                   PIC X(1).
100900200615      * Literals
101000200615       01 LT-VARS.                                                       RFS9224
101100200615          05 LT-A                         PIC X(01)     VALUE "A".       RFS9224
101200200615          05 LT-COMPOUND                  PIC X(01)     VALUE "A".      RFS11367
101300200615          05 LT-CLOSE                     PIC X(01)     VALUE "C".       RFS9657
101400200615          05 LT-HSC                       PIC X(03)     VALUE "HSC".     RFS9029
101500200615          05 LT-MA                        PIC X(02)     VALUE "MA".      RFS8371
101600200615          05 LT-LONG-TERM                 PIC S9(02)V99 VALUE 1.000.     RFS8371
101700200615      * RFS11324 - Begin
101800200615          05 LT-CA                        PIC X(02)     VALUE "CA".      RFS8371
101900200615185374    05 LT-CD                        PIC X(02)     VALUE "CD".
102000200615          05 LT-0228                      PIC 9(04)     VALUE 0228.      RFS8371
102100200615          05 LT-LEAP-MMDD                 PIC 9(04)     VALUE 0229.      RFS8371
102200200615          05 LT-LEAP-MM                   PIC 9(04)     VALUE 02.        RFS8371
102300200615      * RFS11324 - End
102400200615
102500200615      * RFS 138307 - begin
102600200615          COPY CPYSQLFLD
102700200615               REPLACING    "CURRENT_PROGRAM"  BY "INTCLC    ".
102800200615
102900200615           EXEC SQL
103000200615             INCLUDE SQLCA
103100200615           END-EXEC.
103200200615
103300200615           EXEC SQL
103400200615             INCLUDE SQLDA
103500200615           END-EXEC.
103600200615
103700200615       01 lc-Open-GICJLA                  PIC X(01).
103800200615          88 Open-GICJLA              VALUE "Y".
103900200615          88 NotOpen-GICJLA           VALUE "N".
104000200615      * RFS 138307 - end
104100200615
104200200615       01 WS-DISTR-OPTION-CODE            PIC X(01).                    RFS8582
104300200615          88 WS-DISTR-OPTION-DII-REINVEST VALUE "N".                    RFS8582
104400200615          88 WS-DISTR-OPTION-DII-R        VALUE "R".                    RFS8582
104500200615      /
104600200615       01 WS-GICTRNJOIN-PARMS.
104700200615          05 WS-GICTRNJOIN-MODE           PIC X(01) VALUE SPACES.
104800200615          05 WS-GICTRNJOIN-CERTIFICATE    PIC X(10) VALUE SPACES.
104900200615
105000200615       01 WS-INV-MESSAGE.
105100200615          05 WS-INV-MSG                   PIC X(43) VALUE SPACES.
105200200615          05 WS-INV-MSG-INV               PIC X(05) VALUE SPACES.
105300200615
105400200615       01 WS-CALC-FIELD                   PIC 9(09)V999999999            RFS8371
105500200615                                                    VALUE ZEROES.
105600200615       01 WS-FREQUENCY                    PIC X(02) VALUE SPACES.        RFS8371
105700200615
105800200615       01 WS-PENALTY-FOUND                PIC X(01) VALUE SPACES.
105900200615          88  PENALTY-FOUND               VALUE "Y".
106000200615          88  PENALTY-NOT-FOUND           VALUE "N".
106100200615
106200200615       01 WS-PENALTY-TRXN-TYPE            PIC X(01) VALUE SPACES.
106300200615          88  SEL-MVA-PENALTY             VALUE "Y".
106400200615
106500200615      * ---------------------------------                                FIX09
106600200615      *01 WS-PASS-END-DATE-OPTION         PIC X(01) VALUE SPACES.        FIX09
106700200615      *   88  END-DATE-PASSED             VALUE "Y".                     FIX09
106800200615      *   88  NO-END-DATE-PASSED          VALUE "N".                     FIX09
106900200615      * ---------------------------------
107000200615
107100200615       01 GIC-PENALTY-RATE-SCHEDUL2-REC.  COPY DD-ALL-FORMATS
107200200615                                          OF MFAGIPRSP.
107300200615
107400200615       01 GIC-CERTIFICATE-DETAILS-3-REC.  COPY DD-ALL-FORMATS
107500200615                                          OF MFAGICDLA.
107600200615
107700200615      *01 WS-RANGE-INTEREST-RATE          PIC S9(1)V9(7) COMP-3         FIX07
107800200615       01 WS-RANGE-INTEREST-RATE          PIC S9(1)V9(09) COMP-3        FIX07
107900200615                                                    VALUE ZEROES.
108000200615      *01 WS-RANGE-INTEREST-DOLLARS       PIC S9(09)V99                 FIX06
108100200615      *                                             VALUE ZEROES.       FIX06
108200200615       01 WS-RANGE-INTEREST-DOLLARS       PIC S9(09)V9(09)              FIX06
108300200615                                                    VALUE ZEROES.       FIX06
108400200615      *01 WS-BALANCE                      PIC S9(09)V99                 FIX06
108500200615      *                                             VALUE ZEROES.       FIX06
108600200615       01 WS-BALANCE                      PIC S9(09)V9(07)              FIX06
108700200615                                                    VALUE ZEROES.       FIX06
108800200615       01 WS-PREV-CLOSING-UNIT-BAL        PIC S9(09)V9(07)              RFS9224
108900200615                                                    VALUE ZEROES.       RFS9224
109000200615      * RFS11324 - Begin                                                RFS9224
109100200615       01 WS-NEXT-ANNIV-DATE              PIC 9(08) VALUE ZEROES.       RFS9029
109200200615       01 WS-NEXT-ANNIV-DATE-R REDEFINES WS-NEXT-ANNIV-DATE.            RFS9029
109300200615          05 WS-NEXT-ANNIV-CCYY                 PIC 9(04).
109400200615          05 WS-NEXT-ANNIV-MMDD                 PIC 9(04).
109500200615      * RFS11324 - End                                                  RFS9224
109600200615
109700200615       01 WS-FIRST-TRADE-DATE             PIC S9(08) VALUE ZEROES.      RFS9029
109800200615       01 WS-PREV-SPLIT-OPTION-CODE       PIC X(01) VALUE SPACES.       RFS9224
109900200615       01 WS-TOTAL-DAYS                   PIC 9(07) VALUE ZEROES.
110000200615
110100200615       01 WS-EXIT-PROGRAM                 PIC X(01) VALUE SPACES.
110200200615          88 EXIT-PROGRAM                 VALUE "Y".
110300200615
110400200615
110500200615      * RFS11324 - Begin
110600200615       01 WS-DATE-BUFFER.
110700200615          05  WS-DATE-BUFFER-YYYY         PIC 9(04)     VALUE ZEROES.
110800200615          05  WS-DATE-BUFFER-MM           PIC 9(02)     VALUE ZEROES.
110900200615          05  WS-DATE-BUFFER-DD           PIC 9(02)     VALUE ZEROES.
111000200615       01 WS-DATE-BUFFER2 REDEFINES WS-DATE-BUFFER.
111100200615          05  FILLER                      PIC 9(04).
111200200615          05  WS-DATE-BUFFER-MMDD         PIC 9(04).
111300200615      * RFS11324 - End
111400200615
111500200615       01 WS-DATE-BUFFERS.
111600200615          05 WS-NEXT-TRANS-DATE           PIC 9(08)     VALUE ZEROES.
111700200615          05 WS-JULIAN-START-DATE         PIC 9(08)     VALUE ZEROES.
111800200615          05 WS-JULIAN-END-DATE           PIC 9(08)     VALUE ZEROES.
111900200615          05 WS-EFFECTIV-DATE             PIC 9(08)     VALUE ZEROES.
112000200615          05 WS-NEXT-INT-CHG-DATE         PIC 9(08)     VALUE ZEROES.
112100200615          05 WS-START-DATE                PIC 9(08)     VALUE ZEROES.
112200200615
112300200615          05 WS-ADJ-START-DATE            PIC 9(08)     VALUE ZEROES.   RFS8582
112400200615          05 WS-ADJ-END-DATE              PIC 9(08)     VALUE ZEROES.   RFS8582
112500200615
112600200615          05 WS-CURR-START-DATE           PIC 9(08)     VALUE ZEROES.   RFS8582
112700200615          05 WS-CURR-END-DATE             PIC 9(08)     VALUE ZEROES.   RFS8582
112800200615
112900200615      *   05 WS-SAVE-START-DATE           PIC 9(08)     VALUE ZEROES.   FIX09
113000200615          05 WS-END-DATE                  PIC 9(08)     VALUE ZEROES.
113100200615          05 WS-DATE                      PIC 9(08)     VALUE ZEROES.
113200200615          05 WS-TODAY                     PIC 9(08)     VALUE ZEROES.
113300200615          05 WS-PROCESS-DATE              PIC 9(08)     VALUE ZEROES.
113400200615          05 WS-AS-AT-DATE                PIC 9(08)     VALUE ZEROES.   RFS8371
113500200615          05 WS-NEW-YEARS-DAY             PIC 9(08)     VALUE ZEROES.
113600200615          05 WS-DATE-BREAKDOWN.
113700200615             10 WS-YYYY                   PIC 9(04)     VALUE ZEROES.
113800200615             10 WS-MM                     PIC 9(02)     VALUE ZEROES.
113900200615             10 WS-DD                     PIC 9(02)     VALUE ZEROES.
114000200622
114100200622      * RFS1101805 Starts
114200200622          05 WS-YEAR-END-DATE.
114300200622             10 WS-YEND-YYYY              PIC 9(04)     VALUE ZEROES.
114400200622             10 WS-YEND-MMDD              PIC 9(04)     VALUE ZEROES.
114500200622          05 WS-CNV-STR-DATE.
114600200622             10 WS-CNV-YYYY               PIC 9(04)     VALUE ZEROES.
114700200622             10 WS-CNV-MMDD               PIC 9(04)     VALUE ZEROES.
114800200622      * RFS1101805 Ends
114900200622
115000200615       01 WS-PREV-GIC-RATES.
115100200615          05 WS-PREV-TERM-GROUP           PIC X(10)     VALUE SPACES.
115200200615          05 WS-PREV-TERM-CODE            PIC X(05)     VALUE SPACES.
115300200615          05 WS-PREV-UP-TO-DATE           PIC 9(08)     VALUE ZEROES.
115400200615          05 WS-PREV-POSTED-RATE          PIC 9(02)V999 VALUE ZEROES.
115500200615
115600200615       01 WS-PREV-TRANS-1.
115700200615          05 WS-PREV-PROCESS-DATE-1       PIC 9(08)     VALUE ZEROES.
115800200615          05 WS-PREV-TRADE-DATE-1         PIC 9(08)     VALUE ZEROES.
115900200615      *   05 WS-PREV-GROSS-AMT-1          PIC S9(09)V99 VALUE ZEROES.   FIX06
116000200615          05 WS-PREV-GROSS-AMT-1        PIC S9(09)V9(07) VALUE ZEROES.  FIX06
116100200615          05 WS-PREV-TRANS-TYPE-CODE-1    PIC X(04)     VALUE SPACES.
116200200615          05 WS-PREV-TRANS-STATUS-CODE-1  PIC X(03).
116300200615
116400200615       01 WS-PREV-TRANS-2.
116500200615          05 WS-PREV-PROCESS-DATE-2       PIC 9(08)     VALUE ZEROES.
116600200615          05 WS-PREV-TRADE-DATE-2         PIC 9(08)     VALUE ZEROES.
116700200615      *   05 WS-PREV-GROSS-AMT-2          PIC S9(09)V99 VALUE ZEROES.   FIX06
116800200615          05 WS-PREV-GROSS-AMT-2        PIC S9(09)V9(07) VALUE ZEROES.  FIX06
116900200615          05 WS-PREV-TRANS-TYPE-CODE-2    PIC X(04)     VALUE SPACES.
117000200615          05 WS-PREV-REVERSAL-CODE-2      PIC X(04)     VALUE SPACES.   RFS10382
117100200615            88 WS-PREV-REV-CODE-2-DADJ    VALUE "DADJ".                 RFS10382
117200200615
117300200615      * RFS11986 - Begin
117400200615       01 WS-REV-CODE                  PIC X(04)     VALUE SPACES.      RFS10382
117500200615         88 WS-REV-CODE-DADJ           VALUE "DADJ".                    RFS10382
117600200615      * RFS11986 - End
117700200615
117800200615      * RFS11367 - Begin
117900200615      * WS-PREV-TRADE-DATE-3 will have previous trade date of
118000200615      * REDEMPTION, PURCHASE or Compound interest
118100200615      * to do reconciliation
118200200615       01 WS-PREV-TRANS-3.
118300200615          05 WS-PREV-TRADE-DATE-3         PIC 9(08)     VALUE ZEROES.
118400200615      * RFS11367 - End
118500200615
118600200615          05 WS-PREV-PLACEMENT-DATE-2     PIC S9(09)    VALUE ZEROES.   RFS8582
118700200615          05 WS-PREV-TRANS-NO-2           PIC S9(09)    VALUE ZEROES.   RFS8582
118800200615
118900200615          05 WS-PREV-PAYMENT-TYPE-2       PIC X(01)     VALUE SPACE.    RFS8582
119000200615             88 WS-PREV-PAYMENT-TYPE-2-SPACE            VALUE SPACE.
119100200615             88 WS-PREV-PAYMENT-TYPE-2-N                VALUE "N".      RFS12054
119200200615             88 WS-PREV-PAYMENT-TYPE-2-REINV            VALUES SPACE    RFS12054
119300200615                                                               "N".     RFS12054
119400200615
119500200615       01 WS-PREV-IDR.
119600200615          05 WS-PREV-EFFECTIV-DATE        PIC 9(08)      VALUE ZEROES.
119700200615      *   05 WS-PREV-DAILY-RATE           PIC S9(1)V9(7) COMP-3         FIX07
119800200615          05 WS-PREV-DAILY-RATE           PIC S9(1)V9(09) COMP-3        FIX07
119900200615                                                         VALUE ZEROES.
120000200615       01 WS-PASS-MODE                    PIC X(02).
120100200615          88 VALID-MODE                   VALUES "A " "AE" "AM" "A1"    RFS12320
120200200615                                                 "C " "CE" "CM"
120300200615                                                 "D " "DE"
120400200615                                                 "G " "GE" "GM"
120500200615                                                 "V " "VE" "VM"
120600200615112133                                           "V1"
120700200615137231                                           "V2"
120800200615      * 1017021 - Begin
120900200615                                                 "V3"
121000200615      * 1017021 - End
121100200615                                                 "TE" "IE" "EE"
121200200615                                                 "PD"                   RFS8582
121300200615                                                 "SE"                   RFS11106
121400200615148358                                           "GD"
121500200615                                                 "EG".                  RFS15421
121600200615          88 BATCH-MODE                   VALUES "G " "GE" "GM"
121700200615148358                                           "GD"
121800200615                                                 "D " "DE".
121900200615          88 ONLINE-MODE                  VALUES "A " "AE" "AM" "A1"    RFS12320
122000200615                                                 "V " "VE" "VM"
122100200615112133                                           "V1"
122200200615137231                                           "V2"
122300200615      * 1017021 - Begin
122400200615                                                 "V3"
122500200615      * 1017021 - End
122600200615                                                 "C " "CE" "CM" "EE".
122700200615          88 TRNPST-MODE                  VALUES "T " "TE" "TM".
122800200615          88 INTEREST-MODE                VALUES "I " "IE" "IM"
122900200615                                                 "SE"                   RFS11106
123000200615                                                 "EG".                  RFS15421
123100200615          88 GIC-BATCH-MODE               VALUES "G " "GE" "GM".
123200200615          88 DII-BATCH-MODE               VALUES "D " "DE".
123300200615148358    88 GICDII-BATCH-MODE            VALUES "GD".
123400200615          88 ACCOUNT-MODE                 VALUES "A " "AE" "AM" "EE"
123500200615                                                 "A1".                  RFS12320
123600200615          88 INVESTMENT-MODE              VALUES "V " "VE" "VM" "IE"
123700200615112133                                           "V1"
123800200615137231                                           "V2"
123900200615      * 1017021 - Begin
124000200615                                                 "V3"
124100200615      * 1017021 - End
124200200615
124300200615                                                 "SE" "EG".             RFS11106
124400200615          88 CERTIFICATE-MODE             VALUES "C " "CE" "CM"
124500200615                                                 "TE" "IE"
124600200615                                                 "SE"                   RFS11106
124700200615                                                 "EG".                  RFS15421
124800200615
124900200615          88 EARLY-REDEMPTION-MODE        VALUES "GE" "DE"
125000200615                                                 "AE" "VE" "CE"
125100200615                                                 "TE" "IE" "EE"
125200200615                                                 "SE"                   RFS11106
125300200615137231                                           "V2"
125400200615      * 1017021 - Begin
125500200615                                                 "V3"
125600200615      * 1017021 - End
125700200615                                                 "EG".                  RFS15421
125800200615
125900200615          88 ESTATE-EARLY-REDEMPTION-MODE VALUE  "EE".
126000200615          88 STMT-INTEREST-MODE           VALUE  "SE".                  RFS11106
126100200615
126200200615          88 UNTIL-MATURITY-MODE          VALUES "GM" "AM" "VM" "CM".
126300200615          88 DEF-END-DATE-MODE            VALUES "G " "D " "A" "V" "C"
126400200615112133                                           "V1"
126500200615148358                                           "GD"
126600200615                                                 "A1".                  RFS12320
126700200615
126800200615          88 TRNPST-TE-MODE               VALUES "TE".                  RFS8371
126900200615          88 DII-ADJUSTMENT-MODE          VALUES "PD".                  RFS8582
127000200615          88 ACCOUNT-A1-MODE              VALUES "A1".                  RFS8582
127100200615      *start rfs 13301
127200200615          88 MATURITY-SELL-MODE           VALUES "GM".                  RFS8582
127300200615      *end   rfs 13301
127400200615          88 ESTATE-INTEREST-MODE         VALUE  "EG".                  RFS15421
127500200615112133    88 ACCOUNT-V1-MODE              VALUE  "V1".                  RFS15421
127600200615137231    88 ACCOUNT-V2-MODE              VALUE  "V2".                  RFS15421
127700200615      * 1017021 - Begin
127800200615          88 ACCOUNT-V3-MODE              VALUE  "V3".
127900200615      * 1017021 - End
128000200615
128100200615
128200200615       01 WS-CERTIFICATE-FOUND            PIC X(01) VALUE SPACES.
128300200615          88 CERTIFICATE-FOUND            VALUE "Y".
128400200615          88 CERTIFICATE-NOT-FOUND        VALUE "N".
128500200615
128600200615       01 WS-VALID-CERTIFICATE            PIC X(01).
128700200615          88 VALID-CERTIFICATE            VALUE "Y".
128800200615          88 INVALID-CERTIFICATE          VALUE "N".
128900200615
129000200615       01 WS-VALID-TRANS-2                PIC X(01).
129100200615          88 VALID-TRANS                  VALUE "Y".
129200200615          88 INVALID-TRANS                VALUE "N".
129300200615
129400200615       01 WS-VALID-IDR                    PIC X(01).
129500200615          88 VALID-IDR                    VALUE "Y".
129600200615          88 INVALID-IDR                  VALUE "N".
129700200615
129800200615       01 TRANSACTION-CATAGORIES.
129900200615          05 TRANS-CATAGORY              PIC X(3).
130000200615             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI" "BAJ".
130100200615             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO" "SAJ"
130200200615                                                "TFE" "CQD" "FEE".
130300200615             88 INTEREST-TRANSACTION     VALUES "INT".
130400200615             88 CONVERTED-TRANSACTION    VALUES "SAJ".                  RFS11592
130500200615
130600200615      *      88 ADDITION-TRANSACTION     VALUES "BUY" "INC" "CPG" "BAJ" FIX09
130700200615      *                                         "SWI" "TRI" "INT" "MFR".FIX09
130800200615      *      88 REDUCTION-TRANSACTION    VALUES "SEL" "SWO" "TRO"       FIX09
130900200615      *                                         "TFE" "CQD" "FEE" "SAJ".FIX09
131000200615             88 VALID-TRANSACTION        VALUES "BUY" "SEL" "SWI"
131100200615                                                "SWO" "TRI" "TRO"
131200200615                                                "CPG" "INC" "INT"
131300200615                                                "TFE" "CQD" "FEE"
131400200615                                                "MFR" "SAJ" "BAJ".
131500200615
131600200615             88 TRANS-SEL                VALUES "SEL".                  RFS9224
131700200615
131800200615       01 WS-DII-SET                      PIC X(06)     VALUE SPACES.
131900200615       01 WS-SKIP-DETAILS                 PIC X(01)     VALUE SPACES.
132000200615       01 WS-GIC-BALANCE                  PIC S9(09)V99 VALUE ZEROES.
132100200615141725 01 WS-GIC-TOT-BAL                  PIC S9(09)V99 VALUE ZEROES.
132200200615       01 WS-GIC-BAL-FOR-THE-DATE         PIC S9(09)V99 VALUE ZEROES.   RFS9029
132300200615      * Total interest paid and total interest claculated
132400200615       01 WS-TOTAL-INT-PAID             PIC S9(09)V9(07) VALUE ZEROES.  RFS10258
132500200615      *RFS 21211 - start
132600200615      *01 WS-TOTAL-INT-CALCULATED       PIC S9(09)V9(07) VALUE ZEROES.  RFS10258
132700200615       01 WS-TOTAL-INT-CALCULATED       PIC S9(09)V9(02) VALUE ZEROES.
132800200615      *RFS 21211 - end
132900200615       01 WS-INT-CALCULATED             PIC S9(09)V9(07) VALUE ZEROES.  RFS10258
133000200615
133100200615      *01 WS-ACCRUAL-AMT                  PIC S9(09)V99 VALUE ZEROES.   FIX06
133200200615
133300200615       01 WS-TOTAL-ACCRUAL-AMT          PIC S9(09)V9(07) VALUE ZEROES.  RFS12320
133400200615
133500200615       01 WS-ACCRUAL-AMT                PIC S9(09)V9(07) VALUE ZEROES.  FIX06
133600200615      * Use for rounding                                                RFS9603
133700200615       01 WS-TEMP-AMT                   PIC S9(11)V9(02) VALUE ZEROES.  RFS9603
133800200615142159 01 WS-ACCRUAL-AMT-2              PIC S9(11)V9(02) VALUE ZEROES.
133900200615
134000200615       01 WS-ACCRUAL-AMT-PER-GRP        PIC S9(09)V9(07) VALUE ZEROES.  RFS9240
134100200615
134200200615      *RFS 12825 - START
134300200615       01 WS-ADJUSTMENT-AMOUNT          PIC S9(09)V9(02) VALUE ZEROES.  RFS9240
134400200615      *RFS 12825 - END
134500200615
134600200615      *01 WS-TOTAL-DII-DOLLARS            PIC S9(09)V99 VALUE ZEROES.   FIX06
134700200615       01 WS-TOTAL-DII-DOLLARS          PIC S9(09)V9(09) VALUE ZEROES.  FIX06
134800200615      * To calculate not compound value                                 FRS9603
134900200615       01 WS-TOTAL-DII-NOT-COMPOUND     PIC S9(09)V9(09) VALUE ZEROES.  FRS9603
135000200615
135100200615       01 WS-BASE-RATE                    PIC 9(02)V999 VALUE ZEROES.
135200200615       01 WS-RATE-DIFFERENCE              PIC S9(02)V999 VALUE ZEROES.
135300200615       01 WS-NUM-OF-DAYS-REMAIN           PIC 9(04)     VALUE ZEROES.
135400200615       01 WS-NUM-OF-DAYS-ELAPSED          PIC 9(04)     VALUE ZEROES.
135500200615       01 WS-JULIAN-START                 PIC 9(04)     VALUE ZEROES.
135600200615       01 WS-JULIAN-END                   PIC 9(04)     VALUE ZEROES.
135700200615
135800200615       01 WS-FILE-STATUS                  PIC X(02)     VALUE SPACES.
135900200615          88 WS-FILE-STS-OK                             VALUES "  "     RFS8371
136000200615                                                               "00".    RFS8371
136100200615          88 END-OF-FILE                                VALUE "10".
136200200615          88 KEY-TOO-HIGH                               VALUE "14".
136300200615
136400200615       01 WS-END-FILE-VARIABLES.
136500200615          05 WS-END-OF-TRANS-2            PIC X(02)     VALUE SPACES.
136600200615             88 END-OF-TRANS-2                          VALUE "10".
136700200615          05 WS-END-OF-IDR                PIC X(02)     VALUE SPACES.
136800200615             88 END-OF-IDR                              VALUE "10".
136900200615          05 WS-END-OF-GTR                PIC X(02)     VALUE SPACES.
137000200615             88 END-OF-GTR                              VALUE "10".
137100200615
137200200615       01 WS-CTR                          PIC 9(04)     VALUE ZEROES.
137300200615
137400200615       01 WS-TEMP-VAR.                                                  RFS8371
137500200615          05 WS-TERM-DAYS-REMAIN          PIC S9(02)V999.               RFS8371
137600200615
137700200615       01 SW00-SWITCHES.                                                RFS8371
137800200615          05 SW00-STS-FLAG                       PIC X(01).             RFS8371
137900200615             88 SW00-STS-OK                      VALUE " ".             RFS8371
138000200615             88 SW00-STS-FAIL                    VALUE "1" "2" "3"      RFS8371
138100200615                                                       "4" "5" "6"      RFS8371
138200200615                                                       "7" "8" "9".     RFS8371
138300200615             88 SW00-STS-OPEN                    VALUE "1".             RFS8371
138400200615             88 SW00-STS-START                   VALUE "2".             RFS8371
138500200615             88 SW00-STS-READ                    VALUE "3".             RFS8371
138600200615             88 SW00-STS-REWRITE                 VALUE "4".             RFS8371
138700200615             88 SW00-STS-WRITE                   VALUE "5".             RFS8371
138800200615             88 SW00-STS-DELETE                  VALUE "6".             RFS8371
138900200615             88 SW00-STS-END                     VALUE "7".             RFS8371
139000200615             88 SW00-STS-CLOSE                   VALUE "8".             RFS8371
139100200615             88 SW00-STS-RANGE                   VALUE "9".             RFS8371
139200200615
139300200615       01 SW01-SWITCHES.                                                RFS8371
139400200615          05 SW01-STS-FLAG                       PIC X(01).             RFS8371
139500200615             88 SW01-STS-OK                      VALUE " ".             RFS8371
139600200615             88 SW01-STS-FAIL                    VALUE "1" "2" "3"      RFS8371
139700200615                                                       "4" "5" "6"      RFS8371
139800200615                                                       "7" "8" "9".     RFS8371
139900200615             88 SW01-STS-OPEN                    VALUE "1".             RFS8371
140000200615             88 SW01-STS-START                   VALUE "2".             RFS8371
140100200615             88 SW01-STS-READ                    VALUE "3".             RFS8371
140200200615             88 SW01-STS-REWRITE                 VALUE "4".             RFS8371
140300200615             88 SW01-STS-WRITE                   VALUE "5".             RFS8371
140400200615             88 SW01-STS-DELETE                  VALUE "6".             RFS8371
140500200615             88 SW01-STS-END                     VALUE "7".             RFS8371
140600200615             88 SW01-STS-CLOSE                   VALUE "8".             RFS8371
140700200615             88 SW01-STS-RANGE                   VALUE "9".             RFS8371
140800200615
140900200615       01 SW02-SWITCHES.                                                RFS8371
141000200615          05 SW02-STS-FLAG                       PIC X(01).             RFS8371
141100200615             88 SW02-STS-OK                      VALUE " ".             RFS8371
141200200615             88 SW02-STS-FAIL                    VALUE "1" "2" "3"      RFS8371
141300200615                                                       "4" "5" "6"      RFS8371
141400200615                                                       "7" "8" "9".     RFS8371
141500200615             88 SW02-STS-OPEN                    VALUE "1".             RFS8371
141600200615             88 SW02-STS-START                   VALUE "2".             RFS8371
141700200615             88 SW02-STS-READ                    VALUE "3".             RFS8371
141800200615             88 SW02-STS-REWRITE                 VALUE "4".             RFS8371
141900200615             88 SW02-STS-WRITE                   VALUE "5".             RFS8371
142000200615             88 SW02-STS-DELETE                  VALUE "6".             RFS8371
142100200615             88 SW02-STS-END                     VALUE "7".             RFS8371
142200200615             88 SW02-STS-CLOSE                   VALUE "8".             RFS8371
142300200615             88 SW02-STS-RANGE                   VALUE "9".             RFS8371
142400200615
142500200615       01 SW03-FLAGS.
142600200615         05 SW03-LAST-PERIOD-FLAG            PIC X(01) VALUE SPACES.
142700200615             88 SW03-LAST-PERIOD             VALUE "Y".                 RFS10258
142800200615             88 SW03-NOT-LAST-PERIOD         VALUE SPACES.              RFS10258
142900200615
143000200615         05 SW03-ADJ-FLAG                    PIC X(01) VALUE SPACES.
143100200615             88 SW03-ADJ-EXIST               VALUE "Y".                 RFS10258
143200200615             88 SW03-ADJ-NOT-EXIST           VALUE SPACES.              RFS10258
143300200615
143400200615      * RFS11592 - Begin
143500200615       01 SW04-FLAGS.
143600200615         05 SW04-CONVERT-FLAG                PIC X(01).                 RFS10258
143700200615             88 SW04-CONVERT-EXIST           VALUE "Y".                 RFS10258
143800200615             88 SW04-CONVERT-NOT-EXIST       VALUE SPACES.              RFS10258
143900200615      * RFS11592 - End
144000200615
144100200615       01 SW05-CHECK-DETAILS-REC                 PIC X(01).             RFS10404
144200200615          88  SW05-CHECK-DETAILS-1-REC           VALUE "1".             RFS10404
144300200615          88  SW05-CHECK-DETAILS-2-REC           VALUE "2".             RFS10404
144400200615
144500200615       01 SW09-RATE-FLAG                         PIC X(01).             RFS8371
144600200615          88 SW09-RATE-NOT-FOUND                 VALUE " ".             RFS8371
144700200615          88 SW09-RATE-FOUND                     VALUE "1".             RFS8371
144800200615      *
144900200615      * This flag is for special testing start balance for
145000200615      * converted data
145100200615      *
145200200615       01 SW10-CHK-START-BAL-FLAG                PIC X(01).             RFS9029
145300200615          88 SW10-CHK-START-BAL-NOT              VALUE " ".             RFS9029
145400200615          88 SW10-CHK-START-BAL                  VALUE "1".             RFS9029
145500200615
145600200615      * RFS11324 - Begin
145700200615       01 SW11-NEXT-ANNIV-FLAG                   PIC X(01) VALUE SPACE.
145800200615          88 SW11-NEXT-ANNIV-EXISTS              VALUE "Y".
145900200615          88 SW11-NEXT-ANNIV-NOT-EXISTS          VALUE SPACES.
146000200615      * RFS11324 - End
146100200615
146200200615       01 G2J-PARMS.
146300200615          05 G2J-GREGORIAN                  PIC S9(8).
146400200615          05 G2J-JULIAN                     PIC S9(8).
146500200615
146600200615      *** JULIAN TO GREGORIAN
146700200615
146800200615       01 J2G-PARMS.
146900200615          05 J2G-JULIAN                     PIC S9(8).
147000200615          05 J2G-GREGORIAN                  PIC S9(8).
147100200615
147200200615      *** JULIAN TO GREGORIAN
147300200615       01  CURR-CONTROLS.
147400200615           03 CURR-LEVEL                  PIC X(01)     VALUE SPACES.
147500200615      *** RFS113783 - variables for modules FXMVAFLAG & FXMVAPNLTY
147600200615        01 lc_PassInvestment            PIC X(05)     VALUE SPACES.
147700200615        01 lc_RetnPenaltyMthod          PIC X(02)     VALUE SPACES.
147800200615        01 ln_RetnMinimumAmt            PIC S9(11)V9(2).
147900200615
148000200615        01 ln_PassMVAGrossAmt           PIC S9(11)V9(2).
148100200615        01 li_PassCertID                PIC S9(10).
148200200615        01 li_PassDateStart             PIC S9(08).
148300200615        01 li_PassDateEnd               PIC S9(08).
148400200615        01 ln_RetnMVAPenalty            PIC S9(11)V9(2).
148500200615        01 ln_RetnPenSched              PIC X(05).
148600200615        01 ln_RetnPenRate               PIC S9(03)V999.
148700200615        01 ln_PassOrgPnlRate            PIC S9(03)V999.
148800200615        01 ln_PassAdjustRate            PIC S9(03)V999.
148900200615
149000200615        01 lc_MVA                       PIC X(1)    VALUE "2".
149100200615        01 lc_Sell                      PIC X(3)    VALUE "SEL".
149200200615        01 lc_SwitchOut                 PIC X(3)    VALUE "SWO".
149300200615        01 lc_TransferOut               PIC X(3)    VALUE "TRO".
149400200615      * RFS113783 - end
149500200615137231  01 lc_FirstTrans                PIC X(1)    VALUE SPACE.
149600200615137833  01 lc_TransferInKind            PIC X(01).
149700200615137833     88 lb_TransferInKindYes                  VALUE "Y".
149800200615137833     88 lb_TransferInKindNo                   VALUE "N".
149900200615137833  01 li_OriginalIssueDate         PIC S9(08)  VALUE ZEROS.
150000200615137833  01 li_CertIDNo                  PIC S9(10)  VALUE ZEROS.
150100200615137833  01 li_Cnt                       PIC S9(05)  VALUE ZEROS.
150200200615137833  01 lnc_RTR                      PIC  X(03)  VALUE "RTR".
150300200615
150400200615      *RFS138276 Starts
150500200615
150600200615        01  lc_CALCDUR-PARMS                  PIC X(100).
150700200615        01  lc_CALCDUR-PARMS-BUFFER REDEFINES lc_CALCDUR-PARMS.
150800200615          03  li_CALCDUR-START-DATE           PIC 9(8).
150900200615          03  li_CALCDUR-END-DATE             PIC 9(8).
151000200615          03  li_CALCDUR-YEARS                PIC S9(8).
151100200615          03  li_CALCDUR-MONTHS               PIC S9(8).
151200200615          03  li_CALCDUR-DAYS                 PIC S9(8).
151300200615          03  lc_CALCDUR-ERROR-CODE           PIC X(3).
151400200615        01  ln_PromotionRate                  PIC S9(02)V9(03).
151500200615        01  ln_BandedRate                     PIC S9(02)V9(03).
151600200615        01  ln_PostedRate                     PIC S9(02)V9(03).
151700200615        01  ln_CerIntRate                     PIC S9(05)V9(03).
151800200615        01  ln_CurrIntRate                    PIC S9(03)V9(03).
151900200615        01  ln_InterestAdjust                 PIC S9(03)V999.
152000200615
152100200615      *RFS138276 Ends
152200200615140269  01 lc_ReCalc                    PIC  X(01)     VALUE " ".
152300200615140269  01 li_placementDate             PIC S9(09)     VALUE ZEROS.
152400200615140269  01 li_transNo                   PIC S9(09)     VALUE ZEROS.
152500200615140269  01 li_IntAdj                    PIC S9(11)V99  VALUE ZEROS.
152600200615143882  01 li_IntAdjAmt                 PIC S9(11)V99  VALUE ZEROS.
152700200615      *RFS148358- Start
152800200615        01 li_AccountNo_GD              PIC S9(09)     VALUE ZEROS.
152900200615        01 lc_InvestCode_GD             PIC X(05)      VALUE " ".
153000200615        01 li_CertNo_GD                 PIC S9(10)     VALUE ZEROS.
153100200615        01 li_AccrualAmt_GD             PIC S9(09)V99 VALUE ZEROES.
153200200615      *RFS148358 - End
153300200615152312  01 lc_SE_Batch_Mode             PIC X(01)      VALUE " ".
153400200615152312  01 li_StrDate                   PIC S9(08)     VALUE 0.
153500200615152312  01 li_EndDate                   PIC S9(08)     VALUE 0.
153600200615152312  01 li_MatDate                   PIC S9(08)     VALUE 0.
153700200615152312  01 li_CertIdNo_SE               PIC S9(10)     VALUE 0.
153800200615152312  01 li_AccountNo_SE              PIC S9(09)     VALUE ZEROS.
153900200615152312  01 lc_InvestCode_SE             PIC X(05)      VALUE " ".
154000200615152312  01 li_AccrualAmt_SE             PIC S9(11)V99  VALUE 0.
154100200615152312  01 li_Balance_SE                PIC S9(11)V99  VALUE 0.
154200200615152312  01 lc_Upd_Flag                  PIC X(01)      VALUE " ".
154300200615152312  01 WS-DATE-BK                   PIC 9(08)      VALUE ZEROES.
154400200615      *RFS1005534- Start
154500200615        01 li_PlacementDate_IntAdj      PIC S9(09)     VALUE ZEROS.
154600200615        01 li_TransNo_IntAdj            PIC S9(09)     VALUE ZEROS.
154700200615        01 li_TradeDate_IntAdj          PIC S9(09)     VALUE ZEROS.
154800200615      *RFS1005534- End
154900200615      *RFS185941 Starts
155000200615       01 li_TotCnvGicCert              PIC S9(05).
155100200615       01 lc_CnvGicRecExists            PIC X(01).
155200200615          88 lb_CnvGicRecExistsNo       VALUE "N".
155300200615          88 lb_CnvGicRecExistsYes      VALUE "Y".
155400200615      *RFS1100976 Starts
155500200615      *01 lc_CnvDiiRecExists            PIC X(01).
155600200615       01 lc_CnvDiiRecExists            PIC X(01) VALUE "N".
155700200615      *RFS1100976 Ends
155800200615          88 lb_CnvDiiRecExistsNo       VALUE "N".
155900200615          88 lb_CnvDiiRecExistsYes      VALUE "Y".
156000200615       01 ln_CnvCurrBalance             PIC S9(13)V99.
156100200615       01 ln_CnvStartDate               PIC S9(08).
156200200615       01 li_AccNo                      PIC S9(09).
156300200615       01 lc_InvCode                    PIC X(05).
156400200615
156500200615      * Error Codes.
156600200615       01 WS-Err-Code                   PIC X(02) VALUE " ".
156700200615          88 lncc_Err01                           VALUE "01".
156800200615          88 lncc_Err02                           VALUE "02".
156900200615          88 lncc_Err03                           VALUE "03".
157000200615          88 lncc_Err04                           VALUE "04".
157100200615
157200200615      * Error descriptions.
157300200615       01 lc_ErrorDesc.
157400200615          03 lncc_ErrFetchTotCnvGicCert PIC X(80)
157500200615             VALUE "Error Fetching the count of converted certificates".
157600200615
157700200615          03 lncc_ErrCertBalStdt        PIC X(80)
157800200615             VALUE "Error Fetching Certificate Balance and Start Date".
157900200615
158000200615          03 lncc_ErrInsertGicJLATMP    PIC X(80)
158100200615             VALUE "Error while inserting into GICJLATMP".
158200200615
158300200615          03 lncc_ErrInsertToGicJLATMP  PIC X(80)
158400200615             VALUE "Error while inserting GICJLATMP from MFAGICJLA".
158500200615
158600200615      *RFS185941 Ends
158700200615      *RFS1100588 Starts
158800200615       01 li_retnInt                    PIC S9(11)V99      VALUE ZEROS.
158900200615      *RFS1100588 Ends
159000201203      *RFS1107791 Starts
159100201203       01 li_retnIntTot                 PIC S9(11)V99      VALUE ZEROS.
159200201203       01 li_reinvestIntAmt             PIC S9(11)V99      VALUE ZEROS.
159300201203      *RFS1107791 Ends
159400200615      *RFS1100976 Starts
159500200615       01 ld_StrDt                      FORMAT DATE "@Y%m%d".
159600200615       01 lc_NoTrans                    PIC X(1) VALUE 'N'.
159700200615      *RFS1100976 Ends
159800200703      *1099872 - Begin
159900200703       01 li_IntOnRed                   PIC S9(11)V99      VALUE ZEROS.
160000200703       01 li_last_Trdt                  PIC S9(09)         VALUE ZEROS.
160100200703       01 li_last_Pldt                  PIC S9(09)         VALUE ZEROS.
160200200703       01 li_last_Trno                  PIC S9(09)         VALUE ZEROS.
160300200703       01 li_Acct_no                    PIC S9(09)         VALUE ZEROS.
160400200703       01 lc_Inv_Cde                    PIC X(05)          VALUE SPACES.
160500200703       01 lc_Tran_Type                  PIC X(03)          VALUE SPACES.
160600200703       01 li_Cls_Bal                    PIC S9(13)V999     VALUE ZEROS.
160700200703       01 li_INT_AMT                    PIC S9(13)V99      VALUE ZEROS.
160800200703      *1099872 - End
160900200615R14153*COPY GICCALCLS OF LEVP-RFS11367C.                                RFS10563
161000200615R14153 COPY GICCALCLS.                                                  RFS10563
161100200615
161200200615       COPY PRCDTWS.
161300200615       COPY DRG2JLS.
161400200615       COPY DRJ2GLS.
161500200615       COPY DRTRMDTLS.
161600200615      * RFS11324 - Begin
161700200615       COPY DRLEAPLS.
161800200615      * RFS11324 - End
161900200615138276 COPY PRMCLCLS.
162000200615138276 COPY CPYGICIAT.
162100200615
162200200615      * The copy book to accept data from LDA                           RFS8582
162300200615       COPY INTCLCLDS.                                                  RFS8582
162400200615      /                                                                 RFS8582
162500200615       LINKAGE SECTION.
162600200615      ******************************************************************
162700200615      *                                                                *
162800200615      *    L I N K A G E   S E C T I O N                               *
162900200615      *                                                                *
163000200615      ******************************************************************
163100200615
163200200615      * RFS10737C - Begin
163300200615      *COPY INTCLCLS OF LEVP-RFS10737C.
163400200615       COPY INTCLCLS.
163500200615      * RFS10737C - End
163600200615      /
163700200615       PROCEDURE DIVISION USING INTCLC-PARMS.
163800200615
163900200615      ******************************************************************
164000200615      *                                                                *
164100200615      *    P R O C E D U R E   D I V I S I O N                         *
164200200615      *                                                                *
164300200615      ******************************************************************
164400200615
164500200615      /
164600200615      ******************************************************************
164700200615      *                                                                *
164800200615      *    M A I N   L I N E                                           *
164900200615      *                                                                *
165000200615      ******************************************************************
165100200615
165200200615       MAINLINE.
165300200615           PERFORM INITIAL-LOGIC       THRU INL-EXIT.
165400200615           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
165500200615              GO TO ML-0030.
165600200615       ML-0010.
165700200615           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
165800200615           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
165900200615              GO TO ML-0030.
166000200615       ML-0020.
166100200615           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
166200200615           GO TO ML-0010.
166300200615       ML-0030.
166400200615      * RFS11324 - Begin
166500200615           PERFORM PRE-END-JOB
166600200615      * RFS11324 - End
166700200615           PERFORM END-JOB             THRU EOJ-EXIT.
166800200615           GOBACK.
166900200615
167000200615      /
167100200615       INITIAL-LOGIC.
167200200615
167300200615      ******************************************************************
167400200615      *                                                                *
167500200615      *    I N I T I A L   L O G I C   R O U T I N E                   *
167600200615      *                                                                *
167700200615      ******************************************************************
167800200615
167900200615      *RFS25181 Start
168000200615           MOVE LOW-VALUES          TO CURR-CONTROLS
168100200615      *RFS25181 End
168200200615152312     MOVE " " TO lc_SE_Batch_Mode
168300200615152312     IF PASS-MODE = "SA"
168400200615152312        MOVE "Y" TO lc_SE_Batch_Mode
168500200615152312        MOVE PASS-ACCOUNT-NO      TO li_AccountNo_SE
168600200615152312        MOVE PASS-INVESTMENT-CODE TO lc_InvestCode_SE
168700200615152312        MOVE PASS-END-DATE-OPTION TO li_StrDate
168800200615152312        MOVE PASS-CERTIFICATE-ID-NO TO li_EndDate
168900200615152312        MOVE 0    TO li_CertIdNo_SE
169000200615152312        PERFORM CRT-WORK-FILE THRU CWF-EXIT
169100200615152312        MOVE 0                TO PASS-CERTIFICATE-ID-NO
169200200615152312        MOVE "SE"             TO PASS-MODE
169300200615152312     END-IF.
169400200615           MOVE PASS-MODE           TO WS-PASS-MODE.
169500200615
169600200615           INITIALIZE WS-TOTAL-ACCRUAL-AMT                              RFS12320
169700200615
169800200615      **** VALIDATE INTCLC-PARMS
169900200615
170000200615           IF (VALID-MODE)
170100200615              NEXT SENTENCE
170200200615           ELSE
170300200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
170400200615               MOVE "Y"             TO WS-EXIT-PROGRAM
170500200615               MOVE "01"            TO RETN-RET-CODE
170600200615               MOVE "Pass Call Mode is not correct"
170700200615                                    TO RETN-RET-CODE-DESC
170800200615               GO TO INL-EXIT.
170900200615
171000200615      **** OPEN FILES
171100200615
171200200615137231*R14153     IF  STMT-INTEREST-MODE
171300200615112133*    IF (STMT-INTEREST-MODE OR ACCOUNT-V1-MODE)
171400200615      * 1017021 - Begin
171500200615137231*     IF (STMT-INTEREST-MODE OR ACCOUNT-V2-MODE)
171600200615            IF (STMT-INTEREST-MODE OR ACCOUNT-V2-MODE OR
171700200615                ACCOUNT-V3-MODE)
171800200615      * 1017021 - End
171900200615  ¦        AND WS-OPEN-FILE        IS NOT EQUAL TO "Y"
172000200615  ¦        OPEN INPUT  INVESTMENT-DII-RATES
172100200615  ¦                    ACCOUNT-NOMINEE
172200200615  ¦                    DII-RATE-SET
172300200615  ¦                    TRANS-INTEREST-DETAILS
172400200615  ¦                    PAYMENT-TYPE-CODES
172500200615  ¦                    INVESTMENT
172600200615  ¦                    PRODUCT-TYPE-CODES
172700200615  ¦                    ACCOUNT-INVESTMENT
172800200615  ¦                    ACCOUNT
172900200615  ¦                    GIC-CERTIFICATE-DETAILS-1
173000200615  ¦                    GIC-CERTIFICATE-DETAILS-2
173100200615  ¦                    TRANS
173200200615  ¦                    TRANS-2
173300200615  ¦                    GIC-TERM
173400200615  ¦                    GIC-TERM-IDX2                                    RFS8371
173500200615  ¦                    GIC-TERM-GRP-CODES-ALW-IDXL                      RFS8371
173600200615  ¦                    GIC-TERM-GROUP                                   RFS8371
173700200615  ¦                    GIC-TERM-GROUP-ACCOUNT-TYPES
173800200615  ¦                    GIC-PENALTY-RATE-SCHEDULE
173900200615  ¦                    GIC-RATES
174000200615  ¦                    GIC-INT-ADJUST-REASON-DTL-IDX2                   RFS10258
174100200615  ¦                    GIC-INT-ADJUST-REASON-DTL-IDXL                   RFS10258
174200200615      * RFS 138207 - begin
174300200615      * Change READ of SORTED-GTR to GIC-JLA-TMP
174400200615  ¦   *                SORTED-GTR
174500200615      * RFS 138207 - end
174600200615  ¦            MOVE  "Y"    TO WS-OPEN-FILE
174700200615  v            GO TO  INL-0010
174800200615R14153     END-IF.
174900200615
175000200615           OPEN INPUT  INVESTMENT-DII-RATES
175100200615      *                ACCOUNT-TYPE
175200200615                       ACCOUNT-NOMINEE
175300200615                       DII-RATE-SET
175400200615                       TRANS-INTEREST-DETAILS
175500200615                       PAYMENT-TYPE-CODES
175600200615                       INVESTMENT
175700200615                       PRODUCT-TYPE-CODES
175800200615                       ACCOUNT-INVESTMENT
175900200615                       ACCOUNT
176000200615                       GIC-CERTIFICATE-DETAILS-1
176100200615                       GIC-CERTIFICATE-DETAILS-2
176200200615                       TRANS
176300200615                       TRANS-2
176400200615                       GIC-TERM
176500200615                       GIC-TERM-IDX2                                    RFS8371
176600200615                       GIC-TERM-GRP-CODES-ALW-IDXL                      RFS8371
176700200615                       GIC-TERM-GROUP                                   RFS8371
176800200615                       GIC-TERM-GROUP-ACCOUNT-TYPES
176900200615                       GIC-PENALTY-RATE-SCHEDULE
177000200615                       GIC-RATES
177100200615                       GIC-INT-ADJUST-REASON-DTL-IDX2                   RFS10258
177200200615138276                 INVESTOR
177300200615138276                 ACCOUNT-GROUP
177400200615                       GIC-INT-ADJUST-REASON-DTL-IDXL.                  RFS10258
177500200615
177600200615R14153 INL-0010.
177700200615      * RFS 140341 - begin
177800200615      * move the logic below to POPULATE-GICJLATMP-RECS routine
177900200615      * RFS 138307 - begin
178000200615      *    EXEC SQL
178100200615      *     WHENEVER SQLERROR CONTINUE
178200200615      *    END-EXEC.
178300200615
178400200615      *    EXEC SQL
178500200615      *      DROP TABLE QTEMP/GICJLATMP
178600200615      *    END-EXEC.
178700200615
178800200615      *    EXEC SQL
178900200615      *      CREATE TABLE QTEMP/GICJLATMP LIKE MFAGICJLA
179000200615
179100200615      *    END-EXEC.
179200200615      * RFS 138307 - end
179300200615      * RFS 140341 - end
179400200615
179500200615           IF (BATCH-MODE)
179600200615               OPEN EXTEND INTCLC-REJECTION
179700200615           END-IF.
179800200615      * ---------------------------------
179900200615      *    IF PASS-END-DATE-OPTION = ZEROES                             FIX09
180000200615      *        MOVE "N"             TO WS-PASS-END-DATE-OPTION          FIX09
180100200615      *    ELSE                                                         FIX09
180200200615      *        MOVE "Y"             TO WS-PASS-END-DATE-OPTION          FIX09
180300200615      *    END-IF.                                                      FIX09
180400200615      * ---------------------------------
180500200615
180600200615      * RFS12320 - Begin
180700200615           PERFORM ZB-GET-AS-AT-DATE-AND-NEW-YEAR                       RFS8371
180800200615      * RFS12320 - Begin
180900200615
181000200615      **** IF BATCH MODE, OPEN WORKFILE FOR READ/REWRITE ACCESS
181100200615      **** (IF NOT BATCH MODE, OPEN FILE FOR WRITING ONLY)
181200200615
181300200615           IF (BATCH-MODE)
181400200615
181500200615               OPEN I-O GIC-INT-WORKFILE
181600200615      * ---------------------------------------------------------------
181700200615      * RFS12320 - Begin
181800200615      *
181900200615      *        IF (DII-BATCH-MODE)
182000200615      *
182100200615      ****         FIND NEW YEARS DAY
182200200615      ****         DII BATCH INPUT WILL ONLY OCCUR ON DECEMBER 31
182300200615      ****         EACH YEAR-THEREFORE, THE SAFEST METHOD TO CALCULATE
182400200615      ****         NEW YEARS DAY IS TO ADD 1 TO THE YEAR WITHIN THE
182500200615      ****         PROCESS-DATE FIELD (PUT 01/01  IN THE MM/DD SLOT)
182600200615      *
182700200615      *            CALL "MKPRCDT" USING PROCESS-DATE-DATA-AREA
182800200615      *            CANCEL "MKPRCDT"
182900200615      *
183000200615      *            MOVE PDDA-AS-AT-DATE     TO WS-DATE-BREAKDOWN
183100200615      *            COMPUTE WS-YYYY = WS-YYYY + 1
183200200615      *            MOVE 01                  TO WS-MM
183300200615      *            MOVE 01                  TO WS-DD
183400200615      *            MOVE WS-DATE-BREAKDOWN   TO WS-NEW-YEARS-DAY
183500200615      *        END-IF
183600200615      * RFS12320 - End
183700200615      * ---------------------------------------------------------------
183800200615           ELSE
183900200615              IF NOT ACCOUNT-A1-MODE                                    RFS12320
184000200615112133           AND NOT ACCOUNT-V1-MODE                                RFS12320
184100200615137231           AND NOT ACCOUNT-V2-MODE
184200200615      * 1017021 - Begin
184300200615                 AND NOT ACCOUNT-V3-MODE
184400200615      * 1017021 - End
184500200615               IF (ONLINE-MODE)
184600200615                   CALL "GICINTENV"
184700200615                   OPEN EXTEND GIC-INT-WORKFILE
184800200615               END-IF
184900200615              END-IF                                                    RFS12320
185000200615           END-IF.
185100200615      **** INITIALIZE VARIABLES
185200200615
185300200615           CALL "GETDAT" USING WS-DATE.
185400200615           MOVE WS-DATE             TO WS-TODAY.
185500200615      * RFS12320 - Begin
185600200615           IF ACCOUNT-A1-MODE                                           RFS12320
185700200615               MOVE WS-NEW-YEARS-DAY     TO WS-DATE
185800200615           END-IF
185900200615      * RFS12320 - End
186000200615
186100200615      *    MOVE "00"                TO RETN-RET-CODE.                   FIX05
186200200615      *    MOVE "Successful call to INTCLC"                             FIX05
186300200615      *    TO RETN-RET-CODE-DESC.                                       FIX05
186400200615
186500200615           IF DII-ADJUSTMENT-MODE                                       RFS8582
186600200615               PERFORM ZA0-INIT-DATA-FOR-ADJUSTMENT                     RFS8582
186700200615           END-IF                                                       RFS8582
186800200615140269* If IE mode and recalc interest, store the placement date and
186900200615140269* trans no passed in for the INT transaction that need to bypass.
187000200615140269     MOVE "N" TO lc_ReCalc
187100200615140269     MOVE 0   TO li_placementDate
187200200615140269     MOVE 0   TO li_transNo
187300200615140269     IF PASS-MODE = "IE" AND RETN-SCHEDULE-CODE = "RECAL"
187400200615140269       IF RETN-REPLACEMENT-AMT IS NUMERIC AND
187500200615140269          RETN-PENALTY-AMT IS NUMERIC
187600200615140269          MOVE "Y" TO lc_ReCalc
187700200615140269          MOVE RETN-REPLACEMENT-AMT TO li_placementDate
187800200615140269          MOVE RETN-PENALTY-AMT   TO li_transNo
187900200615140269       END-IF
188000200615140269     END-IF
188100200615
188200200615           PERFORM ZA-INITIAL-RETN-DATA.                                FIX05
188300200615      * RFS12320 - Begin (Move to the beginning of the paragraph)
188400200615      *    PERFORM ZB-GET-AS-AT-DATE.                                   FIX05
188500200615      *
188600200615      *
188700200615      * RFS12320 - End
188800200615      *
188900200615      * RFS113783 - call FXMVAFLAG to get penalty method set up for GI C certifi
189000200615           INITIALIZE lc_RetnPenaltyMthod  ln_RetnMinimumAmt.
189100200615           MOVE Pass-Investment-Code TO lc_PassInvestment.
189200200615           CALL "FXMVAFLAG" USING lc_PassInvestment,
189300200615                                  lc_RetnPenaltyMthod,
189400200615                                  ln_RetnMinimumAmt.
189500200615      * RFS113783 - end
189600200615       INL-EXIT.
189700200615           EXIT.
189800200615      * ---------------------------------
189900200615       ZA0-INIT-DATA-FOR-ADJUSTMENT.                                    RFS8582
190000200615      * ---------------------------------
190100200615           INITIALIZE INTCLC-PARMS
190200200615                      LDS-INTCLC-PARMS
190300200615
190400200615           ACCEPT LDS-INTCLC-PARMS FROM WS-LOCAL                        RFS8582
190500200615           PERFORM XB-GET-CHECK-DII-ADJUSTMENT                          RFS8582
190600200615
190700200615           MOVE "00"                TO RETN-RET-CODE
190800200615           MOVE "Successful call to INTCLC"
190900200615                                    TO RETN-RET-CODE-DESC.
191000200615      * ---------------------------------
191100200615       ZA-INITIAL-RETN-DATA.                                            FIX05
191200200615      * ---------------------------------
191300200615           INITIALIZE RETN-ACCRUAL-AMT
191400200615                      RETN-SCHEDULE-CODE
191500200615                      RETN-REPLACEMENT-AMT
191600200615                      RETN-PENALTY-AMT
191700200615                      RETN-REPLACEMENT-RATE
191800200615                      RETN-PENALTY-RATE
191900200615                      RETN-RET-CODE
192000200615                      RETN-RET-CODE-DESC
192100200615      * RFS10737 - Begin
192200200615                      RETN-BALANCE
192300200615      * RFS10737 - End
192400200615
192500200615           MOVE "00"                TO RETN-RET-CODE
192600200615           MOVE "Successful call to INTCLC"
192700200615                                    TO RETN-RET-CODE-DESC.
192800200615      * RFS11324 - Begin
192900200615           SET SW11-NEXT-ANNIV-NOT-EXISTS   TO TRUE.
193000200615      * RFS11324 - End
193100200615      * ---------------------------------
193200200615       ZB-GET-AS-AT-DATE-AND-NEW-YEAR.                                  RFS8371
193300200615      * ---------------------------------                               RFS8371
193400200615            CALL "MKPRCDT" USING PROCESS-DATE-DATA-AREA                 RFS8371
193500200615      *                                                                 RFS8371
193600200615            MOVE PDDA-AS-AT-DATE     TO WS-AS-AT-DATE.                  RFS8371
193700200615      *
193800200615      * RFS12320 - Begin
193900200615      *
194000200615            MOVE PDDA-AS-AT-DATE     TO WS-DATE-BREAKDOWN
194100200622
194200200622      * RFS1101805 Starts
194300200622            MOVE 12                  TO WS-MM
194400200622            MOVE 31                  TO WS-DD
194500200622            MOVE WS-DATE-BREAKDOWN   TO WS-YEAR-END-DATE
194600200622      * RFS1101805 Ends
194700200622
194800200615            COMPUTE WS-YYYY = WS-YYYY + 1
194900200615            MOVE 01                  TO WS-MM
195000200615            MOVE 01                  TO WS-DD
195100200615            MOVE WS-DATE-BREAKDOWN   TO WS-NEW-YEARS-DAY.
195200200615      *
195300200615      * RFS12320 - End
195400200615      *
195500200615      * ---------------------------------
195600200615      /
195700200615       GET-CURRENT-RECORD.
195800200615
195900200615      ******************************************************************
196000200615      *                                                                *
196100200615      *    G E T   C U R R E N T   R E C O R D                         *
196200200615      *                                                                *
196300200615      ******************************************************************
196400200615
196500200615           IF CURR-CONTROLS = HIGH-VALUES
196600200615               NEXT SENTENCE
196700200615           ELSE
196800200615148358*        IF (DII-BATCH-MODE OR GIC-BATCH-MODE)
196900200615148358         IF (DII-BATCH-MODE OR GIC-BATCH-MODE OR
197000200615148358             GICDII-BATCH-MODE)
197100200615      ****         WILL READ NEXT RECORD TO BE PROCESSED
197200200615      ****         AND WILL ENTER DETAIL PROCESSING JUST AS NORMAL
197300200615      ****         SINGLE CALL. IF END OF FILE, MOVE HIGH VALUES
197400200615      ****         TO END THE PROGRAM, OTHERWISE WILL CONTINUE
197500200615
197600200615                   READ GIC-INT-WORKFILE
197700200615                       AT END
197800200615                       MOVE HIGH-VALUES     TO CURR-CONTROLS
197900200615                       GO TO GCR-EXIT
198000200615                   END-READ
198100200615
198200200615                   MOVE ACCOUNT-NO OF GIC-INT-WORKFILE-REC
198300200615                   TO PASS-ACCOUNT-NO
198400200615
198500200615                   MOVE INVESTMENT-CODE OF GIC-INT-WORKFILE-REC
198600200615                   TO PASS-INVESTMENT-CODE
198700200615
198800200615                   MOVE CERTIFICATE-ID-NO OF GIC-INT-WORKFILE-REC
198900200615                   TO PASS-CERTIFICATE-ID-NO
199000200615
199100200615               ELSE
199200200615                   IF (ACCOUNT-MODE) OR
199300200615                      (INVESTMENT-MODE) OR
199400200615                      (CERTIFICATE-MODE)
199500200615                       NEXT SENTENCE
199600200615                   END-IF
199700200615               END-IF
199800200615           END-IF.
199900200615
200000200615       GCR-EXIT.
200100200615           EXIT.
200200200615      /
200300200615       DETAIL-PROCESSING.
200400200615
200500200615      ******************************************************************
200600200615      *                                                                *
200700200615      *    D E T A I L   P R O C E S S I N G                           *
200800200615      *                                                                *
200900200615      ******************************************************************
201000200615
201100200615           PERFORM EDIT-SETUP-ACCOUNT-INVESTMENT THRU ESAI-EXIT.
201200200615           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
201300200615              GO TO DPR-0030.
201400200615
201500200615       DPR-0010.
201600200615           PERFORM GET-ACCOUNT-INVESTMENT    THRU GAI-EXIT.
201700200615           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
201800200615              GO TO DPR-0030.
201900200615
202000200615       DPR-0020.
202100200615           PERFORM CALCULATE-ACCOUNT-INVESTMENT  THRU CAI-EXIT.
202200200615           GO TO DPR-0010.
202300200615
202400200615       DPR-0030.
202500200615
202600200615      **** GOT HERE BECAUSE INVESTMENT WAS FINISHED AND HIGH-VALUES
202700200615      **** WAS MOVED TO CURR-CONTROLS ..  IF BATCH MODE, WE MUST
202800200615      **** MOVE LOW-VALUES SO THAT THE PROGRAM WON'T EXIT AND THE
202900200615      **** NEXT BATCH RECORD WILL BE READ (UNLESS EXIT-PROGRAM).
203000200615      **** OTHERWISE, ONLY END OF WORKFILE WILL EXIT PROGRAM.
203100200615
203200200615           IF (EXIT-PROGRAM) OR (ACCOUNT-MODE) OR
203300200615              (INVESTMENT-MODE) OR (CERTIFICATE-MODE)
203400200615               NEXT SENTENCE
203500200615           ELSE
203600200615148358*        IF (GIC-BATCH-MODE OR DII-BATCH-MODE)
203700200615148358         IF (GIC-BATCH-MODE OR DII-BATCH-MODE OR
203800200615148358         GICDII-BATCH-MODE)
203900200615                   MOVE LOW-VALUES      TO CURR-CONTROLS
204000200615               END-IF
204100200615           END-IF.
204200200615
204300200615       DPR-EXIT.
204400200615           EXIT.
204500200615
204600200615      /
204700200615       EDIT-SETUP-ACCOUNT-INVESTMENT.
204800200615
204900200615      ******************************************************************
205000200615      *                                                                *
205100200615      *    E D I T   /  S E T U P   A C C O U N T   I N V E S T M E N T*
205200200615      *                                                                *
205300200615      ******************************************************************
205400200615
205500200615      **** VALIDATE PASS-MODE
205600200615
205700200615           IF (GIC-BATCH-MODE)  OR
205800200615              (DII-BATCH-MODE)  OR
205900200615148358        (GICDII-BATCH-MODE) OR
206000200615              (ACCOUNT-MODE)    OR
206100200615              (INVESTMENT-MODE) OR
206200200615              (CERTIFICATE-MODE) OR
206300200615              (INTEREST-MODE)   OR
206400200615              (TRNPST-MODE)     OR
206500200615              (DII-ADJUSTMENT-MODE)                                     RFS8582
206600200615               NEXT SENTENCE
206700200615           ELSE
206800200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
206900200615               MOVE "Y"             TO WS-EXIT-PROGRAM
207000200615               MOVE "02"            TO RETN-RET-CODE
207100200615               MOVE "Not a valid Pass Mode"
207200200615                                    TO RETN-RET-CODE-DESC
207300200615               GO TO ESAI-EXIT.
207400200615
207500200615           IF DII-ADJUSTMENT-MODE
207600200615               CONTINUE
207700200615           END-IF
207800200615
207900200615      **** MUST SUPPLY ACCOUNT-NO FOR ALL MODES
208000200615
208100200615           IF (PASS-ACCOUNT-NO = ZEROES)
208200200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
208300200615               MOVE "Y"             TO WS-EXIT-PROGRAM
208400200615               MOVE "03"            TO RETN-RET-CODE
208500200615               MOVE "Must Pass Account Number"
208600200615                                    TO RETN-RET-CODE-DESC
208700200615               GO TO ESAI-EXIT.
208800200615
208900200615      **** VALIDATE ACCOUNT-MODE  (MODE A)
209000200615
209100200615           IF (ACCOUNT-MODE)
209200200615           AND (PASS-ACCOUNT-NO = ZEROES OR
209300200615                PASS-INVESTMENT-CODE NOT EQUAL SPACES OR
209400200615                PASS-CERTIFICATE-ID-NO NOT EQUAL ZEROES)
209500200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
209600200615               MOVE "Y"             TO WS-EXIT-PROGRAM
209700200615               MOVE "04"            TO RETN-RET-CODE
209800200615               MOVE "Must Supply Account Only"
209900200615                                    TO RETN-RET-CODE-DESC
210000200615               GO TO ESAI-EXIT.
210100200615
210200200615      **** VALIDATE INVESTMENT-MODE (MODE I)
210300200615
210400200615           IF (INVESTMENT-MODE) AND NOT (INTEREST-MODE)
210500200615           AND (PASS-ACCOUNT-NO = ZEROES OR
210600200615           PASS-INVESTMENT-CODE = SPACES OR
210700200615           PASS-CERTIFICATE-ID-NO NOT EQUAL ZEROES)
210800200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
210900200615               MOVE "Y"             TO WS-EXIT-PROGRAM
211000200615               MOVE "05"            TO RETN-RET-CODE
211100200615               MOVE "Must Supply Account-no and Investment-code Only"
211200200615                                    TO RETN-RET-CODE-DESC
211300200615               GO TO ESAI-EXIT.
211400200615
211500200615      **** VALIDATE CERTIFICATE-MODE (MODE C)
211600200615
211700200615           IF (CERTIFICATE-MODE) AND NOT (INTEREST-MODE)
211800200615               AND (PASS-ACCOUNT-NO  = ZEROES OR
211900200615                    PASS-INVESTMENT-CODE = SPACES OR
212000200615                    PASS-CERTIFICATE-ID-NO = ZEROES)
212100200615               MOVE HIGH-VALUES TO CURR-CONTROLS
212200200615               MOVE "Y"             TO WS-EXIT-PROGRAM
212300200615               MOVE "06"        TO RETN-RET-CODE
212400200615               MOVE "Must Supply account/investment/certificate"
212500200615                                TO RETN-RET-CODE-DESC
212600200615               GO TO ESAI-EXIT.
212700200615
212800200615      **** VALIDATE GIC-BATCH-MODE (MODE G)
212900200615
213000200615           IF (GIC-BATCH-MODE)
213100200615               AND (PASS-ACCOUNT-NO  = ZEROES OR
213200200615                    PASS-INVESTMENT-CODE = SPACES OR
213300200615                    PASS-CERTIFICATE-ID-NO = ZEROES)
213400200615               MOVE HIGH-VALUES TO CURR-CONTROLS
213500200615      *        MOVE "Y"             TO WS-EXIT-PROGRAM                  FIX03
213600200615               MOVE "07"        TO RETN-RET-CODE
213700200615               MOVE "Input Record not proper for GIC-BATCH-MODE"
213800200615                                TO RETN-RET-CODE-DESC
213900200615               MOVE "G26"           TO REJ-REJECTION-CODE               FIX04
214000200615               PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT              FIX04
214100200615
214200200615               GO TO ESAI-EXIT.
214300200615
214400200615      **** VALIDATE DII-BATCH-MODE (MODE D)
214500200615
214600200615           IF (DII-BATCH-MODE)
214700200615               AND (PASS-ACCOUNT-NO  = ZEROES OR
214800200615                    PASS-INVESTMENT-CODE = SPACES OR
214900200615                    PASS-CERTIFICATE-ID-NO NOT EQUAL ZEROES)
215000200615               MOVE HIGH-VALUES TO CURR-CONTROLS
215100200615      *        MOVE "Y"             TO WS-EXIT-PROGRAM                  FIX03
215200200615               MOVE "08"        TO RETN-RET-CODE
215300200615               MOVE "Input Record not proper for DII-BATCH-MODE"
215400200615                                TO RETN-RET-CODE-DESC
215500200615               MOVE "G27"           TO REJ-REJECTION-CODE               FIX04
215600200615               PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT              FIX04
215700200615
215800200615               GO TO ESAI-EXIT.
215900200615      *RFS148358 - Start
216000200615      **** VALIDATE DII-BATCH-MODE (MODE D)
216100200615
216200200615           IF (GICDII-BATCH-MODE)
216300200615               AND (PASS-ACCOUNT-NO  = ZEROES OR
216400200615                    PASS-INVESTMENT-CODE = SPACES )
216500200615               MOVE HIGH-VALUES TO CURR-CONTROLS
216600200615               MOVE "08"        TO RETN-RET-CODE
216700200615               MOVE "Input Record not proper for GICDII-BATCH-MODE"
216800200615                                TO RETN-RET-CODE-DESC
216900200615               MOVE "G28"           TO REJ-REJECTION-CODE               FIX04
217000200615               PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT              FIX04
217100200615
217200200615               GO TO ESAI-EXIT.
217300200615      *RFS148358 - End
217400200615
217500200615      **** VALIDATE EARLY-REDEMPTION-CODE (@E)
217600200615
217700200615           IF (EARLY-REDEMPTION-MODE)
217800200615           AND (PASS-END-DATE-OPTION = ZEROES)
217900200615               MOVE HIGH-VALUES TO CURR-CONTROLS
218000200615               MOVE "Y"             TO WS-EXIT-PROGRAM
218100200615               MOVE "20"        TO RETN-RET-CODE
218200200615               MOVE "Must Supply PASS-END-DATE for this mode"
218300200615                                TO RETN-RET-CODE-DESC
218400200615               GO TO ESAI-EXIT.
218500200615
218600200615      *    IF (NOT EARLY-REDEMPTION-MODE)
218700200615      *    AND (PASS-END-DATE-OPTION NOT EQUAL ZEROES)
218800200615      *        MOVE HIGH-VALUES TO CURR-CONTROLS
218900200615      *        MOVE "Y"             TO WS-EXIT-PROGRAM
219000200615      *        MOVE "21"        TO RETN-RET-CODE
219100200615      *        MOVE "Must not supply PASS-END-DATE for this mode"
219200200615      *                         TO RETN-RET-CODE-DESC
219300200615      *        GO TO ESAI-EXIT.
219400200615
219500200615      **** ALL ERRORS BELOW THIS LINE WILL BE WRITTEN TO THE
219600200615      **** REJECTION FILE - AS OPPOSED TO ENDING THE PROGRAM
219700200615      **** HIGH-VALUES WILL EXIT PROGRAM, UNLESS BATCH-MODE
219800200615
219900200615      **** ACCOUNT MUST EXIST ON ACCOUNT FILE
220000200615
220100200615           INITIALIZE MFAACCNTP OF ACCOUNT-REC.
220200200615           MOVE PASS-ACCOUNT-NO   TO ACCOUNT-NO OF ACCOUNT-REC.
220300200615
220400200615           READ ACCOUNT
220500200615             INVALID KEY
220600200615             MOVE HIGH-VALUES     TO CURR-CONTROLS
220700200615             MOVE "09"            TO RETN-RET-CODE
220800200615             MOVE "Account does not exist on file"
220900200615                                  TO RETN-RET-CODE-DESC
221000200615             IF (BATCH-MODE)
221100200615                 MOVE "G11"           TO REJ-REJECTION-CODE
221200200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
221300200615             END-IF
221400200615             GO TO ESAI-EXIT.
221500200615
221600200615      **** PREPARE FOR FIRST READ OF ACCOUNT-INVESTMENT
221700200615
221800200615           INITIALIZE MFAACCIVP OF ACCOUNT-INVESTMENT-REC.
221900200615
222000200615           MOVE PASS-ACCOUNT-NO     TO ACCOUNT-NO
222100200615           OF ACCOUNT-INVESTMENT-REC.
222200200615
222300200615           IF ( (INVESTMENT-MODE OR CERTIFICATE-MODE
222400200615148358*        OR GIC-BATCH-MODE OR DII-BATCH-MODE)
222500200615148358         OR GIC-BATCH-MODE OR DII-BATCH-MODE
222600200615148358         OR GICDII-BATCH-MODE)
222700200615
222800200615           AND (PASS-INVESTMENT-CODE NOT EQUAL SPACES) )     OR
222900200615               DII-ADJUSTMENT-MODE                                       RFS8582
223000200615               MOVE PASS-INVESTMENT-CODE TO INVESTMENT-CODE
223100200615               OF ACCOUNT-INVESTMENT-REC
223200200615           ELSE
223300200615               MOVE LOW-VALUES           TO INVESTMENT-CODE
223400200615               OF ACCOUNT-INVESTMENT-REC
223500200615           END-IF.
223600200615
223700200615           START ACCOUNT-INVESTMENT
223800200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
223900200615             INVALID KEY
224000200615             MOVE HIGH-VALUES     TO CURR-CONTROLS
224100200615             MOVE "20"            TO RETN-RET-CODE
224200200615             MOVE "No Investment in Account Investment File"
224300200615                                  TO RETN-RET-CODE-DESC
224400200615             IF (BATCH-MODE)
224500200615                 MOVE "G11"       TO REJ-REJECTION-CODE
224600200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
224700200615             END-IF
224800200615             GO TO ESAI-EXIT.
224900200615
225000200615      **** PRIME READ ACCOUNT-INVESTMENT
225100200615
225200200615           READ ACCOUNT-INVESTMENT  NEXT RECORD
225300200615             AT END
225400200615             MOVE HIGH-VALUES         TO CURR-CONTROLS
225500200615           GO TO ESAI-EXIT.
225600200615
225700200615      **** IF NEW ACCOUNT-NO OR INVESTMENT (WHEN INVESTMENT MODE)
225800200615
225900200615           IF ((INVESTMENT-MODE OR CERTIFICATE-MODE
226000200615                OR GIC-BATCH-MODE OR DII-BATCH-MODE
226100200615148358          OR GICDII-BATCH-MODE
226200200615                OR DII-ADJUSTMENT-MODE             ) AND                RFS8582
226300200615               (PASS-INVESTMENT-CODE NOT EQUAL SPACES)) AND
226400200615              ((PASS-INVESTMENT-CODE NOT EQUAL
226500200615                INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC) OR
226600200615               (PASS-ACCOUNT-NO NOT EQUAL
226700200615                ACCOUNT-NO      OF ACCOUNT-INVESTMENT-REC))
226800200615               MOVE HIGH-VALUES TO CURR-CONTROLS
226900200615               MOVE "10"            TO RETN-RET-CODE
227000200615               MOVE "Investment not on file for this account"
227100200615               TO RETN-RET-CODE-DESC
227200200615               IF (BATCH-MODE)
227300200615                   MOVE "G11"       TO REJ-REJECTION-CODE
227400200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
227500200615               END-IF
227600200615               GO TO ESAI-EXIT
227700200615           ELSE
227800200615               IF  (PASS-ACCOUNT-NO NOT EQUAL
227900200615                    ACCOUNT-NO      OF ACCOUNT-INVESTMENT-REC)
228000200615                   MOVE HIGH-VALUES TO CURR-CONTROLS
228100200615                   MOVE "10"            TO RETN-RET-CODE
228200200615                   MOVE "Investment not on file for this account"
228300200615                   TO RETN-RET-CODE-DESC
228400200615                   IF (BATCH-MODE)
228500200615                       MOVE "G11"       TO REJ-REJECTION-CODE
228600200615                       PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
228700200615                   END-IF
228800200615                   GO TO ESAI-EXIT
228900200615               END-IF
229000200615           END-IF.
229100200615
229200200615       ESAI-EXIT.
229300200615           EXIT.
229400200615      /
229500200615       GET-ACCOUNT-INVESTMENT.
229600200615
229700200615      ******************************************************************
229800200615      *                                                                *
229900200615      *    G E T   A C C O U N T   I N V E S T M E N T                 *
230000200615      *                                                                *
230100200615      ******************************************************************
230200200615
230300200615           MOVE "N"                 TO WS-SKIP-DETAILS.
230400200615137231     MOVE " "                 TO lc_FirstTrans.
230500200615
230600200615      **** STOP PROGRAM WHEN DIFFERENT ACCOUNT-NO IS READ
230700200615
230800200615           IF ACCOUNT-NO OF ACCOUNT-INVESTMENT-REC
230900200615           NOT EQUAL TO PASS-ACCOUNT-NO
231000200615               MOVE HIGH-VALUES TO CURR-CONTROLS
231100200615               GO TO GAI-EXIT
231200200615           END-IF.
231300200615
231400200615      **** IF NEW INVESTMENT-CODE AND NOT ACCOUNT-MODE, EXIT PROGRAM
231500200615
231600200615           IF INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
231700200615           NOT EQUAL PASS-INVESTMENT-CODE
231800200615           AND (INVESTMENT-MODE OR CERTIFICATE-MODE OR
231900200615                GIC-BATCH-MODE  OR DII-BATCH-MODE   OR
232000200615148358          GICDII-BATCH-MODE OR
232100200615                DII-ADJUSTMENT-MODE)                                    RFS8582
232200200615               MOVE HIGH-VALUES TO CURR-CONTROLS
232300200615               GO TO GAI-EXIT
232400200615           END-IF.
232500200615
232600200615      **** GET CORRESPONDING INVESTMENT
232700200615
232800200615           INITIALIZE MFAINVP OF INVESTMENT-REC.
232900200615
233000200615           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
233100200615           TO   INVESTMENT-CODE OF INVESTMENT-REC.
233200200615
233300200615           READ INVESTMENT
233400200615             INVALID KEY
233500200615             MOVE "11"            TO RETN-RET-CODE
233600200615             MOVE "Investment record is missing"
233700200615                                  TO RETN-RET-CODE-DESC
233800200615             IF (BATCH-MODE)
233900200615                 MOVE "G12"       TO REJ-REJECTION-CODE
234000200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
234100200615             END-IF
234200200615             GO TO GAI-EXIT.
234300200615
234400200615      **** GET CORRESPONDING PRODUCT-TYPE-RULE
234500200615
234600200615           INITIALIZE MFAPRTCDP OF PRODUCT-TYPE-CODES-REC.
234700200615
234800200615           MOVE PRODUCT-TYPE-CODE OF INVESTMENT-REC
234900200615           TO   PRODUCT-TYPE-CODE OF PRODUCT-TYPE-CODES-REC.
235000200615
235100200615           READ PRODUCT-TYPE-CODES
235200200615             INVALID KEY
235300200615             MOVE "12"            TO RETN-RET-CODE
235400200615             MOVE "Product type codes record is missing"
235500200615                                  TO RETN-RET-CODE-DESC
235600200615             IF (BATCH-MODE)
235700200615                 MOVE "G13"       TO REJ-REJECTION-CODE
235800200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
235900200615             END-IF
236000200615             GO TO GAI-EXIT.
236100200615
236200200615           IF PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC = "2"
236300200615               IF ((ACCOUNT-MODE) OR (INVESTMENT-MODE))
236400200615               AND PASS-CERTIFICATE-ID-NO = ZEROES
236500200615                   PERFORM START-CERTIFICATE-DETAILS-1 THRU SCD-EXIT
236600200615                   IF (INVALID-CERTIFICATE)
236700200615152312               IF STMT-INTEREST-MODE AND lc_SE_Batch_Mode = "Y"
236800200615152312                 MOVE HIGH-VALUES TO CURR-CONTROLS
236900200615152312               END-IF
237000200615                       GO TO GAI-EXIT
237100200615                   END-IF
237200200615               ELSE
237300200615                   PERFORM READ-CERTIFICATE-DETAILS-2  THRU RCD-EXIT
237400200615                   IF (INVALID-CERTIFICATE)
237500200615                       GO TO GAI-EXIT
237600200615                   END-IF
237700200615               END-IF
237800200615           ELSE
237900200615               IF PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC = "7"
238000200615                AND NOT ACCOUNT-A1-MODE                                 RFS12320
238100200615                 IF DII-ADJUSTMENT-MODE                                 RFS8582
238200200615                   PERFORM START-INVESTMENT-DII-RATES                   RFS8582
238300200615                                               THRU SDR-EXIT            RFS8582
238400200615                 ELSE                                                   RFS8582
238500200615                   IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT = 0
238600200615      * 1004070 - Begin
238700200615                    AND NOT ACCOUNT-V2-MODE
238800200615      * 1004070 - End
238900200615      * 1017021 - Begin
239000200615                   AND NOT ACCOUNT-V3-MODE
239100200615      * 1017021 - End
239200200615                       NEXT SENTENCE
239300200615                   ELSE
239400200615152312                 IF STMT-INTEREST-MODE AND lc_SE_Batch_Mode = "Y"
239500200615162392                  AND CURR-CONTROLS NOT = HIGH-VALUES
239600200615152312                    MOVE 0  TO li_MatDate
239700200615152312                    MOVE 0  TO li_CertIdNo_SE
239800200615152312                    PERFORM INSERT-WK-Rec Thru IWR-EXIT
239900200615152312                    MOVE li_StrDate  TO PASS-END-DATE-OPTION
240000200615152312                    MOVE WS-DATE     TO WS-DATE-BK
240100200615152312                 END-IF
240200200615                       PERFORM START-INVESTMENT-DII-RATES
240300200615                                               THRU SDR-EXIT            RFS8371
240400200615                       PERFORM START-TRANS-2
240500200615                                               THRU STR-EXIT            RFS8371
240600200615                   END-IF
240700200615                 END-IF                                                 RFS8582
240800200615               ELSE
240900200615                   IF (ACCOUNT-MODE)
241000200615                       NEXT SENTENCE
241100200615                   ELSE
241200200615                       MOVE "13"            TO RETN-RET-CODE
241300200615                       MOVE "Not a GIC or DII type investment"
241400200615                       TO RETN-RET-CODE-DESC
241500200615                       IF (BATCH-MODE)
241600200615                           MOVE "G14"       TO REJ-REJECTION-CODE
241700200615                           PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
241800200615                       END-IF
241900200615                   END-IF
242000200615               END-IF
242100200615           END-IF.
242200200615
242300200615       GAI-EXIT.
242400200615           EXIT.
242500200615      /
242600200615       CALCULATE-ACCOUNT-INVESTMENT.
242700200615
242800200615      ******************************************************************
242900200615      *                                                                *
243000200615      *    C A L C U L A T E   A C C O U N T   I N V E S T M E N T     *
243100200615      *                                                                *
243200200615      ******************************************************************
243300200615141725     INITIALIZE WS-GIC-TOT-BAL.
243400200615
243500200615           IF PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC = "2"
243600200615           AND WS-SKIP-DETAILS = "N"
243700200615               PERFORM PROCESS-GIC-INVESTMENT THRU PGI-EXIT
243800200615141725         IF ACCOUNT-V2-MODE
243900200615      * 1017021 - Begin
244000200615                  OR ACCOUNT-V3-MODE
244100200615      * 1017021 - End
244200200615141725            MOVE WS-GIC-TOT-BAL TO RETN-BALANCE
244300200615141725         END-IF
244400200615           ELSE
244500200615               IF PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC = "7"
244600200615               AND WS-SKIP-DETAILS = "N"
244700200615               AND NOT ACCOUNT-A1-MODE                                  RFS12320
244800200615                 IF DII-ADJUSTMENT-MODE                                  RFS8582
244900200615                   PERFORM VD-PROCESS-DII-ADJUSTMENT                     RFS8582
245000200615                 ELSE                                                    RFS8582
245100200615                   PERFORM PROCESS-DII-INVESTMENT THRU PDI-EXIT
245200200615152312             IF STMT-INTEREST-MODE AND lc_SE_Batch_Mode = "Y"
245300200615152312               MOVE RETN-ACCRUAL-AMT TO li_AccrualAmt_SE
245400200615152312               MOVE WS-BALANCE       TO li_Balance_SE
245500200615152312               MOVE "S"              TO lc_Upd_Flag
245600200615152312               PERFORM UPDATE-WK-Rec Thru UWR-EXIT
245700200615152312               MOVE li_EndDate  TO PASS-END-DATE-OPTION
245800200615152312               PERFORM START-INVESTMENT-DII-RATES
245900200615152312                                     THRU SDR-EXIT
246000200615152312               PERFORM START-TRANS-2 THRU STR-EXIT
246100200615152312               IF WS-SKIP-DETAILS = "N"
246200200615152312                 MOVE WS-DATE-BK     TO WS-DATE
246300200615152312                 PERFORM PROCESS-DII-INVESTMENT THRU PDI-EXIT
246400200615152312                 MOVE RETN-ACCRUAL-AMT TO li_AccrualAmt_SE
246500200615152312                 MOVE WS-BALANCE       TO li_Balance_SE
246600200615152312                 MOVE "E"              TO lc_Upd_Flag
246700200615152312                 PERFORM UPDATE-WK-Rec Thru UWR-EXIT
246800200615152312               END-IF
246900200615152312             END-IF
247000200615141725             IF ACCOUNT-V2-MODE
247100200615      * 1017021 - Begin
247200200615                   OR ACCOUNT-V3-MODE
247300200615      * 1017021 - End
247400200615141725                MOVE WS-BALANCE TO RETN-BALANCE
247500200615141725             END-IF
247600200615                 END-IF                                                  RFS8582
247700200615               END-IF
247800200615           END-IF.
247900200615
248000200615      **** READ NEXT ACCOUNT-INVESTMENT
248100200615
248200200615           READ ACCOUNT-INVESTMENT  NEXT RECORD
248300200615           AT END
248400200615             MOVE HIGH-VALUES         TO CURR-CONTROLS
248500200615           GO TO CAI-EXIT.
248600200615
248700200615       CAI-EXIT.
248800200615           EXIT.
248900200615      /
249000200615       PROCESS-GIC-INVESTMENT.
249100200615
249200200615      ******************************************************************
249300200615      *                                                                *
249400200615      *    P R O C E S S   G I C   I N V E S T M E N T                 *
249500200615      *                                                                *
249600200615      ******************************************************************
249700200615           INITIALIZE WS-ACCRUAL-AMT-PER-GRP                             RFS9240
249800200615                      WS-TOTAL-INT-PAID                                 RFS10258
249900200615                      WS-TOTAL-INT-CALCULATED                           RFS10258
250000200615                      WS-INT-CALCULATED                                 RFS11367
250100200615      *RFS 12825 - START
250200200615                      WS-ADJUSTMENT-AMOUNT
250300200615      *RFS 12825 - END
250400200615
250500200615      **** IF MULTIPLE CERTIFICATES, PERFORM LOOP OF CERTIFICATE-DETAIL
250600200615
250700200615           IF ((ACCOUNT-MODE) OR (INVESTMENT-MODE))
250800200615           AND PASS-CERTIFICATE-ID-NO = ZEROES
250900200615               PERFORM LOOP-GIC-CERTIFICATE-DETAILS-1
251000200615                   THRU LGCD-EXIT
251100200615152312*            UNTIL NOT (VALID-CERTIFICATE)
251200200615152312              UNTIL (NOT VALID-CERTIFICATE AND lc_SE_Batch_Mode
251300200615152312               NOT = "Y") OR
251400200615152312              (lc_SE_Batch_Mode = "Y" AND (PASS-ACCOUNT-NO
251500200615152312              NOT = ACCOUNT-NO OF GIC-CERTIFICATE-DETAILS-1-REC OR
251600200615152312                    PASS-INVESTMENT-CODE NOT = INVESTMENT-CODE OF
251700200615152312                    GIC-CERTIFICATE-DETAILS-1-REC))
251800200615                   OR END-OF-FILE
251900200615                   OR CURR-CONTROLS = HIGH-VALUES
252000200615               IF (TRNPST-MODE) OR (INTEREST-MODE)
252100200615                   IF (TRNPST-MODE)
252200200615                       IF REDEMPTION-BEF-MATURITY
252300200615                       OF GIC-CERTIFICATE-DETAILS-3-REC = "N"
252400200615      * ---------------------------------
252500200615      * Get-gic-term-table and                                          RFS8371
252600200615      * Penalty-rate-schedule will be calculated in CALC-PENALTY-...    RFS8371
252700200615      * paragraph                                                       RFS8371
252800200615      *                                                                 RFS8371
252900200615      *                   PERFORM GET-GIC-TERM-TABLE THRU GTT-EXIT      RFS8371
253000200615      *                   IF CURR-CONTROLS = HIGH-VALUES                RFS8371
253100200615      *                       GO TO PGI-EXIT                            RFS8371
253200200615      *                   END-IF                                        RFS8371
253300200615      *                   PERFORM GET-GIC-PENALTY-RATE-SCHEDULE         RFS8371
253400200615      *                   THRU GPRS-EXIT                                RFS8371
253500200615      *                   IF CURR-CONTROLS = HIGH-VALUES                RFS8371
253600200615      *                       GO TO PGI-EXIT                            RFS8371
253700200615      *                   END-IF                                        RFS8371
253800200615      * ---------------------------------
253900200615                           PERFORM CALC-PENALTY-AND-REDEMPTION
254000200615                           THRU CPR-EXIT
254100200615                       END-IF
254200200615      *                PERFORM CALC-PENALTY-AND-REDEMPTION              RFS8371
254300200615      *                THRU CPR-EXIT                                    RFS8371
254400200615
254500200615                       IF CURR-CONTROLS = HIGH-VALUES
254600200615                           GO TO PGI-EXIT
254700200615                       END-IF
254800200615
254900200615                       MOVE ZEROES       TO RETN-ACCRUAL-AMT
255000200615                   END-IF
255100200615152312*            IF (INTEREST-MODE)
255200200615152312             IF (INTEREST-MODE) AND lc_SE_Batch_Mode NOT = "Y"
255300200615
255400200615                       IF PASS-GROSS-AMT < CURRENT-CERTIFICATE-BALANCE
255500200615                           OF GIC-CERTIFICATE-DETAILS-3-REC    AND
255600200615                          NOT STMT-INTEREST-MODE               AND      RFS11324
255700200615                          NOT ESTATE-INTEREST-MODE
255800200615                           MOVE ZEROES         TO RETN-ACCRUAL-AMT
255900200615                       ELSE
256000200615      *                    MOVE WS-ACCRUAL-AMT TO RETN-ACCRUAL-AMT      FIX06
256100200615                           COMPUTE RETN-ACCRUAL-AMT ROUNDED =           FIX06
256200200615                                                      WS-ACCRUAL-AMT    FIX06
256300200615                       END-IF
256400200615                   END-IF
256500200615               ELSE
256600200615                   PERFORM WRITE-ACCOUNT-INVESTMENT THRU WAI-EXIT
256700200615               END-IF
256800200615
256900200615               MOVE ZEROES           TO WS-ACCRUAL-AMT
257000200615
257100200615           ELSE
257200200615
257300200615      ****     IF CERTIFICATE LEVEL MODE - PROCESS CERTIFICATE DIRECTLY
257400200615
257500200615               MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-2-REC
257600200615               TO WS-PROCESS-DATE
257700200615               SET SW05-CHECK-DETAILS-2-REC            TO TRUE          RFS10404
257800200615               PERFORM CHECK-IF-VALID-GIC-CERTIFICATE  THRU CVC-EXIT
257900200615               IF (VALID-CERTIFICATE)
258000200615                   PERFORM PROCESS-GIC-CERTIFICATE     THRU PGC-EXIT
258100200615               END-IF
258200200615           END-IF.
258300200615
258400200615       PGI-EXIT.
258500200615           EXIT.
258600200615      /
258700200615       CALC-PENALTY-AND-REDEMPTION.
258800200615
258900200615      ******************************************************************
259000200615      *                                                                *
259100200615      *    C A L C   P E N A L T Y   A N D   R E D E M P T I O N       *
259200200615      *                                                                *
259300200615      ******************************************************************
259400200615
259500200615      * RFS138276 - Starts
259600200615           IF lc_RetnPenaltyMthod = lc_MVA
259700200615              MOVE PASS-END-DATE-OPTION  TO WS-TODAY
259800200615           END-IF.
259900200615      * RFS138276 - Ends
260000200615
260100200615
260200200615      **** PREPARE FOR FIRST READ OF GIC-RATES
260300200615
260400200615      * V-GET-RATE ... is searching WS-BASE-RATE                        RFS8371
260500200615      *Rfs123287 -begins include gic rates
260600200615121668*    IF (PASS-TRANS-TYPE  = Lc_Sell and
260700200615  |   *           lc_RetnPenaltyMthod = lc_MVA AND TRNPST-TE-MODE)
260800200615  |   *          PERFORM GET-GIC-TERM-TABLE THRU GTT-EXIT
260900200615  |   *          PERFORM GET-GIC-PENALTY-RATE-SCHEDULE
261000200615  |   *                                       THRU GPRS-EXIT
261100200615  |   *          GO TO GET-PENALTY-AMT
261200200615121668*    END-IF.
261300200615121668*    IF TRNPST-TE-MODE                                            RFS8371
261400200615      *Rfs123287 -ends
261500200615      *Rfs123287 - if called from trnpst but the transaction is MVA
261600200615      *(market value adjustment) sell, bypass if and execute else code
261700200615137833* Override issue date of certificate for transfer in kind.
261800200615137833     IF lb_TransferInKindYes AND li_OriginalIssueDate > 0
261900200615137833       MOVE li_OriginalIssueDate
262000200615137833         TO ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
262100200615137833     END-IF.
262200200615138130* Comment out the following IF statement and replace it with
262300200615138130* a fix one.  That for Empire MVA, always use certificate term to
262400200615138130* get the current base rate instead of remaining term.
262500200615138130*    IF TRNPST-TE-MODE AND NOT(PASS-TRANS-TYPE  = Lc_Sell         RFS8371
262600200615138130*         AND lc_RetnPenaltyMthod = lc_MVA)
262700200615138130     IF TRNPST-TE-MODE AND
262800200615138130        lc_RetnPenaltyMthod NOT = lc_MVA
262900200615             SET SW09-RATE-NOT-FOUND               TO TRUE              RFS8371
263000200615             PERFORM V-GET-RATE-TERM-GROUP-ALLOWED                      RFS8371
263100200615             IF SW09-RATE-FOUND                                         RFS8371
263200200615      * RFS16609 - Begin
263300200615      * -------------------------------------------------------
263400200615      *          MOVE GIC-TERM-IDX2-REC        TO GIC-TERM-REC
263500200615      * -------------------------------------------------------
263600200615                 PERFORM GET-GIC-TERM-TABLE THRU GTT-EXIT               RFS8371
263700200615                 IF CURR-CONTROLS = HIGH-VALUES                         RFS8371
263800200615                     GO TO CPR-EXIT                                     RFS8371
263900200615                 END-IF                                                 RFS8371
264000200615      * RFS16609 - End
264100200615                 PERFORM GET-GIC-PENALTY-RATE-SCHEDULE
264200200615                                              THRU GPRS-EXIT
264300200615                 IF CURR-CONTROLS = HIGH-VALUES
264400200615                     GO TO CPR-EXIT                                     RFS8371
264500200615                 END-IF
264600200615             ELSE                                                       RFS8371
264700200615                 PERFORM XW010-ERR-RATE
264800200615                 GO TO CPR-EXIT                                         RFS8371
264900200615             END-IF                                                     RFS8371
265000200615           ELSE                                                         RFS8371
265100200615             PERFORM GET-GIC-TERM-TABLE THRU GTT-EXIT                   RFS8371
265200200615             IF CURR-CONTROLS = HIGH-VALUES                             RFS8371
265300200615                 GO TO CPR-EXIT                                         RFS8371
265400200615             END-IF                                                     RFS8371
265500200615             PERFORM GET-GIC-PENALTY-RATE-SCHEDULE                      RFS8371
265600200615                                                   THRU GPRS-EXIT       RFS8371
265700200615             IF CURR-CONTROLS = HIGH-VALUES                             RFS8371
265800200615                 GO TO CPR-EXIT                                         RFS8371
265900200615             END-IF                                                     RFS8371
266000200615
266100200615             INITIALIZE MFAGIRTP OF GIC-RATES-REC
266200200615
266300200615             MOVE TERM-GROUP OF GIC-CERTIFICATE-DETAILS-3-REC
266400200615             TO TERM-GROUP OF GIC-RATES-REC
266500200615
266600200615             MOVE TERM-CODE  OF GIC-CERTIFICATE-DETAILS-3-REC
266700200615             TO TERM-CODE OF GIC-RATES-REC
266800200615
266900200615             START GIC-RATES
267000200615               KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
267100200615               INVALID KEY
267200200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
267300200615               MOVE "99"                TO RETN-RET-CODE
267400200615               GO TO CPR-EXIT
267500200615               MOVE
267600200615               "No Valid GIC Rates to calculate Replacement&Penalty"
267700200615               TO RETN-RET-CODE-DESC
267800200615               GO TO CPR-EXIT
267900200615             END-START                                                  RFS8371
268000200615
268100200615      **** PRIME READ OF GIC-RATES FILE
268200200615
268300200615             READ GIC-RATES               NEXT RECORD
268400200615             AT END
268500200615              MOVE HIGH-VALUES         TO CURR-CONTROLS
268600200615              MOVE "31"                TO RETN-RET-CODE
268700200615123287*       GO TO CPR-EXIT
268800200615              MOVE
268900200615              "No Valid GIC Rates to calculate Replacement&Penalty"
269000200615              TO RETN-RET-CODE-DESC
269100200615123287        GO TO CPR-EXIT
269200200615123287       END-READ                                                   RFS8371
269300200615
269400200615             IF (TERM-GROUP OF GIC-CERTIFICATE-DETAILS-3-REC NOT EQUAL
269500200615               TERM-GROUP OF GIC-RATES-REC) OR
269600200615              (TERM-CODE  OF GIC-CERTIFICATE-DETAILS-3-REC NOT EQUAL
269700200615               TERM-CODE  OF GIC-RATES-REC) OR
269800200615              (WS-TODAY < UP-TO-DATE OF GIC-RATES-REC)
269900200615               MOVE HIGH-VALUES         TO CURR-CONTROLS
270000200615               MOVE "31"                TO RETN-RET-CODE
270100200615123287*        GO TO CPR-EXIT
270200200615               MOVE
270300200615               "No Valid GIC Rates to calculate Replacement&Penalty"
270400200615               TO RETN-RET-CODE-DESC
270500200615123287        GO TO CPR-EXIT
270600200615             END-IF
270700200615
270800200615             MOVE TERM-GROUP  OF GIC-RATES TO WS-PREV-TERM-GROUP
270900200615             MOVE TERM-CODE   OF GIC-RATES TO WS-PREV-TERM-CODE
271000200615             MOVE POSTED-RATE OF GIC-RATES TO WS-PREV-POSTED-RATE
271100200615             MOVE UP-TO-DATE  OF GIC-RATES TO WS-PREV-UP-TO-DATE
271200200615
271300200615             PERFORM FIND-GIC-RATE THRU FGR-EXIT
271400200615               UNTIL WS-TODAY <
271500200615                UP-TO-DATE OF GIC-RATES-REC
271600200615                OR TERM-GROUP OF GIC-CERTIFICATE-DETAILS-3-REC NOT =
271700200615                TERM-GROUP OF GIC-RATES-REC                     OR
271800200615                TERM-CODE  OF GIC-CERTIFICATE-DETAILS-3-REC NOT =
271900200615                TERM-CODE  OF GIC-RATES-REC
272000200615             OR CURR-CONTROLS IS EQUAL TO HIGH-VALUES
272100200615             OR END-OF-FILE
272200200615
272300200615             IF WS-TODAY >= WS-PREV-UP-TO-DATE     AND
272400200615              TERM-GROUP OF GIC-CERTIFICATE-DETAILS-3-REC =
272500200615              WS-PREV-TERM-GROUP             AND
272600200615              TERM-CODE  OF GIC-CERTIFICATE-DETAILS-3-REC =
272700200615              WS-PREV-TERM-CODE
272800200615               MOVE WS-PREV-POSTED-RATE TO WS-BASE-RATE
272900200615             END-IF                                                     RFS8371
273000200615           END-IF.                                                      RFS8371
273100200615      * ---------------------------------
273200200615           IF WS-BASE-RATE = ZEROES
273300200615               MOVE HIGH-VALUES         TO CURR-CONTROLS
273400200615               MOVE "97"                TO RETN-RET-CODE
273500200615               MOVE
273600200615               "No Valid GIC Rates to calculate Replacement&Penalty"
273700200615                TO RETN-RET-CODE-DESC
273800200615               GO TO CPR-EXIT
273900200615           END-IF.
274000200615      * ---------------------------------
274100200615      *
274200200615      **** CALCULATE DAYS REMAINING ON CERTIFICATE
274300200615      *
274400200615           MOVE PASS-END-DATE-OPTION TO DGP-GREGORIAN .
274500200615
274600200615           CALL "DRG2J" USING        DR-G2J-PARMS.
274700200615           MOVE DGP-JULIAN           TO WS-JULIAN-START.
274800200615
274900200615           MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
275000200615           TO DGP-GREGORIAN.
275100200615
275200200615           CALL "DRG2J" USING       DR-G2J-PARMS.
275300200615           MOVE DGP-JULIAN          TO WS-JULIAN-END.
275400200615
275500200615           COMPUTE WS-NUM-OF-DAYS-REMAIN =
275600200615           WS-JULIAN-END - WS-JULIAN-START.
275700200615
275800200615
275900200615      **** CALCULATE DAYS ELAPSED ON CERTIFICATE
276000200615
276100200615           MOVE ISSUE-DATE    OF GIC-CERTIFICATE-DETAILS-3-REC
276200200615           TO DGP-GREGORIAN.
276300200615
276400200615           CALL "DRG2J" USING        DR-G2J-PARMS.
276500200615           MOVE DGP-JULIAN           TO WS-JULIAN-START.
276600200615
276700200615           MOVE PASS-END-DATE-OPTION
276800200615           TO DGP-GREGORIAN.
276900200615
277000200615           CALL "DRG2J" USING       DR-G2J-PARMS.
277100200615           MOVE DGP-JULIAN          TO WS-JULIAN-END.
277200200615
277300200615           COMPUTE WS-NUM-OF-DAYS-ELAPSED =
277400200615           WS-JULIAN-END - WS-JULIAN-START.
277500200615
277600200615
277700200615      * RFS138276 - Starts
277800200615      **** To Calculate the Base Rate(Promotional rate), in case
277900200615      **** of penalty method 2.
278000200615
278100200615           IF (lc_RetnPenaltyMthod = lc_MVA)
278200200615              PERFORM Calc-Promotional-Rate
278300200615           END-IF.
278400200615
278500200615      * RFS138276 - Ends
278600200615
278700200615      **** RATE DIFFERENCE
278800200615
278900200615           COMPUTE WS-RATE-DIFFERENCE = WS-BASE-RATE -
279000200615           INT-RATE OF GIC-CERTIFICATE-DETAILS-3-REC.
279100200615
279200200615           IF WS-RATE-DIFFERENCE > 0
279300200615
279400200615               COMPUTE WS-CALC-FIELD =
279500200615               PASS-GROSS-AMT * ((WS-RATE-DIFFERENCE
279600200615               * WS-NUM-OF-DAYS-REMAIN) / 365)
279700200615
279800200615               COMPUTE RETN-REPLACEMENT-AMT ROUNDED =
279900200615               WS-CALC-FIELD / 100
280000200615
280100200615               MOVE WS-RATE-DIFFERENCE
280200200615               TO RETN-REPLACEMENT-RATE
280300200615
280400200615           ELSE
280500200615               MOVE ZEROES          TO RETN-REPLACEMENT-AMT
280600200615                                       RETN-REPLACEMENT-RATE
280700200615           END-IF.
280800200615      * RFS113783 Start-Replacement minimum to Retn-Replacement-Amt
280900200615
281000200615           IF  Retn-Replacement-Amt < ln_RetnMinimumAmt
281100200615               MOVE ln_RetnMinimumAmt  TO Retn-Replacement-Amt
281200200615           END-IF.
281300200615
281400200615123287*GET-PENALTY-AMT.
281500200615
281600200615           IF lc_RetnPenaltyMthod = lc_MVA  AND
281700200615             (PASS-TRANS-TYPE  NOT = lc_SwitchOut  AND
281800200615              PASS-TRANS-TYPE  NOT = lc_TransferOut)
281900200615              MOVE ZEROES          TO RETN-REPLACEMENT-AMT
282000200615                                      RETN-REPLACEMENT-RATE
282100200615           END-IF.
282200200615
282300200615      * RFS113783  End
282400200615
282500200615           IF REDEMPTION-BEF-MATURITY
282600200615               OF GIC-CERTIFICATE-DETAILS-3-REC = "N"
282700200615
282800200615113783       IF lc_RetnPenaltyMthod = lc_MVA
282900200615113783          PERFORM Calculate-MVA
283000200615113783       ELSE
283100200615               COMPUTE WS-CALC-FIELD =
283200200615               PASS-GROSS-AMT *
283300200615               ((PENALTY-RATE  OF GIC-PENALTY-RATE-SCHEDUL2-REC *
283400200615               WS-NUM-OF-DAYS-ELAPSED) / 365)
283500200615
283600200615               COMPUTE RETN-PENALTY-AMT ROUNDED =
283700200615               WS-CALC-FIELD / 100
283800200615
283900200615      * RFS113783- Start
284000200615      *        IF RETN-PENALTY-AMT >
284100200615      *            MIN-AMT OF GIC-PENALTY-RATE-SCHEDUL2-REC
284200200615      *            NEXT SENTENCE
284300200615      *        ELSE
284400200615      *            MOVE MIN-AMT OF GIC-PENALTY-RATE-SCHEDUL2-REC
284500200615      *            TO RETN-PENALTY-AMT
284600200615      *        END-IF
284700200615               IF RETN-PENALTY-AMT <
284800200615                   MIN-AMT OF GIC-PENALTY-RATE-SCHEDUL2-REC
284900200615                   MOVE MIN-AMT OF GIC-PENALTY-RATE-SCHEDUL2-REC
285000200615                   TO RETN-PENALTY-AMT
285100200615               END-IF
285200200615             END-IF
285300200615      * RFS113783- End
285400200615           ELSE
285500200615               MOVE ZEROES          TO RETN-PENALTY-AMT
285600200615           END-IF.
285700200615
285800200615       CPR-EXIT.
285900200615           EXIT.
286000200615
286100200615      * RFS138276 - Starts
286200200615      * ----------------------------------
286300200615       Calc-Promotional-Rate.
286400200615      * ----------------------------------
286500200615      **** Calculate Banded Rate and Promotional Rate
286600200615
286700200615           INITIALIZE MFAIVRP       OF INVESTOR-REC.
286800200615           MOVE INVESTOR-NO         OF ACCOUNT-REC
286900200615           TO   INVESTOR-NO         OF INVESTOR-REC.
287000200615           READ INVESTOR
287100200615           INVALID KEY
287200200615              CONTINUE.
287300200615
287400200615           IF DATE-OF-BIRTH OF INVESTOR = ZEROS
287500200615              MOVE ZEROS             TO PRM-PASS-AGE
287600200615           ELSE
287700200615              MOVE SPACES            TO lc_CALCDUR-PARMS
287800200615              MOVE DATE-OF-BIRTH OF INVESTOR
287900200615                                     TO li_CALCDUR-START-DATE
288000200615              MOVE WS-AS-AT-DATE     TO  li_CALCDUR-END-DATE
288100200615              CALL "CALCDUR" USING lc_CALCDUR-PARMS
288200200615              MOVE li_CALCDUR-YEARS  TO PRM-PASS-AGE
288300200615           END-IF.
288400200615      **** PASS TERM-GROUP
288500200615           MOVE WS-PREV-TERM-GROUP   TO PRM-PASS-TERM-GROUP.
288600200615      **** PASS TERM-CODE
288700200615           MOVE WS-PREV-TERM-CODE    TO PRM-PASS-TERM-CODE.
288800200615      **** PASS ISSUE-DATE
288900200615           MOVE WS-TODAY             TO PRM-PASS-ISSUE-DATE.
289000200615      **** PASS MATURITY-DATE
289100200615           MOVE MATURITY-DATE OF
289200200615                GIC-CERTIFICATE-DETAILS-3-REC
289300200615                                     TO PRM-PASS-MATURITY-DATE.
289400200615      **** PASS DOLLAR-AMOUNT
289500200615           MOVE CURRENT-CERTIFICATE-BALANCE OF
289600200615                GIC-CERTIFICATE-DETAILS-3-REC
289700200615                                     TO PRM-PASS-DOLLAR-AMOUNT.
289800200615
289900200615           INITIALIZE  PI_INVESTORNO,
290000200615                       PC_IATCODE,
290100200615                       PC_ERRCODE,
290200200615                       PI_ACCOUNTNO,
290300200615                       PI_PROCESSDATE,
290400200615                       PN_ACVAMOUNT.
290500200615           MOVE INVESTOR-NO  OF INVESTOR-REC TO PI_INVESTORNO.
290600200615           CALL "FXGICIAT" USING
290700200615                           PI_INVESTORNO
290800200615                           PC_IATCODE
290900200615                           PC_ERRCODE.
291000200615           MOVE PC_IATCODE TO PRM-PASS-IAT-CODE.
291100200615
291200200615           MOVE ACCOUNT-NO OF ACCOUNT-REC TO PI_ACCOUNTNO.
291300200615           MOVE WS-AS-AT-DATE TO PI_PROCESSDATE.
291400200615           CALL "FXGICACV" USING
291500200615                           PI_ACCOUNTNO
291600200615                           PI_PROCESSDATE
291700200615                           PN_ACVAMOUNT.
291800200615           MOVE PN_ACVAMOUNT TO PRM-PASS-CURRENT-MARKET-VALUE.
291900200615           CALL "FXGICACT" USING  PI_ACCOUNTNO,
292000200615                                  PC_ACC_TYPE,
292100200615                                  PC_NOM_TYPE.
292200200615
292300200615           MOVE PC_ACC_TYPE  TO PRM-PASS-ACC-TYPE.
292400200615           MOVE PC_NOM_TYPE  TO PRM-PASS-NOMINEE-TYPE.
292500200615
292600200615           CALL "FXGICNOY" USING  PI_ACCOUNTNO,
292700200615                                  PI_INV_AGE.
292800200615
292900200615           MOVE PI_INV_AGE   TO PRM-PASS-FIRST-INVESTMENT-AGE.
293000200615
293100200615           CALL "PRMCLC" USING PRMCLC-PARMS.
293200200615
293300200615           MOVE PRM-RETN-INTEREST-RATE   TO ln_PromotionRate.
293400200615           MOVE PRM-RETN-BASE-RATE       TO ln_BandedRate.
293500200615
293600200615           IF lc_RetnPenaltyMthod = lc_MVA AND
293700200615              ln_PromotionRate    > 0
293800200615              MOVE ln_PromotionRate TO WS-BASE-RATE
293900200615           END-IF.
294000200615      * RFS138276 - Ends
294100200615
294200200615      * RFS113783- Start
294300200615
294400200615      * ----------------------------------
294500200615       Calculate-MVA.
294600200615      * ----------------------------------                              RFS8371
294700200615           INITIALIZE Retn-Penalty-Amt Retn-Schedule-Code
294800200615                      Retn-Penalty-Rate ln_PassAdjustRate.
294900200615           MOVE Pass-Certificate-ID-No TO li_PassCertID.
295000200615           MOVE Pass-End-Date-Option   TO li_PassDateStart.
295100200615           MOVE Maturity-Date OF GIC-Certificate-Details-3-Rec
295200200615                                       TO li_PassDateEnd.
295300200615           MOVE Penalty-Rate  OF GIC-PENALTY-RATE-SCHEDUL2-REC
295400200615                                       TO ln_PassOrgPnlRate.
295500200615           IF Ws-Rate-Difference > 0
295600200615              MOVE Ws-Rate-Difference  TO ln_PassAdjustRate.
295700200615
295800200615           IF pass-gross-amt = current-certificate-balance of
295900200615                                  GIC-Certificate-Details-3-Rec
296000200615              COMPUTE ln_PassMVAGrossAmt
296100200615                    = Pass-Gross-Amt + WS-ACCRUAL-AMT
296200200615           ELSE
296300200615              COMPUTE ln_PassMVAGrossAmt
296400200615                    = Pass-Gross-Amt
296500200615           END-IF.
296600200615
296700200615           CALL "FXMVAPNLTY" USING li_PassCertID,
296800200615                                   li_PassDateStart,
296900200615                                   li_PassDateEnd,
297000200615                                   Pass-MVA-Method,
297100200615                                   ln_PassMVAGrossAmt,
297200200615      *                            Pass-Gross-Amt,
297300200615                                   ln_PassOrgPnlRate,
297400200615                                   ln_PassAdjustRate,
297500200615                                   ln_RetnMVAPenalty,
297600200615                                   ln_RetnPenRate.
297700200615
297800200615           MOVE ln_RetnMVAPenalty TO Retn-Penalty-Amt.
297900200615           MOVE ln_RetnPenRate    TO Retn-Penalty-Rate.
298000200615
298100200615           IF PASS-TRANS-TYPE NOT = lc_Sell
298200200615             MOVE ZEROS   TO Retn-Penalty-Amt
298300200615             MOVE SPACES  TO Retn-Schedule-Code
298400200615             MOVE ZEROS   TO Retn-Penalty-Rate
298500200615           END-IF.
298600200615      * RFS113783- End
298700200615      * ----------------------------------
298800200615       CALC-TERM-DAYS-REMAIN.                                           RFS8371
298900200615      * ----------------------------------                              RFS8371
299000200615           PERFORM CALC-TERM-REMAIN.                                    RFS8371
299100200615      * ---------------------------------
299200200615       CALC-TERM-REMAIN.                                                RFS8371
299300200615      * ---------------------------------
299400200615      *                                                                 RFS8371
299500200615      * Calculate Term for the remaining days ...                       RFS8371
299600200615      *                                                                 RFS8371
299700200615           INITIALIZE                            WS-TERM-DAYS-REMAIN    RFS8371
299800200615                                                 TRMDT-TERM
299900200615                                                 DR-TRMDT-PARMS         RFS8371
300000200615                                                                        RFS8371
300100200615           MOVE PASS-END-DATE-OPTION                           TO       RFS8371
300200200615                                                 TRMDT-START-DATE       RFS8371
300300200615           MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC TO       RFS8371
300400200615                                                 TRMDT-END-DATE         RFS8371
300500200615           PERFORM X020-CALL-TERM                                       RFS8371
300600200615
300700200615           MOVE TRMDT-RETN-TERM      TO WS-TERM-DAYS-REMAIN.            RFS8371
300800200615      * ----------------------------------
300900200615      /
301000200615       FIND-GIC-RATE.
301100200615
301200200615      ******************************************************************
301300200615      *                                                                *
301400200615      *    F I N D   G I C   R A T E                                   *
301500200615      *                                                                *
301600200615      ******************************************************************
301700200615
301800200615           MOVE TERM-GROUP  OF GIC-RATES-REC TO WS-PREV-TERM-GROUP.
301900200615           MOVE TERM-CODE   OF GIC-RATES-REC TO WS-PREV-TERM-CODE.
302000200615           MOVE POSTED-RATE OF GIC-RATES-REC TO WS-PREV-POSTED-RATE.
302100200615           MOVE UP-TO-DATE  OF GIC-RATES-REC TO WS-PREV-UP-TO-DATE.
302200200615
302300200615           READ GIC-RATES               NEXT RECORD
302400200615           AT END
302500200615           GO TO FGR-EXIT.
302600200615
302700200615       FGR-EXIT.
302800200615           EXIT.
302900200615      /
303000200615       GET-GIC-PENALTY-RATE-SCHEDULE.
303100200615
303200200615      ******************************************************************
303300200615      *                                                                *
303400200615      *    G E T   G I C   P E N A L T Y   R A T E   S C H E D U L E   *
303500200615      *                                                                *
303600200615      ******************************************************************
303700200615
303800200615           MOVE ZEROES
303900200615           TO TRMDT-TERM.
304000200615
304100200615           MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
304200200615           TO TRMDT-START-DATE.
304300200615
304400200615      *    MOVE WS-TODAY
304500200615           MOVE PASS-END-DATE-OPTION                                    RFS8371
304600200615           TO TRMDT-END-DATE.
304700200615
304800200615           CALL "DRTRMDT" USING     DR-TRMDT-PARMS.
304900200615
305000200615           MOVE "N"                 TO WS-PENALTY-FOUND.
305100200615      *                                                                 RFS8371
305200200615      * Initialize key to start from the correct point                  RFS8371
305300200615      * Initialize record                                               RFS8371
305400200615      *                                                                 RFS8371
305500200615           INITIALIZE   MFAGIPRSP OF GIC-PENALTY-RATE-SCHEDULE-REC      RFS8371
305600200615                        MFAGIPRSP OF GIC-PENALTY-RATE-SCHEDUL2-REC      RFS8371
305700200615           MOVE PENALTY-RATE-SCHEDULE-CODE OF GIC-TERM-REC     TO       RFS8371
305800200615                PENALTY-RATE-SCHEDULE-CODE                              RFS8371
305900200615                                      OF GIC-PENALTY-RATE-SCHEDULE-REC  RFS8371
306000200615           START GIC-PENALTY-RATE-SCHEDULE
306100200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
306200200615             INVALID KEY
306300200615             MOVE HIGH-VALUES     TO CURR-CONTROLS
306400200615             MOVE "31"            TO RETN-RET-CODE
306500200615             MOVE "No Penalty rate record for this code"
306600200615                                  TO RETN-RET-CODE-DESC
306700200615             IF (BATCH-MODE)
306800200615                 MOVE "G15"       TO REJ-REJECTION-CODE
306900200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
307000200615             END-IF
307100200615             GO TO GPRS-EXIT.
307200200615
307300200615      **** PRIME READ OF GIC-PENALTY-RATE-SCHEDULE
307400200615
307500200615           READ GIC-PENALTY-RATE-SCHEDULE NEXT RECORD
307600200615           AT END
307700200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
307800200615               MOVE "32"            TO RETN-RET-CODE
307900200615               MOVE "No Penalty Code found for Term Code"
308000200615                                    TO RETN-RET-CODE-DESC
308100200615               IF (BATCH-MODE)
308200200615                   MOVE "G15"       TO REJ-REJECTION-CODE
308300200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
308400200615               END-IF
308500200615           GO TO GPRS-EXIT.
308600200615
308700200615           IF (PENALTY-RATE-SCHEDULE-CODE OF GIC-TERM-REC NOT EQUAL
308800200615               PENALTY-RATE-SCHEDULE-CODE
308900200615               OF GIC-PENALTY-RATE-SCHEDULE-REC)
309000200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
309100200615               MOVE "32"            TO RETN-RET-CODE
309200200615               MOVE "No Penalty Code found for Term Code"
309300200615                                    TO RETN-RET-CODE-DESC
309400200615               IF (BATCH-MODE)
309500200615                   MOVE "G15"       TO REJ-REJECTION-CODE
309600200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
309700200615               END-IF
309800200615           GO TO GPRS-EXIT.
309900200615
310000200615      **** LOOP THROUGH PENALTY RECORDS UNTIL PERFECT MATCH
310100200615
310200200615           PERFORM LOOP-GIC-PENALTY-RATE-SCHEDULE THRU LPRS-EXIT
310300200615               UNTIL (PENALTY-RATE-SCHEDULE-CODE OF
310400200615                      GIC-PENALTY-RATE-SCHEDULE-REC NOT =
310500200615                      PENALTY-RATE-SCHEDULE-CODE OF GIC-TERM-REC)
310600200615                  OR (CURR-CONTROLS = HIGH-VALUES)
310700200615                  OR (END-OF-FILE).
310800200615
310900200615      **** VALIDATE THAT RECORD FOUND IS A MATCH
311000200615
311100200615           IF (PENALTY-FOUND)
311200200615               IF  (CURR-CONTROLS NOT = HIGH-VALUES)
311300200615               AND  (PENALTY-RATE-SCHEDULE-CODE OF
311400200615                     GIC-PENALTY-RATE-SCHEDUL2-REC =
311500200615                     PENALTY-RATE-SCHEDULE-CODE OF GIC-TERM-REC)
311600200615      *        AND (ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC >=      RFS8371
311700200615      *              EFFECTIV-DATE OF GIC-PENALTY-RATE-SCHEDUL2-REC)    RFS8371
311800200615               AND (PASS-END-DATE-OPTION                        >=      RFS8371
311900200615                     EFFECTIV-DATE OF GIC-PENALTY-RATE-SCHEDUL2-REC)    RFS8371
312000200615               AND (TRMDT-RETN-TERM
312100200615                     >= HELD-MIN OF GIC-PENALTY-RATE-SCHEDUL2-REC)
312200200615               AND (TRMDT-RETN-TERM
312300200615                     <= HELD-MAX OF GIC-PENALTY-RATE-SCHEDUL2-REC)
312400200615
312500200615                   MOVE PENALTY-RATE-SCHEDULE-CODE
312600200615                   OF GIC-PENALTY-RATE-SCHEDUL2-REC
312700200615                   TO RETN-SCHEDULE-CODE
312800200615
312900200615                   MOVE PENALTY-RATE OF GIC-PENALTY-RATE-SCHEDUL2-REC
313000200615                   TO RETN-PENALTY-RATE
313100200615
313200200615               ELSE
313300200615
313400200615                   MOVE HIGH-VALUES     TO CURR-CONTROLS
313500200615                   MOVE "32"            TO RETN-RET-CODE
313600200615                   MOVE "No Penalty Code found for Term Code"
313700200615                                        TO RETN-RET-CODE-DESC
313800200615                   IF (BATCH-MODE)
313900200615                       MOVE "G15"       TO REJ-REJECTION-CODE
314000200615                       PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
314100200615                   END-IF
314200200615                   GO TO GPRS-EXIT
314300200615
314400200615               END-IF
314500200615           ELSE
314600200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
314700200615               MOVE "32"            TO RETN-RET-CODE
314800200615               MOVE "No Penalty Code found for Term Code"
314900200615                                    TO RETN-RET-CODE-DESC
315000200615               IF (BATCH-MODE)
315100200615                   MOVE "G15"       TO REJ-REJECTION-CODE
315200200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
315300200615               END-IF
315400200615               GO TO GPRS-EXIT
315500200615            END-IF.
315600200615
315700200615       GPRS-EXIT.
315800200615            EXIT.
315900200615      /
316000200615       LOOP-GIC-PENALTY-RATE-SCHEDULE.
316100200615
316200200615      ******************************************************************
316300200615      *                                                                *
316400200615      *    L O O P   G I C   P E N A L T Y   R A T E   S C H E D U L E *
316500200615      *                                                                *
316600200615      ******************************************************************
316700200615
316800200615      *    IF ((ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC >=          RFS8371
316900200615      *         EFFECTIV-DATE OF GIC-PENALTY-RATE-SCHEDULE-REC)         RFS8371
317000200615
317100200615           IF ((PASS-END-DATE-OPTION                        >=          RFS8371
317200200615                     EFFECTIV-DATE OF GIC-PENALTY-RATE-SCHEDULE-REC)    RFS8371
317300200615           AND (TRMDT-RETN-TERM
317400200615                >= HELD-MIN OF GIC-PENALTY-RATE-SCHEDULE-REC)
317500200615           AND (TRMDT-RETN-TERM
317600200615                <= HELD-MAX OF GIC-PENALTY-RATE-SCHEDULE-REC))
317700200615               MOVE "Y"             TO WS-PENALTY-FOUND
317800200615               MOVE GIC-PENALTY-RATE-SCHEDULE-REC
317900200615               TO   GIC-PENALTY-RATE-SCHEDUL2-REC
318000200615           END-IF.
318100200615
318200200615      **** READ NEXT GIC-PENALTY-RATE-SCHEDULE RECORD
318300200615
318400200615           READ GIC-PENALTY-RATE-SCHEDULE NEXT RECORD
318500200615           AT END
318600200615             IF WS-PENALTY-FOUND NOT EQUAL "Y"
318700200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
318800200615               MOVE "32"            TO RETN-RET-CODE
318900200615               MOVE "No Penalty Code found for Term Code"
319000200615                                    TO RETN-RET-CODE-DESC
319100200615               IF (BATCH-MODE)
319200200615                   MOVE "G15"       TO REJ-REJECTION-CODE
319300200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
319400200615               END-IF
319500200615             END-IF
319600200615               GO TO LPRS-EXIT
319700200615           END-READ.
319800200615
319900200615       LPRS-EXIT.
320000200615            EXIT.
320100200615      /
320200200615       GET-GIC-TERM-TABLE.
320300200615
320400200615      ******************************************************************
320500200615      *                                                                *
320600200615      *    G E T   G I C   T E R M   T A B L E                         *
320700200615      *                                                                *
320800200615      ******************************************************************
320900200615
321000200615           MOVE TERM-CODE OF GIC-CERTIFICATE-DETAILS-3-REC
321100200615           TO   TERM-CODE OF GIC-TERM-REC.
321200200615
321300200615      **** READ OF GIC-TERM
321400200615
321500200615           READ GIC-TERM
321600200615             INVALID KEY
321700200615             MOVE "31"            TO RETN-RET-CODE
321800200615             MOVE "No Term Record Found for certificate"
321900200615                                  TO RETN-RET-CODE-DESC
322000200615             MOVE HIGH-VALUES     TO CURR-CONTROLS
322100200615             IF (BATCH-MODE)
322200200615                 MOVE "G16"       TO REJ-REJECTION-CODE
322300200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
322400200615             END-IF
322500200615             GO TO GTT-EXIT.
322600200615
322700200615       GTT-EXIT.
322800200615           EXIT.
322900200615      /
323000200615       LOOP-GIC-CERTIFICATE-DETAILS-1.
323100200615
323200200615      ******************************************************************
323300200615      *                                                                *
323400200615      *    L O O P   G I C   C E R T I F I C A T E   D E T A I L S - 1 *
323500200615      *                                                                *
323600200615      ******************************************************************
323700200615           INITIALIZE WS-ACCRUAL-AMT-PER-GRP                             RFS9240
323800200615                      WS-TOTAL-INT-PAID                                 RFS10258
323900200615                      WS-TOTAL-INT-CALCULATED                           RFS10258
324000200615                      WS-INT-CALCULATED                                 RFS11367
324100200615      *RFS 12825 - START
324200200615                      WS-ADJUSTMENT-AMOUNT
324300200615      *RFS 12825 - END
324400200615
324500200615      **** PRIME WS-PROCESS-DATE WITH ISSUE-DATE OF LOOPED CERTIFICATE
324600200615
324700200615           MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-1-REC
324800200615           TO WS-PROCESS-DATE.
324900200615
325000200615      **** VALIDATE
325100200615
325200200615           SET SW05-CHECK-DETAILS-1-REC            TO TRUE              RFS10404
325300200615           PERFORM CHECK-IF-VALID-GIC-CERTIFICATE THRU CVC-EXIT.
325400200615
325500200615      **** PROCESS
325600200615
325700200615152312*    IF (VALID-CERTIFICATE)
325800200615152312     IF (VALID-CERTIFICATE AND lc_SE_Batch_Mode Not = "Y") OR
325900200615152312        (lc_SE_Batch_Mode = "Y")
326000200615152312       IF STMT-INTEREST-MODE AND lc_SE_Batch_Mode = "Y"
326100200615152312         INITIALIZE WS-ACCRUAL-AMT-PER-GRP
326200200615152312                    WS-TOTAL-INT-PAID
326300200615152312                    WS-TOTAL-INT-CALCULATED
326400200615152312                    WS-INT-CALCULATED
326500200615152312                    WS-ADJUSTMENT-AMOUNT
326600200615152312         MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
326700200615152312           TO li_MatDate
326800200615152312         MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
326900200615152312           TO li_CertIdNo_SE
327000200615152312         PERFORM INSERT-WK-Rec Thru IWR-EXIT
327100200615152312         MOVE li_StrDate  TO PASS-END-DATE-OPTION
327200200615152312         IF CERT-STATUS-CODE OF GIC-CERTIFICATE-DETAILS-3-REC
327300200615152312             = "C" AND CERTIFICATE-STATUS-DATE OF
327400200615152312            GIC-CERTIFICATE-DETAILS-3-REC < PASS-END-DATE-OPTION
327500200615152312             CONTINUE
327600200615152312          ELSE
327700200615152312            PERFORM PROCESS-GIC-CERTIFICATE THRU PGC-EXIT
327800200615152312            MOVE RETN-ACCRUAL-AMT TO li_AccrualAmt_SE
327900200615152312            MOVE RETN-BALANCE     TO li_Balance_SE
328000200615152312            MOVE 'S'              TO lc_Upd_Flag
328100200615152312            PERFORM UPDATE-WK-Rec Thru UWR-EXIT
328200200615152312         END-IF
328300200615152312         INITIALIZE WS-ACCRUAL-AMT-PER-GRP
328400200615152312                    WS-TOTAL-INT-PAID
328500200615152312                    WS-TOTAL-INT-CALCULATED
328600200615152312                    WS-INT-CALCULATED
328700200615152312                    WS-ADJUSTMENT-AMOUNT
328800200615152312         MOVE li_EndDate  TO PASS-END-DATE-OPTION
328900200615152312         IF CERT-STATUS-CODE OF GIC-CERTIFICATE-DETAILS-3-REC
329000200615152312             = "C" AND CERTIFICATE-STATUS-DATE OF
329100200615152312            GIC-CERTIFICATE-DETAILS-3-REC < PASS-END-DATE-OPTION
329200200615152312             CONTINUE
329300200615152312          ELSE
329400200615152312            PERFORM PROCESS-GIC-CERTIFICATE THRU PGC-EXIT
329500200615152312            MOVE RETN-ACCRUAL-AMT TO li_AccrualAmt_SE
329600200615152312            MOVE RETN-BALANCE     TO li_Balance_SE
329700200615152312            MOVE 'E'              TO lc_Upd_Flag
329800200615152312            PERFORM UPDATE-WK-Rec Thru UWR-EXIT
329900200615152312         END-IF
330000200615152312         INITIALIZE WS-ACCRUAL-AMT-PER-GRP
330100200615152312                    WS-TOTAL-INT-PAID
330200200615152312                    WS-TOTAL-INT-CALCULATED
330300200615152312                    WS-INT-CALCULATED
330400200615152312                    WS-ADJUSTMENT-AMOUNT
330500200615152312         MOVE li_MatDate    TO PASS-END-DATE-OPTION
330600200615152312         IF (CERT-STATUS-CODE OF GIC-CERTIFICATE-DETAILS-3-REC
330700200615152312             = "C" AND CERTIFICATE-STATUS-DATE OF
330800200615152312            GIC-CERTIFICATE-DETAILS-3-REC < PASS-END-DATE-OPTION)
330900200615152312             OR (MATURITY-DATE OF
331000200615152312            GIC-CERTIFICATE-DETAILS-3-REC < li_StrDate)
331100200615152312             CONTINUE
331200200615152312          ELSE
331300200615152312            PERFORM PROCESS-GIC-CERTIFICATE THRU PGC-EXIT
331400200615152312            MOVE RETN-ACCRUAL-AMT TO li_AccrualAmt_SE
331500200615152312            MOVE RETN-BALANCE     TO li_Balance_SE
331600200615152312            MOVE 'M'              TO lc_Upd_Flag
331700200615152312            PERFORM UPDATE-WK-Rec Thru UWR-EXIT
331800200615152312         END-IF
331900200615152312       ELSE
332000200615               PERFORM PROCESS-GIC-CERTIFICATE THRU PGC-EXIT
332100200615152312       END-IF
332200200615           END-IF.
332300200615
332400200615      **** READ NEXT CERTIFICATE
332500200615
332600200615           READ GIC-CERTIFICATE-DETAILS-1  NEXT RECORD
332700200615           AT END
332800200615      *RFS175247 Starts
332900200615      *    GO TO LGCD-EXIT.
333000200615           GO TO LGCD-EXIT
333100200615           NOT AT END
333200200615             IF ACCOUNT-V2-MODE
333300200615      * 1017021 - Begin
333400200615              OR ACCOUNT-V3-MODE
333500200615      * 1017021 - End
333600200615              IF (ACCOUNT-NO OF GIC-CERTIFICATE-DETAILS-1-REC =
333700200615                                       PASS-ACCOUNT-NO) AND
333800200615                 (INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-1-REC
333900200615                      = INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC)
334000200615
334100200615                 MOVE "Y"  TO WS-VALID-CERTIFICATE
334200200615               ELSE
334300200615                 MOVE "N"  TO WS-VALID-CERTIFICATE
334400200615               END-IF
334500200615              END-IF
334600200615           END-READ.
334700200615      *RFS175247 Ends
334800200615
334900200615       LGCD-EXIT.
335000200615           EXIT.
335100200615      /
335200200615       PROCESS-GIC-CERTIFICATE.
335300200615
335400200615      ******************************************************************
335500200615      *                                                                *
335600200615      *    P R O C E S S   G I C   C E R T I F I C A T E               *
335700200615      *                                                                *
335800200615      ******************************************************************
335900200615
336000200615      **** SKIP CERTIFICATE IF NEXT PAYMENT DATE = ZERO AND BATCH-MODE
336100200615
336200200615           IF NEXT-PAYMENT-DATE OF GIC-CERTIFICATE-DETAILS-3-REC = 0
336300200615           AND (BATCH-MODE)
336400200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
336500200615               MOVE "01"            TO RETN-RET-CODE
336600200615               MOVE "Next payment date not on certificate detail"
336700200615               TO RETN-RET-CODE-DESC
336800200615               IF (BATCH-MODE)
336900200615                   MOVE "G17"       TO REJ-REJECTION-CODE
337000200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
337100200615               END-IF
337200200615               GO TO PGC-EXIT
337300200615           END-IF.
337400200615
337500200615      **** GO THROUGH TRANS FILE RECORDS TO CALCULATE ACCRUED INTEREST
337600200615
337700200615      * RFS 138307 - begin
337800200615           PERFORM POPULATE-GICJLATMP-RECS THRU PGR-EXIT.
337900200615      * RFS 138307 - end
338000200615
338100200615R14153     IF STMT-INTEREST-MODE
338200200615137231        OR ACCOUNT-V2-MODE
338300200615      * 1017021 - Begin
338400200615              OR ACCOUNT-V3-MODE
338500200615      * 1017021 - End
338600200615              PERFORM READ-TRANS-FILE-2 THRU RTF2-EXIT
338700200615              GO TO PGC-EXIT
338800200615R14153     END-IF.
338900200615
339000200615           PERFORM READ-TRANS-FILE THRU RTF-EXIT.
339100200615
339200200615       PGC-EXIT.
339300200615           EXIT.
339400200615      /
339500200615      * RFS 138307 - begin
339600200615        POPULATE-GICJLATMP-RECS.
339700200615
339800200615      * RFS 140341 - begin
339900200615            EXEC SQL
340000200615              WHENEVER SQLERROR CONTINUE
340100200615            END-EXEC.
340200200615
340300200615      *     EXEC SQL
340400200615      *      DELETE FROM QTEMP/GICJLATMP
340500200615      *     END-EXEC.
340600200615           EXEC SQL
340700200615             DROP TABLE QTEMP/GICJLATMP
340800200615           END-EXEC.
340900200615
341000200615           EXEC SQL
341100200615             CREATE TABLE QTEMP/GICJLATMP LIKE MFAGICJLA
341200200615           END-EXEC.
341300200615      * RFS 140341 - end
341400200615
341500200615            MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
341600200615              TO WS-GICTRNJOIN-CERTIFICATE.
341700200615      * RFS185941 Starts
341800200615            MOVE ACCOUNT-NO OF GIC-CERTIFICATE-DETAILS-3-REC
341900200615              TO li_AccNo
342000200615            MOVE INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-3-REC
342100200615              TO lc_InvCode
342200200615
342300200615            INITIALIZE li_TotCnvGicCert
342400200615
342500200615            SET lb_CnvGicRecExistsNo TO TRUE
342600200615
342700200615            EXEC SQL
342800200615              SELECT COUNT(*)
342900200615              INTO  :li_TotCnvGicCert
343000200615              FROM   MFAINTSCDP
343100200615            END-EXEC.
343200200615
343300200615           MOVE SQLSTATE TO lc_sqlStates.
343400200615
343500200615           EVALUATE TRUE
343600200615             WHEN lncc_sqlSuccessful OR lncc_sqlEnd
343700200615                CONTINUE
343800200615             WHEN OTHER
343900200615                MOVE lncc_ErrFetchTotCnvGicCert TO lc_sqlErrShortDESCR
344000200615                PERFORM SqlFailProcess
344100200615           END-EVALUATE.
344200200615
344300200615           IF li_TotCnvGicCert > 0
344400200615
344500200615              INITIALIZE ln_CnvCurrBalance, ln_CnvStartDate
344600200615              EXEC SQL
344700200615                SELECT CURRENT_BALANCE, BALANCE_AS_OF_DATE
344800200615                INTO  :ln_CnvCurrBalance, :ln_CnvStartDate
344900200615                FROM   MFAINTSCDP
345000200615                WHERE CERTIFICATE_ID_NO = :WS-GICTRNJOIN-CERTIFICATE
345100200615              END-EXEC
345200200615
345300200615              MOVE SQLSTATE TO lc_sqlStates
345400200615
345500200615              EVALUATE TRUE
345600200615                WHEN lncc_sqlSuccessful
345700200615                  SET lb_CnvGicRecExistsYes TO TRUE
345800200615                WHEN lncc_sqlEnd
345900200615                  SET lb_CnvGicRecExistsNo  TO TRUE
346000200615                WHEN OTHER
346100200615                  MOVE lncc_ErrCertBalStdt TO lc_sqlErrShortDESCR
346200200615                  PERFORM SqlFailProcess
346300200615              END-EVALUATE
346400200615
346500200615           END-IF.
346600200615
346700200615           IF lb_CnvGicRecExistsNo
346800200615      * RFS185941 Ends
346900200615            EXEC SQL
347000200615             INSERT INTO QTEMP/GICJLATMP
347100200615139054*       (SELECT * FROM MFAGICJLA GICJLA
347200200615139054         SELECT * FROM MFAGICJLA GICJLA
347300200615                  WHERE GICJLA.GICERTID = :WS-GICTRNJOIN-CERTIFICATE
347400200615               ORDER BY GICJLA.GICERTID ASC,
347500200615                        GICJLA.TRTRADEDT ASC,
347600200615142609*                 GICJLA.TRTRNSEQ ASC,
347700200615142609*139054                  GICJLA.TRPROCDT ASC
347800200615142609                  GICJLA.TRPROCDT ASC,
347900200615142609                  GICJLA.TRPROCSEQ ASC,
348000200615142609                  GICJLA.TRTRNSEQ ASC
348100200615139054*                 GICJLA.TRPROCDT ASC)
348200200615185941*     END-EXEC.
348300200615185941      END-EXEC
348400200615      * RFS185941 Starts
348500200615           ELSE IF lb_CnvGicRecExistsYes
348600200615                   EXEC SQL
348700200615                    INSERT INTO QTEMP/GICJLATMP VALUES
348800200615                     (
348900200615                       :WS-GICTRNJOIN-CERTIFICATE
349000200615                      ,0
349100200615                      ,0
349200200615                      ,0
349300200615                      ,0
349400200615                      ,:li_AccNo
349500200615                      ,:lc_InvCode
349600200615                      ,"OPN"
349700200615                      ,"HSC"
349800200615                      ,0
349900200615                      ,0
350000200615                      ,0
350100200615                      ,0
350200200615                      )
350300200615                   END-EXEC
350400200615
350500200615                   MOVE SQLSTATE TO lc_sqlStates
350600200615
350700200615                   EVALUATE TRUE
350800200615                      WHEN lncc_sqlSuccessful OR lncc_sqlEnd
350900200615                          CONTINUE
351000200615                      WHEN OTHER
351100200615                          SET lncc_Err03 TO TRUE
351200200615                          MOVE lncc_ErrInsertGICJLATMP TO
351300200615                               lc_sqlErrShortDESCR
351400200615                          PERFORM SqlFailProcess
351500200615                   END-EVALUATE
351600200615
351700200615                   EXEC SQL
351800200615                    INSERT INTO QTEMP/GICJLATMP
351900200615                    (
352000200615                      SELECT *
352100200615                      FROM   MFAGICJLA GICJLA
352200200615                      WHERE  GICJLA.GICERTID  =
352300200615                                     :WS-GICTRNJOIN-CERTIFICATE
352400200615                      AND    GICJLA.TRTRADEDT > :ln_CnvStartDate
352500200615                      ORDER BY GICJLA.GICERTID ASC,
352600200615                               GICJLA.TRTRADEDT ASC,
352700200615                               GICJLA.TRPROCDT ASC,
352800200615                               GICJLA.TRPROCSEQ ASC,
352900200615                               GICJLA.TRTRNSEQ ASC
353000200615                    )
353100200615                   END-EXEC
353200200615                   MOVE SQLSTATE TO lc_sqlStates
353300200615
353400200615                   EVALUATE TRUE
353500200615                      WHEN lncc_sqlSuccessful OR lncc_sqlEnd
353600200615                          CONTINUE
353700200615                      WHEN OTHER
353800200615                          SET lncc_Err04 TO TRUE
353900200615                          MOVE lncc_ErrInsertToGICJLATMP TO
354000200615                               lc_sqlErrShortDESCR
354100200615                          PERFORM SqlFailProcess
354200200615                   END-EVALUATE
354300200615           END-IF.
354400200615      *RFS189541 Ends
354500200615            SET Open-GICJLA TO TRUE.
354600200615            OPEN INPUT GIC-JLA-TMP.
354700200615
354800200615        PGR-EXIT.
354900200615            EXIT.
355000200615      * RFS 138307 - end
355100200615      /
355200200615       READ-TRANS-FILE.
355300200615
355400200615      ******************************************************************
355500200615      *                                                                *
355600200615      *    R E A D   T R A N S   F I L E                               *
355700200615      *                                                                *
355800200615      ******************************************************************
355900200615
356000201203      * RFS1107791 - Start
356100201203           MOVE ZEROS TO li_retnInt
356200201203           MOVE ZEROS TO li_retnIntTot
356300201203           MOVE ZEROS TO li_reinvestIntAmt
356400201203      * RFS1107791 - End
356500200615           MOVE ZEROES
356600200615           TO WS-GIC-BALANCE.
356700200615
356800200615           MOVE ZEROES                   TO WS-GIC-BAL-FOR-THE-DATE     RFS9029
356900200615           SET SW10-CHK-START-BAL-NOT    TO TRUE                        RFS9029
357000200615137833     SET lb_TransferInKindNo       TO TRUE
357100200615137833     MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
357200200615137833     TO   li_CertIDNo.
357300200615
357400200615      * RFS 138307 - begin
357500200615      * Change the READ of SORTED-GTR to GIC-JLA-TMP file.
357600200615000923*
357700200615000923*    MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
357800200615000923*    TO   WS-GICTRNJOIN-CERTIFICATE.
357900200615000923*    MOVE "O"                 TO WS-GICTRNJOIN-MODE.
358000200615000923*    CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
358100200615000923*                            WS-GICTRNJOIN-CERTIFICATE.
358200200615000923*    OPEN INPUT SORTED-GTR.
358300200615000923*
358400200615000925*
358500200615000923*    READ SORTED-GTR NEXT RECORD
358600200615000923*    AT END
358700200615000923*        MOVE "N"     TO WS-VALID-CERTIFICATE
358800200615000923*        MOVE "14"    TO RETN-RET-CODE
358900200615000923*        MOVE "No Transactions for certificate"
359000200615000923*                     TO RETN-RET-CODE-DESC
359100200615000923*        MOVE HIGH-VALUES     TO CURR-CONTROLS
359200200615000923*        IF (BATCH-MODE)
359300200615000923*            MOVE "G18" TO REJ-REJECTION-CODE
359400200615000923*            PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
359500200615000923*        END-IF
359600200615136361*        CLOSE SORTED-GTR
359700200615000923*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
359800200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
359900200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
360000200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
360100200615000924*                                WS-GICTRNJOIN-CERTIFICATE
360200200615000923*    GO TO RTF-EXIT.
360300200615000923*
360400200615000923*    IF GICERTID OF SORTED-GTR-REC
360500200615000923*    NOT EQUAL CERTIFICATE-ID-NO
360600200615000923*    OF GIC-CERTIFICATE-DETAILS-3-REC
360700200615000923*        MOVE "N"     TO WS-VALID-CERTIFICATE
360800200615000923*        MOVE "14"    TO RETN-RET-CODE
360900200615000923*        MOVE "No Transactions for certificate"
361000200615000923*                     TO RETN-RET-CODE-DESC
361100200615000923*        MOVE HIGH-VALUES     TO CURR-CONTROLS
361200200615000923*        IF (BATCH-MODE)
361300200615000923*            MOVE "G18" TO REJ-REJECTION-CODE
361400200615000923*            PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
361500200615000923*        END-IF
361600200615136361*        CLOSE SORTED-GTR
361700200615000923*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
361800200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
361900200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
362000200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
362100200615000924*                                WS-GICTRNJOIN-CERTIFICATE
362200200615000923*        GO TO RTF-EXIT
362300200615000923*    END-IF.
362400200615      * RFS 138307 - end
362500200615000923
362600200615000923**** VALIDATE SORTED-GTR RECORD
362700200615000923**** IF TRANSACTION IS DATED BEFORE THE CERTIFICATE ISSUE
362800200615000923**** DATE, TRANSACTION IS REJECTED
362900200615      * For HSC, converted transactions,do not check First trade        RFS9029
363000200615      * date.                                                           RFS9029
363100200615      * RFS 138307 - begin
363200200615      * Change the READ of SORTED-GTR to GIC-JLA-TMP file.
363300200615           READ GIC-JLA-TMP NEXT RECORD
363400200615           AT END
363500200615               MOVE "N"     TO WS-VALID-CERTIFICATE
363600200615               MOVE "14"    TO RETN-RET-CODE
363700200615               MOVE "No Transactions for certificate"
363800200615                            TO RETN-RET-CODE-DESC
363900200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
364000200615               IF (BATCH-MODE)
364100200615                   MOVE "G18" TO REJ-REJECTION-CODE
364200200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
364300200615               END-IF
364400200615               CLOSE GIC-JLA-TMP
364500200615           GO TO RTF-EXIT.
364600200615
364700200615           IF GICERTID OF GIC-JLA-TMP-REC
364800200615           NOT EQUAL CERTIFICATE-ID-NO
364900200615           OF GIC-CERTIFICATE-DETAILS-3-REC
365000200615               MOVE "N"     TO WS-VALID-CERTIFICATE
365100200615               MOVE "14"    TO RETN-RET-CODE
365200200615               MOVE "No Transactions for certificate"
365300200615                            TO RETN-RET-CODE-DESC
365400200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
365500200615               IF (BATCH-MODE)
365600200615                   MOVE "G18" TO REJ-REJECTION-CODE
365700200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
365800200615               END-IF
365900200615               CLOSE GIC-JLA-TMP
366000200615               GO TO RTF-EXIT
366100200615           END-IF.
366200200615137833* Check if it is transfer in kind on first transaction.
366300200615137833     IF TRTYPE OF GIC-JLA-TMP-REC = "TRI"
366400200615137833        PERFORM GET-CERT-RELATIONSHIP THRU GETCRTREL-EXIT
366500200615137833     END-IF.
366600200615000923
366700200615000923*    IF (TRTRADEDT OF SORTED-GTR-REC NOT EQUAL
366800200615137833**000923     IF (TRTRADEDT OF GIC-JLA-TMP-REC NOT EQUAL
366900200615137833* Bypass check for first trade date if transfer in kind on first trans.
367000200615137833     IF lb_TransferInKindNo AND (
367100200615137833       (TRTRADEDT OF GIC-JLA-TMP-REC NOT EQUAL
367200200615000923         ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC)
367300200615                     AND                                                RFS9029
367400200615      *         TRSTATUS OF SORTED-GTR-REC NOT = LT-HSC                 RFS9029
367500200615                TRSTATUS OF GIC-JLA-TMP-REC NOT = LT-HSC                 RFS9029
367600200615137833       )
367700200615000923         MOVE "N"     TO WS-VALID-CERTIFICATE
367800200615000923         MOVE "15"    TO RETN-RET-CODE
367900200615000923         MOVE "First trade date is not equal issue date"
368000200615000923                      TO RETN-RET-CODE-DESC
368100200615000923         MOVE HIGH-VALUES     TO CURR-CONTROLS
368200200615000923         IF (BATCH-MODE)
368300200615000923             MOVE "G19" TO REJ-REJECTION-CODE
368400200615000923             PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
368500200615000923         END-IF
368600200615136361*        CLOSE SORTED-GTR
368700200615136361         CLOSE GIC-JLA-TMP
368800200615000923*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
368900200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
369000200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
369100200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
369200200615000924*                                WS-GICTRNJOIN-CERTIFICATE
369300200615000924*23365   CANCEL "GICTRNJOIN"
369400200615136361*000925  CLOSE SORTED-GTR
369500200615000923         GO TO RTF-EXIT
369600200615000923     END-IF.
369700200615
369800200615      **** PRIME READ OF CORRESPONDING TRANS RECORD
369900200615
370000200615           INITIALIZE MFATRNP OF TRANS-REC.
370100200615
370200200615000923*    MOVE GIPLCDT OF SORTED-GTR-REC
370300200615000923     MOVE GIPLCDT OF GIC-JLA-TMP-REC
370400200615000923     TO   PLACEMENT-DATE OF TRANS-REC.
370500200615000923
370600200615000923*    MOVE GITRNNO        OF SORTED-GTR-REC
370700200615000923     MOVE GITRNNO        OF GIC-JLA-TMP-REC
370800200615000923     TO   TRANS-NO       OF TRANS-REC.
370900200615
371000200615           READ TRANS
371100200615               INVALID KEY
371200200615      * RFS185941 Starts
371300200615           IF ln_CnvCurrBalance > 0 AND ln_CnvStartDate > 0
371400200615              AND TRTYPE OF GIC-JLA-TMP-REC = "OPN"
371500200615
371600200615              MOVE ln_CnvStartDate TO PLACEMENT-DATE OF TRANS-REC
371700200615              MOVE 0 TO TRANS-NO OF TRANS-REC
371800200615              MOVE ln_CnvStartDate TO PROCESS-DATE OF TRANS-REC
371900200615              MOVE ln_CnvStartDate TO TRADE-DATE OF TRANS-REC
372000200615              MOVE "BUY" TO TRANS-TYPE-CODE OF TRANS-REC
372100200615              MOVE "OPN" TO TRANS-ORIGIN-CODE OF TRANS-REC
372200200615              MOVE TRACTNO OF GIC-JLA-TMP-REC TO
372300200615                                   ACCOUNT-NO OF TRANS-REC
372400200615              MOVE TRINVEST OF GIC-JLA-TMP-REC TO
372500200615                                   INVESTMENT-CODE OF TRANS-REC
372600200615              MOVE ln_CnvCurrBalance TO GROSS-AMT OF TRANS-REC
372700200615              MOVE ln_CnvCurrBalance TO NET-AMT OF TRANS-REC
372800200615              MOVE ln_CnvCurrBalance TO
372900200615                                   CLOSING-UNIT-BAL OF TRANS-REC
373000200615              MOVE "HSC" TO TRANS-STATUS-CODE OF TRANS-REC
373100200615
373200200615           ELSE
373300200615      * RFS185941 Ends
373400200615               MOVE "N"             TO WS-VALID-CERTIFICATE
373500200615               MOVE "16"            TO RETN-RET-CODE
373600200615               MOVE "GIC trans relationship record not in trans file"
373700200615                                    TO RETN-RET-CODE-DESC
373800200615               IF (BATCH-MODE)
373900200615                   MOVE "G20"       TO REJ-REJECTION-CODE
374000200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
374100200615               END-IF
374200200615136361*        CLOSE SORTED-GTR
374300200615136361         CLOSE GIC-JLA-TMP
374400200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
374500200615000923*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
374600200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
374700200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
374800200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
374900200615000924*                                WS-GICTRNJOIN-CERTIFICATE
375000200615000924*        CALL "GICTRNJOIN"                                        FIX01
375100200615000924*23365   CANCEL "GICTRNJOIN"
375200200615136361*000925  CLOSE SORTED-GTR
375300200615000619         GO TO RTF-EXIT
375400200615185941     END-IF
375500200615           END-READ.
375600200615
375700200615           MOVE TRANS-TYPE-CODE OF TRANS-REC
375800200615           TO TRANS-CATAGORY.
375900200615
376000200615      **** VALIDATE TRANS RECORD
376100200615      **** IF FIRST RECORD IS NOT A PURCHASE TRANSACTION OR
376200200615      **** INITIAL AMOUNT DOESN'T EQUAL GROSS-AMT OF FIRST TRANS
376300200615      **** TRANSACTION IS REJECTED
376400200615      *                                                                  RFS9029
376500200615      * Skip testing the initial amount here if the first transaction    RFS9029
376600200615      * is converted                                                     RFS9029
376700200615      * Do the testing after reaching total for the converted            RFS9029
376800200615      * transactions                                                     RFS9029
376900200615      *                                                                  RFS9029
377000200615           IF TRANS-STATUS-CODE OF TRANS-REC = "HSC"     AND             RFS9029
377100200615              GROSS-AMT OF TRANS-REC NOT =                               RFS9029
377200200615                    INITIAL-AMOUNT OF GIC-CERTIFICATE-DETAILS-3-REC      RFS9029
377300200615             SET SW10-CHK-START-BAL              TO TRUE                 RFS9029
377400200615           ELSE                                                          RFS9029
377500200615             IF (PURCHASE-TRANSACTION) AND
377600200615137833       (lb_TransferInKindYes OR
377700200615              (GROSS-AMT OF TRANS-REC =
377800200615               INITIAL-AMOUNT OF GIC-CERTIFICATE-DETAILS-3-REC)
377900200615137833       )
378000200615      *        NEXT SENTENCE
378100200615               CONTINUE
378200200615             ELSE
378300200615               MOVE "N"             TO WS-VALID-CERTIFICATE
378400200615               MOVE "17"    TO RETN-RET-CODE
378500200615               MOVE "First Trans must be BUY and equal initial amount"
378600200615                            TO RETN-RET-CODE-DESC
378700200615               IF (BATCH-MODE)
378800200615                   MOVE "G21" TO REJ-REJECTION-CODE
378900200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
379000200615               END-IF
379100200615136361*        CLOSE SORTED-GTR
379200200615136361         CLOSE GIC-JLA-TMP
379300200615000923*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
379400200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
379500200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
379600200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
379700200615000924*                                WS-GICTRNJOIN-CERTIFICATE
379800200615000924*R23365  CANCEL "GICTRNJOIN"
379900200615136361*000925  CLOSE SORTED-GTR
380000200615               GO TO RTF-EXIT
380100200615             END-IF
380200200615           END-IF.                                                      RFS9029
380300200615
380400200615      * Set switch for the last calculation period                      RFS10258
380500200615           PERFORM UA-SET-SW-TO-CHECK-ADJ
380600200615
380700200615      * RFS11592 - Begin
380800200615           PERFORM UC-SET-SW-FOR-CONERT-RECONC                          RFS10258
380900200615      * RFS11592 - End
381000200615      * ---------------------------------
381100200615137833* Save Issue date of the certificate and override the issue date
381200200615137833* with the first trade date for transfer in kind.
381300200615137833     IF lb_TransferInKindYes
381400200615137833       MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
381500200615137833         TO li_OriginalIssueDate
381600200615137833       MOVE TRTRADEDT  OF GIC-JLA-TMP-REC
381700200615137833         TO ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
381800200615137833     END-IF.
381900200615
382000200615      **** SAVE TRADE-DATE AS WS-PREV-TRADE-DATE
382100200615
382200200615           MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
382300200615           TO WS-PREV-TRADE-DATE-1
382400200615              WS-PREV-TRADE-DATE-3                                      RFS11367
382500200615           MOVE ZEROES TO WS-PREV-GROSS-AMT-1.
382600200615           MOVE SPACES TO WS-PREV-TRANS-TYPE-CODE-1.
382700200615           MOVE SPACES TO WS-PREV-TRANS-STATUS-CODE-1.
382800200615
382900200615      * RFS185941 Starts
383000200615           IF ln_CnvStartDate > 0 and ln_CnvCurrBalance > 0
383100200615              AND TRTYPE OF GIC-JLA-TMP-REC = "OPN"
383200200615              MOVE ln_CnvStartDate TO WS-PREV-TRADE-DATE-1
383300200615                                      WS-PREV-TRADE-DATE-3
383400200615           END-IF.
383500200615      * RFS185941 Ends
383600200615
383700200615000923**** LOOP THROUGH EACH SORTED-GTR RECORD
383800200615000923**** UNTIL NEW CERTIFICATE-ID-NO OR
383900200615000923**** (BATCH-MODE)  AND TRANS DATE > NEXT PAYMENT DATE OR
384000200615000923**** (ONLINE MODE) AND TRANS DATE > TODAY'S DATE OR
384100200615000923**** END OF FILE.
384200200615000923
384300200615000923     MOVE SPACES              TO WS-END-OF-GTR.
384400200615      *    MOVE TRTRADEDT OF SORTED-GTR-REC   TO                        RFS9029
384500200615           MOVE TRTRADEDT OF GIC-JLA-TMP-REC  TO                        RFS9029
384600200615                                       WS-FIRST-TRADE-DATE              RFS9029
384700200615000923
384800200615000923     PERFORM LOOP-SORTED-GTR THRU LGR-EXIT
384900200615000923*      UNTIL (GICERTID OF SORTED-GTR-REC
385000200615000923       UNTIL (GICERTID OF GIC-JLA-TMP-REC
385100200615000923              NOT EQUAL CERTIFICATE-ID-NO
385200200615000923              OF GIC-CERTIFICATE-DETAILS-3-REC)
385300200615000923          OR (BATCH-MODE AND DEF-END-DATE-MODE AND
385400200615000923*             TRTRADEDT OF SORTED-GTR-REC >
385500200615000923              TRTRADEDT OF GIC-JLA-TMP-REC >
385600200615000923              NEXT-PAYMENT-DATE OF GIC-CERTIFICATE-DETAILS-3-REC)
385700200615000923          OR (ONLINE-MODE AND DEF-END-DATE-MODE AND
385800200615000923*             TRTRADEDT OF SORTED-GTR-REC >
385900200615000923              TRTRADEDT OF GIC-JLA-TMP-REC >
386000200615000923              WS-DATE)
386100200615000923          OR (EARLY-REDEMPTION-MODE AND
386200200615000923*             TRTRADEDT OF SORTED-GTR-REC >
386300200615000923              TRTRADEDT OF GIC-JLA-TMP-REC >
386400200615000923              PASS-END-DATE-OPTION)
386500200615000923          OR (UNTIL-MATURITY-MODE AND
386600200615000923*             TRTRADEDT OF SORTED-GTR-REC >
386700200615000923              TRTRADEDT OF GIC-JLA-TMP-REC >
386800200615000923              MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC)
386900200615000923          OR (END-OF-GTR)
387000200615000923          OR (CURR-CONTROLS = HIGH-VALUES).
387100200615
387200200615136361*    CLOSE SORTED-GTR.
387300200615136361     CLOSE GIC-JLA-TMP.
387400200615000923*    MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
387500200615000923*    TO   WS-GICTRNJOIN-CERTIFICATE.
387600200615000924*    MOVE "Z"                 TO WS-GICTRNJOIN-MODE.
387700200615000924*    CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
387800200615000924*                            WS-GICTRNJOIN-CERTIFICATE.
387900200615000924
388000200615000924*    CANCEL "GICTRNJOIN".
388100200615136361*000925    CLOSE SORTED-GTR.
388200200615
388300200615      **** IF PROBLEM-OCCURED, BACK OUT OF CERTIFICATE CALCULATION
388400200615
388500200615           IF (CURR-CONTROLS = HIGH-VALUES)
388600200615               GO TO RTF-EXIT
388700200615           END-IF.
388800200615
388900200615185941     IF lb_CnvGicRecExistsNo
389000200615                                                                         RFS9029
389100200615           IF SW10-CHK-START-BAL            AND                          RFS9029
389200200615              WS-GIC-BAL-FOR-THE-DATE NOT =                              RFS9029
389300200615                      INITIAL-AMOUNT OF GIC-CERTIFICATE-DETAILS-3-REC    RFS9029
389400200615               MOVE "N"             TO WS-VALID-CERTIFICATE              RFS9029
389500200615               MOVE "17"            TO RETN-RET-CODE                     RFS9029
389600200615               MOVE                                                      RFS9029
389700200615             "Total for the converted data should be = initial amount"   RFS9029
389800200615                                    TO RETN-RET-CODE-DESC                RFS9029
389900200615               IF (BATCH-MODE)                                           RFS9029
390000200615                   MOVE "G21"       TO REJ-REJECTION-CODE                RFS9029
390100200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT           RFS9029
390200200615               END-IF                                                    RFS9029
390300200615               GO TO RTF-EXIT                                            RFS9029
390400200615185941     END-IF
390500200615           END-IF.                                                       RFS9029
390600200615
390700200615      **** PROCESS LAST INTEREST PERIOD
390800200615
390900200615           PERFORM PROCESS-LAST-INTEREST-PERIOD THRU PLI-EXIT.
391000200615
391100200615      * ---------------------------------------------------------------
391200200615      * Summarise total calculated interest                             RFS10258
391300200615      *    COMPUTE WS-TOTAL-INT-CALCULATED =                            RFS10258
391400200615      *                 WS-TOTAL-INT-CALCULATED + (RETN-TOTAL-INTEREST) RFS10258
391500200615      * ---------------------------------------------------------------
391600200615
391700200615      * For the last payment do reconciliation                          RFS10258
391800200615           IF SW03-LAST-PERIOD        AND                               RFS10258
391900200615              SW03-ADJ-NOT-EXIST      AND                               RFS10258
392000200615              SW04-CONVERT-NOT-EXIST                                    RFS11592
392100200615      * RFS11367 - Begin
392200200615      *        PERFORM UB-GET-INT-CALCULATED                            RFS10258
392300200615      * RFS11367 - End
392400200615               COMPUTE WS-TOTAL-INT-CALCULATED ROUNDED =                RFS10258
392500200615                       WS-TOTAL-INT-CALCULATED + WS-INT-CALCULATED      RFS10258
392600200615               COMPUTE WS-ACCRUAL-AMT-PER-GRP ROUNDED =                 RFS10258
392700200615                       WS-TOTAL-INT-CALCULATED - WS-TOTAL-INT-PAID      RFS10258
392800200615           END-IF                                                       RFS10258
392900200615      * RFS11324 - Begin
393000200615           IF (STMT-INTEREST-MODE OR
393100200615               ESTATE-INTEREST-MODE) AND
393200200615185374*       INT-PAYMENT-FREQUENCY OF GIC-CERTIFICATE-DETAILS-3-REC =
393300200615185374*                                                LT-CA
393400200615185374       (INT-PAYMENT-FREQUENCY OF GIC-CERTIFICATE-DETAILS-3-REC =
393500200615185374                  LT-CA  OR LT-CD)
393600200615               SET SW11-NEXT-ANNIV-EXISTS  TO TRUE
393700200615               PERFORM VI-GET-NEXT-ANNIV-DATE
393800200615           END-IF
393900200615      * RFS11324 - End
394000200615
394100200615      * RFS 12825 - START
394200200615      * RFS 14156 - START (ADDED MATURITY-SELL-MODE TO NEXT LINE)
394300200615143882*    IF STMT-INTEREST-MODE OR MATURITY-SELL-MODE OR
394400200615143882     IF STMT-INTEREST-MODE OR
394500200615              ESTATE-INTEREST-MODE
394600200615142508        OR ACCOUNT-A1-MODE
394700200615      * RFS 14156 - END
394800200615              PERFORM CALCULATE-GIC-ADJ THRU CGA-EXIT
394900200615           END-IF.
395000200615      * RFS 12825 - END
395100200615
395200200615           COMPUTE WS-ACCRUAL-AMT = WS-ACCRUAL-AMT +                    RFS9240
395300200615      *RFS 12825 - START
395400200615      *                                WS-ACCRUAL-AMT-PER-GRP           RFS9240
395500200615                   WS-ACCRUAL-AMT-PER-GRP + (WS-ADJUSTMENT-AMOUNT)      RFS9240
395600200615      *RFS 13300 - Start
395700200615      *    IF WS-ACCRUAL-AMT < 0
395800200615      *       MULTIPLY WS-ACCRUAL-AMT BY -1
395900200615      *       GIVING WS-ACCRUAL-AMT
396000200615      *    END-IF.
396100200615      *RFS 13300 - end
396200200615      *RFS 12825 - END
396300201203      *RFS1107791 - Start
396400201203      *  Reduce accrual interest added to WS-GIC-BALANCE.
396500201203      *  GIC Balance should not include calculated accrual
396600201203      *  interest when return back from program.
396700201203           IF li_retnIntTot > 0 and WS-GIC-BALANCE > 0
396800201203             COMPUTE WS-GIC-BALANCE = WS-GIC-BALANCE - li_retnIntTot
396900201203                     + li_reinvestIntAmt
397000201203           END-IF
397100201203      *RFS1107791 - End
397200200615      *RFS141725 - Start
397300200615           COMPUTE WS-GIC-TOT-BAL = WS-GIC-TOT-BAL + WS-GIC-BALANCE
397400200615      *RFS141725 - End
397500200615
397600200615      **** WRITE OUTPUT FILE IF CERTIFICATE LEVEL
397700200615
397800200615           IF (CERTIFICATE-MODE) OR (GIC-BATCH-MODE)
397900200615148358     OR (GICDII-BATCH-MODE AND
398000200615148358         PASS-CERTIFICATE-ID-NO NOT = ZEROES)
398100200615               IF (TRNPST-MODE) OR (INTEREST-MODE)
398200200615                   IF (TRNPST-MODE)
398300200615                      IF REDEMPTION-BEF-MATURITY
398400200615                      OF GIC-CERTIFICATE-DETAILS-3-REC = "N"
398500200615      * ---------------------------------
398600200615      * Get-gic-term-table and                                          RFS8371
398700200615      * Penalty-rate-schedule will be calculated in CALC-PENALTY-...    RFS8371
398800200615      * paragraph                                                       RFS8371
398900200615      *                                                                 RFS8371
399000200615      *                   PERFORM GET-GIC-TERM-TABLE THRU GTT-EXIT      RFS8371
399100200615      *                   IF CURR-CONTROLS = HIGH-VALUES                RFS8371
399200200615      *                       GO TO RTF-EXIT                            RFS8371
399300200615      *                   END-IF                                        RFS8371
399400200615      *                   PERFORM GET-GIC-PENALTY-RATE-SCHEDULE         RFS8371
399500200615      *                   THRU GPRS-EXIT                                RFS8371
399600200615      *                   IF CURR-CONTROLS = HIGH-VALUES                RFS8371
399700200615      *                       GO TO RTF-EXIT                            RFS8371
399800200615      *                   END-IF                                        RFS8371
399900200615      * ---------------------------------
400000200615                          PERFORM CALC-PENALTY-AND-REDEMPTION
400100200615                          THRU CPR-EXIT
400200200615                      END-IF
400300200615
400400200615      *               PERFORM CALC-PENALTY-AND-REDEMPTION THRU CPR-EXIT
400500200615                      IF CURR-CONTROLS = HIGH-VALUES
400600200615                          GO TO RTF-EXIT
400700200615                      END-IF
400800200615                   END-IF
400900200615                   IF (INTEREST-MODE)
401000200615                      IF PASS-GROSS-AMT < CURRENT-CERTIFICATE-BALANCE
401100200615                          OF GIC-CERTIFICATE-DETAILS-3-REC    AND
401200200615                         NOT STMT-INTEREST-MODE               AND       RFS11324
401300200615                         NOT ESTATE-INTEREST-MODE
401400200615140269* Bypass the interest transaction in 'IE' mode that is called
401500200615140269* from TRNPST to re-calculate the interest amount after the INT
401600200615140269* transaction is created.
401700200615140269             AND  NOT (PASS-MODE = "IE"      AND
401800200615140269                       lc_ReCalc = "Y"       AND
401900200615140269                        li_placementDate > 0 AND
402000200615140269                        li_transNo   > 0)
402100200615                          MOVE ZEROES         TO RETN-ACCRUAL-AMT
402200200615                      ELSE
402300200615      *                   MOVE WS-ACCRUAL-AMT TO RETN-ACCRUAL-AMT       FIX06
402400200615140269* Add back any interest adjustment for the bypass tx.
402500200615140269                    IF (PASS-MODE = "IE"     AND
402600200615140269                        lc_ReCalc = "Y"      AND
402700200615140269                        li_placementDate > 0 AND
402800200615140269                        li_transNo   > 0)
402900200615140269                        PERFORM GET-INT-ADJ THRU GIA-EXIT
403000200615140269                        COMPUTE WS-ACCRUAL-AMT ROUNDED =
403100200615140269                                WS-ACCRUAL-AMT + li_IntAdj
403200200615140269                    END-IF
403300200615                          COMPUTE RETN-ACCRUAL-AMT ROUNDED =            FIX06
403400200615                                                   WS-ACCRUAL-AMT       FIX06
403500200615                      END-IF
403600200615      * RFS10737 - Begin
403700200615                      MOVE WS-GIC-BALANCE     TO RETN-BALANCE
403800200615      * RFS10737 - End
403900200615                   END-IF
404000200615               ELSE
404100200615                   PERFORM WRITE-CERTIFICATE-LEVEL THRU WCL-EXIT
404200200615               END-IF
404300200615               MOVE ZEROES          TO WS-ACCRUAL-AMT
404400200615           END-IF.
404500200615      *
404600200615
404700200615       RTF-EXIT.
404800200615           EXIT.
404900200615      /
405000200615000923 LOOP-SORTED-GTR.
405100200615000923
405200200615000923******************************************************************
405300200615000923*                                                                *
405400200615000923*    L O O P   S O R T E D   G T R                               *
405500200615000923*                                                                *
405600200615000923******************************************************************
405700200615000923
405800200615      * RFS 138307 - begin
405900200615      * Change the READ of SORTED-GTR to GIC-JLA-TMP file.
406000200615000923**** PROCESS SORTED-GTR AND GET CORRESPONDING TRANS REC
406100200615000923
406200200615000923*    IF GICERTID OF SORTED-GTR-REC =
406300200615000923     IF GICERTID OF GIC-JLA-TMP-REC =
406400200615000923        CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
406500200615000923
406600200615000923*        IF CERT-ACTIVE-FLAG OF GIC-TRANS-RELATIONSHIP-REC
406700200615000923*           NOT EQUAL "N"
406800200615000923
406900200615000923****     IN EACH LOOP, WE CONSIDER ONLY INTEREST-TRANSACTIONS,
407000200615000923****     PURCHASE-TRANSACTIONS AND REDEMPTION TRANSACTIONS
407100200615000923****     - ALSO, STATUS MUST BE HST, CHG, OR HSC
407200200615000923****     - LASTLY TRANSACTION MUST FALL BETWEEN ISSUE AND
407300200615000923****       MATURITY DATES
407400200615000923
407500200615000923             IF  (INTEREST-TRANSACTION OR
407600200615000923                  PURCHASE-TRANSACTION OR
407700200615000923                  REDEMPTION-TRANSACTION)
407800200615000923             AND (TRANS-STATUS-CODE OF TRANS-REC = "HST" OR
407900200615000923                  TRANS-STATUS-CODE OF TRANS-REC = "CHQ" OR
408000200615000923                  TRANS-STATUS-CODE OF TRANS-REC = "HSC")
408100200615000923             AND (REVERSE           OF TRANS-REC NOT EQUAL "Y")
408200200615000923             AND (WS-PREV-TRADE-DATE-1 >=
408300200615000923                  ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC AND
408400200615001023*                 TRTRADEDT  OF SORTED-GTR-REC <=
408500200615001023                  TRTRADEDT  OF GIC-JLA-TMP-REC <=
408600200615000923                  MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC)
408700200615000923
408800200615000923             AND ((BATCH-MODE AND DEF-END-DATE-MODE AND
408900200615000923*                  TRTRADEDT OF SORTED-GTR-REC <=
409000200615000923                   TRTRADEDT OF GIC-JLA-TMP-REC <=
409100200615000923                   NEXT-PAYMENT-DATE
409200200615000923                   OF GIC-CERTIFICATE-DETAILS-3-REC) OR
409300200615000923                  (ONLINE-MODE AND DEF-END-DATE-MODE AND
409400200615000923*                  TRTRADEDT OF SORTED-GTR-REC <=
409500200615000923                   TRTRADEDT OF GIC-JLA-TMP-REC <=
409600200615000923                   WS-DATE) OR
409700200615000923                  (EARLY-REDEMPTION-MODE AND
409800200615000923*                  TRTRADEDT OF SORTED-GTR-REC <=
409900200615000923                   TRTRADEDT OF GIC-JLA-TMP-REC <=
410000200615000923                   PASS-END-DATE-OPTION) OR
410100200615000923                  (UNTIL-MATURITY-MODE AND
410200200615000923*                  TRTRADEDT OF SORTED-GTR-REC <=
410300200615000923                   TRTRADEDT OF GIC-JLA-TMP-REC <=
410400200615000923                   MATURITY-DATE
410500200615000923                   OF GIC-CERTIFICATE-DETAILS-3-REC))
410600200615      * RFS 14016 BEGIN
410700200615000822*            AND  NOT (ESTATE-EARLY-REDEMPTION-MODE AND
410800200615000822*                  PROCESS-DATE OF TRANS-REC >
410900200615000822*                  PASS-END-DATE-OPTION)
411000200615000822             AND  NOT (ESTATE-EARLY-REDEMPTION-MODE AND
411100200615000822                   TRADE-DATE OF TRANS-REC >=
411200200615000822                   PASS-END-DATE-OPTION)
411300200615      * RFS 14016 END
411400200615
411500200615                   AND  NOT (STMT-INTEREST-MODE AND                     RFS11106
411600200615                             PROCESS-DATE OF TRANS-REC >=               RFS11106
411700200615                                                PASS-END-DATE-OPTION)   RFS11106
411800200615      * RFS 15421 - Begin
411900200615                   AND  NOT (ESTATE-INTEREST-MODE  AND
412000200615                             TRADE-DATE OF TRANS-REC >=
412100200615                                                PASS-END-DATE-OPTION)
412200200615      * RFS 15421 - End
412300200615      * RFS 137231- Begin
412400200615      * 1004070 - Begin: Comment out following from 137231
412500200615137231*            AND  NOT (ACCOUNT-V2-MODE       AND
412600200615137231*                      TRADE-DATE OF TRANS-REC >=
412700200615137231*                                         PASS-END-DATE-OPTION)
412800200615      * 1017021 - Begin: not including transaction for End Date.
412900200615                   AND  NOT (ACCOUNT-V3-MODE       AND
413000200615                        TRADE-DATE OF TRANS-REC >=
413100200615                        PASS-END-DATE-OPTION)
413200200615      * 1017021 - End
413300200615      * 1004070 - End
413400200615      * RFS 137231- End
413500200615140269* Bypass the interest transaction in 'IE' mode that is called
413600200615140269* from TRNPST to re-calculate the interest amount after the INT
413700200615140269* transaction is created.
413800200615140269             AND  NOT (PASS-MODE = "IE"      AND
413900200615140269                       lc_ReCalc = "Y"       AND
414000200615140269                       INTEREST-TRANSACTION  AND
414100200615140269                       PLACEMENT-DATE OF TRANS-REC =
414200200615140269                        li_placementDate     AND
414300200615140269                       TRANS-NO OF TRANS-REC =
414400200615140269                        li_transNo           AND
414500200615140269                       TRADE-DATE OF TRANS-REC =
414600200615140269                                     PASS-END-DATE-OPTION)
414700200615      * RFS11592 - Begin
414800200615                       IF CONVERTED-TRANSACTION
414900200615                           SET SW04-CONVERT-EXIST        TO TRUE        RFS10258
415000200615                       END-IF
415100200615      * RFS11592 - End
415200200615
415300200615      *
415400200615      * Check the transaction for Adjustment, to know if                RFS10258
415500200615      * certificate eligible for reconciliation                         RFS10258
415600200615      *
415700200615                       IF SW03-ADJ-NOT-EXIST AND                        RFS10258
415800200615                          SW03-LAST-PERIOD                              RFS10258
415900200615                           PERFORM VB-CHECK-FOR-ADJ                     RFS10258
416000200615                       END-IF                                           RFS10258
416100200615      * RFS11367 - Begin
416200200615                       PERFORM VK-GET-INT-CALCULATED-MAIN
416300200615      * RFS11367 - End
416400200615
416500200615      ****             ISSUE DATE
416600200615
416700200615                       MOVE WS-PREV-TRADE-DATE-1
416800200615                       TO PASS-ISSUE-DATE
416900200615
417000200615      ****             MATURITY DATE
417100200615
417200200615000923*                MOVE TRTRADEDT OF SORTED-GTR-REC
417300200615000923                 MOVE TRTRADEDT OF GIC-JLA-TMP-REC
417400200615000923                 TO PASS-MATURITY-DATE
417500200615
417600200615      ****             INTEREST RATE
417700200615
417800200615                       MOVE INT-RATE OF GIC-CERTIFICATE-DETAILS-3-REC
417900200615                       TO PASS-INTEREST-RATE
418000200615
418100200615      ****             PAYMENT OPTION
418200200615
418300200615                       MOVE INT-PAYMENT-OPTION
418400200615                       OF GIC-CERTIFICATE-DETAILS-3-REC
418500200615                       TO PASS-INTEREST-PAYMENT-OPTION
418600200615
418700200615      ****             PAYMENT FREQUENCY
418800200615
418900200615                       MOVE INT-PAYMENT-FREQUENCY
419000200615                       OF GIC-CERTIFICATE-DETAILS-3-REC
419100200615                       TO PASS-INTEREST-FREQUENCY
419200200615
419300200615      ****             CAPITAL AMOUNT
419400200615
419500200615               MOVE WS-GIC-BALANCE TO PASS-CAPITAL-AMOUNT
419600200615                                                                        RFS10563
419700200615                       SET  PASS-ORIG-CALC-YES                TO TRUE   RFS10563
419800200615                       MOVE ISSUE-DATE OF                               RFS10563
419900200615                            GIC-CERTIFICATE-DETAILS-3-REC     TO        RFS10563
420000200615                                            PASS-ORIG-ISSUE-DATE        RFS10563
420100200615      * RFS143882 Starts
420200200615                       IF lb_TransferInKindYes AND
420300200615                          li_OriginalIssueDate > 0
420400200615                            MOVE li_OriginalIssueDate TO
420500200615                              PASS-ORIG-ISSUE-DATE
420600200615                       END-IF
420700200615      * RFS143882 Ends
420800200615                       MOVE MATURITY-DATE OF                            RFS10563
420900200615                            GIC-CERTIFICATE-DETAILS-3-REC     TO        RFS10563
421000200615                                            PASS-ORIG-MATURITY-DATE     RFS10563
421100200615
421200200615                       MOVE TRANS-STATUS-CODE OF TRANS-REC TO
421300200615                          WS-PREV-TRANS-STATUS-CODE-1
421400200615
421500200615      ****             CALL GICCALC AND ACCUMULATE INTEREST
421600200615
421700200615                       PERFORM CALL-GICCALC THRU GIC-EXIT
421800200615
421900200615      *                COMPUTE WS-ACCRUAL-AMT                           RFS9240
422000200615      *                = WS-ACCRUAL-AMT + (RETN-TOTAL-INTEREST)         RFS9240
422100200615
422200200615                       COMPUTE WS-ACCRUAL-AMT-PER-GRP  =                RFS9240
422300200615                        WS-ACCRUAL-AMT-PER-GRP  + (RETN-TOTAL-INTEREST) RFS9240
422400200615      * ---------------------------------------------------------------
422500200615      * Summarise total calculated interest                             RFS10258
422600200615      *                COMPUTE WS-TOTAL-INT-CALCULATED =                RFS10258
422700200615      *                 WS-TOTAL-INT-CALCULATED + (RETN-TOTAL-INTEREST) RFS10258
422800200615      * ---------------------------------------------------------------
422900200615
423000200615      ****             TRANS TYPE CODE
423100200615
423200200615                       IF (INTEREST-TRANSACTION)                        RFS9240
423300200615      *RFS 12353 -start
423400200615                          IF WS-PREV-TRANS-STATUS-CODE-1                RFS9240
423500200615                                  NOT EQUAL "CHQ"
423600200615                           MOVE ZEROES TO WS-ACCRUAL-AMT-PER-GRP        RFS9240
423700200615      *RFS 13492-Start
423800200615                          ELSE
423900200615                             IF NOT (STMT-INTEREST-MODE OR
424000200615137231                               ACCOUNT-V2-MODE OR
424100200615      * 1017021 - Begin
424200200615                                     ACCOUNT-V3-MODE OR
424300200615      * 1017021 - End
424400200615                                     ESTATE-INTEREST-MODE)
424500200615                             MOVE ZEROES TO WS-ACCRUAL-AMT-PER-GRP
424600200615                             END-IF
424700200615                          END-IF
424800200615      *RFS 13492 -end
424900200615      *RFS 12353 -end
425000200615                       END-IF                                           RFS9240
425100200615
425200200615      * Calculate total interest paid                                   RFS10258
425300200615                       IF (INTEREST-TRANSACTION)                        RFS10258
425400200615      *RFS 13492 -START
425500200615      *RFS 12353 -start
425600200615      *                   IF WS-PREV-TRANS-STATUS-CODE-1                RFS9240
425700200615      *                           NOT EQUAL "CHQ"
425800200615      *RFS 12353 -end
425900200615      * RFS13747 - Begin
426000200615                          IF WS-PREV-TRANS-STATUS-CODE-1 = "CHQ"  AND
426100200615                             (STMT-INTEREST-MODE                   OR
426200200615137231                        ACCOUNT-V2-MODE                      OR
426300200615      * 1017021 - Begin
426400200615                              ACCOUNT-V3-MODE                      OR
426500200615      * 1017021 - End
426600200615                             ESTATE-INTEREST-MODE)
426700200615                           CONTINUE
426800200615                          ELSE
426900200615      * RFS13747 - End
427000200615                           COMPUTE WS-TOTAL-INT-PAID =                  RFS10258
427100200615                             WS-TOTAL-INT-PAID + GROSS-AMT OF TRANS-REC RFS10258
427200200615      * RFS13747 - Begin
427300200615                          END-IF
427400200615      * RFS13747 - End
427500200615      *                   END-IF
427600200615                       END-IF                                           RFS10258
427700200615      *RFS 13492 -end
427800200615
427900200615      *                IF (INTEREST-TRANSACTION)                        RFS9240
428000200615      *                    MOVE ZEROES TO WS-ACCRUAL-AMT                RFS9240
428100200615      *                END-IF                                           RFS9240
428200200615
428300200615      ****             CALCULATE NEXT BALANCE
428400200615
428500200615                       IF PURCHASE-TRANSACTION
428600200615                           COMPUTE WS-GIC-BALANCE =
428700200615                           WS-GIC-BALANCE +
428800200615                           GROSS-AMT OF TRANS-REC
428900200615      *                    IF TRTRADEDT OF SORTED-GTR-REC =             RFS9029
429000200615                           IF TRTRADEDT OF GIC-JLA-TMP-REC =            RFS9029
429100200615                                       WS-FIRST-TRADE-DATE              RFS9029
429200200615                               COMPUTE WS-GIC-BAL-FOR-THE-DATE =        RFS9029
429300200615                                  WS-GIC-BAL-FOR-THE-DATE +             RFS9029
429400200615                                             GROSS-AMT OF TRANS-REC     RFS9029
429500200615                           END-IF                                       RFS9029
429600200615                       END-IF
429700200615
429800200615                       IF REDEMPTION-TRANSACTION
429900200615      * RFS13747 - Begin
430000200615                        IF   TRANS-SEL                AND
430100200615                             (STMT-INTEREST-MODE        OR
430200200615137231                        ACCOUNT-V2-MODE           OR
430300200615      * 1017021 - Begin
430400200615                              ACCOUNT-V3-MODE           OR
430500200615      * 1017021 - Begin
430600200615                              ESTATE-INTEREST-MODE)    AND
430700200615                             WS-PREV-TRANS-STATUS-CODE-1 = "CHQ"
430800200615                           CONTINUE
430900200615                        ELSE
431000200615      * RFS13747 - End
431100200615                           COMPUTE WS-GIC-BALANCE =
431200200615                           WS-GIC-BALANCE -
431300200615                           GROSS-AMT OF TRANS-REC
431400200615      * RFS13747 - Begin
431500200615                        END-IF
431600200615      * RFS13747 - End
431700200615      *                    IF TRTRADEDT OF SORTED-GTR-REC =             RFS9029
431800200615                           IF TRTRADEDT OF GIC-JLA-TMP-REC =            RFS9029
431900200615                                       WS-FIRST-TRADE-DATE              RFS9029
432000200615                              COMPUTE WS-GIC-BAL-FOR-THE-DATE =         RFS9029
432100200615                                  WS-GIC-BAL-FOR-THE-DATE -             RFS9029
432200200615                                             GROSS-AMT OF TRANS-REC     RFS9029
432300200615                           END-IF                                       RFS9029
432400200615      *                    IF WS-GIC-BALANCE < 0
432500200615      *                        MOVE ZEROES TO WS-GIC-BALANCE
432600200615      *                    END-IF
432700200615                       END-IF
432800200615
432900200615      ****             IF INTEREST TRANSACTION GET FILE
433000200615      ****             PAYMENT-TYPE-RULE. IF RULE = REINVEST, THEN
433100200615      ****             ADD INTEREST TO CURRENT-BALANCE
433200200615
433300200615000925                 IF (INTEREST-TRANSACTION)
433400200615000925
433500200615000925                     INITIALIZE MFATRNIDP OF TID-REC
433600200615000925
433700200615000925                     MOVE PLACEMENT-DATE OF TRANS-REC
433800200615000925                     TO   PLACEMENT-DATE OF TID-REC
433900200615000925
434000200615000925                     MOVE TRANS-NO       OF TRANS-REC
434100200615000925                     TO   TRANS-NO       OF TID-REC
434200200615000925
434300200615000925                     READ TRANS-INTEREST-DETAILS
434400200615000925                      INVALID KEY
434500200615000925                          MOVE " " TO DISTR-OPTION-CODE
434600200615000925                          OF TID-REC
434700200615000925                     END-READ
434800200615000925
434900200615000925                     IF DISTR-OPTION-CODE OF TID-REC = "R"
435000201203      *RFS1107791 Start
435100201203                             IF PASS-INTEREST-FREQUENCY = "CD"
435200201203                               COMPUTE li_reinvestIntAmt =
435300201203                                li_reinvestIntAmt +
435400201203                                GROSS-AMT OF TRANS-REC
435500201203                             END-IF
435600201203      *RFS1107791 End
435700200615      *RFS1100588 Starts
435800200615                             IF PASS-INTEREST-FREQUENCY  NOT = "CD"
435900200615      *RFS1100588 Ends
436000200615
436100200615000925                         COMPUTE WS-GIC-BALANCE =
436200200615000925                         WS-GIC-BALANCE +
436300200615000925                         GROSS-AMT OF TRANS-REC
436400200615      *RFS1100588 Starts
436500200615                             END-IF
436600200615      *RFS1100588 Ends
436700200615      *                        IF TRTRADEDT OF SORTED-GTR-REC =         RFS9029
436800200615                               IF TRTRADEDT OF GIC-JLA-TMP-REC =        RFS9029
436900200615                                       WS-FIRST-TRADE-DATE              RFS9029
437000200615                                   COMPUTE WS-GIC-BAL-FOR-THE-DATE =    RFS9029
437100200615                                      WS-GIC-BAL-FOR-THE-DATE +         RFS9029
437200200615                                             GROSS-AMT OF TRANS-REC     RFS9029
437300200615                               END-IF                                   RFS9029
437400200615000925                     END-IF
437500200615000925
437600200615000925                 END-IF
437700200615
437800200615      ****             KEEP TRADE-DATE AS WS-PREV-TRADE-DATE
437900200615
438000200615000923*                MOVE TRTRADEDT OF SORTED-GTR-REC
438100200615000923                 MOVE TRTRADEDT OF GIC-JLA-TMP-REC
438200200615000923                 TO WS-PREV-TRADE-DATE-1
438300200615
438400200615      * RFS185941 Starts
438500200615                       IF ln_CnvStartDate > 0 and ln_CnvCurrBalance > 0
438600200615                          AND TRTYPE OF GIC-JLA-TMP-REC = "OPN"
438700200615                          MOVE ln_CnvStartDate TO WS-PREV-TRADE-DATE-1
438800200615                       END-IF
438900200615      * RFS185941 Ends
439000200615                       MOVE GROSS-AMT OF TRANS-REC
439100200615                       TO WS-PREV-GROSS-AMT-1
439200200615
439300200615                       MOVE TRANS-TYPE-CODE OF TRANS-REC
439400200615                       TO WS-PREV-TRANS-TYPE-CODE-1
439500200615      *RFS185374 - Start.
439600200615      *RFS1100588 Starts
439700200615      *               IF PASS-INTEREST-FREQUENCY   = 'CD'
439800200615      *               and NOT INTEREST-TRANSACTION
439900200615      *               COMPUTE WS-GIC-BALANCE = WS-GIC-BALANCE
440000200615      *                + RETN-TOTAL-INTEREST
440100200615                      IF PASS-INTEREST-FREQUENCY   = "CD"
440200200615                         COMPUTE li_retnInt ROUNDED =
440300200615                         RETN-TOTAL-INTEREST
440400200615                         COMPUTE WS-GIC-BALANCE = WS-GIC-BALANCE
440500200615                         + li_retnInt
440600200615      *RFS1100588 Ends
440700201203      *RFS1107791 Start
440800201203                         COMPUTE li_retnIntTot = li_retnIntTot +
440900201203                                 li_retnInt
441000201203      *RFS1107791 End
441100200615                      END-IF
441200200615      *RFS185374 - End.
441300200615                   END-IF
441400200615000923*        END-IF
441500200615           END-IF.
441600200615
441700200615       LGR-READ.
441800200615
441900200615000923**** READ NEXT SORTED-GTR
442000200615000923
442100200615000923*    READ SORTED-GTR NEXT RECORD
442200200615000923     READ GIC-JLA-TMP NEXT RECORD
442300200615000923     AT END
442400200615000923     MOVE "10"                TO WS-END-OF-GTR
442500200615000923     GO TO LGR-EXIT.
442600200615000923
442700200615000923**** VALIDATE SORTED-GTR RECORD
442800200615000923**** IF TRANSACTION IS DATED AFTER THE CERTIFICATE MATURITY
442900200615000923**** DATE, TRANSACTION IS REJECTED
443000200615000923
443100200615000923*    IF (TRTRADEDT OF SORTED-GTR >
443200200615000923     IF (TRTRADEDT OF GIC-JLA-TMP-REC >
443300200615000923         MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC)
443400200615001031     AND CERT-STATUS-CODE OF GIC-CERTIFICATE-DETAILS-3-REC = "A"
443500200615000923         MOVE "18"    TO RETN-RET-CODE
443600200615000923         MOVE "Trade date of transaction > Maturity date"
443700200615000923                      TO RETN-RET-CODE-DESC
443800200615000923         IF (BATCH-MODE)
443900200615000923             MOVE "G22" TO REJ-REJECTION-CODE
444000200615000923             PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
444100200615000923         END-IF
444200200615000923         MOVE HIGH-VALUES TO CURR-CONTROLS
444300200615000923         GO TO LGR-EXIT
444400200615000923     END-IF.
444500200615000923
444600200615000923
444700200615000923**** IF SORTED-GTR READ IS NEW CERTIFICATE,
444800200615000923**** IT IS NOT NECESSARY TO READ THE CORRESPONDING TRANS REC
444900200615000923
445000200615000923*    IF GICERTID OF SORTED-GTR-REC NOT EQUAL
445100200615000923     IF GICERTID OF GIC-JLA-TMP-REC NOT EQUAL
445200200615000923        CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
445300200615000923         GO TO LGR-EXIT
445400200615000923     END-IF.
445500200615
445600200615      **** READ CORRESPONDING TRANS RECORD
445700200615
445800200615           INITIALIZE MFATRNP OF TRANS-REC.
445900200615
446000200615000923*    MOVE GIPLCDT OF SORTED-GTR-REC
446100200615000923     MOVE GIPLCDT OF GIC-JLA-TMP-REC
446200200615000923     TO   PLACEMENT-DATE OF TRANS-REC.
446300200615000923
446400200615000923*    MOVE GITRNNO OF SORTED-GTR-REC
446500200615000923     MOVE GITRNNO OF GIC-JLA-TMP-REC
446600200615000923     TO   TRANS-NO       OF TRANS-REC.
446700200615
446800200615           READ TRANS
446900200615               INVALID KEY
447000200615               MOVE "19"            TO RETN-RET-CODE
447100200615               MOVE "GIC trans relationship rec not in trans file"
447200200615                                    TO RETN-RET-CODE-DESC
447300200615               IF (BATCH-MODE)
447400200615                   MOVE "G20"       TO REJ-REJECTION-CODE
447500200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
447600200615               END-IF
447700200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
447800200615               GO TO LGR-READ
447900200615           END-READ.
448000200615
448100200615           MOVE TRANS-TYPE-CODE OF TRANS-REC
448200200615           TO TRANS-CATAGORY.
448300200615
448400200615       LGR-EXIT.
448500200615           EXIT.
448600200615      /
448700200615      *RFS 12825 - START
448800200615       CALCULATE-GIC-ADJ.
448900200615
449000200615      ******************************************************************
449100200615      *                                                                *
449200200615      *    CALCULATE GIC ADJ                                           *
449300200615      *                                                                *
449400200615      ******************************************************************
449500200615
449600200615      **** CALCULATE GIC INTEREST ADJUSTMENT IF ANY
449700200615
449800200615           INITIALIZE GIC-INT-ADJUST-REASON-REC.
449900200615           MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
450000200615              TO CERTIFICATE-ID-NO OF GIC-INT-ADJUST-REASON-DTL-IDXL.
450100200615      *    MOVE LOW-VALUES
450200200615      *       TO EFFECTIV-DATE OF GIC-INT-ADJUST-REASON-DTL-IDXL.
450300200615 A         MOVE ZEROS
450400200615 A            TO EFFECTIV-DATE OF GIC-INT-ADJUST-REASON-DTL-IDXL.
450500200615           MOVE LOW-VALUES TO INT-ADJUSTMENT-REASON-CODE
450600200615              OF GIC-INT-ADJUST-REASON-DTL-IDXL.
450700200615
450800200615           START GIC-INT-ADJUST-REASON-DTL-IDXL
450900200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
451000200615              INVALID KEY
451100200615                GO TO CGA-EXIT.
451200200615
451300200615       CGA-0010.
451400200615           READ GIC-INT-ADJUST-REASON-DTL-IDXL NEXT RECORD
451500200615              AT END
451600200615                GO TO CGA-EXIT.
451700200615
451800200615           IF CERTIFICATE-ID-NO OF GIC-INT-ADJUST-REASON-REC
451900200615             NOT EQUAL TO CERTIFICATE-ID-NO
452000200615             OF GIC-CERTIFICATE-DETAILS-3-REC
452100200615             GO TO CGA-EXIT
452200200615           END-IF.
452300200615
452400200615      * RFS142508 - Starts
452500200615      *     IF EFFECTIV-DATE OF GIC-INT-ADJUST-REASON-REC >
452600200615      *           PASS-END-DATE-OPTION
452700200615            IF ((EFFECTIV-DATE OF GIC-INT-ADJUST-REASON-REC >
452800200615                 PASS-END-DATE-OPTION AND NOT ACCOUNT-A1-MODE)
452900200615                OR (EFFECTIV-DATE OF GIC-INT-ADJUST-REASON-REC >
453000200615                       WS-NEW-YEARS-DAY AND  ACCOUNT-A1-MODE))
453100200615      * RFS142508 - Ends
453200200615               GO TO CGA-0010
453300200615            END-IF.
453400200615            IF PLACEMENT-DATE OF GIC-INT-ADJUST-REASON-REC
453500200615               NOT EQUAL TO ZEROES
453600200615               AND TRANS-NO OF GIC-INT-ADJUST-REASON-REC
453700200615               NOT EQUAL TO ZEROES
453800200615      *RFS1005534- Starts
453900200615      *        GO TO CGA-0010
454000200615               INITIALIZE li_PlacementDate_IntAdj
454100200615                          li_TransNo_IntAdj
454200200615
454300200615               MOVE PLACEMENT-DATE OF GIC-INT-ADJUST-REASON-REC
454400200615                 TO li_PlacementDate_IntAdj
454500200615
454600200615               MOVE TRANS-NO OF GIC-INT-ADJUST-REASON-REC
454700200615                 TO li_TransNo_IntAdj
454800200615
454900200615               PERFORM GET-INT-ADJ-TRADE-DATE THRU GIATD-EXIT
455000200615
455100200615               IF li_TradeDate_IntAdj <= PASS-END-DATE-OPTION
455200200615               OR li_TradeDate_IntAdj  = ZERO
455300210708      *RFS1115367-Starts
455400210708      * Include interest adjustment on statement if it is happened on
455500210708      * theinterest calculation date.
455600210708                IF STMT-INTEREST-MODE AND
455700210708                   lc_SE_Batch_Mode = "Y" AND
455800210708                   li_TradeDate_IntAdj = PASS-END-DATE-OPTION AND
455900210708                   li_TradeDate_IntAdj > 0
456000210708                     CONTINUE
456100210708                ELSE
456200210708                   GO TO CGA-0010
456300210708                END-IF
456400210708               END-IF
456500210708      *RFS1115367- Ends
456600200615      *RFS1005534- Ends
456700200615            END-IF.
456800200615
456900200615            COMPUTE WS-ADJUSTMENT-AMOUNT =
457000200615                    WS-ADJUSTMENT-AMOUNT + (ADJUSTMENT-AMOUNT
457100200615                    OF GIC-INT-ADJUST-REASON-REC).
457200200615            GO TO CGA-0010.
457300200615
457400200615       CGA-EXIT.
457500200615           EXIT.
457600200615      *RFS 12825 - END
457700200615      /
457800200615       CALL-GICCALC.
457900200615
458000200615      ******************************************************************
458100200615      *                                                                *
458200200615      *    C A L L   G I C C A L C                                     *
458300200615      *                                                                *
458400200615      ******************************************************************
458500200615
458600200615      **** CALL GICCALC AND WRITE FILE AT PROPER LEVEL
458700200615
458800200615      * RFS 15421 - Begin
458900200615           IF ESTATE-INTEREST-MODE
459000200615             MOVE PASS-MATURITY-DATE       TO  G2J-GREGORIAN
459100200615             MOVE ZEROS                    TO  G2J-JULIAN
459200200615
459300200615             CALL "GRTOJUPRG" USING
459400200615                                    G2J-GREGORIAN
459500200615                                    G2J-JULIAN
459600200615
459700200615             SUBTRACT 1                  FROM  G2J-JULIAN
459800200615             MOVE G2J-JULIAN               TO  J2G-JULIAN
459900200615             MOVE ZEROS                    TO  J2G-GREGORIAN
460000200615
460100200615             CALL "JUTOGRPRG" USING
460200200615                                    J2G-JULIAN
460300200615                                    J2G-GREGORIAN
460400200615             MOVE J2G-GREGORIAN            TO  PASS-MATURITY-DATE
460500200615           END-IF.
460600200615      * RFS 15421 - End
460700200615185374     INITIALIZE RETN-TOTAL-INTEREST.
460800200615           CALL "GICCALC" USING    GICCALC-PARMS.
460900200615
461000200615           IF RETN-RETURN-CODE NOT EQUAL "00" AND
461100200615              RETN-RETURN-CODE NOT EQUAL "10" AND
461200200615              RETN-RETURN-CODE NOT EQUAL "11" AND
461300200615              RETN-RETURN-CODE NOT EQUAL "40"
461400200615               MOVE RETN-RETURN-CODE TO RETN-RET-CODE
461500200615               MOVE RETN-RETURN-CODE-DESC TO RETN-RET-CODE-DESC
461600200615           END-IF.
461700200615
461800200615       GIC-EXIT.
461900200615           EXIT.
462000200615      /
462100200615       PROCESS-DII-INVESTMENT.
462200200615
462300200615      ******************************************************************
462400200615      *                                                                *
462500200615      *    P R O C E S S   D I I   I N V E S T M E N T                 *
462600200615      *                                                                *
462700200615      ******************************************************************
462800200615
462900200615      **** SKIP DII PROCESSING IF CURRENT UNIT BALANCE = ZERO
463000200615      * ---------------------------------
463100200615      *    IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT = 0                     FIX05
463200200615      *        MOVE ZEROES          TO WS-TOTAL-DII-DOLLARS               FIX05
463300200615      *        PERFORM WRITE-DII-INT-WORKFILE THRU WDW-EXIT               FIX05
463400200615      *        GO TO PDI-EXIT                                             FIX05
463500200615      *    END-IF.
463600200615      * ---------------------------------
463700200703      * 1099872 - Begin
463800200703           IF ACCOUNT-V3-MODE
463900200703      * Check if there is full redemption transaction on the end date.
464000200703             PERFORM GET-INT-ON-REDEMPTION
464100200703             IF li_INT_AMT > 0
464200200703      * Return INT value on full redemption date
464300200703                MOVE li_INT_AMT    TO WS-TOTAL-DII-DOLLARS
464400200703                PERFORM WRITE-DII-CONTROL
464500200703                GO TO PDI-EXIT
464600200703             END-IF
464700200703           END-IF.
464800200703      * 1099872 - End
464900200703
465000200615           IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT = 0                     FIX05
465100200615      * 1004070 - Begin
465200200615      * 1017021 - Begin
465300200615      *       IF NOT (ACCOUNT-V2-MODE AND
465400200615               IF NOT ((ACCOUNT-V2-MODE OR ACCOUNT-V3-MODE) AND
465500200615      * 1017021 - End
465600200615               LAST-FINANCIAL-ACTIVITY OF ACCOUNT-INVESTMENT >
465700200615               PASS-END-DATE-OPTION)
465800200615      * 1004070 - End
465900200615               MOVE ZEROES          TO WS-TOTAL-DII-DOLLARS               FIX05
466000200615               PERFORM WRITE-DII-CONTROL                                  FIX05
466100200615               GO TO PDI-EXIT                                             FIX05
466200200615      * 1004070 - Begin
466300200615             END-IF
466400200615      * 1004070 - End
466500200615           END-IF.
466600200615      * ---------------- -------------------
466700200615
466800200615           MOVE ZEROES      TO WS-BALANCE
466900200615                               WS-RANGE-INTEREST-DOLLARS
467000200615                               WS-TOTAL-DII-DOLLARS
467100200615                               WS-TOTAL-DII-NOT-COMPOUND                 RFS9603
467200200615                               WS-END-DATE.
467300200615
467400200615           MOVE SPACES      TO TRANS-CATAGORY
467500200615                               WS-VALID-TRANS-2
467600200615                               WS-VALID-IDR
467700200615                               WS-END-OF-TRANS-2
467800200615                               WS-END-OF-IDR.
467900200615
468000200615      * RFS185941 Starts
468100200615      * RFS1100976 Starts
468200200615      *    IF ln_CnvCurrBalance > 0 AND ln_CnvStartDate > 0
468300200615      *       MOVE ln_CnvCurrBalance TO GROSS-AMT of TRANS-2-REC
468400200615      *       MOVE ZEROES TO PLACEMENT-DATE OF TRANS-2-REC
468500200615      *       MOVE ZEROES TO TRANS-NO OF TRANS-2-REC
468600200615      *       MOVE "BUY"  TO TRANS-TYPE-CODE OF TRANS-2-REC
468700200615      *    END-IF.
468800200615      * RFS1100976 Ends
468900200615      * RFS185941 Ends
469000200615
469100200615      **** PRIME READ OF TRANS-2
469200200615
469300200615      * RFS11986 - Begin
469400200615            INITIALIZE WS-REV-CODE
469500200615            PERFORM READ-NEXT-TRANS-2-FILE THRU RNT-EXIT
469600200615              UNTIL
469700200615               PURCHASE-TRANSACTION                       OR
469800200615               REDEMPTION-TRANSACTION                     OR
469900200615              (INTEREST-TRANSACTION AND WS-REV-CODE-DADJ) OR
470000200615               INVALID-TRANS                              OR
470100200615               END-OF-TRANS-2
470200200615      * ---------------------------------
470300200615      *    PERFORM READ-NEXT-TRANS-2-FILE THRU RNT-EXIT
470400200615      *    UNTIL PURCHASE-TRANSACTION OR REDEMPTION-TRANSACTION
470500200615      *    OR INVALID-TRANS OR END-OF-TRANS-2.
470600200615      * ---------------------------------
470700200615      * RFS11986 - End
470800200615
470900200615           IF INVALID-TRANS OR END-OF-TRANS-2
471000200615000829         GO TO PDI-EXIT
471100200615           END-IF.
471200200615
471300200615           MOVE PLACEMENT-DATE       OF TRANS-2-REC TO                  RFS8582
471400200615                                             WS-PREV-PLACEMENT-DATE-2   RFS8582
471500200615           MOVE TRANS-NO             OF TRANS-2-REC    TO               RFS8582
471600200615                                             WS-PREV-TRANS-NO-2         RFS8582
471700200615           MOVE PAYMENT-TYPE-CODE    OF TRANS-2-REC TO                  RFS8582
471800200615                                             WS-PREV-PAYMENT-TYPE-2     RFS8582
471900200615           MOVE REVERSAL-CODE        OF TRANS-2-REC TO                  RFS10382
472000200615                                             WS-PREV-REVERSAL-CODE-2    RFS10382
472100200615
472200200615           MOVE TRADE-DATE OF TRANS-2-REC
472300200615           TO WS-PREV-TRADE-DATE-2.
472400200615
472500200615           MOVE GROSS-AMT  OF TRANS-2-REC
472600200615           TO WS-PREV-GROSS-AMT-2.
472700200615
472800200615           MOVE CLOSING-UNIT-BAL OF TRANS-2-REC                         RFS9224
472900200615           TO WS-PREV-CLOSING-UNIT-BAL                                  RFS9224
473000200615
473100200615           MOVE SPLIT-OPTION-CODE OF TRANS-2-REC                        RFS9224
473200200615           TO WS-PREV-SPLIT-OPTION-CODE                                 RFS9224
473300200615
473400200615           MOVE TRANS-TYPE-CODE OF TRANS-2-REC
473500200615           TO WS-PREV-TRANS-TYPE-CODE-2.
473600200615
473700200615           MOVE WS-PREV-TRADE-DATE-2  TO WS-START-DATE.
473800200615
473900200615      **** PRIME READ OF INVESTMENT-DII-RATES (IDR)
474000200615
474100200615           READ INVESTMENT-DII-RATES   NEXT RECORD
474200200615               AT END
474300200615               GO TO CAI-EXIT
474400200615           END-READ.
474500200615
474600200615           MOVE EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC
474700200615           TO WS-PREV-EFFECTIV-DATE.
474800200615
474900200615           MOVE DAILY-RATE    OF INVESTMENT-DII-RATES-REC
475000200615           TO WS-PREV-DAILY-RATE.
475100200615
475200200615      ***  GO PROCESS THE INTEREST AND BALANCE CALCULATIONS
475300200615
475400200615           MOVE ZEROES      TO WS-NEXT-INT-CHG-DATE.
475500200615      *
475600200615           IF WS-END-DATE >= WS-DATE                                    RFS9603
475700200615               CONTINUE                                                 RFS9603
475800200615           ELSE                                                         RFS9603
475900200615               PERFORM PROCESS-DII-DETAILS THRU PDD-EXIT                RFS9603
476000200615                 UNTIL (INVALID-TRANS OR END-OF-TRANS-2)      AND       RFS9603
476100200615                       (WS-END-DATE >= WS-DATE)                         RFS9603
476200200615           END-IF                                                       RFS9603
476300200615      * --------------------------------------------------------------- RFS9603
476400200615      *    PERFORM PROCESS-DII-DETAILS THRU PDD-EXIT                    RFS9603
476500200615000619*    UNTIL INVALID-TRANS OR END-OF-TRANS-2                        RFS9603
476600200615000619*    OR WS-END-DATE = WS-DATE.                                    RFS9603
476700200615000619*    UNTIL WS-END-DATE >= WS-DATE.                                RFS9603
476800200615      * --------------------------------------------------------------- RFS9603
476900200615      **** ADD LAST BALANCE TO WS-TOTAL-DII-DOLLARS
477000200615
477100200615           PERFORM WRITE-DII-CONTROL.                                   FIX05
477200200615      * ---------------------------------                               FIX05
477300200615      *    IF (TRNPST-MODE) OR (INTEREST-MODE)                          FIX05
477400200615      *        MOVE WS-TOTAL-DII-DOLLARS TO RETN-ACCRUAL-AMT            FIX05
477500200615      *    ELSE                                                         FIX05
477600200615      *        PERFORM WRITE-DII-INT-WORKFILE THRU WDW-EXIT             FIX05
477700200615      *    END-IF.                                                      FIX05
477800200615      * ---------------------------------                               FIX05
477900200615       PDI-EXIT.
478000200615           EXIT.
478100200615      * ---------------------------------
478200200615       WRITE-DII-CONTROL.                                                 FIX05
478300200615      * ---------------------------------                                 FIX05
478400200615           IF TRNPST-MODE        OR                                       FIX05
478500200615              INTEREST-MODE                                               FIX05
478600200615112133        OR ACCOUNT-V1-MODE
478700200615137231        OR ACCOUNT-V2-MODE
478800200615      * 1017021 - Begin
478900200615              OR ACCOUNT-V3-MODE
479000200615      * 1017021 - End
479100200615               COMPUTE RETN-ACCRUAL-AMT ROUNDED =                         FIX05
479200200615                                        WS-TOTAL-DII-DOLLARS              FIX05
479300200615           ELSE                                                           FIX05
479400200615               PERFORM WRITE-DII-INT-WORKFILE THRU WDW-EXIT               FIX05
479500200615           END-IF.                                                        FIX05
479600200615      * ---------------------------------                                 FIX05
479700200615      /
479800200615       WRITE-DII-INT-WORKFILE.
479900200615
480000200615      ******************************************************************
480100200615      *                                                                *
480200200615      *    W R I T E   D I I   I N T   W O R K F I L E                 *
480300200615      *                                                                *
480400200615      ******************************************************************
480500200615
480600200615      **** WRITE RECORD TO WORKFILE AT DII LEVEL
480700200615      * RFS12320 - Begin
480800200615           IF ACCOUNT-A1-MODE
480900200615               COMPUTE WS-TOTAL-ACCRUAL-AMT ROUNDED =                   FIX06
481000200615                            WS-TOTAL-ACCRUAL-AMT + WS-TOTAL-DII-DOLLARS FIX06
481100200615           ELSE
481200200615      * RFS12320 - End
481300200615             MOVE PASS-ACCOUNT-NO
481400200615             TO ACCOUNT-NO OF GIC-INT-WORKFILE-REC
481500200615148358          li_AccountNo_GD
481600200615             MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
481700200615             TO INVESTMENT-CODE OF GIC-INT-WORKFILE-REC
481800200615148358          lc_InvestCode_GD
481900200615             MOVE ZEROES
482000200615             TO CERTIFICATE-ID-NO OF GIC-INT-WORKFILE-REC
482100200615148358          li_CertNo_GD
482200200615
482300200615      *    MOVE WS-TOTAL-DII-DOLLARS                                    FIX06
482400200615      *    TO ACCRUAL-AMT OF GIC-INT-WORKFILE-REC.                      FIX06
482500200615             COMPUTE ACCRUAL-AMT OF GIC-INT-WORKFILE-REC ROUNDED =      FIX06
482600200615                                          WS-TOTAL-DII-DOLLARS          FIX06
482700200615      *RFS150674 Start
482800200615148358*      COMPUTE li_AccrualAmt_GD  = WS-TOTAL-DII-DOLLARS
482900200615             COMPUTE li_AccrualAmt_GD  ROUNDED = WS-TOTAL-DII-DOLLARS
483000200615      *RFS150674 End
483100200615             IF (DII-BATCH-MODE)
483200200615              OR (GIC-BATCH-MODE)                                       FIX02
483300200615                 REWRITE GIC-INT-WORKFILE-REC
483400200615             ELSE
483500200615148358         IF NOT GICDII-BATCH-MODE
483600200615                 WRITE GIC-INT-WORKFILE-REC
483700200615148358         END-IF
483800200615             END-IF
483900200615           END-IF.                                                      RFS12320
484000200615      *RFS148358 - Start
484100200615           IF (GICDII-BATCH-MODE)
484200200615              EXEC SQL
484300200615                 INSERT INTO QTEMP/SQGMATINT
484400200615                 VALUES(:li_AccountNo_GD,
484500200615                        :lc_InvestCode_GD,
484600200615                        :li_CertNo_GD,
484700200615                        :li_AccrualAmt_GD)
484800200615              END-EXEC
484900200615           END-IF.
485000200615      *RFS148358 - End
485100200615       WDW-EXIT.
485200200615           EXIT.
485300200615      /
485400200615       PROCESS-DII-DETAILS.
485500200615
485600200615      ******************************************************************
485700200615      *                                                                *
485800200615      *    P R O C E S S   D I I   D E T A I L S                       *
485900200615      *                                                                *
486000200615      ******************************************************************
486100200615
486200200615      **** DECIDE END DATE - BY DEFAULT TODAY'S DATE IS IN FIELD
486300200615      **** WS-DATE (SEE INITIALIZE ROUTINE) ..  IF DII-BATCH-MODE
486400200615      **** WE USE THE NEXT NEW YEAR'S DAY ..  IF EARLY REDEMPTION
486500200615      **** WE USE THE DATE PASSED FROM CALLING PROGRAM
486600200615
486700200615           IF (DII-BATCH-MODE)
486800200615      *RFS150674 Start
486900200615148358*       OR (GICDII-BATCH-MODE AND
487000200615148358*           PASS-CERTIFICATE-ID-NO = ZEROES)
487100200615      *RFS150674 End
487200200615               MOVE WS-NEW-YEARS-DAY     TO WS-DATE
487300200622
487400200622      * RFS1101805 Starts
487500200622      * If conversion record exist and start calculation date is on Dec 31.
487600200622      * Year end DII interest calculation will based on Dec 31 instead of
487700200622      * Jan 1. Otherwise it will add one more date for interest.
487800200622             IF lb_CnvDiiRecExistsYes AND (WS-CNV-MMDD = WS-YEND-MMDD)
487900200622               MOVE WS-YEAR-END-DATE     TO WS-DATE
488000200622             END-IF
488100200622      * RFS1101805 Ends
488200200622
488300200615           END-IF.
488400200615
488500200615           IF (EARLY-REDEMPTION-MODE)
488600200615               MOVE PASS-END-DATE-OPTION TO WS-DATE
488700200615           END-IF.
488800200615      *RFS150674 Start
488900200615           IF (GICDII-BATCH-MODE)
489000200615               MOVE WS-AS-AT-DATE        TO WS-DATE
489100200615           END-IF.
489200200615      *RFS150674 End
489300200615
489400200615      **** DETERMINE PERIOD BETWEEN CURRENT TRANS AND NEXT TRANS
489500200615
489600200615           MOVE SPACES              TO TRANS-CATAGORY.
489700200615
489800200615           IF WS-START-DATE = WS-NEXT-INT-CHG-DATE
489900200615           AND NOT END-OF-IDR
490000200615           AND NOT INVALID-IDR
490100200615               CONTINUE
490200200615           ELSE
490300200615               PERFORM READ-NEXT-TRANS-2-FILE THRU RNT-EXIT
490400200615                 UNTIL PURCHASE-TRANSACTION
490500200615                 OR REDEMPTION-TRANSACTION
490600200615000817           OR INTEREST-TRANSACTION
490700200615                 OR INVALID-TRANS OR END-OF-TRANS-2
490800200615                 OR TRADE-DATE OF TRANS-2-REC > WS-DATE
490900200615      * Check, if maximum date passed and set indicator, if it is true
491000200615               IF TRADE-DATE OF TRANS-2-REC > WS-DATE
491001211005      *RFS1112849 - Starts: To avoid stop processing when trans re      ad
491002211005      *           with same trade date as interest calculation end date(V3)
491003211005                  OR (ACCOUNT-V3-MODE AND
491004211005                     TRADE-DATE OF TRANS-2-REC >= WS-DATE)
491005211005      *RFS1112849 - Ends
491100200615                   SET END-OF-TRANS-2         TO TRUE
491200200615               END-IF
491300200615      **** EXIT SECTION IF END OF FILE - OR INVALID TRANSACTION
491400200615
491500200615000619*        IF INVALID-TRANS OR END-OF-TRANS-2
491600200615000619*            GO TO PDD-EXIT
491700200615000619*        END-IF
491800200615
491900200615      * RFS13910 - Begin
492000200615               IF NOT INVALID-TRANS           AND
492100200615                  NOT END-OF-TRANS-2
492200200615                   MOVE WS-PREV-TRADE-DATE-2  TO WS-START-DATE
492300200615               END-IF
492400200615      *        MOVE WS-PREV-TRADE-DATE-2  TO WS-START-DATE
492500200615      * RFS13910 - End
492600200615
492700200615           END-IF.
492800200615
492900200615      **** FOR SIMPLICITY, WE DECIDE WHICH DATE TO PUT INTO WS-END-DATE
493000200615      **** (WS-START-DATE WAS POPULATED WITH WS-PREV-TRADE-DATE-2)
493100200615
493200200615           IF WS-DATE <= TRADE-DATE OF TRANS-2-REC
493300200615000619         OR INVALID-TRANS OR END-OF-TRANS-2
493400200615               MOVE WS-DATE         TO WS-END-DATE
493500200615           ELSE
493600200615               MOVE TRADE-DATE OF TRANS-2-REC TO WS-END-DATE
493700200615           END-IF.
493800200615
493900200615      **** DETERMINE WHAT THE INTEREST RATE WOULD BE FOR TIME RANGE
494000200615
494100200615           PERFORM READ-NEXT-INVESTMENT-DII-RATES THRU RNI-EXIT
494200200615           UNTIL EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC >
494300200615           WS-START-DATE OR END-OF-IDR OR INVALID-IDR.
494400200615
494500200615      **** (IF THE INTEREST DATE CHANGE IS BETWEEN OUR
494600200615      ****  START OR END DATE, WE USE THIS RANGE INSTEAD)
494700200615
494800200615           IF  WS-NEXT-INT-CHG-DATE < WS-END-DATE
494900200615           AND WS-NEXT-INT-CHG-DATE > WS-START-DATE
495000200615               MOVE WS-NEXT-INT-CHG-DATE TO WS-END-DATE
495100200615           END-IF.
495200200615
495300200615      **** CALCULATE TOTAL DAYS BETWEEN START AND END DATES
495400200615
495500200615           MOVE WS-START-DATE       TO DGP-GREGORIAN.
495600200615           CALL "DRG2J" USING       DR-G2J-PARMS.
495700200615           MOVE DGP-JULIAN          TO WS-JULIAN-START-DATE.
495800200615           MOVE WS-END-DATE         TO DGP-GREGORIAN.
495900200615           CALL "DRG2J" USING       DR-G2J-PARMS.
496000200615           MOVE DGP-JULIAN          TO WS-JULIAN-END-DATE.
496100200615
496200200615           COMPUTE WS-TOTAL-DAYS =
496300200615           WS-JULIAN-END-DATE - WS-JULIAN-START-DATE.
496400200615
496500200615      **** CALCULATE RANGE INTEREST AND ACCUMULATE TOTAL FOR
496600200615      **** ACCOUNT AND INVESTMENT LEVEL
496700200615
496800200615           COMPUTE WS-RANGE-INTEREST-RATE =
496900200615           WS-PREV-DAILY-RATE * WS-TOTAL-DAYS.
497000200615
497100200615      **** ADD OR REMOVE DOLLARS FROM WS-BALANCE
497200200615      * To include backdated transactions in accrued interst            RFS9603
497300200615      * don't initialize interest but check accumulated interest        RFS9603
497400200615      * against interest in TRANS and continue accumulate interest with RFS9603
497500200615      * new value.                                                      RFS9603
497600200615      *                                                                 RFS10382
497700200615           MOVE WS-PREV-TRANS-TYPE-CODE-2 TO TRANS-CATAGORY
497800200615           PERFORM VH-DII-BALANCE                                       RFS10382
497900200615      * --------------------------------------------------------------- RFS10382
498000200615      *    IF WS-START-DATE = WS-PREV-TRADE-DATE-2
498100200615      *        IF (PURCHASE-TRANSACTION)
498200200615      *          COMPUTE WS-BALANCE = WS-BALANCE + WS-PREV-GROSS-AMT-2
498300200615      *        END-IF
498400200615      *
498500200615      *        IF (REDEMPTION-TRANSACTION)
498600200615      *            COMPUTE WS-BALANCE =
498700200615      *                     WS-BALANCE - WS-PREV-GROSS-AMT-2
498800200615      *        END-IF
498900200615      *        IF (INTEREST-TRANSACTION)                                RFS8582
499000200615      *           PERFORM VF-GET-DISTR-OPTION-CODE                      RFS8582
499100200615      *           IF WS-DISTR-OPTION-DII-REINVEST          OR           RFS8582
499200200615      *              (WS-PREV-PAYMENT-TYPE-2-SPACE AND                  RFS8582
499300200615      *                                        WS-DISTR-OPTION-DII-R)   RFS8582
499400200615      *                COMPUTE WS-BALANCE =                             RFS8582
499500200615      *                               WS-BALANCE + WS-PREV-GROSS-AMT-2  RFS8582
499600200615      *           END-IF                                                RFS8582
499700200615      *           COMPUTE WS-TEMP-AMT ROUNDED = WS-TOTAL-DII-DOLLARS    RFS9603
499800200615      *           COMPUTE WS-TOTAL-DII-DOLLARS ROUNDED =                RFS9603
499900200615      *                            WS-TEMP-AMT - WS-PREV-GROSS-AMT-2    RFS9603
500000200615      *        END-IF                                                   RFS8582
500100200615      *    END-IF.
500200200615      * --------------------------------------------------------------- RFS10382
500300200615      **** CALCULATE THE INTEREST FOR THE RANGE
500400200615
500500200615           COMPUTE WS-RANGE-INTEREST-DOLLARS ROUNDED =
500600200615           WS-RANGE-INTEREST-RATE * WS-BALANCE
500700200615
500800200615      **** ACCUMULATE TOTAL DOLLARS FOR THE ENTIRE DII INVESTMENT
500900200615
501000200615000817* ---------------------------------                               RFS9603
501100200615000817*    IF (INTEREST-TRANSACTION)                                    RFS9603
501200200615000817*        MOVE ZEROES         TO WS-TOTAL-DII-DOLLARS              RFS9603
501300200615001106*    END-IF.                                                      RFS9603
501400200615000817* ---------------------------------                               RFS9603
501500200615
501600200615001106
501700200615000817     COMPUTE WS-TOTAL-DII-DOLLARS =
501800200615000817             WS-TOTAL-DII-DOLLARS +
501900200615000817             WS-RANGE-INTEREST-DOLLARS.
502000200615
502100200615      **** SET THE START DATE FOR THE NEXT DATE RANGE
502200200615
502300200615           MOVE WS-END-DATE        TO WS-START-DATE.
502400200615
502500200615       PDD-EXIT.
502600200615           EXIT.
502700200615      /
502800200615       READ-NEXT-TRANS-2-FILE.
502900200615
503000200615      ******************************************************************
503100200615      *                                                                *
503200200615      *    R E A D -  N E X T -  T R A N S - 2 - F I L E               *
503300200615      *                                                                *
503400200615      ******************************************************************
503500200615
503600200615      **** SET WS-PREVIOUS VARIABLES
503700200615
503800200615           IF (TRANS-STATUS-CODE OF TRANS-2-REC NOT EQUAL "HST" AND
503900200615               TRANS-STATUS-CODE OF TRANS-2-REC NOT EQUAL "HSC")
504000200615               OR REVERSE           OF TRANS-2-REC = "Y"
504100200615      * RFS 14016 BEGIN
504200200615000822*        OR (ESTATE-EARLY-REDEMPTION-MODE AND
504300200615000822*            PROCESS-DATE OF TRANS-2-REC > PASS-END-DATE-OPTION)
504400200615000822         OR (ESTATE-EARLY-REDEMPTION-MODE AND
504500200615000822             TRADE-DATE OF TRANS-2-REC > PASS-END-DATE-OPTION)
504600200615      * RFS 14016 END
504700200615
504800200615               OR (STMT-INTEREST-MODE           AND                     RFS11106
504900200615                   PROCESS-DATE OF TRANS-2-REC >= PASS-END-DATE-OPTION) RFS11106
505000200615      * RFS 15421 - Begin
505100200615               OR (ESTATE-INTEREST-MODE         AND
505200200615                   TRADE-DATE OF TRANS-2-REC >= PASS-END-DATE-OPTION)   RFS11106
505300200615      * RFS 15421 - End
505400200615      * RFS 137231- Begin
505500200615      * 1004070 - Begin : Comment out following from 137231
505600200615137231*        OR (ACCOUNT-V2-MODE              AND
505700200615137231*            TRADE-DATE OF TRANS-2-REC >= PASS-END-DATE-OPTION)
505800200615      * 1004070 - End
505900200615      * RFS 137231- End
506000200615      * 1017021 - Begin : Not including transaction on End Date
506100200615               OR (ACCOUNT-V3-MODE              AND
506200200615                      TRADE-DATE OF TRANS-2-REC >= PASS-END-DATE-OPTION)
506300200615      * 1017021 - End
506400200615               CONTINUE
506500200615           ELSE
506600200615               MOVE TRADE-DATE OF TRANS-2-REC TO WS-PREV-TRADE-DATE-2
506700200615               MOVE GROSS-AMT  OF TRANS-2-REC TO WS-PREV-GROSS-AMT-2
506800200615               MOVE CLOSING-UNIT-BAL OF TRANS-2-REC          TO
506900200615                    WS-PREV-CLOSING-UNIT-BAL                             RFS9224
507000200615
507100200615               MOVE SPLIT-OPTION-CODE OF TRANS-2-REC         TO          RFS9603
507200200615                    WS-PREV-SPLIT-OPTION-CODE                            RFS9224
507300200615               MOVE TRANS-TYPE-CODE OF TRANS-2-REC                       RFS9224
507400200615               TO WS-PREV-TRANS-TYPE-CODE-2
507500200615               MOVE REVERSAL-CODE        OF TRANS-2-REC       TO        RFS10382
507600200615                                             WS-PREV-REVERSAL-CODE-2    RFS10382
507700200615
507800200615               MOVE PLACEMENT-DATE       OF TRANS-2-REC       TO        RFS8582
507900200615                                             WS-PREV-PLACEMENT-DATE-2   RFS8582
508000200615               MOVE TRANS-NO             OF TRANS-2-REC       TO        RFS8582
508100200615                                             WS-PREV-TRANS-NO-2         RFS8582
508200200615               MOVE PAYMENT-TYPE-CODE    OF TRANS-2-REC       TO        RFS8582
508300200615                                             WS-PREV-PAYMENT-TYPE-2     RFS8582
508400200615           END-IF.
508500200615
508600200615      **** READ NEXT TRANS-2 RECORD
508700200615
508800200615      * RFS185941 Starts
508900200615           IF (lb_CnvDiiRecExistsYes  AND lc_FirstTrans = 'N') OR
509000200615               lb_CNVDiiRecExistsNo
509100200615      * RFS185941 Ends
509200200615           READ TRANS-2 NEXT RECORD
509300200615           AT END
509400200615           MOVE "10"                TO WS-END-OF-TRANS-2
509500200615185941*    GO TO RNT-EXIT.
509600200615      * RFS1100976 Starts
509700200615           GO TO RNT-EXIT
509800200615      * RFS1100976 Ends
509900200615185941     END-IF.
510000200615      * RFS1100976 Starts
510100200615           IF lb_CnvDiiRecExistsYes AND lc_FirstTrans = 'Y'
510200200615              MOVE ln_CnvStartDate   TO PROCESS-DATE OF TRANS-2-REC
510300200615              MOVE ln_CnvStartDate   TO TRADE-DATE OF TRANS-2-REC
510400200615              MOVE ln_CnvCurrBalance TO GROSS-AMT of TRANS-2-REC
510500200615              MOVE ln_CnvCurrBalance
510600200615                TO CLOSING-UNIT-BAL OF TRANS-2-REC
510700200615              MOVE ZEROES TO PLACEMENT-DATE OF TRANS-2-REC
510800200615              MOVE ZEROES TO TRANS-NO OF TRANS-2-REC
510900200615              MOVE "BUY"  TO TRANS-TYPE-CODE OF TRANS-2-REC
511000200615              MOVE "HSC"  TO TRANS-STATUS-CODE OF TRANS-2-REC
511100200615           ELSE
511200200615              IF lb_CnvDiiRecExistsYes AND lc_FirstTrans = "N"
511300200615                AND lc_NoTRANS = "Y"
511400200615                 MOVE "10"                TO WS-END-OF-TRANS-2
511500200615                 GO TO RNT-EXIT
511600200615              END-IF
511700200615           END-IF
511800200615      * RFS1100976 Ends
511900200615
512000200615      **** SKIP THIS RECORD IF TRANSACTION REVERSED OR NOT FINAL
512100200615      **** OR IF TRADE-DATE OF TRANSACTION NOT POPULATED
512200200615
512300200615           IF (TRANS-STATUS-CODE OF TRANS-2-REC NOT EQUAL "HST" AND
512400200615      * RFS1100976 Starts
512500200615               TRANS-STATUS-CODE OF TRANS-2-REC NOT EQUAL "HSC")
512600200615      * RFS1100976 Ends
512700200615      * RFS185941 Starts
512800200615      *        TRANS-STATUS-CODE OF TRANS-2-REC NOT EQUAL "HSC")
512900200615      * RFS1100976 Starts
513000200615      *        TRANS-STATUS-CODE OF TRANS-2-REC NOT EQUAL "HSC"
513100200615      *    AND ((lb_CnvDiiRecExistsYes  AND lc_FirstTrans = 'N') OR
513200200615      *          lb_CnvDiiRecExistsNo))
513300200615      * RFS1100976 Ends
513400200615      * RFS185941 Ends
513500200615           OR (REVERSE           OF TRANS-2-REC = "Y")
513600200615001003     OR (TRADE-DATE        OF TRANS-2-REC = 0)
513700200615      * RFS 14016 BEGIN
513800200615000822*    OR (ESTATE-EARLY-REDEMPTION-MODE AND
513900200615000822*        PROCESS-DATE OF TRANS-2-REC > PASS-END-DATE-OPTION)
514000200615000822     OR (ESTATE-EARLY-REDEMPTION-MODE AND
514100200615000822         TRADE-DATE OF TRANS-2-REC > PASS-END-DATE-OPTION)
514200200615      * RFS 14016 END
514300200615               IF TRADE-DATE OF TRANS-2-REC = 0
514400200615                   MOVE "99"            TO RETN-RET-CODE
514500200615                   MOVE "Info: Trade Date is not populated for Inv:"
514600200615                                        TO WS-INV-MSG
514700200615                   MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
514800200615                                        TO WS-INV-MSG-INV
514900200615                   MOVE WS-INV-MESSAGE  TO RETN-RET-CODE-DESC
515000200615                   MOVE "10"     TO WS-END-OF-TRANS-2
515100200615               END-IF
515200200615               GO TO RNT-EXIT
515300200615           END-IF.
515400200615
515500200615      **** DETERMINE IF VALID TRANSACTION TO USE (WILL END CHAIN READ)
515600200615
515700200615           MOVE "N"                 TO WS-VALID-TRANS-2.
515800200615137231*
515900200615137231**** If this is the first read after the start on routine
516000200615137231**** START-TRANS-2 on file TRANS-2, check if the first
516100200615137231**** transaction has a trade date > end date.  If yes,
516200200615137231**** do not continue the process.
516300200615137231     IF lc_FirstTrans = "Y"
516400200615137231        MOVE "N"           TO lc_FirstTrans
516500200615137231        IF (STMT-INTEREST-MODE           AND
516600200615137231            PROCESS-DATE OF TRANS-2-REC >= PASS-END-DATE-OPTION)
516700200615137231        OR (ACCOUNT-V2-MODE              AND
516800200615137231            TRADE-DATE OF TRANS-2-REC >= PASS-END-DATE-OPTION)
516900200615      * 1017021 - Begin
517000200615              OR (ACCOUNT-V3-MODE              AND
517100200615                   TRADE-DATE OF TRANS-2-REC >= PASS-END-DATE-OPTION)
517200200615      * 1017021 - End
517300200615      * 1021425 - Begin
517400200615              OR (DII-BATCH-MODE               AND
517500200615                   TRADE-DATE OF TRANS-2-REC >= WS-NEW-YEARS-DAY)
517600200615              OR (EARLY-REDEMPTION-MODE        AND
517700200615                   TRADE-DATE OF TRANS-2-REC >= PASS-END-DATE-OPTION)
517800200615      * 1021425 - End
517900200615137231             GO TO RNT-EXIT
518000200615137231        END-IF
518100200615137231     END-IF.
518200200615
518300200615           IF ACCOUNT-NO OF TRANS-2-REC = PASS-ACCOUNT-NO AND
518400200615           INVESTMENT-CODE OF TRANS-2-REC =
518500200615           INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
518600200615               MOVE "Y"             TO WS-VALID-TRANS-2
518700200615               MOVE TRANS-TYPE-CODE OF TRANS-2-REC TO TRANS-CATAGORY
518800200615               MOVE REVERSAL-CODE OF TRANS-2-REC   TO WS-REV-CODE       RFS11986
518900200615           END-IF.
519000200615
519100200615       RNT-EXIT.
519200200615           EXIT.
519300200615      /
519400200615       READ-NEXT-INVESTMENT-DII-RATES.
519500200615
519600200615      ******************************************************************
519700200615      *                                                                *
519800200615      *    R E A D   N E X T   I N V E S T M E N T - D I I - R A T E S *
519900200615      *                                                                *
520000200615      ******************************************************************
520100200615
520200200615      **** SAVE PREVIOUS VALUES
520300200615
520400200615           MOVE EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC
520500200615           TO WS-PREV-EFFECTIV-DATE.
520600200615
520700200615           MOVE DAILY-RATE    OF INVESTMENT-DII-RATES-REC
520800200615           TO WS-PREV-DAILY-RATE.
520900200615
521000200615      **** READ NEXT IDR
521100200615
521200200615           READ INVESTMENT-DII-RATES   NEXT RECORD
521300200615           AT END
521400200615           MOVE "10"                TO WS-END-OF-IDR
521500200615           GO TO RNI-EXIT.
521600200615
521700200615      **** DETERMINE IF VALID RECORD AS PER PASSED PARAMETERS
521800200615
521900200615           MOVE "N"                 TO WS-VALID-IDR.
522000200615
522100200615           IF INVESTMENT-CODE OF INVESTMENT-DII-RATES-REC =
522200200615              INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC AND
522300200615              DII-SET OF INVESTMENT-DII-RATES-REC = WS-DII-SET
522400200615              AND NOT END-OF-FILE
522500200615               MOVE "Y"             TO WS-VALID-IDR
522600200615           ELSE
522700200615               MOVE ZEROES
522800200615               TO EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC
522900200615                  WS-PREV-EFFECTIV-DATE
523000200615           END-IF.
523100200615
523200200615           MOVE WS-PREV-EFFECTIV-DATE TO WS-EFFECTIV-DATE.
523300200615
523400200615           MOVE EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC
523500200615           TO   WS-NEXT-INT-CHG-DATE.
523600200615
523700200615       RNI-EXIT.
523800200615           EXIT.
523900200615      /
524000200615       PROCESS-LAST-INTEREST-PERIOD.
524100200615
524200200615      ******************************************************************
524300200615      *                                                                *
524400200615      *    P R O C E S S   L A S T   I N T E R E S T   P E R I O D     *
524500200615      *                                                                *
524600200615      ******************************************************************
524700200615      * RFS11367 - Begin
524800200615           PERFORM VL-LAST-GET-INT-CALC-MAIN
524900200615      * RFS11367 - End
525000200615
525100200615      **** ISSUE DATE
525200200615
525300200615           MOVE WS-PREV-TRADE-DATE-1
525400200615           TO PASS-ISSUE-DATE.
525500200615
525600200615      **** MATURITY DATE
525700200615
525800200615           IF (BATCH-MODE)
525900200615               MOVE NEXT-PAYMENT-DATE
526000200615               OF GIC-CERTIFICATE-DETAILS-3-REC
526100200615                                          TO PASS-MATURITY-DATE
526200200615           ELSE
526300200615               MOVE WS-DATE               TO PASS-MATURITY-DATE
526400200615           END-IF.
526500200615
526600200615           IF (EARLY-REDEMPTION-MODE)
526700200615               MOVE PASS-END-DATE-OPTION  TO PASS-MATURITY-DATE
526800200615           END-IF.
526900200615
527000200615           IF (UNTIL-MATURITY-MODE)
527100200615               MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
527200200615               TO PASS-MATURITY-DATE
527300200615           END-IF.
527400200615      *RFS150674 Start
527500200615           IF (GICDII-BATCH-MODE)
527600200615               MOVE WS-AS-AT-DATE    TO PASS-MATURITY-DATE
527700200615           END-IF.
527800200615      *RFS150674 End
527900200615
528000200615      **** INTEREST RATE
528100200615
528200200615           MOVE INT-RATE OF GIC-CERTIFICATE-DETAILS-3-REC
528300200615           TO PASS-INTEREST-RATE.
528400200615
528500200615      **** PAYMENT OPTION
528600200615
528700200615           MOVE INT-PAYMENT-OPTION
528800200615           OF GIC-CERTIFICATE-DETAILS-3-REC
528900200615           TO PASS-INTEREST-PAYMENT-OPTION.
529000200615
529100200615      **** PAYMENT FREQUENCY
529200200615
529300200615           MOVE INT-PAYMENT-FREQUENCY
529400200615           OF GIC-CERTIFICATE-DETAILS-3-REC
529500200615           TO PASS-INTEREST-FREQUENCY.
529600200615
529700200615      **** TRANS TYPE CODE
529800200615
529900200615           MOVE WS-PREV-TRANS-TYPE-CODE-1    TO TRANS-CATAGORY.
530000200615
530100200615           IF (INTEREST-TRANSACTION)                                    RFS9240
530200200615      *RFS 12353 -start
530300200615             IF WS-PREV-TRANS-STATUS-CODE-1                             RFS9240
530400200615                           NOT EQUAL "CHQ"
530500200615                MOVE ZEROES TO WS-ACCRUAL-AMT-PER-GRP                   RFS9240
530600200615      *RFS 13492 - Start
530700200615             ELSE
530800200615                 IF NOT (STMT-INTEREST-MODE  OR
530900200615137231                   ACCOUNT-V2-MODE     OR
531000200615      * 1017021 - Begin
531100200615                         ACCOUNT-V3-MODE     OR
531200200615      * 1017021 - End
531300200615                         ESTATE-INTEREST-MODE)
531400200615                   MOVE ZEROES TO WS-ACCRUAL-AMT-PER-GRP                RFS9240
531500200615                 END-IF
531600200615      *RFS 13492 - End
531700200615             END-IF
531800200615      *RFS 12353 -end
531900200615           END-IF                                                       RFS9240
532000200615
532100200615      *    IF (INTEREST-TRANSACTION)
532200200615      *        MOVE ZEROES TO WS-ACCRUAL-AMT
532300200615      *    END-IF.
532400200615
532500200615      **** CAPITAL AMOUNT
532600200615
532700200615           MOVE WS-GIC-BALANCE TO PASS-CAPITAL-AMOUNT.
532800200615                                                                        RFS10563
532900200615           SET  PASS-ORIG-CALC-YES                TO TRUE               RFS10563
533000200615      * RFS143882 Starts
533100200615           Initialize PASS-ACCOUNTNO
533200200615                      PASS-INVESTMENTCO
533300200615                      PASS-CERTIFICATEID
533400200615                      PASS-INCLUDE-GIC-ADJ
533500200615           IF MATURITY-SELL-MODE
533600200615             PERFORM CHECK-GIC-ADJ
533700200615             IF li_IntAdjAmt NOT = 0
533800200615               SET  PASS-LAST-PERIOD        TO TRUE
533900200615               MOVE ACCOUNT-NO OF GIC-CERTIFICATE-DETAILS-3-REC
534000200615                 TO PASS-ACCOUNTNO
534100200615               MOVE INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-3-REC
534200200615                 TO PASS-INVESTMENTCO
534300200615               MOVE CERTIFICATE-ID-NO OF
534400200615                    GIC-CERTIFICATE-DETAILS-3-REC
534500200615                 TO PASS-CERTIFICATEID
534600200615               MOVE "Y" TO PASS-INCLUDE-GIC-ADJ
534700200615             END-IF
534800200615           END-IF
534900200615      * RFS143882 Ends
535000200615141855* Accrual interest projection on last period calculation only for
535100200615141855* componded interest.
535200200615141855     IF INT-PAYMENT-OPTION
535300200615141855        OF GIC-CERTIFICATE-DETAILS-3-REC = "A"
535400200615141057        SET  PASS-LAST-PERIOD        TO TRUE
535500200615141855       IF WS-PREV-TRANS-TYPE-CODE-1 = "INT"
535600200615141855         MOVE 0 TO RETN-TOTAL-INTEREST
535700200615141855        ELSE
535800200615141057         MOVE WS-ACCRUAL-AMT-PER-GRP  TO RETN-TOTAL-INTEREST
535900200615141855       END-IF
536000200615141855     END-IF
536100200615           MOVE ISSUE-DATE OF                                           RFS10563
536200200615                GIC-CERTIFICATE-DETAILS-3-REC     TO                    RFS10563
536300200615                                            PASS-ORIG-ISSUE-DATE        RFS10563
536400200615      * RFS143882 Starts
536500200615           IF lb_TransferInKindYes AND
536600200615              li_OriginalIssueDate > 0
536700200615                 MOVE li_OriginalIssueDate TO
536800200615                  PASS-ORIG-ISSUE-DATE
536900200615           END-IF
537000200615
537100200615      * RFS143882 Ends
537200200615           MOVE MATURITY-DATE OF                                        RFS10563
537300200615                GIC-CERTIFICATE-DETAILS-3-REC     TO                    RFS10563
537400200615                                            PASS-ORIG-MATURITY-DATE     RFS10563
537500200615
537600200615      **** CALL GICCALC AND ACCUMULATE INTEREST
537700200615
537800200615           PERFORM CALL-GICCALC THRU GIC-EXIT.
537900200615
538000200615      **** IF WS-PREV-TRANS-TYPE-CODE-1 = "INT"
538100200615
538200200615
538300200615      ****             TRANS TYPE CODE
538400200615
538500200615           COMPUTE WS-ACCRUAL-AMT-PER-GRP  =                            RFS9240
538600200615                   WS-ACCRUAL-AMT-PER-GRP  + (RETN-TOTAL-INTEREST).     RFS9240
538700200615      *    COMPUTE WS-ACCRUAL-AMT                                       RFS9240
538800200615      *    = WS-ACCRUAL-AMT + (RETN-TOTAL-INTEREST).                    RFS9240
538900200615
539000200615       PLI-EXIT.
539100200615           EXIT.
539200200615      /
539300200615       CHECK-IF-VALID-GIC-CERTIFICATE.
539400200615
539500200615      ******************************************************************
539600200615      *                                                                *
539700200615      *    C H E C K   I F   V A L I D   G I C   C E R T I F I C A T E *
539800200615      *                                                                *
539900200615      ******************************************************************
540000200615
540100200615           MOVE "N"                 TO WS-VALID-CERTIFICATE.
540200200615
540300200615      *    IF ((ACCOUNT-MODE) OR (INVESTMENT-MODE))                     RFS10404
540400200615      *        AND PASS-CERTIFICATE-ID-NO = ZEROES                      RFS10404
540500200615           IF SW05-CHECK-DETAILS-1-REC                                  RFS10404
540600200615               MOVE GIC-CERTIFICATE-DETAILS-1-REC
540700200615               TO   GIC-CERTIFICATE-DETAILS-3-REC
540800200615               IF ACCOUNT-NO OF GIC-CERTIFICATE-DETAILS-3-REC =
540900200615                  PASS-ACCOUNT-NO AND
541000200615                  INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-3-REC  =
541100200615                  INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
541200200615      * RFS11106 - Begin
541300200615      *                                                          AND    RFS9657
541400200615      *           CERT-STATUS-CODE OF GIC-CERTIFICATE-DETAILS-3-REC     RFS9657
541500200615      *                                               NOT = LT-CLOSE    RFS9657
541600200615      * RFS11106 - End
541700200615                   MOVE "Y"             TO WS-VALID-CERTIFICATE
541800200615               END-IF
541900200615           END-IF.
542000200615
542100200615      *    IF (GIC-BATCH-MODE) OR (CERTIFICATE-MODE)                    RFS10404
542200200615           IF SW05-CHECK-DETAILS-2-REC                                  RFS10404
542300200615               MOVE GIC-CERTIFICATE-DETAILS-2-REC
542400200615               TO   GIC-CERTIFICATE-DETAILS-3-REC
542500200615               IF ACCOUNT-NO      OF GIC-CERTIFICATE-DETAILS-3-REC =
542600200615                  PASS-ACCOUNT-NO AND
542700200615                  INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-3-REC =
542800200615                  PASS-INVESTMENT-CODE AND
542900200615                  CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC =
543000200615                  PASS-CERTIFICATE-ID-NO
543100200615      * RFS11106 - Begin
543200200615      *                                                          AND    RFS9657
543300200615      *           CERT-STATUS-CODE OF GIC-CERTIFICATE-DETAILS-3-REC     RFS9657
543400200615      *                                               NOT = LT-CLOSE    RFS9657
543500200615      * RFS11106 - End
543600200615                   MOVE "Y"             TO WS-VALID-CERTIFICATE
543700200615               END-IF
543800200615           END-IF.
543900200615      *
544000200615      * RFS11106 - Begin
544100200615      * For valid Certificate -
544200200615      * additional logic to check if the Certificate is closed
544300200615      *
544400200615           IF (VALID-CERTIFICATE AND
544500200615              CERT-STATUS-CODE OF GIC-CERTIFICATE-DETAILS-3-REC         RFS9657
544600200615                                                          = LT-CLOSE)   RFS9657
544700200615              IF ((STMT-INTEREST-MODE           OR                      RFS11106
544800200615137231             ACCOUNT-V2-MODE   OR
544900200615      * 1017021 - Begin
545000200615                  ACCOUNT-V3-MODE   OR
545100200615      * 1017021 - End
545200200615137231            ESTATE-EARLY-REDEMPTION-MODE OR
545300200615                   ESTATE-INTEREST-MODE)       AND
545400200615                 CERTIFICATE-STATUS-DATE OF
545500200615                 GIC-CERTIFICATE-DETAILS-3-REC >= PASS-END-DATE-OPTION) RFS11106
545600200615                  CONTINUE                                              RFS11106
545700200615              ELSE
545800200615137231* RFS 137231 -begin Comment out changes from 12631 below
545900200615      * RFS 12631 BEGIN
546000200615137231*       IF (ESTATE-EARLY-REDEMPTION-MODE AND
546100200615137231*           CERTIFICATE-STATUS-DATE OF
546200200615137231*           GIC-CERTIFICATE-DETAILS-3-REC >= PASS-END-DATE-OPTION)
546300200615137231*           CONTINUE
546400200615137231*       ELSE
546500200615      * RFS 12631 END
546600200615137231* RFS 137231 -end
546700200615                  SET INVALID-CERTIFICATE      TO TRUE
546800200615      * RFS 12631 BEGIN
546900200615137231*       END-IF
547000200615              END-IF
547100200615      * RFS 12631 END
547200200615              END-IF.
547300200615      * RFS11106 - End
547400200615
547500200615       CVC-EXIT.
547600200615           EXIT.
547700200615      /
547800200615       WRITE-ACCOUNT-INVESTMENT.
547900200615
548000200615      ******************************************************************
548100200615      *                                                                *
548200200615      *    W R I T E   A C C O U N T   I N V E S T M E N T             *
548300200615      *                                                                *
548400200615      ******************************************************************
548500200615
548600200615      **** WRITE RECORD FOR GIC AT INVESTMENT LEVEL
548700200615      * RFS12320 - Begin
548800200615           IF ACCOUNT-A1-MODE
548900200615112133      OR ACCOUNT-V1-MODE
549000200615137231      OR ACCOUNT-V2-MODE
549100200615      * 1017021 - Begin
549200200615            OR ACCOUNT-V3-MODE
549300200615      * 1017021 - End
549400200615112133      IF ACCOUNT-A1-MODE
549500200615142159         COMPUTE WS-ACCRUAL-AMT-2 ROUNDED = WS-ACCRUAL-AMT
549600200615               COMPUTE WS-TOTAL-ACCRUAL-AMT ROUNDED =
549700200615142159*                   WS-TOTAL-ACCRUAL-AMT + WS-ACCRUAL-AMT
549800200615142159                    WS-TOTAL-ACCRUAL-AMT + WS-ACCRUAL-AMT-2
549900200615112133      ELSE IF ACCOUNT-V1-MODE
550000200615137231      OR ACCOUNT-V2-MODE
550100200615      * 1017021 - Begin
550200200615            OR ACCOUNT-V3-MODE
550300200615      * 1017021 - End
550400200615112133*        COMPUTE RETN-ACCRUAL-AMT = WS-ACCRUAL-AMT
550500200615140722         COMPUTE RETN-ACCRUAL-AMT ROUNDED = WS-ACCRUAL-AMT
550600200615112133      END-IF
550700200615           ELSE
550800200615      * RFS12320 - End
550900200615           IF (ACCOUNT-MODE) OR (INVESTMENT-MODE)
551000200615               MOVE PASS-ACCOUNT-NO
551100200615               TO ACCOUNT-NO OF GIC-INT-WORKFILE
551200200615
551300200615               MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
551400200615               TO INVESTMENT-CODE OF GIC-INT-WORKFILE
551500200615
551600200615               MOVE ZEROES
551700200615               TO CERTIFICATE-ID-NO OF GIC-INT-WORKFILE
551800200615
551900200615      *        MOVE WS-ACCRUAL-AMT                                      FIX06
552000200615      *        TO ACCRUAL-AMT OF GIC-INT-WORKFILE-REC                   FIX06
552100200615               COMPUTE ACCRUAL-AMT OF GIC-INT-WORKFILE-REC ROUNDED =    FIX06
552200200615                                              WS-ACCRUAL-AMT            FIX06
552300200615
552400200615               IF (GIC-BATCH-MODE)
552500200615                  OR (DII-BATCH-MODE)                                   FIX02
552600200615                   REWRITE GIC-INT-WORKFILE-REC
552700200615               ELSE
552800200615                   WRITE GIC-INT-WORKFILE-REC
552900200615               END-IF
553000200615
553100200615           END-IF.
553200200615
553300200615       WAI-EXIT.
553400200615           EXIT.
553500200615      /
553600200615       WRITE-CERTIFICATE-LEVEL.
553700200615
553800200615      ******************************************************************
553900200615      *                                                                *
554000200615      *    W R I T E   C E R T I F I C A T E   L E V E L               *
554100200615      *                                                                *
554200200615      ******************************************************************
554300200615
554400200615      **** WRITE RECORD FOR GIC AT CERTIFICATE LEVEL
554500200615
554600200615           MOVE PASS-ACCOUNT-NO
554700200615148358*    TO ACCOUNT-NO OF GIC-INT-WORKFILE.
554800200615148358     TO ACCOUNT-NO OF GIC-INT-WORKFILE
554900200615148358        li_AccountNo_GD.
555000200615
555100200615           MOVE PASS-INVESTMENT-CODE
555200200615148358*    TO INVESTMENT-CODE OF GIC-INT-WORKFILE.
555300200615148358     TO INVESTMENT-CODE OF GIC-INT-WORKFILE
555400200615148358        lc_InvestCode_GD.
555500200615
555600200615           MOVE PASS-CERTIFICATE-ID-NO
555700200615148358*    TO CERTIFICATE-ID-NO OF GIC-INT-WORKFILE.
555800200615148358     TO CERTIFICATE-ID-NO OF GIC-INT-WORKFILE
555900200615148358        li_CertNo_GD.
556000200615
556100200615      *    MOVE WS-ACCRUAL-AMT                                          FIX06
556200200615      *    TO ACCRUAL-AMT OF GIC-INT-WORKFILE-REC.                      FIX06
556300200615           COMPUTE ACCRUAL-AMT OF GIC-INT-WORKFILE-REC ROUNDED =        FIX06
556400200615                                          WS-ACCRUAL-AMT                FIX06
556500200615      *RFS150674 Start
556600200615148358*    COMPUTE li_AccrualAmt_GD = WS-ACCRUAL-AMT.
556700200615           COMPUTE li_AccrualAmt_GD ROUNDED = WS-ACCRUAL-AMT.
556800200615      *RFS150674 End
556900200615           IF (GIC-BATCH-MODE)
557000200615              OR (DII-BATCH-MODE)                                       FIX02
557100200615               REWRITE GIC-INT-WORKFILE-REC
557200200615           ELSE
557300200615148358         IF NOT GICDII-BATCH-MODE
557400200615                  WRITE GIC-INT-WORKFILE-REC
557500200615148358         END-IF
557600200615           END-IF.
557700200615      *RFS148358 - Start
557800200615           IF (GICDII-BATCH-MODE)
557900200615              EXEC SQL
558000200615                 INSERT INTO QTEMP/SQGMATINT
558100200615                 VALUES(:li_AccountNo_GD,
558200200615                        :lc_InvestCode_GD,
558300200615                        :li_CertNo_GD,
558400200615                        :li_AccrualAmt_GD)
558500200615              END-EXEC
558600200615           END-IF.
558700200615      *RFS148358 - End
558800200615
558900200615       WCL-EXIT.
559000200615           EXIT.
559100200615      /
559200200615       WRITE-ERROR-REJECTION.
559300200615
559400200615      ******************************************************************
559500200615      *                                                                *
559600200615      *    W R I T E   E R R O R   R E J E C T I O N   R E C O R D     *
559700200615      *                                                                *
559800200615      ******************************************************************
559900200615
560000200615           MOVE PASS-ACCOUNT-NO TO REJ-ACCOUNT-NO.
560100200615
560200200615           IF   PASS-INVESTMENT-CODE NOT EQUAL SPACES
560300200615               MOVE PASS-INVESTMENT-CODE TO REJ-INVESTMENT-CODE
560400200615           ELSE
560500200615               IF INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
560600200615                   NOT EQUAL SPACES
560700200615                   MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
560800200615                   TO REJ-INVESTMENT-CODE
560900200615               ELSE
561000200615                   MOVE SPACES           TO REJ-INVESTMENT-CODE
561100200615               END-IF
561200200615           END-IF.
561300200615
561400200615           IF   PASS-CERTIFICATE-ID-NO NOT EQUAL ZEROES
561500200615               MOVE PASS-CERTIFICATE-ID-NO TO REJ-CERTIFICATE-ID-NO
561600200615           ELSE
561700200615               IF CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-1-REC    RFS8371
561800200615                  IS NOT NUMERIC                                        RFS8371
561900200615                   INITIALIZE CERTIFICATE-ID-NO OF                      RFS8371
562000200615                                        GIC-CERTIFICATE-DETAILS-1-REC   RFS8371
562100200615               END-IF                                                   RFS8371
562200200615               IF CERTIFICATE-ID-NO
562300200615                   OF GIC-CERTIFICATE-DETAILS-1-REC
562400200615                   NOT EQUAL ZEROES
562500200615                   MOVE CERTIFICATE-ID-NO
562600200615                   OF GIC-CERTIFICATE-DETAILS-1-REC
562700200615                   TO REJ-CERTIFICATE-ID-NO
562800200615               ELSE
562900200615                   MOVE ZEROES           TO REJ-CERTIFICATE-ID-NO
563000200615               END-IF
563100200615           END-IF.
563200200615
563300200615           WRITE INTCLC-REJECTION-REC.
563400200615
563500200615       WER-EXIT.
563600200615           EXIT.
563700200615      /
563800200615       START-CERTIFICATE-DETAILS-1.
563900200615
564000200615      ******************************************************************
564100200615      *                                                                *
564200200615      *    S T A R T   C E R T I F I C A T E   D E T A I L S - 1       *
564300200615      *                                                                *
564400200615      ******************************************************************
564500200615
564600200615      **** START GIC-CERTIFICATE-DETAILS-1 ****
564700200615
564800200615           INITIALIZE MFAGICDP OF GIC-CERTIFICATE-DETAILS-1-REC.
564900200615
565000200615           MOVE PASS-ACCOUNT-NO     TO ACCOUNT-NO
565100200615           OF GIC-CERTIFICATE-DETAILS-1-REC.
565200200615
565300200615           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
565400200615           TO INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-1-REC.
565500200615
565600200615           START GIC-CERTIFICATE-DETAILS-1
565700200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
565800200615             INVALID KEY
565900200615             MOVE "20"            TO RETN-RET-CODE
566000200615             MOVE "Info: Certificate not found for Investment "
566100200615                                  TO WS-INV-MSG
566200200615             MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
566300200615                                  TO WS-INV-MSG-INV
566400200615             MOVE WS-INV-MESSAGE  TO RETN-RET-CODE-DESC
566500200615             MOVE "N"             TO WS-VALID-CERTIFICATE
566600200615             IF (BATCH-MODE)
566700200615                 MOVE "G23"         TO REJ-REJECTION-CODE
566800200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
566900200615             END-IF
567000200615             GO TO SCD-EXIT.
567100200615
567200200615      ****   PRIME READ OF GIC-CERTIFICATE-DETAILS-1
567300200615
567400200615             READ GIC-CERTIFICATE-DETAILS-1  NEXT RECORD
567500200615             AT END
567600200615               MOVE "20"            TO RETN-RET-CODE
567700200615               MOVE "Info: Certificate not found for Investment "
567800200615                                    TO WS-INV-MSG
567900200615               MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
568000200615                                    TO WS-INV-MSG-INV
568100200615               MOVE WS-INV-MESSAGE  TO RETN-RET-CODE-DESC
568200200615               MOVE "N"             TO WS-VALID-CERTIFICATE
568300200615             GO TO SCD-EXIT.
568400200615
568500200615           IF (ACCOUNT-NO OF GIC-CERTIFICATE-DETAILS-1-REC NOT EQUAL
568600200615               PASS-ACCOUNT-NO) OR
568700200615              (INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-1-REC
568800200615               NOT EQUAL INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC)
568900200615               MOVE "20"            TO RETN-RET-CODE
569000200615               MOVE "Info: Certificate not found for Investment "
569100200615                                    TO WS-INV-MSG
569200200615               MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
569300200615                                    TO WS-INV-MSG-INV
569400200615               MOVE WS-INV-MESSAGE  TO RETN-RET-CODE-DESC
569500200615               MOVE "N"             TO WS-VALID-CERTIFICATE
569600200615             GO TO SCD-EXIT.
569700200615
569800200615           MOVE "Y"                 TO WS-VALID-CERTIFICATE.
569900200615
570000200615       SCD-EXIT.
570100200615           EXIT.
570200200615      /
570300200615       READ-CERTIFICATE-DETAILS-2.
570400200615
570500200615      ******************************************************************
570600200615      *                                                                *
570700200615      *    R E A D   C E R T I F I C A T E   D E T A I L S -2          *
570800200615      *                                                                *
570900200615      ******************************************************************
571000200615
571100200615      **** READ GIC-CERTIFICATE-DETAILS-2 ****
571200200615
571300200615           INITIALIZE MFAGICDP OF GIC-CERTIFICATE-DETAILS-2-REC.
571400200615
571500200615           MOVE PASS-CERTIFICATE-ID-NO TO CERTIFICATE-ID-NO
571600200615           OF GIC-CERTIFICATE-DETAILS-2-REC.
571700200615
571800200615      ****   READ OF GIC-CERTIFICATE-DETAILS-2
571900200615
572000200615           MOVE "Y"                 TO WS-VALID-CERTIFICATE.
572100200615
572200200615           READ GIC-CERTIFICATE-DETAILS-2
572300200615             INVALID KEY
572400200615                 MOVE "20"            TO RETN-RET-CODE
572500200615                 MOVE "Certificate not found"
572600200615                                      TO RETN-RET-CODE-DESC
572700200615                 MOVE "N"           TO WS-VALID-CERTIFICATE
572800200615                 IF (GIC-BATCH-MODE)
572900200615                     MOVE "G23"       TO REJ-REJECTION-CODE
573000200615                     PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
573100200615                 END-IF
573200200615             GO TO RCD-EXIT.
573300200615
573400200615       RCD-EXIT.
573500200615           EXIT.
573600200615      /
573700200615       START-INVESTMENT-DII-RATES.
573800200615
573900200615      ******************************************************************
574000200615      *                                                                *
574100200615      *    S T A R T   I N V E S T M E N T   D I I   R A T E S         *
574200200615      *                                                                *
574300200615      ******************************************************************
574400200615
574500200615      **** MUST TRY TO GET ACCOUNT-NOMINEE
574600200615
574700200615           INITIALIZE MFAACCNMP OF ACCOUNT-NOMINEE-REC.
574800200615
574900200615           MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT-REC
575000200615           TO   ACCOUNT-NO OF ACCOUNT-NOMINEE-REC.
575100200615
575200200615           READ ACCOUNT-NOMINEE
575300200615            INVALID KEY
575400200615                MOVE SPACES TO NOMINEE-CODE OF ACCOUNT-NOMINEE-REC
575500200615      * RFS10620 - Begin                                                RFS10620
575600200615                          ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE-REC      RFS10620
575700200615      * RFS10620 - End                                                  RFS10620
575800200615           END-READ.
575900200615
576000200615      **** MUST TRY TO GET DII-RATE-SET
576100200615
576200200615           INITIALIZE MFADIIRSP OF DII-RATE-SET-REC.
576300200615
576400200615           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC
576500200615           TO   ACCOUNT-TYPE-CODE OF DII-RATE-SET-REC.
576600200615
576700200615      * RFS10620 - Begin                                                RFS10620
576800200615           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE-REC                RFS10620
576900200615      *    MOVE NOMINEE-CODE      OF ACCOUNT-NOMINEE-REC                RFS10620
577000200615      * RFS10620 - End                                                  RFS10620
577100200615           TO   NOMINEE-ACCOUNT-TYPE OF DII-RATE-SET-REC.
577200200615
577300200615           READ DII-RATE-SET
577400200615            INVALID KEY
577500200615             MOVE "02"                TO RETN-RET-CODE
577600200615             MOVE "DII Rate Set not found"
577700200615             TO RETN-RET-CODE-DESC
577800200615             MOVE "Y"                 TO WS-SKIP-DETAILS
577900200615             IF (BATCH-MODE)
578000200615                 MOVE "G24"           TO REJ-REJECTION-CODE
578100200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
578200200615             END-IF
578300200615             GO TO SDR-EXIT.
578400200615
578500200615      **** MUST START INVESTMENT-DII-RATES ****
578600200615
578700200615           INITIALIZE MFADIIIRP OF INVESTMENT-DII-RATES-REC.
578800200615
578900200615           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
579000200615           TO INVESTMENT-CODE OF INVESTMENT-DII-RATES-REC.
579100200615
579200200615           MOVE DII-SET         OF DII-RATE-SET-REC
579300200615           TO   DII-SET         OF INVESTMENT-DII-RATES-REC
579400200615                WS-DII-SET.
579500200615
579600200615           START INVESTMENT-DII-RATES
579700200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
579800200615             INVALID KEY
579900200615             MOVE "02"                TO RETN-RET-CODE
580000200615             MOVE "No DII Rate Found" TO RETN-RET-CODE-DESC
580100200615             MOVE "Y"                 TO WS-SKIP-DETAILS
580200200615             IF (BATCH-MODE)
580300200615                 MOVE "G24"           TO REJ-REJECTION-CODE
580400200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
580500200615             END-IF
580600200615             GO TO SDR-EXIT.
580700200615
580800200615       SDR-EXIT.
580900200615           EXIT.
581000200615      /
581100200615       START-TRANS-2.
581200200615
581300200615      ******************************************************************
581400200615      *                                                                *
581500200615      *    S T A R T   T R A N S - 2                                   *
581600200615      *                                                                *
581700200615      ******************************************************************
581800200615
581900200615      **** MUST START TRANS ****
582000200615
582100200615           INITIALIZE MFATRNP OF TRANS-2-REC.
582200200615
582300200615           MOVE ACCOUNT-NO      OF ACCOUNT-INVESTMENT-REC
582400200615           TO ACCOUNT-NO        OF TRANS-2-REC.
582500200615
582600200615           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
582700200615           TO INVESTMENT-CODE   OF TRANS-2-REC.
582800200615
582900200615      *RFS185941 Starts
583000200615
583100200615           INITIALIZE li_AccNo, lc_InvCode, ln_CnvCurrBalance,
583200200615                      ln_CnvStartDate.
583300200615
583400200615           MOVE ACCOUNT-NO      OF ACCOUNT-INVESTMENT-REC
583500200615           TO li_AccNo.
583600200615
583700200615           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC
583800200615           TO lc_InvCode.
583900200615
584000200615           SET lb_CnvDiiRecExistsNo TO TRUE.
584100200615
584200200615           EXEC SQL
584300200615              SELECT CURRENT_BALANCE,BALANCE_AS_OF_DATE
584400200615              INTO  :ln_CnvCurrBalance,:ln_CnvStartDate
584500200615              FROM   MFAINTSCDP
584600200615              WHERE  ACCOUNT_NO      = :li_AccNo
584700200615              AND    INVESTMENT_CODE = :lc_InvCode
584800200615           END-EXEC.
584900200615
585000200615           MOVE SQLSTATE TO lc_sqlStates.
585100200615
585200200615           EVALUATE TRUE
585300200615             WHEN lncc_sqlSuccessful
585400200615      * RFS1100976 Starts
585500200615             IF ln_CnvCurrBalance > 0 AND ln_CnvStartDate > 0
585600200615      * RFS1100976 Ends
585700200615                SET lb_CnvDiiRecExistsYes TO TRUE
585800200615      * RFS1100976 Starts
585900200615             END-IF
586000200615      * RFS1100976 Ends
586100200615             WHEN lncc_sqlEnd
586200200615                CONTINUE
586300200615             WHEN OTHER
586400200615                MOVE lncc_ErrCertBalStdt TO lc_sqlErrShortDESCR
586500200615                PERFORM SqlFailProcess
586600200615           END-EVALUATE.
586700200615
586800200615           IF lb_CnvDiiRecExistsYes
586900200615      * RFS1100976 Starts
587000200615      *       MOVE ln_CnvStartDate TO TRADE-DATE OF TRANS-2-REC
587100200615              MOVE ln_CnvStartDate TO ld_StrDt
587200200615              MOVE FUNCTION ADD-DURATION (ld_StrDt DAYS 1)
587300200615                   TO TRADE-DATE OF TRANS-2-REC
587400200615              MOVE "Y" TO lc_FirstTrans
587500200615      * RFS1100976 Ends
587600200622      * RFS1101805 Starts
587700200622              INITIALIZE WS-CNV-STR-DATE
587800200622              MOVE ln_CnvStartDate TO WS-CNV-STR-DATE
587900200622      * RFS1101805 Ends
588000200615           END-IF.
588100200615
588200200615      *RFS185941 Ends
588300200615
588400200615      * RFS1100976 Starts
588500200615           MOVE "N" TO lc_NoTrans
588600200615      * RFS1100976 Ends
588700200615           START TRANS-2
588800200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
588900200615137231       NOT INVALID KEY
589000200615137231          MOVE "Y" TO lc_FirstTrans
589100200615      * RFS1100976 Starts
589200200615      * No Interest will be calculated if Start Date provided in
589300200615      * MFAINTSCDP > Current system date
589400200615                IF lb_CnvDiiRecExistsYes AND ln_CnvStartDate > WS-DATE
589500200615                   MOVE "Y"               TO WS-SKIP-DETAILS
589600200615                END-IF
589700200615      * RFS1100976 Ends
589800200615             INVALID KEY
589900200615      * RFS1100976 Starts
590000200615             IF lb_CnvDiiRecExistsNo
590100200615      * RFS1100976 Ends
590200200615             MOVE "03"              TO RETN-RET-CODE
590300200615             MOVE "No Transactions for this Account / Investment"
590400200615             TO RETN-RET-CODE-DESC
590500200615             IF (BATCH-MODE)
590600200615                 MOVE "G25"         TO REJ-REJECTION-CODE
590700200615                 PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
590800200615             END-IF
590900200615             MOVE "Y"               TO WS-SKIP-DETAILS
591000200615      * RFS1100976 Starts
591100200615             ELSE
591200200615               MOVE "Y"             TO lc_NoTrans
591300200615               IF lb_CnvDiiRecExistsYes AND ln_CnvStartDate > WS-DATE
591400200615                  MOVE "Y"               TO WS-SKIP-DETAILS
591500200615               END-IF
591600200615             END-IF
591700200615      * RFS1100976 Ends
591800200615             GO TO STR-EXIT.
591900200615
592000200615       STR-EXIT.
592100200615           EXIT.
592200200615      /
592300200615      * ---------------------------------
592400200615       UA-SET-SW-TO-CHECK-ADJ.                                          RFS10258
592500200615      * ---------------------------------
592600200615           IF PASS-END-DATE-OPTION >=                                   RFS10258
592700200615                     MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC     RFS10258
592800200615      * start rfs 13301
592900200615              OR MATURITY-SELL-MODE
593000200615      * end   rfs 13301
593100200615               SET SW03-LAST-PERIOD       TO TRUE                       RFS10258
593200200615           ELSE                                                         RFS10258
593300200615               SET SW03-NOT-LAST-PERIOD   TO TRUE                       RFS10258
593400200615           END-IF                                                       RFS10258
593500200615
593600200615           SET SW03-ADJ-NOT-EXIST         TO TRUE.                      RFS10258
593700200615      * ---------------------------------
593800200615      * RFS11367 - Begin
593900200615      *            the paragraph not in use more
594000200615      *
594100200615       UB-GET-INT-CALCULATED.                                           RFS10258
594200200615      * ---------------------------------
594300200615      *    MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
594400200615      *                       TO PASS-ISSUE-DATE
594500200615      *    MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
594600200615      *                       TO PASS-MATURITY-DATE
594700200615      *    MOVE INT-RATE OF GIC-CERTIFICATE-DETAILS-3-REC
594800200615      *                       TO PASS-INTEREST-RATE
594900200615      *    MOVE INT-PAYMENT-OPTION OF GIC-CERTIFICATE-DETAILS-3-REC
595000200615      *                       TO PASS-INTEREST-PAYMENT-OPTION
595100200615      *    MOVE INT-PAYMENT-FREQUENCY OF GIC-CERTIFICATE-DETAILS-3-REC
595200200615      *                       TO PASS-INTEREST-FREQUENCY
595300200615      *
595400200615      *    MOVE INITIAL-AMOUNT OF GIC-CERTIFICATE-DETAILS-3-REC
595500200615      *                       TO PASS-CAPITAL-AMOUNT
595600200615      *
595700200615      *    SET  PASS-ORIG-CALC-NO                 TO TRUE               RFS10563
595800200615      *    INITIALIZE                       PASS-ORIG-ISSUE-DATE        RFS10563
595900200615      *                                     PASS-ORIG-MATURITY-DATE     RFS10563
596000200615      *
596100200615      **** CALL GICCALC AND ACCUMULATE INTEREST
596200200615      *
596300200615      *    PERFORM CALL-GICCALC THRU GIC-EXIT
596400200615      *
596500200615      *    COMPUTE WS-INT-CALCULATED ROUNDED = RETN-TOTAL-INTEREST.
596600200615      *
596700200615      * RFS11367 - End
596800200615      *
596900200615
597000200615      * RFS11592 - Begin
597100200615      * ---------------------------------
597200200615       UC-SET-SW-FOR-CONERT-RECONC.                                     RFS10258
597300200615      * ---------------------------------
597400200615           SET SW04-CONVERT-NOT-EXIST         TO TRUE.                  RFS10258
597500200615      * RFS11592 - End
597600200615
597700200615      * ---------------------------------
597800200615       V-GET-RATE-TERM-GROUP-ALLOWED.                                   RFS8371
597900200615      * ---------------------------------
598000200615           PERFORM VA0-GET-NOMINEE
598100200615      *
598200200615      * The term is need for rate calculation ...
598300200615      *
598400200615           PERFORM CALC-TERM-DAYS-REMAIN                                RFS8371
598500200615
598600200615      * ---------------------------------------------------------------
598700200615      * RFS16609 - Begin: READ from GIC-TERM Table only relevant
598800200615      *                   to current investment information
598900200615      * ---------------------------------------------------------------
599000200615      *
599100200615      * Read all GIC-TERM TABLE
599200200615      *
599300200615      *    MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC    TO         RFS8371
599400200615      *         INVESTMENT-CODE OF GIC-TERM-IDX2-REC                    RFS8371
599500200615      *    INITIALIZE
599600200615      *         INVESTMENT-CODE OF GIC-TERM-IDX2-REC                    RFS8371
599700200615      * ---------------------------------------------------------------
599800200615           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC    TO         RFS8371
599900200615                INVESTMENT-CODE OF GIC-TERM-IDX2-REC                    RFS8371
600000200615      * RFS16609 - End
600100200615           PERFORM X010-START-GIC-TERM-IDX2
600200200615           IF SW00-STS-OK
600300200615               SET SW01-STS-OK     TO TRUE
600400200615               PERFORM VA-NEXT-GIC-TERM
600500200615                     UNTIL SW01-STS-END             OR
600600200615                           SW09-RATE-FOUND
600700200615           END-IF.
600800200615      * ----------------------------------
600900200615       VA0-GET-NOMINEE.                                                  RFS8371
601000200615      * ----------------------------------
601100200615           MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT-REC       TO
601200200615                              ACCOUNT-NO OF ACCOUNT-NOMINEE-REC
601300200615           PERFORM X070-READ-NOMINEE
601400200615           IF NOT SW00-STS-OK
601500200615               INITIALIZE MFAACCNMP OF ACCOUNT-NOMINEE-REC
601600200615           END-IF.
601700200615      * ----------------------------------
601800200615       VA-NEXT-GIC-TERM.
601900200615      * ----------------------------------
602000200615           PERFORM X011-NEXT-GIC-TERM-IDX2
602100200615           IF SW00-STS-OK
602200200615               PERFORM VAB-CHECK-TERM-GIC-RANGE
602300200615               IF SW01-STS-OK
602400200615                   MOVE TERM-CODE OF GIC-TERM-IDX2-REC  TO
602500200615                         TERM-CODE OF GIC-TERM-GRP-CODES-ALW-IDXL-R
602600200615                   INITIALIZE
602700200615                         TERM-GROUP OF GIC-TERM-GRP-CODES-ALW-IDXL-R
602800200615                   PERFORM X030-START-GRP-CODES-ALW
602900200615                   IF SW00-STS-OK
603000200615                       SET SW02-STS-OK           TO TRUE
603100200615                       PERFORM VAF-GET-NEXT-TERM-GROUP-ALW UNTIL
603200200615                               SW02-STS-END      OR
603300200615                               SW09-RATE-FOUND
603400200615                   END-IF
603500200615               END-IF
603600200615           ELSE
603700200615               SET SW01-STS-END                  TO TRUE
603800200615           END-IF.
603900200615      * ---------------------------------
604000200615       VAB-CHECK-TERM-GIC-RANGE.
604100200615      * ---------------------------------
604200200615      * RFS16609 - BEGIN: place back testing for Investment
604300200615      * ------------------------------------------------------------
604400200615      *    IF INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC NOT =           RFS8371
604500200615      *                        INVESTMENT-CODE OF GIC-TERM-IDX2-REC     RFS8371
604600200615      *      SET SW01-STS-END             TO TRUE
604700200615      *    ELSE
604800200615      * ------------------------------------------------------------
604900200615           IF INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC NOT =           RFS8371
605000200615                               INVESTMENT-CODE OF GIC-TERM-IDX2-REC     RFS8371
605100200615             SET SW01-STS-END             TO TRUE
605200200615           ELSE
605300200615      * RFS16609 - End
605400200615             IF PASS-END-DATE-OPTION >=
605500200615                                 FROM-DATE OF GIC-TERM-IDX2-REC AND
605600200615               PASS-END-DATE-OPTION
605700200615                             <= TO-DATE    OF GIC-TERM-IDX2-REC AND
605800200615      * RFS16609 - Begin
605900200615               INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-3-REC =
606000200615               INVESTMENT-CODE OF GIC-TERM-IDX2-REC             AND
606100200615               WS-TERM-DAYS-REMAIN >= TERM-MIN OF GIC-TERM-IDX2-REC AND
606200200615               WS-TERM-DAYS-REMAIN <= TERM-MAX OF GIC-TERM-IDX2-REC
606300200615      * ---------------------------------------------------------------
606400200615      *        TERM-CODE OF GIC-CERTIFICATE-DETAILS-3-REC =
606500200615      *             TERM-CODE OF GIC-TERM-IDX2-REC
606600200615      * ---------------------------------------------------------------
606700200615      * RFS16609 - End
606800200615                 SET SW01-STS-OK              TO TRUE
606900200615             ELSE
607000200615                 SET SW01-STS-RANGE           TO TRUE
607100200615             END-IF.
607200200615      * ---------------------------------
607300200615       VAF-GET-NEXT-TERM-GROUP-ALW.
607400200615      * ---------------------------------
607500200615           PERFORM X031-NEXT-GRP-CODES-ALW                              RFS8371
607600200615      *
607700200615           IF NOT SW00-STS-OK                          OR
607800200615              TERM-CODE OF GIC-TERM-IDX2-REC NOT =
607900200615                         TERM-CODE OF GIC-TERM-GRP-CODES-ALW-IDXL-R
608000200615               SET SW02-STS-END       TO TRUE
608100200615           ELSE
608200200615               PERFORM VAFB-CHECK-ACCOUNT-TYPES
608300200615               IF SW00-STS-OK
608400200615                   PERFORM VAFD-CHECK-TERM-GROUP
608500200615                   IF SW00-STS-OK
608600200615                       PERFORM VAFG-GET-GIC-RATE
608700200615                        IF SW00-STS-OK
608800200615                            SET SW09-RATE-FOUND           TO TRUE
608900200615                            MOVE POSTED-RATE OF GIC-RATES TO
609000200615                                                           WS-BASE-RATE
609100200615                        END-IF.                                         RFS8371
609200200615      *            ELSE                                                 RFS8371
609300200615      *                 INITIALIZE                      WS-BASE-RATE    RFS8371
609400200615      *                 SET SW09-RATE-FOUND          TO TRUE            RFS8371
609500200615      *            END-IF.                                              RFS8371
609600200615      * ---------------------------------
609700200615       VAFB-CHECK-ACCOUNT-TYPES.                                        RFS8371
609800200615      * ---------------------------------
609900200615           MOVE TERM-GROUP OF GIC-TERM-GRP-CODES-ALW-IDXL-R TO
610000200615                        TERM-GROUP    OF GIC-TERM-GROUP-ACCOUNT-TYPES-R
610100200615           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC            TO
610200200615                    ACCOUNT-TYPE-CODE OF GIC-TERM-GROUP-ACCOUNT-TYPES-R
61030020061532982 *    MOVE NOMINEE-CODE OF ACCOUNT-NOMINEE-REC         TO
61040020061532982 *          NOMINEE-ACCOUNT-TYPE OF GIC-TERM-GROUP-ACCOUNT-TYPES-R
61050020061532982      MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE-REC    TO
61060020061532982            NOMINEE-ACCOUNT-TYPE OF GIC-TERM-GROUP-ACCOUNT-TYPES-R
610700200615
610800200615           PERFORM X050-READ-GIC-TERM-GR-ACC-TYPE.                      RFS8371
610900200615      * ---------------------------------
611000200615       VAFD-CHECK-TERM-GROUP.
611100200615      * ---------------------------------
611200200615      *
611300200615      * 1. Use different frequiency code for the long/short terms
611400200615      *
611500200615           PERFORM VAFD10-SET-FREQUENCY
611600200615
611700200615           MOVE TERM-GROUP OF GIC-TERM-GRP-CODES-ALW-IDXL-R TO
611800200615                    TERM-GROUP OF GIC-TERM-GROUP-REC
611900200615           PERFORM X040-READ-GIC-TERM-GROUP
612000200615           IF SW00-STS-OK                                       AND
612100200615              PASS-END-DATE-OPTION >=
612200200615                               FROM-DATE OF GIC-TERM-GROUP-REC  AND
612300200615              PASS-END-DATE-OPTION <=
612400200615                               TO-DATE   OF GIC-TERM-GROUP-REC  AND
612500200615              WS-FREQUENCY          =
612600200615                           INT-FREQUENCY OF GIC-TERM-GROUP-REC
612700200615               CONTINUE
612800200615           ELSE
612900200615               SET SW00-STS-RANGE           TO TRUE
613000200615           END-IF.
613100200615      * ---------------------------------
613200200615       VAFD10-SET-FREQUENCY.                                            RFS8371
613300200615      * ---------------------------------
613400200615           IF WS-TERM-DAYS-REMAIN >= LT-LONG-TERM                       RFS8371
613500200615121668        OR lc_RetnPenaltyMthod = lc_MVA
613600200615               MOVE INT-PAYMENT-FREQUENCY OF
613700200615                        GIC-CERTIFICATE-DETAILS-3-REC
613800200615                                       TO WS-FREQUENCY
613900200615           ELSE
614000200615               MOVE LT-MA              TO WS-FREQUENCY
614100200615           END-IF.
614200200615      * ---------------------------------
614300200615       VAFG-GET-GIC-RATE.                                               RFS8371
614400200615      * ---------------------------------
614500200615           PERFORM VAFG10-SET-GIC-RATE-KEY
614600200615           PERFORM X060-START-GIC-RATE
614700200615           IF SW00-STS-OK
614800200615               PERFORM X062-PRIOR-GIC-RATE
614900200615               IF SW00-STS-OK
615000200615                   PERFORM VAFG20-CHECK-GIC-RATE
615100200615               END-IF
615200200615           ELSE
615300200615               PERFORM X063-READ-LAST-GIC-RATE
615400200615               IF SW00-STS-OK
615500200615                   PERFORM VAFG20-CHECK-GIC-RATE
615600200615               END-IF
615700200615           END-IF.
615800200615      * ---------------------------------
615900200615       VAFG10-SET-GIC-RATE-KEY.
616000200615      * ---------------------------------
616100200615           MOVE TERM-GROUP OF GIC-TERM-GRP-CODES-ALW-IDXL-R TO
616200200615                         TERM-GROUP OF GIC-RATES-REC
616300200615           MOVE TERM-CODE OF GIC-TERM-GRP-CODES-ALW-IDXL-R  TO
616400200615                         TERM-CODE OF GIC-RATES-REC
616500200615           MOVE PASS-END-DATE-OPTION                        TO
616600200615                         UP-TO-DATE OF GIC-RATES-REC.
616700200615      * ---------------------------------
616800200615       VAFG20-CHECK-GIC-RATE.
616900200615      * ---------------------------------
617000200615           IF TERM-GROUP OF GIC-TERM-GRP-CODES-ALW-IDXL-R =
617100200615                     TERM-GROUP OF GIC-RATES-REC            AND
617200200615              TERM-CODE OF GIC-TERM-GRP-CODES-ALW-IDXL-R =
617300200615                     TERM-CODE OF GIC-RATES-REC             AND
617400200615               PASS-END-DATE-OPTION >= UP-TO-DATE OF GIC-RATES-REC
617500200615                SET SW00-STS-OK              TO TRUE
617600200615           ELSE
617700200615                SET SW00-STS-RANGE           TO TRUE
617800200615           END-IF.
617900200615      * ---------------------------------
618000200615       VB-CHECK-FOR-ADJ.                                                RFS10258
618100200615      * ---------------------------------
618200200615           INITIALIZE  MFAGIARDP OF GIC-INT-ADJUST-REASON-DTL-REC
618300200615
618400200615           MOVE PLACEMENT-DATE    OF TRANS-REC   TO
618500200615                PLACEMENT-DATE OF GIC-INT-ADJUST-REASON-DTL-REC
618600200615           MOVE TRANS-NO          OF TRANS-REC   TO
618700200615                TRANS-NO       OF GIC-INT-ADJUST-REASON-DTL-REC
618800200615      * RFS 138307 - begin
618900200615      * Change the READ of SORTED-GTR to GIC-JLA-TMP file.
619000200615      *    MOVE GICERTID       OF SORTED-GTR-REC TO
619100200615           MOVE GICERTID       OF GIC-JLA-TMP-REC TO
619200200615                CERTIFICATE-ID-NO OF GIC-INT-ADJUST-REASON-DTL-REC
619300200615           PERFORM X130-START-GIC-INT-ADJ
619400200615           IF SW00-STS-OK
619500200615               PERFORM X131-NEXT-GIC-INT-ADJ
619600200615               IF SW00-STS-OK
619700200615                   PERFORM VBC-CHECK-GIC-ADJ-RANGE
619800200615               END-IF
619900200615           END-IF.
620000200615      * ---------------------------------
620100200615       VBC-CHECK-GIC-ADJ-RANGE.                                         RFS10258
620200200615      * ---------------------------------
620300200615           IF PLACEMENT-DATE OF TRANS-REC       =
620400200615                PLACEMENT-DATE OF GIC-INT-ADJUST-REASON-DTL-REC    AND
620500200615              TRANS-NO       OF TRANS-REC       =
620600200615                TRANS-NO       OF GIC-INT-ADJUST-REASON-DTL-REC    AND
620700200615      * RFS 138307 - begin
620800200615      * Change the READ of SORTED-GTR to GIC-JLA-TMP file.
620900200615      *       GICERTID       OF SORTED-GTR-REC  =
621000200615              GICERTID       OF GIC-JLA-TMP-REC =
621100200615                CERTIFICATE-ID-NO OF GIC-INT-ADJUST-REASON-DTL-REC
621200200615                  SET SW03-ADJ-EXIST      TO TRUE
621300200615           END-IF.
621400200615      * ---------------------------------
621500200615       VD-PROCESS-DII-ADJUSTMENT.                                        RFS8582
621600200615      * ---------------------------------
621700200615      *
621800200615      * This mode doesn't need transactions from TRANS file
621900200615      *
622000200615           PERFORM VDA-INIT-DATA
622100200615
622200200615           PERFORM VDC-NEXT-DII-RATE UNTIL
622300200615                                     END-OF-IDR
622400200615      *
622500200615      * Calculate interest for the last period
622600200615      *
622700200615           MOVE WS-ADJ-END-DATE      TO WS-CURR-END-DATE
622800200615           PERFORM VDC50-CALC-AMT-INTEREST
622900200615
623000200615      * Return only interest
623100200615           IF WS-TOTAL-DII-NOT-COMPOUND = ZEROES
623200200615               MOVE ZEROES           TO RETN-ACCRUAL-AMT
623300200615           ELSE
623400200615               COMPUTE RETN-ACCRUAL-AMT ROUNDED =
623500200615                       WS-TOTAL-DII-NOT-COMPOUND - PASS-GROSS-AMT
623600200615           END-IF.
623700200615      * ---------------------------------
623800200615       VDA-INIT-DATA.                                                    RFS8582
623900200615      * ---------------------------------
624000200615           INITIALIZE          WS-TOTAL-DAYS
624100200615                               WS-PREV-DAILY-RATE
624200200615                               WS-END-OF-IDR
624300200615
624400200615           SET                 INVALID-IDR TO TRUE
624500200615
624600200615
624700200615           MOVE WS-ADJ-START-DATE        TO WS-CURR-START-DATE
624800200615                                            WS-CURR-END-DATE
624900200615
625000200615           MOVE PASS-GROSS-AMT           TO WS-TOTAL-DII-DOLLARS
625100200615                                            WS-TOTAL-DII-NOT-COMPOUND.
625200200615
625300200615      * ---------------------------------
625400200615       VDC-NEXT-DII-RATE.                                                RFS8582
625500200615      * ---------------------------------
625600200615           PERFORM X101-NEXT-DII-RATE
625700200615           IF NOT SW00-STS-OK
625800200615               SET END-OF-IDR             TO TRUE
625900200615           ELSE
626000200615               PERFORM VDC10-CHECK-DII-RATE
626100200615               IF VALID-IDR        AND
626200200615                  NOT END-OF-IDR
626300200615                   MOVE EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC
626400200615                                                  TO WS-CURR-END-DATE
626500200615      *
626600200615      * Skip records until correct date will be found ...
626700200615      *
626800200615                   IF WS-CURR-END-DATE > WS-CURR-START-DATE
626900200615                       PERFORM VDC50-CALC-AMT-INTEREST
627000200615                       MOVE WS-CURR-END-DATE      TO WS-CURR-START-DATE
627100200615                   END-IF
627200200615                   MOVE DAILY-RATE OF INVESTMENT-DII-RATES-REC
627300200615                                                  TO WS-PREV-DAILY-RATE
627400200615               END-IF
627500200615           END-IF.
627600200615      * ---------------------------------
627700200615       VDC10-CHECK-DII-RATE.                                             RFS8582
627800200615      * ---------------------------------
627900200615      * Once valid record found, do not change VALID-IDR
628000200615      * Continue, until END-OF-IDR
628100200615      *
628200200615           IF INVALID-IDR
628300200615               IF INVESTMENT-CODE OF INVESTMENT-DII-RATES-REC =
628400200615                        INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC   AND
628500200615                  DII-SET OF INVESTMENT-DII-RATES-REC = WS-DII-SET  AND
628600200615                  EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC <=
628700200615                                WS-ADJ-START-DATE               AND
628800200615                  EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC <
628900200615                                WS-ADJ-END-DATE
629000200615                   SET VALID-IDR           TO TRUE
629100200615               END-IF
629200200615           END-IF
629300200615      *
629400200615           IF INVESTMENT-CODE OF INVESTMENT-DII-RATES-REC NOT =
629500200615                    INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC      OR
629600200615              DII-SET OF INVESTMENT-DII-RATES-REC NOT = WS-DII-SET OR
629700200615              EFFECTIV-DATE OF INVESTMENT-DII-RATES-REC >=
629800200615                                WS-ADJ-END-DATE
629900200615               SET END-OF-IDR          TO TRUE
630000200615           END-IF.
630100200615      * ---------------------------------
630200200615       VDC50-CALC-AMT-INTEREST.                                         RFS8371
630300200615      * ---------------------------------
630400200615           MOVE WS-CURR-START-DATE       TO WS-START-DATE
630500200615           MOVE WS-CURR-END-DATE         TO WS-END-DATE
630600200615           PERFORM X110-GET-BETWEEN-DAYS
630700200615      *
630800200615           COMPUTE WS-RANGE-INTEREST-DOLLARS ROUNDED =
630900200615                        WS-PREV-DAILY-RATE     *
631000200615                        WS-TOTAL-DAYS          *
631100200615                        WS-TOTAL-DII-DOLLARS
631200200615
631300200615           COMPUTE WS-TOTAL-DII-DOLLARS =
631400200615                        WS-TOTAL-DII-DOLLARS +
631500200615                        WS-RANGE-INTEREST-DOLLARS.
631600200615      *
631700200615      * Calculate not compund interest (use  GROSS-AMT = Constant)
631800200615      *
631900200615           COMPUTE WS-RANGE-INTEREST-DOLLARS ROUNDED =
632000200615                        WS-PREV-DAILY-RATE     *
632100200615                        WS-TOTAL-DAYS          *
632200200615                        PASS-GROSS-AMT
632300200615
632400200615           COMPUTE WS-TOTAL-DII-NOT-COMPOUND ROUNDED =
632500200615                        WS-TOTAL-DII-NOT-COMPOUND  +
632600200615                        WS-RANGE-INTEREST-DOLLARS.
632700200615      * ---------------------------------
632800200615       VF-GET-DISTR-OPTION-CODE.                                        RFS8582
632900200615      * ---------------------------------
633000200615           INITIALIZE WS-DISTR-OPTION-CODE
633100200615                      MFATRNIDP OF TID-REC
633200200615
633300200615           MOVE WS-PREV-PLACEMENT-DATE-2 TO PLACEMENT-DATE OF TID-REC
633400200615           MOVE WS-PREV-TRANS-NO-2       TO TRANS-NO       OF TID-REC
633500200615
633600200615           PERFORM X120-READ-TRANS-INT-DETAIL
633700200615           IF SW00-STS-OK
633800200615               MOVE DISTR-OPTION-CODE OF TID-REC TO
633900200615                                                WS-DISTR-OPTION-CODE
634000200615           END-IF.
634100200615      * ---------------------------------
634200200615       VH-DII-BALANCE.                                                  RFS10382
634300200615      * ---------------------------------
634400200615      * RFS10382 treat interest transactions with REVERSE-CODE =        RFS10382
634500200615      * DADJ as BUYS.                                                   RFS10382
634600200615           IF WS-START-DATE = WS-PREV-TRADE-DATE-2
634700200615             IF (PURCHASE-TRANSACTION)           OR                     RFS10382
634800200615                (INTEREST-TRANSACTION AND WS-PREV-REV-CODE-2-DADJ)
634900200615               COMPUTE WS-BALANCE = WS-BALANCE + WS-PREV-GROSS-AMT-2
635000200615             ELSE
635100200615               IF (REDEMPTION-TRANSACTION)
635200200615                 COMPUTE WS-BALANCE = WS-BALANCE - WS-PREV-GROSS-AMT-2
635300200615               ELSE
635400200615                 IF (INTEREST-TRANSACTION)                              RFS8582
635500200615                   PERFORM VF-GET-DISTR-OPTION-CODE                     RFS8582
635600200615                   IF WS-DISTR-OPTION-DII-REINVEST          OR          RFS8582
635700200615      *               (WS-PREV-PAYMENT-TYPE-2-SPACE AND                 RFS12054
635800200615                      (WS-PREV-PAYMENT-TYPE-2-REINV AND                 RFS12054
635900200615                                             WS-DISTR-OPTION-DII-R)     RFS8582
636000200615                     COMPUTE WS-BALANCE =                               RFS8582
636100200615                                    WS-BALANCE + WS-PREV-GROSS-AMT-2    RFS8582
636200200615                   END-IF                                               RFS8582
636300200615                   COMPUTE WS-TEMP-AMT ROUNDED = WS-TOTAL-DII-DOLLARS   RFS9603
636400200615                   COMPUTE WS-TOTAL-DII-DOLLARS ROUNDED =               RFS9603
636500200615                                 WS-TEMP-AMT - WS-PREV-GROSS-AMT-2.     RFS9603
636600200615      * RFS11324 - Begin
636700200615      * ---------------------------------
636800200615       VI-GET-NEXT-ANNIV-DATE.
636900200615      * ---------------------------------
637000200615           INITIALIZE WS-NEXT-ANNIV-DATE
637100200615      *
637200200615           IF FIRST-PAYMENT-DATE OF GIC-CERTIFICATE-DETAILS-3-REC > 0
637300200615               MOVE FIRST-PAYMENT-DATE OF
637400200615                  GIC-CERTIFICATE-DETAILS-3-REC TO WS-NEXT-ANNIV-DATE
637500200615               PERFORM UNTIL WS-NEXT-ANNIV-DATE >=
637600200615                    MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC OR
637700200615                    WS-NEXT-ANNIV-DATE          >= PASS-END-DATE-OPTION
637800200615                 ADD 1           TO WS-NEXT-ANNIV-CCYY
637900200615               END-PERFORM
638000200615               PERFORM VIA-CHECK-FOR-LEAP
638100200615               IF WS-NEXT-ANNIV-DATE >
638200200615                     MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
638300200615                 MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC TO
638400200615                                       WS-NEXT-ANNIV-DATE
638500200615               END-IF
638600200615           END-IF.
638700200615      * ---------------------------------
638800200615       VIA-CHECK-FOR-LEAP.
638900200615      * ---------------------------------
639000200615           IF WS-NEXT-ANNIV-MMDD      = LT-LEAP-MMDD
639100200615               MOVE WS-NEXT-ANNIV-DATE   TO WS-DATE-BUFFER
639200200615               PERFORM VIA10-CALL-LEAP
639300200615               IF NOT IS-LEAP-YEAR
639400200615                   MOVE LT-0228          TO WS-NEXT-ANNIV-MMDD
639500200615               END-IF
639600200615           END-IF.
639700200615      * ---------------------------------
639800200615       VIA10-CALL-LEAP.
639900200615      * ---------------------------------
640000200615           MOVE WS-DATE-BUFFER-YYYY
640100200615                                    TO DLP-YEAR
640200200615           CALL "DRLEAP" USING DR-LEAP-PARMS.
640300200615      * ---------------------------------
640400200615      * RFS11324 - End
640500200615      * ---------------------------------
640600200615      *
640700200615      * RFS11367 - Begin
640800200615      *
640900200615      * ---------------------------------
641000200615       VK-GET-INT-CALCULATED-MAIN.
641100200615      * ---------------------------------
641200200615           IF (PURCHASE-TRANSACTION     OR
641300200615               REDEMPTION-TRANSACTION   OR
641400200615               (INTEREST-TRANSACTION AND
641500200615                 INT-PAYMENT-OPTION OF GIC-CERTIFICATE-DETAILS-3-REC =
641600200615                                       LT-COMPOUND ) )
641700200615                    PERFORM VKA-GET-INT-CALCULATED
641800200615      * RFS 138307 - begin
641900200615      * Change the READ of SORTED-GTR to GIC-JLA-TMP file.
642000200615      *             MOVE TRTRADEDT OF SORTED-GTR-REC TO
642100200615                    MOVE TRTRADEDT OF GIC-JLA-TMP-REC TO
642200200615                                                 WS-PREV-TRADE-DATE-3
642300200615
642400200615      * RFS185941 Starts
642500200615              IF ln_CnvStartDate > 0 and ln_CnvCurrBalance > 0
642600200615                 AND TRTYPE OF GIC-JLA-TMP-REC = "OPN"
642700200615                 MOVE ln_CnvStartDate TO WS-PREV-TRADE-DATE-3
642800200615              END-IF
642900200615      * RFS185941 Ends
643000200615
643100200615           END-IF.
643200200615      * ---------------------------------
643300200615       VKA-GET-INT-CALCULATED.
643400200615      * ---------------------------------
643500200615           MOVE WS-PREV-TRADE-DATE-3   TO PASS-ISSUE-DATE
643600200615      *
643700200615      * RFS 138307 - begin
643800200615      * Change the READ of SORTED-GTR to GIC-JLA-TMP file.
643900200615      *    MOVE TRTRADEDT OF SORTED-GTR-REC
644000200615           MOVE TRTRADEDT OF GIC-JLA-TMP-REC
644100200615                                       TO PASS-MATURITY-DATE
644200200615           MOVE INT-RATE OF GIC-CERTIFICATE-DETAILS-3-REC
644300200615                                       TO PASS-INTEREST-RATE
644400200615           MOVE INT-PAYMENT-OPTION OF GIC-CERTIFICATE-DETAILS-3-REC
644500200615                                       TO PASS-INTEREST-PAYMENT-OPTION
644600200615           MOVE INT-PAYMENT-FREQUENCY OF GIC-CERTIFICATE-DETAILS-3-REC
644700200615                                       TO PASS-INTEREST-FREQUENCY
644800200615           MOVE WS-GIC-BALANCE         TO PASS-CAPITAL-AMOUNT
644900200615           SET  PASS-ORIG-CALC-YES     TO TRUE
645000200615           MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
645100200615                                       TO PASS-ORIG-ISSUE-DATE
645200200615      * RFS143882 Starts
645300200615           IF lb_TransferInKindYes AND
645400200615              li_OriginalIssueDate > 0
645500200615                 MOVE li_OriginalIssueDate TO
645600200615                  PASS-ORIG-ISSUE-DATE
645700200615           END-IF
645800200615      * RFS143882 Ends
645900200615           MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
646000200615                                       TO PASS-ORIG-MATURITY-DATE
646100200615      *
646200200615           PERFORM CALL-GICCALC THRU GIC-EXIT
646300200615
646400200615           PERFORM VKAZ-CALC-INT-CALCULATED.
646500200615      * ---------------------------------
646600200615       VKAZ-CALC-INT-CALCULATED.
646700200615      * ---------------------------------
646800200615           COMPUTE WS-INT-CALCULATED       =
646900200615                       WS-INT-CALCULATED + (RETN-TOTAL-INTEREST).
647000200615      * ---------------------------------
647100200615       VL-LAST-GET-INT-CALC-MAIN.
647200200615      * ---------------------------------
647300200615           PERFORM VLA-LAST-GET-INT-CALC.
647400200615      * ---------------------------------
647500200615       VLA-LAST-GET-INT-CALC.
647600200615      * ---------------------------------
647700200615           MOVE WS-PREV-TRADE-DATE-3    TO PASS-ISSUE-DATE
647800200615      *
647900200615           IF (BATCH-MODE)
648000200615             MOVE NEXT-PAYMENT-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
648100200615                                        TO PASS-MATURITY-DATE
648200200615           ELSE
648300200615             MOVE WS-DATE               TO PASS-MATURITY-DATE
648400200615           END-IF
648500200615
648600200615           IF (EARLY-REDEMPTION-MODE)
648700200615             MOVE PASS-END-DATE-OPTION  TO PASS-MATURITY-DATE
648800200615           END-IF
648900200615
649000200615           IF (UNTIL-MATURITY-MODE)
649100200615             MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
649200200615                                        TO PASS-MATURITY-DATE
649300200615           END-IF
649400200615           MOVE INT-RATE OF GIC-CERTIFICATE-DETAILS-3-REC
649500200615                                        TO PASS-INTEREST-RATE
649600200615           MOVE INT-PAYMENT-OPTION OF GIC-CERTIFICATE-DETAILS-3-REC
649700200615                                        TO PASS-INTEREST-PAYMENT-OPTION
649800200615           MOVE INT-PAYMENT-FREQUENCY OF GIC-CERTIFICATE-DETAILS-3-REC
649900200615                                        TO PASS-INTEREST-FREQUENCY
650000200615           MOVE WS-GIC-BALANCE          TO PASS-CAPITAL-AMOUNT
650100200615           SET  PASS-ORIG-CALC-YES      TO TRUE
650200200615      * RFS143882 Starts
650300200615           Initialize PASS-ACCOUNTNO
650400200615                      PASS-INVESTMENTCO
650500200615                      PASS-CERTIFICATEID
650600200615                      PASS-INCLUDE-GIC-ADJ
650700200615           IF MATURITY-SELL-MODE
650800200615             PERFORM CHECK-GIC-ADJ
650900200615             IF li_IntAdjAmt NOT = 0
651000200615               SET  PASS-LAST-PERIOD        TO TRUE
651100200615               MOVE ACCOUNT-NO OF GIC-CERTIFICATE-DETAILS-3-REC
651200200615                 TO PASS-ACCOUNTNO
651300200615               MOVE INVESTMENT-CODE OF GIC-CERTIFICATE-DETAILS-3-REC
651400200615                 TO PASS-INVESTMENTCO
651500200615               MOVE CERTIFICATE-ID-NO OF
651600200615                    GIC-CERTIFICATE-DETAILS-3-REC
651700200615                 TO PASS-CERTIFICATEID
651800200615               MOVE "Y" TO PASS-INCLUDE-GIC-ADJ
651900200615             END-IF
652000200615           END-IF
652100200615      * RFS143882 Ends
652200200615141855* Accrual interest projection on last period calculation only for
652300200615141855* componded interest.
652400200615141855     IF INT-PAYMENT-OPTION
652500200615141855        OF GIC-CERTIFICATE-DETAILS-3-REC = "A"
652600200615141057        SET  PASS-LAST-PERIOD        TO TRUE
652700200615141855       IF WS-PREV-TRANS-TYPE-CODE-1 = "INT"
652800200615141855          MOVE 0 TO RETN-TOTAL-INTEREST
652900200615141855        ELSE
653000200615142623*141057          MOVE WS-INT-CALCULATED       TO RETN-TOTAL-INTEREST
653100200615142623          MOVE WS-ACCRUAL-AMT-PER-GRP  TO RETN-TOTAL-INTEREST
653200200615141855       END-IF
653300200615141855     END-IF
653400200615           MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
653500200615                                        TO PASS-ORIG-ISSUE-DATE
653600200615      * RFS143882 Starts
653700200615           IF lb_TransferInKindYes AND
653800200615              li_OriginalIssueDate > 0
653900200615                 MOVE li_OriginalIssueDate TO
654000200615                  PASS-ORIG-ISSUE-DATE
654100200615           END-IF
654200200615      * RFS143882 Ends
654300200615           MOVE MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
654400200615                                        TO PASS-ORIG-MATURITY-DATE
654500200615
654600200615           PERFORM CALL-GICCALC THRU GIC-EXIT
654700200615
654800200615           PERFORM VKAZ-CALC-INT-CALCULATED.
654900200615      *
655000200615      * RFS11367 - End
655100200615      *
655200200615      * ---------------------------------
655300200615       X010-START-GIC-TERM-IDX2.                                        RFS8371
655400200615      * ---------------------------------
655500200615           SET SW00-STS-OK                  TO TRUE
655600200615      *
655700200615           START GIC-TERM-IDX2
655800200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
655900200615               INVALID KEY
656000200615                 SET SW00-STS-START         TO TRUE
656100200615           END-START.
656200200615      * ---------------------------------
656300200615       X011-NEXT-GIC-TERM-IDX2.                                         RFS8371
656400200615      * ---------------------------------
656500200615           SET SW00-STS-OK                  TO TRUE
656600200615      *
656700200615           READ GIC-TERM-IDX2 NEXT
656800200615             AT END
656900200615               SET SW00-STS-END           TO TRUE
657000200615           END-READ.
657100200615      * ---------------------------------
657200200615       X020-CALL-TERM.                                                  RFS8371
657300200615      * ---------------------------------
657400200615           CALL "DRTRMDT" USING     DR-TRMDT-PARMS.                     RFS8371
657500200615      * ---------------------------------
657600200615       X030-START-GRP-CODES-ALW .                                       RFS8371
657700200615      * ---------------------------------
657800200615           SET SW00-STS-OK                  TO TRUE
657900200615      *
658000200615           START GIC-TERM-GRP-CODES-ALW-IDXL
658100200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
658200200615               INVALID KEY
658300200615                 SET SW00-STS-START         TO TRUE
658400200615           END-START.
658500200615      * ---------------------------------
658600200615       X031-NEXT-GRP-CODES-ALW.                                         RFS8371
658700200615      * ---------------------------------
658800200615           SET SW00-STS-OK                  TO TRUE
658900200615      *
659000200615           READ GIC-TERM-GRP-CODES-ALW-IDXL NEXT
659100200615             AT END
659200200615               SET SW00-STS-END           TO TRUE
659300200615           END-READ.
659400200615      * ---------------------------------
659500200615       X040-READ-GIC-TERM-GROUP.                                        RFS8371
659600200615      * ---------------------------------
659700200615           SET SW00-STS-OK                  TO TRUE
659800200615      *
659900200615           READ GIC-TERM-GROUP
660000200615             KEY IS EXTERNALLY-DESCRIBED-KEY
660100200615               INVALID KEY
660200200615                 SET SW00-STS-READ          TO TRUE
660300200615           END-READ.
660400200615      * ---------------------------------
660500200615       X050-READ-GIC-TERM-GR-ACC-TYPE.                                  RFS8371
660600200615      * ---------------------------------
660700200615           SET SW00-STS-OK                  TO TRUE
660800200615      *
660900200615           READ GIC-TERM-GROUP-ACCOUNT-TYPES
661000200615             KEY IS EXTERNALLY-DESCRIBED-KEY
661100200615               INVALID KEY
661200200615                 SET SW00-STS-READ          TO TRUE
661300200615           END-READ.
661400200615      * ---------------------------------
661500200615       X060-START-GIC-RATE.
661600200615      * ---------------------------------
661700200615           SET SW00-STS-OK                  TO TRUE
661800200615      *
661900200615           START GIC-RATES
662000200615             KEY IS > EXTERNALLY-DESCRIBED-KEY
662100200615               INVALID KEY
662200200615                 SET SW00-STS-START         TO TRUE
662300200615           END-START.
662400200615      * ---------------------------------
662500200615       X061-NEXT-GIC-RATE.
662600200615      * ---------------------------------
662700200615           SET SW00-STS-OK                  TO TRUE
662800200615      *
662900200615           READ GIC-RATES NEXT
663000200615             AT END
663100200615               SET SW00-STS-END             TO TRUE
663200200615           END-READ.
663300200615      * ---------------------------------
663400200615       X062-PRIOR-GIC-RATE.
663500200615      * ---------------------------------
663600200615           SET SW00-STS-OK                  TO TRUE
663700200615      *
663800200615           READ GIC-RATES PRIOR
663900200615             AT END
664000200615               SET SW00-STS-END             TO TRUE
664100200615           END-READ.
664200200615      * ----------------------------------
664300200615       X063-READ-LAST-GIC-RATE.
664400200615      * ----------------------------------
664500200615           SET SW00-STS-OK                  TO TRUE
664600200615      *
664700200615           READ GIC-RATES LAST
664800200615             AT END
664900200615               SET SW00-STS-END             TO TRUE
665000200615           END-READ.
665100200615      * ----------------------------------
665200200615       X070-READ-NOMINEE.
665300200615      * ----------------------------------
665400200615           SET SW00-STS-OK                  TO TRUE
665500200615      *
665600200615           READ ACCOUNT-NOMINEE
665700200615             INVALID KEY
665800200615               SET SW00-STS-READ            TO TRUE
665900200615           END-READ.
666000200615      * ----------------------------------
666100200615       X080-READ-TRANS.                                                  RFS8582
666200200615      * ----------------------------------
666300200615           SET SW00-STS-OK          TO TRUE
666400200615
666500200615           READ TRANS
666600200615                              KEY IS EXTERNALLY-DESCRIBED-KEY
666700200615             INVALID KEY
666800200615              SET SW00-STS-READ     TO TRUE
666900200615           END-READ.
667000200615      * ----------------------------------
667100200615       X090-READ-TRANS-INTEREST.                                         RFS8582
667200200615      * ----------------------------------
667300200615           SET SW00-STS-OK          TO TRUE
667400200615
667500200615           READ TRANS-INTEREST-DETAILS
667600200615                              KEY IS EXTERNALLY-DESCRIBED-KEY
667700200615             INVALID KEY
667800200615              SET SW00-STS-READ     TO TRUE
667900200615           END-READ.
668000200615      * ---------------------------------
668100200615       X101-NEXT-DII-RATE.                                              RFS8582
668200200615      * ---------------------------------
668300200615           SET SW00-STS-OK          TO TRUE
668400200615
668500200615           READ INVESTMENT-DII-RATES NEXT
668600200615             AT END
668700200615              SET SW00-STS-END      TO TRUE
668800200615           END-READ.
668900200615      * ---------------------------------
669000200615       X110-GET-BETWEEN-DAYS.
669100200615      * ---------------------------------
669200200615           MOVE WS-START-DATE       TO DGP-GREGORIAN
669300200615           CALL "DRG2J" USING       DR-G2J-PARMS
669400200615           MOVE DGP-JULIAN          TO WS-JULIAN-START-DATE
669500200615
669600200615           MOVE WS-END-DATE         TO DGP-GREGORIAN
669700200615           CALL "DRG2J" USING       DR-G2J-PARMS
669800200615           MOVE DGP-JULIAN          TO WS-JULIAN-END-DATE
669900200615
670000200615           IF WS-END-DATE < WS-START-DATE
670100200615               MOVE ZEROES          TO WS-TOTAL-DAYS
670200200615           ELSE
670300200615               COMPUTE WS-TOTAL-DAYS =
670400200615                            WS-JULIAN-END-DATE - WS-JULIAN-START-DATE
670500200615           END-IF.
670600200615      * ---------------------------------
670700200615       X120-READ-TRANS-INT-DETAIL.                                      RFS8582
670800200615      * ---------------------------------
670900200615           SET SW00-STS-OK          TO TRUE
671000200615
671100200615           READ TRANS-INTEREST-DETAILS
671200200615            INVALID KEY
671300200615              SET SW00-STS-READ     TO TRUE
671400200615           END-READ.
671500200615      * ---------------------------------
671600200615       X130-START-GIC-INT-ADJ.                                          RFS10258
671700200615      * ---------------------------------
671800200615           SET SW00-STS-OK          TO TRUE
671900200615
672000200615           START GIC-INT-ADJUST-REASON-DTL-IDX2
672100200615             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
672200200615              INVALID KEY
672300200615                SET SW00-STS-START           TO TRUE
672400200615           END-START.
672500200615      * ---------------------------------
672600200615       X131-NEXT-GIC-INT-ADJ.                                           RFS10258
672700200615      * ---------------------------------
672800200615           SET SW00-STS-OK          TO TRUE
672900200615
673000200615           READ GIC-INT-ADJUST-REASON-DTL-IDX2 NEXT
673100200615              AT END
673200200615                SET SW00-STS-END             TO TRUE
673300200615           END-READ.
673400200615      * ---------------------------------
673500200615       XB-GET-CHECK-DII-ADJUSTMENT.                                     RFS8582
673600200615      * ---------------------------------
673700200615           PERFORM XBA-CHECK-PARM-DATA
673800200615           IF CURR-CONTROLS NOT = HIGH-VALUE
673900200615               PERFORM XB70-FILL-LNK-AND-CURR-DATA.
674000200615      * ---------------------------------
674100200615       XBA-CHECK-PARM-DATA.                                             RFS8582
674200200615      * ---------------------------------
674300200615           PERFORM XBA10-CHECK-START-DATE
674400200615           IF CURR-CONTROLS NOT = HIGH-VALUE
674500200615               PERFORM XBA20-CHECK-END-DATE
674600200615               IF CURR-CONTROLS NOT = HIGH-VALUE
674700200615                   PERFORM XBA30-CHECK-GROSS-AMT
674800200615                   IF CURR-CONTROLS NOT = HIGH-VALUE
674900200615                       PERFORM XBA40-CHECK-ACCOUNT.
675000200615      * ---------------------------------
675100200615       XBA10-CHECK-START-DATE.
675200200615      * ---------------------------------
675300200615           IF LDS-PASS-START-DATE IS NOT NUMERIC
675400200615               MOVE HIGH-VALUES          TO CURR-CONTROLS
675500200615               MOVE "Y"                  TO WS-EXIT-PROGRAM
675600200615               MOVE "D1"                 TO RETN-RET-CODE
675700200615               MOVE "Start Date Ts not numeric"
675800200615                                         TO RETN-RET-CODE-DESC
675900200615           END-IF.
676000200615      * ---------------------------------
676100200615       XBA20-CHECK-END-DATE.                                            RFS8582
676200200615      * ---------------------------------
676300200615           IF LDS-PASS-END-DATE       IS NOT NUMERIC
676400200615               MOVE HIGH-VALUES          TO CURR-CONTROLS
676500200615               MOVE "Y"                  TO WS-EXIT-PROGRAM
676600200615               MOVE "D2"                 TO RETN-RET-CODE
676700200615               MOVE "End Date is not numeric"
676800200615                                         TO RETN-RET-CODE-DESC
676900200615           END-IF.
677000200615      * ---------------------------------
677100200615       XBA30-CHECK-GROSS-AMT.                                           RFS8582
677200200615      * ---------------------------------
677300200615           IF LDS-PASS-GROSS-AMT      IS NOT NUMERIC
677400200615               MOVE HIGH-VALUES          TO CURR-CONTROLS
677500200615               MOVE "Y"                  TO WS-EXIT-PROGRAM
677600200615               MOVE "D3"                 TO RETN-RET-CODE
677700200615               MOVE "Gross ammount is not numeric"
677800200615                                         TO RETN-RET-CODE-DESC
677900200615           END-IF.
678000200615      * ---------------------------------
678100200615       XBA40-CHECK-ACCOUNT.
678200200615      * ---------------------------------
678300200615           IF LDS-PASS-ACCOUNT-NO     IS NOT NUMERIC
678400200615               MOVE HIGH-VALUES          TO CURR-CONTROLS
678500200615               MOVE "Y"                  TO WS-EXIT-PROGRAM
678600200615               MOVE "D4"                 TO RETN-RET-CODE
678700200615               MOVE "Account number is not numeric"
678800200615                                         TO RETN-RET-CODE-DESC
678900200615           END-IF.
679000200615      * ---------------------------------
679100200615       XB70-FILL-LNK-AND-CURR-DATA.
679200200615      * ---------------------------------
679300200615           INITIALIZE PASS-CERTIFICATE-ID-NO
679400200615
679500200615           MOVE LDS-PASS-START-DATE           TO WS-ADJ-START-DATE
679600200615           MOVE LDS-PASS-END-DATE             TO WS-ADJ-END-DATE
679700200615                                                 PASS-END-DATE-OPTION
679800200615           MOVE LDS-PASS-GROSS-AMT            TO PASS-GROSS-AMT
679900200615
680000200615           MOVE LDS-PASS-ACCOUNT-NO           TO PASS-ACCOUNT-NO
680100200615           MOVE LDS-PASS-INVESTMENT-CODE      TO PASS-INVESTMENT-CODE.
680200200615      * ---------------------------------
680300200615       XW010-ERR-RATE.                                                  RFS8371
680400200615      * ---------------------------------
680500200615           MOVE HIGH-VALUES              TO CURR-CONTROLS               RFS8371
680600200615           MOVE "22"                     TO RETN-RET-CODE               RFS8371
680700200615           MOVE                                  "Missing information.  RFS8371
680800200615      -    "Replacement amount cannot be calculated."                   RFS8371
680900200615                                         TO RETN-RET-CODE-DESC.         RFS8371
681000200615      * ---------------------------------
681100200615       XW020-ERR-PENALTY-RATE.
681200200615      * ---------------------------------
681300200615           MOVE HIGH-VALUES              TO CURR-CONTROLS               RFS8371
681400200615           MOVE "23"                     TO RETN-RET-CODE               RFS8371
681500200615           STRING
681600200615            "Not valid penalty rate for the term group, code "          RFS8371
681700200615            TERM-GROUP OF GIC-TERM-GRP-CODES-ALW-IDXL-R
681800200615            " "
681900200615            TERM-CODE OF GIC-TERM-GRP-CODES-ALW-IDXL-R
682000200615             DELIMITED BY SIZE                                          RFS8371
682100200615                 INTO RETN-RET-CODE-DESC                                RFS8371
682200200615           END-STRING.
682300200615      * RFS11324 - Begin
682400200615      * ---------------------------------
682500200615       PRE-END-JOB.
682600200615      * ---------------------------------
682700200615           IF SW11-NEXT-ANNIV-EXISTS
682800200615               MOVE WS-NEXT-ANNIV-DATE      TO PASS-END-DATE-OPTION     RFS9029
682900200615           END-IF.
683000200615
683100200615      * RFS12320 - Begin
683200200615           IF ACCOUNT-A1-MODE
683300200615               COMPUTE RETN-ACCRUAL-AMT ROUNDED = WS-TOTAL-ACCRUAL-AMT
683400200615           END-IF.
683500200615      * RFS12320 - End
683600200615
683700200615      * RFS11324 - End
683800200615      * ---------------------------------
683900200615       END-JOB.
684000200615
684100200615      ******************************************************************
684200200615      *                                                                *
684300200615      *    E N D   J O B   L O G I C   R O U T I N E                   *
684400200615      *                                                                *
684500200615      ******************************************************************
684600200615
684700200615137231*R14153     IF STMT-INTEREST-MODE
684800200615      * 1017021 - Begin
684900200615137231*     IF (STMT-INTEREST-MODE OR ACCOUNT-V2-MODE)
685000200615            IF (STMT-INTEREST-MODE OR ACCOUNT-V2-MODE
685100200615            OR ACCOUNT-V3-MODE)
685200200615      * 1017021 - End
685300200615  ¦        AND WS-OPEN-FILE        IS EQUAL TO "Y"
685400200615  v            GO TO  EOJ-0010
685500200615R14153     END-IF.
685600200615
685700200615           CLOSE INVESTMENT-DII-RATES
685800200615      *          ACCOUNT-TYPE
685900200615                 ACCOUNT-NOMINEE
686000200615                 DII-RATE-SET
686100200615                 TRANS-INTEREST-DETAILS
686200200615                 PAYMENT-TYPE-CODES
686300200615                 INVESTMENT
686400200615                 PRODUCT-TYPE-CODES
686500200615                 ACCOUNT-INVESTMENT
686600200615                 ACCOUNT
686700200615                 GIC-CERTIFICATE-DETAILS-1
686800200615                 GIC-CERTIFICATE-DETAILS-2
686900200615                 TRANS
687000200615                 TRANS-2
687100200615                 GIC-TERM
687200200615                 GIC-TERM-IDX2                                          RFS8371
687300200615                 GIC-TERM-GRP-CODES-ALW-IDXL                            RFS8371
687400200615                 GIC-TERM-GROUP                                         RFS8371
687500200615                 GIC-TERM-GROUP-ACCOUNT-TYPES
687600200615                 GIC-PENALTY-RATE-SCHEDULE
687700200615138276           INVESTOR
687800200615138276           ACCOUNT-GROUP
687900200615                 GIC-INT-ADJUST-REASON-DTL-IDX2.                        RFS10258
688000200615
688100200615R14153 EOJ-0010.
688200200615
688300200615           IF NOT ACCOUNT-A1-MODE                                       RFS12320
688400200615112133      AND NOT ACCOUNT-V1-MODE
688500200615137231      AND NOT ACCOUNT-V2-MODE
688600200615      * 1017021 - Begin
688700200615            AND NOT ACCOUNT-V3-MODE
688800200615      * 1017021 - End
688900200615            IF (BATCH-MODE) OR (ONLINE-MODE)
689000200615               CLOSE GIC-INT-WORKFILE
689100200615            END-IF
689200200615           END-IF                                                       RFS12320
689300200615
689400200615           IF (BATCH-MODE)
689500200615               CLOSE INTCLC-REJECTION
689600200615           END-IF.
689700200615
689800200615           IF RETN-RETURN-CODE = "32"
689900200615               MOVE "00"   TO RETN-RET-CODE
690000200615               MOVE "Successful Call to INTCLC"
690100200615               TO RETN-RET-CODE-DESC
690200200615           END-IF.
690300200615
690400200615       EOJ-EXIT.
690500200615           EXIT.
690600200615
690700200615      * ---------------------------------
690800200615R14153***** The following is a copy of READ-TRANS-FILE subroutine, but
690900200615R14153***** some lines related with GICTRNJOIN were commented out for
691000200615R14153***** Statement/Confirm runs.
691100200615R14153/
691200200615       READ-TRANS-FILE-2.
691300200615
691400200615      ******************************************************************
691500200615      *                                                                *
691600200615      *    R E A D   T R A N S   F I L E                               *
691700200615      *                                                                *
691800200615      ******************************************************************
691900200615
692000201203      * RFS1107791 - Start
692100201203           MOVE ZEROS TO li_retnInt
692200201203           MOVE ZEROS TO li_retnIntTot
692300201203           MOVE ZEROS TO li_reinvestIntAmt
692400201203      * RFS1107791 - End
692500200615           MOVE ZEROES
692600200615           TO WS-GIC-BALANCE.
692700200615
692800200615           MOVE ZEROES                   TO WS-GIC-BAL-FOR-THE-DATE     RFS9029
692900200615           SET SW10-CHK-START-BAL-NOT    TO TRUE                        RFS9029
693000200615137833     SET lb_TransferInKindNo       TO TRUE
693100200615137833     MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
693200200615137833     TO   li_CertIDNo.
693300200615
693400200615      * RFS 138307 - begin
693500200615      * Change the READ of SORTED-GTR to GIC-JLA-TMP file.
693600200615000923
693700200615ptest3*    MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
693800200615000923*    TO   WS-GICTRNJOIN-CERTIFICATE.
693900200615000923*    MOVE "O"                 TO WS-GICTRNJOIN-MODE.
694000200615ptest3*    CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
694100200615ptest3*                            WS-GICTRNJOIN-CERTIFICATE.
694200200615ptest3*    OPEN INPUT SORTED-GTR.
694300200615000923
694400200615000925**** PRIME READ OF SORTED-GTR
694500200615000925*
694600200615ptest5*    INITIALIZE MFAGICJLA OF SORTED-GTR-REC.
6947002006150 0925*
6948002006150 0925*    MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
694900200615000925*    TO   GICERTID OF SORTED-GTR-REC.
695000200615000925
695100200615000925*    START SORTED-GTR
695200200615000925*      KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
695300200615000925*      INVALID KEY
695400200615000925*      MOVE "N"               TO WS-VALID-CERTIFICATE
695500200615000925*      MOVE "14"              TO RETN-RET-CODE
695600200615000925*      MOVE "No GIC transaction relationship record"
695700200615000925*      TO RETN-RET-CODE-DESC
695800200615000925*      MOVE HIGH-VALUES       TO CURR-CONTROLS
695900200615000925*      IF (BATCH-MODE)
696000200615000925*          MOVE "G18"         TO REJ-REJECTION-CODE
696100200615000925*          PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
696200200615000925*      END-IF
696300200615000925*      MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
696400200615000925*      TO   WS-GICTRNJOIN-CERTIFICATE
696500200615000925*      MOVE "Z"                 TO WS-GICTRNJOIN-MODE
696600200615000925*      CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
696700200615000925*                              WS-GICTRNJOIN-CERTIFICATE
696800200615000925*      CANCEL "GICTRNJOIN"
696900200615000925*      GO TO RTF2-EXIT
697000200615ptest *    end-start.
697100200615
697200200615000923*    READ SORTED-GTR NEXT RECORD
697300200615000923     READ GIC-JLA-TMP NEXT RECORD
697400200615000923     AT END
697500200615000923         MOVE "N"     TO WS-VALID-CERTIFICATE
697600200615000923         MOVE "14"    TO RETN-RET-CODE
697700200615000923         MOVE "No Transactions for certificate"
697800200615000923                      TO RETN-RET-CODE-DESC
697900200615000923         MOVE HIGH-VALUES     TO CURR-CONTROLS
698000200615000923         IF (BATCH-MODE)
698100200615000923             MOVE "G18" TO REJ-REJECTION-CODE
698200200615000923             PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
698300200615000923         END-IF
698400200615139054         CLOSE GIC-JLA-TMP
698500200615ptest3*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
698600200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
698700200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
698800200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
698900200615000924*                                WS-GICTRNJOIN-CERTIFICATE
699000200615000924*23365   CANCEL "GICTRNJOIN"
699100200615000925*        CLOSE SORTED-GTR
699200200615000923     GO TO RTF2-EXIT.
699300200615000923
699400200615000923*    IF GICERTID OF SORTED-GTR-REC
699500200615000923     IF GICERTID OF GIC-JLA-TMP-REC
699600200615000923     NOT EQUAL CERTIFICATE-ID-NO
699700200615000923     OF GIC-CERTIFICATE-DETAILS-3-REC
699800200615000923         MOVE "N"     TO WS-VALID-CERTIFICATE
699900200615000923         MOVE "14"    TO RETN-RET-CODE
700000200615000923         MOVE "No Transactions for certificate"
700100200615000923                      TO RETN-RET-CODE-DESC
700200200615000923         MOVE HIGH-VALUES     TO CURR-CONTROLS
700300200615000923         IF (BATCH-MODE)
700400200615000923             MOVE "G18" TO REJ-REJECTION-CODE
700500200615000923             PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
700600200615000923         END-IF
700700200615139054         CLOSE GIC-JLA-TMP
700800200615ptest3*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
700900200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
701000200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
701100200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
701200200615000924*                                WS-GICTRNJOIN-CERTIFICATE
701300200615000924*23365   CANCEL "GICTRNJOIN"
701400200615000925*        CLOSE SORTED-GTR
701500200615000923         GO TO RTF2-EXIT
701600200615000923     END-IF.
701700200615000923
701800200615000923**** VALIDATE SORTED-GTR RECORD
701900200615000923**** IF TRANSACTION IS DATED BEFORE THE CERTIFICATE ISSUE
702000200615000923**** DATE, TRANSACTION IS REJECTED
702100200615      * For HSC, converted transactions,do not check First trade        RFS9029
702200200615      * date.                                                           RFS9029
702300200615137833* Check if it is transfer in kind on first transaction.
702400200615137833     IF TRTYPE OF GIC-JLA-TMP-REC = "TRI"
702500200615137833        PERFORM GET-CERT-RELATIONSHIP THRU GETCRTREL-EXIT
702600200615137833     END-IF.
702700200615000923
702800200615000923*    IF (TRTRADEDT OF SORTED-GTR-REC NOT EQUAL
702900200615137833*000923     IF (TRTRADEDT OF GIC-JLA-TMP-REC NOT EQUAL
703000200615137833* Bypass check for first trade date if transfer in kind on first trans.
703100200615137833     IF lb_TransferInKindNo AND (
703200200615137833       (TRTRADEDT OF GIC-JLA-TMP-REC NOT EQUAL
703300200615000923         ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC)
703400200615                     AND                                                RFS9029
703500200615      *         TRSTATUS OF SORTED-GTR-REC NOT = LT-HSC                 RFS9029
703600200615                TRSTATUS OF GIC-JLA-TMP-REC NOT = LT-HSC                RFS9029
703700200615137833       )
703800200615000923         MOVE "N"     TO WS-VALID-CERTIFICATE
703900200615000923         MOVE "15"    TO RETN-RET-CODE
704000200615000923         MOVE "First trade date is not equal issue date"
704100200615000923                      TO RETN-RET-CODE-DESC
704200200615000923         MOVE HIGH-VALUES     TO CURR-CONTROLS
704300200615000923         IF (BATCH-MODE)
704400200615000923             MOVE "G19" TO REJ-REJECTION-CODE
704500200615000923             PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
704600200615000923         END-IF
704700200615139054         CLOSE GIC-JLA-TMP
704800200615ptest3*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
704900200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
705000200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
705100200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
705200200615000924*                                WS-GICTRNJOIN-CERTIFICATE
705300200615000924*23365   CANCEL "GICTRNJOIN"
705400200615000925*        CLOSE SORTED-GTR
705500200615000923         GO TO RTF2-EXIT
705600200615000923     END-IF.
705700200615
705800200615      **** PRIME READ OF CORRESPONDING TRANS RECORD
705900200615
706000200615           INITIALIZE MFATRNP OF TRANS-REC.
706100200615
706200200615000923*    MOVE GIPLCDT OF SORTED-GTR-REC
706300200615000923     MOVE GIPLCDT OF GIC-JLA-TMP-REC
706400200615000923     TO   PLACEMENT-DATE OF TRANS-REC.
706500200615000923
706600200615000923*    MOVE GITRNNO        OF SORTED-GTR-REC
706700200615000923     MOVE GITRNNO        OF GIC-JLA-TMP-REC
706800200615000923     TO   TRANS-NO       OF TRANS-REC.
706900200615
707000200615           READ TRANS
707100200615               INVALID KEY
707200200615      * RFS185941 Starts
707300200615           IF ln_CnvCurrBalance > 0 AND ln_CnvStartDate > 0
707400200615              AND TRTYPE OF GIC-JLA-TMP-REC = "OPN"
707500200615
707600200615              MOVE ln_CnvStartDate TO PLACEMENT-DATE OF TRANS-REC
707700200615              MOVE 0 TO TRANS-NO OF TRANS-REC
707800200615              MOVE ln_CnvStartDate TO PROCESS-DATE OF TRANS-REC
707900200615              MOVE ln_CnvStartDate TO TRADE-DATE OF TRANS-REC
708000200615              MOVE "BUY" TO TRANS-TYPE-CODE OF TRANS-REC
708100200615              MOVE "OPN" TO TRANS-ORIGIN-CODE OF TRANS-REC
708200200615              MOVE TRACTNO OF GIC-JLA-TMP-REC TO
708300200615                                   ACCOUNT-NO OF TRANS-REC
708400200615              MOVE TRINVEST OF GIC-JLA-TMP-REC TO
708500200615                                   INVESTMENT-CODE OF TRANS-REC
708600200615              MOVE ln_CnvCurrBalance TO GROSS-AMT OF TRANS-REC
708700200615              MOVE ln_CnvCurrBalance TO NET-AMT OF TRANS-REC
708800200615              MOVE ln_CnvCurrBalance TO
708900200615                                   CLOSING-UNIT-BAL OF TRANS-REC
709000200615              MOVE "HSC" TO TRANS-STATUS-CODE OF TRANS-REC
709100200615
709200200615           ELSE
709300200615      * RFS185941 Ends
709400200615               MOVE "N"             TO WS-VALID-CERTIFICATE
709500200615               MOVE "16"            TO RETN-RET-CODE
709600200615               MOVE "GIC trans relationship record not in trans file"
709700200615                                    TO RETN-RET-CODE-DESC
709800200615               IF (BATCH-MODE)
709900200615                   MOVE "G20"       TO REJ-REJECTION-CODE
710000200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
710100200615               END-IF
710200200615               MOVE HIGH-VALUES     TO CURR-CONTROLS
710300200615139054         CLOSE GIC-JLA-TMP
710400200615ptest3*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
710500200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
710600200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
710700200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
710800200615000924*                                WS-GICTRNJOIN-CERTIFICATE
710900200615000924*        CALL "GICTRNJOIN"                                        FIX01
711000200615000924*23365   CANCEL "GICTRNJOIN"
711100200615000925*        CLOSE SORTED-GTR
711200200615000619         GO TO RTF2-EXIT
711300200615           END-IF
711400200615           END-READ.
711500200615
711600200615           MOVE TRANS-TYPE-CODE OF TRANS-REC
711700200615           TO TRANS-CATAGORY.
711800200615
711900200615      **** VALIDATE TRANS RECORD
712000200615      **** IF FIRST RECORD IS NOT A PURCHASE TRANSACTION OR
712100200615      **** INITIAL AMOUNT DOESN'T EQUAL GROSS-AMT OF FIRST TRANS
712200200615      **** TRANSACTION IS REJECTED
712300200615      *                                                                  RFS9029
712400200615      * Skip testing the initial amount here if the first transaction    RFS9029
712500200615      * is converted                                                     RFS9029
712600200615      * Do the testing after reaching total for the converted            RFS9029
712700200615      * transactions                                                     RFS9029
712800200615      *                                                                  RFS9029
712900200615           IF TRANS-STATUS-CODE OF TRANS-REC = "HSC"     AND             RFS9029
713000200615              GROSS-AMT OF TRANS-REC NOT =                               RFS9029
713100200615                    INITIAL-AMOUNT OF GIC-CERTIFICATE-DETAILS-3-REC      RFS9029
713200200615             SET SW10-CHK-START-BAL              TO TRUE                 RFS9029
713300200615           ELSE                                                          RFS9029
713400200615             IF (PURCHASE-TRANSACTION) AND
713500200615137833       (lb_TransferInKindYes OR
713600200615              (GROSS-AMT OF TRANS-REC =
713700200615               INITIAL-AMOUNT OF GIC-CERTIFICATE-DETAILS-3-REC)
713800200615137833       )
713900200615      *        NEXT SENTENCE
714000200615               CONTINUE
714100200615             ELSE
714200200615               MOVE "N"             TO WS-VALID-CERTIFICATE
714300200615               MOVE "17"    TO RETN-RET-CODE
714400200615               MOVE "First Trans must be BUY and equal initial amount"
714500200615                            TO RETN-RET-CODE-DESC
714600200615               IF (BATCH-MODE)
714700200615                   MOVE "G21" TO REJ-REJECTION-CODE
714800200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT
714900200615               END-IF
715000200615139054         CLOSE GIC-JLA-TMP
715100200615ptest3*        MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
715200200615000923*        TO   WS-GICTRNJOIN-CERTIFICATE
715300200615000924*        MOVE "Z"                 TO WS-GICTRNJOIN-MODE
715400200615000924*        CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
715500200615000924*                                WS-GICTRNJOIN-CERTIFICATE
715600200615000924*R23365  CANCEL "GICTRNJOIN"
715700200615000925*        CLOSE SORTED-GTR
715800200615               GO TO RTF2-EXIT
715900200615             END-IF
716000200615           END-IF.                                                      RFS9029
716100200615
716200200615      * Set switch for the last calculation period                      RFS10258
716300200615           PERFORM UA-SET-SW-TO-CHECK-ADJ
716400200615
716500200615      * RFS11592 - Begin
716600200615           PERFORM UC-SET-SW-FOR-CONERT-RECONC                          RFS10258
716700200615      * RFS11592 - End
716800200615      * ---------------------------------
716900200615137833* Save Issue date of the certificate and override the issue date
717000200615137833* with the first trade date for transfer in kind.
717100200615137833     IF lb_TransferInKindYes
717200200615137833       MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
717300200615137833         TO li_OriginalIssueDate
717400200615137833       MOVE TRTRADEDT  OF GIC-JLA-TMP-REC
717500200615137833         TO ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
717600200615137833     END-IF.
717700200615
717800200615      **** SAVE TRADE-DATE AS WS-PREV-TRADE-DATE
717900200615
718000200615           MOVE ISSUE-DATE OF GIC-CERTIFICATE-DETAILS-3-REC
718100200615           TO WS-PREV-TRADE-DATE-1
718200200615              WS-PREV-TRADE-DATE-3                                      RFS11367
718300200615
718400200615           MOVE ZEROES TO WS-PREV-GROSS-AMT-1.
718500200615           MOVE SPACES TO WS-PREV-TRANS-TYPE-CODE-1.
718600200615           MOVE SPACES TO WS-PREV-TRANS-STATUS-CODE-1.
718700200615      * RFS185941 Starts
718800200615           IF ln_CnvStartDate > 0 and ln_CnvCurrBalance > 0
718900200615              AND TRTYPE OF GIC-JLA-TMP-REC = "OPN"
719000200615              MOVE ln_CnvStartDate TO WS-PREV-TRADE-DATE-1
719100200615                                      WS-PREV-TRADE-DATE-3
719200200615           END-IF.
719300200615      * RFS185941 Ends
719400200615
719500200615000923**** LOOP THROUGH EACH SORTED-GTR RECORD
719600200615000923**** UNTIL NEW CERTIFICATE-ID-NO OR
719700200615000923**** (BATCH-MODE)  AND TRANS DATE > NEXT PAYMENT DATE OR
719800200615000923**** (ONLINE MODE) AND TRANS DATE > TODAY'S DATE OR
719900200615000923**** END OF FILE.
720000200615000923
720100200615000923     MOVE SPACES              TO WS-END-OF-GTR.
720200200615      *    MOVE TRTRADEDT OF SORTED-GTR-REC   TO                        RFS9029
720300200615           MOVE TRTRADEDT OF GIC-JLA-TMP-REC  TO                        RFS9029
720400200615                                       WS-FIRST-TRADE-DATE              RFS9029
720500200615000923
720600200615000923     PERFORM LOOP-SORTED-GTR THRU LGR-EXIT
720700200615000923*      UNTIL (GICERTID OF SORTED-GTR-REC
720800200615000923       UNTIL (GICERTID OF GIC-JLA-TMP-REC
720900200615000923              NOT EQUAL CERTIFICATE-ID-NO
721000200615000923              OF GIC-CERTIFICATE-DETAILS-3-REC)
721100200615000923          OR (BATCH-MODE AND DEF-END-DATE-MODE AND
721200200615000923*             TRTRADEDT OF SORTED-GTR-REC >
721300200615000923              TRTRADEDT OF GIC-JLA-TMP-REC >
721400200615000923              NEXT-PAYMENT-DATE OF GIC-CERTIFICATE-DETAILS-3-REC)
721500200615000923          OR (ONLINE-MODE AND DEF-END-DATE-MODE AND
721600200615000923*             TRTRADEDT OF SORTED-GTR-REC >
721700200615000923              TRTRADEDT OF GIC-JLA-TMP-REC >
721800200615000923              WS-DATE)
721900200615000923          OR (EARLY-REDEMPTION-MODE AND
722000200615000923*             TRTRADEDT OF SORTED-GTR-REC >
722100200615000923              TRTRADEDT OF GIC-JLA-TMP-REC >
722200200615000923              PASS-END-DATE-OPTION)
722300200615000923          OR (UNTIL-MATURITY-MODE AND
722400200615000923*             TRTRADEDT OF SORTED-GTR-REC >
722500200615000923              TRTRADEDT OF GIC-JLA-TMP-REC >
722600200615000923              MATURITY-DATE OF GIC-CERTIFICATE-DETAILS-3-REC)
722700200615000923          OR (END-OF-GTR)
722800200615000923          OR (CURR-CONTROLS = HIGH-VALUES).
722900200615
723000200615139054     CLOSE GIC-JLA-TMP
723100200615ptest3*    MOVE CERTIFICATE-ID-NO OF GIC-CERTIFICATE-DETAILS-3-REC
723200200615000923*    TO   WS-GICTRNJOIN-CERTIFICATE.
723300200615000924*    MOVE "Z"                 TO WS-GICTRNJOIN-MODE.
723400200615000924*    CALL "GICTRNJOIN" USING WS-GICTRNJOIN-MODE,
723500200615000924*                            WS-GICTRNJOIN-CERTIFICATE.
723600200615000924*
723700200615000924*    CANCEL "GICTRNJOIN".
723800200615000925*    CLOSE SORTED-GTR.
723900200615
724000200615      **** IF PROBLEM-OCCURED, BACK OUT OF CERTIFICATE CALCULATION
724100200615
724200200615           IF (CURR-CONTROLS = HIGH-VALUES)
724300200615               GO TO RTF2-EXIT
724400200615           END-IF.
724500200615
724600200615185941     IF lb_CnvGicRecExistsNo
724700200615
724800200615           IF SW10-CHK-START-BAL            AND                          RFS9029
724900200615              WS-GIC-BAL-FOR-THE-DATE NOT =                              RFS9029
725000200615                      INITIAL-AMOUNT OF GIC-CERTIFICATE-DETAILS-3-REC    RFS9029
725100200615               MOVE "N"             TO WS-VALID-CERTIFICATE              RFS9029
725200200615               MOVE "17"            TO RETN-RET-CODE                     RFS9029
725300200615               MOVE                                                      RFS9029
725400200615             "Total for the converted data should be = initial amount"   RFS9029
725500200615                                    TO RETN-RET-CODE-DESC                RFS9029
725600200615               IF (BATCH-MODE)                                           RFS9029
725700200615                   MOVE "G21"       TO REJ-REJECTION-CODE                RFS9029
725800200615                   PERFORM WRITE-ERROR-REJECTION THRU WER-EXIT           RFS9029
725900200615               END-IF                                                    RFS9029
726000200615               GO TO RTF2-EXIT                                           RFS9029
726100200615185941     END-IF
726200200615           END-IF.                                                       RFS9029
726300200615
726400200615      **** PROCESS LAST INTEREST PERIOD
726500200615
726600200615           PERFORM PROCESS-LAST-INTEREST-PERIOD THRU PLI-EXIT.
726700200615
726800200615      * ---------------------------------------------------------------
726900200615      * Summarise total calculated interest                             RFS10258
727000200615      *    COMPUTE WS-TOTAL-INT-CALCULATED =                            RFS10258
727100200615      *                 WS-TOTAL-INT-CALCULATED + (RETN-TOTAL-INTEREST) RFS10258
727200200615      * ---------------------------------------------------------------
727300200615
727400200615      * For the last payment do reconciliation                          RFS10258
727500200615           IF SW03-LAST-PERIOD        AND                               RFS10258
727600200615              SW03-ADJ-NOT-EXIST      AND                               RFS10258
727700200615              SW04-CONVERT-NOT-EXIST                                    RFS11592
727800200615      * RFS11367 - Begin
727900200615      *        PERFORM UB-GET-INT-CALCULATED                            RFS10258
728000200615      * RFS11367 - End
728100200615               COMPUTE WS-TOTAL-INT-CALCULATED ROUNDED =                RFS10258
728200200615                       WS-TOTAL-INT-CALCULATED + WS-INT-CALCULATED      RFS10258
728300200615               COMPUTE WS-ACCRUAL-AMT-PER-GRP ROUNDED =                 RFS10258
728400200615                       WS-TOTAL-INT-CALCULATED - WS-TOTAL-INT-PAID      RFS10258
728500200615           END-IF                                                       RFS10258
728600200615      * RFS11324 - Begin
728700200615           IF (STMT-INTEREST-MODE OR
728800200615137231         ACCOUNT-V2-MODE OR
728900200615      * 1017021 - Begin
729000200615               ACCOUNT-V3-MODE OR
729100200615      * 1017021 - End
729200200615               ESTATE-INTEREST-MODE) AND
729300200615185374*       INT-PAYMENT-FREQUENCY OF GIC-CERTIFICATE-DETAILS-3-REC =
729400200615185374*                                                LT-CA
729500200615185374       (INT-PAYMENT-FREQUENCY OF GIC-CERTIFICATE-DETAILS-3-REC =
729600200615185374                   LT-CA OR LT-CD)
729700200615               SET SW11-NEXT-ANNIV-EXISTS  TO TRUE
729800200615               PERFORM VI-GET-NEXT-ANNIV-DATE
729900200615           END-IF
730000200615      * RFS11324 - End
730100200615
730200200615      * RFS 12825 - START
730300200615      * RFS 14156 - START (ADDED MATURITY-SELL-MODE TO NEXT LINE)
730400200615143882*    IF STMT-INTEREST-MODE OR MATURITY-SELL-MODE OR
730500200615143882     IF STMT-INTEREST-MODE OR
730600200615137231        ACCOUNT-V2-MODE OR
730700200615      * 1017021 - Begin
730800200615              ACCOUNT-V3-MODE OR
730900200615      * 1017021 - End
731000200615              ESTATE-INTEREST-MODE
731100200615142508        OR ACCOUNT-A1-MODE
731200200615      * RFS 14156 - END
731300200615              PERFORM CALCULATE-GIC-ADJ THRU CGA-EXIT
731400200615           END-IF.
731500200615      * RFS 12825 - END
731600200615
731700200615           COMPUTE WS-ACCRUAL-AMT = WS-ACCRUAL-AMT +                    RFS9240
731800200615      *RFS 12825 - START
731900200615      *                                WS-ACCRUAL-AMT-PER-GRP           RFS9240
732000200615                   WS-ACCRUAL-AMT-PER-GRP + (WS-ADJUSTMENT-AMOUNT)      RFS9240
732100200615      *RFS 13300 - Start
732200200615      *    IF WS-ACCRUAL-AMT < 0
732300200615      *       MULTIPLY WS-ACCRUAL-AMT BY -1
732400200615      *       GIVING WS-ACCRUAL-AMT
732500200615      *    END-IF.
732600200615      *RFS 13300 - end
732700200615      *RFS 12825 - END
732800200615      *RFS141725 - Start
732900201203      *RFS1107791 - Start
733000201203      *  Reduce accrual interest added to WS-GIC-BALANCE.
733100201203      *  GIC Balance should not include calculated accrual
733200201203      *  interest when return back from program.
733300201203           IF li_retnIntTot > 0 and WS-GIC-BALANCE > 0
733400201203             COMPUTE WS-GIC-BALANCE = WS-GIC-BALANCE - li_retnIntTot
733500201203                      + li_reinvestIntAmt
733600201203           END-IF
733700201203      *RFS1107791 - End
733800200615           COMPUTE WS-GIC-TOT-BAL = WS-GIC-TOT-BAL + WS-GIC-BALANCE
733900200615      *RFS141725 - End
734000200615
734100200615      **** WRITE OUTPUT FILE IF CERTIFICATE LEVEL
734200200615
734300200615           IF (CERTIFICATE-MODE) OR (GIC-BATCH-MODE)
734400200615               IF (TRNPST-MODE) OR (INTEREST-MODE)
734500200615                   IF (TRNPST-MODE)
734600200615                      IF REDEMPTION-BEF-MATURITY
734700200615                      OF GIC-CERTIFICATE-DETAILS-3-REC = "N"
734800200615      * ---------------------------------
734900200615      * Get-gic-term-table and                                          RFS8371
735000200615      * Penalty-rate-schedule will be calculated in CALC-PENALTY-...    RFS8371
735100200615      * paragraph                                                       RFS8371
735200200615      *                                                                 RFS8371
735300200615      *                   PERFORM GET-GIC-TERM-TABLE THRU GTT-EXIT      RFS8371
735400200615      *                   IF CURR-CONTROLS = HIGH-VALUES                RFS8371
735500200615      *                       GO TO RTF2-EXIT                           RFS8371
735600200615      *                   END-IF                                        RFS8371
735700200615      *                   PERFORM GET-GIC-PENALTY-RATE-SCHEDULE         RFS8371
735800200615      *                   THRU GPRS-EXIT                                RFS8371
735900200615      *                   IF CURR-CONTROLS = HIGH-VALUES                RFS8371
736000200615      *                       GO TO RTF2-EXIT                           RFS8371
736100200615      *                   END-IF                                        RFS8371
736200200615      * ---------------------------------
736300200615                          PERFORM CALC-PENALTY-AND-REDEMPTION
736400200615                          THRU CPR-EXIT
736500200615                      END-IF
736600200615
736700200615      *               PERFORM CALC-PENALTY-AND-REDEMPTION THRU CPR-EXIT
736800200615                      IF CURR-CONTROLS = HIGH-VALUES
736900200615                          GO TO RTF2-EXIT
737000200615                      END-IF
737100200615                   END-IF
737200200615                   IF (INTEREST-MODE)
737300200615137231                OR ACCOUNT-V2-MODE
737400200615      * 1017021 - Begin
737500200615                      OR ACCOUNT-V3-MODE
737600200615      * 1017021 - End
737700200615                      IF PASS-GROSS-AMT < CURRENT-CERTIFICATE-BALANCE
737800200615                          OF GIC-CERTIFICATE-DETAILS-3-REC    AND
737900200615                         NOT STMT-INTEREST-MODE               AND       RFS11324
738000200615137231                   NOT ACCOUNT-V2-MODE                  AND
738100200615      * 1017021 - Begin
738200200615                         NOT ACCOUNT-V3-MODE                  AND
738300200615      * 1017021 - End
738400200615                         NOT ESTATE-INTEREST-MODE
738500200615                          MOVE ZEROES         TO RETN-ACCRUAL-AMT
738600200615                      ELSE
738700200615      *                   MOVE WS-ACCRUAL-AMT TO RETN-ACCRUAL-AMT       FIX06
738800200615                          COMPUTE RETN-ACCRUAL-AMT ROUNDED =            FIX06
738900200615                                                   WS-ACCRUAL-AMT       FIX06
739000200615                      END-IF
739100200615      * RFS10737 - Begin
739200200615                      MOVE WS-GIC-BALANCE     TO RETN-BALANCE
739300200615      * RFS10737 - End
739400200615                   END-IF
739500200615               ELSE
739600200615                   PERFORM WRITE-CERTIFICATE-LEVEL THRU WCL-EXIT
739700200615               END-IF
739800200615               MOVE ZEROES          TO WS-ACCRUAL-AMT
739900200615           END-IF.
740000200615
740100200615      * RFS 138307 - begin
740200200615139054*    IF lc-Open-GICJLA IS EQUAL TO "Y"
740300200615139054*       CLOSE GIC-JLA-TMP
740400200615139054*    END-IF.
740500200615      * RFS 138307 - end
740600200615
740700200615      **********
740800200615
740900200615       RTF2-EXIT.
741000200615            EXIT.
741100200615
741200200615R14153**********
741300200615137833* Begin
741400200615       GET-CERT-RELATIONSHIP.
741500200615
741600200615           INITIALIZE li_Cnt.
741700200615
741800200615           EXEC SQL
741900200615             SELECT COUNT(*)
742000200615               INTO :li_Cnt
742100200615               FROM MFAGICRP GICRP
742200200615              WHERE GICRP.CERTIFICATE_ID_NO = :li_CertIDNo
742300200615                AND GICRP.CERT_RELATIONSHIP_CODE = :lnc_RTR
742400200615           END-EXEC.
742500200615
742600200615           IF li_Cnt > 0
742700200615             SET lb_TransferInKindYes TO TRUE
742800200615           END-IF.
742900200615
743000200615       GETCRTREL-EXIT.
743100200615           EXIT.
743200200615137833* End
743300200615140269* Begin
743400200615140269* Get interest adjustment attached to the tx.
743500200615  ||   GET-INT-ADJ.
743600200615  ||
743700200615  ||       INITIALIZE li_IntAdj.
743800200615  ||
743900200615  ||       EXEC SQL
744000200615  ||         SELECT COALESCE(SUM(ADJUSTMENT_AMOUNT), 0)
744100200615  ||           INTO :li_IntAdj
744200200615  ||           FROM MFAGIARDP ARDP
744300200615  ||          WHERE ARDP.PLACEMENT_DATE = :li_placementDate
744400200615  ||            AND ARDP.TRANS_NO = :li_transNo
744500200615  ||       END-EXEC.
744600200615  ||
744700200615  ||   GIA-EXIT.
744800200615  ||       EXIT.
744900200615140269* End
745000200615      * RFS143882 Starts
745100200615      * Check if pending interest adjustment exists.
745200200615       CHECK-GIC-ADJ.
745300200615
745400200615           INITIALIZE li_IntAdjAmt.
745500200615
745600200615           EXEC SQL
745700200615             SELECT COALESCE(SUM(ADJUSTMENT_AMOUNT), 0)
745800200615               INTO :li_IntAdjAmt
745900200615               FROM MFAGIARDP ARDP
746000200615              WHERE ARDP.PLACEMENT_DATE = 0
746100200615                AND ARDP.TRANS_NO = 0
746200200615                AND ARDP.CERTIFICATE_ID_NO = :li_CertIDNo
746300200615           END-EXEC.
746400200615
746500200615       CGAD-EXIT.
746600200615           EXIT.
746700200615      * RFS143882 Ends
746800200615152312* 152312 -  Starts
746900200615       CRT-WORK-FILE.
747000200615
747100200615           EXEC SQL
747200200615             DROP TABLE QTEMP/WKGICINT
747300200615           END-EXEC.
747400200615
747500200615           EXEC SQL
747600200615             CREATE TABLE QTEMP/WKGICINT (
747700200615             ACCOUNT_NO        NUMERIC (09,0) NOT NULL WITH DEFAULT,
747800200615             INVESTMENT_CODE   CHAR    (05)   NOT NULL WITH DEFAULT,
747900200615             CERTIFICATE_ID_NO NUMERIC (10,0) NOT NULL WITH DEFAULT,
748000200615             MATURITY_DATE     NUMERIC (08,0) NOT NULL WITH DEFAULT,
748100200615             START_DATE        NUMERIC (08,0) NOT NULL WITH DEFAULT,
748200200615             END_DATE          NUMERIC (08,0) NOT NULL WITH DEFAULT,
748300200615             INT_ACCRUAL_STR   DECIMAL (13,2) NOT NULL WITH DEFAULT,
748400200615             BALANCE_STR       DECIMAL (13,2) NOT NULL WITH DEFAULT,
748500200615             INT_ACCRUAL_END   DECIMAL (13,2) NOT NULL WITH DEFAULT,
748600200615             BALANCE_END       DECIMAL (13,2) NOT NULL WITH DEFAULT,
748700200615             INT_ACCRUAL_MAT   DECIMAL (13,2) NOT NULL WITH DEFAULT,
748800200615             BALANCE_MAT       DECIMAL (13,2) NOT NULL WITH DEFAULT)
748900200615           END-EXEC.
749000200615
749100200615       CWF-EXIT.
749200200615           EXIT.
749300200615
749400200615       INSERT-WK-Rec.
749500200615
749600200615           EXEC SQL
749700200615             INSERT INTO WKGICINT VALUES(
749800200615             :li_AccountNo_SE,
749900200615             :lc_InvestCode_SE,
750000200615             :li_CertIdNo_SE,
750100200615             :li_MatDate,
750200200615             :li_StrDate,
750300200615             :li_EndDate,
750400200615             0,
750500200615             0,
750600200615             0,
750700200615             0,
750800200615             0,
750900200615             0)
751000200615           END-EXEC.
751100200615
751200200615       IWR-EXIT.
751300200615           EXIT.
751400200615
751500200615       UPDATE-WK-Rec.
751600200615
751700200615           IF lc_Upd_Flag = "S"
751800200615             EXEC SQL
751900200615               UPDATE QTEMP/WKGICINT
752000200615                 SET INT_ACCRUAL_STR = :li_AccrualAmt_SE,
752100200615                     BALANCE_STR     = :li_Balance_SE
752200200615               WHERE ACCOUNT_NO = :li_AccountNo_SE
752300200615                 AND INVESTMENT_CODE = :lc_InvestCode_SE
752400200615                 AND CERTIFICATE_ID_NO = :li_CertIdNo_SE
752500200615             END-EXEC
752600200615           END-IF.
752700200615
752800200615           IF lc_Upd_Flag = "E"
752900200615             EXEC SQL
753000200615               UPDATE QTEMP/WKGICINT
753100200615                 SET INT_ACCRUAL_END = :li_AccrualAmt_SE,
753200200615                     BALANCE_END     = :li_Balance_SE
753300200615               WHERE ACCOUNT_NO = :li_AccountNo_SE
753400200615                 AND INVESTMENT_CODE = :lc_InvestCode_SE
753500200615                 AND CERTIFICATE_ID_NO = :li_CertIdNo_SE
753600200615             END-EXEC
753700200615           END-IF.
753800200615
753900200615           IF lc_Upd_Flag = "M"
754000200615             EXEC SQL
754100200615               UPDATE QTEMP/WKGICINT
754200200615                 SET INT_ACCRUAL_MAT = :li_AccrualAmt_SE,
754300200615                     BALANCE_MAT     = :li_Balance_SE
754400200615               WHERE ACCOUNT_NO = :li_AccountNo_SE
754500200615                 AND INVESTMENT_CODE = :lc_InvestCode_SE
754600200615                 AND CERTIFICATE_ID_NO = :li_CertIdNo_SE
754700200615             END-EXEC
754800200615           END-IF.
754900200615
755000200615       UWR-EXIT.
755100200615           EXIT.
755200200615152312* 152312 - Ends
755300200615      *RFS1005534- Start
755400200615       GET-INT-ADJ-TRADE-DATE.
755500200615
755600200615           INITIALIZE li_TradeDate_IntAdj.
755700200615
755800200615           EXEC SQL
755900200615             SELECT COALESCE(TRNP.TRADE_DATE, 0)
756000200615               INTO :li_TradeDate_IntAdj
756100200615               FROM MFATRNP TRNP
756200200615              WHERE TRNP.PLACEMENT_DATE = :li_PlacementDate_IntAdj
756300200615                AND TRNP.TRANS_NO       = :li_TransNo_IntAdj
756400200615           END-EXEC.
756500200615
756600200615       GIATD-EXIT.
756700200615           EXIT.
756800200703
756900200703      * 1099872 - Start
757000200703       GET-INT-ON-REDEMPTION.
757100200703
757200200703           INITIALIZE li_IntOnRed
757300200703                      li_Acct_No
757400200703                      lc_Inv_Cde
757500200703                      lc_Tran_Type
757600200703                      li_Cls_Bal
757700200703                      li_last_Trdt
757800200703                      li_last_Pldt
757900200703                      li_last_Trno
758000200703                      li_INT_AMT.
758100200703
758200200703           MOVE PASS-END-DATE-OPTION  TO li_last_Trdt.
758300200703           MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT
758400200703             TO li_Acct_No.
758500200703           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT
758600200703             TO lc_Inv_Cde.
758700200703
758800200703      * Get the last transaction from the trade date for AC/INV
758900200703      * on the end-date.
759000200703           EXEC SQL
759100200703             SELECT PLACEMENT_DATE, TRANS_NO, TRANS_TYPE_CODE,
759200200703                    CLOSING_UNIT_BAL
759300200703               INTO :li_Last_Pldt, :li_Last_Trno, :lc_Tran_Type,
759400200703                    :li_Cls_Bal
759500200703               FROM MFATRNP TRNP
759600200703              WHERE TRNP.ACCOUNT_NO      = :li_Acct_No
759700200703                AND TRNP.INVESTMENT_CODE = :lc_Inv_Cde
759800200703                AND TRNP.TRADE_DATE      = :li_Last_Trdt
759900200703                AND TRNP.REVERSE         <> "Y"
760000200703                AND TRNP.TRANS_STATUS_CODE IN("HST","HSC")
760100200703              ORDER BY
760200200703                TRNP.PROCESS_DATE DESC,
760300200703                TRNP.TRANS_PROC_SEQ_NO DESC
760400200708              FETCH FIRST ROW ONLY
760500200703           END-EXEC.
760600200703
760700200703           IF li_Cls_Bal = 0 AND (lc_Tran_Type = "SEL" OR
760800200703              lc_Tran_Type = "TRO" OR lc_Tran_Type = "SWO")
760900200703              EXEC SQL
761000200703                SELECT GROSS_AMT
761100200703                  INTO :li_INT_AMT
761200200703                  FROM MFATRNTGP TGP INNER JOIN MFATRNP TNP ON
761300200703                       TGP.PLACEMENT_DATE_2 = TNP.PLACEMENT_DATE
761400200703                   AND TGP.TRANS_NO_2 = TNP.TRANS_NO
761500200703                 WHERE TGP.PLACEMENT_DATE    = :li_Last_Pldt
761600200703                   AND TGP.TRANS_NO          = :li_Last_Trno
761700200703                   AND TGP.RELATIONSHIP_TYPE = "REI"
761800200703                   AND TNP.TRANS_TYPE_CODE   = "INT"
761900200703              END-EXEC
762000200703           END-IF.
762100200703
762200200703       GIOR-EXIT.
762300200703           EXIT.
762400200703      * 1099872 - End
762500200615
762600200615      * RFS185941 Starts
762700200615      *----------------------------------------------------
762800200615       SQLFailProcess.
762900200615      *---------------------------------
763000200615           PERFORM Dsp-Error.
763100200615
763200200615      *---------------------------------
763300200615      * DSP-ERROR and FORCE-MSGW Routines
763400200615      *---------------------------------
763500200615           COPY CPYSQLRTN.
763600200615
763700200615      * RFS185941 Ends
763800200615
763900200615      *RFS1005534- End
