000100110513       IDENTIFICATION DIVISION.
000200110513       PROGRAM-ID.    MFRCALC2.
000300110513       AUTHOR.        REECE TAM.
000400110513       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000500110513       DATE-WRITTEN.  MAY 13, 2011.
000600110513      *CHANGED-BY.    XXXXXXXXXX.
000700110513      *DATE-CHANGED.  XXXXXXX XX, XXXX.
000800110513       DATE-COMPILED.
000900110513
001000110513      *******************************************************************
001100110513      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
001200110513      *******************************************************************
001300110701      * Abhishek k * 2011/04/20   * RFS 91773 - MANAGEMENT FEE REBATE  *
001400110513      *            *              * CASH DEAL AND INSTITUTIONAL        *
001500110513      *            *              * Invoicing                          *
001600110518      * Sarath R   * 2011/05/11   * RFS 92145 - Modified for accrual   *
001700110513      *            *              * process to calculate the MFR amount*
001800110513      *            *              * based on trade date and the elgible*
001900110513      *            *              * unit balance for the account invst *
002000110513      *            *              * MFR Group                          *
002100110622      * Alan A.    * 2011/06/21   * RFS 97579 - Ensure MFAINVP closed  *
002200110622      *            *              *           - For MFR Accrual Cal-   *
002300110622      *            *              * culation process single investment *
002400110622      *            *              * code passed to the program         *
002500110705      * Abhishek k * 2011/06/30   * RFS 97581 - Tiger - Defer
002600110705      *            *              * outstanding work for RFS 91773
002700110705      *            *              * (MFR - Cash Deal)
002800121113      * Michael Fan* 2012/10/29   * RFS115704 - Federal Tax Percent and  *
002900121113      *            *              * Provincial Tax Percent change to 5   *
003000121113      *            *              * decimal places instead of 2 on files *
003100121113      *            *              * MFATRNTXP and MFATRNTXDP.            *
003200160406      * Kahakashan * 2016/03/15   * RFS157482 - correct MFR calculations *
003300160406      *            *              * to be done during leap year          *
003400171012      * Amrutha V  * 2017/10/11   * RFS167951-To calculate the MFR accrs *
003500171012      *            *              * al amount for each account-investment*
003600171012      *            *              * based on the MFR group level         *
003700171012      *            *              * instructions account investment      *
003800171012      *            *              * / account / investor /household level*
003900180109      * Jeyarajan V* 2018/01/05   * RFS1000551-MFR calcualtion for 'G'   *
004000180109      *            *              * calculation method perfromance issue *
004100180131      * Aarthi M   * 2018/01/29   * RFS177476-MFR is not correct with USD*
004200180129      *            *              * funds.                               *
004300180316      * Jeyarajan V* 2018/03/15   * RFS1001473 - MFR not generated and    *
004400180316      *            *              *  reported for eligible funds.         *
004500180528      *Janapriya J * 2018/05/25   * RFS179223 - Recompile for MFAIVRHHP*
004600180725      * Digvijay S * 2018/07/25   * RFS179061 - SEGCONS Extract -
004700180725      *            *              * addition of new fields
004800180816      * Sethu B    * 2018/08/16   * RFS180381 - Recompile for MFAIVRHHP*
004900200421      * Mayilsamy D* 2020/04/21   * RFS185774 - Recompile for MFAIVRHDP*
005000210301      * Rajesh R   * 2021/02/05   * RFS187018 - Recompile for MFAIVRHDP*
005100210622      * Jebastin K * 2021/06/22   * RFS186019 - Changes for ASSET RULE *
005200210622      *            *              *           - TYPE 4.                *
005300210829      * Mayilsamy D* 2021/08/28   * RFS187441 -Recompile for MFAIVRHHP *
005400210927      * Rajesh R   * 2021/09/17   * RFS187775 - Recompile for MFAIVRHDP*
005401211013      * Jebastin   * 2021/10/13   * RFS1122059  - Fix for daily accrual issue.
005500110513      *******************************************************************
005600180202      *===============================================================*
005700180202      * Important: If changes are made to this program, please review
005800180202      *            MFRCALC for the same changes.
005900180202      *===============================================================*
006000171027      * -------------------------------------------------------------
006100110513      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
006200171027      * -------------------------------------------------------------
006300110513      *******************************************************************
006400180202      *===============================================================*
006500180202      * Important: IMPORTANT TO ALL PROGRAMMERS
006600180202      *
006700180202      * If any programmer creates, changes or deletes an array in this
006800180202      * programs please add the logic to support the array logging process!
006900180202      *
007000180202      * View the WS-ARRAY-LOG-MISC variables and the code associated with
007100180202      * RFS49699.
007200180202      *
007300180202      * This change is for audit purposes, it logs the
007400180202      * name of the array, max size, size used. At the end of
007500180202      * this program the array information is passed to FXLOGUA pgm,
007600180202      * which write this information to the MFALOGAUP array audit file!
007700180202      *
007800180202      *===============================================================*
007900110513       ENVIRONMENT DIVISION.
008000110513       CONFIGURATION SECTION.
008100210622      * RFS 186019 - Begins
008200210622       SPECIAL-NAMES.
008300210622           DATA-AREA IS WS-DTAARA-MFASYSPARM.
008400210622      * RFS 186019 - Ends
008500110513       SOURCE-COMPUTER. IBM-AS400.
008600110513       OBJECT-COMPUTER. IBM-AS400.
008700110513       SPECIAL-NAMES.
008800110513           LOCAL-DATA IS WS-LOCAL.
008900110513      /
009000110513       INPUT-OUTPUT SECTION.
009100110513       FILE-CONTROL.
009200110513
009300110513           SELECT  MFR-PROCESS
009400110513                   ASSIGN TO DATABASE-MFAMFRPRP
009500110513                   ORGANIZATION IS INDEXED
009600110513                   ACCESS IS DYNAMIC
009700110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009800110513
009900110513           SELECT  ACCOUNT-INVESTMENT
010000110513                   ASSIGN TO DATABASE-MFAACCIVP
010100110513                   ORGANIZATION IS INDEXED
010200110513                   ACCESS IS DYNAMIC
010300110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010400110513
010500110513           SELECT  TRANS
010600110516                   ASSIGN TO DATABASE-MFATRNL6
010700110513                   ORGANIZATION IS INDEXED
010800110513                   ACCESS IS DYNAMIC
010900110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
011000110513                   WITH DUPLICATES.
011100110513
011200110513           SELECT  MFR-SCHEDULE
011300110513                   ASSIGN TO DATABASE-MFAMFRSCP
011400110513                   ORGANIZATION IS INDEXED
011500110513                   ACCESS IS DYNAMIC
011600110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
011700110513
011800110513           SELECT  BUSINESS-DAY-FILE
011900110513                   ASSIGN TO DATABASE-MFABUSDAP
012000110513                   ORGANIZATION IS INDEXED
012100110513                   ACCESS IS DYNAMIC
012200110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012300110513
012400110513           SELECT  INVESTMENT-UNIT-PRICE
012500110513                   ASSIGN TO DATABASE-MFAINVUPLB
012600110513                   ORGANIZATION IS INDEXED
012700110513                   ACCESS IS DYNAMIC
012800110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
012900110513                   WITH DUPLICATES.
013000110513
013100110513           SELECT  INVESTMENT
013200110513                   ASSIGN TO DATABASE-MFAINVP
013300110513                   ORGANIZATION IS INDEXED
013400110513                   ACCESS IS DYNAMIC
013500110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013600110513
013700110513      *RFS 34759 - Start
013800110513           SELECT  Inv-Ass-Alloc-Mod-Sch-Hd
013900110513                   ASSIGN TO DataBase-Mfaiamshla
014000110513                   ORGANIZATION IS INDEXED
014100110513                   ACCESS IS DYNAMIC
014200110513R38381             FILE STATUS IS lc-FileStatus
014300110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
014400110513                   WITH DUPLICATES.
014500110513
014600110513           SELECT  Inv-Ass-Alloc-Model-Sch-Dt
014700110513                   ASSIGN TO DataBase-Mfaiamsdp
014800110513                   ORGANIZATION IS INDEXED
014900110513                   ACCESS IS DYNAMIC
015000110513R38381             FILE STATUS IS lc-FileStatus
015100110513                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015200110513
015300110513      *RFS 34759 - End
015400110513
015500110513      *RFS 92145 - Start
015600110518           SELECT  ACCOUNT-MFR-ACCRUAL
015700110518                   ASSIGN TO DATABASE-MFAACCMFP
015800110518                   ORGANIZATION IS INDEXED
015900110518                   ACCESS IS DYNAMIC
016000171011                    RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016100110513      *RFS 92145 - End
016200171011
016300171130      *RFS167951 Starts
016400171130           SELECT EXCHANGE-RATE-M
016500171130                  ASSIGN TO DATABASE-MFAEXRHMP
016600171130                  ORGANIZATION IS INDEXED
016700171130                  ACCESS IS DYNAMIC
016800171130                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
016900171130                  FILE STATUS IS lc-FileStatus.
017000171130      *RFS167951 Ends
017100110513      /
017200110513       DATA DIVISION.
017300110513       FILE SECTION.
017400110513       FD  MFR-PROCESS
017500110513           LABEL RECORDS ARE STANDARD.
017600110513       01  MFR-PROCESS-REC.       COPY DD-ALL-FORMATS OF MFAMFRPRP.
017700110513      /
017800110513       FD  ACCOUNT-INVESTMENT
017900110513           LABEL RECORDS ARE STANDARD.
018000110513       01  AIV-REC.               COPY DD-ALL-FORMATS OF MFAACCIVP.
018100110513      /
018200110516       FD  TRANS
018300110513           LABEL RECORDS ARE STANDARD.
018400110516       01  TRN-REC.               COPY DD-ALL-FORMATS OF MFATRNL6.
018500110513      /
018600110513       FD  MFR-SCHEDULE
018700110513           LABEL RECORDS ARE STANDARD.
018800110513       01  MFR-SCHEDULE-REC.      COPY DD-ALL-FORMATS OF MFAMFRSCP.
018900110513      /
019000110513       FD  BUSINESS-DAY-FILE
019100110513           LABEL RECORDS ARE STANDARD.
019200110513       01  BUD-REC.               COPY DD-ALL-FORMATS OF MFABUSDAP.
019300110513      /
019400110513       FD  INVESTMENT-UNIT-PRICE
019500110513           LABEL RECORDS ARE STANDARD.
019600110513       01  IUP-REC.               COPY DD-ALL-FORMATS OF MFAINVUPLB.
019700110513      /
019800110513       FD  INVESTMENT
019900110513           LABEL RECORDS ARE STANDARD.
020000110513       01  IVS-REC.               COPY DD-ALL-FORMATS OF MFAINVP.
020100110513
020200110513      *RFS 34759 - Start
020300110513      /
020400110513       FD  Inv-Ass-Alloc-Mod-Sch-Hd
020500110513           LABEL RECORDS ARE STANDARD.
020600110513       01  Inv-Ass-Alloc-Mod-Sch-Hd-Rec.
020700110513                        COPY DD-ALL-FORMATS OF Mfaiamshla.
020800110513      /
020900110513       FD  Inv-Ass-Alloc-Model-Sch-Dt
021000110513           LABEL RECORDS ARE STANDARD.
021100110513       01  Inv-Ass-Alloc-Model-Sch-Dt-Rec.
021200110513                        COPY DD-ALL-FORMATS OF Mfaiamsdp.
021300110513
021400110513      *RFS 34759 - End
021500110513
021600110513      *RFS 92145 - Start
021700110513       FD  ACCOUNT-MFR-ACCRUAL
021800110513           LABEL RECORDS ARE STANDARD.
021900110513       01  ACCOUNT-MFR-ACCRUAL-REC.
022000110513                                  COPY DD-ALL-FORMATS OF MFAACCMFP.
022100110513      *RFS 92145 - End
022200110513
022300171130      *RFS167951 Starts
022400171130       FD  EXCHANGE-RATE-M
022500171130           LABEL RECORDS ARE STANDARD.
022600171130       01  EXCHANGE-RATE-M-REC.       COPY DD-ALL-FORMATS OF MFAEXRHMP.
022700171130      *RFS167951 Ends
022800110513
022900110513       WORKING-STORAGE SECTION.
023000110513
023100110513       01  CURR-CONTROLS.
023200110513          03 CURR-LEVEL1.
023300110513           05 CURR-INVESTMENT-CODE     PIC X(5).
023400110513
023500110513       01  PREV-CONTROLS.
023600110513          03 PREV-LEVEL1.
023700110513           05 PREV-INVESTMENT-CODE     PIC X(5).
023800110513
023900210622      * RFS 186019 - Begins
024000210622       01 lc_MFASYSPARM.
024100210622          05 lc_FILLER                   PIC X(1183) VALUE " ".
024200210802          05 lc_EffectiveFlag            PIC X(01)   VALUE " ".
024300210802          05 lc_RegrAccrFlag             PIC X(01)   VALUE " ".
024400210622      * RFS 186019 - Ends
024500210622
024600110513       01  WS-MISC-FIELDS.
024700110513RF4556     05 WS-LEAP0            PIC 9(4)        VALUE 0.
024800110513RF4556     05 WS-LEAP1            PIC 9           VALUE 0.
024900110513RF4697     05 WS-MCO              PIC X(3).
025000110513RF4697     05 WS-UNIT-VALUE       PIC 9(9)V99.
025100110513RF4697     05 WS-MFR-VALUE        PIC 9(9)V999999 VALUE 0 COMP-3.
025200110513           05 WS-LAST-PRICE       PIC 9(4)V9999.
025300110513           05 WS-SAME-BALANCE     PIC X           VALUE "N".
025400110513           05 WS-OPENING-BALANCE  PIC S9(9)V999   VALUE 0 COMP-3.
025500110513           05 WS-CARRY-FORWARD    PIC 9(9)V999    VALUE 0 COMP-3.
025600110513           05 WS-FIRST-READ-SW    PIC X(1)        VALUE "Y".
025700110513           05 WS-DAYS-IN-YEAR     PIC 9(5)        VALUE 365 COMP-3.
025800110513           05 WS-TOT-MFR-AMT      PIC 9(9)V999999 VALUE 0 COMP-3.
025900171130167951*    05 WS-RATE             PIC 9(4)V999    VALUE 0 COMP-3.
026000171130167951     05 WS-RATE             PIC 9(3)V9(6)   VALUE 0 COMP-3.
026100110513           05 WS-REJECTION-CODE   PIC X(3)        VALUE " ".
026200110513R79774     05 WS-AVG-UNIT-COST    PIC 9(4)V9999   VALUE 0.
026300110513
02640011051314388      05 WS-TXN-SALES-TAX-FIELDS.
026500110513  ¦           10 WS-ACCT-NO              PIC S9(9)        COMP-3.
026600110513  ¦           10 WS-SALES-TAX-CODE       PIC X(1).
026700121113115704*       10 WS-PRV-TAX-RATE         PIC S9(5)V9(2)   COMP-3.
026800121113115704*       10 WS-FED-TAX-RATE         PIC S9(5)V9(2)   COMP-3.
026900121113115704        10 WS-PRV-TAX-RATE         PIC S9(4)V9(5)   COMP-3.
027000121113115704        10 WS-FED-TAX-RATE         PIC S9(4)V9(5)   COMP-3.
027100110513  ¦           10 WS-COMPOUND-TAX         PIC X(1).
027200110513  ¦           10 WS-GST-AMT              PIC 9(9)V9(6) VALUE 0 COMP-3.
02730011051314388         10 WS-PST-AMT              PIC 9(9)V9(6) VALUE 0 COMP-3.
027400110513
027500110513           05 WS-MFR-SCHEDULE     PIC X(3)        VALUE " ".
027600110513      *RFS 34759 - Start
027700110513RF4697*       88 GRADUATED-SCHEDULE  VALUES "MR1" "MR2" "MR9" "MR3".
027800110513      *RFS 34759 - End
027900110513           05  WS-SYSDATE.
028000110513               10 WS-SYSDATE-CC          PIC 99.
028100110513               10 WS-SYSDATE-YMD-X.
028200110513                  15 WS-SYSDATE-YY       PIC 99.
028300110513                  15 WS-SYSDATE-MM       PIC 99.
028400110513                  15 WS-SYSDATE-DD       PIC 99.
028500110513           05  WS-SYSDATE-N REDEFINES WS-SYSDATE
028600110513                                         PIC 9(8).
028700110513      *RFS 91773 - Begin
028800110513           05  WS-SYSDATE-X REDEFINES WS-SYSDATE.
028900110513               10 WS-SYSDATE-CC-X        PIC XX.
029000110513               10 WS-SYSDATE-YMD.
029100110513                  15 WS-SYSDATE-YY-X     PIC XX.
029200110513                  15 WS-SYSDATE-MM-X     PIC XX.
029300110513                  15 WS-SYSDATE-DD-X     PIC XX.
029400110513      *RFS 91773 - End
029500110513           05  WS-SYSTIME-LONG.
029600110513               10 WS-SYSTIME.
029700110513                  15 WS-SYSTIME-HH       PIC 99.
029800110513                  15 WS-SYSTIME-MI       PIC 99.
029900110513                  15 WS-SYSTIME-SS       PIC 99.
030000110513               10 WS-SYSTIME-N REDEFINES WS-SYSTIME
030100110513                                         PIC 9(6).
030200110513               10 WS-SYSTIME-HS          PIC 99.
030300110513
030400110513      * RFS 79774 - Begin
030500110513           05 lc-MfrEfs-Edit             PIC X(01).
030600110513              88 MfrEfs-Exist            VALUES "Y".
030700110513              88 MfrEfs-NotExist         VALUES "N".
030800110513           05 lc-Acct-Attr               PIC X(5).
030900110513              88 ByMfr-Attr              VALUES "BYMFR".
031000110513           05 ln-Acct-No                 PIC S9(9) COMP-3.
031100110513           05 lc-Acct-Inv-Vars.
031200110513              10 ln-Curr-Unit-Bal        PIC S9(9)V9(3) COMP-3.
031300110513
031400110513       01  Screen-Edits-Allowed-Rec.
031500110513                             COPY DD-ALL-FORMATS OF MFAEDTSCP.
031600110513       01  Ws-Screen-Edits-Allowed.
031700110513           05 Ws-Sea-Edit-Sqllog           PIC X(1) VALUE "N".
031800110513           05 Ws-Sea-Return-Code           PIC X(2) VALUE "00".
031900110513
032000110513       01 Fxscedtalw-Vars.
032100110513          05 lc-MfrEfs-Screen-Code     PIC X(8) VALUE "MFRACT".
032200110513          05 lc-MfrEfs-Edit-Code       PIC X(6) VALUE "MFREFS".
032300110513          05 lc-MfrEfs-Level-Code      PIC X(1) VALUE "N".
032400110513      * RFS 79774 - End
032500110513
032600110513        01 WS-TRANS-DATE-ARRAY.
032700110513R15992*    05 WS-TRANS-BAL-ENTRY OCCURS 200 TIMES INDEXED BY TRNIDX
032800110513R92145*    05 WS-TRANS-BAL-ENTRY OCCURS 366 TIMES INDEXED BY TRNIDX
032900110513R92145*                                                      TIDXFROM
033000110513R92145*                                                      TIDXTO.
033100110513R92145     05 WS-TRANS-BAL-ENTRY OCCURS 400 TIMES INDEXED BY TRNIDX
033200110513R92145                                                       TIDXFROM
033300110513R92145                                                       TIDXTO.
033400110513              07 WS-T-DATE                PIC 9(8).
033500110513              07 WS-T-PRICE               PIC 9(4)V9999.
033600110513              07 WS-T-INVESTMENT-CODE     PIC X(5).
033700110513
033800110513              07 WS-T-UNIT-VALUE          PIC 9(9)V99.
033900110513              07 WS-T-UNIT-BALANCE        PIC 9(9)V999.
034000110513              07 WS-T-UNIT-ADJUST         PIC X(1).
034100110513R79774        07 WS-T-AVG-UNIT-COST       PIC 9(4)V9999.
034200171130167951*       07 WS-T-MFR-RATE            PIC 9(4)V999.
034300171130167951        07 WS-T-MFR-RATE            PIC 9(3)V9(6).
034400210729186019*       07 WS-T-MFR-VALUE           PIC 9(9)V999999.
034500210729186019        07 WS-T-MFR-VALUE           PIC S9(9)V999999.
034600110513R79774        07 WS-T-MV                  PIC 9(9)V99.
034700110513R79774        07 WS-T-BV                  PIC 9(9)V99.
034800110513
034900110513        01 WS-MFR-SCHEDULE-ARRAY.
035000110513           05 WS-MFR-SCHEDULE-ENTRY OCCURS 100 TIMES INDEXED BY MSIDX.
035100110513              07 WS-M-SCHEDULE            PIC X(3).
035200110513              07 WS-M-LOWER-LIMIT         PIC 9(11)V99 COMP-3.
035300110513              07 WS-M-UPPER-LIMIT         PIC 9(11)V99 COMP-3.
035400171130167951*       07 WS-M-RATE                PIC 9(4)V999 COMP-3.
035500171130167951        07 WS-M-RATE                PIC 9(3)V9(6) COMP-3.
035600110513
035700110513        01 WS-BUSINESS-DAY-ARRAY.
035800110513R15992*   05 WS-B-BUSINESS-DAY-ENTRY OCCURS 200 TIMES INDEXED BY BUDIDX,
035900110513R92145*   05 WS-B-BUSINESS-DAY-ENTRY OCCURS 366 TIMES INDEXED BY BUDIDX,
036000110513R92145*                                                          BUDMAX.
036100110513R92145    05 WS-B-BUSINESS-DAY-ENTRY OCCURS 400 TIMES INDEXED BY BUDIDX,
036200110513R92145                                                           BUDMAX.
036300110513              07 WS-B-BUDIDX-END               PIC X(1).
036400110513              07 WS-B-DATE                     PIC 9(8).
036500110513              07 WS-B-TRADING                  PIC X(1).
036600180316      *RFS1001473-Starts
03670018031679774 *       07 WS-B-INVESTMENT-ENTRY OCCURS 300 INDEXED BY BUDIDX2
036800180316              07 WS-B-INVESTMENT-ENTRY OCCURS 1500 INDEXED BY BUDIDX2
036900180316      *RFS1001473-Ends
03700011051379774                                                        BUDIDX2SV.
03710011051379774 *       07 WS-B-INVESTMENT-ENTRY OCCURS 100 INDEXED BY BUDIDX2
037200110513                 09 WS-B-BUDIDX2-END           PIC X(1).
037300110513                 09 WS-B-INVESTMENT-CODE       PIC X(5).
037400110513                 09 WS-B-PRICE                 PIC 9(4)V9999.
037500171011167951           09 WS-B-CURR                  PIC X(3).
037600171011167951           09 WS-B-EXCHG-RATE            PIC 9(3)V9(7).
037700110513
037800171116167951 01  lc_NullIndicator              PIC S9(4) BINARY.
037900110513       01  WS-TRANS-STATUS.
038000110513           05 WS-TRANS-STATUS-88   PIC X(3).
038100110513              88 HISTORY           VALUES "HST" "HSC".
038200110513              88 REVERSAL          VALUES "RVS".
038300110513
03840011051314388  01  WS-MFR-TRANSACTION      PIC X(3) VALUE "MFR".
038500110513
038600110513       01  WS-TRANS-TYPE.
038700110513           05 WS-TRANS-TYPE-88     PIC X(3).
038800110513              88 REDEMPTION        VALUES "SEL" "SWO" "TRO" "CQD"
038900110513                                          "TFE" "FEE" "SAJ".
039000110513
039100110513        01 WS-QBEGIN.
039200110513           03 WS-QBEGIN-YY              PIC 9(4) VALUE 0.
039300110513           03 WS-QBEGIN-MM              PIC 9(2) VALUE 0.
039400110513           03 WS-QBEGIN-DD              PIC 9(2) VALUE 0.
039500110513        01 WS-QBEGIN-N REDEFINES WS-QBEGIN
039600110513                                        PIC 9(8).
039700110513
039800110513        01 WS-QEND.
039900110513           03 WS-QEND-YY                PIC 9(4) VALUE 0.
040000110513           03 WS-QEND-MM                PIC 9(2) VALUE 0.
040100110513           03 WS-QEND-DD                PIC 9(2) VALUE 0.
040200110513        01 WS-QEND-N   REDEFINES WS-QEND
040300110513                                        PIC 9(8).
040400110513
040500110513        01 WS-QFROM.
040600110513           03 WS-QFROM-YY               PIC 9(4) VALUE 0.
040700110513           03 WS-QFROM-MM               PIC 9(2) VALUE 0.
040800110513           03 WS-QFROM-DD               PIC 9(2) VALUE 0.
040900110513        01 WS-QFROM-N  REDEFINES WS-QFROM
041000110513                                        PIC 9(8).
041100110513
041200110513        01 WS-QTO.
041300110513           03 WS-QTO-YY                 PIC 9(4) VALUE 0.
041400110513           03 WS-QTO-MM                 PIC 9(2) VALUE 0.
041500110513           03 WS-QTO-DD                 PIC 9(2) VALUE 0.
041600110513        01 WS-QTO-N    REDEFINES WS-QTO
041700110513                                        PIC 9(8).
041800110513      *RFS 49476 - Start
041900110513       01 lc-Reverse                    PIC X(1) VALUE " ".
042000110513          88 lc-Reverse-Y                   VALUE "Y".
042100110513      *RFS 49476 - End
042200110513
042300110513      *RFS 34759 - Start
042400110513       01 lc-ProcessDate.
042500110513          05 lc-AsAtDate              PIC X(8).
042600110513          05 li-AsAtDate REDEFINES lc-AsAtDate
042700110513                                      PIC 9(8).
042800210622          05 ln-AsAtDate REDEFINES lc-AsAtDate
042900210622                                      PIC S9(8).
043000110513          05 lc-ProcessDateOthers     PIC X(161).
043100110513
043200110513
043300110513       01 lc-ProductTypeRule           PIC X(1).
043400110513          88 lc-Phantom                     VALUE "3".
043500110513
043600110513       01 lc-InvestmentCode            PIC X(5) VALUE SPACES.
043700110513       01 lc-InvestmentCodeAAP         PIC X(5) VALUE SPACES.
043800110513       01 lc-InvestmentCodeAAH         PIC X(5) VALUE SPACES.
043900110513
044000110513       01 lb-EOFHolding                PIC X(1).
044100110513          88 lb-EOFHoldingTrue                  VALUE "T".
044200110513          88 lb-EOFHoldingFalse                 VALUE "F".
044300110622
044400110622R97579 01 lc_CloseInvestment           PIC X(1).
044500110622R97579    88 lb_CloseInvestment        VALUES "Y".
044600110622R97579 01 lc_SingleInvestCode          PIC X(5) VALUE SPACES.
044700110513
044800110513       01 lc-MFRGroupCode              PIC X(4) VALUE SPACES.
044900110513       01 lc-MFRCalcInd                PIC X(1) VALUE "F".
045000110513       01 lnc-G                        PIC X(1) VALUE "G".
045100110513R91773 01 lnc-Ind                      PIC X(1).
045200110513R91773    88 lnc-T                              VALUE "T".
045300110513R91773    88 lnc-S                              VALUE "S".
045400110513       01 lnc-Y                        PIC X(1) VALUE "Y".
045500110513       01 lc-ModelHdrEnd               PIC X(1) VALUE " ".
045600110513       01 ln-MfrAmtAAP                 PIC 9(9)V9(6) VALUE 0 COMP-3.
045700110513R38381*01 ln-GstAmtAAP                 PIC 9(9)V9(6) VALUE 0 COMP-3.
045800110513R38381*01 ln-PstAmtAAP                 PIC 9(9)V9(6) VALUE 0 COMP-3.
045900110513       01 lc-LoadBatchPrc              PIC X(1) VALUE " ".
046000110513      *RFS 34759 - End
046100110513      *RFS 79774 - Start
046200110513       01 LNC-A                        PIC X(1) VALUE "A".
046300110513       01 LNC-B                        PIC X(1) VALUE "B".
046400110513       01 LNC-M                        PIC X(1) VALUE "M".
046500110513      *RFS 79774 - End
046600110513
046700110513      *RFS 38381 - Begin
046800110513       01 WS-TOT-AMT-ARRAY.
046900110513R92145*    05 WS-TOT-AMT-ENTRY OCCURS 366 TIMES INDEXED BY TOT-IDX.
047000110518R92145     05 WS-TOT-AMT-ENTRY OCCURS 400 TIMES INDEXED BY TOT-IDX.
047100110513              07 TOT-AMT               PIC 9(8)V9999.
047200110513       01 ln-Phmframt                  PIC 9(8)V9999.
047300110513       01 lc-FileStatus                PIC XX        VALUE SPACES.
047400110513       01 ln-Idx                       PIC 9(4).
047500110513      *RFS 38381 - End
047600110513
047700110513      *RFS 92145 - Start
047800110513       01 lc_FXMFREUN-Parms.
047900110513          03 lc_FXMFREUN-Parameters.
048000110513             05 li_pa_Account-No           PIC S9(9).
048100110513             05 lc_pa_Investment-Code      PIC X(5).
048200110513             05 lc_pa_MFR-Group-Code       PIC X(4).
048300110513             05 li_pa_Trade-Date           PIC S9(8).
048400110513             05 ln_pa_Eligible-Units       PIC S9(10)V999.
048500110513             05 lc_pa_Return-Code          PIC X(2).
048600110513                88  nc_ReturnCodeOK        VALUE "00".
048700110513                88  nc_ReturnCodeFail      VALUE "99".
048800110513
048900110513       01 lc_MFR-Run-Type              PIC X(1).
049000110521          88 lb_AccACR-Run             VALUES "A".
049100110521          88 lb_AccCAL-Run             VALUES "B".
049200110513          88 lb_Cash-Run               VALUES "C".
049300110513          88 lb_Regular-Run            VALUES "R".
049400110513
049500110521       01 lc_MFR-Acc-Type              PIC X(1).
049600110521          88 lb_Accrual-Run            VALUES "Y".
049700110521          88 lb_NonAccrual-Run         VALUES "N".
049800110521
049900110513       01 ln_Open-Elig-Units        PIC 9(10)V9(3) VALUE 0 COMP-3.
050000110513       01 ln_Curr-Elig-Units        PIC 9(10)V9(3) VALUE 0 COMP-3.
050100110513       01 WS-TOT-PRICE              PIC 9(9)V999999 VALUE 0 COMP-3.
050200110513      *RFS 92145 - End
050300110513
050400171027      * RFS49699 - Begin
050500110513
050600110513       01 WS-ARRAY-LOG-MISC.
050700110513           05 WS-ARRAY1-NAME           PIC X(32)
050800110513                               VALUE "WS-TRANS-BAL-ENTRY".
050900110513           05 WS-ARRAY1-MAX            PIC 9(09)
051000110513R92145                         VALUE 400.
051100110513R92145*                        VALUE 366.
051200110513           05 WS-ARRAY1-MAX-USED       PIC 9(09)
051300110513                               VALUE 0.
051400110513           05 WS-ARRAY2-NAME           PIC X(32)
051500110513                               VALUE "WS-MFR-SCHEDULE-ENTRY".
051600110513           05 WS-ARRAY2-MAX            PIC 9(09)
051700110513                               VALUE 100.
051800110513           05 WS-ARRAY2-MAX-USED       PIC 9(09)
051900110513                               VALUE 0.
052000110513           05 WS-ARRAY3-NAME           PIC X(32)
052100110513                               VALUE "WS-B-BUSINESS-DAY-ENTRY".
052200110513           05 WS-ARRAY3-MAX            PIC 9(09)
052300110513R92145                         VALUE 400.
052400110513R92145*                        VALUE 366.
052500110513           05 WS-ARRAY3-MAX-USED       PIC 9(09)
052600110513                               VALUE 0.
052700110513           05 WS-ARRAY4-NAME           PIC X(32)
052800110513                               VALUE "WS-B-INVESTMENT-ENTRY".
052900110513           05 WS-ARRAY4-MAX            PIC 9(09)
053000110513                               VALUE 100.
053100110513           05 WS-ARRAY4-MAX-USED       PIC 9(09)
053200110513                               VALUE 0.
053300110513           05 WS-ARRAY5-NAME           PIC X(32)
053400110513                               VALUE "WS-TOT-AMT-ENTRY".
053500110513           05 WS-ARRAY5-MAX            PIC 9(09)
053600110513R92145                         VALUE 400.
053700110513R92145*                        VALUE 366.
053800110513           05 WS-ARRAY5-MAX-USED       PIC 9(09)
053900110513                               VALUE 0.
054000110513
054100171027      * RFS49699 - End
054200110513
054300110513      *rfs42749
054400110513       01 lc-Constants.
054500110513          05 lc-S                      PIC X(1) VALUE "S".
054600210716      *RFS 186019 - Begins
054700210802          05 lc-T                      PIC X(1) VALUE "T".
054800210716      *RFS 186019 - Ends
054900110513      *rfs42749
055000171027      *RFS91773 - Begin
055100110513       01 lnc-25                       pic 9(02) VALUE 25.
055200110513       01 lnc-100                      pic S9(03) VALUE +100.
055300110513       01 lc-tradedate                 PIC S9(9) COMP-3.
055400110520       01 lc-Tradingdate               PIC S9(9) COMP-3.
055500110701      *RFS97581 - START
055600110701       01 lc-MFRTradedate              PIC S9(8).
055700110701       01 lc-Origin                    PIC X(01).
055800110705       01 lc-GroupCode                 PIC X(06).
055900110701       01 lc-Account                   PIC X(09).
056000110701       01 lnc-Orgind                   PIC X(1).
056100110701          88 lncc-A                              VALUE "A".
056200110701          88 lncc-D                              VALUE "D".
056300110701          88 lncc-G                              VALUE "G".
056400110701          88 lncc-I                              VALUE "I".
056500110701          88 lncc-R                              VALUE "R".
056600110701      *RFS97581 - END
056700110520       01 lc-cash                      PIC X(4) VALUE "CASH".
056800110513       01 lc-Calculation               PIC X(1).
056900110513          88 lc-Calculationend                  VALUE "N".
057000110513       01 lc-cursor                    PIC X(1).
057100110513          88 lc-Endcursor                        VALUE "N".
057200110513       01 lc-Dealercode                PIC X(04) VALUE SPACES.
057300110707       01 lc-Totalmfr                  PIC 9(11)V9(06) COMP-3
057400110513                                                 VALUE ZEROS.
057500110513       01 lc-Avgunitcost               PIC S9(4)V9999 COMP-3
057600110513                                                 VALUE ZEROS.
057700110513       01 lc-Marketval                 PIC S9(9)V99 COMP-3
057800110513                                                 VALUE ZEROS.
057900110513       01 lc-Dlrrepcode                PIC X(06) VALUE SPACES.
058000110513       01 lc-Dlracctnum                PIC X(15) VALUE SPACES.
058100110513       01 lc-Investornum               PIC X(09) VALUE SPACES.
058200110513       01 lc-Dealername                PIC X(35) VALUE SPACES.
058300110513       01 lc-Repfstname                PIC X(20) VALUE SPACES.
058400110513       01 lc-Repname                   PIC X(45) VALUE SPACES.
058500110513       01 lc-Replstname                PIC X(20) VALUE SPACES.
058600110513       01 lc-Invfstname                PIC X(20) VALUE SPACES.
058700110513       01 lc-Invlstname                PIC X(20) VALUE SPACES.
058800110513       01 lc-Invname                   PIC X(45) VALUE SPACES.
058900110513       01 lc-Invgrpname                PIC X(35) VALUE SPACES.
059000110513       01 lc-Descr                     PIC X(25) VALUE SPACES.
059100110513       01 lc-MFRname                   PIC X(25) VALUE SPACES.
059200110705       01 lc-MFRhostname               PIC X(30) VALUE SPACES.
059300110513       01 lc-Count                     PIC 9(02) VALUE ZEROS.
059400110513       01 lc-Count1                    PIC 9(02) VALUE ZEROS.
059500110513       01 lc-Numberofdays              PIC S9(05)
059600110513                                                 VALUE ZEROS.
059700110520       01 lc-Totmarval1                PIC S9(11)V9(04) COMP-3
059800110520                                                 VALUE ZEROS.
059900110513       01 lc-Totmarval                 PIC S9(11)V9(02) COMP-3
060000110513                                                 VALUE ZEROS.
060100110513       01 lc-lowerlimit                PIC S9(11)V9(02) COMP-3
060200110513                                                 VALUE ZEROS.
060300110513       01 lc-totalunit                 PIC S9(11)V9(02) COMP-3
060400110513                                                 VALUE ZEROS.
060500110513       01 lc-Unitbalance               PIC S9(9)V999 COMP-3
060600110513                                                 VALUE ZEROS.
060700171027      * RFS91773 - End
060800110513
060900171130      *RFS167951 Starts
061000171130       01 lc_WorkVariables.
061100171130          03 lc_ABRule                PIC  X(1).
061200171130          03 ln_InvestorNo            PIC  S9(9).
061300171130          03 ln_Prev_InvestorNo       PIC  S9(9).
061400171130          03 ln_AccountNo             PIC  S9(9).
061500171130          03 ln_Prev_AccountNo        PIC  S9(9).
061600171130          03 ln_Count                 PIC  S9(9).
061700171130          03 lc_MfrSchdCode           PIC  X(3).
061800171130          03 lc_OvrrideSchd           PIC  X(3).
061900171130          03 lc_MFR_Grp_code          PIC  X(4).
062000171130          03 lc_InvestmentCode        PIC  X(5).
062100171130          03 ld_TradeDte              PIC S9(8).
062200171130          03 ln_InvAssetAmt           PIC S9(11)V99.
062300171130          03 ln_InvMarketValue        PIC S9(11)V99.
062400171130          03 ln_TotAssetsAmt          PIC S9(11)V99.
062500210622      *RFS 186019 - Begins
062600210623          03 ln_TotAssetsAmt_A        PIC S9(11)V99.
062700210714          03 ln_SecondaryAssetsAmt    PIC S9(11)V99.
062800210802          03 lc_EligibleForprocess    PIC  X(1)      VALUE " ".
062900210622      *RFS 186019 - Ends
063000171130          03 ln_TotMarketValue        PIC S9(11)V99.
063100171130          03 ln_TotMfrAmt             PIC S9(9)V9(6) VALUE 0 COMP-3.
063200171130          03 ln_MfrTot                PIC S9(9)V9(6) VALUE 0 COMP-3.
063300171130          03 lc_AS_Rule               PIC  X(1).
063400171130          03 lc_AS_MFR_Grp_code       PIC  X(4).
063500171130          03 lc_Prev_MFRGrpCode       PIC  X(3).
063600171130          03 WS-EXCHANGE-RATE         PIC S9(3)V9(7) VALUE 0.
063700171130          03 lc_BaseCurrency          PIC  X(3).
063800171130          03 ln_Prev_TradeDate        PIC S9(8).
063900171130          03 ln_StartDate             PIC S9(8).
064000171130          03 ln_EndDate               PIC S9(8).
064100171130          03 lc_ExchangeRateType      PIC  X(1).
064200171130          03 ld_ExchgTradeDte         PIC  9(8).
064300180109      *RFS1000551-Starts
064400180109          03 li_FetchedRows           PIC S9(4)      VALUE   0.
064500180109          03 li_RowNo                 PIC S9(4)      VALUE   0.
064600180109      *RFS1000551-Ends
064700180129177476    03 lc_SameCurr              PIC  X(1)      VALUE   SPACE.
064800180107
064900180109      *RFS1000551-Starts
065000180109       01 li_FetchMax                 PIC S9(4)      VALUE 5000.
065100180109      *RFS1000551-Ends
065200180107
065300180109      *RFS1000551-Starts
065400180107       01 lc_FetchArrayRec.
065500180109         02 lc_FArrayRec OCCURS 5000 TIMES.
065600180107          03 ln_FArray_TradeDate      PIC S9(8).
065700180107          03 lc_FArray_MFRGrpCode     PIC  X(4).
065800180107          03 ln_FArray_InvestorNo     PIC S9(9).
065900180107          03 ln_FArray_AccountNo      PIC S9(9).
066000180107          03 ln_FArray_AssetsByRule   PIC  X(1).
066100180107          03 ln_FArray_MfrSchdCode    PIC  X(3).
066200180107          03 ln_FArray_TotAssetsAMT   PIC S9(11)V99.
066300180107          03 ln_FArray_TotMarketValue PIC S9(11)V99.
066400180107
066500180107       01 ltb_NullIndicatorsTable.
066600180109         02 ltb_Indicators OCCURS 5000 TIMES.
066700180107          03 ltb_Indicator            PIC S9(04)  BINARY
066800180107                           OCCURS 08  TIMES.
066900180109      *RFS1000551-Ends
067000171130       01 lc_FetchFields.
067100180109      *RFS1000551-Starts
067200180109         02 lc_FetchRec.
067300180109      *RFS1000551-Ends
067400171130          03 ln_Fetch_TradeDate       PIC  S9(8).
067500171130          03 lc_Fetch_MFRGrpCode      PIC  X(4).
067600171130          03 ln_Fetch_InvestorNo      PIC  S9(9).
067700171130          03 ln_Fetch_AccountNo       PIC  S9(9).
067800180109      *RFS1000551-Starts
067900180109      *   03 ln_Fetch_InvestmentCode  PIC  X(5).
068000180109      *RFS1000551-Ends
068100171130          03 ln_Fetch_AssetsByRule    PIC  X(1).
068200171130          03 ln_Fetch_MfrSchdCode     PIC  X(3).
068300171130          03 ln_Fetch_TotAssetsAMT    PIC S9(11)V99.
068400171130          03 ln_Fetch_TotMarketValue  PIC S9(11)V99.
068500171130
068600171130       01 lc_IvrAcclvl                   PIC X(1).
068700171130          88 lb_IvrAccLvlYes             VALUES "Y".
068800171130          88 lb_IvrAccLvlNo              VALUES "N".
068900171130       01 lc-CurEnd                      PIC X(1).
069000171130          88 lc-EndcursorYes             VALUE "Y".
069100171130          88 lc-EndcursorNo              VALUE "N".
069200171130       01 lc-ASRcursor                   PIC X(1).
069300171130          88 lc-EndASRcursorYes          VALUE "Y".
069400171130          88 lc-EndASRcursorNo           VALUE "N".
069500171130       01 lc-ASBOneOnly                  PIC X(1).
069600171130          88 lc-ASBOneOnlyYes            VALUE "Y".
069700171130          88 lc-ASBOneOnlyNo             VALUE "N".
069800171130
069900171130      * Error Codes, Uniquely Identify where the error happened
070000171130       01  WS-ERR-CODE               PIC  X(02)   VALUE SPACES.
070100171130         88  lncc_Err-Ok                          VALUE SPACES.
070200171130         88  lncc_Err-01                          VALUE "01".
070300171130         88  lncc_Err-02                          VALUE "02".
070400171130         88  lncc_Err-03                          VALUE "03".
070500171130         88  lncc_Err-04                          VALUE "04".
070600171130         88  lncc_Err-05                          VALUE "05".
070700171130         88  lncc_Err-06                          VALUE "06".
070800171130         88  lncc_Err-07                          VALUE "07".
070900171130         88  lncc_Err-08                          VALUE "08".
071000171130         88  lncc_Err-09                          VALUE "09".
071100171130         88  lncc_Err-10                          VALUE "10".
071200171130         88  lncc_Err-11                          VALUE "11".
071300171130         88  lncc_Err-12                          VALUE "12".
071400171130         88  lncc_Err-13                          VALUE "13".
071500171130         88  lncc_Err-14                          VALUE "14".
071600171130         88  lncc_Err-15                          VALUE "15".
071700171130         88  lncc_Err-16                          VALUE "16".
071800180129      *RFS177476-Starts
071900180129         88  lncc_Err-17                          VALUE "17".
072000180129         88  lncc_Err-18                          VALUE "18".
072100210802      *RFS186019 - starts
072200210802         88  lncc_Err-19                          VALUE "19".
072300210802         88  lncc_Err-20                          VALUE "20".
072400210802         88  lncc_Err-21                          VALUE "21".
072500210802      *RFS186019 - Ends
072600180129      *RFS177476-Ends
072700171130
072800171130      * Error Desc,Uniquely Identify where the error happened
072900171130        01  lc_ErrorDescr.
073000171130          03  lc_ErrCodeDescr01          PIC  X(80)   VALUE
073100171130                "Issue in Checking Count".
073200171130          03  lc_ErrCodeDescr02          PIC  X(80)   VALUE
073300171130                "Issue in getting override schedule".
073400171130          03  lc_ErrCodeDescr03          PIC  X(80)   VALUE
073500171130                "Issue in Opening Cursor TOT_MFR_CUR".
073600171130          03  lc_ErrCodeDescr04          PIC  X(80)   VALUE
073700171130                "Issue in Fetching Cursor TOT_MFR_CUR".
073800171130          03  lc_ErrCodeDescr05          PIC  X(80)   VALUE
073900171130                "Issue in creating QTEMP/TMPHHLDIVR".
074000171130          03  lc_ErrCodeDescr06          PIC  X(80)   VALUE
074100171130                "Issue in Inserting QTEMP/TMPHHLDIVR".
074200171130          03  lc_ErrCodeDescr07          PIC  X(80)   VALUE
074300171130                "Issue in Creating QTEMP/TMPACCINV".
074400171130          03  lc_ErrCodeDescr08          PIC  X(80)   VALUE
074500171130                "Issue in Declaring MFR_TOT_CUR".
074600171130          03  lc_ErrCodeDescr09          PIC  X(80)   VALUE
074700171130                "Issue in Inserting QTEMP/TMPACCINV".
074800171130          03  lc_ErrCodeDescr10          PIC  X(80)   VALUE
074900171130                "Issue in UPDATE-ASSET-AMT-INV-LEVEL".
075000171130          03  lc_ErrCodeDescr11          PIC  X(80)   VALUE
075100171130                "Issue in UPDATE-ASSET-AMT-ACC-LEVEL".
075200171130          03  lc_ErrCodeDescr12          PIC  X(80)   VALUE
075300171130                "Issue in UPDATE-ASSET-AMT-IVR-LEVEL".
075400171130          03  lc_ErrCodeDescr13          PIC  X(80)   VALUE
075500171130                "Issue in getting Total asset amt".
075600171130          03  lc_ErrCodeDescr14          PIC  X(80)   VALUE
075700171130                "Issue in UPDATE-MARKET-VALUE-INV-LEVEL".
075800171130          03  lc_ErrCodeDescr15          PIC  X(80)   VALUE
075900171130                "Issue in UPDATE-MARKET-VALUE-ACC-LEVEL".
076000171130          03  lc_ErrCodeDescr16          PIC  X(80)   VALUE
076100171130                "Issue in UPDATE-MARKET-VALUE-IVR-LEVEL".
076200171130      *RFS167951 Ends
076300180129      *RFS177476-Starts
076400180129          03  lc_ErrCodeDescr17          PIC  X(80)   VALUE
076500180129                "Issue in UPDATE-SAME-CURR-ACC-LEVEL".
076600180129          03  lc_ErrCodeDescr18          PIC  X(80)   VALUE
076700180129                "Issue in UPDATE-SAME-CURR-IVR-LEVEL".
076800210802      *RFS186019 - starts
076900210802          03  lc_ErrCodeDescr19          PIC  X(80)   VALUE
077000210802                "Issue in UPDATE-ASSET-AMT-IVR-SIN-LEVEL".
077100210802          03  lc_ErrCodeDescr20          PIC  X(80)   VALUE
077200210802                "Issue in UPDATE-MARKET-VALUE-IVR-SIN-LEVEL".
077300210802          03  lc_ErrCodeDescr21          PIC  X(80)   VALUE
077400210802                "Issue in UPDATE-SAME-CURR-IVR-SAME-SIN-LEVEL".
077500210802      *RFS1866019 - Ends
077600180129      *RFS177476-Ends
077700171027      * Copybooks
077800110513
077900171027      * RFS49699 - Begin
078000171027
078100171027      *  screen edits allowed
078200110513           copy CPSCEDTAL1.
078300110513
078400171027      *  log array info
078500110513           copy CPFXLOGAU.
078600110513
078700171027      *  log array table name
078800110513           copy CPFXLOGAT.
078900110513
079000171027      * RFS49699 - End
079100171017
079200171130      *RFS167951 Starts
079300171130      *  Sql Error Handling Copy Book
079400171130           COPY CPYSQLFLD
079500171130               REPLACING == "CURRENT_PROGRAM" == BY == "MFRCALC2" ==.
079600171130      *RFS167951 Ends
079700110513
079800110513           EXEC SQL
079900110513              INCLUDE SQLCA
080000110513              END-EXEC.
080100110513
080200110513       LINKAGE SECTION.
080300110513        01 COMM-PROCESS-OPTION          PIC X(1).
080400110513      * 'B' = Batch process, and does not require the following parms.
080500110513      * 'O' = On-line process, and requires the following parms:
080600110513
080700110513        01  COMM-MFR-SCHEDULE           PIC X(3).
080800110513        01  COMM-ACCOUNT-NO             PIC 9(9).
080900110513        01  COMM-INVESTMENT-CODE        PIC X(5).
081000110513        01  COMM-FROM-DATE              PIC 9(8).
081100110513        01  COMM-TO-DATE                PIC 9(8).
081200110513        01  COMM-REJECTION-CODE         PIC X(3).
081300110513        01  COMM-CALCULATED-AMT         PIC S9(11)V99.
081400110513        01  COMM-PST-AMT                PIC S9(11)V99.
081500110513        01  COMM-GST-AMT                PIC S9(11)V99.
081600110513      *RFS 34759 - Start
081700110513        01  Comm-MFR-Group-Code         PIC X(4).
081800110513      *RFS 34759 - End
081900110513R91773  01 COMM-MFR-RUN-TYPE            PIC X(1).
082000110518R92145*** 'A' = Accrual Run, 'C' = Cash Run, 'R' = Regular Run.
082100110513
082200110513      /
082300110513       PROCEDURE DIVISION USING COMM-PROCESS-OPTION
082400110513                                COMM-MFR-SCHEDULE
082500110513                                COMM-ACCOUNT-NO
082600110513                                COMM-INVESTMENT-CODE
082700110513                                COMM-FROM-DATE
082800110513                                COMM-TO-DATE
082900110513                                COMM-REJECTION-CODE
083000110513                                COMM-CALCULATED-AMT
083100110513                                COMM-PST-AMT
083200110513                                COMM-GST-AMT
083300110513      *RFS 34759 - Start
083400110513      *RFS 91773                Comm-MFR-Group-Code.
083500110513R91773                          Comm-MFR-Group-Code
083600110513R91773                          COMM-MFR-RUN-TYPE.
083700110513
083800110513      *MAINLINE.
083900110513       MAINLINE SECTION.
084000110513      *RFS 34759 - End
084100110513           PERFORM INITIAL-LOGIC.
084200110513           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
084300110513              GO TO ML-1200.
084400110513       ML-0010.
084500110513           PERFORM GET-CURRENT-RECORD.
084600110513       ML-0020.
084700110513           IF PREV-LEVEL1 IS EQUAL TO CURR-LEVEL1
084800110513              GO TO ML-1100.
084900110513           IF PREV-CONTROLS IS EQUAL TO LOW-VALUES
085000110513              GO TO ML-0040.
085100110513       ML-0030.
085200110513       ML-0040.
085300110513           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
085400110513              GO TO ML-1200.
085500110513       ML-0050.
085600110513       ML-0100.
085700110513       ML-1100.
085800110513      *RFS 34759 - Start
085900110513           IF NOT lc-Phantom
086000110513      *RFS 34759 - End
086100110513           PERFORM DETAIL-PROCESSING.
086200110513           GO TO ML-0010.
086300110513       ML-1200.
086400110513           PERFORM END-JOB.
086500110513      *RFS 34759 - Start
086600110513      *    STOP RUN.
086700110513           GOBACK.
086800110513      *RFS 34759 - End
086900110513      /
087000110513       GET-CURRENT-RECORD SECTION.
087100110513
087200110513      *RFS 34759 - Start   -Initialize amounts for AAP fund.
087300110513           INITIALIZE ln-MfrAmtAAP.
087400110513R38381*               ln-GstAmtAAP
087500110513R38381*               ln-PstAmtAAP.
087600110513      *RFS 34759 - End
087700210707      *
087800210707
087900110513
088000110513      * RFS 79774 - Begin
088100110513           MOVE SPACES TO lc-Acct-Attr.
088200110513           MOVE ZEROES TO ln-Curr-Unit-Bal.
088300110513      * RFS 79774 - end
088400110513
088500110513           IF WS-FIRST-READ-SW IS NOT EQUAL TO "Y"
088600110513             GO TO GCR-0005-BATCH-OPTION
088700110513           END-IF.
088800110513
088900110513           MOVE "N"          TO WS-FIRST-READ-SW.
089000110513           GO TO GCR-0008-BATCH-OPTION.
089100110513
089200110513       GCR-0005-BATCH-OPTION.
089300110513
089400110513           IF COMM-PROCESS-OPTION = "O"
089500110513             MOVE HIGH-VALUES TO CURR-CONTROLS
089600110513             GO TO GCR-EXIT
089700110513           END-IF.
089800171012
089900171014167951     IF lb_IvrAccLvlNo
090000110513
090100110513           READ MFR-PROCESS NEXT RECORD
090200110513           AT END
090300110518R91773       IF lb_Cash-Run
090400110513R91773          PERFORM TOTAL-SLIDING-CALCULATION
090500110513R91773       END-IF
090600110513             MOVE HIGH-VALUES TO CURR-CONTROLS
090700171130      *RFS167951 Starts
090800171012      *      GO TO GCR-EXIT.
090900171012             GO TO GCR-EXIT
091000171027             END-READ
091100171130           ELSE
091200171130           READ MFR-PROCESS NEXT RECORD
091300171130           AT END
091400171130             PERFORM ACC-IVR-HHLD-TOT-MFR-PROCESS
091500171130             SET lb_IvrAccLvlNo TO TRUE
091600171130             GO TO INT-001
091700171130           END-READ
091800171130           END-IF.
091900171130      *RFS167951 Ends
092000110513
092100110513       GCR-0008-BATCH-OPTION.
092200110513
092300110513           IF COMM-PROCESS-OPTION = "O"
092400110513             GO TO GCR-0008-ON-LINE-OPTION
092500110513           END-IF.
092600110513      *RFS 91773 - Begin
092700110518           IF lb_Cash-Run
092800110513              IF MFR-TYPE-CODE OF MFR-PROCESS = lc-cash
092900110513                 CONTINUE
093000110513              ELSE
093100110513                 GO TO GCR-0005-BATCH-OPTION
093200110513              END-IF
093300110513           END-IF.
093400110513      *RFS 91773 - End
093500110513
093600110513           IF MIN-DATE OF MFR-PROCESS      = 0   OR
093700110513              MAX-DATE OF MFR-PROCESS      = 0   OR
093800110513              FROM-DATE OF MFR-PROCESS     = 0   OR
093900110513              TO-DATE OF MFR-PROCESS       = 0   OR
094000110513              DAYS-IN-RANGE OF MFR-PROCESS < 1   OR
094100110513R92145*       DAYS-IN-RANGE OF MFR-PROCESS > 185
094200110513R92145       (DAYS-IN-RANGE OF MFR-PROCESS > 185 AND
094300110513R92145        NOT lb_Accrual-Run)                OR
094400110513R92145       (DAYS-IN-RANGE OF MFR-PROCESS > 400 AND
094500110513R92145        lb_Accrual-Run)
094600110513             MOVE "51"       TO WS-REJECTION-CODE
094700110513             PERFORM REJECTION-ROUTINE
094800110513             GO TO GCR-0005-BATCH-OPTION
094900110513           END-IF.
095000110513
095100110513
095200110513           MOVE MFR-SCHEDULE-CODE OF MFR-PROCESS
095300171130                             TO WS-MFR-SCHEDULE.
095400110513           MOVE FROM-DATE OF MFR-PROCESS
095500110513                             TO WS-QFROM-N.
095600110513           MOVE TO-DATE OF MFR-PROCESS
095700110513                             TO WS-QTO-N.
095800110513
095900110513           MOVE ACCOUNT-NO OF MFR-PROCESS
096000171012167951*                      TO ACCOUNT-NO OF ACCOUNT-INVESTMENT.
096100171012167951                       TO ACCOUNT-NO OF ACCOUNT-INVESTMENT
096200171012167951                       ln_AccountNo.
096300171012
096400171130      *RFS167951 Starts
096500171130           MOVE MFR-GROUP-CODE OF MFR-PROCESS
096600171130                               TO lc_MFR_Grp_code.
096700171130
096800171130           MOVE INVESTMENT-CODE OF MFR-PROCESS
096900171130                                TO lc_InvestmentCode.
097000171130
097100171130           PERFORM GET-OVER-RIDE-MFR-SCHD-CODE.
097200171130      *RFS167951 Ends
097300110513
097400110513      *RFS 34759 - Start
097500171012167951     IF lb_IvrAccLvlNo
097600110513           PERFORM Get-Product-Type-Rule
097700171012167951     END-IF.
097800171012
097900110513           IF NOT lc-Phantom
098000110513              MOVE Investment-Code OF Mfr-Process
098100110513                TO Investment-Code OF Account-Investment
098200110513              GO TO GCR-0009
098300110513           END-IF.
098400110513
098500110513           IF lc-Phantom
098600110513      *RFS 38381 - Begin
098700110513              PERFORM INIT-ARRAY-AMT
098800110513              VARYING TOT-IDX  FROM 1 BY 1
098900110513              UNTIL TOT-IDX  IS GREATER THAN BUDMAX
099000110513      *RFS 38381 - End
099100110513              MOVE Investment-Code OF MFR-Process
099200110513                TO lc-InvestmentCodeAAP
099300110513              PERFORM Get-Holding-Fund-Start
099400110513              PERFORM Get-Next-Holding-Fund
099500110513           END-IF.
099600110513
099700110513       GCR-0008-BATCH-OPTION-01.
099800110513           IF lb-EOFHoldingFalse
099900110513              IF lc-InvestmentCodeAAH NOT = " "
100000110513                 MOVE lc-InvestmentCodeAAH
100100110513                   TO Investment-Code OF Account-Investment
100200110513                 GO TO GCR-0009
100300110513              ELSE
100400110513                 PERFORM Get-Next-Holding-Fund
100500110513                 GO TO GCR-0008-BATCH-OPTION-01
100600110513              END-IF
100700110513           END-IF.
100800110513           IF lb-EOFHoldingTrue
100900110513              GO TO GCR-9999
101000110513           END-IF.
101100110513      *RFS 34759 - End
101200110513
101300110513           GO TO GCR-0009.
101400110513
101500110513       GCR-0008-ON-LINE-OPTION.
101600110513
101700110513           IF COMM-FROM-DATE               = 0   OR
101800110513              COMM-TO-DATE                 = 0
101900110513             MOVE "51"       TO WS-REJECTION-CODE
102000110513             PERFORM REJECTION-ROUTINE
102100110513             GO TO GCR-0005-BATCH-OPTION
102200110513           END-IF.
102300110513
102400110513
102500110513           MOVE COMM-MFR-SCHEDULE
102600110513                             TO WS-MFR-SCHEDULE.
102700110513           MOVE COMM-FROM-DATE
102800110513                             TO WS-QFROM-N.
102900110513           MOVE COMM-TO-DATE TO WS-QTO-N.
103000110513
103100110513           MOVE COMM-ACCOUNT-NO
103200110513                             TO ACCOUNT-NO OF ACCOUNT-INVESTMENT.
103300110513
103400110513      *RFS 34759 - Start
103500110513           PERFORM Get-Product-Type-Rule
103600110513           IF NOT lc-Phantom
103700110513              MOVE Comm-Investment-Code
103800110513                TO Investment-Code OF Account-Investment
103900110513              GO TO GCR-0009
104000110513           END-IF.
104100110513
104200110513           IF lc-Phantom
104300110513      *RFS 38381 - Begin
104400110513              PERFORM INIT-ARRAY-AMT
104500110513              VARYING TOT-IDX  FROM 1 BY 1
104600110513              UNTIL TOT-IDX  IS GREATER THAN BUDMAX
104700110513      *RFS 38381 - End
104800110513              MOVE Comm-Investment-Code
104900110513                TO lc-InvestmentCodeAAP
105000110513              PERFORM Get-Holding-Fund-Start
105100110513              PERFORM Get-Next-Holding-Fund
105200110513           END-IF.
105300110513
105400110513       GCR-0008-ON-LINE-OPTION-01.
105500110513           IF lb-EOFHoldingFalse
105600110513              IF lc-InvestmentCodeAAH NOT = " "
105700110513                 MOVE lc-InvestmentCodeAAH
105800110513                   TO Investment-Code OF Account-Investment
105900110513                 GO TO GCR-0009
106000110513              ELSE
106100110513                 PERFORM Get-Next-Holding-Fund
106200110513                 GO TO GCR-0008-ON-LINE-OPTION-01
106300110513              END-IF
106400110513           END-IF.
106500110513           IF lb-EOFHoldingTrue
106600110513              GO TO GCR-9999
106700110513           END-IF.
106800110513      *RFS 34759 - End
106900110513
107000110513       GCR-0009.
107100110513      * RFS 79774 - Begin
107200110513
107300110513           MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT
107400110513             TO ln-Acct-No.
107500110513
107600110513           EXEC SQL
107700110513             SELECT COALESCE(ACATP.ACCOUNT_ATTRIBUTE_CODE, " ")
107800110513                INTO :lc-Acct-Attr
107900110513                FROM MFAACCATP ACATP
108000110513             WHERE ACATP.ACCOUNT_NO = :ln-Acct-No AND
108100110513                   ACATP.ACCOUNT_ATTRIBUTE_CODE = "BYMFR"
108200110513           END-EXEC.
108300110513      * RFS 79774 - end
108400110513
108500110513           READ  ACCOUNT-INVESTMENT
108600110513           INVALID KEY
108700110513             MOVE "50"       TO WS-REJECTION-CODE
108800110513             PERFORM REJECTION-ROUTINE
108900110513             GO TO GCR-0005-BATCH-OPTION.
109000110513
109100110513      *RFS 92145 - Strat
109200110518           If lb_Accrual-Run
109300110513              MOVE Account-No       OF Account-Investment
109400110513                                    TO Account-No
109500110513                                    OF Account-MFR-Accrual
109600110513              MOVE Investment-Code  OF Account-Investment
109700110513                                    TO Investment-Code
109800110513                                    OF Account-MFR-Accrual
109900110519              IF Comm-Process-Option = "O"
110000110519                 MOVE Comm-MFR-Group-Code
110100110519                                     TO MFR-Group-Code
110200110519                                     OF Account-MFR-Accrual
110300110519              ELSE
110400110519                 MOVE MFR-Group-Code OF MFR-Process
110500110519                                     TO MFR-Group-Code
110600110519                                     OF Account-MFR-Accrual
110700110519              END-IF
110800110519
110900110513              READ  Account-Mfr-Accrual NO LOCK
111000110513              INVALID KEY
111100110518      ** MFR Accrual record NOT found - reject with code "M55"
111200110518               MOVE "M55"       TO WS-REJECTION-CODE
111300110513               PERFORM REJECTION-ROUTINE
111400110513               GO TO GCR-0005-BATCH-OPTION
111500110513              END-READ
111600110513
111700110513      **
111800110513      ** Call function to get eligible units at the From-Date
111900110513      **
112000110513              MOVE Account-No OF Account-Mfr-Accrual
112100110513                          TO li_pa_Account-No
112200110513              MOVE Investment-Code OF Account-Mfr-Accrual
112300110513                          TO lc_pa_Investment-Code
112400110519              IF Comm-Process-Option = "O"
112500110520                 MOVE Comm-MFR-Group-Code TO lc_pa_MFR-Group-Code
112600110519              ELSE
112700110519                 MOVE MFR-Group-Code OF MFR-Process
112800110520                                     TO lc_pa_MFR-Group-Code
112900110519              END-IF
113000110513              MOVE WS-QFROM-N   TO li_pa_Trade-Date
113100110513
113200110513              CALL "FXMFREUN" USING Lc_FXMFREUN-Parms
113300110513
113400110518      ** If no Eligible Units found - reject with code "M56"
113500110513              IF lc_pa_Return-Code NOT = "00"
113600110513                 OR ln_pa_Eligible-Units = 0
113700110518                 MOVE "M56"       TO WS-REJECTION-CODE
113800110513                 PERFORM REJECTION-ROUTINE
113900110513                 GO TO GCR-0005-BATCH-OPTION
114000110513              ELSE
114100110513                 MOVE ln_pa_Eligible-Units TO ln_Open-Elig-Units
114200110513                                              ln_Curr-Elig-Units
114300110513              END-IF
114400110513           END-IF.
114500110513
114600110513      *RFS 92145 - End
114700110513
114800110513       GCR-0010.
114900110513
115000110513           SET BUDIDX        TO 1.
115100110513           SET BUDIDX2       TO 1.
115200110513R79774*    SET BUDIDX2       DOWN BY 1.
115300110513
115400110513           SEARCH WS-B-INVESTMENT-ENTRY VARYING BUDIDX2
115500110513           WHEN WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2) IS EQUAL
115600110513           INVESTMENT-CODE OF ACCOUNT-INVESTMENT
115700110513             SET BUDIDX2SV   TO BUDIDX2
115800110513             GO TO GCR-INVESTMENT-FOUND.
115900110513
116000110513           MOVE "04"         TO WS-REJECTION-CODE.
116100110513           PERFORM REJECTION-ROUTINE.
116200110513           GO TO GCR-0005-BATCH-OPTION.
116300110513
116400110513
116500110513       GCR-INVESTMENT-FOUND.
116600110513
116700110513      ** ESTABLISH STARTING BALANCE
116800110513
116900110513           MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT
117000110513R91773**                     TO ACCOUNT-NO OF TRANS.
117100110513R91773                       TO ACCOUNT-NO OF TRANS
117200110513R91773                          ln-Acct-No.
117300110513           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT
117400110513R91773**                     TO INVESTMENT-CODE OF TRANS.
117500110513R91773                       TO INVESTMENT-CODE OF TRANS
117600110513R91773                          lc-InvestmentCode.
117700110513      * RFS 91773 & 92145 - Begin
117800110513              MOVE WS-QFROM-N   TO TRADE-DATE OF TRANS
117900110513                                   lc-tradedate
118000110516      *       MOVE WS-QFROM-N   TO PROCESS-DATE OF TRANS
118100110516      * RFS 91773 & 92145 - End
118200110513
118300110513           MOVE ZEROS        TO TRANS-PROC-SEQ-NO OF TRANS.
118400110513
118500110513           MOVE "N"          TO WS-SAME-BALANCE.
118600110513R79774     MOVE ZEROS        TO WS-AVG-UNIT-COST.
118700110513
118800110513      * RFS 79774 - Begin
118900110513           MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT
119000110513             TO ln-Curr-Unit-Bal.
119100110513      * RFS 79774 - End
119200110513      * RFS 91773 - Begin
119300110518           IF lb_Cash-Run
119400110513              EXEC SQL
119500110513                 SELECT CLOSING_UNIT_BAL
119600110513                 INTO  :WS-OPENING-BALANCE
119700110513                 FROM   MFATRNP
119800110513                 WHERE  ACCOUNT_NO      = :ln-Acct-No
119900110513                   AND  INVESTMENT_CODE = :lc-InvestmentCode
120000110513                   AND  TRADE_DATE      = :lc-tradedate
120100110513                 FETCH FIRST ROW ONLY
120200110523                 WITH UR
120300110513              END-EXEC
120400110513              IF SQLCODE =  ZEROS
120500110513                 CONTINUE
120600110513              ELSE
120700110513                 MOVE ln-Curr-Unit-Bal TO WS-OPENING-BALANCE
120800110513              END-IF
120900110513           END-IF.
121000110513      * RFS 91773 - End
121100110513
121200110513           START TRANS
121300110513           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
121400110513           INVALID KEY
121500110513             MOVE "Y"        TO WS-SAME-BALANCE
121600110513             MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT
121700110513                             TO WS-OPENING-BALANCE
121800110513R79774       MOVE AVERAGE-UNIT-COST OF ACCOUNT-INVESTMENT
121900110513R79774                       TO WS-AVG-UNIT-COST
122000110513      *RFS 34759 - Start
122100110513      *    GO TO GCR-EXIT.
122200110513           GO TO GCR-9999.
122300110513      *RFS 34759 - End
122400110513
122500110513       GCR-NEXT-TRANS.
122600110513
122700110513           READ TRANS NEXT RECORD
122800110513           AT END
122900110513             MOVE "Y"        TO WS-SAME-BALANCE
123000110513             MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT
123100110513                             TO WS-OPENING-BALANCE
123200110513R79774       MOVE AVERAGE-UNIT-COST OF ACCOUNT-INVESTMENT
123300110513R79774                       TO WS-AVG-UNIT-COST
123400110513
123500110513      *RFS 34759 - Start
123600110513      *      GO TO GCR-EXIT.
123700110513             GO TO GCR-9999.
123800110513      *RFS 34759 - End
123900110513
124000110513           MOVE TRANS-TYPE-CODE OF TRANS
124100110513                             TO WS-TRANS-TYPE-88.
124200110513
124300110513           MOVE TRANS-STATUS-CODE OF TRANS
124400110513                             TO WS-TRANS-STATUS-88.
124500110513
124600110513      *RFS 49476 - Start
124700110513           MOVE REVERSE OF TRANS TO lc-Reverse.
124800110513
124900110513      *    IF NOT HISTORY AND NOT REVERSAL
125000110513           IF NOT HISTORY
125100110513              GO TO GCR-NEXT-TRANS
125200110513           END-IF.
125300110513
125400110513           IF lc-Reverse-Y
125500110513      *RFS 49476 - End
125600110513              GO TO GCR-NEXT-TRANS
125700110513           END-IF.
125800110513
125900110518R92145     IF lb_Accrual-Run AND NOT Redemption
126000110513R92145        GO TO GCR-NEXT-TRANS
126100110513R92145     END-IF.
126200110513
126300110513      ** TRANS NOT FOR THIS ACCOUNT INVESTMENT
126400110513
126500110513           IF ACCOUNT-NO OF TRANS IS NOT EQUAL
126600110513           ACCOUNT-NO OF ACCOUNT-INVESTMENT OR
126700110513           INVESTMENT-CODE OF TRANS IS NOT EQUAL
126800110513           INVESTMENT-CODE OF ACCOUNT-INVESTMENT
126900110513             MOVE "Y"        TO WS-SAME-BALANCE
127000110513             MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT
127100110513                             TO WS-OPENING-BALANCE
127200110513R79774       MOVE AVERAGE-UNIT-COST OF ACCOUNT-INVESTMENT
127300110513R79774                       TO WS-AVG-UNIT-COST
127400110513      *RFS 34759 - Start
127500110513      *      GO TO GCR-EXIT
127600110513             GO TO GCR-9999
127700110513      *RFS 34759 - End
127800110513           END-IF.
127900110513
128000110513      ** TRANS OCCURRED AFTER QUARTER - CALCULATE BALANCE
128100110513
128200110518R92145     IF lb_Accrual-Run
128300110513R92145       IF Trade-Date OF TRANS IS GREATER THAN WS-QTO-N
128400110513R92145          MOVE "Y"        TO WS-SAME-BALANCE
128500110513R92145       ELSE
128600110513R92145          IF REDEMPTION AND HISTORY AND NOT REVERSAL
128700110513R92145             COMPUTE ln_Curr-Elig-Units =
128800110513R92145                ln_Curr-Elig-Units - UNIT-AMT OF TRANS
128900110513R92145          END-IF
129000110513R92145       END-IF
129100110513R92145       GO TO GCR-9999
129200110513R92145     END-IF.
129300110513
129400110513           IF PROCESS-DATE OF TRANS IS GREATER THAN
129500110513           WS-QTO-N
129600110513             MOVE "Y"        TO WS-SAME-BALANCE
129700110513           END-IF.
129800110513
129900110513           IF (REDEMPTION AND HISTORY)
130000110513           OR (NOT REDEMPTION AND REVERSAL)
130100110513             ADD UNIT-AMT OF TRANS,
130200110513             CLOSING-UNIT-BAL OF TRANS,
130300110513                             GIVING WS-OPENING-BALANCE
130400110513R79774       MOVE AVERAGE-UNIT-COST OF TRANS
130500110513R79774         TO Ws-Avg-Unit-Cost
130600110513           ELSE
130700110513             SUBTRACT UNIT-AMT OF TRANS
130800110513             FROM CLOSING-UNIT-BAL OF TRANS
130900110513                             GIVING WS-OPENING-BALANCE
131000110513R79774       MOVE AVERAGE-UNIT-COST OF TRANS
131100110513R79774         TO Ws-Avg-Unit-Cost
131200110513R79774       IF AVERAGE-UNIT-COST OF TRANS  = 0
131300110513R79774*         WS-SAME-BALANCE IS EQUAL TO "N"
131400110513R79774          MOVE RESULTANT-AVERAGE-UNIT-COST OF TRANS
131500110513R79774            TO Ws-Avg-Unit-Cost
131600110513R79774       END-IF
131700110513           END-IF.
131800110513
131900110513      *RFS 34759 - Start
132000110513       GCR-9999.
132100110513      *Process holding funds one by one for a phantom fund.
132200110513           IF lc-Phantom AND lb-EOFHoldingFalse
132300110513              PERFORM Detail-Processing
132400110513              PERFORM Get-Next-Holding-Fund
132500110513              IF Comm-Process-Option = "O"
132600110513                 GO TO GCR-0008-ON-LINE-OPTION-01
132700110513              ELSE
132800110513                 GO TO GCR-0008-BATCH-OPTION-01
132900110513              END-IF
133000110513           END-IF.
133100110513      *RFS 34759 - End
133200110513
133300110513       GCR-EXIT.
133400110513           EXIT.
133500110513      /
133600110513       DETAIL-PROCESSING SECTION.
133700110518
133800110518           SET BUDIDX2 TO BUDIDX2SV.
133900110518
134000110518R92145     IF lb_Accrual-Run
134100110518R92145        MOVE ln_Open-Elig-Units TO WS-OPENING-BALANCE
134200110518R92145     END-IF.
134300110513
134400110513      ** INITIALIZE ARRAY
134500110513
134600110513           PERFORM INIT-ARRAY
134700110513           VARYING TRNIDX FROM 1 BY 1
134800110513           UNTIL TRNIDX IS GREATER THAN BUDMAX.
134900110513
135000110513**********RFS 91773 - START
135100110513           IF lb_Cash-Run
135200110520              MOVE ZEROS       TO lc-Marketval
135300110520                                  lc-Unitbalance
135400110520                                  lc-Avgunitcost
135500110520           ELSE
135600110520      *    PERFORM LOAD-MFR-SCHEDULE-ARRAY
135700110513              PERFORM LOAD-MFR-SCHEDULE-ARRAY
135800110513           END-IF.
135900110513**********RFS 91773 - END
136000110513
136100110513      *    Search for the start date
136200110513           SET BUDIDX TO 1.
136300110513           SET BUDIDX DOWN BY 1.
136400110513
136500110513           SET BUDIDX UP BY 1.
136600110513           SEARCH WS-B-BUSINESS-DAY-ENTRY VARYING BUDIDX
136700110513           WHEN WS-B-DATE(BUDIDX) = WS-QFROM-N
136800110513             SET TIDXFROM    TO BUDIDX.
136900110513
137000110513      *    Search for the end date
137100110513           SET BUDIDX TO 1.
137200110513           SET BUDIDX DOWN BY 1.
137300110513
137400110513           SET BUDIDX UP BY 1.
137500110513           SEARCH WS-B-BUSINESS-DAY-ENTRY VARYING BUDIDX
137600110513           WHEN WS-B-DATE(BUDIDX) = WS-QTO-N
137700110513             SET TIDXTO      TO BUDIDX.
137800110513
137900110513      * SAME BALANCE PROCESSING
138000110513
138100110513           IF WS-SAME-BALANCE IS NOT EQUAL TO "Y"
138200110513             GO TO DPR-DAY-BY-DAY
138300110513           END-IF.
138400110513
138500110513           SET BUDIDX TO TIDXFROM.
138600110513           SET BUDIDX DOWN BY 1.
138700110513
138800110513       DPR-SAME-BALANCE.
138900110513
139000110513           SET BUDIDX UP BY 1.
139100110513           SET TRNIDX TO BUDIDX.
139200110513
139300171027      * RFS49699 - Array logging logic
139400110513
139500110513           IF TRNIDX  > WS-ARRAY1-MAX-USED
139600110513               MOVE TRNIDX                 TO WS-ARRAY1-MAX-USED
139700110513           END-IF.
139800110513
139900171027      * RFS49699 - End
140000110513
140100171027      * RFS79774 - START
140200110513
140300110513           IF (MfrEfs-Exist AND
140400110513              ln-Curr-Unit-Bal IS EQUAL ZEROES) OR
140500110513              ByMfr-Attr
140600110513              MOVE ZEROES TO Ws-Opening-Balance
140700110513           END-IF.
140800110513
140900110513           IF WS-T-AVG-UNIT-COST(TRNIDX)  NOT = 0
141000110513             MOVE WS-T-AVG-UNIT-COST(TRNIDX) TO WS-AVG-UNIT-COST
141100110513           END-IF
141200110513           MOVE WS-AVG-UNIT-COST  TO WS-T-AVG-UNIT-COST(TRNIDX)
141300171012
141400171130      *RFS167951 Starts
141500210622      *RFS 186019 - Begins
141600210622      *    IF (lc_ABRule = "2" OR lc_ABRule = "3") AND
141700210622           IF (lc_ABRule = "2" OR lc_ABRule = "3"
141800210622                OR lc_ABRule = "4") AND
141900210622      *RFS 186019 - Ends
142000171130              WS-B-CURR(BUDIDX, BUDIDX2) NOT= lc_BaseCurrency
142100180129177476     AND lc_SameCurr = "N"
142200171130              COMPUTE WS-T-MV(TRNIDX) ROUNDED =
142300171130              WS-OPENING-BALANCE * WS-B-PRICE(BUDIDX, BUDIDX2) /
142400171130              WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
142500171130              COMPUTE WS-T-BV(TRNIDX) ROUNDED =
142600171130              WS-OPENING-BALANCE * WS-T-AVG-UNIT-COST(TRNIDX) /
142700171130              WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
142800171130           ELSE
142900171130      *RFS167951 Ends
143000110513           COMPUTE WS-T-MV(TRNIDX) ROUNDED =
143100110513             WS-OPENING-BALANCE * WS-B-PRICE(BUDIDX, BUDIDX2)
143200110513           COMPUTE WS-T-BV(TRNIDX) ROUNDED =
143300110513             WS-OPENING-BALANCE * WS-T-AVG-UNIT-COST(TRNIDX)
143400171012167951     END-IF.
143500171012
143600110513      * For Online processing
143700110513           IF COMM-PROCESS-OPTION = "O"
143800110513              MOVE WS-T-MV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
143900110513           ELSE
144000171012
144100110513      * For Batch  processing
144200110513              IF QUALIFY-ON OF MFR-PROCESS = LNC-A
144300110513                 IF WS-T-MV(TRNIDX) >= WS-T-BV(TRNIDX)
144400110513                    MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
144500110513                 ELSE
144600110513                    MOVE WS-T-BV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
144700110513                 END-IF
144800110513              END-IF
144900110513              IF QUALIFY-ON OF MFR-PROCESS = LNC-B
145000110513                 MOVE WS-T-BV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
145100110513              END-IF
145200110513
145300110513              IF QUALIFY-ON OF MFR-PROCESS = LNC-M
145400110513                 MOVE WS-T-MV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
145500110513              END-IF
145600110513           END-IF.
145700110513
145800171027      * RFS79774 - END
145900110513R79774*    COMPUTE WS-T-UNIT-VALUE(TRNIDX) ROUNDED =
146000110513R79774*    WS-OPENING-BALANCE * WS-B-PRICE(BUDIDX, BUDIDX2).
146100110513           MOVE WS-OPENING-BALANCE
146200110513                             TO WS-T-UNIT-BALANCE(TRNIDX).
146300110513
146400110513           MOVE WS-B-DATE(BUDIDX) TO WS-T-DATE(TRNIDX).
146500110513           MOVE WS-B-PRICE(BUDIDX, BUDIDX2) TO WS-T-PRICE(TRNIDX).
146600110513           MOVE WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2) TO
146700110513                                 WS-T-INVESTMENT-CODE(TRNIDX).
146800110513
146900171130      *RFS167951 Starts
147000171130           INITIALIZE ln_InvAssetAmt,
147100171130                      ld_TradeDte,
147200171130                      ln_InvMarketValue.
147300171130
147400171130           MOVE WS-T-DATE(TRNIDX)       TO ld_TradeDte
147500171130
147600210714      *RFS 186019 - Begins
147700210714           IF  (lc_ABRule = "2" OR lc_ABRule = "3" OR lc_ABRule = "4")
147800210714                PERFORM GET-TOTAL-ASSET-MFR-AMOUNT
147900210802                IF  lc_RegrAccrFlag       = "Y" AND
148000210802                    lc_EligibleForprocess = "N"
148100210802                    GO TO DPR-SKIP1-NO-RATE
148200210802                END-IF
148300210714           END-IF
148400210714      *RFS 186019 - Ends
148500171130           IF (lc_ABRule = "2" OR
148600210803186019         lc_ABRule = "4"  OR
148700171130              lc_ABRule = "3") AND
148800171130              lb_IvrAccLvlYes
148900171130               MOVE WS-T-UNIT-VALUE(TRNIDX) TO ln_InvAssetAmt
149000171130               MOVE WS-T-MV(TRNIDX)         TO ln_InvMarketValue
149100171130               PERFORM INSERT-TMPACCINV
149200171130                GO TO DPR-SKIP1-NO-RATE
149300171130            ELSE
149400171130              CONTINUE
149500171130           END-IF
149600210622      *RFS 186019 - Begins
149700210622      *    IF  (lc_ABRule = "2" OR lc_ABRule = "3")
149800210714      *         PERFORM GET-TOTAL-ASSET-MFR-AMOUNT
149900210714      *    END-IF
150000210714      *RFS 186019 - Ends
150100171130      *RFS167951 Ends
150200110513      *    Search for the MFR schedule rate
150300110513
150400110517**********RFS 91773 - START
150500110524           MOVE WS-T-MV(TRNIDX)             TO lc-Marketval
150600110524           MOVE WS-T-UNIT-BALANCE(TRNIDX)   TO lc-Unitbalance
150700110524           MOVE WS-B-PRICE(BUDIDX, BUDIDX2) TO lc-Avgunitcost
150800110520           MOVE WS-T-DATE(TRNIDX)           TO lc-Tradingdate
150900110517           IF lb_Cash-run
151000110701              PERFORM INSERT-CASH-MFRCSHEXT1
151100110520              GO TO DPR-SKIP1-NO-RATE
151200110517           ELSE
151300110517              CONTINUE
151400171029           END-IF.
151500110517**********RFS 91773 - END
151600210714      *RFS 186019 - Begins
151700210716           INITIALIZE ln_TotAssetsAmt_A
151800210802           COMPUTE ln_TotAssetsAmt_A     = ln_TotAssetsAmt
151900210714           IF  (lc_ABRule = "3" OR lc_ABRule = "4")
152000210714               COMPUTE ln_TotAssetsAmt_A = ln_TotAssetsAmt
152100210714                                         + ln_SecondaryAssetsAmt
152200210714           END-IF
152300210714      *RFS 186019 - Ends
152400110513           MOVE ZEROS        TO WS-RATE.
152500110517           SET MSIDX TO 1.
152600210622
152700110513R79774*    SET MSIDX DOWN BY 1.
152800171013
152900171130      *RFS167951 Starts
153000171130           IF  (lc_ABRule = "2" OR
153100210803186019         lc_ABRule = "4" OR
153200171130               lc_ABRule = "3")
153300171130             SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
153400171130             WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
153500210803186019*      AND WS-M-UPPER-LIMIT(MSIDX) >= ln_TotAssetsAmt
153600210803186019       AND WS-M-UPPER-LIMIT(MSIDX) >= ln_TotAssetsAmt_A
153700171130             MOVE WS-M-RATE(MSIDX) TO WS-RATE
153800171130             WHEN WS-M-SCHEDULE(MSIDX) = SPACES
153900171130             GO TO DPR-SKIP1-NO-RATE
154000171130           ELSE
154100171130      *RFS167951 Ends
154200110513           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
154300110513           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
154400110513            AND WS-M-UPPER-LIMIT(MSIDX) >= WS-T-UNIT-VALUE(TRNIDX)
154500110513              MOVE WS-M-RATE(MSIDX) TO WS-RATE
154600110513           WHEN WS-M-SCHEDULE(MSIDX) = SPACES
154700171029167951*       GO TO DPR-SKIP1-NO-RATE.
154800171029167951        GO TO DPR-SKIP1-NO-RATE
154900171029167951     END-IF.
155000171013
155100110513       DPR-SAME-BALANCE-CALC.
155200110513
155300110513           MOVE WS-RATE      TO WS-T-MFR-RATE(TRNIDX).
155400110513      *RFS 34759 - Start
155500110513RF4697*    IF WS-MCO = "BTG" AND GRADUATED-SCHEDULE
155600110513           PERFORM Get-MFR-Calc-Ind.
155700110513           IF lc-MFRCalcInd = lnc-G
155800110513      *RFS 34759 - End
155900110513      * RFS 79774 - begin
156000110513RF4697*       PERFORM GRADUATED-CALCULATION THRU GC-EXIT
156100171130      *RFS167951 Starts
156200171130RF4697*       PERFORM GRADUATED-CALCULATION
156300171130            IF (lc_ABRule = "2" OR
156400171130               lc_ABRule = "3")
156500171130               COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
156600171130               (ln_TotMFRAMt *
156700171130               (WS-T-MV(TRNIDX)/ ln_TotMarketValue))
156800171130            ELSE
156900171130               PERFORM GRADUATED-CALCULATION
157000171130            END-IF
157100171130      *RFS167951 Ends
157200110513      * RFS 79774 - end
157300210622      * RFS 186019 - Begins
157400210622           ELSE
157500210623            IF lc-MFRCalcInd = lc-T
157600210802                COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED  =
157700210802                       (WS-T-UNIT-VALUE(TRNIDX)/ ln_TotAssetsAmt
157800210802                    *  (ln_TotAssetsAmt   - WS-M-LOWER-LIMIT(MSIDX))
157900210802                    *   WS-RATE / 100 / WS-DAYS-IN-YEAR )
158000210802            ELSE
158100210802             IF lc-MFRCalcInd = lc-S
158200210802                MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
158300210802                COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED  =
158400210802                  (WS-T-UNIT-VALUE(TRNIDX) * WS-RATE / 100 /
158500210716                                            WS-DAYS-IN-YEAR )
158600210716
158700210622      * RFS 186019 - Ends
158800110513RF4697     ELSE
158900110513      *RFS 79774 - Defect 5
159000110513R79774      MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
159100110513            COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
159200110513            ((WS-T-UNIT-VALUE(TRNIDX) * WS-RATE)/ 100)/
159300110513                                            WS-DAYS-IN-YEAR
159400210622      * RFS 186019 - Begins
159500210802             END-IF
159600210802            END-IF
159700210622      * RFS 186019 - Ends
159800110513           END-IF.
159900210729      * RFS 186019 - Begins
160000210729           IF WS-T-MFR-VALUE(TRNIDX) < 0
160100210729              MOVE ZERO   TO WS-T-MFR-VALUE(TRNIDX)
160200210729           END-IF
160300210729      * RFS 186019 - Ends
160400180129      *RFS177476-Starts
160500180129           IF WS-B-CURR(BUDIDX, BUDIDX2) NOT= lc_BaseCurrency AND
160600180129              lc_SameCurr = "N"
160700180129              COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
160800180129                      WS-T-MFR-VALUE(TRNIDX)*
160900180129                      WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
161000180129      *RFS177476-Ends
161100110513      *RFS 38381 - Begin
161200110513           IF lc-Phantom
161300110513              MOVE TRNIDX TO ln-Idx
161400110513              SET TOT-IDX TO ln-Idx
161500171027      * RFS49699 - Array logging logic
161600110513
161700110513              IF TOT-IDX          > WS-ARRAY5-MAX-USED
161800110513                  MOVE TOT-IDX                TO WS-ARRAY5-MAX-USED
161900110513              END-IF
162000110513
162100171027      * RFS49699 - End
162200110513              ADD  WS-T-UNIT-VALUE(TRNIDX) TO TOT-AMT(TOT-IDX)
162300110513           END-IF.
162400110513      *RFS 38381 - End
162500110513
162600110513       DPR-SKIP1-NO-RATE.
162700110513
162800110513           IF WS-B-BUDIDX-END(BUDIDX) IS EQUAL "Y"
162900110513             GO TO DPR-END-FEE
163000110513           END-IF.
163100110513
163200110513           IF WS-B-DATE(BUDIDX) IS EQUAL WS-QTO-N
163300110513             GO TO DPR-END-FEE
163400110513           END-IF.
163500110513
163600110513           GO TO DPR-SAME-BALANCE.
163700110513
163800110513       DPR-DAY-BY-DAY.
163900110513
164000110513      ** IF ACTIVITY HAS OCCURED DURING THE QUARTER
164100110513
164200110513           SET BUDIDX TO TIDXFROM.
164300110513R79774*    SET BUDIDX DOWN BY 1.
164400110513
164500110513           SEARCH WS-B-BUSINESS-DAY-ENTRY
164600110513           VARYING BUDIDX
164700110513R92145*    WHEN WS-B-DATE(BUDIDX) = PROCESS-DATE OF TRANS
164800110513R92145     WHEN ( WS-B-DATE(BUDIDX) = PROCESS-DATE OF TRANS
164900110518R92145     AND    NOT lb_Accrual-Run ) OR
165000110513R92145          ( WS-B-DATE(BUDIDX) = TRADE-DATE OF TRANS
165100110518R92145     AND    lb_Accrual-Run )
165200110513             SET TRNIDX      TO BUDIDX
165300110518R92145       IF lb_Accrual-Run
165400110513R92145          COMPUTE WS-T-UNIT-BALANCE(TRNIDX) =
165500110513R92145                  WS-T-UNIT-BALANCE(TRNIDX) + UNIT-AMT OF TRANS
165600110513R92145       ELSE
165700110513                MOVE CLOSING-UNIT-BAL OF TRANS
165800110513                             TO WS-T-UNIT-BALANCE(TRNIDX)
165900110513R92145       END-IF
166000110513R79774       MOVE RESULTANT-AVERAGE-UNIT-COST OF TRANS
166100110513R79774                       TO WS-T-AVG-UNIT-COST(TRNIDX)
166200110513             MOVE "Y"        TO WS-T-UNIT-ADJUST(TRNIDX).
166300110513
166400110513       DPR-NEXT-TRANS.
166500110513
166600110513           READ TRANS NEXT RECORD
166700110513           AT END
166800110513             GO TO DPR-COMPL-ARRAY.
166900110513
167000110513           MOVE TRANS-TYPE-CODE OF TRANS
167100110513                             TO WS-TRANS-TYPE-88.
167200110513
167300110513           MOVE TRANS-STATUS-CODE OF TRANS
167400110513                             TO WS-TRANS-STATUS-88.
167500110513
167600110513      *RFS 49476 - Start
167700110513           MOVE REVERSE OF TRANS TO lc-Reverse.
167800110513
167900110513      *    IF NOT HISTORY AND NOT REVERSAL
168000110513           IF NOT HISTORY
168100110513              GO TO DPR-NEXT-TRANS
168200110513           END-IF.
168300110513
168400110513           IF lc-Reverse-Y
168500110513      *RFS 49476 - End
168600110513              GO TO DPR-NEXT-TRANS
168700110513           END-IF.
168800110513
168900110518R92145     IF lb_Accrual-Run AND NOT Redemption
169000110513R92145        GO TO DPR-NEXT-TRANS
169100110513R92145     END-IF.
169200110513
169300110513           IF ACCOUNT-NO OF TRANS IS NOT EQUAL
169400110513           ACCOUNT-NO OF ACCOUNT-INVESTMENT OR
169500110513           INVESTMENT-CODE OF TRANS IS NOT EQUAL
169600110513           INVESTMENT-CODE OF ACCOUNT-INVESTMENT OR
169700110518R92145     ( NOT lb_Accrual-Run AND
169800110513           PROCESS-DATE OF TRANS IS GREATER THAN
169900110513R92145*    WS-QTO-N
170000110513R92145     WS-QTO-N ) OR
170100110518R92145     ( lb_Accrual-Run AND
170200110513R92145       Trade-Date OF TRANS IS GREATER THAN
170300110513R92145       WS-QTO-N )
170400110513             GO TO DPR-COMPL-ARRAY
170500110513           END-IF.
170600110513
170700110518R92145          IF REDEMPTION AND HISTORY AND NOT REVERSAL
170800110518R92145             COMPUTE ln_Curr-Elig-Units =
170900110518R92145                ln_Curr-Elig-Units - UNIT-AMT OF TRANS
171000110518R92145          END-IF
171100110518
171200110520R91773     MOVE ZEROS            TO  lc-Marketval
171300110520                                     lc-Unitbalance
171400110520                                     lc-Avgunitcost.
171500110513           GO TO DPR-DAY-BY-DAY.
171600110513
171700110513       DPR-COMPL-ARRAY.
171800110513
171900110513           SET TRNIDX TO TIDXFROM.
172000110513           SET TRNIDX DOWN BY 1.
172100110513           MOVE WS-OPENING-BALANCE
172200110513                             TO WS-CARRY-FORWARD.
172300110513       DPR-COMP-ARRAY-0010.
172400110513
172500110513           SET TRNIDX UP BY 1.
172600110513
172700171027      * RFS49699 - Array logging logic
172800110513
172900110513           IF TRNIDX           > WS-ARRAY1-MAX-USED
173000110513               MOVE TRNIDX                 TO WS-ARRAY1-MAX-USED
173100110513           END-IF.
173200110513
173300171027      * RFS49699 - End
173400110513
173500110513           IF WS-T-UNIT-ADJUST(TRNIDX) IS NOT EQUAL TO "Y"
173600110513             MOVE WS-CARRY-FORWARD
173700110513                             TO WS-T-UNIT-BALANCE(TRNIDX)
173800110513           ELSE
173900110518R92145       IF lb_Accrual-Run
174000110705R92145           IF WS-CARRY-FORWARD >= WS-T-UNIT-BALANCE(TRNIDX)
174100110705R92145             COMPUTE WS-CARRY-FORWARD = WS-CARRY-FORWARD
174200110513R92145                                    - WS-T-UNIT-BALANCE(TRNIDX)
174300110705R92145           ELSE
174400110705R92145             MOVE 0 TO WS-CARRY-FORWARD
174500110705R92145           END-IF
174600110513R92145           MOVE WS-CARRY-FORWARD
174700110513R92145                                   TO WS-T-UNIT-BALANCE(TRNIDX)
174800110513R92145       ELSE
174900110513                 MOVE WS-T-UNIT-BALANCE(TRNIDX)
175000110513                                         TO WS-CARRY-FORWARD
175100110513R92145       END-IF
175200110513           END-IF.
175300110513
175400171027      * RFS79774 - START
175500110513           IF (MfrEfs-Exist AND
175600110513              ln-Curr-Unit-Bal IS EQUAL ZEROES) OR
175700110513              ByMfr-Attr
175800110513              MOVE ZEROES TO WS-T-UNIT-BALANCE(TRNIDX)
175900110513           END-IF.
176000171027      * RFS79774 - End
176100110513
176200110513           SET BUDIDX TO TRNIDX.
176300171027      * RFS79774 - START
176400110513           IF WS-T-AVG-UNIT-COST(TRNIDX)  NOT = 0
176500110513             MOVE WS-T-AVG-UNIT-COST(TRNIDX) TO WS-AVG-UNIT-COST
176600110513           END-IF
176700110513           MOVE WS-AVG-UNIT-COST  TO WS-T-AVG-UNIT-COST(TRNIDX)
176800171130      *RFS167951 Starts
176900210709186019*    IF (lc_ABRule = "2" OR lc_ABRule = "3") AND
177000210709186019     IF (lc_ABRule = "2" OR lc_ABRule = "3"
177100210714186019                         OR lc_ABRule = "4") AND
177200171130              WS-B-CURR(BUDIDX, BUDIDX2) NOT= lc_BaseCurrency
177300180129177476     AND lc_SameCurr = "N"
177400171130              COMPUTE WS-T-MV(TRNIDX) ROUNDED =
177500171130              WS-T-UNIT-BALANCE(TRNIDX) * WS-B-PRICE(BUDIDX, BUDIDX2) /
177600171130              WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
177700171130              COMPUTE WS-T-BV(TRNIDX) ROUNDED =
177800171130              WS-T-UNIT-BALANCE(TRNIDX) * WS-T-AVG-UNIT-COST(TRNIDX) /
177900171130              WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
178000171130           ELSE
178100171130      *RFS167951 Ends
178200110513           COMPUTE WS-T-MV(TRNIDX) ROUNDED =
178300110513             WS-T-UNIT-BALANCE(TRNIDX) * WS-B-PRICE(BUDIDX, BUDIDX2)
178400110513           COMPUTE WS-T-BV(TRNIDX) ROUNDED =
178500110513             WS-T-UNIT-BALANCE(TRNIDX) * WS-T-AVG-UNIT-COST(TRNIDX)
178600171013167951     END-IF.
178700110513      * For Online processing
178800110513           IF COMM-PROCESS-OPTION = "O"
178900110513              MOVE WS-T-MV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
179000110513           ELSE
179100110513      * For Batch  processing
179200110513              IF QUALIFY-ON OF MFR-PROCESS = LNC-A
179300110513                 IF WS-T-MV(TRNIDX) >= WS-T-BV(TRNIDX)
179400110513                    MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
179500110513                 ELSE
179600110513                    MOVE WS-T-BV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
179700110513                 END-IF
179800110513              END-IF
179900110513              IF QUALIFY-ON OF MFR-PROCESS = LNC-B
180000110513                 MOVE WS-T-BV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
180100110513              END-IF
180200110513
180300110513              IF QUALIFY-ON OF MFR-PROCESS = LNC-M
180400110513                 MOVE WS-T-MV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
180500110513              END-IF
180600110513           END-IF.
180700110513
180800171027      * RFS79774 - END
180900110513R79774*    COMPUTE WS-T-UNIT-VALUE(TRNIDX) ROUNDED =
181000110513R79774*    WS-T-UNIT-BALANCE(TRNIDX) * WS-B-PRICE(BUDIDX, BUDIDX2).
181100110513
181200110513           MOVE WS-B-DATE(BUDIDX) TO WS-T-DATE(TRNIDX).
181300110513           MOVE WS-B-PRICE(BUDIDX, BUDIDX2) TO WS-T-PRICE(TRNIDX).
181400110513           MOVE WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2) TO
181500110513                                 WS-T-INVESTMENT-CODE(TRNIDX).
181600110513
181700171130      *RFS167951 Starts
181800171130           INITIALIZE ln_InvAssetAmt,
181900171130                      ld_TradeDte,
182000171130                      ln_InvMarketValue.
182100171130
182200171130           MOVE WS-T-DATE(TRNIDX)       TO ld_TradeDte
182300171130
182400210714      *RFS 186019 - Begins
182500210714           IF  (lc_ABRule = "2" OR lc_ABRule = "3" OR lc_ABRule = "4")
182600210714                PERFORM GET-TOTAL-ASSET-MFR-AMOUNT
182700210802                IF  lc_RegrAccrFlag       = "Y" AND
182800210802                    lc_EligibleForprocess = "N"
182900210802                    GO TO DPR-SKIP2-NO-RATE
183000210802                END-IF
183100210714           END-IF
183200210714      *RFS 186019 - Ends
183300171130           IF (lc_ABRule = "2" OR
183400210709186019         lc_ABRule = "4" OR
183500171130              lc_ABRule = "3") AND
183600171130              lb_IvrAccLvlYes
183700171130               MOVE WS-T-UNIT-VALUE(TRNIDX) TO ln_InvAssetAmt
183800171130               MOVE WS-T-MV(TRNIDX)         TO ln_InvMarketValue
183900171130               PERFORM INSERT-TMPACCINV
184000171130                GO TO DPR-SKIP2-NO-RATE
184100171130            ELSE
184200171130              CONTINUE
184300171130           END-IF
184400210714      *RFS 186019 - Begins
184500210714      *    IF  (lc_ABRule = "2" OR lc_ABRule = "3")
184600210714      *         PERFORM GET-TOTAL-ASSET-MFR-AMOUNT
184700210714      *    END-IF
184800210714      *RFS 186019 - Ends
184900171130      *RFS167951 Ends
185000171030
185100110513      *    Search for the MFR schedule rate
185200110513**********RFS 91773 - START
185300110524           MOVE WS-T-MV(TRNIDX)             TO lc-Marketval
185400110524           MOVE WS-T-UNIT-BALANCE(TRNIDX)   TO lc-Unitbalance
185500110524           MOVE WS-B-PRICE(BUDIDX, BUDIDX2) TO lc-Avgunitcost
185600110520           MOVE WS-T-DATE(TRNIDX)           TO lc-Tradingdate
185700110513           IF lb_Cash-run
185800110701              PERFORM INSERT-CASH-MFRCSHEXT1
185900110520              GO TO DPR-SKIP2-NO-RATE
186000110513           ELSE
186100110513              CONTINUE
186200171027           END-IF
186300110513**********RFS 91773 - END
186400110513
186500210714      *RFS186019 - BEGINS
186600210716           INITIALIZE ln_TotAssetsAmt_A
186700210802           COMPUTE ln_TotAssetsAmt_A     = ln_TotAssetsAmt
186800210714           IF  (lc_ABRule = "3" OR lc_ABRule = "4")
186900210714               COMPUTE ln_TotAssetsAmt_A = ln_TotAssetsAmt
187000210802                                         + ln_SecondaryAssetsAmt
187100210714           END-IF
187200210714      *RFS186019 - ENDS
187300110513           MOVE ZEROS        TO WS-RATE.
187400110513           SET MSIDX TO 1.
187500110513R79774*    SET MSIDX DOWN BY 1.
187600171130      *RFS167951 Starts
187700210709186019*    IF  (lc_ABRule = "2" OR lc_ABRule = "3")
187800210709186019     IF  (lc_ABRule = "2" OR lc_ABRule = "3" OR lc_ABRule = "4")
187900171130             SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
188000171130             WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
188100210709186019*      AND WS-M-UPPER-LIMIT(MSIDX) >= ln_TotAssetsAmt
188200210709186019       AND WS-M-UPPER-LIMIT(MSIDX) >= ln_TotAssetsAmt_A
188300171130             MOVE WS-M-RATE(MSIDX) TO WS-RATE
188400171130             WHEN WS-M-SCHEDULE(MSIDX) = SPACES
188500171130             GO TO DPR-SKIP2-NO-RATE
188600171130           ELSE
188700171130      *RFS167951 Ends
188800110513           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
188900110513           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
189000110513            AND WS-M-UPPER-LIMIT(MSIDX) >= WS-T-UNIT-VALUE(TRNIDX)
189100110513              MOVE WS-M-RATE(MSIDX) TO WS-RATE
189200110513           WHEN WS-M-SCHEDULE(MSIDX) = SPACES
189300171029167951*       GO TO DPR-SKIP2-NO-RATE.
189400171029167951        GO TO DPR-SKIP2-NO-RATE
189500171029167951     END-IF.
189600110513
189700110513           MOVE WS-RATE      TO WS-T-MFR-RATE(TRNIDX).
189800110513      *RFS 34759 - Start
189900110513RF4697*    IF WS-MCO = "BTG" AND GRADUATED-SCHEDULE
190000110513           PERFORM Get-MFR-Calc-Ind.
190100110513           IF lc-MFRCalcInd = lnc-G
190200110513      *RFS 34759 - End
190300110513      * RFS 79774 - begin
190400110513RF4697*       PERFORM GRADUATED-CALCULATION THRU GC-EXIT
190500171130      *RFS167951 Starts
190600171130RF4697*       PERFORM GRADUATED-CALCULATION
190700171130            IF (lc_ABRule = "2" OR lc_ABRule = "3")
190800171130               COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
190900171130               (ln_TotMFRAMt *
191000171130               (WS-T-MV(TRNIDX)/ ln_TotMarketValue))
191100171130            ELSE
191200171130               PERFORM GRADUATED-CALCULATION
191300171130            END-IF
191400210709      *RFS186019 - BEGINS
191500210709           ELSE
191600210709           IF lc-MFRCalcInd = lc-T
191700210709               COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED  =
191800210709                 (WS-T-UNIT-VALUE(TRNIDX)/ ln_TotAssetsAmt
191900210716               * (ln_TotAssetsAmt   - WS-M-LOWER-LIMIT(MSIDX))
192000210709               *  WS-RATE / 100 / WS-DAYS-IN-YEAR )
192100210716           ELSE
192200210802            IF lc-MFRCalcInd = lc-S
192300210716               MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
192400210716               COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED  =
192500210716                 (WS-T-UNIT-VALUE(TRNIDX) * WS-RATE / 100 /
192600210716                                            WS-DAYS-IN-YEAR )
192700210709      *RFS186019 - ENDS
192800171130      *RFS167951 Ends
192900171013      * RFS 79774 - end
193000110513RF4697     ELSE
193100110513      *RFS 79774 - Defect 5
193200110513R79774     MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
193300110513           COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
193400110513           ((WS-T-UNIT-VALUE(TRNIDX) * WS-RATE) / 100) /
193500110513                                              WS-DAYS-IN-YEAR
193600210709      *RFS186019 - BEGINS
193700210802            END-IF
193800210716           END-IF
193900210709      *RFS186019 - ENDS
194000110513           END-IF.
194100210729      * RFS 186019 - Begins
194200210729           IF WS-T-MFR-VALUE(TRNIDX) < 0
194300210729              MOVE ZERO   TO WS-T-MFR-VALUE(TRNIDX)
194400210729           END-IF
194500210729      * RFS 186019 - Ends
194600180129      *RFS177476-Starts
194700180129           IF WS-B-CURR(BUDIDX, BUDIDX2) NOT= lc_BaseCurrency AND
194800180129              lc_SameCurr = "N"
194900180129              COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
195000180129                      WS-T-MFR-VALUE(TRNIDX)*
195100180129                      WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
195200180129      *RFS177476-Ends
195300110513      *RFS 38381 - Begin
195400110513           IF lc-Phantom
195500110513              MOVE TRNIDX TO ln-Idx
195600110513              SET TOT-IDX TO ln-Idx
195700171027      * RFS49699 - Array logging logic
195800110513
195900110513              IF TOT-IDX          > WS-ARRAY5-MAX-USED
196000110513                  MOVE TOT-IDX                TO WS-ARRAY5-MAX-USED
196100110513              END-IF
196200110513
196300171027      * RFS49699 - End
196400110513              ADD  WS-T-UNIT-VALUE(TRNIDX) TO TOT-AMT(TOT-IDX)
196500110513           END-IF.
196600110513      *RFS 38381 - End
196700110513
196800110513       DPR-SKIP2-NO-RATE.
196900110513
197000110513           IF WS-B-DATE(BUDIDX) IS EQUAL WS-QTO-N
197100110513             GO TO DPR-END-FEE
197200110513           END-IF.
197300110513
197400110513           IF WS-B-BUDIDX-END(BUDIDX) IS NOT EQUAL TO "Y"
197500110513             GO TO DPR-COMP-ARRAY-0010
197600110513           END-IF.
197700110513
197800110513
197900110513       DPR-END-FEE.
198000171013
198100171130      *RFS167951 Starts
198200171130           IF lb_IvrAccLvlYes
198300171130              GO TO DPR-EXIT
198400171130           END-IF.
198500171130      *RFS167951 Ends
198600110513
198700110513      *** SUMMARIZE ACCUMULATED TOTALS
198800110513
198900110513
199000110513           SET TRNIDX TO TIDXFROM.
199100110513           SET TRNIDX DOWN BY 1.
199200110513
199300110513           MOVE 0            TO WS-TOT-MFR-AMT.
199400110513R92145     MOVE 0            TO WS-TOT-PRICE.
199500110513
199600110513       DPR-SUM-MFR-AMT.
199700110513
199800110513           SET TRNIDX UP BY 1.
199900110513           COMPUTE WS-TOT-MFR-AMT ROUNDED = WS-TOT-MFR-AMT +
200000110513                                   WS-T-MFR-VALUE(TRNIDX).
200100110513R92145     COMPUTE WS-TOT-PRICE   ROUNDED = WS-TOT-PRICE   +
200200110513R92145                                 WS-T-PRICE(TRNIDX).
200300110513           IF TRNIDX < TIDXTO
200400110513             GO TO DPR-SUM-MFR-AMT
200500110513           END-IF.
200600110513
200700110513      *RFS 34759 - Start
200800110513R38381*    IF lc-Phantom
200900110513R38381*       COMPUTE ln-MfrAmtAAP = ln-MfrAmtAAP + WS-TOT-MFR-AMT
201000110513R38381*    END-IF.
201100110513      *RFS 34759 - End
201200110513
20130011051314388  DPR-SUM-TAX-AMT.
201400110513
201500110513R38381     IF LC-PHANTOM
201600110513R38381        PERFORM PHANTOM-FUND-CALCUALTION
201700110513R38381     END-IF.
201800110513
201900110513  ¦        INITIALIZE WS-TXN-SALES-TAX-FIELDS.
202000110513  ¦        MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT
202100110513  ¦          TO WS-ACCT-NO.
202200110513  ¦
202300110513  ¦        EXEC SQL
202400110513  ¦          WHENEVER SQLERROR CONTINUE
202500110513  ¦        END-EXEC.
202600110513  ¦
202700110513  ¦        EXEC SQL
202800110513  ¦          WHENEVER NOT FOUND CONTINUE
202900110513  ¦        END-EXEC.
203000110513  ¦
203100110513  ¦        EXEC SQL
203200110513  ¦          WHENEVER SQLWARNING CONTINUE
203300110513  ¦        END-EXEC.
203400110513  ¦
20350011051314388      EXEC SQL
203600110513  ¦          DECLARE TAXCUR CURSOR FOR
203700110513  ¦           SELECT C.SALES_TAX_CODE,
203800110513  ¦                  C.PROVINCIAL_TAX_PERCENT,
203900110513  ¦                  C.FEDERAL_TAX_PERCENT,
204000110513  ¦                  C.COMPOUND_TAX
204100110513  ¦            FROM  MFAACCNTP A, MFAIVRP B, MFATRNTXP C
204200110513  ¦           WHERE  A.ACCOUNT_NO      = :WS-ACCT-NO          AND
204300110513  ¦                  B.INVESTOR_NO     = A.INVESTOR_NO        AND
204400110513  ¦                  C.PROVINCE_CODE   = B.PROVINCE_CODE      AND
204500110513  ¦                  C.COUNTRY_CODE    = B.COUNTRY_CODE       AND
20460011051314388                C.TRANS_TYPE_CODE = :WS-MFR-TRANSACTION  AND
204700110513  ¦                  C.DEFAULT_FLAG    = "Y"                  AND
204800110513  ¦                  C.OPTIONAL_TAX    = "N"
204900110513  ¦        END-EXEC.
205000110513  ¦
205100110513  ¦        EXEC SQL
205200110513  ¦          OPEN TAXCUR
20530011051314388      END-EXEC.
205400110513  ¦
205500110513  ¦        EXEC SQL
205600110513  ¦          FETCH TAXCUR INTO :WS-SALES-TAX-CODE,
205700110513  ¦                            :WS-PRV-TAX-RATE,
205800110513  ¦                            :WS-FED-TAX-RATE,
205900110513  ¦                            :WS-COMPOUND-TAX
206000110513  ¦        END-EXEC.
206100110513  ¦
206200110513  ¦        IF SQLCODE = 0 AND WS-SALES-TAX-CODE NOT EQUAL "N"
206300110513  ¦           IF WS-FED-TAX-RATE > 0
206400110513  ¦              COMPUTE WS-GST-AMT ROUNDED =
206500110513  ¦                  (WS-TOT-MFR-AMT * (WS-FED-TAX-RATE / 100))
206600110513  ¦           END-IF
206700110513  ¦
206800110513  ¦           IF WS-PRV-TAX-RATE > 0
206900110513  ¦              IF WS-COMPOUND-TAX  = "Y"
20700011051314388               COMPUTE WS-PST-AMT ROUNDED =
207100110513  ¦                       ((WS-TOT-MFR-AMT      *
207200110513  ¦                         (1 + (WS-FED-TAX-RATE / 100))) *
207300110513  ¦                        (WS-PRV-TAX-RATE / 100))
207400110513  ¦              ELSE COMPUTE WS-PST-AMT ROUNDED =
207500110513  ¦                          (WS-TOT-MFR-AMT * (WS-PRV-TAX-RATE / 100))
207600110513  ¦              END-IF
207700110513  ¦           END-IF
207800110513  ¦
207900110513  ¦           IF WS-SALES-TAX-CODE = "G"
208000110513  ¦              MOVE 0 TO WS-PST-AMT
208100110513  ¦           END-IF
208200110513  ¦
208300110513  ¦           IF WS-SALES-TAX-CODE = "P"
20840011051314388            MOVE 0 TO WS-GST-AMT
208500110513  ¦           END-IF
208600110513
208700110513      *RFS 34759 - Start
208800110513R38381*       IF lc-Phantom
208900110513R38381*          COMPUTE ln-GstAmtAAP = ln-GstAmtAAP + WS-GST-AMT
209000110513R38381*          COMPUTE ln-PstAmtAAP = ln-PstAmtAAP + WS-PST-AMT
209100110513R38381*       END-IF
209200110513      *RFS 34759 - End
209300110513  ¦        END-IF.
209400110513  ¦
209500110513  ¦        EXEC SQL
209600110513  ¦          CLOSE TAXCUR
20970011051314388      END-EXEC.
209800110513
209900110513       DPR-UPDATE-REC.
210000110513
210100110513           IF COMM-PROCESS-OPTION = "O"
210200110513             GO TO DPR-UPDATE-ON-LINE-OPTION
210300110513           END-IF.
210400110513
210500110513           MOVE "00"         TO REJECTION-CODE OF MFR-PROCESS.
210600110513           MOVE 0            TO GROSS-AMT OF MFR-PROCESS
210700110513                                PST-AMT   OF MFR-PROCESS
210800110513                                GST-AMT   OF MFR-PROCESS.
210900110513
211000110513      *RFS 34759 - Start
211100110513      *Keep existing calculation for non phantom fund.
211200110513           IF NOT lc-Phantom
21130011051314388      COMPUTE PST-AMT   OF MFR-PROCESS ROUNDED =
211400110513  ¦                PST-AMT   OF MFR-PROCESS +  WS-PST-AMT
211500110513  ¦
211600110513  ¦        COMPUTE GST-AMT   OF MFR-PROCESS ROUNDED =
21170011051314388              GST-AMT   OF MFR-PROCESS +  WS-GST-AMT
211800110513
211900110513           COMPUTE GROSS-AMT OF MFR-PROCESS ROUNDED =
212000110513                   GROSS-AMT OF MFR-PROCESS +
21210011051314388              PST-AMT   OF MFR-PROCESS + GST-AMT OF MFR-PROCESS +
212200110513                   WS-TOT-MFR-AMT
212300110513           END-IF.
212400110513
212500110513      *Add logic to calculate for phantom fund.
212600110513           IF lc-Phantom
212700110513              COMPUTE Pst-Amt   OF Mfr-Process ROUNDED =
212800110513                      WS-PST-AMT
212900110513
213000110513              COMPUTE Gst-Amt   OF Mfr-Process ROUNDED =
213100110513                      WS-GST-AMT
213200110513
213300110513              COMPUTE Gross-Amt OF Mfr-Process ROUNDED =
213400110513                      WS-PST-AMT               +
213500110513                      WS-GST-AMT               +
213600110513                      WS-TOT-MFR-AMT
213700110513           END-IF.
213800110513      *RFS 34759 - End
213900110513
214000110518R92145     If lb_Accrual-Run
214100110513R92145        COMPUTE AVG-FUND-PRICE OF Mfr-Process ROUNDED =
214200110513R92145                WS-TOT-PRICE / DAYS-IN-RANGE OF MFR-PROCESS
214300110513R92145        COMPUTE ELIGIBLE-UNITS-REDM OF Mfr-Process =
214400110513R92145                ln_Open-Elig-Units - ln_Curr-Elig-Units
214500110513R92145     END-IF.
214600110513
214700110513      *RFS 34759 - Start
214800110513      *    REWRITE MFR-PROCESS-REC.
214900110513           REWRITE MFR-PROCESS-REC
215000110513           INVALID KEY
215100110513             CONTINUE.
215200110513      *RFS 34759 - End
215300110513
215400110513      *RFS 92145 - Start
215500110518           IF lb_Accrual-Run
215600110513              MOVE Account-No OF Account-Investment
215700110513                              TO Account-No OF Account-MFR-Accrual
215800110513              MOVE Investment-Code of Account-Investment
215900110513                              TO Investment-Code OF Account-MFR-Accrual
216000110513              MOVE MFR-Group-Code OF MFR-Process
216100110513                              TO MFR-Group-Code OF Account-MFR-Accrual
216200110513              READ  ACCOUNT-MFR-ACCRUAL
216300110513              NOT INVALID KEY
216400110513                MOVE To-Date               OF MFR-PROCESS
216500110513                                           TO Last-Accrual-Date
216600110513                                           OF Account-MFR-Accrual
216700110521                IF lb_AccACR-Run
216800110521                    COMPUTE Mfr-Accrued-Amount OF Account-MFR-Accrual =
216900110521                            Mfr-Accrued-Amount OF Account-MFR-Accrual +
217000110521                            Gross-Amt          OF MFR-PROCESS
217100110521                    COMPUTE PST-Amt            OF Account-MFR-Accrual =
217200110521                            PST-Amt            OF Account-MFR-Accrual +
217300110521                            PST-Amt            OF MFR-PROCESS
217400110521                    COMPUTE GST-Amt            OF Account-MFR-Accrual =
217500110521                            GST-Amt            OF Account-MFR-Accrual +
217600110521                            GST-Amt            OF MFR-PROCESS
217700110627R97579              MOVE    WS-RATE            TO MFR-RATE
217800110627R97579                                         OF Account-MFR-Accrual
217900210802      *RFS186019 - starts
218000210802                    MOVE    ln_TotAssetsAmt    TO HHLD-Accrued-Amount
218100210802                                               OF Account-MFR-Accrual
218200210802
218300210802      *RFS186019 - Ends
218400110521                ELSE
218500110521                    MOVE    Gross-Amt          OF MFR-PROCESS TO
218600110521                            Mfr-Accrued-Amount OF Account-MFR-Accrual
218700110521                    MOVE    PST-Amt            OF MFR-PROCESS TO
218800110521                            PST-Amt            OF Account-MFR-Accrual
218900110521                    MOVE    GST-Amt            OF MFR-PROCESS TO
219000110521                            GST-Amt            OF Account-MFR-Accrual
219100110627R97579              MOVE    WS-RATE            TO MFR-RATE
219200110627R97579                                         OF Account-MFR-Accrual
219300210803      *RFS186019 - starts
219400210802                    MOVE    ln_TotAssetsAmt    TO HHLD-Accrued-Amount
219500210802                                               OF Account-MFR-Accrual
219600210803      *RFS186019 - Ends
219700110521                END-IF
219800110513                REWRITE Account-MFR-Accrual-Rec
219900110513              END-READ
220000110513           END-IF.
220100110513      *RFS 92145 - End
220200110513
220300110513           GO TO DPR-EXIT.
220400110513
220500110513       DPR-UPDATE-ON-LINE-OPTION.
220600110513
220700110513           MOVE "00"         TO COMM-REJECTION-CODE.
220800110513           MOVE 0            TO COMM-CALCULATED-AMT.
220900110513           MOVE 0            TO COMM-PST-AMT
221000110513                                COMM-GST-AMT.
221100110513
221200110513      *RFS 34759 - Start
221300110513      *Keep existing calculation for non phantom fund.
221400110513           IF NOT lc-phantom
22150011051314388      COMPUTE COMM-PST-AMT  ROUNDED =
221600110513  ¦                COMM-PST-AMT + WS-PST-AMT
221700110513  ¦
221800110513  ¦        COMPUTE COMM-GST-AMT  ROUNDED =
22190011051314388              COMM-GST-AMT + WS-GST-AMT
222000110513
222100110513           COMPUTE COMM-CALCULATED-AMT ROUNDED =
222200110513                   COMM-CALCULATED-AMT +
22230011051314388              COMM-PST-AMT + COMM-GST-AMT  +
222400110513                   WS-TOT-MFR-AMT
222500110513           END-IF.
222600110513
222700110513      *Add logic to calculate for phantom fund.
222800110513           IF lc-phantom
222900110513              COMPUTE Comm-Pst-Amt  ROUNDED =
223000110513R38381                WS-PST-AMT
223100110513
223200110513              COMPUTE Comm-Gst-Amt  ROUNDED =
223300110513R38381                WS-GST-AMT
223400110513
223500110513              COMPUTE Comm-Calculated-Amt ROUNDED =
223600110513                      WS-PST-AMT + WS-GST-AMT  +
223700110513R38381                WS-TOT-MFR-AMT
223800110513           END-IF.
223900110513
224000110513      *RFS 34759 - End
224100110513       DPR-EXIT.
224200110513           EXIT.
224300110513
224400110513      * RFS 79774 - begin
224500110513RF4697*GRADUATED-CALCULATION.
224600110513RF4697 GRADUATED-CALCULATION SECTION.
224700110513      * RFS 79774 - end
224800110513RF4697*    MOVE WS-T-UNIT-VALUE(TRNIDX) TO WS-UNIT-VALUE.
224900110513R79774     MOVE WS-T-MV(TRNIDX)    TO WS-UNIT-VALUE.
225000110513RF4697*    Search for the MFR schedule rate
225100110513RF4697
225200110513RF4697 GC-NEXT-TIER.
225300110513RF4697     SET MSIDX TO 1.
225400110513      * RFS 79774 - Begin
225500110513RF4697*    SET MSIDX DOWN BY 1.
225600110513      * RFS 79774 - End
225700110513RF4697     SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
225800110513RF4697     WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
225900110513RF4697        AND WS-M-UPPER-LIMIT(MSIDX) >= WS-UNIT-VALUE
226000110513RF4697        MOVE WS-M-RATE(MSIDX) TO WS-RATE
226100110513RF4697     WHEN WS-M-SCHEDULE(MSIDX) = SPACES
226200110513RF4697        GO TO GC-EXIT.
226300110513RF4697
226400110513      *RFS 79774 - Defect 5
226500110513R79774*    MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
226600110513R79774*    MOVE WS-T-UNIT-VALUE(TRNIDX) TO WS-UNIT-VALUE.
226700110513
226800110513           COMPUTE WS-MFR-VALUE ROUNDED  =
226900110513                 (WS-UNIT-VALUE - WS-M-LOWER-LIMIT(MSIDX))
227000110513                         * WS-RATE / 100 / WS-DAYS-IN-YEAR.
227100110513RF4697     ADD WS-MFR-VALUE TO WS-T-MFR-VALUE(TRNIDX).
227200110513RF4697     MOVE WS-M-LOWER-LIMIT(MSIDX) TO WS-UNIT-VALUE.
227300110513RF4697     IF WS-UNIT-VALUE NOT = 0
227400110513RF4697         GO TO GC-NEXT-TIER.
227500110513RF4697 GC-EXIT.
227600110513RF4697     EXIT.
227700110513RF4697
227800110513      /
227900110513*******RFS 91773 - Begin
228000110701R97581*INSERT-CASH-MFRCSHEXT SECTION.
228100110701R97581 INSERT-CASH-MFRCSHEXT1 SECTION.
228200110513           MOVE MFR-GROUP-CODE OF MFR-PROCESS
228300110513                             TO lc-MFRGroupCode.
228400110513           PERFORM GET-MFR-NAME.
228500110513           MOVE 1            TO lc-Count1.
228600110513           PERFORM CREATE-MFR-HOST-NME
228700110513           VARYING lc-Count FROM 1 BY 1
228800110513             UNTIL lc-Count > lnc-25.
228900110513           STRING lc-MFRname,
229000110513                  "_",
229100110513                  "MFRREPORT",
229200110513                  WS-SYSDATE-MM-X WS-SYSDATE-CC-X WS-SYSDATE-YY-X
229300110513           DELIMITED BY SPACE INTO lc-MFRhostname.
229400110513           PERFORM GET-DEALER-REP-RECORD.
229500110513           PERFORM GET-INVESTOR-NAME.
229600110513           PERFORM GET-INVESTMENT-GROUPCODE
229700110513           MOVE DAYS-IN-RANGE OF MFR-PROCESS
229800110513                              TO lc-Numberofdays
229900110701      *RFS97581 - START
230000110701           MOVE ORIGIN-CODE OF MFR-PROCESS  TO lc-Origin
230100110701           MOVE GROUP-CODE  OF MFR-PROCESS  TO lc-GroupCode
230200110701      *RFS97581 - END
230300110513           EXEC SQL
230400110513              INSERT INTO
230500110701R97581*       QTEMP/MFRCSHEXT VALUES(
230600110701              QTEMP/MFRCSHEXT1 VALUES(
230700110513                                :lc-MFRGroupCode
230800110513                               ,:lc-Descr
230900110513                               ,:lc-MFRhostname
231000110513                               ,:lc-Dealercode
231100110513                               ,:lc-Dealername
231200110513                               ,:lc-Dlrrepcode
231300110513                               ,:lc-Repname
231400110513                               ,:ln-Acct-No
231500110513                               ,:lc-Dlracctnum
231600110513                               ,:lc-Invname
231700110513                               ,:lc-InvestmentCode
231800110513                               ,:lc-Invgrpname
231900110520                               ,:lc-Tradingdate
232000110513                               ,:lc-Unitbalance
232100110513                               ,:lc-Avgunitcost
232200110513                               ,:lc-Marketval
232300110701R97581*                        ,0
232400110701R97581                         ,:lc-Origin
232500110701R97581                         ,:lc-GroupCode
232600110513                              )
232700110513
232800110513           END-EXEC.
232900110513
233000110513       ICM-EXIT SECTION.
233100110513           EXIT.
233200110513
233300110513       GET-MFR-NAME.
233400110513           EXEC SQL
233500110513              SELECT DESCR
233600110513              INTO  :lc-Descr
233700110513              FROM   MFAMFRHDP MFRHDP
233800110513              WHERE  MFR_GROUP_CODE = :lc-MFRGroupCode
233900110513           END-EXEC.
234000110513
234100110513       CREATE-MFR-HOST-NME.
234200110513              IF (lc-Descr(lc-Count:1) IS NUMERIC
234300110513              OR lc-Descr(lc-Count:1) IS ALPHABETIC)
234400110513             AND lc-Descr(lc-Count:1) NOT = SPACE
234500110513                 MOVE lc-Descr(lc-Count:1) TO lc-MFRname(lc-Count1:1)
234600110513                 ADD 1    TO  lc-Count1
234700110513           END-IF.
234800110513
234900110513       GET-DEALER-REP-RECORD.
235000110513           EXEC SQL
235100110513              SELECT ACCNTP.DEALER_CODE
235200110513                    ,ACCNTP.DEALER_REP_CODE
235300110513                    ,ACCNTP.DEALER_ACCOUNT_NO
235400110513                    ,ACCNTP.INVESTOR_NO
235500110513                    ,DEAP.DEALER_NAME
235600110513                    ,DEAREP.FIRST_NAME
235700110513                    ,DEAREP.LAST_NAME
235800110513              INTO  :lc-Dealercode
235900110513                   ,:lc-Dlrrepcode
236000110513                   ,:lc-Dlracctnum
236100110513                   ,:lc-Investornum
236200110513                   ,:lc-Dealername
236300110513                   ,:lc-Repfstname
236400110513                   ,:lc-Replstname
236500110513              FROM  MFAACCNTP ACCNTP
236600110513                   ,MFADEAP   DEAP
236700110513                   ,MFADEAREP DEAREP
236800110513              WHERE ACCOUNT_NO = :ln-Acct-No
236900110513              AND   ACCNTP.DEALER_CODE = DEAP.DEALER_CODE
237000110513              AND   ACCNTP.DEALER_REP_CODE = DEAREP.DEALER_REP_CODE
237100110513           END-EXEC.
237200110513           STRING lc-Repfstname SPACE lc-Replstname
237300110513           DELIMITED BY SIZE INTO lc-Repname.
237400110513
237500110513       GET-INVESTOR-NAME.
237600110513           EXEC SQL
237700110513              SELECT FIRST_NAME
237800110513                    ,LAST_NAME
237900110513              INTO  :lc-Invfstname
238000110513                   ,:lc-Invlstname
238100110513              FROM   MFAIVRP
238200110513              WHERE INVESTOR_NO = :lc-Investornum
238300110513           END-EXEC.
238400110513           STRING lc-Invfstname SPACE lc-Invlstname
238500110513           DELIMITED BY SIZE INTO lc-Invname.
238600110513
238700110513       GET-INVESTMENT-GROUPCODE.
238800110513           EXEC SQL
238900110513              SELECT INVGRP.INVESTMENT_GROUP_NAME
239000110513              INTO  :lc-Invgrpname
239100110513              FROM   MFAINVP INVP, MFAINVGRP INVGRP
239200110513              WHERE  INVESTMENT_CODE = :lc-InvestmentCode
239300110513              AND    INVP.INVESTMENT_GROUP_CODE =
239400110513                     INVGRP.INVESTMENT_GROUP_CODE
239500110513           END-EXEC.
239600110513
239700110513       TOTAL-MFR-CALCULATION.
239800110513           SET MSIDX TO 1.
239900110513           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
240000110513           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
240100110513              AND WS-M-UPPER-LIMIT(MSIDX) >= WS-UNIT-VALUE
240200110513              MOVE WS-M-RATE(MSIDX) TO WS-RATE
240300110513           WHEN WS-M-SCHEDULE(MSIDX) = SPACES
240400110513              CONTINUE
240500110513           END-SEARCH.
240600110513
240700110513       SLIDING-MFR-CALCULATION.
240800110513           MOVE ZEROS         TO WS-RATE
240900110513           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
241000110513           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
241100110629      *       AND WS-M-UPPER-LIMIT(MSIDX) <= WS-UNIT-VALUE
241200110513              MOVE WS-M-RATE(MSIDX) TO WS-RATE
241300110513           WHEN WS-M-SCHEDULE(MSIDX) = SPACES
241400110513              SET lc-Calculationend TO TRUE
241500110513           END-SEARCH.
241600110513           IF lc-Totmarval > WS-M-UPPER-LIMIT(MSIDX)
241700110513              COMPUTE lc-totalunit = WS-M-UPPER-LIMIT(MSIDX) -
241800110513                      lc-lowerlimit
241900110513              MOVE WS-M-UPPER-LIMIT(MSIDX) TO lc-lowerlimit
242000110513              SET MSIDX  UP BY  1
242100110513           ELSE
242200110513              COMPUTE lc-totalunit = lc-Totmarval -
242300110513                      lc-lowerlimit
242400110513              SET lc-Calculationend TO TRUE
242500110513           END-IF.
242600110513           COMPUTE lc-Totalmfr = lc-Totalmfr +
242700110707                  ((lc-totalunit * WS-RATE ) / 100)/ WS-DAYS-IN-YEAR.
242800110513
242900110513
243000110513       TOTAL-SLIDING-CALCULATION.
243100110628
243200110628           EXEC SQL
243300110630              DROP TABLE QTEMP/MFRCSHEXTI
243400110628           END-EXEC.
243500110628
243600110628           EXEC SQL
243700110630              CREATE TABLE QTEMP/MFRCSHEXTI
243800110628                               ( TOTAL_MV DECIMAL(13,2)
243900110628                                ,INVESTMENT_CODE CHAR(5)
244000110701                                ,TRADING_DATE INTEGER
244100110628                               )
244200110628           END-EXEC.
244300110628
244400110630      * SOME UP THE MARKET VALUE BASED ON INVESTMENT CODE
244500110628           EXEC SQL
244600110630              INSERT INTO  QTEMP/MFRCSHEXTI
244700110701              SELECT SUM(MARKET_VAL), INVESTMENT_CODE, TRADING_DATE
244800110701              FROM QTEMP/MFRCSHEXT1
244900110701              WHERE ORIGIN = "I"
245000110701              GROUP BY INVESTMENT_CODE, TRADING_DATE
245100110628           END-EXEC.
245200110628
245300110630      *RFS 97581- START
245400110630           EXEC SQL
245500110630              DROP TABLE QTEMP/MFRCSHEXTD
245600110630           END-EXEC.
245700110630
245800110630           EXEC SQL
245900110630              CREATE TABLE QTEMP/MFRCSHEXTD
246000110630                               ( TOTAL_MV DECIMAL(13,2)
246100110630                                ,DEALER CHAR(4)
246200110701                                ,TRADING_DATE INTEGER
246300110630                               )
246400110630           END-EXEC.
246500110630
246600110630      * SOME UP THE MARKET VALUE BASED ON DEALER
246700110630           EXEC SQL
246800110630              INSERT INTO  QTEMP/MFRCSHEXTD
246900110701              SELECT SUM(MARKET_VAL), DEALER, TRADING_DATE
247000110701              FROM QTEMP/MFRCSHEXT1
247100110701              WHERE ORIGIN = "D"
247200110701              GROUP BY DEALER, TRADING_DATE
247300110630           END-EXEC.
247400110630
247500110630           EXEC SQL
247600110630              DROP TABLE QTEMP/MFRCSHEXTR
247700110630           END-EXEC.
247800110630
247900110630           EXEC SQL
248000110630              CREATE TABLE QTEMP/MFRCSHEXTR
248100110630                               ( TOTAL_MV DECIMAL(13,2)
248200110630                                ,DEALER_REP CHAR(6)
248300110701                                ,TRADING_DATE INTEGER
248400110630                               )
248500110630           END-EXEC.
248600110630
248700110630      * SOME UP THE MARKET VALUE BASED ON DEALER REP
248800110630           EXEC SQL
248900110701              INSERT INTO  QTEMP/MFRCSHEXTR
249000110701              SELECT SUM(MARKET_VAL), DEALER_REP, TRADING_DATE
249100110701              FROM QTEMP/MFRCSHEXT1
249200110701              WHERE ORIGIN = "R"
249300110701              GROUP BY DEALER_REP, TRADING_DATE
249400110630           END-EXEC.
249500110701
249600110701           EXEC SQL
249700110701              DROP TABLE QTEMP/MFRCSHEXTG
249800110701           END-EXEC.
249900110701
250000110630           EXEC SQL
250100110630              CREATE TABLE QTEMP/MFRCSHEXTG
250200110630                               ( TOTAL_MV DECIMAL(13,2)
250300110705                                ,GROUP_CODE CHAR(6)
250400110701                                ,TRADING_DATE INTEGER
250500110630                               )
250600110630           END-EXEC.
250700110630
250800110630      * SOME UP THE MARKET VALUE BASED ON GROUP
250900110630           EXEC SQL
251000110630              INSERT INTO  QTEMP/MFRCSHEXTG
251100110701              SELECT SUM(MARKET_VAL), GROUP_CODE, TRADING_DATE
251200110701              FROM QTEMP/MFRCSHEXT1
251300110701              WHERE ORIGIN = "G"
251400110701              GROUP BY GROUP_CODE, TRADING_DATE
251500110630           END-EXEC.
251600110701
251700110701           EXEC SQL
251800110701              DROP TABLE QTEMP/MFRCSHEXTA
251900110701           END-EXEC.
252000110701
252100110701           EXEC SQL
252200110701              CREATE TABLE QTEMP/MFRCSHEXTA
252300110701                               ( TOTAL_MV DECIMAL(13,2)
252400110704                                ,ACCOUNT CHAR(9)
252500110701                                ,TRADING_DATE INTEGER
252600110701                               )
252700110701           END-EXEC.
252800110701
252900110701      * SOME UP THE MARKET VALUE BASED ON GROUP
253000110701           EXEC SQL
253100110701              INSERT INTO  QTEMP/MFRCSHEXTA
253200110701              SELECT SUM(MARKET_VAL), ACCOUNT, TRADING_DATE
253300110701              FROM QTEMP/MFRCSHEXT1
253400110701              WHERE ORIGIN = "A"
253500110701              GROUP BY ACCOUNT, TRADING_DATE
253600110701           END-EXEC.
253700110630      *RFS 97581- END
253800110513           EXEC SQL
253900110701              DECLARE MFRCSHEXT1_CURSOR CURSOR FOR
254000110513               SELECT MFR_GROUP_CODE
254100110701                     ,MFR_NME
254200110701                     ,MFR_HOST_NME
254300110701                     ,DEALER_NME
254400110701                     ,DEALER_REP_NME
254500110701                     ,DEALER_ACCOUNT
254600110701                     ,INVESTOR_NME
254700110701                     ,INVEST_GRP_NME
254800110701                     ,UNIT_BALANCE
254900110701                     ,UNIT_PRICE
255000110701                     ,ORIGIN
255100110701                     ,DEALER
255200110701                     ,DEALER_REP
255300110701                     ,ACCOUNT
255400110701                     ,GROUP_CODE
255500110701                     ,TRADING_DATE
255600110513                     ,INVESTMENT_CODE
255700110513                     ,MARKET_VAL
255800110701               FROM   QTEMP/MFRCSHEXT1
255900110513           END-EXEC.
256000110513
256100110513           EXEC SQL
256200110701R97581*       OPEN MFRCSHEXT_CURSOR
256300110701              OPEN MFRCSHEXT1_CURSOR
256400110513           END-EXEC.
256500110513
256600110513           MOVE "Y"       TO lc-Cursor.
256700110701R97581*    PERFORM FETCH-MFRCSHEXT-CURSOR
256800110701R97581     PERFORM FETCH-MFRCSHEXT1-CURSOR
256900110513             UNTIL lc-Endcursor.
257000110513
257100110701R97581*FETCH-MFRCSHEXT-CURSOR.
257200110701R97581 FETCH-MFRCSHEXT1-CURSOR.
257300110513           EXEC SQL
257400110701R97581*       FETCH MFRCSHEXT_CURSOR
257500110701              FETCH MFRCSHEXT1_CURSOR
257600110513              INTO  :lc-MFRGroupCode
257700110701                   ,:lc-Descr
257800110701                   ,:lc-MFRhostname
257900110701                   ,:lc-Dealername
258000110701                   ,:lc-Repname
258100110701                   ,:lc-Dlracctnum
258200110701                   ,:lc-Invname
258300110701                   ,:lc-Invgrpname
258400110701                   ,:lc-Unitbalance
258500110701                   ,:lc-Avgunitcost
258600110704      *RFS97581 - START
258700110701                   ,:lc-Origin
258800110701                   ,:lc-Dealercode
258900110701                   ,:lc-Dlrrepcode
259000110701                   ,:lc-Account
259100110701                   ,:lc-GroupCode
259200110701                   ,:lc-MFRTradeDate
259300110701      *RFS97581 - END
259400110513                   ,:lc-InvestmentCode
259500110513                   ,:lc-Marketval
259600110513           END-EXEC.
259700110513
259800110513           IF SQLCODE = lnc-100
259900110513              SET lc-Endcursor TO TRUE
260000110513              EXEC SQL
260100110701R97581*          CLOSE MFRCSHEXT_CURSOR
260200110701R97581           CLOSE MFRCSHEXT1_CURSOR
260300110513              END-EXEC
260400110513           ELSE
260500110513              PERFORM CALCULATE-TOTAL-MFR
260600110513           END-IF.
260700110513
260800110513       CALCULATE-TOTAL-MFR.
260900110701      *RFS97581 - START
261000110701           MOVE lc-Origin          TO lnc-Orgind.
261100110701           IF lncc-I
261200110701              EXEC SQL
261300110701                 SELECT TOTAL_MV
261400110701                 INTO  :lc-Totmarval
261500110701                 FROM   QTEMP/MFRCSHEXTI
261600110701                 WHERE  INVESTMENT_CODE = :lc-InvestmentCode
261700110701                   AND  TRADING_DATE    = :lc-MFRTradeDate
261800110701              END-EXEC
261900110701           END-IF.
262000110701
262100110701           IF lncc-D
262200110701              EXEC SQL
262300110701                 SELECT TOTAL_MV
262400110701                 INTO  :lc-Totmarval
262500110701                 FROM   QTEMP/MFRCSHEXTD
262600110701                 WHERE  DEALER          = :lc-Dealercode
262700110701                   AND  TRADING_DATE    = :lc-MFRTradeDate
262800110701              END-EXEC
262900110701           END-IF.
263000110701
263100110701           IF lncc-G
263200110701              EXEC SQL
263300110701                 SELECT TOTAL_MV
263400110701                 INTO  :lc-Totmarval
263500110701                 FROM   QTEMP/MFRCSHEXTG
263600110701                 WHERE  GROUP_CODE      = :lc-GroupCode
263700110701                   AND  TRADING_DATE    = :lc-MFRTradeDate
263800110701              END-EXEC
263900110701           END-IF.
264000110701
264100110701           IF lncc-R
264200110701              EXEC SQL
264300110701                 SELECT TOTAL_MV
264400110701                 INTO  :lc-Totmarval
264500110701                 FROM   QTEMP/MFRCSHEXTR
264600110701                 WHERE  DEALER_REP      = :lc-Dlrrepcode
264700110701                   AND  TRADING_DATE    = :lc-MFRTradeDate
264800110701              END-EXEC
264900110701           END-IF.
265000110701
265100110701           IF lncc-A
265200110701              EXEC SQL
265300110701                 SELECT TOTAL_MV
265400110701                 INTO  :lc-Totmarval
265500110701                 FROM   QTEMP/MFRCSHEXTA
265600110701                 WHERE  ACCOUNT         = :lc-Account
265700110701                   AND  TRADING_DATE    = :lc-MFRTradeDate
265800110701              END-EXEC
265900110701           END-IF.
266000110701      *RFS97581 - END
266100110513           EXEC SQL
266200110513              SELECT MFR_SCHEDULE_CODE
266300110513                    ,MFR_CALCULATION_IND
266400110513              INTO   :WS-MFR-SCHEDULE
266500110513                    ,:lc-MFRCalcInd
266600110513              FROM   MFAMFRDTP
266700110513              WHERE  MFR_GROUP_CODE = :lc-MFRGroupCode
266800110513              AND    INVESTMENT_CODE = :lc-InvestmentCode
266900110513           END-EXEC.
267000110513
267100110701      *RFS97581 - Start
267200110701      *    EXEC SQL
267300110701      *       SELECT TOTAL_MV
267400110701      *       INTO  :lc-Totmarval
267500110701      *       FROM   QTEMP/MFRCSHEXTA
267600110701      *       WHERE  INVESTMENT_CODE = :lc-InvestmentCode
267700110701R97581*         AND  TRADING_DATE    = :lc-MFRTradeDate
267800110701      *    END-EXEC.
267900110701      *RFS97581 - End
268000110513           MOVE lc-Totmarval  TO WS-UNIT-VALUE
268100110513           PERFORM LOAD-MFR-SCHEDULE-ARRAY
268200110513           MOVE lc-MFRCalcInd TO lnc-Ind.
268300110513           MOVE ZEROS         TO WS-RATE.
268400110513
268500110513           IF lnc-T
268600110513              PERFORM TOTAL-MFR-CALCULATION
268700110513              COMPUTE lc-Totmarval =
268800110706              (lc-Marketval * WS-RATE / 100 ) / WS-DAYS-IN-YEAR
268900110701R97581*       PERFORM UPDATE-MFRCSHEXT
269000110701R97581        PERFORM INSERT-MFRCSHEXT
269100110513           END-IF.
269200110513
269300110513           IF lnc-S
269400110513              MOVE ZEROS         TO lc-lowerlimit
269500110513              MOVE ZEROS         TO lc-Totalmfr
269600110513              MOVE "Y"           TO lc-Calculation
269700110513              SET MSIDX TO 1
269800110513              PERFORM SLIDING-MFR-CALCULATION
269900110513                UNTIL lc-Calculationend
270000110520              COMPUTE lc-Totmarval1 =
270100110520                      (lc-Marketval / WS-UNIT-VALUE)
270200110707R97581*       COMPUTE lc-Totmarval = lc-Totalmfr * lc-Totmarval1
270300110707              COMPUTE lc-Totmarval ROUNDED =
270400110707R97581                             lc-Totalmfr * lc-Totmarval1
270500110701R97581*       PERFORM UPDATE-MFRCSHEXT
270600110701R97581        PERFORM INSERT-MFRCSHEXT
270700110513           END-IF.
270800110513
270900110701      *RFS97581 - START
271000110701      *UPDATE-MFRCSHEXT.
271100110701      *    EXEC SQL
271200110701      *       UPDATE QTEMP/MFRCSHEXT
271300110701      *       SET    TOTAL_MARKET_VAL = :lc-Totmarval
271400110701      *       WHERE CURRENT OF MFRCSHEXT_CURSOR
271500110701      *    END-EXEC.
271600110701      *RFS97581 - END
271700110513*******RFS 91773 - End
271800110701      *RFS97581 - START
271900110701       INSERT-MFRCSHEXT.
272000110701           EXEC SQL
272100110701              INSERT INTO QTEMP/MFRCSHEXT VALUES(
272200110701                                :lc-MFRGroupCode
272300110701                               ,:lc-Descr
272400110701                               ,:lc-MFRhostname
272500110701                               ,:lc-Dealercode
272600110701                               ,:lc-Dealername
272700110701                               ,:lc-Dlrrepcode
272800110701                               ,:lc-Repname
272900110706                               ,:lc-Account
273000110701                               ,:lc-Dlracctnum
273100110701                               ,:lc-Invname
273200110701                               ,:lc-InvestmentCode
273300110701                               ,:lc-Invgrpname
273400110705                               ,:lc-MFRTradeDate
273500110701                               ,:lc-Unitbalance
273600110701                               ,:lc-Avgunitcost
273700110701                               ,:lc-Marketval
273800110701                               ,:lc-Totmarval)
273900110701           END-EXEC.
274000110701      *RFS97581 - END
274100110513
274200110513       INIT-ARRAY SECTION.
274300110513
274400110513           MOVE ZEROES       TO WS-T-UNIT-VALUE(TRNIDX)
274500110513                                WS-T-DATE(TRNIDX)
274600110513                                WS-T-PRICE(TRNIDX)
274700110513
274800110513                                WS-T-UNIT-BALANCE(TRNIDX)
274900110513                                WS-T-MFR-RATE(TRNIDX)
275000110513      * RFS 79774 - begin
275100110513      *                         WS-T-MFR-VALUE(TRNIDX).
275200110513                                WS-T-MFR-VALUE(TRNIDX)
275300110513                                WS-T-MV(TRNIDX)
275400110513                                WS-T-BV(TRNIDX)
275500110513                                WS-T-AVG-UNIT-COST(TRNIDX).
275600110513      * RFS 79774 - end
275700110513           MOVE SPACES       TO WS-T-UNIT-ADJUST(TRNIDX).
275800110513           MOVE SPACES       TO WS-T-INVESTMENT-CODE(TRNIDX).
275900110513
276000110513       INA-EXIT.
276100110513           EXIT.
276200110513      /
276300110513       LOAD-MFR-SCHEDULE-ARRAY SECTION.
276400110513      **********************************************
276500110513      ** LOAD MFR-SCHEDULE ARRAY                  **
276600110513      **********************************************
276700110513
276800110513           IF WS-MFR-SCHEDULE =
276900110513              WS-M-SCHEDULE(1)
277000110513             GO TO LMSA-EXIT
277100110513           END-IF.
277200110513
277300110513           INITIALIZE WS-MFR-SCHEDULE-ARRAY.
277400110513           SET  MSIDX        TO 1.
277500110513           SET  MSIDX        DOWN BY 1.
277600110513
277700110513           MOVE WS-MFR-SCHEDULE
277800110513                             TO MFR-SCHEDULE-CODE OF MFR-SCHEDULE.
277900110513           MOVE ZEROS        TO UPPER-LIMIT OF MFR-SCHEDULE.
278000110513
278100110513           START MFR-SCHEDULE
278200110513           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
278300110513           INVALID KEY
278400110513             GO TO LMSA-EXIT.
278500110513
278600110513       LMSA-0010.
278700110513
278800110513           READ MFR-SCHEDULE NEXT RECORD
278900110513           AT END
279000110513             GO TO LMSA-EXIT.
279100110513
279200110513           IF MFR-SCHEDULE-CODE OF MFR-SCHEDULE NOT =
279300110513              WS-MFR-SCHEDULE
279400110513             GO TO LMSA-EXIT
279500110513           END-IF.
279600110513
279700110513           SET MSIDX UP BY 1.
279800171027      * RFS49699 - Array logging logic
279900110513
280000110513           IF MSIDX  > WS-ARRAY2-MAX-USED
280100110513               MOVE MSIDX                  TO WS-ARRAY2-MAX-USED
280200110513           END-IF.
280300110513
280400171027      * RFS49699 - End
280500110513           MOVE MFR-SCHEDULE-CODE OF MFR-SCHEDULE
280600110513                             TO WS-M-SCHEDULE(MSIDX).
280700110513
280800110513           MOVE UPPER-LIMIT OF MFR-SCHEDULE
280900110513                             TO WS-M-UPPER-LIMIT(MSIDX).
281000110513           MOVE UPPER-LIMIT OF MFR-SCHEDULE
281100110513                             TO WS-M-LOWER-LIMIT(MSIDX + 1).
281200110513           MOVE MFR-RATE OF MFR-SCHEDULE
281300110513                             TO WS-M-RATE(MSIDX).
281400110513
281500110513           GO TO LMSA-0010.
281600110513
281700110513       LMSA-EXIT.
281800110513           EXIT.
281900110513      /
282000110513       INITIAL-LOGIC SECTION.
282100171017
282200210714      * RFS 186019 - Begins
282300210714           ACCEPT lc_MFASYSPARM FROM WS-DTAARA-MFASYSPARM
282400210714                  FOR "MFASYSPARM".
282500210714
282600210714      * RFS 186019 - Ends
282700210708      *
282800171130      *RFS167951 Starts
282900171130            INITIALIZE lc_BaseCurrency
283000171130            EXEC SQL
283100171130              SELECT CURRENCY
283200171130              INTO :lc_BaseCurrency
283300171130              FROM  MFACURP
283400171130              WHERE BASE_CURRENCY = "Y"
283500171130              FETCH FIRST ROW ONLY
283600171130            END-EXEC.
283700171130            INITIALIZE lc_ExchangeRateType.
283800171130            EXEC SQL
283900171130              SELECT EXCHANGE_RATE_TYPE
284000171130                INTO :lc_ExchangeRateType
284100171130              FROM  MFAPRGERP
284200171130              WHERE PROGRAM_CODE   = "MFRGEN"
284300171130                AND PROGRAM_ACTION = "DEFAULT"
284400171130              FETCH FIRST ROW ONLY
284500171130            END-EXEC.
284600171130            IF lc_ExchangeRateType IS EQUAL TO SPACES
284700171130               MOVE "N"  TO lc_ExchangeRateType
284800171130            END-IF.
284900171130
285000171130            SET lc-ASBOneOnlyYes TO TRUE.
285100171130            INITIALIZE ln_Count.
285200171130             EXEC SQL
285300171130              SELECT COUNT(1)
285400171130              INTO :ln_Count
285500171130              FROM MFAMFRPRP MFRPRP
285600171130              INNER JOIN MFAMFRHDP MFRHDP ON
285700171130              MFRHDP.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
285800210622      * RFS 186019 - Begins
285900210622      *       WHERE MFRHDP.ASSETS_BY_RULE IN ( "2" ,"3" )
286000210622              WHERE MFRHDP.ASSETS_BY_RULE IN ( "2" ,"3", "4")
286100210622      * RFS 186019 - Begins
286200171130             END-EXEC.
286300171130
286400171130             MOVE SQLSTATE      TO lc_sqlStates.
286500171130             IF lncc_sqlSuccessful
286600171130                CONTINUE
286700171130             ELSE
286800171130                SET lncc_Err-01         TO TRUE
286900171130                MOVE lc_ErrCodeDescr01  TO lc_sqlErrShortDESCR
287000171130             END-IF.
287100171130      *RFS167951 Ends
287200171130      *RFS167951 Starts
287300171130      *--------
287400171130       INT-001.
287500171130      *--------
287600171130      *RFS167951 Ends
287700110513      *RFS 34759 - Start
287800110513RF4697*    CALL "RTVCMPCD" USING WS-MCO.
287900110513RF4697*    CANCEL "RTVCMPCD".
288000110513      *RFS 34759 - End
288100110513      * OPEN FILES AND INITIALIZE ACCUMULATORS
288200110513
288300171012167951     SET lb_IvrAcclvlNo        TO TRUE.
288400171012
288500110513      * RFS 79774 - Begin
288600110513      * FXSCEDTALW progam to validate screen edits
288700110513           MOVE "N" TO lc-MfrEfs-Edit.
288800110513           MOVE lc-MfrEfs-Screen-Code
288900110513             TO Screen-Code OF Screen-Edits-Allowed-Rec.
289000110513           MOVE lc-MfrEfs-Edit-Code
289100110513             TO Edit-Code OF Screen-Edits-Allowed-Rec.
289200110513           MOVE lc-MfrEfs-Level-Code
289300110513             TO Level-Code OF Screen-Edits-Allowed-Rec.
289400110513
289500110513           CALL "FXSCEDTALW" USING Screen-Edits-Allowed-Rec
289600110513                                   Ws-Sea-Edit-Sqllog
289700110513                                   Ws-Sea-Return-Code.
289800110513
289900110513           IF Ws-Sea-Return-Code IS EQUAL TO "00"
290000110513              MOVE "Y" TO lc-MfrEfs-Edit
290100110513           END-IF.
290200110513      * RFS 79774 - End
290300110513
290400110513           OPEN INPUT  INVESTMENT-UNIT-PRICE
290500110513                       BUSINESS-DAY-FILE
290600110513                       MFR-SCHEDULE
290700110513                       ACCOUNT-INVESTMENT
290800110513                       TRANS
290900171017167951                 EXCHANGE-RATE-M
291000110513      *RFS 34759 - Start
291100110513                       Inv-Ass-Alloc-Mod-Sch-Hd
291200110513                       Inv-Ass-Alloc-Model-Sch-Dt.
291300110513      *RFS 34759 - End
291400110513
291500110513           INITIALIZE  WS-MFR-SCHEDULE-ARRAY
291600110513                       WS-TRANS-DATE-ARRAY
291700110513                       WS-BUSINESS-DAY-ARRAY.
291800110513
291900110513           MOVE "Y"           TO WS-FIRST-READ-SW.
292000110513
292100110521R92145     MOVE "N"           TO lc_MFR-Acc-Type.
292200110521
292300110513      * RFS 91773- Begin
292400110518           MOVE COMM-MFR-RUN-TYPE    TO lc_Mfr-Run-Type
292500110513
292600110521R92145     IF lb_AccCAL-Run OR lb_AccACR-Run
292700110521R92145        MOVE "Y"               TO lc_MFR-Acc-Type
292800110521R92145     END-IF.
292900171130      *RFS167951 Starts
293000171012           IF  lb_AccACR-Run             AND
293100171012               COMM-PROCESS-OPTION = "B" AND
293200171012               ln_Count > 1
293300171012               SET lb_IvrAccLvlYes    TO TRUE
293400171029               SET lc-ASBOneOnlyNo    TO TRUE
293500171012               MOVE ZERO TO ln_Count
293600171012           END-IF.
293700171130      *RFS167951 Ends
293800110622
293900110622R97579     IF COMM-PROCESS-OPTION = "B" AND COMM-MFR-RUN-TYPE = "B"
294000110622R97579        AND COMM-INVESTMENT-CODE NOT = " "
294100110622R97579        MOVE COMM-INVESTMENT-CODE TO lc_SingleInvestCode
294200110622R97579        MOVE SPACES TO COMM-INVESTMENT-CODE
294300110622R97579     END-IF.
294400171012
294500171012
294600110513           EXEC SQL
294700110513             WHENEVER SQLERROR CONTINUE
294800110513           END-EXEC.
294900110513
295000110513           IF lb_Cash-Run
295100110513              EXEC SQL
295200110513                 DROP TABLE QTEMP/MFRCSHEXT
295300110513              END-EXEC
295400110513
295500110513              EXEC SQL
295600110701                 CREATE TABLE QTEMP/MFRCSHEXT (
295700110513                             MFR_GROUP_CODE CHAR(4)
295800110513                            ,MFR_NME CHAR(25)
295900110705                            ,MFR_HOST_NME CHAR(30)
296000110513                            ,DEALER CHAR(04)
296100110513                            ,DEALER_NME CHAR(35)
296200110513                            ,DEALER_REP CHAR(6)
296300110513                            ,DEALER_REP_NME CHAR(45)
296400110513                            ,ACCOUNT CHAR(9)
296500110513                            ,DEALER_ACCOUNT CHAR(15)
296600110513                            ,INVESTOR_NME CHAR(45)
296700110513                            ,INVESTMENT_CODE CHAR(5)
296800110513                            ,INVEST_GRP_NME CHAR(35)
296900110520                            ,TRADING_DATE INTEGER
297000110513                            ,UNIT_BALANCE DECIMAL(12,3)
297100110513                            ,UNIT_PRICE DECIMAL(8,4)
297200110513                            ,MARKET_VAL DECIMAL(11,2)
297300110513                            ,TOTAL_MARKET_VAL DECIMAL(13,2))
297400110513              END-EXEC
297500110701
297600110701      *RFS97581 - START
297700110701              EXEC SQL
297800110701                 DROP TABLE QTEMP/MFRCSHEXT1
297900110701              END-EXEC
298000110701
298100110701              EXEC SQL
298200110701                 CREATE TABLE QTEMP/MFRCSHEXT1(
298300110701                             MFR_GROUP_CODE CHAR(4)
298400110701                            ,MFR_NME CHAR(25)
298500110701                            ,MFR_HOST_NME CHAR(30)
298600110701                            ,DEALER CHAR(04)
298700110701                            ,DEALER_NME CHAR(35)
298800110701                            ,DEALER_REP CHAR(6)
298900110701                            ,DEALER_REP_NME CHAR(45)
299000110701                            ,ACCOUNT CHAR(9)
299100110701                            ,DEALER_ACCOUNT CHAR(15)
299200110701                            ,INVESTOR_NME CHAR(45)
299300110701                            ,INVESTMENT_CODE CHAR(5)
299400110701                            ,INVEST_GRP_NME CHAR(35)
299500110701                            ,TRADING_DATE INTEGER
299600110701                            ,UNIT_BALANCE DECIMAL(12,3)
299700110701                            ,UNIT_PRICE DECIMAL(8,4)
299800110701                            ,MARKET_VAL DECIMAL(11,2)
299900110701                            ,ORIGIN CHAR(1)
300000110701                            ,GROUP_CODE CHAR(6))
300100110701              END-EXEC
300200110701      *RFS97581 - END
300300110513           END-IF.
300400110513      * RFS 91773- End
300500110513           IF COMM-PROCESS-OPTION = "O"
300600110513             GO TO INL-ON-LINE-OPTION
300700110513           END-IF.
300800171130      *RFS167951 Starts
300900160406      *RFS157482 START
301000171128      *    IF COMM-PROCESS-OPTION = "B"
301100171128      *      MOVE COMM-FROM-DATE TO WS-QBEGIN-N
301200171128      *      MOVE COMM-TO-DATE TO WS-QEND-N
301300171128      *      DIVIDE WS-QEND-YY BY 4 GIVING WS-LEAP0 REMAINDER WS-LEAP1
301400171128      *      IF WS-LEAP1 = 0
301500171128      *         MOVE 366 TO WS-DAYS-IN-YEAR
301600171128      *      ELSE
301700171128      *         MOVE 365 TO WS-DAYS-IN-YEAR
301800171128      *      END-IF
301900171128      *    END-IF.
302000160406      *RFS157482 ENDS
302100171130      *RFS167951 Ends
302200160406
302300110513       INL-BATCH-OPTION.
302400110621R97579     INITIALIZE lc_CloseInvestment.
302500110621
302600110513           OPEN INPUT INVESTMENT
302700110513R92145*         I-O   MFR-PROCESS.
302800110513R92145          I-O   MFR-PROCESS
302900110513R92145          I-O   Account-MFR-Accrual.
303000110513
303100110513           READ MFR-PROCESS NEXT RECORD
303200110513           AT END
303300110513             MOVE HIGH-VALUES TO CURR-CONTROLS
303400110513             GO TO INL-EXIT.
303500110513
303600171130      *RFS167951 Starts
303700171130      *    MOVE MIN-DATE OF MFR-PROCESS
303800171130      *                      TO WS-QBEGIN-N.
303900171130      *    MOVE MAX-DATE OF MFR-PROCESS
304000171130      *                      TO WS-QEND-N.
304100171130           INITIALIZE ln_StartDate,
304200171130                      ln_EndDate.
304300171130           MOVE MIN-DATE OF MFR-PROCESS
304400171130                             TO WS-QBEGIN-N
304500171130                                ln_StartDate.
304600171130           MOVE MAX-DATE OF MFR-PROCESS
304700171130                             TO WS-QEND-N
304800171130                                ln_EndDate.
304900171130      *RFS167951 Ends
305000110513
305100171130      *RFS167951 Starts
305200171130           DIVIDE WS-QEND-YY BY 4 GIVING
305300171130                  WS-LEAP0 REMAINDER WS-LEAP1
305400171130           IF WS-LEAP1 = 0
305500171130              MOVE 366 TO WS-DAYS-IN-YEAR
305600171130           ELSE
305700171130              MOVE 365 TO WS-DAYS-IN-YEAR
305800171130           END-IF.
305900171130      *RFS167951 Ends
306000171128
306100110513           PERFORM LOAD-INITIAL-ARRAY.
306200110513
306300110513           CLOSE INVESTMENT.
306400110621
306500110621R97579     SET lb_CloseInvestment TO TRUE
306600110513
306700171130      *RFS167951 Starts
306800171130           IF lb_IvrAccLvlYes
306900171130           OR (lb_IvrAccLvlNo AND lc-ASBOneOnlyYes)
307000180111      *RFS1000551-Starts
307100180111             EXEC SQL
307200180111              DROP INDEX QTEMP/TMPHHLDIVR_IDX1
307300180111             END-EXEC
307400180111
307500180111             EXEC SQL
307600180111              DROP INDEX QTEMP/TMPHHLDIVR_IDX2
307700180111             END-EXEC
307800180111
307900180111             EXEC SQL
308000180111              DROP INDEX QTEMP/TMPHHLDIVR_IDX3
308100180111             END-EXEC
308200180111
308300180111             EXEC SQL
308400180111              DROP INDEX QTEMP/TMPHHLDIVR_IDX4
308500180111             END-EXEC
308600180111      *RFS1000551-Ends
308700171130
308800171130             EXEC SQL
308900171130              DROP TABLE QTEMP/TMPHHLDIVR
309000171130             END-EXEC
309100171130
309200171130             EXEC SQL
309300171130              CREATE TABLE QTEMP/TMPHHLDIVR (
309400171130              MFR_GROUP_CODE        CHAR   (04)
309500171130                                    NOT NULL WITH DEFAULT,
309600171130              TRADE_DATE            NUM    (8,0)
309700171130                                    NOT NULL WITH DEFAULT,
309800171130              INVESTOR_NO           NUM    (9,0)
309900171130                                    NOT NULL WITH DEFAULT,
310000171130              ACCOUNT_NO            NUM    (9,0)
310100171130                                    NOT NULL WITH DEFAULT,
310200171130              INVESTMENT_CODE       CHAR   (05)
310300171130                                    NOT NULL WITH DEFAULT,
310400180129      *RFS177476-Starts
310500180129              CURRENCY              CHAR   (03)
310600180129                                    NOT NULL WITH DEFAULT,
310700180129              SAME_CURR             CHAR   (01)
310800180129                                    NOT NULL WITH DEFAULT,
310900180129      *RFS177476-Ends
311000171130              ASSETS_BY_RULE        CHAR   (01)
311100171130                                    NOT NULL WITH DEFAULT,
311200171130              MFR_SCHEDULE_CODE     CHAR   (03)
311300171130                                    NOT NULL WITH DEFAULT,
311400171130              OVR_MFR_SCHEDULE_CODE CHAR   (03)
311500171130                                    NOT NULL WITH DEFAULT,
311600210622      *RFS 186019 - Starts
311700210622              SECONDARY_ASSETS_FLAG CHAR   (01)
311800210622                                    NOT NULL WITH DEFAULT,
311900210713              ELIGIBLE_FOR_CALC     CHAR   (01)
312000210713                                    NOT NULL WITH DEFAULT,
312100210713              HOUSEHOLD_ID          NUM    (12)
312200210713                                    NOT NULL WITH DEFAULT,
312300210802              SIN_NO                NUM    (09)
312400210802                                    NOT NULL WITH DEFAULT,
312500210622      *RFS 186019 - Ends
312600171130              INV_ASSETS_AMT        DEC    (13,2)
312700171130                                    NOT NULL WITH DEFAULT,
312800171130              TOT_ACC_ASSETS_AMT    DEC    (13,2)
312900171130                                    NOT NULL WITH DEFAULT,
313000171130              TOT_IVR_ASSETS_AMT    DEC    (13,2)
313100171130                                    NOT NULL WITH DEFAULT,
313200171130              INV_MARKET_VALUE      DEC    (13,2)
313300171130                                    NOT NULL WITH DEFAULT,
313400171130              TOT_ACC_MARKET_VALUE  DEC    (13,2)
313500171130                                    NOT NULL WITH DEFAULT,
313600171130              TOT_IVR_MARKET_VALUE  DEC    (13,2)
313700171130                                    NOT NULL WITH DEFAULT,
313800171130              TOT_IVR_MFR_AMT       DEC    (15,6)
313900171130                                    NOT NULL WITH DEFAULT,
314000171130              TOT_ACC_MFR_AMT       DEC    (15,6)
314100171130                                    NOT NULL WITH DEFAULT
314200171130              )
314300171130             END-EXEC
314400171130
314500171130             MOVE SQLSTATE      TO lc_sqlStates
314600171130             IF lncc_sqlSuccessful
314700171130                CONTINUE
314800171130             ELSE
314900171130                SET lncc_Err-05         TO TRUE
315000171130                MOVE lc_ErrCodeDescr05  TO lc_sqlErrShortDESCR
315100171130             END-IF
315200171130
315300180111      *RFS1000551-Starts
315400180111           EXEC SQL
315500180111             CREATE INDEX QTEMP/TMPHHLDIVR_IDX1
315600180111                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
315700180111                                     ACCOUNT_NO,
315800180111                                     INVESTMENT_CODE)
315900180111           END-EXEC
316000180111
316100180111           EXEC SQL
316200180111             CREATE INDEX QTEMP/TMPHHLDIVR_IDX2
316300180111                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
316400180111                                     ACCOUNT_NO,
316500180111                                     INVESTMENT_CODE,
316600180111                                     TRADE_DATE)
316700180111           END-EXEC
316800180111
316900180111           EXEC SQL
317000180111             CREATE INDEX QTEMP/TMPHHLDIVR_IDX3
317100180111                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
317200180111                                     INVESTOR_NO,
317300180111                                     ASSETS_BY_RULE,
317400180111                                     TRADE_DATE)
317500180111           END-EXEC
317600180111
317700180111           EXEC SQL
317800180111             CREATE INDEX QTEMP/TMPHHLDIVR_IDX4
317900180111                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
318000180111                                     ACCOUNT_NO,
318100180111                                     ASSETS_BY_RULE,
318200180111                                     TRADE_DATE)
318300180111           END-EXEC
318400210713      * RFS 186019 - Begins
318500210713           IF lc_RegrAccrFlag = "Y"
318600210713           EXEC SQL
318700210713               INSERT INTO QTEMP/TMPHHLDIVR
318800210713               WITH TMPMFR   AS(
318900210713                 SELECT DISTINCT  "  "  BLANK,
319000210713                                  MFR_GROUP_CODE
319100210713                 FROM MFAMFRPRP),
319200210713               TMPBDAYS AS(
319300210713                 SELECT "  "  BLANK,
319400210713                        BUSINESS_DAY
319500210713                 FROM MFABUSDAP
319600210713                 WHERE BUSINESS_DAY >= :ln_StartDate AND
319700210713                       BUSINESS_DAY <= :ln_EndDate ),
319800210713               TMPMFRBDAY AS(
319900210713                 SELECT  MFR_GROUP_CODE ,
320000210713                         BUSINESS_DAY
320100210713                 FROM TMPMFR MFR
320200210713                 INNER JOIN TMPBDAYS BDAYS ON
320300210802                  MFR.BLANK = BDAYS.BLANK ),
320400210802               TMPIVR4    AS(
320500210802                 SELECT DISTINCT
320600210802                        COALESCE(IVRHDP.INVESTOR_NO,0)
320700210802                        INVESTOR_NO,
320800210802                        COALESCE(IVRHDP.INVESTOR_NO_2,0)
320900210802                        INVESTOR_NO_2,
321000210802                        COALESCE(IVRHHP.MFR_SCHEDULE_CODE," ")
321100210802                        MFR_SCHEDULE_CODE,
321200210802                        COALESCE(IVRP.SOCIAL_INSURANCE_NO,0)
321300210802                        SOCIAL_INSURANCE_NO,
321400210802                        IVRHDP.ACCOUNT_NO,
321500210802                        IVRHDP.HOUSEHOLD_ID,
321600210802                        IVRHDP.HOUSEHOLD_START_DATE,
321700210802                        IVRHDP.HOUSEHOLD_STOP_DATE
321800210713                 FROM MFAIVRHHP IVRHHP
321900210802                 INNER JOIN MFAIVRHDP IVRHDP      ON
322000210802                 IVRHDP.INVESTOR_NO      = IVRHHP.INVESTOR_NO AND
322100210802                 IVRHDP.HOUSEHOLD_LINKAGE_CODE
322200210802                                         =
322300210802                 IVRHHP.HOUSEHOLD_LINKAGE_CODE                AND
322400210802                 IVRHDP.HOUSEHOLD_ID     = IVRHHP.HOUSEHOLD_ID
322500210802
322600210802                 LEFT OUTER JOIN MFAIVRP IVRP     ON
322700210802                 IVRHDP.INVESTOR_NO_2    = IVRP.INVESTOR_NO
322800210802
322900210802                 LEFT OUTER JOIN MFAIVRTYP IVRTYP ON
323000210802                 IVRP.INVESTOR_TYPE_CODE = IVRTYP.INVESTOR_TYPE_CODE
323100210802
323200210802                 WHERE
323300210802                   IVRHHP.HOUSEHOLD_LINKAGE_CODE IN (
323400210802                    SELECT DISTINCT
323500210802                           COALESCE(RHDP1.HOUSEHOLD_LINKAGE_CODE," ")
323600210802                     FROM MFAMFRHDP RHDP1
323700210802                     WHERE ASSETS_BY_RULE               = "4" )
323800210802                         AND ((IVRTYP.INVESTOR_CATEGORY = "J" AND
323900210802                               IVRTYP.RECIPIENT_TYPE    = "2") OR
324000210802                               IVRTYP.RECIPIENT_TYPE    = "1")
324100210713
324200210713               ),
324300210713
324400210713               TMPHDIVR4  AS(
324500210713                 SELECT COALESCE(IVR4.INVESTOR_NO,0)
324600210713                        INVESTOR_NO,
324700210713                        COALESCE(IVR4.INVESTOR_NO_2,0)
324800210713                        INVESTOR_NO_2,
324900210714                        COALESCE(IVR4.MFR_SCHEDULE_CODE," ")
325000210713                        MFR_SCHEDULE_CODE,
325100210714                        IVR4.HOUSEHOLD_ID,
325200210802                        COALESCE(IVR4.SOCIAL_INSURANCE_NO,0)
325300210802                        SOCIAL_INSURANCE_NO,
325400210714                        IVR4.ACCOUNT_NO,
325500210714                        IVR4.HOUSEHOLD_START_DATE,
325600210802                        IVR4.HOUSEHOLD_STOP_DATE
325700210802                  FROM TMPIVR4 IVR4
325800210802                   WHERE IVR4.SOCIAL_INSURANCE_NO   <> 0
325900210802                    AND  ((:lc_EffectiveFlag         = "Y"
326000210802                    AND   IVR4.HOUSEHOLD_START_DATE <> "1900-01-01")
326100210802                     OR :lc_EffectiveFlag           = "N" )
326200210713               ),
326300210713
326400210802               TMPHDIVR  AS(
326500210713                 SELECT COALESCE(IVRHDP.INVESTOR_NO,0)
326600210713                        INVESTOR_NO,
326700210713                        COALESCE(IVRHDP.INVESTOR_NO_2,0)
326800210713                        INVESTOR_NO_2,
326900210713                        COALESCE(IVRHHP.MFR_SCHEDULE_CODE," ")
327000210713                        MFR_SCHEDULE_CODE
327100210713                        ,IVRHHP.HOUSEHOLD_ID
327200210802                        ,0  SOCIAL_INSURANCE_NO
327300210713                        ,IVRHDP.ACCOUNT_NO
327400210713                        ,IVRHDP.HOUSEHOLD_START_DATE
327500210802                        ,IVRHDP.HOUSEHOLD_STOP_DATE,
327600210802                        "3" ASSETS_BY_RULE
327700210713                 FROM MFAIVRHHP IVRHHP
327800210713
327900210713                 INNER JOIN MFAIVRHDP IVRHDP ON
328000210802                 IVRHDP.INVESTOR_NO        = IVRHHP.INVESTOR_NO AND
328100210802                 IVRHDP.HOUSEHOLD_LINKAGE_CODE
328200210802                                           =
328300210802                 IVRHHP.HOUSEHOLD_LINKAGE_CODE                  AND
328400210802                 IVRHDP.HOUSEHOLD_ID       = IVRHHP.HOUSEHOLD_ID
328500210713
328600210713                 WHERE
328700210802                  IVRHHP.HOUSEHOLD_LINKAGE_CODE IN (
328800210802                   SELECT DISTINCT
328900210802                          COALESCE(RHDP.HOUSEHOLD_LINKAGE_CODE," ")
329000210802                    FROM MFAMFRHDP RHDP
329100210802                    WHERE RHDP.ASSETS_BY_RULE           = "3" )
329200210802                     AND ((:lc_EffectiveFlag            = "Y"
329300210802                     AND   IVRHDP.HOUSEHOLD_START_DATE <> "1900-01-01")
329400210802                      OR   :lc_EffectiveFlag            = "N" )
329500210713
329600210713                 UNION ALL
329700210713
329800210713                 SELECT COALESCE(HDIVR4.INVESTOR_NO,0)
329900210713                        INVESTOR_NO,
330000210713                        COALESCE(HDIVR4.INVESTOR_NO_2,0)
330100210713                        INVESTOR_NO_2,
330200210713                        COALESCE(HDIVR4.MFR_SCHEDULE_CODE," ")
330300210713                        MFR_SCHEDULE_CODE,
330400210713                        HDIVR4.HOUSEHOLD_ID,
330500210802                        COALESCE(HDIVR4.SOCIAL_INSURANCE_NO,0)
330600210802                        SOCIAL_INSURANCE_NO,
330700210713                        HDIVR4.ACCOUNT_NO,
330800210713                        HDIVR4.HOUSEHOLD_START_DATE,
330900210802                        HDIVR4.HOUSEHOLD_STOP_DATE,
331000210802                        "4" ASSETS_BY_RULE
331100210713                 FROM TMPHDIVR4 HDIVR4
331200210713
331300210713                  )
331400210713
331500210713                   SELECT DISTINCT
331600210713                    COALESCE(MFRPRP.MFR_GROUP_CODE," "),
331700210713                    COALESCE(MFRBDAY.BUSINESS_DAY,0),
331800210713                    CASE WHEN COALESCE(HDIVR.INVESTOR_NO,0) = 0
331900210713                    THEN COALESCE(ACCNTP.INVESTOR_NO,0)
332000210713                    ELSE COALESCE(HDIVR.INVESTOR_NO,0)
332100210713                    END,
332200210713                    COALESCE(MFRPRP.ACCOUNT_NO,0),
332300210713                    COALESCE(MFRPRP.INVESTMENT_CODE," "),
332400210713                    COALESCE(INVP.CURRENCY," "),
332500210713                    " " ,
332600210713                    COALESCE(MFRHDP.ASSETS_BY_RULE," "),
332700210713                    COALESCE(MFRPRP.MFR_SCHEDULE_CODE," "),
332800210713                    COALESCE(HDIVR.MFR_SCHEDULE_CODE," "),
332900210713                    COALESCE(MFRHDP.SECONDARY_ASSETS_FLAG," "),
333000210727                    CASE
333100210802                    WHEN COALESCE(MFRHDP.ASSETS_BY_RULE," ") =  "2"
333200210802                         THEN "Y"
333300210727                    WHEN DECIMAL
333400210727                    (REPLACE(CHAR(HDIVR.HOUSEHOLD_START_DATE,ISO),
333500210727                                  "-","")) <=
333600210727                         COALESCE(MFRBDAY.BUSINESS_DAY,0)
333700210802                     AND HDIVR.HOUSEHOLD_STOP_DATE = "1900-01-01"
333800210802                     AND :lc_EffectiveFlag         = "Y"
333900210802                         THEN "Y"
334000210727                    WHEN DECIMAL((REPLACE
334100210714                    (CHAR(HDIVR.HOUSEHOLD_START_DATE,ISO),"-","")))
334200210714                                    <=
334300210713                    COALESCE(MFRBDAY.BUSINESS_DAY,0)
334400210713                                        AND
334500210714                    DECIMAL((REPLACE
334600210722                    (CHAR(HDIVR.HOUSEHOLD_STOP_DATE,ISO),"-","")))
334700210714                                    >=
334800210713
334900210713                    COALESCE(MFRBDAY.BUSINESS_DAY,0)
335000210713                     AND :lc_EffectiveFlag = "Y"
335100210713                         THEN "Y"
335200210713                    WHEN :lc_EffectiveFlag = "Y"
335300210802                         THEN "N" ELSE "Y" END ELIGIBLE_CALC,
335400210802                    COALESCE(HDIVR.HOUSEHOLD_ID, 0 ),
335500210802                    COALESCE(HDIVR.SOCIAL_INSURANCE_NO,0),
335600210713                    0,
335700210713                    0,
335800210713                    0,
335900210713                    0,
336000210713                    0,
336100210713                    0,
336200210713                    0,
336300210713                    0
336400210713                FROM MFAMFRPRP MFRPRP
336500210713
336600210713                INNER JOIN MFAMFRHDP MFRHDP ON
336700210802                MFRHDP.MFR_GROUP_CODE  = MFRPRP.MFR_GROUP_CODE
336800210713
336900210713                INNER JOIN MFAACCNTP ACCNTP ON
337000210802                ACCNTP.ACCOUNT_NO      = MFRPRP.ACCOUNT_NO
337100210713
337200210713                INNER JOIN MFAINVP INVP ON
337300210802                INVP.INVESTMENT_CODE   = MFRPRP.INVESTMENT_CODE
337400210713
337500210713                LEFT OUTER JOIN TMPHDIVR HDIVR ON
337600210802                HDIVR.INVESTOR_NO_2    = ACCNTP.INVESTOR_NO AND
337700210802                HDIVR.ACCOUNT_NO       = ACCNTP.ACCOUNT_NO  AND
337800210802                HDIVR.ASSETS_BY_RULE   = MFRHDP.ASSETS_BY_RULE
337900210802
338000210713                LEFT OUTER JOIN TMPMFRBDAY MFRBDAY ON
338100210802                MFRBDAY.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
338200210713           END-EXEC
338300210713
338400210713           ELSE
338500210713      * RFS 186019 - Ends
338600210713
338700180111      *RFS1000551-Ends
338800171130
338900171130           EXEC SQL
339000171130               INSERT INTO QTEMP/TMPHHLDIVR
339100171130               WITH TMPMFR   AS(
339200171130                 SELECT DISTINCT  "  "  BLANK,
339300171130                                  MFR_GROUP_CODE
339400171130                 FROM MFAMFRPRP),
339500171130               TMPBDAYS AS(
339600171130                 SELECT "  "  BLANK,
339700171130                        BUSINESS_DAY
339800171130                 FROM MFABUSDAP
339900171130                 WHERE BUSINESS_DAY >= :ln_StartDate AND
340000171130                       BUSINESS_DAY <= :ln_EndDate ),
340100171130               TMPMFRBDAY AS(
340200171130                 SELECT  MFR_GROUP_CODE ,
340300171130                         BUSINESS_DAY
340400171130                 FROM TMPMFR MFR
340500171130                 INNER JOIN TMPBDAYS BDAYS ON
340600171130                 MFR.BLANK = BDAYS.BLANK ),
340700210622
340800171130               TMPHDIVR AS(
340900171130                 SELECT COALESCE(IVRHDP.INVESTOR_NO,0)
341000171130                        INVESTOR_NO,
341100171130                        COALESCE(IVRHDP.INVESTOR_NO_2,0)
341200171130                        INVESTOR_NO_2,
341300171130                        COALESCE(IVRHHP.MFR_SCHEDULE_CODE," ")
341400171130                        MFR_SCHEDULE_CODE
341500210622      * RFS 186019 - Begins
341600210713                        ,IVRHHP.HOUSEHOLD_ID HOUSEHOLD_ID
341700210622      * RFS 186019 - Ends
341800171130                 FROM MFAIVRHHP IVRHHP
341900171130
342000171130                 INNER JOIN MFAIVRHDP IVRHDP ON
342100171130                 IVRHDP.INVESTOR_NO = IVRHHP.INVESTOR_NO
342200171130                 AND IVRHDP.HOUSEHOLD_LINKAGE_CODE =
342300171130                     IVRHHP.HOUSEHOLD_LINKAGE_CODE
342400180611179223      AND  IVRHDP.HOUSEHOLD_ID = IVRHHP.HOUSEHOLD_ID
342500171130
342600171130                 WHERE
342700210623      *
342800210623186019*          IVRHHP.HOUSEHOLD_LINKAGE_CODE = "MFB")
342900210622                 IVRHHP.HOUSEHOLD_LINKAGE_CODE IN (
343000210707            SELECT DISTINCT COALESCE(RHDP.HOUSEHOLD_LINKAGE_CODE," ")
343100210623                 FROM MFAMFRHDP RHDP
343200210713                 WHERE ASSETS_BY_RULE ="3" ))
343300171130
343400171130                   SELECT DISTINCT
343500171130                    COALESCE(MFRPRP.MFR_GROUP_CODE," "),
343600171130                    COALESCE(MFRBDAY.BUSINESS_DAY,0),
343700171130                    CASE WHEN COALESCE(HDIVR.INVESTOR_NO,0) = 0
343800171130                    THEN COALESCE(ACCNTP.INVESTOR_NO,0)
343900171130                    ELSE COALESCE(HDIVR.INVESTOR_NO,0)
344000171130                    END,
344100171130                    COALESCE(MFRPRP.ACCOUNT_NO,0),
344200171130                    COALESCE(MFRPRP.INVESTMENT_CODE," "),
344300180129      *RFS177476-Starts
344400180129                    COALESCE(INVP.CURRENCY," "),
344500180129                    " " ,
344600180129      *RFS177476-Ends
344700171130                    COALESCE(MFRHDP.ASSETS_BY_RULE," "),
344800171130                    COALESCE(MFRPRP.MFR_SCHEDULE_CODE," "),
344900171130                    COALESCE(HDIVR.MFR_SCHEDULE_CODE," "),
345000210622      *RFS 186019 - Starts
345100210622                    COALESCE(MFRHDP.SECONDARY_ASSETS_FLAG," "),
345200210713                    "Y",
345300210714                    COALESCE(HDIVR.HOUSEHOLD_ID, 0 ),
345400210802                    0,
345500210622      *RFS 186019 - Ends
345600171130                    0,
345700171130                    0,
345800171130                    0,
345900171130                    0,
346000171130                    0,
346100171130                    0,
346200171130                    0,
346300171130                    0
346400171130                FROM MFAMFRPRP MFRPRP
346500171130
346600171130                INNER JOIN MFAMFRHDP MFRHDP ON
346700171130                MFRHDP.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
346800171130
346900171130                INNER JOIN MFAACCNTP ACCNTP ON
347000171130                ACCNTP.ACCOUNT_NO = MFRPRP.ACCOUNT_NO
347100171130
347200180129      *RFS177476-Starts
347300180129                INNER JOIN MFAINVP INVP ON
347400180129                INVP.INVESTMENT_CODE = MFRPRP.INVESTMENT_CODE
347500180129
347600180129      *RFS177476-Ends
347700171130                LEFT OUTER JOIN TMPHDIVR HDIVR ON
347800171130                HDIVR.INVESTOR_NO_2 = ACCNTP.INVESTOR_NO
347900171130
348000171130                LEFT OUTER JOIN TMPMFRBDAY MFRBDAY ON
348100171130                MFRBDAY.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
348200171130
348300171130           END-EXEC
348400180202177476*    END-IF.
348500210714      * RFS 186019 - Begins
348600210714           END-IF
348700210714      * RFS 186019 - Ends
348800171130
348900171130
349000171130             MOVE SQLSTATE      TO lc_sqlStates
349100171130             IF lncc_sqlSuccessful
349200171130                CONTINUE
349300171130             ELSE
349400171130                SET lncc_Err-06         TO TRUE
349500171130                MOVE lc_ErrCodeDescr06  TO lc_sqlErrShortDESCR
349600171130             END-IF
349700180202      *RFS177476-Starts
349800180202      *--------------------------------------
349900180202      *UPDATE-SAME-CURR-ACC-LEVEL
350000180202      *--------------------------------------
350100180202
350200180202           EXEC SQL
350300180202              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
350400180202              SET HHLDIVR.SAME_CURR =
350500180202              (SELECT CASE WHEN COUNT(DISTINCT HHLDIVR1.CURRENCY)> 1
350600180202                            THEN "N"
350700180202                           ELSE "Y"
350800180202                      END
350900180202               FROM QTEMP/TMPHHLDIVR HHLDIVR1
351000180202               WHERE HHLDIVR1.MFR_GROUP_CODE
351100180202                     = HHLDIVR.MFR_GROUP_CODE
351200210802      *RFS186019 - starts
351300210802               AND   HHLDIVR1.HOUSEHOLD_ID
351400210802                     = HHLDIVR.HOUSEHOLD_ID
351500210802      *RFS186019 - Ends
351600180202               AND   HHLDIVR1.ACCOUNT_NO
351700180202                     = HHLDIVR.ACCOUNT_NO
351800180202               AND   HHLDIVR1.ASSETS_BY_RULE
351900180202                     = HHLDIVR.ASSETS_BY_RULE
352000180202               AND   HHLDIVR1.ASSETS_BY_RULE
352100180202                     = "2"
352200180202              )
352300180202              WHERE EXISTS
352400180202                 (SELECT 1
352500180202                  FROM QTEMP/TMPHHLDIVR HHLDIVR2
352600180725      *RFS179061 - Starts
352700180725      *           WHERE HHLDIVR2.MFR_GROUP_CODE  =
352800180725      *                 HHLDIVR1.MFR_GROUP_CODE  AND
352900180725      *                 HHLDIVR2.ACCOUNT_NO      =
353000180725      *                 HHLDIVR1.ACCOUNT_NO      AND
353100180725      *                 HHLDIVR2.ASSETS_BY_RULE  =
353200180725      *                 HHLDIVR1.ASSETS_BY_RULE  AND
353300180725      *                 HHLDIVR2.ASSETS_BY_RULE  = "2" )
353400180725                  WHERE HHLDIVR2.MFR_GROUP_CODE  =
353500180725                        HHLDIVR.MFR_GROUP_CODE  AND
353600210802      *RFS186019 - starts
353700210802                        HHLDIVR2.HOUSEHOLD_ID   =
353800210802                        HHLDIVR.HOUSEHOLD_ID    AND
353900210802      *RFS186019 - Ends
354000180725                        HHLDIVR2.ACCOUNT_NO      =
354100180725                        HHLDIVR.ACCOUNT_NO      AND
354200180725                        HHLDIVR2.ASSETS_BY_RULE  =
354300180725                        HHLDIVR.ASSETS_BY_RULE  AND
354400180725                        HHLDIVR2.ASSETS_BY_RULE  = "2" )
354500180725      *RFS179061 - Ends
354600180202           END-EXEC
354700180202
354800180202           MOVE SQLSTATE      TO lc_sqlStates
354900180202           IF lncc_sqlSuccessful
355000180202              CONTINUE
355100180202           ELSE
355200180202              SET lncc_Err-17         TO TRUE
355300180202              MOVE lc_ErrCodeDescr17  TO lc_sqlErrShortDESCR
355400180202           END-IF
355500180202      *--------------------------------------
355600180202      *UPDATE-SAME-CURR-IVR-LEVEL
355700180202      *--------------------------------------
355800180202
355900180202           EXEC SQL
356000180202              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
356100180202              SET HHLDIVR.SAME_CURR =
356200180202              (SELECT CASE WHEN COUNT(DISTINCT HHLDIVR1.CURRENCY)> 1
356300180202                            THEN "N"
356400180202                           ELSE "Y"
356500180202                      END
356600180202               FROM QTEMP/TMPHHLDIVR HHLDIVR1
356700180202               WHERE HHLDIVR1.MFR_GROUP_CODE
356800180202                     = HHLDIVR.MFR_GROUP_CODE
356900210802      *RFS186019 - starts
357000210802               AND   HHLDIVR1.HOUSEHOLD_ID
357100210802                     = HHLDIVR.HOUSEHOLD_ID
357200210802      *RFS186019 - Ends
357300180202               AND   HHLDIVR1.INVESTOR_NO
357400180202                     = HHLDIVR.INVESTOR_NO
357500180202               AND   HHLDIVR1.ASSETS_BY_RULE
357600180202                     = HHLDIVR.ASSETS_BY_RULE
357700180202               AND   HHLDIVR1.ASSETS_BY_RULE
357800180202                     = "3"
357900180202              )
358000180202              WHERE EXISTS
358100180202                 (SELECT 1
358200180202                  FROM QTEMP/TMPHHLDIVR HHLDIVR2
358300180725      *RFS179061 - Starts
358400180725      *           WHERE HHLDIVR2.MFR_GROUP_CODE  =
358500180725      *                 HHLDIVR1.MFR_GROUP_CODE  AND
358600180725      *                 HHLDIVR2.INVESTOR_NO     =
358700180725      *                 HHLDIVR1.INVESTOR_NO     AND
358800180725      *                 HHLDIVR2.ASSETS_BY_RULE  =
358900180725      *                 HHLDIVR1.ASSETS_BY_RULE  AND
359000180725      *                 HHLDIVR2.ASSETS_BY_RULE  = "3" )
359100180725                  WHERE HHLDIVR2.MFR_GROUP_CODE  =
359200180725                        HHLDIVR.MFR_GROUP_CODE  AND
359300180725                        HHLDIVR2.INVESTOR_NO     =
359400180725                        HHLDIVR.INVESTOR_NO     AND
359500210802      * RFS186019 - starts
359600210802                        HHLDIVR2.HOUSEHOLD_ID   =
359700210802                        HHLDIVR.HOUSEHOLD_ID    AND
359800210802      * RFS186019 - Ends
359900180725                        HHLDIVR2.ASSETS_BY_RULE  =
360000180725                        HHLDIVR.ASSETS_BY_RULE  AND
360100180725                        HHLDIVR2.ASSETS_BY_RULE  = "3" )
360200180725      *RFS179061 - Ends
360300180202           END-EXEC
360400180202
360500180202           MOVE SQLSTATE      TO lc_sqlStates
360600180202           IF lncc_sqlSuccessful
360700180202              CONTINUE
360800180202           ELSE
360900180202              SET lncc_Err-18         TO TRUE
361000180202              MOVE lc_ErrCodeDescr18  TO lc_sqlErrShortDESCR
361100180202           END-IF
361200180202      *RFS177476-Ends
361300180202177476     END-IF.
361400171130
361500210802      *RFS186019 - starts
361600210802      *--------------------------------------
361700210802      *UPDATE-SAME-CURR-IVR-SAME-SIN-LEVEL
361800210802      *--------------------------------------
361900210802
362000210802           EXEC SQL
362100210802              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
362200210802              SET HHLDIVR.SAME_CURR =
362300210802              (SELECT CASE WHEN COUNT(DISTINCT HHLDIVR1.CURRENCY)> 1
362400210802                            THEN "N"
362500210802                           ELSE "Y"
362600210802                      END
362700210802               FROM QTEMP/TMPHHLDIVR HHLDIVR1
362800210802               WHERE HHLDIVR1.MFR_GROUP_CODE
362900210802                     = HHLDIVR.MFR_GROUP_CODE
363000210802               AND   HHLDIVR1.INVESTOR_NO
363100210802                     = HHLDIVR.INVESTOR_NO
363200210802               AND   HHLDIVR1.HOUSEHOLD_ID
363300210802                     = HHLDIVR.HOUSEHOLD_ID
363400210802               AND   HHLDIVR1.SIN_NO
363500210802                     = HHLDIVR.SIN_NO
363600210802               AND   HHLDIVR1.SIN_NO   <> 0
363700210802               AND   HHLDIVR1.ASSETS_BY_RULE
363800210802                     = HHLDIVR.ASSETS_BY_RULE
363900210802               AND   HHLDIVR1.ASSETS_BY_RULE
364000210802                     = "4"
364100210802              )
364200210802              WHERE EXISTS
364300210802                 (SELECT 1
364400210802                  FROM QTEMP/TMPHHLDIVR HHLDIVR2
364500210802                  WHERE HHLDIVR2.MFR_GROUP_CODE  =
364600210802                        HHLDIVR.MFR_GROUP_CODE  AND
364700210802                        HHLDIVR2.INVESTOR_NO     =
364800210802                        HHLDIVR.INVESTOR_NO     AND
364900210802                        HHLDIVR2.HOUSEHOLD_ID   =
365000210802                        HHLDIVR.HOUSEHOLD_ID    AND
365100210802                        HHLDIVR2.SIN_NO   =
365200210802                        HHLDIVR.SIN_NO          AND
365300210802                        HHLDIVR2.SIN_NO   <> 0  AND
365400210802                        HHLDIVR2.ASSETS_BY_RULE  =
365500210802                        HHLDIVR.ASSETS_BY_RULE  AND
365600210802                        HHLDIVR2.ASSETS_BY_RULE  = "4" )
365700210802           END-EXEC
365800210802
365900210802           MOVE SQLSTATE      TO lc_sqlStates
366000210802           IF lncc_sqlSuccessful
366100210802              CONTINUE
366200210802           ELSE
366300210802              SET lncc_Err-21         TO TRUE
366400210802              MOVE lc_ErrCodeDescr21  TO lc_sqlErrShortDESCR
366500210802           END-IF
366600210802      *RFS186019 - Ends
366700171130           IF lb_IvrAccLvlYes
366800171130
366900171130              EXEC SQL
367000171130                 DROP TABLE QTEMP/TMPACCINV
367100171130              END-EXEC
367200171130
367300171130              EXEC SQL
367400171130                CREATE TABLE QTEMP/TMPACCINV
367500171130                 (MFR_GROUP_CODE    CHAR   (04)
367600171130                                    NOT NULL WITH  DEFAULT,
367700171130                  ACCOUNT_NO        NUM   (9,0)
367800171130                                    NOT NULL WITH  DEFAULT,
367900171130                  INVESTMENT_CODE   CHAR   (05)
368000171130                                    NOT NULL WITH  DEFAULT,
368100171130                  TRADE_DATE        NUM   (8,0)
368200171130                                    NOT NULL WITH  DEFAULT,
368300171130                  INV_ASSETS_AMT    DEC   (13,2)
368400171130                                    NOT NULL WITH  DEFAULT,
368500171130                  INV_MARKET_VALUE  DEC   (13,2)
368600171130                                    NOT NULL WITH  DEFAULT)
368700171130              END-EXEC
368800171130
368900171130             MOVE SQLSTATE      TO lc_sqlStates
369000171130             IF lncc_sqlSuccessful
369100171130                CONTINUE
369200171130             ELSE
369300171130                SET lncc_Err-07         TO TRUE
369400171130                MOVE lc_ErrCodeDescr07  TO lc_sqlErrShortDESCR
369500171130             END-IF
369600171130
369700171130              EXEC SQL
369800171130               DECLARE TOT_MFR_CURSOR CURSOR FOR
369900180109      *RFS1000551-Starts
370000180106      *        SELECT HHLDIVR.TRADE_DATE,
370100180106               SELECT DISTINCT
370200180106                      HHLDIVR.TRADE_DATE,
370300180109      *RFS1000551-Ends
370400171130                      HHLDIVR.MFR_GROUP_CODE,
370500171130                      HHLDIVR.INVESTOR_NO,
370600171130                      HHLDIVR.ACCOUNT_NO,
370700180109      *RFS1000551-Starts
370800180109      *               HHLDIVR.INVESTMENT_CODE,
370900180109      *RFS1000551-Ends
371000171130                      HHLDIVR.ASSETS_BY_RULE,
371100171130               CASE WHEN HHLDIVR.OVR_MFR_SCHEDULE_CODE = " "
371200171130                    THEN HHLDIVR.MFR_SCHEDULE_CODE
371300171130               ELSE HHLDIVR.OVR_MFR_SCHEDULE_CODE END,
371400171130               CASE WHEN HHLDIVR.ASSETS_BY_RULE = "3"
371500171130                    THEN HHLDIVR.TOT_IVR_ASSETS_AMT
371600171130               ELSE HHLDIVR.TOT_ACC_ASSETS_AMT END,
371700171130               CASE WHEN HHLDIVR.ASSETS_BY_RULE = "3"
371800171130                    THEN HHLDIVR.TOT_IVR_MARKET_VALUE
371900171130               ELSE HHLDIVR.TOT_ACC_MARKET_VALUE END
372000171130               FROM  QTEMP/TMPHHLDIVR HHLDIVR
372100171130
372200171130               INNER JOIN MFAMFRDTP MFRDTP ON
372300171130               HHLDIVR.MFR_GROUP_CODE = MFRDTP.MFR_GROUP_CODE
372400171130               AND HHLDIVR.INVESTMENT_CODE
372500171130                   = MFRDTP.INVESTMENT_CODE
372600171130               WHERE HHLDIVR.ASSETS_BY_RULE IN ("2","3")
372700171130                 AND MFRDTP.MFR_CALCULATION_IND = "G"
372800171130               ORDER BY HHLDIVR.MFR_GROUP_CODE,
372900171130                        HHLDIVR.INVESTOR_NO,
373000171130                        HHLDIVR.ASSETS_BY_RULE  DESC,
373100171130                        HHLDIVR.ACCOUNT_NO,
373200171130                        HHLDIVR.TRADE_DATE
373300171130               END-EXEC
373400171130
373500171130             MOVE SQLSTATE      TO lc_sqlStates
373600171130             IF lncc_sqlSuccessful
373700171130                CONTINUE
373800171130             ELSE
373900171130                SET lncc_Err-08         TO TRUE
374000171130                MOVE lc_ErrCodeDescr08  TO lc_sqlErrShortDESCR
374100171130             END-IF
374200171130               END-IF.
374300171130
374400171130      *RFS167951 Ends
374500110513           GO TO INL-THE-REST.
374600110513
374700110513
374800110513       INL-ON-LINE-OPTION.
374900110519
375000110519R92145     OPEN INPUT ACCOUNT-MFR-ACCRUAL.
375100110513
375200110513           MOVE COMM-FROM-DATE
375300110513                             TO WS-QBEGIN-N.
375400110513           MOVE COMM-TO-DATE TO WS-QEND-N.
375500110513
375600110513RF4556* Leap year calculation  for end date
375700110513
375800110513RF4556     DIVIDE WS-QEND-YY BY 4 GIVING WS-LEAP0
375900110513RF4556     REMAINDER WS-LEAP1.
376000110513
376100110513RF4556        IF WS-LEAP1 = 0
376200110513RF4556           MOVE 366 TO WS-DAYS-IN-YEAR
376300110513RF4556        ELSE
376400110513RF4556           MOVE 365 TO WS-DAYS-IN-YEAR
376500110513RF4556        END-IF.
376600110513
376700110513
376800110513           PERFORM LOAD-INITIAL-ARRAY.
376900110513
377000110513       INL-THE-REST.
377100110513
377200110513           CLOSE INVESTMENT-UNIT-PRICE
377300110513                 BUSINESS-DAY-FILE.
377400110513
377500110513           MOVE LOW-VALUES   TO CURR-CONTROLS
377600110513                                PREV-CONTROLS.
377700110513
377800110513           ACCEPT WS-SYSTIME-LONG FROM TIME.
377900110513           ACCEPT WS-SYSDATE-YMD  FROM DATE.
378000110513
378100110513           IF WS-SYSDATE-YY LESS THAN 80
378200110513              MOVE 20        TO WS-SYSDATE-CC
378300110513           ELSE
378400110513              MOVE 19        TO WS-SYSDATE-CC
378500110513           END-IF.
378600171130      *RFS167951 Starts
378700171130           IF COMM-PROCESS-OPTION = "B" AND
378800171130              lb_IvrAccLvlNo            AND
378900171130              lc-ASBOneOnlyNo
379000171130                IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
379100171130                   GO TO ML-1200
379200171130                ELSE
379300171130                  GO TO ML-0010
379400171130                END-IF
379500171130           END-IF.
379600171130      *RFS167951 Ends
379700110513
379800110513       INL-EXIT.
379900110513           EXIT.
380000110513      /
380100110513       END-JOB SECTION.
380200110513
380300110513           CLOSE TRANS
380400110513                 ACCOUNT-INVESTMENT
380500110513                 MFR-SCHEDULE
380600171017167951           EXCHANGE-RATE-M
380700110513      *RFS 34759 - Start
380800110513                 Inv-Ass-Alloc-Mod-Sch-Hd
380900110513R92145*          Inv-Ass-Alloc-Model-Sch-Dt.
381000110513      *RFS 34759 - End
381100110513R92145           Inv-Ass-Alloc-Model-Sch-Dt
381200110513R92145           Account-MFR-Accrual.
381300110513
381400110621R97579     IF NOT lb_CloseInvestment
381500110621R97579        CLOSE INVESTMENT
381600110621R97579     END-IF.
381700110621
381800171027      * RFS49699 - Begin
381900180202
382000110513           MOVE "LOGARR"               to Pass-Screen-Code.
382100110513           MOVE "LOGARR"               to Pass-Edit-Code.
382200110513           MOVE "N"                    to Pass-Level-Code.
382300110513
382400110513           call "FXSCEDTAL1" using Pass-Screen-Code
382500110513                                   Pass-Edit-Code
382600110513                                   Pass-Level-Code
382700110513                                   Retn-Edit-Allowed-Flag.
382800110513
382900110513           IF Retn-Edit-Allowed
383000110513               PERFORM ARRAY-LOGGING
383100110513           END-IF.
383200110513
383300171027      * RFS49699 - End
383400110513
383500110513
383600110513           IF COMM-PROCESS-OPTION = "O"
383700110513             GO TO EOJ-EXIT
383800110513           END-IF.
383900110513
384000110513      * Close Batch process files
384100110513
384200110513           CLOSE MFR-PROCESS.
384300110513
384400110513       EOJ-EXIT.
384500110513           EXIT.
384600171027      * RFS49699 - Begin call array logging if on!
384700110513
384800110513       ARRAY-LOGGING SECTION.
384900110513
385000110513           MOVE "MFRCALC"              TO  pp-Program-Name.
385100110513
385200110513           MOVE WS-ARRAY1-NAME         TO  pp-Array-Name.
385300110513           SET  WS-ARR-INVUPLB         TO  TRUE.
385400110513           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
385500110513           MOVE WS-ARRAY1-MAX          TO  pp-Max-Size.
385600110513           MOVE WS-ARRAY1-MAX-USED     TO  pp-Max-Size-Used.
385700110513           MOVE SPACES                 TO  rp-Err-Flag.
385800110513
385900110513           CALL "FXLOGAU"      using PR-FXLOGAU.
386000110513
386100110513           MOVE WS-ARRAY2-NAME         TO  pp-Array-Name.
386200110513           SET  WS-ARR-MFRSCP          TO  TRUE.
386300110513           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
386400110513           MOVE WS-ARRAY2-MAX          TO  pp-Max-Size.
386500110513           MOVE WS-ARRAY2-MAX-USED     TO  pp-Max-Size-Used.
386600110513           MOVE SPACES                 TO  rp-Err-Flag.
386700110513
386800110513           CALL "FXLOGAU"      using PR-FXLOGAU.
386900110513
387000110513           MOVE WS-ARRAY3-NAME         TO  pp-Array-Name.
387100110513           SET  WS-ARR-BUSDAP          TO  TRUE.
387200110513           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
387300110513           MOVE WS-ARRAY3-MAX          TO  pp-Max-Size.
387400110513           MOVE WS-ARRAY3-MAX-USED     TO  pp-Max-Size-Used.
387500110513           MOVE SPACES                 TO  rp-Err-Flag.
387600110513
387700110513           CALL "FXLOGAU"      using PR-FXLOGAU.
387800110513
387900110513           MOVE WS-ARRAY4-NAME         TO  pp-Array-Name.
388000110513           SET  WS-ARR-INVMNT          TO  TRUE.
388100110513           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
388200110513           MOVE WS-ARRAY4-MAX          TO  pp-Max-Size.
388300110513           MOVE WS-ARRAY4-MAX-USED     TO  pp-Max-Size-Used.
388400110513           MOVE SPACES                 TO  rp-Err-Flag.
388500110513
388600110513           CALL "FXLOGAU"      using PR-FXLOGAU.
388700110513
388800110513           MOVE WS-ARRAY5-NAME         TO  pp-Array-Name.
388900110513           SET  WS-ARR-BUSDAP          TO  TRUE.
389000110513           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
389100110513           MOVE WS-ARRAY5-MAX          TO  pp-Max-Size.
389200110513           MOVE WS-ARRAY5-MAX-USED     TO  pp-Max-Size-Used.
389300110513           MOVE SPACES                 TO  rp-Err-Flag.
389400110513
389500110513           CALL "FXLOGAU"      using PR-FXLOGAU.
389600110513           CANCEL  "FXLOGAU".
389700110513
389800110513       ARL-EXIT.
389900110513           EXIT.
390000110513
390100171027      * RFS49699 - End
390200110513      /
390300110513       LOAD-INITIAL-ARRAY SECTION.
390400110513      ** LOAD BUSINESS-DAY ARRAY
390500110513       LIA-DAYS.
390600110513      ** INITIALIZE
390700110513           INITIALIZE WS-BUSINESS-DAY-ARRAY.
390800110513
390900110513           SET BUDIDX        TO 1.
391000110513           SET BUDIDX        DOWN BY 1.
391100110513
391200110513       LIA-D-0010.
391300110513
391400110513           MOVE WS-QBEGIN-N  TO BUSINESS-DAY OF BUD-REC.
391500110513
391600110513           START BUSINESS-DAY-FILE
391700110513           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
391800110513           INVALID KEY
391900110513             MOVE HIGH-VALUES TO CURR-CONTROLS
392000110513             GO TO LIA-EXIT.
392100110513
392200110513       LIA-D-0020.
392300110513
392400110513           READ BUSINESS-DAY-FILE NEXT RECORD
392500110513           AT END
392600110513             SET BUDMAX      TO BUDIDX
392700110513             MOVE "Y"        TO WS-B-BUDIDX-END(BUDIDX)
392800110513             GO TO LIA-EXIT.
392900110513
393000110513           IF BUSINESS-DAY OF BUD-REC IS GREATER THAN WS-QEND-N
393100110513             SET BUDMAX      TO BUDIDX
393200110513             MOVE "Y"        TO WS-B-BUDIDX-END(BUDIDX)
393300110513             GO TO LIA-EXIT
393400110513           END-IF.
393500110513
393600110513           SET BUDIDX UP BY 1.
393700110513
393800171027      * RFS49699 - Array logging logic
393900110513
394000110513           IF BUDIDX           > WS-ARRAY3-MAX-USED
394100110513               MOVE BUDIDX                 TO WS-ARRAY3-MAX-USED
394200110513           END-IF.
394300110513
394400171027      * RFS49699 - End
394500110513
394600110513           MOVE "N"          TO WS-B-BUDIDX-END(BUDIDX).
394700110513           MOVE BUSINESS-DAY OF BUD-REC
394800110513                             TO WS-B-DATE(BUDIDX).
394900110513           MOVE ALLOW-TRADING OF BUD-REC
395000110513                             TO WS-B-TRADING(BUDIDX).
395100110513
395200110513       LIA-PRICE.
395300110513
395400110513           IF COMM-PROCESS-OPTION = "O"
395500110513             GO TO LIA-P-ON-LINE-OPTION
395600110513           END-IF.
395700110513
395800110513           SET BUDIDX2       TO 1.
395900110513           SET BUDIDX2       DOWN BY 1.
396000110513
396100110513       LIA-P-0010.
396200110513
396300110513           MOVE LOW-VALUES   TO INVESTMENT-CODE OF INVESTMENT.
396400110622
396500110622R97579* Load single investment for MFR accrual calculation run.
396600110622R97579     IF lb_AccCAL-Run
396700110622R97579        MOVE lc_SingleInvestCode  TO
396800110622R97579             INVESTMENT-CODE OF INVESTMENT
396900110622R97579     END-IF.
397000110513
397100110513           START INVESTMENT
397200110513           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
397300110513           INVALID KEY
397400110513             MOVE HIGH-VALUES TO CURR-CONTROLS
397500110513             GO TO LIA-EXIT.
397600110513
397700110513       LIA-P-0020.
397800110513           READ INVESTMENT NEXT RECORD
397900110513           AT END
398000110513             MOVE "Y"        TO WS-B-BUDIDX2-END(BUDIDX, BUDIDX2)
398100110513             GO TO LIA-D-0020.
398200110622
398300110622R97579     IF lb_AccCAL-Run AND
398400110622R97579        INVESTMENT-CODE OF INVESTMENT NOT = lc_SingleInvestCode
398500110622R97579        MOVE "Y"        TO WS-B-BUDIDX2-END(BUDIDX, BUDIDX2)
398600110622R97579        GO TO LIA-D-0020
398700110622R97579     END-IF.
398800110513
398900110513
399000110513       LIA-P-BATCH-OPTION.
399100110513      *RFS 34759 - Start  -Keep bellow logic if not phantom fund.
399200110513      *                   -Removed periods within IF/END-IF.
399300110513           MOVE lnc-Y TO lc-LoadBatchPrc.
399400110513           PERFORM Get-Product-Type-Rule.
399500110513           INITIALIZE lc-LoadBatchPrc.
399600110513           IF NOT lc-Phantom
399700110513              SET BUDIDX2 UP BY 1
399800171027      * RFS49699 - Array logging logic
399900110513
400000110513              IF BUDIDX2          > WS-ARRAY4-MAX-USED
400100110513                  MOVE BUDIDX2                TO WS-ARRAY4-MAX-USED
400200110513              END-IF
400300110513
400400171027      * RFS49699 - End
400500110513              MOVE INVESTMENT-CODE OF INVESTMENT
400600110513                             TO WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2)
400700171014
400800171027167951        MOVE CURRENCY-DDS OF INVESTMENT
400900171014167951                      TO WS-B-CURR(BUDIDX, BUDIDX2)
401000110513
401100110513              MOVE INVESTMENT-CODE OF INVESTMENT
401200110513                             TO INVESTMENT-CODE
401300110513                             OF INVESTMENT-UNIT-PRICE
401400110513
401500110513              GO TO LIA-P-GET-PRICE
401600110513           END-IF.
401700110513
401800110513      *Find holding funds for a phantom fund for batch option.
401900110513           IF lc-Phantom
402000110513      *RFS 38381 - Begin
402100110513              PERFORM INIT-ARRAY-AMT
402200110513              VARYING TOT-IDX  FROM 1 BY 1
402300110513              UNTIL TOT-IDX  IS GREATER THAN BUDMAX
402400110513      *RFS 38381 - End
402500110513              MOVE Investment-Code OF Investment
402600110513                TO lc-InvestmentCodeAAP
402700110513              PERFORM Get-Holding-Fund-Start
402800110513              PERFORM Get-Next-Holding-Fund
402900110513           END-IF.
403000110513
403100110513       LIA-P-BATCH-OPTION-01.
403200110513           IF lb-EOFHoldingFalse
403300110513              IF lc-InvestmentCodeAAH NOT = " "
403400110513                 SET BUDIDX2 UP BY 1
403500110513                 MOVE lc-InvestmentCodeAAH
403600110513                   TO WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2)
403700110513                 MOVE lc-InvestmentCodeAAH
403800110513                   TO Investment-Code OF Investment-Unit-Price
403900110513                 GO TO LIA-P-GET-PRICE
404000110513              ELSE
404100110513                 PERFORM Get-Next-Holding-Fund
404200110513                 GO TO LIA-P-BATCH-OPTION-01
404300110513              END-IF
404400110513           END-IF.
404500110513           IF lb-EOFHoldingTrue
404600110513              GO TO LIA-P-0020
404700110513           END-IF.
404800110513
404900110513      *RFS 34759 - End
405000110513
405100110513       LIA-P-ON-LINE-OPTION.
405200110513      *RFS 34759 - Start -Keep bellow logic if not phantom fund.
405300110513      *                  -Removed periods within IF/END-IF.
405400110513           PERFORM Get-Product-Type-Rule.
405500110513           IF NOT lc-Phantom
405600110513              SET BUDIDX2 TO 1
405700110513              MOVE COMM-INVESTMENT-CODE
405800110513                             TO WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2)
405900110513
406000110513              MOVE COMM-INVESTMENT-CODE
406100110513                             TO INVESTMENT-CODE
406200110513                             OF INVESTMENT-UNIT-PRICE
406300110513
406400110513              GO TO LIA-P-GET-PRICE
406500110513           END-IF.
406600110513
406700110513      *Find holding funds for a phantom fund for on line option.
406800110513           IF lc-Phantom
406900110513      *RFS 38381 - Begin
407000110513              PERFORM INIT-ARRAY-AMT
407100110513              VARYING TOT-IDX  FROM 1 BY 1
407200110513              UNTIL TOT-IDX  IS GREATER THAN BUDMAX
407300110513      *RFS 38381 - End
407400110513              SET BUDIDX2       TO 1
407500110513              SET BUDIDX2       DOWN BY 1
407600110513              MOVE Comm-Investment-Code TO lc-InvestmentCodeAAP
407700110513              PERFORM Get-Holding-Fund-Start
407800110513              PERFORM Get-Next-Holding-Fund
407900110513           END-IF.
408000110513
408100110513       LIA-P-ON-LINE-OPTION-01.
408200110513           IF lb-EOFHoldingFalse
408300110513              IF lc-InvestmentCodeAAH NOT = " "
408400110513                 SET BUDIDX2 UP BY 1
408500110513                 MOVE lc-InvestmentCodeAAH
408600110513                   TO WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2)
408700110513                 MOVE lc-InvestmentCodeAAH
408800110513                   TO Investment-Code OF Investment-Unit-Price
408900110513                 GO TO LIA-P-GET-PRICE
409000110513              ELSE
409100110513                 PERFORM Get-Next-Holding-Fund
409200110513                 GO TO LIA-P-ON-LINE-OPTION-01
409300110513              END-IF
409400110513           END-IF.
409500110513           IF lb-EOFHoldingTrue
409600110513              GO TO LIA-D-0020
409700110513           END-IF.
409800110513
409900110513      *RFS 34759 - End
410000110513
410100110513       LIA-P-GET-PRICE.
410200110513           MOVE WS-B-DATE(BUDIDX)
410300110513                             TO TRADE-DATE
410400110513                             OF INVESTMENT-UNIT-PRICE.
410500110513
410600110513           READ INVESTMENT-UNIT-PRICE
410700110513           INVALID KEY
410800110513             PERFORM GET-LAST-UNIT-PRICE
410900110513             MOVE WS-LAST-PRICE TO UNIT-PRICE
411000110513                             OF INVESTMENT-UNIT-PRICE.
411100110513
411200110513           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
411300110513                             TO WS-B-PRICE(BUDIDX, BUDIDX2).
411400171014
411500171130      *RFS167951 Starts
411600171130           PERFORM GET-EXCHANGE-RATE THRU GTER-EXIT.
411700171130           IF WS-EXCHANGE-RATE = ZERO
411800171130              MOVE 1 TO WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
411900171130           ELSE
412000171130              MOVE WS-EXCHANGE-RATE
412100171130                     TO WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
412200171130           END-IF.
412300171130      *RFS167951 Ends
412400110513
412500110513      *RFS 34759 - Start
412600110513           IF lc-Phantom AND
412700110513              lb-EOFHoldingFalse
412800110513                 PERFORM Get-Next-Holding-Fund
412900110513              IF Comm-Process-Option = "O"
413000110513                 GO TO LIA-P-ON-LINE-OPTION-01
413100110513              ELSE
413200110513                 GO TO LIA-P-BATCH-OPTION-01
413300110513              END-IF
413400110513           END-IF.
413500110513      *RFS 34759 - End
413600110513
413700110513           IF COMM-PROCESS-OPTION = "O"
413800110513             GO TO LIA-D-0020
413900110513           ELSE
414000110513             GO TO LIA-P-0020
414100110513           END-IF.
414200110513
414300110513       LIA-EXIT.
414400110513           EXIT.
414500110513      /
414600110513       GET-LAST-UNIT-PRICE SECTION.
414700110513
414800110513           IF BUDIDX IS NOT EQUAL TO 1
414900110513             SET BUDIDX DOWN BY 1
415000110513             MOVE WS-B-PRICE(BUDIDX, BUDIDX2)
415100110513                             TO WS-LAST-PRICE
415200110513             SET BUDIDX UP BY 1
415300110513             GO TO GLUP-EXIT
415400110513           END-IF.
415500110513
415600110513           IF COMM-PROCESS-OPTION = "O"
415700110513             GO TO GLUP-ON-LINE-OPTION-1
415800110513           END-IF.
415900110513
416000110513      *RFS 34759 - Start
416100110513      *If phantom fund entered, find last unit price for a holding fund.
416200110513      *If not phantom fund, keep existing logic to find last unit price.
416300110513           IF lc-Phantom
416400110513              MOVE lc-InvestmentCodeAAH
416500110513                             TO INVESTMENT-CODE
416600110513                             OF INVESTMENT-UNIT-PRICE
416700110513           ELSE
416800110513              MOVE INVESTMENT-CODE OF INVESTMENT
416900110513                             TO INVESTMENT-CODE
417000110513                             OF INVESTMENT-UNIT-PRICE
417100110513           END-IF.
417200110513      *RFS 34759 - End
417300110513
417400110513           GO TO GLUP-GET-PRICE.
417500110513
417600110513       GLUP-ON-LINE-OPTION-1.
417700110513
417800110513      *RFS 34759 - Start
417900110513      *If phantom fund entered, find last unit price for a holding fund.
418000110513      *If not phantom fund, keep existing logic to find last unit price.
418100110513           IF lc-Phantom
418200110513              MOVE lc-InvestmentCodeAAH
418300110513                             TO INVESTMENT-CODE
418400110513                             OF INVESTMENT-UNIT-PRICE
418500110513           ELSE
418600110513              MOVE COMM-INVESTMENT-CODE
418700110513                             TO INVESTMENT-CODE
418800110513                             OF INVESTMENT-UNIT-PRICE
418900110513           END-IF.
419000110513      *RFS 34759 - End
419100110513
419200110513       GLUP-GET-PRICE.
419300110513
419400110513           MOVE WS-B-DATE(BUDIDX)
419500110513                             TO TRADE-DATE
419600110513                             OF INVESTMENT-UNIT-PRICE.
419700110513
419800110513           START INVESTMENT-UNIT-PRICE
419900110513           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
420000110513           INVALID KEY
420100110513             MOVE 0          TO WS-LAST-PRICE
420200110513             GO TO GLUP-EXIT.
420300110513
42040011051342749  GLUP-GET-PRIOR.
420500110513
420600110513           READ INVESTMENT-UNIT-PRICE PRIOR RECORD
420700110513           AT END
420800110513             MOVE 0          TO WS-LAST-PRICE
420900110513             GO TO GLUP-EXIT.
421000110513
421100110513           IF COMM-PROCESS-OPTION = "O"
421200110513             GO TO GLUP-ON-LINE-OPTION-2
421300110513           END-IF.
421400110513
421500110513      *RFS 34759 - Start
421600110513      *    IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE
421700110513      *    IS NOT EQUAL TO INVESTMENT-CODE OF INVESTMENT
421800110513           IF (NOT lc-Phantom AND
421900110513               Investment-Code OF Investment-Unit-Price NOT =
422000110513               Investment-Code OF Investment) OR
422100110513              (lc-Phantom AND
422200110513               Investment-Code OF Investment-Unit-Price NOT =
422300110513               lc-InvestmentCodeAAH)
422400110513      *RFS 34759 - End
422500110513             MOVE 0          TO WS-LAST-PRICE
422600110513             GO TO GLUP-EXIT.
422700110513
422800110513      *rfs42749 begins
422900180131      *RFS177476 - Starts
423000180131      *      IF Distribution-Flag of Investment-Unit-Price = lc-S
423100180131             IF Distribution-Flag of Investment-Unit-Price
423200180131                NOT EQUAL TO SPACES
423300180131      *RFS177476 - Ends
423400110513                Go to GLUP-GET-PRIOR
423500110513             END-IF.
423600110513      *rfs42749 ends
423700110513
423800110513           GO TO GLUP-SET-PRICE.
423900110513
424000110513       GLUP-ON-LINE-OPTION-2.
424100110513
424200110513      *RFS 34759 - Start
424300110513      *    IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE
424400110513      *    IS NOT EQUAL TO COMM-INVESTMENT-CODE
424500110513           IF (NOT lc-Phantom AND
424600110513               Investment-Code OF Investment-Unit-Price NOT =
424700110513               Comm-Investment-Code) OR
424800110513              (lc-Phantom AND
424900110513               Investment-Code OF Investment-Unit-Price NOT =
425000110513               lc-InvestmentCodeAAH)
425100110513      *RFS 34759 - End
425200110513
42530011051342749       OR  Distribution-Flag of Investment-Unit-Price = lc-S
425400110513
425500110513             MOVE 0          TO WS-LAST-PRICE
425600110513           GO TO GLUP-EXIT.
425700110513
425800110513       GLUP-SET-PRICE.
425900110513
426000110513           MOVE UNIT-PRICE OF IUP-REC
426100110513                             TO WS-LAST-PRICE.
426200110513
426300110513       GLUP-EXIT.
426400110513           EXIT.
426500110513       REJECTION-ROUTINE SECTION.
426600110513      **********************************************
426700110513      ** REJECTION HANDLING ROUTINE               **
426800110513      **********************************************
426900110513           IF COMM-PROCESS-OPTION = "O"
427000110513             GO TO RR-ON-LINE-OPTION
427100110513           END-IF.
427200110513
427300110513           MOVE WS-REJECTION-CODE
427400110513                             TO REJECTION-CODE OF MFR-PROCESS.
427500110513
427600110513      *RFS 34759 - Start
427700110513      *    REWRITE MFR-PROCESS-REC.
427800110513           REWRITE MFR-PROCESS-REC
427900110513           INVALID KEY
428000110513             CONTINUE.
428100110513      *RFS 34759 - End
428200110513           GO TO RR-EXIT.
428300110513
428400110513       RR-ON-LINE-OPTION.
428500110513           MOVE WS-REJECTION-CODE
428600110513                             TO COMM-REJECTION-CODE.
428700110513
428800110513       RR-EXIT.
428900110513           EXIT.
429000110513
429100110513      *RFS 34759 - Start
429200110513
429300110513      /
429400110513       Get-Product-Type-Rule SECTION.
429500110513           MOVE SPACES TO lc-InvestmentCode
429600110513                          lc-ProductTypeRule.
429700110513
429800110513           IF Comm-Process-Option = "O"
429900110513              MOVE Comm-Investment-Code
430000110513                TO lc-InvestmentCode
430100110513           ELSE
430200110513              MOVE Investment-Code of MFR-Process
430300110513                TO lc-InvestmentCode
430400110513           END-IF.
430500110513
430600110513           IF lc-LoadBatchPrc = lnc-Y
430700110513              MOVE Investment-Code of Investment
430800110513                TO lc-InvestmentCode
430900110513           END-IF.
431000110513
431100110513           EXEC SQL
431200110513                SELECT prtcdp.Product_Type_Rule
431300110513                INTO   :lc-ProductTypeRule
431400110513                FROM   Mfainvp invp, Mfaprtcdp prtcdp
431500110513                WHERE  invp.Investment_Code = :lc-InvestmentCode AND
431600110513                       invp.Product_Type_Code =
431700110513                       prtcdp.Product_Type_Code
431800110513           END-EXEC.
431900110513
432000110513      /
432100110513       Get-Holding-Fund-Start SECTION.
432200110513
432300110513      *Get AS-AT-DATE from data area MFAPRCDTP
432400110513           INITIALIZE lc-ProcessDate.
432500110513           CALL "RTVPRCDTP" USING lc-ProcessDate.
432600110513
432700110513      *Start and read Inv-Ass-Alloc-Mod-Sch-Hd to get Start-Date.
432800110513
432900110513           INITIALIZE Mfaiamshp OF Inv-Ass-Alloc-Mod-Sch-Hd-Rec.
433000110513
433100110513           INITIALIZE lc-ModelHdrEnd.
433200110513
433300110513           MOVE lc-InvestmentCodeAAP
433400110513             TO Investment-Code2 OF Inv-Ass-Alloc-Mod-Sch-Hd.
433500110513
433600110513           MOVE 999999999
433700110513             TO Start-Date       OF Inv-Ass-Alloc-Mod-Sch-Hd.
433800110513
433900110513           START Inv-Ass-Alloc-Mod-Sch-Hd
434000110513             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
434100110513             INVALID KEY
434200110513               INITIALIZE Mfaiamshp OF Inv-Ass-Alloc-Mod-Sch-Hd-Rec
434300110513               MOVE lnc-Y TO lc-ModelHdrEnd
434400110513             NOT INVALID KEY
434500110513               PERFORM Find-Next-Inv-Model-Hdr
434600110513                 UNTIL lc-ModelHdrEnd = lnc-Y
434700110513           END-START.
434800110513
434900110513      *Start to get holding funds.
435000110513
435100110513           INITIALIZE Mfaiamsdp OF Inv-Ass-Alloc-Model-Sch-Dt-Rec.
435200110513           INITIALIZE lc-InvestmentCodeAAH.
435300110513           SET lb-EOFHoldingFalse TO True.
435400110513
435500110513           MOVE Investment-Code2 OF Inv-Ass-Alloc-Mod-Sch-Hd
435600110513             TO Investment-Code2 OF Inv-Ass-Alloc-Model-Sch-Dt.
435700110513
435800110513           MOVE AA-Model-Code    OF Inv-Ass-Alloc-Mod-Sch-Hd
435900110513             TO AA-Model-Code    OF Inv-Ass-Alloc-Model-Sch-Dt.
436000110513
436100110513           MOVE Start-Date       OF Inv-Ass-Alloc-Mod-Sch-Hd
436200110513             TO Start-Date       OF Inv-Ass-Alloc-Model-Sch-Dt.
436300110513
436400110513           MOVE LOW-VALUES
436500110513             TO Investment-Code  OF Inv-Ass-Alloc-Model-Sch-Dt.
436600110513
436700110513           START Inv-Ass-Alloc-Model-Sch-Dt
436800110513             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
436900110513             INVALID KEY
437000110513               INITIALIZE Mfaiamsdp OF Inv-Ass-Alloc-Model-Sch-Dt-Rec
437100110513               SET lb-EOFHoldingTrue TO True
437200110513           END-START.
437300110513
437400110513      /
437500110513       Get-Next-Holding-Fund SECTION.
437600110513           INITIALIZE lc-InvestmentCodeAAH.
437700110513           READ Inv-Ass-Alloc-Model-Sch-Dt NEXT
437800110513             AT END
437900110513                INITIALIZE lc-InvestmentCodeAAH
438000110513                SET lb-EOFHoldingTrue TO True
438100110513           END-READ.
438200110513
438300110513           IF Investment-Code2 of Inv-Ass-Alloc-Model-Sch-Dt NOT =
438400110513              Investment-Code2 of Inv-Ass-Alloc-Mod-Sch-Hd OR
438500110513              AA-Model-Code    of Inv-Ass-Alloc-Model-Sch-Dt NOT =
438600110513              AA-Model-Code    of Inv-Ass-Alloc-Mod-Sch-Hd OR
438700110513              Start-Date       of Inv-Ass-Alloc-Model-Sch-Dt NOT =
438800110513              Start-Date       of Inv-Ass-Alloc-Mod-Sch-Hd
438900110513                INITIALIZE lc-InvestmentCodeAAH
439000110513                SET lb-EOFHoldingTrue TO True
439100110513           END-IF.
439200110513
439300110513           IF lb-EOFHoldingFalse
439400110513              IF Percent-Allocation of Inv-Ass-Alloc-Model-Sch-Dt > 0
439500110513                 MOVE Investment-Code of Inv-Ass-Alloc-Model-Sch-Dt
439600110513                   TO lc-InvestmentCodeAAH
439700110513              END-IF
439800110513           END-IF.
439900110513
440000110513      /
440100110513       Find-Next-Inv-Model-Hdr SECTION.
440200110513      *Read Inv-Ass-Alloc-Mod-Sch-Hd record to get
440300110513      *the latest Start-Date just before the As-At-Date.
440400110513      *Same logic as in AABSLTXN.
440500110513
440600110513           READ Inv-Ass-Alloc-Mod-Sch-Hd NEXT
440700110513             AT END
440800110513                INITIALIZE Mfaiamshp OF Inv-Ass-Alloc-Mod-Sch-Hd-Rec
440900110513                MOVE lnc-Y TO lc-ModelHdrEnd
441000110513           END-READ.
441100110513
441200110513           IF Investment-Code2 OF Inv-Ass-Alloc-Mod-Sch-Hd =
441300110513              lc-InvestmentCodeAAP AND
441400110513              Percent-Allocation-Total
441500110513                         OF Inv-Ass-Alloc-Mod-Sch-Hd = 100 AND
441600110513              Start-Date OF Inv-Ass-Alloc-Mod-Sch-Hd < li-AsAtDate
441700110513                MOVE lnc-Y TO lc-ModelHdrEnd
441800110513           END-IF.
441900110513
442000110513      /
442100110513       Get-MFR-Calc-Ind SECTION.
442200110513           INITIALIZE lc-MFRGroupCode
442300110513                      lc-InvestmentCode.
442400110513
442500110513           IF Comm-Process-Option = "O"
442600110513              MOVE Comm-MFR-Group-Code TO lc-MFRGroupCode
442700110513              MOVE Comm-Investment-Code TO lc-InvestmentCode
442800110513           ELSE
442900110513              MOVE MFR-Group-Code  OF MFR-Process
443000110513                TO lc-MFRGroupCode
443100110513              MOVE Investment-Code OF MFR-Process
443200110513                TO lc-InvestmentCode
443300110513           END-IF.
443400110513
443500110513           EXEC SQL
443600110513              SELECT MFR_Calculation_Ind
443700110513              INTO   :lc-MFRCalcInd
443800110513              FROM   Mfamfrdtp
443900110513              WHERE  MFR_Group_Code = :lc-MFRGroupCode AND
444000110513                     Investment_Code = :lc-InvestmentCode
444100110513           END-EXEC.
444200110513      *RFS 34759 - End
444300110513      *RFS 38381 - Begin
444400110513
444500110513       INIT-ARRAY-AMT SECTION.
444600110513
444700110513           MOVE ZEROES       TO TOT-AMT(TOT-IDX).
444800110513
444900110513       PHANTOM-FUND-CALCUALTION SECTION.
445000110513
445100110513           MOVE 0 TO ln-Phmframt.
445200110513           PERFORM CAL-MFR-AMT
445300110513           VARYING TOT-IDX  FROM 1 BY 1
445400110513           UNTIL TOT-IDX  IS GREATER THAN BUDMAX.
445500110513
445600110513      * Reuse WS-TOT-MFR-AMT variable in order to calculate GST & PST
445700110513           MOVE ln-Phmframt TO WS-TOT-MFR-AMT.
445800110513
445900110513       CAL-MFR-AMT SECTION.
446000110513
446100110513           MOVE ZEROS        TO WS-RATE.
446200110513           SET MSIDX TO 1.
446300110513R79774*    SET MSIDX DOWN BY 1.
446400110513           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
446500110513           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
446600110513            AND WS-M-UPPER-LIMIT(MSIDX) >= TOT-AMT(TOT-IDX)
446700110513              MOVE WS-M-RATE(MSIDX) TO WS-RATE.
446800110513
446900110513           PERFORM Get-MFR-Calc-Ind
447000110513           IF lc-MFRCalcInd = lnc-G
447100110513              PERFORM PH-GRADUATED-CALCULATION
447200110513              ADD  ln-MfrAmtAAP TO ln-Phmframt
447300110513           ELSE
447400110513              COMPUTE ln-Phmframt ROUNDED =  ln-Phmframt +
447500110513               (TOT-AMT(TOT-IDX) * WS-RATE / 100 / WS-DAYS-IN-YEAR).
447600110513
447700110513       PH-GRADUATED-CALCULATION SECTION.
447800110513           MOVE 0 TO ln-MfrAmtAAP.
447900110513           MOVE TOT-AMT(TOT-IDX) TO WS-UNIT-VALUE.
448000110513      *    Search for the MFR schedule rate
448100110513
448200110513       PH-GC-NEXT-TIER.
448300110513
448400110513           SET MSIDX TO 1.
448500110513R79774*    SET MSIDX DOWN BY 1.
448600110513           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
448700110513           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
448800110513              AND WS-M-UPPER-LIMIT(MSIDX) >= WS-UNIT-VALUE
448900110513              MOVE WS-M-RATE(MSIDX) TO WS-RATE
449000110513           WHEN WS-M-SCHEDULE(MSIDX) = SPACES
449100110513              GO TO PH-GC-EXIT.
449200110513
449300110513           COMPUTE WS-MFR-VALUE ROUNDED  =
449400110513                 (WS-UNIT-VALUE - WS-M-LOWER-LIMIT(MSIDX))
449500110513                         * WS-RATE / 100 / WS-DAYS-IN-YEAR.
449600110513           ADD WS-MFR-VALUE TO ln-MfrAmtAAP.
449700110513           MOVE WS-M-LOWER-LIMIT(MSIDX) TO WS-UNIT-VALUE.
449800110513           IF WS-UNIT-VALUE NOT = 0
449900110513               GO TO PH-GC-NEXT-TIER.
450000110513
450100110513       PH-GC-EXIT.
450200110513           EXIT.
450300110513      * R38381 End
450400171014
450500171130      *RFS167951 Starts
450600171130      *------------------------------------
450700171130       GET-OVER-RIDE-MFR-SCHD-CODE SECTION.
450800171130      *------------------------------------
450900171130
451000171130            INITIALIZE  lc_ABRule,
451100171130                        lc_MfrSchdCode,
451200180129177476                  lc_SameCurr,
451300171130                        lc_OvrrideSchd.
451400171130
451500171130            EXEC SQL
451600171130             SELECT HHLDIVR.ASSETS_BY_RULE,
451700171130                    COALESCE(HHLDIVR.MFR_SCHEDULE_CODE," "),
451800180129177476              COALESCE(HHLDIVR.SAME_CURR," "),
451900171130                    HHLDIVR.OVR_MFR_SCHEDULE_CODE
452000171130
452100171130             INTO  :lc_ABRule :lc_NullIndicator,
452200171130                   :lc_MfrSchdCode :lc_NullIndicator,
452300180129177476             :lc_SameCurr :lc_NullIndicator,
452400171130                   :lc_OvrrideSchd :lc_NullIndicator
452500171130
452600171130             FROM QTEMP/TMPHHLDIVR HHLDIVR
452700171130
452800171130             WHERE HHLDIVR.MFR_GROUP_CODE  = :lc_MFR_Grp_code
452900171130               AND HHLDIVR.ACCOUNT_NO      = :ln_AccountNo
453000171130               AND HHLDIVR.INVESTMENT_CODE = :lc_InvestmentCode
453100171130             FETCH FIRST ROW ONLY
453200171130
453300171130            END-EXEC.
453400171130
453500171130            MOVE SQLSTATE      TO lc_sqlStates.
453600171130             IF lncc_sqlSuccessful
453700171130                CONTINUE
453800171130             ELSE
453900171130                SET lncc_Err-02         TO TRUE
454000171130                MOVE lc_ErrCodeDescr02  TO lc_sqlErrShortDESCR
454100171130             END-IF.
454200171130
454300171130            IF lc_OvrrideSchd IS NOT EQUAL TO  SPACES
454400171130               MOVE lc_OvrrideSchd TO WS-MFR-SCHEDULE
454500171130            END-IF.
454600171130
454700171130      *-----------------------------------
454800171130       GET-TOTAL-ASSET-MFR-AMOUNT SECTION.
454900171130      *-----------------------------------
455000171130
455100171130            INITIALIZE  ln_TotAssetsAmt,
455200171130                        ln_TotMfrAmt,
455300210622      * RFS 186019 - Begins
455400210622                        ln_SecondaryAssetsAmt,
455500210713                        lc_EligibleForprocess
455600210622      * RFS 186019 - Ends
455700171130                        ln_TotMarketValue.
455800171130
455900171130            EXEC SQL
456000171130             SELECT CASE
456100210802      * RFS186019 - starts
456200210802      *             WHEN HHLDIVR.ASSETS_BY_RULE = "3"
456300210802                    WHEN HHLDIVR.ASSETS_BY_RULE = "3"   OR
456400210802                         HHLDIVR.ASSETS_BY_RULE = "4"
456500210802      * RFS186019 - Ends
456600171130                    THEN COALESCE(HHLDIVR.TOT_IVR_ASSETS_AMT,0)
456700171130                    WHEN HHLDIVR.ASSETS_BY_RULE = "2"
456800171130                    THEN COALESCE(HHLDIVR.TOT_ACC_ASSETS_AMT,0)
456900171130                    ELSE COALESCE(HHLDIVR.INV_ASSETS_AMT,0)
457000171130                    END,
457100171130                    CASE
457200210802      * RFS186019 - starts
457300210802      *             WHEN HHLDIVR.ASSETS_BY_RULE = "3"
457400210802                    WHEN HHLDIVR.ASSETS_BY_RULE = "3"   OR
457500210802                         HHLDIVR.ASSETS_BY_RULE = "4"
457600210802      * RFS186019 - starts
457700171130                    THEN COALESCE(HHLDIVR.TOT_IVR_MFR_AMT,0)
457800171130                    WHEN HHLDIVR.ASSETS_BY_RULE = "2"
457900171130                    THEN COALESCE(HHLDIVR.TOT_ACC_MFR_AMT,0)
458000171130                    ELSE 0
458100171130                    END,
458200171130                    CASE
458300210802      * RFS186019 - starts
458400210802      *             WHEN HHLDIVR.ASSETS_BY_RULE = "3"
458500210802                    WHEN HHLDIVR.ASSETS_BY_RULE = "3"  OR
458600210802                         HHLDIVR.ASSETS_BY_RULE = "4"
458700210802      * RFS186019 - Ends
458800171130                    THEN COALESCE(HHLDIVR.TOT_IVR_MARKET_VALUE,0)
458900171130                    WHEN HHLDIVR.ASSETS_BY_RULE = "2"
459000171130                    THEN COALESCE(HHLDIVR.TOT_ACC_MARKET_VALUE,0)
459100171130                    ELSE COALESCE(HHLDIVR.INV_MARKET_VALUE,0)
459200171130                    END
459300210622
459400210802      * RFS186019 - starts
459500210806                    ,CASE
459600210806                     WHEN SECONDARY_ASSETS_FLAG = "Y"
459700210806                          THEN COALESCE(
459800210806                          SEC_ASSET.HOUSEHOLD_SEC_ASSET_MARKET_VAL,0)
459900210806                     ELSE 0  END
460000210802                    ,CASE WHEN :lc_EffectiveFlag = "Y"
460100210802                        THEN
460200210802                        COALESCE(HHLDIVR.ELIGIBLE_FOR_CALC, "N")
460300210802                      ELSE "Y" END
460400210802      * RFS186019 - Ends
460500171130
460600171130             INTO  :ln_TotAssetsAmt :lc_NullIndicator,
460700171130                   :ln_TotMfrAmt :lc_NullIndicator,
460800171130                   :ln_TotMarketValue :lc_NullIndicator
460900210622
461000210802      * RFS186019 - starts
461100210802                   ,:ln_SecondaryAssetsAmt :lc_NullIndicator
461200210802                   ,:lc_EligibleForprocess :lc_NullIndicator
461300210802      * RFS186019 - Ends
461400210713
461500210713
461600210713
461700210713
461800171130             FROM QTEMP/TMPHHLDIVR HHLDIVR
461900210713             LEFT OUTER JOIN
462000210713                 (  SELECT HOUSEHOLD_ID,
462100210713                           HOUSEHOLD_SEC_ASSET_MARKET_VAL
462200210713                     FROM MFAIVRHSP
462300210713                      WHERE (
462400210713                      HOUSEHOLD_ID||HOUSEHOLD_SEC_ASSET_EVAL_DATE)
462500210713                      IN ( SELECT ( HOUSEHOLD_ID
462600210713                           ||MAX(HOUSEHOLD_SEC_ASSET_EVAL_DATE))
462700210713                              FROM MFAIVRHSP
462800210713                             WHERE HOUSEHOLD_SEC_ASSET_EVAL_DATE
462900210713                                  <= :ld_TradeDte
463000210713                            GROUP BY HOUSEHOLD_ID)) AS SEC_ASSET ON
463100210713                             SEC_ASSET.HOUSEHOLD_ID =
463200210713                             HHLDIVR.HOUSEHOLD_ID
463300210622
463400171130
463500171130             WHERE HHLDIVR.MFR_GROUP_CODE  = :lc_MFR_Grp_code
463600171130               AND HHLDIVR.ACCOUNT_NO      = :ln_AccountNo
463700171130               AND HHLDIVR.INVESTMENT_CODE = :lc_InvestmentCode
463800171130               AND HHLDIVR.TRADE_DATE      = :ld_TradeDte
463801211013      *RFS1122059  - Begins
463802211013               AND HHLDIVR.ELIGIBLE_FOR_CALC = "Y"
463803211013      *RFS1122059  - Ends
463900171130             FETCH FIRST ROW ONLY
464000171130
464100171130            END-EXEC.
464200171130
464300171130            MOVE SQLSTATE      TO lc_sqlStates.
464400171130             IF lncc_sqlSuccessful
464500171130                CONTINUE
464600171130             ELSE
464700171130                SET lncc_Err-13         TO TRUE
464800171130                MOVE lc_ErrCodeDescr13  TO lc_sqlErrShortDESCR
464900171130             END-IF.
465000171130
465100171130      *-------------------------
465200171130       INSERT-TMPACCINV SECTION.
465300171130      *-------------------------
465400171130            EXEC SQL
465500171130               INSERT INTO QTEMP/TMPACCINV VALUES(
465600171130                                 :lc_MFR_Grp_code
465700171130                                ,:ln_AccountNo
465800171130                                ,:lc_InvestmentCode
465900171130                                ,:ld_TradeDte
466000171130                                ,:ln_InvAssetAmt
466100171130                                ,:ln_InvMarketValue)
466200171130            END-EXEC.
466300171130
466400171130            MOVE SQLSTATE      TO lc_sqlStates.
466500171130            IF lncc_sqlSuccessful
466600171130               CONTINUE
466700171130            ELSE
466800171130               SET lncc_Err-09         TO TRUE
466900171130               MOVE lc_ErrCodeDescr09  TO lc_sqlErrShortDESCR
467000171130            END-IF.
467100171130
467200171130      *-------------------------------------
467300171130       ACC-IVR-HHLD-TOT-MFR-PROCESS SECTION.
467400171130      *-------------------------------------
467500171130
467600171130            PERFORM UPDATE-ASSET-AMT-INV-LEVEL.
467700171130            PERFORM UPDATE-ASSET-AMT-ACC-LEVEL.
467800171130            PERFORM UPDATE-ASSET-AMT-IVR-LEVEL.
467900210802      *RFS 186019 - starts
468000210802            PERFORM UPDATE-ASSET-AMT-IVR-SIN-LEVEL.
468100210802      *RFS 186019 - Ends
468200171130            PERFORM UPDATE-MARKET-VALUE-INV-LEVEL.
468300171130            PERFORM UPDATE-MARKET-VALUE-ACC-LEVEL.
468400171130            PERFORM UPDATE-MARKET-VALUE-IVR-LEVEL.
468500210802      *RFS 186019 - starts
468600210802            PERFORM UPDATE-MKT-VALUE-IVR-SIN-LEVEL.
468700210802      *RFS 186019 - Ends
468800171130            PERFORM OPEN-TOT-MFR-CURSOR.
468900171130            SET lc-EndcursorNo TO TRUE.
469000171130            PERFORM FETCH-TOT-MFR-CURSOR UNTIL lc-EndcursorYes.
469100171130            PERFORM CLOSE-TOT-MFR-CURSOR.
469200171130            PERFORM CLOSE-ALL-FILE.
469300171130
469400171130      *-----------------------------------
469500171130       UPDATE-ASSET-AMT-INV-LEVEL SECTION.
469600171130      *-----------------------------------
469700171130
469800171130            EXEC SQL
469900171130             CREATE VIEW QTEMP/ACCINV AS
470000171130            (SELECT DISTINCT *
470100171130             FROM QTEMP/TMPACCINV )
470200171130            END-EXEC
470300171130
470400171130            EXEC SQL
470500171130              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
470600171130              SET HHLDIVR.INV_ASSETS_AMT =
470700171130              (SELECT COALESCE(SUM(ACCINV.INV_ASSETS_AMT),0)
470800171130               FROM QTEMP/ACCINV ACCINV
470900171130               WHERE ACCINV.MFR_GROUP_CODE
471000171130                     = HHLDIVR.MFR_GROUP_CODE
471100171130               AND   ACCINV.ACCOUNT_NO = HHLDIVR.ACCOUNT_NO
471200171130               AND   ACCINV.INVESTMENT_CODE
471300171130                     = HHLDIVR.INVESTMENT_CODE
471400171130               AND   ACCINV.TRADE_DATE
471500171130                     = HHLDIVR.TRADE_DATE
471600171130              )
471700171130              WHERE EXISTS
471800171130                 (SELECT 1
471900171130                  FROM QTEMP/TMPHHLDIVR HHLDIVR1
472000171130                  WHERE HHLDIVR1.MFR_GROUP_CODE  =
472100171130                        HHLDIVR.MFR_GROUP_CODE  AND
472200171130                        HHLDIVR1.ACCOUNT_NO      =
472300171130                        HHLDIVR.ACCOUNT_NO      AND
472400171130                        HHLDIVR1.INVESTMENT_CODE =
472500171130                        HHLDIVR.INVESTMENT_CODE AND
472600171130                        HHLDIVR1.TRADE_DATE      =
472700171130                        HHLDIVR.TRADE_DATE)
472800171130              END-EXEC.
472900171130
473000171130              MOVE SQLSTATE      TO lc_sqlStates.
473100171130              IF lncc_sqlSuccessful
473200171130                 CONTINUE
473300171130              ELSE
473400171130                 SET lncc_Err-10         TO TRUE
473500171130                 MOVE lc_ErrCodeDescr10  TO lc_sqlErrShortDESCR
473600171130              END-IF.
473700171130
473800171130      *-----------------------------------
473900171130       UPDATE-ASSET-AMT-ACC-LEVEL SECTION.
474000171130      *-----------------------------------
474100171130
474200171130              EXEC SQL
474300171130               UPDATE QTEMP/TMPHHLDIVR HHLDIVR
474400171130               SET HHLDIVR.TOT_ACC_ASSETS_AMT =
474500171130               (SELECT COALESCE(SUM(HHLDIVR1.INV_ASSETS_AMT),0)
474600171130               FROM QTEMP/TMPHHLDIVR HHLDIVR1
474700171130               WHERE HHLDIVR1.MFR_GROUP_CODE
474800171130                     = HHLDIVR.MFR_GROUP_CODE
474900210802      * RFS186019 - starts
475000210802                 AND HHLDIVR1.HOUSEHOLD_ID
475100210802                     = HHLDIVR.HOUSEHOLD_ID
475200210802      * RFS186019 - Ends
475300171130                 AND HHLDIVR1.ACCOUNT_NO
475400171130                     = HHLDIVR.ACCOUNT_NO
475500171130                 AND HHLDIVR1.TRADE_DATE
475600171130                     = HHLDIVR.TRADE_DATE
475700171130                      )
475800171130               WHERE EXISTS
475900171130               (SELECT 1
476000171130               FROM QTEMP/TMPHHLDIVR HHLDIVR2
476100171130               WHERE HHLDIVR2.MFR_GROUP_CODE  =
476200171130                     HHLDIVR.MFR_GROUP_CODE
476300210802186019         AND HHLDIVR2.HOUSEHOLD_ID = HHLDIVR.HOUSEHOLD_ID
476400171130               AND HHLDIVR2.ACCOUNT_NO  = HHLDIVR.ACCOUNT_NO
476500171130               AND HHLDIVR2.TRADE_DATE  = HHLDIVR.TRADE_DATE
476600171130                   )
476700171130              END-EXEC.
476800171130
476900171130              MOVE SQLSTATE      TO lc_sqlStates.
477000171130              IF lncc_sqlSuccessful
477100171130                 CONTINUE
477200171130              ELSE
477300171130                 SET lncc_Err-11         TO TRUE
477400171130                 MOVE lc_ErrCodeDescr11  TO lc_sqlErrShortDESCR
477500171130              END-IF.
477600171130
477700171130      *-----------------------------------
477800171130       UPDATE-ASSET-AMT-IVR-LEVEL SECTION.
477900171130      *-----------------------------------
478000171130            EXEC SQL
478100171130             UPDATE QTEMP/TMPHHLDIVR HHLDIVR
478200171130             SET HHLDIVR.TOT_IVR_ASSETS_AMT =
478300171130             (SELECT COALESCE(SUM(HHLDIVR1.INV_ASSETS_AMT),0)
478400171130             FROM QTEMP/TMPHHLDIVR HHLDIVR1
478500171130             WHERE HHLDIVR1.MFR_GROUP_CODE
478600171130                   = HHLDIVR.MFR_GROUP_CODE
478700171130              AND HHLDIVR1.INVESTOR_NO
478800171130                  = HHLDIVR.INVESTOR_NO
478900210802      * RFS186019 - starts
479000210802              AND HHLDIVR1.HOUSEHOLD_ID
479100210802                  = HHLDIVR.HOUSEHOLD_ID
479200210802              AND HHLDIVR1.ASSETS_BY_RULE
479300210802                  = HHLDIVR.ASSETS_BY_RULE
479400210802              AND HHLDIVR1.ASSETS_BY_RULE
479500210802                  = "3"
479600210802      * RFS186019 - Ends
479700171130              AND HHLDIVR1.TRADE_DATE
479800171130                  = HHLDIVR.TRADE_DATE
479900171130              )
480000171130             WHERE EXISTS
480100171130              (SELECT 1
480200171130              FROM QTEMP/TMPHHLDIVR HHLDIVR2
480300171130               WHERE HHLDIVR2.MFR_GROUP_CODE  =
480400171130                     HHLDIVR.MFR_GROUP_CODE
480500171130                 AND HHLDIVR2.INVESTOR_NO     =
480600171130                     HHLDIVR.INVESTOR_NO
480700210802      * RFS186019 - starts
480800210802                 AND HHLDIVR2.HOUSEHOLD_ID    =
480900210802                     HHLDIVR.HOUSEHOLD_ID
481000210802                 AND HHLDIVR2.ASSETS_BY_RULE  =
481100210802                     HHLDIVR.ASSETS_BY_RULE
481200210802                 AND HHLDIVR2.ASSETS_BY_RULE  = "3"
481300210802      * RFS186019 - Ends
481400171130                 AND HHLDIVR2.TRADE_DATE      =
481500171130                     HHLDIVR.TRADE_DATE )
481600171130            END-EXEC.
481700171130
481800171130              MOVE SQLSTATE      TO lc_sqlStates.
481900171130              IF lncc_sqlSuccessful
482000171130                 CONTINUE
482100171130              ELSE
482200171130                 SET lncc_Err-12         TO TRUE
482300171130                 MOVE lc_ErrCodeDescr12  TO lc_sqlErrShortDESCR
482400171130              END-IF.
482500171130
482600210802      * RFS186019 - Starts
482700210802      *---------------------------------------
482800210802       UPDATE-ASSET-AMT-IVR-SIN-LEVEL SECTION.
482900210802      *---------------------------------------
483000210802            EXEC SQL
483100210802             UPDATE QTEMP/TMPHHLDIVR HHLDIVR
483200210802             SET HHLDIVR.TOT_IVR_ASSETS_AMT =
483300210802             (SELECT COALESCE(SUM(HHLDIVR1.INV_ASSETS_AMT),0)
483400210802             FROM QTEMP/TMPHHLDIVR HHLDIVR1
483500210802             WHERE HHLDIVR1.MFR_GROUP_CODE
483600210802                   = HHLDIVR.MFR_GROUP_CODE
483700210802              AND HHLDIVR1.INVESTOR_NO
483800210802                  = HHLDIVR.INVESTOR_NO
483900210802              AND HHLDIVR1.HOUSEHOLD_ID
484000210802                  = HHLDIVR.HOUSEHOLD_ID
484100210802              AND HHLDIVR1.SIN_NO
484200210802                  = HHLDIVR.SIN_NO
484300210802              AND HHLDIVR1.SIN_NO   <> 0
484400210802              AND HHLDIVR1.ASSETS_BY_RULE
484500210802                  = HHLDIVR.ASSETS_BY_RULE
484600210802              AND HHLDIVR1.ASSETS_BY_RULE
484700210802                  = "4"
484800210802              AND HHLDIVR1.TRADE_DATE
484900210802                  = HHLDIVR.TRADE_DATE
485000210802              )
485100210802             WHERE EXISTS
485200210802              (SELECT 1
485300210802              FROM QTEMP/TMPHHLDIVR HHLDIVR2
485400210802               WHERE HHLDIVR2.MFR_GROUP_CODE  =
485500210802                     HHLDIVR.MFR_GROUP_CODE
485600210802                 AND HHLDIVR2.INVESTOR_NO     =
485700210802                     HHLDIVR.INVESTOR_NO
485800210802                 AND HHLDIVR2.HOUSEHOLD_ID    =
485900210802                     HHLDIVR.HOUSEHOLD_ID
486000210802                 AND HHLDIVR2.SIN_NO          =
486100210802                     HHLDIVR.SIN_NO
486200210802                 AND HHLDIVR2.SIN_NO   <> 0
486300210802                 AND HHLDIVR2.ASSETS_BY_RULE  =
486400210802                     HHLDIVR.ASSETS_BY_RULE
486500210802                 AND HHLDIVR2.ASSETS_BY_RULE  = "4"
486600210802                 AND HHLDIVR2.TRADE_DATE      =
486700210802                     HHLDIVR.TRADE_DATE )
486800210802            END-EXEC.
486900210802
487000210802              MOVE SQLSTATE      TO lc_sqlStates.
487100210802              IF lncc_sqlSuccessful
487200210802                 CONTINUE
487300210802              ELSE
487400210802                 SET lncc_Err-19         TO TRUE
487500210802                 MOVE lc_ErrCodeDescr19  TO lc_sqlErrShortDESCR
487600210802              END-IF.
487700210802
487800210802      * RFS186019 - Ends
487900171130      *--------------------------------------
488000171130       UPDATE-MARKET-VALUE-INV-LEVEL SECTION.
488100171130      *--------------------------------------
488200171130
488300171130            EXEC SQL
488400171130              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
488500171130              SET HHLDIVR.INV_MARKET_VALUE =
488600171130              (SELECT COALESCE(SUM(ACCINV.INV_MARKET_VALUE),0)
488700171130               FROM QTEMP/ACCINV ACCINV
488800171130               WHERE ACCINV.MFR_GROUP_CODE
488900171130                     = HHLDIVR.MFR_GROUP_CODE
489000171130               AND   ACCINV.ACCOUNT_NO = HHLDIVR.ACCOUNT_NO
489100171130               AND   ACCINV.INVESTMENT_CODE
489200171130                     = HHLDIVR.INVESTMENT_CODE
489300171130               AND   ACCINV.TRADE_DATE
489400171130                     = HHLDIVR.TRADE_DATE
489500171130              )
489600171130              WHERE EXISTS
489700171130                 (SELECT 1
489800171130                  FROM QTEMP/TMPHHLDIVR HHLDIVR1
489900171130                  WHERE HHLDIVR1.MFR_GROUP_CODE  =
490000171130                        HHLDIVR.MFR_GROUP_CODE  AND
490100171130                        HHLDIVR1.ACCOUNT_NO      =
490200171130                        HHLDIVR.ACCOUNT_NO      AND
490300171130                        HHLDIVR1.INVESTMENT_CODE =
490400171130                        HHLDIVR.INVESTMENT_CODE AND
490500171130                        HHLDIVR1.TRADE_DATE      =
490600171130                        HHLDIVR.TRADE_DATE)
490700171130              END-EXEC.
490800171130
490900171130              MOVE SQLSTATE      TO lc_sqlStates.
491000171130              IF lncc_sqlSuccessful
491100171130                 CONTINUE
491200171130              ELSE
491300171130                 SET lncc_Err-14         TO TRUE
491400171130                 MOVE lc_ErrCodeDescr14  TO lc_sqlErrShortDESCR
491500171130              END-IF.
491600171130
491700171130      *--------------------------------------
491800171130       UPDATE-MARKET-VALUE-ACC-LEVEL SECTION.
491900171130      *--------------------------------------
492000171130
492100171130              EXEC SQL
492200171130               UPDATE QTEMP/TMPHHLDIVR HHLDIVR
492300171130               SET HHLDIVR.TOT_ACC_MARKET_VALUE =
492400171130               (SELECT COALESCE(SUM(HHLDIVR1.INV_MARKET_VALUE),0)
492500171130               FROM QTEMP/TMPHHLDIVR HHLDIVR1
492600171130               WHERE HHLDIVR1.MFR_GROUP_CODE
492700171130                     = HHLDIVR.MFR_GROUP_CODE
492800210802      * RFS186019 - starts
492900210802                 AND HHLDIVR1.HOUSEHOLD_ID
493000210802                     = HHLDIVR.HOUSEHOLD_ID
493100210802      * RFS186019 - starts
493200171130                 AND HHLDIVR1.ACCOUNT_NO
493300171130                     = HHLDIVR.ACCOUNT_NO
493400171130                 AND HHLDIVR1.TRADE_DATE
493500171130                     = HHLDIVR.TRADE_DATE
493600171130                      )
493700171130               WHERE EXISTS
493800171130               (SELECT 1
493900171130               FROM QTEMP/TMPHHLDIVR HHLDIVR2
494000171130               WHERE HHLDIVR2.MFR_GROUP_CODE  =
494100171130                     HHLDIVR.MFR_GROUP_CODE
494200210802186019         AND HHLDIVR2.HOUSEHOLD_ID = HHLDIVR.HOUSEHOLD_ID
494300171130               AND HHLDIVR2.ACCOUNT_NO  = HHLDIVR.ACCOUNT_NO
494400171130               AND HHLDIVR2.TRADE_DATE  = HHLDIVR.TRADE_DATE
494500171130                   )
494600171130              END-EXEC.
494700171130
494800171130              MOVE SQLSTATE      TO lc_sqlStates.
494900171130              IF lncc_sqlSuccessful
495000171130                 CONTINUE
495100171130              ELSE
495200171130                 SET lncc_Err-15         TO TRUE
495300171130                 MOVE lc_ErrCodeDescr15  TO lc_sqlErrShortDESCR
495400171130              END-IF.
495500171130
495600171130      *--------------------------------------
495700171130       UPDATE-MARKET-VALUE-IVR-LEVEL SECTION.
495800171130      *--------------------------------------
495900171130
496000171130            EXEC SQL
496100171130             UPDATE QTEMP/TMPHHLDIVR HHLDIVR
496200171130             SET HHLDIVR.TOT_IVR_MARKET_VALUE =
496300171130             (SELECT COALESCE(SUM(HHLDIVR1.INV_MARKET_VALUE),0)
496400171130             FROM QTEMP/TMPHHLDIVR HHLDIVR1
496500171130             WHERE HHLDIVR1.MFR_GROUP_CODE
496600171130                   = HHLDIVR.MFR_GROUP_CODE
496700171130              AND HHLDIVR1.INVESTOR_NO
496800171130                  = HHLDIVR.INVESTOR_NO
496900210802      *RFS186019 - starts
497000210802              AND HHLDIVR1.HOUSEHOLD_ID
497100210802                  = HHLDIVR.HOUSEHOLD_ID
497200210802              AND HHLDIVR1.ASSETS_BY_RULE
497300210802                  = HHLDIVR.ASSETS_BY_RULE
497400210802              AND HHLDIVR1.ASSETS_BY_RULE
497500210802                  = "3"
497600210802      *RFS186019 - Ends
497700171130              AND HHLDIVR1.TRADE_DATE
497800171130                  = HHLDIVR.TRADE_DATE
497900171130              )
498000171130             WHERE EXISTS
498100171130              (SELECT 1
498200171130              FROM QTEMP/TMPHHLDIVR HHLDIVR2
498300171130               WHERE HHLDIVR2.MFR_GROUP_CODE  =
498400171130                     HHLDIVR.MFR_GROUP_CODE
498500171130                 AND HHLDIVR2.INVESTOR_NO     =
498600171130                     HHLDIVR.INVESTOR_NO
498700210802      *RFS186019 - starts
498800210802                 AND HHLDIVR2.HOUSEHOLD_ID    =
498900210802                     HHLDIVR.HOUSEHOLD_ID
499000210802                 AND HHLDIVR2.ASSETS_BY_RULE  =
499100210802                     HHLDIVR.ASSETS_BY_RULE
499200210802                 AND HHLDIVR2.ASSETS_BY_RULE  = "3"
499300210802      *RFS186019 - Ends
499400171130                 AND HHLDIVR2.TRADE_DATE      =
499500171130                     HHLDIVR.TRADE_DATE )
499600171130            END-EXEC.
499700171130
499800171130              MOVE SQLSTATE      TO lc_sqlStates.
499900171130              IF lncc_sqlSuccessful
500000171130                 CONTINUE
500100171130              ELSE
500200171130                 SET lncc_Err-16         TO TRUE
500300171130                 MOVE lc_ErrCodeDescr16  TO lc_sqlErrShortDESCR
500400171130              END-IF.
500500171130
500600210802      *RFS186019 - Starts
500700210802      *------------------------------------------
500800210802       UPDATE-MKT-VALUE-IVR-SIN-LEVEL SECTION.
500900210802      *------------------------------------------
501000210802
501100210802            EXEC SQL
501200210802             UPDATE QTEMP/TMPHHLDIVR HHLDIVR
501300210802             SET HHLDIVR.TOT_IVR_MARKET_VALUE =
501400210802             (SELECT COALESCE(SUM(HHLDIVR1.INV_MARKET_VALUE),0)
501500210802             FROM QTEMP/TMPHHLDIVR HHLDIVR1
501600210802             WHERE HHLDIVR1.MFR_GROUP_CODE
501700210802                   = HHLDIVR.MFR_GROUP_CODE
501800210802              AND HHLDIVR1.INVESTOR_NO
501900210802                  = HHLDIVR.INVESTOR_NO
502000210802              AND HHLDIVR1.HOUSEHOLD_ID
502100210802                  = HHLDIVR.HOUSEHOLD_ID
502200210802              AND HHLDIVR1.SIN_NO
502300210802                  = HHLDIVR.SIN_N
502400210802              AND HHLDIVR1.SIN_NO
502500210802                  <> 0
502600210802              AND HHLDIVR1.ASSETS_BY_RULE
502700210802                  = HHLDIVR.ASSETS_BY_RULE
502800210802              AND HHLDIVR1.ASSETS_BY_RULE
502900210802                  = "4"
503000210802              AND HHLDIVR1.TRADE_DATE
503100210802                  = HHLDIVR.TRADE_DATE
503200210802
503300210802              )
503400210802             WHERE EXISTS
503500210802              (SELECT 1
503600210802              FROM QTEMP/TMPHHLDIVR HHLDIVR2
503700210802               WHERE HHLDIVR2.MFR_GROUP_CODE  =
503800210802                     HHLDIVR.MFR_GROUP_CODE
503900210802                 AND HHLDIVR2.INVESTOR_NO     =
504000210802                     HHLDIVR.INVESTOR_NO
504100210802                 AND HHLDIVR2.HOUSEHOLD_ID    =
504200210802                     HHLDIVR.HOUSEHOLD_ID
504300210802                 AND HHLDIVR2.SIN_NO          =
504400210802                     HHLDIVR.SIN_NO
504500210802                 AND HHLDIVR2.SIN_NO   <> 0
504600210802                 AND HHLDIVR2.ASSETS_BY_RULE  =
504700210802                     HHLDIVR.ASSETS_BY_RULE
504800210802                 AND HHLDIVR2.ASSETS_BY_RULE  = "4"
504900210802                 AND HHLDIVR2.TRADE_DATE      =
505000210802                     HHLDIVR.TRADE_DATE
505100210802                                         )
505200210802            END-EXEC.
505300210802
505400210802              MOVE SQLSTATE      TO lc_sqlStates.
505500210802              IF lncc_sqlSuccessful
505600210802                 CONTINUE
505700210802              ELSE
505800210802                 SET lncc_Err-20         TO TRUE
505900210802                 MOVE lc_ErrCodeDescr20  TO lc_sqlErrShortDESCR
506000210802              END-IF.
506100210802
506200210802      *RFS186019 - Ends
506300171130      *----------------------------
506400171130       OPEN-TOT-MFR-CURSOR SECTION.
506500171130      *----------------------------
506600171130
506700171130            EXEC SQL
506800171130                OPEN TOT_MFR_CURSOR
506900171130            END-EXEC.
507000171130
507100171130           MOVE SQLSTATE      TO lc_sqlStates.
507200171130           IF lncc_sqlSuccessful
507300171130              CONTINUE
507400171130           ELSE
507500171130              SET lncc_Err-03         TO TRUE
507600171130              MOVE lc_ErrCodeDescr03  TO lc_sqlErrShortDESCR
507700171130           END-IF.
507800171130
507900171130      *-----------------------------
508000171130       FETCH-TOT-MFR-CURSOR SECTION.
508100171130      *-----------------------------
508200171130
508300180109      *RFS1000551-Starts
508400180107      *      INITIALIZE ln_Fetch_TradeDate,
508500180107      *                 lc_Fetch_MFRGrpCode,
508600180107      *                 ln_Fetch_InvestorNo,
508700180107      *                 ln_Fetch_AccountNo,
508800180107      *                 ln_Fetch_InvestmentCode,
508900180107      *                 ln_Fetch_AssetsByRule,
509000180107      *                 ln_Fetch_MfrSchdCode,
509100180107      *                 ln_Fetch_TotAssetsAMT,
509200180107      *                 ln_Fetch_TotMarketValue.
509300180107      *     EXEC SQL
509400180107      *      FETCH TOT_MFR_CURSOR
509500180107      *      INTO :ln_Fetch_TradeDate      :lc_NullIndicator,
509600180107      *           :lc_Fetch_MFRGrpCode     :lc_NullIndicator,
509700180107      *           :ln_Fetch_InvestorNo     :lc_NullIndicator,
509800180107      *           :ln_Fetch_AccountNo      :lc_NullIndicator,
509900180107      *           :ln_Fetch_InvestmentCode :lc_NullIndicator,
510000180107      *           :ln_Fetch_AssetsByRule   :lc_NullIndicator,
510100180107      *           :ln_Fetch_MfrSchdCode    :lc_NullIndicator,
510200180107      *           :ln_Fetch_TotAssetsAMT   :lc_NullIndicator,
510300180107      *           :ln_Fetch_TotMarketValue :lc_NullIndicator
510400180107      *     END-EXEC.
510500180107             INITIALIZE lc_FetchArrayRec.
510600180107             EXEC SQL
510700180107              FETCH NEXT FROM TOT_MFR_CURSOR FOR :li_FetchMax ROWS
510800180107              INTO :lc_FArrayRec
510900180107                   :ltb_Indicators
511000180107             END-EXEC.
511100180109      *RFS1000551-Ends
511200171130
511300171130             MOVE SQLSTATE  TO SW-SQL-STATES.
511400171130             EVALUATE TRUE
511500171130             WHEN SW-SQL-SUCCESSFUL OR SW-SQL-WARNING
511600180109      *RFS1000551-Starts
511700180107      *           MOVE ln_Fetch_MfrSchdCode TO
511800180107      *                WS-MFR-SCHEDULE
511900180107      *           PERFORM LOAD-MFR-SCHEDULE-ARRAY
512000180107      *           PERFORM CALC-TOT-MFR
512100180107      *           PERFORM UPDATE-TMPHHLDIVR
512200180107                  COMPUTE li_FetchedRows = SQLERRD (3)
512300180107                  COMPUTE li_RowNo       = 0
512400180107                  PERFORM PROCESS-FETCHED-ROW
512500180107                    UNTIL li_RowNo = li_FetchedRows
512600180109      *RFS1000551-Ends
512700171130              WHEN SW-SQL-END
512800171130               SET lc-EndcursorYes TO TRUE
512900171130              WHEN OTHER
513000171130               SET lncc_Err-04         TO TRUE
513100171130               MOVE lc_ErrCodeDescr04  TO lc_sqlErrShortDESCR
513200171130              END-EVALUATE.
513300171130
513400180109      *RFS1000551-Starts
513500180107      *----------------------------
513600180107       PROCESS-FETCHED-ROW SECTION.
513700180107      *----------------------------
513800180107             INITIALIZE lc_FetchFields.
513900180107             COMPUTE li_RowNo = li_RowNo + 1.
514000180107
514100180107             MOVE lc_FArrayRec(li_RowNo)
514200180107               TO lc_FetchRec.
514300180107
514400180107             MOVE ln_Fetch_MfrSchdCode TO WS-MFR-SCHEDULE.
514500180107             PERFORM LOAD-MFR-SCHEDULE-ARRAY.
514600180107             PERFORM CALC-TOT-MFR.
514700180107             PERFORM UPDATE-TMPHHLDIVR.
514800180109      *RFS1000551-Ends
514900171130             MOVE lc_Fetch_MFRGrpCode  TO lc_Prev_MFRGrpCode.
515000171130             MOVE ln_Fetch_InvestorNo  TO ln_Prev_InvestorNo.
515100171130             MOVE ln_Fetch_AccountNo   TO ln_Prev_AccountNo.
515200171130             MOVE ln_Fetch_TradeDate   TO ln_Prev_TradeDate.
515300171130
515400171130      *-----------------------------
515500171130       CLOSE-TOT-MFR-CURSOR SECTION.
515600171130      *-----------------------------
515700171130
515800171130             EXEC SQL
515900171130                 CLOSE TOT_MFR_CURSOR
516000171130             END-EXEC.
516100171130
516200171130
516300171130      *---------------------
516400171130       CALC-TOT-MFR SECTION.
516500171130      *---------------------
516600171130
516700171130             PERFORM CALC-ASSETS-MFR-AMT THRU CAMA-EXIT.
516800171130
516900171130      *---------------------------
517000171130       CALC-ASSETS-MFR-AMT SECTION.
517100171130      *---------------------------
517200171130
517300171130             MOVE 0 TO ln_MfrTot,
517400171130                       WS-MFR-VALUE,
517500171130                       WS-UNIT-VALUE.
517600171130             MOVE ln_Fetch_MfrSchdCode    TO WS-MFR-SCHEDULE.
517700171130             MOVE ln_Fetch_TotMarketValue TO WS-UNIT-VALUE.
517800171130
517900171130      *---------------
518000171130       CAMA-NEXT-TIER.
518100171130      *---------------
518200171130
518300171130            SET MSIDX TO 1.
518400171130            SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
518500171130            WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
518600171130            AND WS-M-UPPER-LIMIT(MSIDX) >= WS-UNIT-VALUE
518700171130            MOVE WS-M-RATE(MSIDX) TO WS-RATE
518800171130            WHEN WS-M-SCHEDULE(MSIDX) = SPACES
518900171130            GO TO CAMA-EXIT.
519000171130
519100171130            COMPUTE WS-MFR-VALUE ROUNDED  =
519200171130              (WS-UNIT-VALUE - WS-M-LOWER-LIMIT(MSIDX))
519300171130                * WS-RATE / 100 / WS-DAYS-IN-YEAR.
519400171130            ADD WS-MFR-VALUE TO ln_MfrTot.
519500171130            MOVE WS-M-LOWER-LIMIT(MSIDX) TO WS-UNIT-VALUE.
519600171130            IF WS-UNIT-VALUE NOT = 0
519700171130            GO TO CAMA-NEXT-TIER
519800171130            END-IF.
519900171130
520000171130      *----------
520100171130       CAMA-EXIT.
520200171130      *----------
520300171130             EXIT.
520400171130
520500171130      *--------------------------
520600171130       UPDATE-TMPHHLDIVR SECTION.
520700171130      *--------------------------
520800171130             IF ln_Fetch_AssetsByRule = "3"
520900171130               EXEC SQL
521000171130                UPDATE QTEMP/TMPHHLDIVR
521100171130                SET TOT_IVR_MFR_AMT = :ln_MfrTot
521200171130                WHERE MFR_GROUP_CODE = :lc_Fetch_MFRGrpCode
521300171130                 AND INVESTOR_NO    = :ln_Fetch_InvestorNo
521400171130                 AND ASSETS_BY_RULE = :ln_Fetch_AssetsByRule
521500171130                 AND TRADE_DATE     = :ln_Fetch_TradeDate
521600171130               END-EXEC
521700171130              ELSE
521800171130               EXEC SQL
521900171130                UPDATE QTEMP/TMPHHLDIVR
522000171130                SET TOT_ACC_MFR_AMT = :ln_MfrTot
522100171130                WHERE MFR_GROUP_CODE = :lc_Fetch_MFRGrpCode
522200171130                  AND ACCOUNT_NO     = :ln_Fetch_AccountNo
522300171130                  AND ASSETS_BY_RULE = :ln_Fetch_AssetsByRule
522400171130                  AND TRADE_DATE     = :ln_Fetch_TradeDate
522500171130                END-EXEC
522600171130             END-IF.
522700171130
522800171130      *--------------------------
522900171130       GET-EXCHANGE-RATE SECTION.
523000171130      *--------------------------
523100171130                 INITIALIZE EXCHANGE-RATE-M-REC,
523200171130                            WS-EXCHANGE-RATE,
523300171130                            ld_ExchgTradeDte.
523400171130
523500171130                 MOVE WS-B-DATE(BUDIDX)
523600171130                 TO  TRADE-DATE OF EXCHANGE-RATE-M-REC
523700171130                     ld_ExchgTradeDte.
523800171130                 MOVE WS-B-CURR(BUDIDX, BUDIDX2)
523900171130                 TO CURRENCY-DDS OF EXCHANGE-RATE-M-REC.
524000171130                 MOVE lc_ExchangeRateType
524100171130                 TO EXCHANGE-RATE-TYPE  OF EXCHANGE-RATE-M-REC.
524200171130
524300171130                 START EXCHANGE-RATE-M
524400171130                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
524500171130                 INVALID KEY
524600171130                 PERFORM GTER-LAST
524700171130                 END-START.
524800171130                 GO TO GTER-NEXT.
524900171130
525000171130      *Read the Last Record in Exchange Rate File.
525100171130      *------------------
525200171130       GTER-LAST.
525300171130      *------------------
525400171130               READ EXCHANGE-RATE-M LAST AT END
525500171130                 MOVE ZEROS TO EXCHANGE-RATE
525600171130                 OF EXCHANGE-RATE-M-REC
525700171130                GO TO GTER-EXIT
525800171130               END-READ.
525900171130
526000171130               IF EXCHANGE-RATE-TYPE
526100171130                  OF EXCHANGE-RATE-M-REC IS NOT EQUAL TO
526200171130                  lc_ExchangeRateType
526300171130                  GO TO GTER-0010
526400171130               END-IF.
526500171130               MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-REC
526600171130                    TO WS-EXCHANGE-RATE.
526700171130                GO TO GTER-EXIT.
526800171130
526900171130      * Read the Next Record in Exchange Rate File.
527000171130      *------------------
527100171130       GTER-NEXT.
527200171130      *------------------
527300171130               READ EXCHANGE-RATE-M NEXT AT END
527400171130                 MOVE ZEROS TO  EXCHANGE-RATE
527500171130                 OF EXCHANGE-RATE-M-REC
527600171130                GO TO GTER-EXIT
527700171130               END-READ.
527800171130               IF EXCHANGE-RATE-TYPE
527900171130                     OF EXCHANGE-RATE-M-REC IS NOT EQUAL TO
528000171130                     lc_ExchangeRateType
528100171130                   GO TO GTER-0010
528200171130               END-IF.
528300171130               MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-REC
528400171130                   TO WS-EXCHANGE-RATE
528500171130                GO TO GTER-EXIT.
528600171130
528700171130      *Read the Previous Record in Exchange Rate File.
528800171130      *------------------
528900171130       GTER-PRIOR.
529000171130      *------------------
529100171130
529200171130              READ EXCHANGE-RATE-M PRIOR AT END
529300171130                  MOVE ZEROS TO EXCHANGE-RATE
529400171130                             OF EXCHANGE-RATE-M-REC
529500171130                  GO TO GTER-EXIT
529600171130              END-READ.
529700171130
529800171130              IF EXCHANGE-RATE-TYPE
529900171130                     OF EXCHANGE-RATE-M-REC IS NOT EQUAL TO
530000171130                     lc_ExchangeRateType
530100171130                   GO TO GTER-PRIOR
530200171130              END-IF.
530300171130              MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-REC
530400171130                                 TO WS-EXCHANGE-RATE.
530500171130              GO TO GTER-0010.
530600171130
530700171130      * Check the Record Data.
530800171130      *------------------
530900171130        GTER-0010.
531000171130      *------------------
531100171130               IF TRADE-DATE OF EXCHANGE-RATE-M-REC
531200171130                          IS GREATER THAN ld_ExchgTradeDte
531300171130               OR EXCHANGE-RATE-TYPE
531400171130                  OF EXCHANGE-RATE-M-REC IS NOT EQUAL TO
531500171130                  lc_ExchangeRateType
531600171130                  GO TO GTER-PRIOR
531700171130               END-IF.
531800171130
531900171130      *------------------
532000171130        GTER-EXIT.
532100171130      *------------------
532200171130             EXIT.
532300210630      *
532400210630      *------------------------
532500171130        CLOSE-ALL-FILE SECTION.
532600171130      *------------------------
532700171130
532800171130            CLOSE EXCHANGE-RATE-M
532900171130                  TRANS
533000171130                  ACCOUNT-INVESTMENT
533100171130                  MFR-SCHEDULE
533200171130                  Inv-Ass-Alloc-Mod-Sch-Hd
533300171130                  Inv-Ass-Alloc-Model-Sch-Dt
533400171130                  MFR-PROCESS
533500171130                  Account-MFR-Accrual.
533600171130      *RFS167951 Ends
533700171014      /
