000100110516       IDENTIFICATION DIVISION.
000200110516       PROGRAM-ID.    MFRCALC.
000300110516       AUTHOR.        REECE TAM.
000400110516       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000500110516       DATE-WRITTEN.  MAY 23, 1996.
000600110516      *CHANGED-BY.    XXXXXXXXXX.
000700110516      *DATE-CHANGED.  XXXXXXX XX, XXXX.
000800110516       DATE-COMPILED.
000900110516
001000110516      *******************************************************************
001100110516      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
001200110516      *******************************************************************
001300110516      * Reece Tam  * 1996/06/11   * Add Trans-Type-Code 'FEE'.
001400110516      *            * yyyy/mm/dd   *
001500110516      * Aricatt J  * 1999/11/08   * RFS 4556 Override ws-days-in-year
001600110516      *            *              * with 366, if  COMM-TO-DATE is
001700110516      *            *              * a leap year.
001800110516      * Aricatt J  * 2000/04/12   * RFS 6898-Include the changes for
001900110516      *            *              * RFS4556 in source that has changes
002000110516      *            *              * for RFS4697
002100110516      * DAISY LY   * 2002/11/11   * RFS 15460- RECOMPILE
002200110516      * Daisy Ly   * 2002/11/05   * RFS 14388 - calculate the GST & PST
002300110516      *            *              * amount
002400110516      * Ewa        * 2003/01/09   * RFS 15992 - increase size of the
002500110516      * Kolasinska *              * WS-B-BUSINESS-DAY-ENTRY, and
002600110516      *            *              * WS-TRANS-BAL-ENTRY arrays to 366.
002700110516      * Shu Yin    * 2006/08/14   * RFS 34759 - Enhancement to calculate
002800110516      *            *              * MFR amount at holding funds for
002900110516      *            *              * phantom ones.
003000110516      *            *              * Fixed existing level 20 compile
003100110516      *            *              * errors at MAINLINE and REWRITE.
003200110516      * Andy Lo    * 2006/11/20   * RFS 38381 -  When determining which
003300110516      *            *              * rate (tier) to use, the total
003400110516      *            *              * value of Phantom Fund should be used
003500110516      * Ade A      * 2008/01/21   * Rfs 42749 Modify to exclude DISTRI-*
003600110516      *            *              * BUTIION-FLAG = "S"                 *
003700110516      * Lorne B    * 2008/03/31   * Rfs 49476 MFRs to not be calculated*
003800110516      *            *              *  on reversed purchases.            *
003900110516      * R Miguel   * 2010/09/08   * RFS 86665 - Recompile only         *
004000110516      *            *              *                                    *
004100110516      * Sanjeev P  * 2010/10/06   * RFS 79774 - Enhamcement of MFR     *
004200110516      *            * 2010/11/19   * Defect 5  - Moved T-MV(TRNIDX) to  *
004300110516      *            *              * T-UNIT-VALUE(TRNIDX) again to      *
004400110516      *            *              * do the payment on market value     *
004500110516      *            * 2010/11/22   * Defect 11 - Some Acc not being     *
004600110516      *            *              * picked up for MFR Rebate.          *
004700110516      * Abhishek k * 2011/05/16   * RFS91773 - Recompilation
004800121113      * Michael Fan* 2012/10/29   * RFS115704 - Federal Tax Percent and  *
004900121113      *            *              * Provincial Tax Percent change to 5   *
005000121113      *            *              * decimal places instead of 2 on files *
005100121113      *            *              * MFATRNTXP and MFATRNTXDP.            *
005200171010      * Vinsfy J   * 2014/06/12   * RFS136634 -Recompile for MFAACCATP   *
005300160406      * Kahakashan * 2016/03/15   * RFS157482 - logic added to correct   *
005400160406      *            *              * MFR calculation during leap year     *
005500171010      * Sairam     * 2017/10/10   * RFS167951-To calculate the MFR accru-*
005600171010      *            *              * al amount for each account-investment*
005700171010      *            *              * based on the MFR group level         *
005800171010      *            *              * instructions account investment      *
005900171010      *            *              * / account / investor /household level*
006000180108      * Jeyarajan V* 2018/01/05   * RFS1000551-MFR calcualtion for 'G'   *
006100180108      *            *              * calculation method perfromance issue *
006200180131      * Aarthi M   * 2018/01/29   * RFS177476-MFR is not correct with USD*
006300180128      *            *              * funds.                               *
006400180316      * Jeyarajan V* 2018/03/15   * RFS1001473 - MFR not generated and    *
006500180316      *            *              *  reported for eligible funds.         *
006600180528      * Janapriya J * 2018/05/25  * RFS179223 - Recompile for MFAIVRHHP*
006700180709      * Digvijay S * 2018/07/09   * RFS179061 - SEGCONS Extract -
006800180709      *            *              * Additon of new fields
006900180816      * Sethu B     * 2018/08/16  * RFS180381 - Recompile for MFAIVRHHP*
007000181227      * R Miguel   * 2018/12/27   * RFS 182065 - Improve Performance
007100190201      *            *              * for MFR job.
007200200421      * Mayilsamy D* 2020/04/21   * RFS185774 - Recompile for MFAIVRHDP*
007300210301      * Rajesh R   * 2021/02/05   * RFS187018 - Recompile for MFAIVRHDP *
007400210623      * Rajesh R   * 2021/06/18   * RFS186019 - Management Fee Rebate
007500210624      *            *              * Modified program to include
007600210624      *            *              * Assets_By_Rule ='4'.
007700210829      * Mayilsamy D* 2021/08/28   * RFS187441 -Recompile for MFAIVRHHP
007800210927      * Rajesh R   * 2021/09/17   * RFS187775 - Recompile for MFAIVRHDP*
007801211013      * Jebastin   * 2021/10/13   * RFS1122059  - Fix for daily accrual issue.
007900110516      *******************************************************************
008000110516      * -------------------------------------------------------------
008100171010      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
008200110516      * -------------------------------------------------------------
008300110516      *******************************************************************
008400110516      *===============================================================*
008500110516      * Important: IMPORTANT TO ALL PROGRAMMERS
008600110516      *
008700110516      * If any programmer creates, changes or deletes an array in this
008800110516      * programs please add the logic to support the array logging process!
008900110516      *
009000110516      * View the WS-ARRAY-LOG-MISC variables and the code associated with
009100110516      * RFS49699.
009200110516      *
009300110516      * This change is for audit purposes, it logs the
009400110516      * name of the array, max size, size used. At the end of
009500110516      * this program the array information is passed to FXLOGUA pgm,
009600110516      * which write this information to the MFALOGAUP array audit file!
009700110516      *
009800110516      *===============================================================*
009900110516       ENVIRONMENT DIVISION.
010000110516       CONFIGURATION SECTION.
010100110516       SOURCE-COMPUTER. IBM-AS400.
010200110516       OBJECT-COMPUTER. IBM-AS400.
010300110516       SPECIAL-NAMES.
010400210623           LOCAL-DATA IS WS-LOCAL
010500210623186019     DATA-AREA IS WS-DTAARA-MFASYSPARM.
010600210623
010700110516      /
010800110516       INPUT-OUTPUT SECTION.
010900110516       FILE-CONTROL.
011000110516
011100110516           SELECT  MFR-PROCESS
011200110516                   ASSIGN TO DATABASE-MFAMFRPRP
011300110516                   ORGANIZATION IS INDEXED
011400110516                   ACCESS IS DYNAMIC
011500110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
011600110516
011700110516           SELECT  ACCOUNT-INVESTMENT
011800110516                   ASSIGN TO DATABASE-MFAACCIVP
011900110516                   ORGANIZATION IS INDEXED
012000110516                   ACCESS IS DYNAMIC
012100110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012200110516
012300110516           SELECT  TRANS
012400110516                   ASSIGN TO DATABASE-MFATRNLA
012500110516                   ORGANIZATION IS INDEXED
012600110516                   ACCESS IS DYNAMIC
012700110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
012800110516                   WITH DUPLICATES.
012900110516
013000110516           SELECT  MFR-SCHEDULE
013100110516                   ASSIGN TO DATABASE-MFAMFRSCP
013200110516                   ORGANIZATION IS INDEXED
013300110516                   ACCESS IS DYNAMIC
013400110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013500110516
013600110516           SELECT  BUSINESS-DAY-FILE
013700110516                   ASSIGN TO DATABASE-MFABUSDAP
013800110516                   ORGANIZATION IS INDEXED
013900110516                   ACCESS IS DYNAMIC
014000110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
014100110516
014200110516           SELECT  INVESTMENT-UNIT-PRICE
014300110516                   ASSIGN TO DATABASE-MFAINVUPLB
014400110516                   ORGANIZATION IS INDEXED
014500110516                   ACCESS IS DYNAMIC
014600110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
014700110516                   WITH DUPLICATES.
014800110516
014900110516           SELECT  INVESTMENT
015000110516                   ASSIGN TO DATABASE-MFAINVP
015100110516                   ORGANIZATION IS INDEXED
015200110516                   ACCESS IS DYNAMIC
015300110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015400110516
015500110516      *RFS 34759 - Start
015600110516           SELECT  Inv-Ass-Alloc-Mod-Sch-Hd
015700110516                   ASSIGN TO DataBase-Mfaiamshla
015800110516                   ORGANIZATION IS INDEXED
015900110516                   ACCESS IS DYNAMIC
016000110516R38381             FILE STATUS IS lc-FileStatus
016100110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
016200110516                   WITH DUPLICATES.
016300110516
016400110516           SELECT  Inv-Ass-Alloc-Model-Sch-Dt
016500110516                   ASSIGN TO DataBase-Mfaiamsdp
016600110516                   ORGANIZATION IS INDEXED
016700110516                   ACCESS IS DYNAMIC
016800110516R38381             FILE STATUS IS lc-FileStatus
016900110516                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017000110516
017100110516      *RFS 34759 - End
017200171130      *RFS167951 Starts
017300171130           SELECT EXCHANGE-RATE-M
017400171130                  ASSIGN TO DATABASE-MFAEXRHMP
017500171130                  ORGANIZATION IS INDEXED
017600171130                  ACCESS IS DYNAMIC
017700171130                  RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
017800171130                  FILE STATUS IS lc-FileStatus.
017900171130      *RFS167951 Ends
018000110516      /
018100110516       DATA DIVISION.
018200110516       FILE SECTION.
018300110516       FD  MFR-PROCESS
018400110516           LABEL RECORDS ARE STANDARD.
018500110516       01  MFR-PROCESS-REC.       COPY DD-ALL-FORMATS OF MFAMFRPRP.
018600110516      /
018700110516       FD  ACCOUNT-INVESTMENT
018800110516           LABEL RECORDS ARE STANDARD.
018900110516       01  AIV-REC.               COPY DD-ALL-FORMATS OF MFAACCIVP.
019000110516      /
019100110516       FD  TRANS
019200110516           LABEL RECORDS ARE STANDARD.
019300110516       01  TRN-REC.               COPY DD-ALL-FORMATS OF MFATRNLA.
019400110516      /
019500110516       FD  MFR-SCHEDULE
019600110516           LABEL RECORDS ARE STANDARD.
019700110516       01  MFR-SCHEDULE-REC.      COPY DD-ALL-FORMATS OF MFAMFRSCP.
019800110516      /
019900110516       FD  BUSINESS-DAY-FILE
020000110516           LABEL RECORDS ARE STANDARD.
020100110516       01  BUD-REC.               COPY DD-ALL-FORMATS OF MFABUSDAP.
020200110516      /
020300110516       FD  INVESTMENT-UNIT-PRICE
020400110516           LABEL RECORDS ARE STANDARD.
020500110516       01  IUP-REC.               COPY DD-ALL-FORMATS OF MFAINVUPLB.
020600110516      /
020700110516       FD  INVESTMENT
020800110516           LABEL RECORDS ARE STANDARD.
020900110516       01  IVS-REC.               COPY DD-ALL-FORMATS OF MFAINVP.
021000110516
021100110516      *RFS 34759 - Start
021200110516      /
021300110516       FD  Inv-Ass-Alloc-Mod-Sch-Hd
021400110516           LABEL RECORDS ARE STANDARD.
021500110516       01  Inv-Ass-Alloc-Mod-Sch-Hd-Rec.
021600110516                        COPY DD-ALL-FORMATS OF Mfaiamshla.
021700110516      /
021800110516       FD  Inv-Ass-Alloc-Model-Sch-Dt
021900110516           LABEL RECORDS ARE STANDARD.
022000110516       01  Inv-Ass-Alloc-Model-Sch-Dt-Rec.
022100110516                        COPY DD-ALL-FORMATS OF Mfaiamsdp.
022200171011      *RFS 34759 - End
022300171130      *RFS167951 Starts
022400171130       FD  EXCHANGE-RATE-M
022500171130           LABEL RECORDS ARE STANDARD.
022600171130       01  EXCHANGE-RATE-M-REC.       COPY DD-ALL-FORMATS OF MFAEXRHMP.
022700171130      *RFS167951 Ends
022800110516
022900110516       WORKING-STORAGE SECTION.
023000110516
023100110516       01  CURR-CONTROLS.
023200110516          03 CURR-LEVEL1.
023300110516           05 CURR-INVESTMENT-CODE     PIC X(5).
023400110516
023500110516       01  PREV-CONTROLS.
023600110516          03 PREV-LEVEL1.
023700110516           05 PREV-INVESTMENT-CODE     PIC X(5).
023800110516
023900110516       01  WS-MISC-FIELDS.
024000110516RF4556     05 WS-LEAP0            PIC 9(4)        VALUE 0.
024100110516RF4556     05 WS-LEAP1            PIC 9           VALUE 0.
024200110516RF4697     05 WS-MCO              PIC X(3).
024300110516RF4697     05 WS-UNIT-VALUE       PIC 9(9)V99.
024400110516RF4697     05 WS-MFR-VALUE        PIC 9(9)V999999 VALUE 0 COMP-3.
024500110516           05 WS-LAST-PRICE       PIC 9(4)V9999.
024600110516           05 WS-SAME-BALANCE     PIC X           VALUE "N".
024700110516           05 WS-OPENING-BALANCE  PIC 9(9)V999    VALUE 0 COMP-3.
024800110516           05 WS-CARRY-FORWARD    PIC 9(9)V999    VALUE 0 COMP-3.
024900110516           05 WS-FIRST-READ-SW    PIC X(1)        VALUE "Y".
025000110516           05 WS-DAYS-IN-YEAR     PIC 9(5)        VALUE 365 COMP-3.
025100110516           05 WS-TOT-MFR-AMT      PIC 9(9)V999999 VALUE 0 COMP-3.
025200171130167951*    05 WS-RATE             PIC 9(4)V999    VALUE 0 COMP-3.
025300171130167951     05 WS-RATE             PIC 9(3)V9(6)   VALUE 0 COMP-3.
025400110516           05 WS-REJECTION-CODE   PIC X(3)        VALUE " ".
025500110516R79774     05 WS-AVG-UNIT-COST    PIC 9(4)V9999   VALUE 0.
025600210624      *RFS186019 - Start
025700210624           05 lnc-T                    PIC X(01) value "T".
025800210716           05 lnc-S                    PIC X(01) value "S".
025900210716           05 li_GROSS_AMT_MFR         PIC S9(13)V9(02).
026000210715           05 li_PST_AMT_MFR           PIC S9(11)V99.
026100210715           05 li_GST_AMT_MFR           PIC S9(11)V99.
026200210624           05 ln_SecondaryAssetsAmt    PIC S9(11)V99.
026300210708           05 ln_TotAssetsAmt_A        PIC S9(11)V99.
026400210624           05 ln_PaymentDate           PIC S9(8).
026500210624           05 ln_LastPaymentDate       PIC S9(8).
026600210630           05 ln_EligibleForCalc       PIC X(01) VALUE " ".
026700210624      *RFS186019 - End
026800110516
02690011051614388      05 WS-TXN-SALES-TAX-FIELDS.
027000110516  ¦           10 WS-ACCT-NO              PIC S9(9)        COMP-3.
027100110516  ¦           10 WS-SALES-TAX-CODE       PIC X(1).
027200121113115704*       10 WS-PRV-TAX-RATE         PIC S9(5)V9(2)   COMP-3.
027300121113115704*       10 WS-FED-TAX-RATE         PIC S9(5)V9(2)   COMP-3.
027400121113115704        10 WS-PRV-TAX-RATE         PIC S9(4)V9(5)   COMP-3.
027500121113115704        10 WS-FED-TAX-RATE         PIC S9(4)V9(5)   COMP-3.
027600110516  ¦           10 WS-COMPOUND-TAX         PIC X(1).
027700110516  ¦           10 WS-GST-AMT              PIC 9(9)V9(6) VALUE 0 COMP-3.
02780011051614388         10 WS-PST-AMT              PIC 9(9)V9(6) VALUE 0 COMP-3.
027900110516
028000110516           05 WS-MFR-SCHEDULE     PIC X(3)        VALUE " ".
028100110516      *RFS 34759 - Start
028200110516RF4697*       88 GRADUATED-SCHEDULE  VALUES "MR1" "MR2" "MR9" "MR3".
028300110516      *RFS 34759 - End
028400110516           05  WS-SYSDATE.
028500110516               10 WS-SYSDATE-CC          PIC 99.
028600110516               10 WS-SYSDATE-YMD.
028700110516                  15 WS-SYSDATE-YY       PIC 99.
028800110516                  15 WS-SYSDATE-MM       PIC 99.
028900110516                  15 WS-SYSDATE-DD       PIC 99.
029000110516           05  WS-SYSDATE-N REDEFINES WS-SYSDATE
029100110516                                         PIC 9(8).
029200110516
029300110516           05  WS-SYSTIME-LONG.
029400110516               10 WS-SYSTIME.
029500110516                  15 WS-SYSTIME-HH       PIC 99.
029600110516                  15 WS-SYSTIME-MI       PIC 99.
029700110516                  15 WS-SYSTIME-SS       PIC 99.
029800110516               10 WS-SYSTIME-N REDEFINES WS-SYSTIME
029900110516                                         PIC 9(6).
030000110516               10 WS-SYSTIME-HS          PIC 99.
030100110516
030200110516      * RFS 79774 - Begin
030300110516           05 lc-MfrEfs-Edit             PIC X(01).
030400110516              88 MfrEfs-Exist            VALUES "Y".
030500110516              88 MfrEfs-NotExist         VALUES "N".
030600110516           05 lc-Acct-Attr               PIC X(5).
030700110516              88 ByMfr-Attr              VALUES "BYMFR".
030800110516           05 ln-Acct-No                 PIC S9(9) COMP-3.
030900110516           05 lc-Acct-Inv-Vars.
031000110516              10 ln-Curr-Unit-Bal        PIC S9(9)V9(3) COMP-3.
031100110516
031200110516       01  Screen-Edits-Allowed-Rec.
031300110516                             COPY DD-ALL-FORMATS OF MFAEDTSCP.
031400110516       01  Ws-Screen-Edits-Allowed.
031500110516           05 Ws-Sea-Edit-Sqllog           PIC X(1) VALUE "N".
031600110516           05 Ws-Sea-Return-Code           PIC X(2) VALUE "00".
031700110516
031800110516       01 Fxscedtalw-Vars.
031900110516          05 lc-MfrEfs-Screen-Code     PIC X(8) VALUE "MFRACT".
032000110516          05 lc-MfrEfs-Edit-Code       PIC X(6) VALUE "MFREFS".
032100110516          05 lc-MfrEfs-Level-Code      PIC X(1) VALUE "N".
032200110516      * RFS 79774 - End
032300110516
032400110516        01 WS-TRANS-DATE-ARRAY.
032500110516R15992*    05 WS-TRANS-BAL-ENTRY OCCURS 200 TIMES INDEXED BY TRNIDX
032600110516R15992     05 WS-TRANS-BAL-ENTRY OCCURS 366 TIMES INDEXED BY TRNIDX
032700110516                                                             TIDXFROM
032800110516                                                             TIDXTO.
032900110516              07 WS-T-DATE                PIC 9(8).
033000110516              07 WS-T-PRICE               PIC 9(4)V9999.
033100110516              07 WS-T-INVESTMENT-CODE     PIC X(5).
033200110516
033300110516              07 WS-T-UNIT-VALUE          PIC 9(9)V99.
033400110516              07 WS-T-UNIT-BALANCE        PIC 9(9)V999.
033500110516              07 WS-T-UNIT-ADJUST         PIC X(1).
033600110516R79774        07 WS-T-AVG-UNIT-COST       PIC 9(4)V9999.
033700171130167951*       07 WS-T-MFR-RATE            PIC 9(4)V999.
033800171130167951        07 WS-T-MFR-RATE            PIC 9(3)V9(6).
033900210801186019*       07 WS-T-MFR-VALUE           PIC 9(9)V999999.
034000210801186019        07 WS-T-MFR-VALUE           PIC S9(9)V999999.
034100110516R79774        07 WS-T-MV                  PIC 9(9)V99.
034200110516R79774        07 WS-T-BV                  PIC 9(9)V99.
034300110516
034400110516        01 WS-MFR-SCHEDULE-ARRAY.
034500110516           05 WS-MFR-SCHEDULE-ENTRY OCCURS 100 TIMES INDEXED BY MSIDX.
034600110516              07 WS-M-SCHEDULE            PIC X(3).
034700110516              07 WS-M-LOWER-LIMIT         PIC 9(11)V99 COMP-3.
034800110516              07 WS-M-UPPER-LIMIT         PIC 9(11)V99 COMP-3.
034900171130167951*       07 WS-M-RATE                PIC 9(4)V999 COMP-3.
035000171130167951        07 WS-M-RATE                PIC 9(3)V9(6) COMP-3.
035100110516
035200110516        01 WS-BUSINESS-DAY-ARRAY.
035300110516R15992*   05 WS-B-BUSINESS-DAY-ENTRY OCCURS 200 TIMES INDEXED BY BUDIDX,
035400110516R15992    05 WS-B-BUSINESS-DAY-ENTRY OCCURS 366 TIMES INDEXED BY BUDIDX,
035500110516                                                                 BUDMAX.
035600110516              07 WS-B-BUDIDX-END               PIC X(1).
035700110516              07 WS-B-DATE                     PIC 9(8).
035800110516              07 WS-B-TRADING                  PIC X(1).
035900180316      *RFS1001473-Starts
03600018031679774 *       07 WS-B-INVESTMENT-ENTRY OCCURS 300 INDEXED BY BUDIDX2
036100180316              07 WS-B-INVESTMENT-ENTRY OCCURS 1500 INDEXED BY BUDIDX2
036200180316      *RFS1001473-Ends
03630011051679774                                                        BUDIDX2SV.
03640011051679774 *       07 WS-B-INVESTMENT-ENTRY OCCURS 100 INDEXED BY BUDIDX2
036500110516                 09 WS-B-BUDIDX2-END           PIC X(1).
036600110516                 09 WS-B-INVESTMENT-CODE       PIC X(5).
036700171010                 09 WS-B-PRICE                 PIC 9(4)V9999.
036800171010167951           09 WS-B-CURR                  PIC X(3).
036900171010167951           09 WS-B-EXCHG-RATE            PIC S9(3)V9(7).
037000110516
037100171130167951 01  lc_NullIndicator              PIC S9(4) BINARY.
037200110516       01  WS-TRANS-STATUS.
037300110516           05 WS-TRANS-STATUS-88   PIC X(3).
037400110516              88 HISTORY           VALUES "HST" "HSC".
037500110516              88 REVERSAL          VALUES "RVS".
037600110516
03770011051614388  01  WS-MFR-TRANSACTION      PIC X(3) VALUE "MFR".
037800110516
037900110516       01  WS-TRANS-TYPE.
038000110516           05 WS-TRANS-TYPE-88     PIC X(3).
038100110516              88 REDEMPTION        VALUES "SEL" "SWO" "TRO" "CQD"
038200110516                                          "TFE" "FEE" "SAJ".
038300110516
038400110516        01 WS-QBEGIN.
038500110516           03 WS-QBEGIN-YY              PIC 9(4) VALUE 0.
038600110516           03 WS-QBEGIN-MM              PIC 9(2) VALUE 0.
038700110516           03 WS-QBEGIN-DD              PIC 9(2) VALUE 0.
038800110516        01 WS-QBEGIN-N REDEFINES WS-QBEGIN
038900110516                                        PIC 9(8).
039000110516
039100110516        01 WS-QEND.
039200110516           03 WS-QEND-YY                PIC 9(4) VALUE 0.
039300110516           03 WS-QEND-MM                PIC 9(2) VALUE 0.
039400110516           03 WS-QEND-DD                PIC 9(2) VALUE 0.
039500110516        01 WS-QEND-N   REDEFINES WS-QEND
039600110516                                        PIC 9(8).
039700110516
039800110516        01 WS-QFROM.
039900110516           03 WS-QFROM-YY               PIC 9(4) VALUE 0.
040000110516           03 WS-QFROM-MM               PIC 9(2) VALUE 0.
040100110516           03 WS-QFROM-DD               PIC 9(2) VALUE 0.
040200110516        01 WS-QFROM-N  REDEFINES WS-QFROM
040300110516                                        PIC 9(8).
040400110516
040500110516        01 WS-QTO.
040600110516           03 WS-QTO-YY                 PIC 9(4) VALUE 0.
040700110516           03 WS-QTO-MM                 PIC 9(2) VALUE 0.
040800110516           03 WS-QTO-DD                 PIC 9(2) VALUE 0.
040900110516        01 WS-QTO-N    REDEFINES WS-QTO
041000110516                                        PIC 9(8).
041100110516      *RFS 49476 - Start
041200110516       01 lc-Reverse                    PIC X(1) VALUE " ".
041300110516          88 lc-Reverse-Y                   VALUE "Y".
041400110516      *RFS 49476 - End
041500110516
041600110516      *RFS 34759 - Start
041700110516       01 lc-ProcessDate.
041800110516          05 lc-AsAtDate              PIC X(8).
041900110516          05 li-AsAtDate REDEFINES lc-AsAtDate
042000110516                                      PIC 9(8).
042100210624          05 ln-AsAtDate REDEFINES lc-AsAtDate
042200210624                                      PIC S9(8).
042300110516          05 lc-ProcessDateOthers     PIC X(161).
042400210707
042500210707       01 lc-ProcessDate-N            PIC S9(8).
042600110516
042700110516       01 lc-ProductTypeRule           PIC X(1).
042800110516          88 lc-Phantom                     VALUE "3".
042900110516
043000110516       01 lc-InvestmentCode            PIC X(5) VALUE SPACES.
043100110516       01 lc-InvestmentCodeAAP         PIC X(5) VALUE SPACES.
043200110516       01 lc-InvestmentCodeAAH         PIC X(5) VALUE SPACES.
043300110516
043400110516       01 lb-EOFHolding                PIC X(1).
043500110516          88 lb-EOFHoldingTrue                  VALUE "T".
043600110516          88 lb-EOFHoldingFalse                 VALUE "F".
043700110516
043800110516       01 lc-MFRGroupCode              PIC X(4) VALUE SPACES.
043900110516       01 lc-MFRCalcInd                PIC X(1) VALUE "F".
044000110516       01 lnc-G                        PIC X(1) VALUE "G".
044100110516       01 lnc-Y                        PIC X(1) VALUE "Y".
044200110516       01 lc-ModelHdrEnd               PIC X(1) VALUE " ".
044300110516       01 ln-MfrAmtAAP                 PIC 9(9)V9(6) VALUE 0 COMP-3.
044400110516R38381*01 ln-GstAmtAAP                 PIC 9(9)V9(6) VALUE 0 COMP-3.
044500110516R38381*01 ln-PstAmtAAP                 PIC 9(9)V9(6) VALUE 0 COMP-3.
044600110516       01 lc-LoadBatchPrc              PIC X(1) VALUE " ".
044700110516      *RFS 34759 - End
044800110516      *RFS 79774 - Start
044900110516       01 LNC-A                        PIC X(1) VALUE "A".
045000110516       01 LNC-B                        PIC X(1) VALUE "B".
045100110516       01 LNC-M                        PIC X(1) VALUE "M".
045200110516      *RFS 79774 - End
045300210624      * RFS186019 - Begins
045400210624       01 lc_MFASYSPARM.
045500210624          05 lc_FILLER                 PIC X(1183) VALUE " ".
045600210624          05 lc_EffectiveFlag          PIC X(01)   VALUE " ".
045700210630          05 lc_RegrAccrFlag           PIC X(01)   VALUE " ".
045800210624      * RFS186019 - Ends
045900110516
046000110516      *RFS 38381 - Begin
046100110516       01 WS-TOT-AMT-ARRAY.
046200110516           05 WS-TOT-AMT-ENTRY OCCURS 366 TIMES INDEXED BY TOT-IDX.
046300110516              07 TOT-AMT               PIC 9(8)V9999.
046400110516       01 ln-Phmframt                  PIC 9(8)V9999.
046500110516       01 lc-FileStatus                PIC XX        VALUE SPACES.
046600110516       01 ln-Idx                       PIC 9(4).
046700110516      *RFS 38381 - End
046800110516
046900110516      * RFS49699 - Begin
047000110516
047100110516       01 WS-ARRAY-LOG-MISC.
047200110516           05 WS-ARRAY1-NAME           PIC X(32)
047300110516                               VALUE "WS-TRANS-BAL-ENTRY".
047400110516           05 WS-ARRAY1-MAX            PIC 9(09)
047500110516                               VALUE 366.
047600110516           05 WS-ARRAY1-MAX-USED       PIC 9(09)
047700110516                               VALUE 0.
047800110516           05 WS-ARRAY2-NAME           PIC X(32)
047900110516                               VALUE "WS-MFR-SCHEDULE-ENTRY".
048000110516           05 WS-ARRAY2-MAX            PIC 9(09)
048100110516                               VALUE 100.
048200110516           05 WS-ARRAY2-MAX-USED       PIC 9(09)
048300110516                               VALUE 0.
048400110516           05 WS-ARRAY3-NAME           PIC X(32)
048500110516                               VALUE "WS-B-BUSINESS-DAY-ENTRY".
048600110516           05 WS-ARRAY3-MAX            PIC 9(09)
048700110516                               VALUE 366.
048800110516           05 WS-ARRAY3-MAX-USED       PIC 9(09)
048900110516                               VALUE 0.
049000110516           05 WS-ARRAY4-NAME           PIC X(32)
049100110516                               VALUE "WS-B-INVESTMENT-ENTRY".
049200110516           05 WS-ARRAY4-MAX            PIC 9(09)
049300110516                               VALUE 100.
049400110516           05 WS-ARRAY4-MAX-USED       PIC 9(09)
049500110516                               VALUE 0.
049600110516           05 WS-ARRAY5-NAME           PIC X(32)
049700110516                               VALUE "WS-TOT-AMT-ENTRY".
049800110516           05 WS-ARRAY5-MAX            PIC 9(09)
049900110516                               VALUE 366.
050000110516           05 WS-ARRAY5-MAX-USED       PIC 9(09)
050100110516                               VALUE 0.
050200110516
050300110516      * RFS49699 - End
050400110516
050500110516      *rfs42749
050600110516       01 lc-Constants.
050700110516          05 lc-S                      PIC X(1) VALUE "S".
050800110516      *rfs42749
050900171010
051000171130      *RFS167951 Starts
051100171010       01 lc_WorkVariables.
051200171010          03 lc_ABRule                PIC  X(1).
051300171016          03 ln_InvestorNo            PIC  S9(9).
051400171016          03 ln_Prev_InvestorNo       PIC  S9(9).
051500171016          03 ln_AccountNo             PIC  S9(9).
051600171016          03 ln_Prev_AccountNo        PIC  S9(9).
051700171016          03 ln_Count                 PIC  S9(9).
051800171010          03 lc_MfrSchdCode           PIC  X(3).
051900171010          03 lc_OvrrideSchd           PIC  X(3).
052000171010          03 lc_MFR_Grp_code          PIC  X(4).
052100171010          03 lc_InvestmentCode        PIC  X(5).
052200171010          03 ld_TradeDte              PIC S9(8).
052300171010          03 ln_InvAssetAmt           PIC S9(11)V99.
052400171130          03 ln_InvMarketValue        PIC S9(11)V99.
052500210714          03 ln_TotAssetsAmt          PIC S9(11)V99  VALUE 0.
052600171130          03 ln_TotMarketValue        PIC S9(11)V99.
052700171121          03 ln_TotMfrAmt             PIC S9(9)V9(6) VALUE 0 COMP-3.
052800171121          03 ln_MfrTot                PIC S9(9)V9(6) VALUE 0 COMP-3.
052900171010          03 lc_AS_Rule               PIC  X(1).
053000171010          03 lc_AS_MFR_Grp_code       PIC  X(4).
053100171016          03 lc_Prev_MFRGrpCode       PIC  X(3).
053200171130          03 WS-EXCHANGE-RATE         PIC S9(3)V9(7) VALUE 0.
053300171016          03 lc_BaseCurrency          PIC  X(3).
053400171115          03 ln_Prev_TradeDate        PIC S9(8).
053500171116          03 ln_StartDate             PIC S9(8).
053600171116          03 ln_EndDate               PIC S9(8).
053700171116          03 lc_ExchangeRateType      PIC  X(1).
053800171116          03 ld_ExchgTradeDte         PIC  9(8).
053900180108      *RFS1000551-Starts
054000180109          03 li_FetchedRows           PIC S9(4)      VALUE   0.
054100180109          03 li_RowNo                 PIC S9(4)      VALUE   0.
054200180108      *RFS1000551-Ends
054300180128177476    03 lc_SameCurr              PIC  X(1)      VALUE   SPACE.
054400171130
054500180108      *RFS1000551-Starts
054600180109       01 li_FetchMax                 PIC S9(4)      VALUE 5000.
054700180108      *RFS1000551-Ends
054800180107
054900180108      *RFS1000551-Starts
055000180107       01 lc_FetchArrayRec.
055100180109         02 lc_FArrayRec OCCURS 5000 TIMES.
055200180107          03 ln_FArray_TradeDate      PIC S9(8).
055300180107          03 lc_FArray_MFRGrpCode     PIC  X(4).
055400180107          03 ln_FArray_InvestorNo     PIC S9(9).
055500180107          03 ln_FArray_AccountNo      PIC S9(9).
055600180107          03 ln_FArray_AssetsByRule   PIC  X(1).
055700180107          03 ln_FArray_MfrSchdCode    PIC  X(3).
055800180107          03 ln_FArray_TotAssetsAMT   PIC S9(11)V99.
055900180107          03 ln_FArray_TotMarketValue PIC S9(11)V99.
056000180107
056100180107       01 ltb_NullIndicatorsTable.
056200180109         02 ltb_Indicators OCCURS 5000 TIMES.
056300180107          03 ltb_Indicator            PIC S9(04)  BINARY
056400180107                           OCCURS 08  TIMES.
056500180108      *RFS1000551-Ends
056600171010       01 lc_FetchFields.
056700180108      *RFS1000551-Starts
056800180108         02 lc_FetchRec.
056900180108      *RFS1000551-Ends
057000171115          03 ln_Fetch_TradeDate       PIC  S9(8).
057100171115          03 lc_Fetch_MFRGrpCode      PIC  X(4).
057200171010          03 ln_Fetch_InvestorNo      PIC  S9(9).
057300171016          03 ln_Fetch_AccountNo       PIC  S9(9).
057400180108      *RFS1000551-Starts
057500180108      *   03 ln_Fetch_InvestmentCode  PIC  X(5).
057600180108      *RFS1000551-Ends
057700171010          03 ln_Fetch_AssetsByRule    PIC  X(1).
057800171010          03 ln_Fetch_MfrSchdCode     PIC  X(3).
057900171010          03 ln_Fetch_TotAssetsAMT    PIC S9(11)V99.
058000171130          03 ln_Fetch_TotMarketValue  PIC S9(11)V99.
058100171130
058200171010       01 lc_IvrAcclvl                   PIC X(1).
058300171010          88 lb_IvrAccLvlYes             VALUES "Y".
058400171010          88 lb_IvrAccLvlNo              VALUES "N".
058500171010       01 lc-CurEnd                      PIC X(1).
058600171010          88 lc-EndcursorYes             VALUE "Y".
058700171010          88 lc-EndcursorNo              VALUE "N".
058800171010       01 lc-ASRcursor                   PIC X(1).
058900171010          88 lc-EndASRcursorYes          VALUE "Y".
059000171010          88 lc-EndASRcursorNo           VALUE "N".
059100171010       01 lc-ASBOneOnly                  PIC X(1).
059200171010          88 lc-ASBOneOnlyYes            VALUE "Y".
059300171010          88 lc-ASBOneOnlyNo             VALUE "N".
059400171010
059500171010      * Error Codes, Uniquely Identify where the error happened
059600171029       01  WS-ERR-CODE               PIC  X(02)   VALUE SPACES.
059700171029         88  lncc_Err-Ok                          VALUE SPACES.
059800171029         88  lncc_Err-01                          VALUE "01".
059900171029         88  lncc_Err-02                          VALUE "02".
060000171029         88  lncc_Err-03                          VALUE "03".
060100171029         88  lncc_Err-04                          VALUE "04".
060200171029         88  lncc_Err-05                          VALUE "05".
060300171029         88  lncc_Err-06                          VALUE "06".
060400171029         88  lncc_Err-07                          VALUE "07".
060500171029         88  lncc_Err-08                          VALUE "08".
060600171029         88  lncc_Err-09                          VALUE "09".
060700171029         88  lncc_Err-10                          VALUE "10".
060800171029         88  lncc_Err-11                          VALUE "11".
060900171029         88  lncc_Err-12                          VALUE "12".
061000171029         88  lncc_Err-13                          VALUE "13".
061100171130         88  lncc_Err-14                          VALUE "14".
061200171130         88  lncc_Err-15                          VALUE "15".
061300171130         88  lncc_Err-16                          VALUE "16".
061400180128      *RFS177476-Starts
061500180128         88  lncc_Err-17                          VALUE "17".
061600180128         88  lncc_Err-18                          VALUE "18".
061700180128      *RFS177476-Ends
061800180710179061   88  lncc_Err-19                          VALUE "19".
061900210623      *RFS186019-Starts
062000210623         88  lncc_Err-20                          VALUE "20".
062100210623         88  lncc_Err-21                          VALUE "21".
062200210801         88  lncc_Err-22                          VALUE "22".
062300210801         88  lncc_Err-23                          VALUE "23".
062400210801         88  lncc_Err-24                          VALUE "24".
062500210623      *RFS186019-End
062600171010
062700171010      * Error Desc,Uniquely Identify where the error happened
062800171010        01  lc_ErrorDescr.
062900171010          03  lc_ErrCodeDescr01          PIC  X(80)   VALUE
063000171029                "Issue in Checking Count".
063100171010          03  lc_ErrCodeDescr02          PIC  X(80)   VALUE
063200171029                "Issue in getting override schedule".
063300171010          03  lc_ErrCodeDescr03          PIC  X(80)   VALUE
063400171029                "Issue in Opening Cursor TOT_MFR_CUR".
063500171010          03  lc_ErrCodeDescr04          PIC  X(80)   VALUE
063600171029                "Issue in Fetching Cursor TOT_MFR_CUR".
063700171029          03  lc_ErrCodeDescr05          PIC  X(80)   VALUE
063800171029                "Issue in creating QTEMP/TMPHHLDIVR".
063900171029          03  lc_ErrCodeDescr06          PIC  X(80)   VALUE
064000171029                "Issue in Inserting QTEMP/TMPHHLDIVR".
064100171029          03  lc_ErrCodeDescr07          PIC  X(80)   VALUE
064200171029                "Issue in Creating QTEMP/TMPACCINV".
064300171029          03  lc_ErrCodeDescr08          PIC  X(80)   VALUE
064400171029                "Issue in Declaring MFR_TOT_CUR".
064500171029          03  lc_ErrCodeDescr09          PIC  X(80)   VALUE
064600171029                "Issue in Inserting QTEMP/TMPACCINV".
064700171029          03  lc_ErrCodeDescr10          PIC  X(80)   VALUE
064800171029                "Issue in UPDATE-ASSET-AMT-INV-LEVEL".
064900171029          03  lc_ErrCodeDescr11          PIC  X(80)   VALUE
065000171029                "Issue in UPDATE-ASSET-AMT-ACC-LEVEL".
065100171029          03  lc_ErrCodeDescr12          PIC  X(80)   VALUE
065200171029                "Issue in UPDATE-ASSET-AMT-IVR-LEVEL".
065300171115          03  lc_ErrCodeDescr13          PIC  X(80)   VALUE
065400171115                "Issue in getting Total asset amt".
065500171130          03  lc_ErrCodeDescr14          PIC  X(80)   VALUE
065600171130                "Issue in UPDATE-MARKET-VALUE-INV-LEVEL".
065700171130          03  lc_ErrCodeDescr15          PIC  X(80)   VALUE
065800171130                "Issue in UPDATE-MARKET-VALUE-ACC-LEVEL".
065900171130          03  lc_ErrCodeDescr16          PIC  X(80)   VALUE
066000171130                "Issue in UPDATE-MARKET-VALUE-IVR-LEVEL".
066100171130      *RFS167951 Ends
066200180128      *RFS177476-Starts
066300180128          03  lc_ErrCodeDescr17          PIC  X(80)   VALUE
066400180128                "Issue in UPDATE-SAME-CURR-ACC-LEVEL".
066500180128          03  lc_ErrCodeDescr18          PIC  X(80)   VALUE
066600180128                "Issue in UPDATE-SAME-CURR-IVR-LEVEL".
066700180128      *RFS177476-Ends
066800180710179061    03  lc_ErrCodeDescr19          PIC  X(80)   VALUE
066900180710179061          "Issue in Inserting WRKHHLDIVR".
067000210623      *RFS186019-Starts
067100210623          03  lc_ErrCodeDescr20          PIC  X(80)   VALUE
067200210623                "Issue in UPDATE-MFAACCMFP".
067300210623          03  lc_ErrCodeDescr21          PIC  X(80)   VALUE
067400210623                "Issue in INSERT-MFAACCMFP".
067500210801          03  lc_ErrCodeDescr22          PIC  X(80)   VALUE
067600210801                "UPDATE-ASSET-AMT-IVR-SIN-LEVEL".
067700210801          03  lc_ErrCodeDescr23          PIC  X(80)   VALUE
067800210801                "UPDATE-MRKT-VAL-IVR-SIN-LEVEL".
067900210801          03  lc_ErrCodeDescr24          PIC  X(80)   VALUE
068000210801                "UPDATE-SAME-CURR-IVR-SAME-SIN-LEVEL".
068100210623      *RFS186019-End
068200110516      * Copybooks
068300110516
068400110516      * RFS49699 - Begin
068500110516
068600110516      *  screen edits allowed
068700110516           copy CPSCEDTAL1.
068800110516
068900110516      *  log array info
069000110516           copy CPFXLOGAU.
069100110516
069200110516      *  log array table name
069300110516           copy CPFXLOGAT.
069400110516
069500110516      * RFS49699 - End
069600171130      *RFS167951 Starts
069700171130      *  Sql Error Handling Copy Book
069800171130           COPY CPYSQLFLD
069900171130           REPLACING == "CURRENT_PROGRAM" == BY == "MFRCALC" ==.
070000171130      *RFS167951 Ends
070100110516
070200110516           EXEC SQL
070300110516              INCLUDE SQLCA
070400110516              END-EXEC.
070500110516
070600110516       LINKAGE SECTION.
070700110516        01 COMM-PROCESS-OPTION          PIC X(1).
070800110516      * 'B' = Batch process, and does not require the following parms.
070900110516      * 'O' = On-line process, and requires the following parms:
071000110516
071100110516        01  COMM-MFR-SCHEDULE           PIC X(3).
071200110516        01  COMM-ACCOUNT-NO             PIC 9(9).
071300110516        01  COMM-INVESTMENT-CODE        PIC X(5).
071400110516        01  COMM-FROM-DATE              PIC 9(8).
071500110516        01  COMM-TO-DATE                PIC 9(8).
071600110516        01  COMM-REJECTION-CODE         PIC X(3).
071700110516        01  COMM-CALCULATED-AMT         PIC S9(11)V99.
071800110516        01  COMM-PST-AMT                PIC S9(11)V99.
071900110516        01  COMM-GST-AMT                PIC S9(11)V99.
072000110516      *RFS 34759 - Start
072100110516        01  Comm-MFR-Group-Code         PIC X(4).
072200110516      *RFS 34759 - End
072300110516
072400110516      /
072500110516       PROCEDURE DIVISION USING COMM-PROCESS-OPTION
072600110516                                COMM-MFR-SCHEDULE
072700110516                                COMM-ACCOUNT-NO
072800110516                                COMM-INVESTMENT-CODE
072900110516                                COMM-FROM-DATE
073000110516                                COMM-TO-DATE
073100110516                                COMM-REJECTION-CODE
073200110516                                COMM-CALCULATED-AMT
073300110516                                COMM-PST-AMT
073400110516                                COMM-GST-AMT
073500110516      *RFS 34759 - Start
073600110516                                Comm-MFR-Group-Code.
073700110516
073800110516      *MAINLINE.
073900110516       MAINLINE SECTION.
074000110516      *RFS 34759 - End
074100110516           PERFORM INITIAL-LOGIC.
074200110516           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
074300110516              GO TO ML-1200.
074400110516       ML-0010.
074500110516           PERFORM GET-CURRENT-RECORD.
074600110516       ML-0020.
074700110516           IF PREV-LEVEL1 IS EQUAL TO CURR-LEVEL1
074800110516              GO TO ML-1100.
074900110516           IF PREV-CONTROLS IS EQUAL TO LOW-VALUES
075000110516              GO TO ML-0040.
075100110516       ML-0030.
075200110516       ML-0040.
075300110516           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
075400110516              GO TO ML-1200.
075500110516       ML-0050.
075600110516       ML-0100.
075700110516       ML-1100.
075800110516      *RFS 34759 - Start
075900110516           IF NOT lc-Phantom
076000110516      *RFS 34759 - End
076100110516           PERFORM DETAIL-PROCESSING.
076200110516           GO TO ML-0010.
076300110516       ML-1200.
076400110516           PERFORM END-JOB.
076500110516      *RFS 34759 - Start
076600110516      *    STOP RUN.
076700110516           GOBACK.
076800110516      *RFS 34759 - End
076900110516      /
077000110516       GET-CURRENT-RECORD SECTION.
077100110516
077200110516      *RFS 34759 - Start   -Initialize amounts for AAP fund.
077300110516           INITIALIZE ln-MfrAmtAAP.
077400110516R38381*               ln-GstAmtAAP
077500110516R38381*               ln-PstAmtAAP.
077600110516      *RFS 34759 - End
077700110516
077800110516      * RFS 79774 - Begin
077900110516           MOVE SPACES TO lc-Acct-Attr.
078000110516           MOVE ZEROES TO ln-Curr-Unit-Bal.
078100110516      * RFS 79774 - end
078200110516
078300110516           IF WS-FIRST-READ-SW IS NOT EQUAL TO "Y"
078400110516             GO TO GCR-0005-BATCH-OPTION
078500110516           END-IF.
078600110516
078700110516           MOVE "N"          TO WS-FIRST-READ-SW.
078800110516           GO TO GCR-0008-BATCH-OPTION.
078900110516
079000110516       GCR-0005-BATCH-OPTION.
079100110516
079200110516           IF COMM-PROCESS-OPTION = "O"
079300110516             MOVE HIGH-VALUES TO CURR-CONTROLS
079400110516             GO TO GCR-EXIT
079500110516           END-IF.
079600110516
079700171029167951     IF lb_IvrAccLvlNo
079800171130
079900110516           READ MFR-PROCESS NEXT RECORD
080000110516           AT END
080100110516             MOVE HIGH-VALUES TO CURR-CONTROLS
080200171130      *RFS167951 Starts
080300171130      *      GO TO GCR-EXIT.
080400171130             GO TO GCR-EXIT
080500171130             END-READ
080600171130           ELSE
080700171130           READ MFR-PROCESS NEXT RECORD
080800171130           AT END
080900171130             PERFORM ACC-IVR-HHLD-TOT-MFR-PROCESS
081000171130             SET lb_IvrAccLvlNo TO TRUE
081100171130             GO TO INT-001
081200171130           END-READ
081300171130           END-IF.
081400171130      *RFS167951 Ends
081500110516
081600110516       GCR-0008-BATCH-OPTION.
081700110516
081800110516           IF COMM-PROCESS-OPTION = "O"
081900110516             GO TO GCR-0008-ON-LINE-OPTION
082000110516           END-IF.
082100110516
082200110516           IF MIN-DATE OF MFR-PROCESS      = 0   OR
082300110516              MAX-DATE OF MFR-PROCESS      = 0   OR
082400110516              FROM-DATE OF MFR-PROCESS     = 0   OR
082500110516              TO-DATE OF MFR-PROCESS       = 0   OR
082600110516              DAYS-IN-RANGE OF MFR-PROCESS < 1   OR
082700110516              DAYS-IN-RANGE OF MFR-PROCESS > 185
082800110516             MOVE "51"       TO WS-REJECTION-CODE
082900110516             PERFORM REJECTION-ROUTINE
083000110516             GO TO GCR-0005-BATCH-OPTION
083100110516           END-IF.
083200110516
083300110516
083400110516           MOVE MFR-SCHEDULE-CODE OF MFR-PROCESS
083500171130                             TO WS-MFR-SCHEDULE.
083600110516           MOVE FROM-DATE OF MFR-PROCESS
083700110516                             TO WS-QFROM-N.
083800110516           MOVE TO-DATE OF MFR-PROCESS
083900110516                             TO WS-QTO-N.
084000110516
084100110516           MOVE ACCOUNT-NO OF MFR-PROCESS
084200171130167951*                      TO ACCOUNT-NO OF ACCOUNT-INVESTMENT.
084300171130167951                       TO ACCOUNT-NO OF ACCOUNT-INVESTMENT
084400171011167951                       ln_AccountNo.
084500171130      *RFS167951 Starts
084600171130           MOVE MFR-GROUP-CODE OF MFR-PROCESS
084700171130                               TO lc_MFR_Grp_code.
084800171011
084900171130           MOVE INVESTMENT-CODE OF MFR-PROCESS
085000171130                                TO lc_InvestmentCode.
085100110516
085200171130           PERFORM GET-OVER-RIDE-MFR-SCHD-CODE.
085300171130      *RFS167951 Ends
085400171030
085500110516      *RFS 34759 - Start
085600171011167951     IF lb_IvrAccLvlNo
085700110516           PERFORM Get-Product-Type-Rule
085800171011167951     END-IF.
085900171011
086000110516           IF NOT lc-Phantom
086100110516              MOVE Investment-Code OF Mfr-Process
086200110516                TO Investment-Code OF Account-Investment
086300110516              GO TO GCR-0009
086400110516           END-IF.
086500110516
086600110516           IF lc-Phantom
086700110516      *RFS 38381 - Begin
086800110516              PERFORM INIT-ARRAY-AMT
086900110516              VARYING TOT-IDX  FROM 1 BY 1
087000110516              UNTIL TOT-IDX  IS GREATER THAN BUDMAX
087100110516      *RFS 38381 - End
087200110516              MOVE Investment-Code OF MFR-Process
087300110516                TO lc-InvestmentCodeAAP
087400110516              PERFORM Get-Holding-Fund-Start
087500110516              PERFORM Get-Next-Holding-Fund
087600110516           END-IF.
087700110516
087800110516       GCR-0008-BATCH-OPTION-01.
087900110516           IF lb-EOFHoldingFalse
088000110516              IF lc-InvestmentCodeAAH NOT = " "
088100110516                 MOVE lc-InvestmentCodeAAH
088200110516                   TO Investment-Code OF Account-Investment
088300110516                 GO TO GCR-0009
088400110516              ELSE
088500110516                 PERFORM Get-Next-Holding-Fund
088600110516                 GO TO GCR-0008-BATCH-OPTION-01
088700110516              END-IF
088800110516           END-IF.
088900110516           IF lb-EOFHoldingTrue
089000110516              GO TO GCR-9999
089100110516           END-IF.
089200110516      *RFS 34759 - End
089300110516
089400110516           GO TO GCR-0009.
089500110516
089600110516       GCR-0008-ON-LINE-OPTION.
089700110516
089800110516           IF COMM-FROM-DATE               = 0   OR
089900110516              COMM-TO-DATE                 = 0
090000110516             MOVE "51"       TO WS-REJECTION-CODE
090100110516             PERFORM REJECTION-ROUTINE
090200110516             GO TO GCR-0005-BATCH-OPTION
090300110516           END-IF.
090400110516
090500110516
090600110516           MOVE COMM-MFR-SCHEDULE
090700110516                             TO WS-MFR-SCHEDULE.
090800110516           MOVE COMM-FROM-DATE
090900110516                             TO WS-QFROM-N.
091000110516           MOVE COMM-TO-DATE TO WS-QTO-N.
091100110516
091200110516           MOVE COMM-ACCOUNT-NO
091300110516                             TO ACCOUNT-NO OF ACCOUNT-INVESTMENT.
091400110516
091500110516      *RFS 34759 - Start
091600110516           PERFORM Get-Product-Type-Rule
091700110516           IF NOT lc-Phantom
091800110516              MOVE Comm-Investment-Code
091900110516                TO Investment-Code OF Account-Investment
092000110516              GO TO GCR-0009
092100110516           END-IF.
092200110516
092300110516           IF lc-Phantom
092400110516      *RFS 38381 - Begin
092500110516              PERFORM INIT-ARRAY-AMT
092600110516              VARYING TOT-IDX  FROM 1 BY 1
092700110516              UNTIL TOT-IDX  IS GREATER THAN BUDMAX
092800110516      *RFS 38381 - End
092900110516              MOVE Comm-Investment-Code
093000110516                TO lc-InvestmentCodeAAP
093100110516              PERFORM Get-Holding-Fund-Start
093200110516              PERFORM Get-Next-Holding-Fund
093300110516           END-IF.
093400110516
093500110516       GCR-0008-ON-LINE-OPTION-01.
093600110516           IF lb-EOFHoldingFalse
093700110516              IF lc-InvestmentCodeAAH NOT = " "
093800110516                 MOVE lc-InvestmentCodeAAH
093900110516                   TO Investment-Code OF Account-Investment
094000110516                 GO TO GCR-0009
094100110516              ELSE
094200110516                 PERFORM Get-Next-Holding-Fund
094300110516                 GO TO GCR-0008-ON-LINE-OPTION-01
094400110516              END-IF
094500110516           END-IF.
094600110516           IF lb-EOFHoldingTrue
094700110516              GO TO GCR-9999
094800110516           END-IF.
094900110516      *RFS 34759 - End
095000110516
095100110516       GCR-0009.
095200110516      * RFS 79774 - Begin
095300110516
095400110516           MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT
095500110516             TO ln-Acct-No.
095600110516
095700110516           EXEC SQL
095800110516             SELECT COALESCE(ACATP.ACCOUNT_ATTRIBUTE_CODE, " ")
095900110516                INTO :lc-Acct-Attr
096000110516                FROM MFAACCATP ACATP
096100110516             WHERE ACATP.ACCOUNT_NO = :ln-Acct-No AND
096200110516                   ACATP.ACCOUNT_ATTRIBUTE_CODE = "BYMFR"
096300110516           END-EXEC.
096400110516      * RFS 79774 - end
096500110516
096600110516           READ  ACCOUNT-INVESTMENT
096700110516           INVALID KEY
096800110516             MOVE "50"       TO WS-REJECTION-CODE
096900110516             PERFORM REJECTION-ROUTINE
097000110516             GO TO GCR-0005-BATCH-OPTION.
097100110516
097200110516       GCR-0010.
097300110516
097400110516           SET BUDIDX        TO 1.
097500110516           SET BUDIDX2       TO 1.
097600110516R79774*    SET BUDIDX2       DOWN BY 1.
097700110516
097800110516           SEARCH WS-B-INVESTMENT-ENTRY VARYING BUDIDX2
097900110516           WHEN WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2) IS EQUAL
098000110516           INVESTMENT-CODE OF ACCOUNT-INVESTMENT
098100110516             SET BUDIDX2SV   TO BUDIDX2
098200110516             GO TO GCR-INVESTMENT-FOUND.
098300110516
098400110516           MOVE "04"         TO WS-REJECTION-CODE.
098500110516           PERFORM REJECTION-ROUTINE.
098600110516           GO TO GCR-0005-BATCH-OPTION.
098700110516
098800110516
098900110516       GCR-INVESTMENT-FOUND.
099000110516
099100110516      ** ESTABLISH STARTING BALANCE
099200110516
099300110516           MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT
099400110516                             TO ACCOUNT-NO OF TRANS.
099500110516           MOVE INVESTMENT-CODE OF ACCOUNT-INVESTMENT
099600110516                             TO INVESTMENT-CODE OF TRANS.
099700110516           MOVE WS-QFROM-N   TO PROCESS-DATE OF TRANS.
099800110516
099900110516           MOVE ZEROS        TO TRANS-PROC-SEQ-NO OF TRANS.
100000110516
100100110516           MOVE "N"          TO WS-SAME-BALANCE.
100200110516R79774     MOVE ZEROS        TO WS-AVG-UNIT-COST.
100300110516
100400110516      * RFS 79774 - Begin
100500110516           MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT
100600110516             TO ln-Curr-Unit-Bal.
100700110516      * RFS 79774 - End
100800110516
100900110516           START TRANS
101000110516           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
101100110516           INVALID KEY
101200110516             MOVE "Y"        TO WS-SAME-BALANCE
101300110516             MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT
101400110516                             TO WS-OPENING-BALANCE
101500110516R79774       MOVE AVERAGE-UNIT-COST OF ACCOUNT-INVESTMENT
101600110516R79774                       TO WS-AVG-UNIT-COST
101700110516      *RFS 34759 - Start
101800110516      *    GO TO GCR-EXIT.
101900110516           GO TO GCR-9999.
102000110516      *RFS 34759 - End
102100110516
102200110516       GCR-NEXT-TRANS.
102300110516
102400110516           READ TRANS NEXT RECORD
102500110516           AT END
102600110516             MOVE "Y"        TO WS-SAME-BALANCE
102700110516             MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT
102800110516                             TO WS-OPENING-BALANCE
102900110516R79774       MOVE AVERAGE-UNIT-COST OF ACCOUNT-INVESTMENT
103000110516R79774                       TO WS-AVG-UNIT-COST
103100110516
103200110516      *RFS 34759 - Start
103300110516      *      GO TO GCR-EXIT.
103400110516             GO TO GCR-9999.
103500110516      *RFS 34759 - End
103600110516
103700110516           MOVE TRANS-TYPE-CODE OF TRANS
103800110516                             TO WS-TRANS-TYPE-88.
103900110516
104000110516           MOVE TRANS-STATUS-CODE OF TRANS
104100110516                             TO WS-TRANS-STATUS-88.
104200110516
104300110516      *RFS 49476 - Start
104400110516           MOVE REVERSE OF TRANS TO lc-Reverse.
104500110516
104600110516      *    IF NOT HISTORY AND NOT REVERSAL
104700110516           IF NOT HISTORY
104800110516              GO TO GCR-NEXT-TRANS
104900110516           END-IF.
105000110516
105100110516           IF lc-Reverse-Y
105200110516      *RFS 49476 - End
105300110516              GO TO GCR-NEXT-TRANS
105400110516           END-IF.
105500110516
105600110516      ** TRANS NOT FOR THIS ACCOUNT INVESTMENT
105700110516
105800110516           IF ACCOUNT-NO OF TRANS IS NOT EQUAL
105900110516           ACCOUNT-NO OF ACCOUNT-INVESTMENT OR
106000110516           INVESTMENT-CODE OF TRANS IS NOT EQUAL
106100110516           INVESTMENT-CODE OF ACCOUNT-INVESTMENT
106200110516             MOVE "Y"        TO WS-SAME-BALANCE
106300110516             MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT
106400110516                             TO WS-OPENING-BALANCE
106500110516R79774       MOVE AVERAGE-UNIT-COST OF ACCOUNT-INVESTMENT
106600110516R79774                       TO WS-AVG-UNIT-COST
106700110516      *RFS 34759 - Start
106800110516      *      GO TO GCR-EXIT
106900110516             GO TO GCR-9999
107000110516      *RFS 34759 - End
107100110516           END-IF.
107200110516
107300110516      ** TRANS OCCURRED AFTER QUARTER - CALCULATE BALANCE
107400110516
107500110516           IF PROCESS-DATE OF TRANS IS GREATER THAN
107600110516           WS-QTO-N
107700110516             MOVE "Y"        TO WS-SAME-BALANCE
107800110516           END-IF.
107900110516
108000110516           IF (REDEMPTION AND HISTORY)
108100110516           OR (NOT REDEMPTION AND REVERSAL)
108200110516             ADD UNIT-AMT OF TRANS,
108300110516             CLOSING-UNIT-BAL OF TRANS,
108400110516                             GIVING WS-OPENING-BALANCE
108500110516R79774       MOVE AVERAGE-UNIT-COST OF TRANS
108600110516R79774         TO Ws-Avg-Unit-Cost
108700110516           ELSE
108800110516             SUBTRACT UNIT-AMT OF TRANS
108900110516             FROM CLOSING-UNIT-BAL OF TRANS
109000110516                             GIVING WS-OPENING-BALANCE
109100110516R79774       MOVE AVERAGE-UNIT-COST OF TRANS
109200110516R79774         TO Ws-Avg-Unit-Cost
109300110516R79774       IF AVERAGE-UNIT-COST OF TRANS  = 0
109400110516R79774*         WS-SAME-BALANCE IS EQUAL TO "N"
109500110516R79774          MOVE RESULTANT-AVERAGE-UNIT-COST OF TRANS
109600110516R79774            TO Ws-Avg-Unit-Cost
109700110516R79774       END-IF
109800110516           END-IF.
109900110516
110000110516      *RFS 34759 - Start
110100110516       GCR-9999.
110200110516      *Process holding funds one by one for a phantom fund.
110300110516           IF lc-Phantom AND lb-EOFHoldingFalse
110400110516              PERFORM Detail-Processing
110500110516              PERFORM Get-Next-Holding-Fund
110600110516              IF Comm-Process-Option = "O"
110700110516                 GO TO GCR-0008-ON-LINE-OPTION-01
110800110516              ELSE
110900110516                 GO TO GCR-0008-BATCH-OPTION-01
111000110516              END-IF
111100110516           END-IF.
111200110516      *RFS 34759 - End
111300110516
111400110516       GCR-EXIT.
111500110516           EXIT.
111600110516      /
111700110516       DETAIL-PROCESSING SECTION.
111800110516
111900110516           SET BUDIDX2 TO BUDIDX2SV.
112000110516
112100110516      ** INITIALIZE ARRAY
112200110516
112300110516           PERFORM INIT-ARRAY
112400110516           VARYING TRNIDX FROM 1 BY 1
112500110516           UNTIL TRNIDX IS GREATER THAN BUDMAX.
112600110516
112700110516           PERFORM LOAD-MFR-SCHEDULE-ARRAY.
112800110516
112900110516      *    Search for the start date
113000110516           SET BUDIDX TO 1.
113100110516           SET BUDIDX DOWN BY 1.
113200110516
113300110516           SET BUDIDX UP BY 1.
113400110516           SEARCH WS-B-BUSINESS-DAY-ENTRY VARYING BUDIDX
113500110516           WHEN WS-B-DATE(BUDIDX) = WS-QFROM-N
113600110516             SET TIDXFROM    TO BUDIDX.
113700110516
113800110516      *    Search for the end date
113900110516           SET BUDIDX TO 1.
114000110516           SET BUDIDX DOWN BY 1.
114100110516
114200110516           SET BUDIDX UP BY 1.
114300110516           SEARCH WS-B-BUSINESS-DAY-ENTRY VARYING BUDIDX
114400110516           WHEN WS-B-DATE(BUDIDX) = WS-QTO-N
114500110516             SET TIDXTO      TO BUDIDX.
114600110516
114700110516      * SAME BALANCE PROCESSING
114800110516
114900110516           IF WS-SAME-BALANCE IS NOT EQUAL TO "Y"
115000110516             GO TO DPR-DAY-BY-DAY
115100110516           END-IF.
115200110516
115300110516           SET BUDIDX TO TIDXFROM.
115400110516           SET BUDIDX DOWN BY 1.
115500110516
115600110516       DPR-SAME-BALANCE.
115700110516
115800110516           SET BUDIDX UP BY 1.
115900110516           SET TRNIDX TO BUDIDX.
116000110516
116100110516      * RFS49699 - Array logging logic
116200110516
116300110516           IF TRNIDX  > WS-ARRAY1-MAX-USED
116400110516               MOVE TRNIDX                 TO WS-ARRAY1-MAX-USED
116500110516           END-IF.
116600110516
116700110516      * RFS49699 - End
116800110516
116900110516      * RFS79774 - START
117000110516
117100110516           IF (MfrEfs-Exist AND
117200110516              ln-Curr-Unit-Bal IS EQUAL ZEROES) OR
117300110516              ByMfr-Attr
117400110516              MOVE ZEROES TO Ws-Opening-Balance
117500110516           END-IF.
117600110516
117700110516           IF WS-T-AVG-UNIT-COST(TRNIDX)  NOT = 0
117800110516             MOVE WS-T-AVG-UNIT-COST(TRNIDX) TO WS-AVG-UNIT-COST
117900110516           END-IF
118000110516           MOVE WS-AVG-UNIT-COST  TO WS-T-AVG-UNIT-COST(TRNIDX)
118100171011
118200171130      *RFS167951 Starts
118300210623      *RFS186019 - Start
118400210623      *    IF (lc_ABRule = "2" OR lc_ABRule = "3") AND
118500210623           IF (lc_ABRule = "2" OR lc_ABRule = "3"
118600210623                  OR lc_ABRule = "4") AND
118700210623      *RFS186019 - End
118800171130              WS-B-CURR(BUDIDX, BUDIDX2) NOT= lc_BaseCurrency
118900180128177476     AND lc_SameCurr = "N"
119000171130              COMPUTE WS-T-MV(TRNIDX) ROUNDED =
119100171130              WS-OPENING-BALANCE * WS-B-PRICE(BUDIDX, BUDIDX2) /
119200171130              WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
119300171130              COMPUTE WS-T-BV(TRNIDX) ROUNDED =
119400171130              WS-OPENING-BALANCE * WS-T-AVG-UNIT-COST(TRNIDX) /
119500171130              WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
119600171130           ELSE
119700171130      *RFS167951 Ends
119800110516           COMPUTE WS-T-MV(TRNIDX) ROUNDED =
119900110516             WS-OPENING-BALANCE * WS-B-PRICE(BUDIDX, BUDIDX2)
120000110516           COMPUTE WS-T-BV(TRNIDX) ROUNDED =
120100110516             WS-OPENING-BALANCE * WS-T-AVG-UNIT-COST(TRNIDX)
120200171011167951     END-IF.
120300110516      * For Online processing
120400110516           IF COMM-PROCESS-OPTION = "O"
120500110516              MOVE WS-T-MV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
120600110516           ELSE
120700171011
120800171011
120900110516      * For Batch  processing
121000110516              IF QUALIFY-ON OF MFR-PROCESS = LNC-A
121100110516                 IF WS-T-MV(TRNIDX) >= WS-T-BV(TRNIDX)
121200110516                    MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
121300110516                 ELSE
121400110516                    MOVE WS-T-BV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
121500110516                 END-IF
121600110516              END-IF
121700110516              IF QUALIFY-ON OF MFR-PROCESS = LNC-B
121800110516                 MOVE WS-T-BV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
121900110516              END-IF
122000110516
122100110516              IF QUALIFY-ON OF MFR-PROCESS = LNC-M
122200110516                 MOVE WS-T-MV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
122300110516              END-IF
122400110516           END-IF.
122500110516
122600110516      * RFS79774 - END
122700110516R79774*    COMPUTE WS-T-UNIT-VALUE(TRNIDX) ROUNDED =
122800110516R79774*    WS-OPENING-BALANCE * WS-B-PRICE(BUDIDX, BUDIDX2).
122900110516           MOVE WS-OPENING-BALANCE
123000110516                             TO WS-T-UNIT-BALANCE(TRNIDX).
123100110516
123200110516           MOVE WS-B-DATE(BUDIDX) TO WS-T-DATE(TRNIDX).
123300110516           MOVE WS-B-PRICE(BUDIDX, BUDIDX2) TO WS-T-PRICE(TRNIDX).
123400110516           MOVE WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2) TO
123500110516                                 WS-T-INVESTMENT-CODE(TRNIDX).
123600110516
123700171130      *RFS167951 Starts
123800171130           INITIALIZE ln_InvAssetAmt,
123900171130                      ld_TradeDte,
124000171130                      ln_InvMarketValue.
124100171130
124200171130           MOVE WS-T-DATE(TRNIDX)       TO ld_TradeDte
124300210630      *RFS186019 - Starts
124400210630            IF  (lc_ABRule = "2" OR lc_ABRule = "3" OR lc_ABRule = "4")
124500210630                 PERFORM GET-TOTAL-ASSET-MFR-AMOUNT
124600210630                IF  lc_RegrAccrFlag = "Y" AND
124700210706                      ((ld_TradeDte <= ln_LastPaymentDate
124800210706                        AND ln_LastPaymentDate
124900210706                            NOT EQUAL ZEROES)
125000210701                        OR ln_EligibleForCalc    = "N")
125100210630                     GO TO DPR-SKIP1-NO-RATE
125200210630                 END-IF
125300210630            END-IF
125400210630      *RFS186019 - End
125500171130
125600171130           IF (lc_ABRule = "2" OR
125700210623      *RFS186019 - Start
125800210623               lc_ABRule = "4" OR
125900210623      *RFS186019 - End
126000171130              lc_ABRule = "3") AND
126100171130              lb_IvrAccLvlYes
126200171130               MOVE WS-T-UNIT-VALUE(TRNIDX) TO ln_InvAssetAmt
126300171130               MOVE WS-T-MV(TRNIDX)         TO ln_InvMarketValue
126400171130               PERFORM INSERT-TMPACCINV
126500171130                GO TO DPR-SKIP1-NO-RATE
126600171130            ELSE
126700171130              CONTINUE
126800171130           END-IF
126900210623      *RFS186019 - Start
127000210701      *    IF  (lc_ABRule = "2" OR lc_ABRule = "3")
127100210701      *         PERFORM GET-TOTAL-ASSET-MFR-AMOUNT
127200210701      *    END-IF
127300210628      *RFS186019 - End
127400171130      *RFS167951 Ends
127500110516      *    Search for the MFR schedule rate
127600110516
127700210714      *RFS186019 - Start
127800210716           INITIALIZE ln_TotAssetsAmt_A
127900210714           COMPUTE ln_TotAssetsAmt_A = ln_TotAssetsAmt
128000210714           IF  (lc_ABRule = "3" OR lc_ABRule = "4")
128100210714               COMPUTE ln_TotAssetsAmt_A = ln_TotAssetsAmt
128200210714                                    + ln_SecondaryAssetsAmt
128300210714           END-IF
128400210714      *RFS186019 - End
128500210714
128600110516           MOVE ZEROS        TO WS-RATE.
128700110516           SET MSIDX TO 1.
128800110516R79774*    SET MSIDX DOWN BY 1.
128900171130      *RFS167951 Starts
129000171130           IF  (lc_ABRule = "2" OR
129100210623      *RFS186019 - Start
129200210623               lc_ABRule = "4" OR
129300210623      *RFS186019 - End
129400171130               lc_ABRule = "3")
129500171130             SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
129600171130             WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
129700210623      *RFS186019 - Start
129800210623      *      AND WS-M-UPPER-LIMIT(MSIDX) >= ln_TotAssetsAmt
129900210623             AND WS-M-UPPER-LIMIT(MSIDX) >= ln_TotAssetsAmt_A
130000210623      *RFS186019 - End
130100171130             MOVE WS-M-RATE(MSIDX) TO WS-RATE
130200171130             WHEN WS-M-SCHEDULE(MSIDX) = SPACES
130300171130             GO TO DPR-SKIP1-NO-RATE
130400171130           ELSE
130500171130      *RFS167951 Ends
130600110516           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
130700110516           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
130800110516            AND WS-M-UPPER-LIMIT(MSIDX) >= WS-T-UNIT-VALUE(TRNIDX)
130900110516              MOVE WS-M-RATE(MSIDX) TO WS-RATE
131000110516           WHEN WS-M-SCHEDULE(MSIDX) = SPACES
131100171130167951*       GO TO DPR-SKIP1-NO-RATE.
131200171130167951        GO TO DPR-SKIP1-NO-RATE
131300171011167951     END-IF.
131400171011
131500110516       DPR-SAME-BALANCE-CALC.
131600110516
131700110516           MOVE WS-RATE      TO WS-T-MFR-RATE(TRNIDX).
131800110516      *RFS 34759 - Start
131900110516RF4697*    IF WS-MCO = "BTG" AND GRADUATED-SCHEDULE
132000110516           PERFORM Get-MFR-Calc-Ind.
132100110516           IF lc-MFRCalcInd = lnc-G
132200110516      *RFS 34759 - End
132300110516      * RFS 79774 - begin
132400110516RF4697*       PERFORM GRADUATED-CALCULATION THRU GC-EXIT
132500171130      *RFS167951 Starts
132600171011RF4697*       PERFORM GRADUATED-CALCULATION
132700171030            IF (lc_ABRule = "2" OR
132800171030               lc_ABRule = "3")
132900171011               COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
133000171011               (ln_TotMFRAMt *
133100171130               (WS-T-MV(TRNIDX)/ ln_TotMarketValue))
133200171011            ELSE
133300171011               PERFORM GRADUATED-CALCULATION
133400171011            END-IF
133500210623      *RFS186019 - Start
133600210623           ELSE
133700210623           IF lc-MFRCalcInd = lnc-T
133800210623               COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED  =
133900210623                 (WS-T-UNIT-VALUE(TRNIDX)/ ln_TotAssetsAmt
134000210630               * (ln_TotAssetsAmt   - WS-M-LOWER-LIMIT(MSIDX))
134100210623               *  WS-RATE / 100 / WS-DAYS-IN-YEAR )
134200210716           ELSE
134300210716           IF lc-MFRCalcInd = lnc-S
134400210801               COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED  =
134500210801              (WS-T-UNIT-VALUE(TRNIDX) * WS-RATE / 100 /
134600210801               WS-DAYS-IN-YEAR )
134700210623      *RFS186019 - End
134800171130      *RFS167951 Ends
134900110516      * RFS 79774 - end
135000110516RF4697     ELSE
135100110516      *RFS 79774 - Defect 5
135200110516R79774      MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
135300110516            COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
135400110516            ((WS-T-UNIT-VALUE(TRNIDX) * WS-RATE)/ 100)/
135500110516                                            WS-DAYS-IN-YEAR
135600210623      *RFS186019 - Start
135700210716           END-IF
135800210716           END-IF
135900210623      *RFS186019 - End
136000110516           END-IF.
136100210801      *RFS186019 - Start
136200210801           IF WS-T-MFR-VALUE(TRNIDX) < 0
136300210801              MOVE ZERO   TO WS-T-MFR-VALUE(TRNIDX)
136400210801           END-IF
136500210801      *RFS186019 - End
136600110516
136700180128      *RFS177476-Starts
136800180128           IF WS-B-CURR(BUDIDX, BUDIDX2) NOT= lc_BaseCurrency AND
136900180128              lc_SameCurr = "N"
137000180128              COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
137100180128                      WS-T-MFR-VALUE(TRNIDX)*
137200180128                      WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
137300180128      *RFS177476-Ends
137400110516      *RFS 38381 - Begin
137500110516           IF lc-Phantom
137600110516              MOVE TRNIDX TO ln-Idx
137700110516              SET TOT-IDX TO ln-Idx
137800110516      * RFS49699 - Array logging logic
137900110516
138000110516              IF TOT-IDX          > WS-ARRAY5-MAX-USED
138100110516                  MOVE TOT-IDX                TO WS-ARRAY5-MAX-USED
138200110516              END-IF
138300110516
138400110516      * RFS49699 - End
138500110516              ADD  WS-T-UNIT-VALUE(TRNIDX) TO TOT-AMT(TOT-IDX)
138600110516           END-IF.
138700110516      *RFS 38381 - End
138800110516
138900110516       DPR-SKIP1-NO-RATE.
139000110516
139100110516           IF WS-B-BUDIDX-END(BUDIDX) IS EQUAL "Y"
139200110516             GO TO DPR-END-FEE
139300110516           END-IF.
139400110516
139500110516           IF WS-B-DATE(BUDIDX) IS EQUAL WS-QTO-N
139600110516             GO TO DPR-END-FEE
139700110516           END-IF.
139800110516
139900110516           GO TO DPR-SAME-BALANCE.
140000110516
140100110516       DPR-DAY-BY-DAY.
140200110516
140300110516      ** IF ACTIVITY HAS OCCURED DURING THE QUARTER
140400110516
140500110516           SET BUDIDX TO TIDXFROM.
140600110516R79774*    SET BUDIDX DOWN BY 1.
140700110516
140800110516           SEARCH WS-B-BUSINESS-DAY-ENTRY
140900110516           VARYING BUDIDX
141000110516           WHEN WS-B-DATE(BUDIDX) = PROCESS-DATE OF TRANS
141100110516             SET TRNIDX      TO BUDIDX
141200110516             MOVE CLOSING-UNIT-BAL OF TRANS
141300110516                             TO WS-T-UNIT-BALANCE(TRNIDX)
141400110516R79774       MOVE RESULTANT-AVERAGE-UNIT-COST OF TRANS
141500110516R79774                       TO WS-T-AVG-UNIT-COST(TRNIDX)
141600110516             MOVE "Y"        TO WS-T-UNIT-ADJUST(TRNIDX).
141700110516
141800110516       DPR-NEXT-TRANS.
141900110516
142000110516           READ TRANS NEXT RECORD
142100110516           AT END
142200110516             GO TO DPR-COMPL-ARRAY.
142300110516
142400110516           MOVE TRANS-TYPE-CODE OF TRANS
142500110516                             TO WS-TRANS-TYPE-88.
142600110516
142700110516           MOVE TRANS-STATUS-CODE OF TRANS
142800110516                             TO WS-TRANS-STATUS-88.
142900110516
143000110516      *RFS 49476 - Start
143100110516           MOVE REVERSE OF TRANS TO lc-Reverse.
143200110516
143300110516      *    IF NOT HISTORY AND NOT REVERSAL
143400110516           IF NOT HISTORY
143500110516              GO TO DPR-NEXT-TRANS
143600110516           END-IF.
143700110516
143800110516           IF lc-Reverse-Y
143900110516      *RFS 49476 - End
144000110516              GO TO DPR-NEXT-TRANS
144100110516           END-IF.
144200110516
144300110516           IF ACCOUNT-NO OF TRANS IS NOT EQUAL
144400110516           ACCOUNT-NO OF ACCOUNT-INVESTMENT OR
144500110516           INVESTMENT-CODE OF TRANS IS NOT EQUAL
144600110516           INVESTMENT-CODE OF ACCOUNT-INVESTMENT OR
144700110516           PROCESS-DATE OF TRANS IS GREATER THAN
144800110516           WS-QTO-N
144900110516             GO TO DPR-COMPL-ARRAY
145000110516           END-IF.
145100110516
145200110516           GO TO DPR-DAY-BY-DAY.
145300110516
145400110516       DPR-COMPL-ARRAY.
145500110516
145600110516           SET TRNIDX TO TIDXFROM.
145700110516           SET TRNIDX DOWN BY 1.
145800110516           MOVE WS-OPENING-BALANCE
145900110516                             TO WS-CARRY-FORWARD.
146000110516       DPR-COMP-ARRAY-0010.
146100110516
146200110516           SET TRNIDX UP BY 1.
146300110516
146400110516      * RFS49699 - Array logging logic
146500110516
146600110516           IF TRNIDX           > WS-ARRAY1-MAX-USED
146700110516               MOVE TRNIDX                 TO WS-ARRAY1-MAX-USED
146800110516           END-IF.
146900110516
147000110516      * RFS49699 - End
147100110516
147200110516           IF WS-T-UNIT-ADJUST(TRNIDX) IS NOT EQUAL TO "Y"
147300110516             MOVE WS-CARRY-FORWARD
147400110516                             TO WS-T-UNIT-BALANCE(TRNIDX)
147500110516           ELSE
147600110516             MOVE WS-T-UNIT-BALANCE(TRNIDX)
147700110516                             TO WS-CARRY-FORWARD
147800110516           END-IF.
147900110516      * RFS79774 - START
148000110516           IF (MfrEfs-Exist AND
148100110516              ln-Curr-Unit-Bal IS EQUAL ZEROES) OR
148200110516              ByMfr-Attr
148300110516              MOVE ZEROES TO WS-T-UNIT-BALANCE(TRNIDX)
148400110516           END-IF.
148500110516      * RFS79774 - End
148600110516
148700110516           SET BUDIDX TO TRNIDX.
148800110516      * RFS79774 - START
148900110516           IF WS-T-AVG-UNIT-COST(TRNIDX)  NOT = 0
149000110516             MOVE WS-T-AVG-UNIT-COST(TRNIDX) TO WS-AVG-UNIT-COST
149100110516           END-IF
149200110516           MOVE WS-AVG-UNIT-COST  TO WS-T-AVG-UNIT-COST(TRNIDX)
149300171130      *RFS167951 Starts
149400210623      *RFS186019 - Start
149500210623      *    IF (lc_ABRule = "2" OR lc_ABRule = "3") AND
149600210623           IF (lc_ABRule = "2" OR lc_ABRule = "3"
149700210623                               OR lc_ABRule = "4") AND
149800210623      *RFS186019 - End
149900171130              WS-B-CURR(BUDIDX, BUDIDX2) NOT= lc_BaseCurrency
150000180128177476     AND lc_SameCurr = "N"
150100171130              COMPUTE WS-T-MV(TRNIDX) ROUNDED =
150200171130              WS-T-UNIT-BALANCE(TRNIDX) * WS-B-PRICE(BUDIDX, BUDIDX2) /
150300171130              WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
150400171130              COMPUTE WS-T-BV(TRNIDX) ROUNDED =
150500171130              WS-T-UNIT-BALANCE(TRNIDX) * WS-T-AVG-UNIT-COST(TRNIDX) /
150600171130              WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
150700171130           ELSE
150800171130      *RFS167951 Ends
150900110516           COMPUTE WS-T-MV(TRNIDX) ROUNDED =
151000110516             WS-T-UNIT-BALANCE(TRNIDX) * WS-B-PRICE(BUDIDX, BUDIDX2)
151100110516           COMPUTE WS-T-BV(TRNIDX) ROUNDED =
151200110516             WS-T-UNIT-BALANCE(TRNIDX) * WS-T-AVG-UNIT-COST(TRNIDX)
151300171011167951     END-IF.
151400110516      * For Online processing
151500110516           IF COMM-PROCESS-OPTION = "O"
151600110516              MOVE WS-T-MV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
151700110516           ELSE
151800110516      * For Batch  processing
151900171011
152000171011
152100110516              IF QUALIFY-ON OF MFR-PROCESS = LNC-A
152200110516                 IF WS-T-MV(TRNIDX) >= WS-T-BV(TRNIDX)
152300110516                    MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
152400110516                 ELSE
152500110516                    MOVE WS-T-BV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
152600110516                 END-IF
152700110516              END-IF
152800110516              IF QUALIFY-ON OF MFR-PROCESS = LNC-B
152900110516                 MOVE WS-T-BV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
153000110516              END-IF
153100110516
153200110516              IF QUALIFY-ON OF MFR-PROCESS = LNC-M
153300110516                 MOVE WS-T-MV(TRNIDX) TO  WS-T-UNIT-VALUE(TRNIDX)
153400110516              END-IF
153500110516           END-IF.
153600110516
153700110516      * RFS79774 - END
153800110516R79774*    COMPUTE WS-T-UNIT-VALUE(TRNIDX) ROUNDED =
153900110516R79774*    WS-T-UNIT-BALANCE(TRNIDX) * WS-B-PRICE(BUDIDX, BUDIDX2).
154000110516
154100110516           MOVE WS-B-DATE(BUDIDX) TO WS-T-DATE(TRNIDX).
154200110516           MOVE WS-B-PRICE(BUDIDX, BUDIDX2) TO WS-T-PRICE(TRNIDX).
154300110516           MOVE WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2) TO
154400110516                                 WS-T-INVESTMENT-CODE(TRNIDX).
154500110516
154600171130      *RFS167951 Starts
154700171130           INITIALIZE ln_InvAssetAmt,
154800171130                      ld_TradeDte,
154900171130                      ln_InvMarketValue.
155000171130
155100171130           MOVE WS-T-DATE(TRNIDX)       TO ld_TradeDte
155200210701
155300210701      *RFS186019 - Starts
155400210701            IF  (lc_ABRule = "2" OR lc_ABRule = "3" OR lc_ABRule = "4")
155500210701                 PERFORM GET-TOTAL-ASSET-MFR-AMOUNT
155600210701                IF  lc_RegrAccrFlag = "Y" AND
155700210706                      ((ld_TradeDte <= ln_LastPaymentDate
155800210706                        AND ln_LastPaymentDate
155900210706                        NOT EQUAL ZEROES)
156000210701                        OR ln_EligibleForCalc    = "N")
156100210701                     GO TO DPR-SKIP2-NO-RATE
156200210701                 END-IF
156300210701            END-IF
156400210701      *RFS186019 - End
156500171130
156600171130           IF (lc_ABRule = "2" OR
156700210623      *RFS186019 - Starts
156800210623               lc_ABRule = "4"  OR
156900210623      *RFS186019 - Ends
157000171130              lc_ABRule = "3") AND
157100171130              lb_IvrAccLvlYes
157200171130               MOVE WS-T-UNIT-VALUE(TRNIDX) TO ln_InvAssetAmt
157300171130               MOVE WS-T-MV(TRNIDX)         TO ln_InvMarketValue
157400171130               PERFORM INSERT-TMPACCINV
157500171130                GO TO DPR-SKIP2-NO-RATE
157600171130            ELSE
157700171130              CONTINUE
157800171130           END-IF
157900210623      *RFS186019 - Start
158000210701      *    IF  (lc_ABRule = "2" OR lc_ABRule = "3")
158100210701      *         PERFORM GET-TOTAL-ASSET-MFR-AMOUNT
158200210701      *    END-IF
158300210628      *RFS186019 - End
158400171130      *RFS167951 Ends
158500110516      *    Search for the MFR schedule rate
158600210716      *RFS186019 - Start
158700210716           INITIALIZE ln_TotAssetsAmt_A
158800210714           COMPUTE ln_TotAssetsAmt_A  = ln_TotAssetsAmt
158900210714           IF  (lc_ABRule = "3" OR lc_ABRule = "4")
159000210714                   COMPUTE ln_TotAssetsAmt_A = ln_TotAssetsAmt
159100210714                               + ln_SecondaryAssetsAmt
159200210714           END-IF
159300210714      *RFS186019 - End
159400210714
159500110516           MOVE ZEROS        TO WS-RATE.
159600110516           SET MSIDX TO 1.
159700110516R79774*    SET MSIDX DOWN BY 1.
159800171130      *RFS167951 Starts
159900210623
160000210714      *RFS186019 - Start
160100210623      *    IF  (lc_ABRule = "2" OR lc_ABRule = "3")
160200210623           IF  (lc_ABRule = "2" OR lc_ABRule = "3" OR lc_ABRule = "4")
160300210628      *RFS186019 - End
160400171130             SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
160500171130             WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
160600210628      *RFS186019 - Start
160700210628      *      AND WS-M-UPPER-LIMIT(MSIDX) >= ln_TotAssetsAmt
160800210628             AND WS-M-UPPER-LIMIT(MSIDX) >= ln_TotAssetsAmt_A
160900210628      *RFS186019 - End
161000171130             MOVE WS-M-RATE(MSIDX) TO WS-RATE
161100171130             WHEN WS-M-SCHEDULE(MSIDX) = SPACES
161200171130             GO TO DPR-SKIP2-NO-RATE
161300171130           ELSE
161400171130      *RFS167951 Ends
161500110516           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
161600110516           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
161700210628            AND WS-M-UPPER-LIMIT(MSIDX) >= WS-T-UNIT-VALUE(TRNIDX)
161800110516              MOVE WS-M-RATE(MSIDX) TO WS-RATE
161900110516           WHEN WS-M-SCHEDULE(MSIDX) = SPACES
162000171130167951*       GO TO DPR-SKIP2-NO-RATE.
162100171130167951        GO TO DPR-SKIP2-NO-RATE
162200171011167951     END-IF.
162300110516
162400110516           MOVE WS-RATE      TO WS-T-MFR-RATE(TRNIDX).
162500110516      *RFS 34759 - Start
162600110516RF4697*    IF WS-MCO = "BTG" AND GRADUATED-SCHEDULE
162700110516           PERFORM Get-MFR-Calc-Ind.
162800110516           IF lc-MFRCalcInd = lnc-G
162900110516      *RFS 34759 - End
163000110516      * RFS 79774 - begin
163100110516RF4697*       PERFORM GRADUATED-CALCULATION THRU GC-EXIT
163200171130      *RFS167951 Starts
163300171011RF4697*       PERFORM GRADUATED-CALCULATION
163400171030            IF (lc_ABRule = "2" OR lc_ABRule = "3")
163500171011               COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
163600171011               (ln_TotMFRAMt *
163700171130               (WS-T-MV(TRNIDX)/ ln_TotMarketValue))
163800171011            ELSE
163900171011               PERFORM GRADUATED-CALCULATION
164000171011            END-IF
164100210623      *RFS186019 - Start
164200210623             ELSE
164300210623              IF lc-MFRCalcInd = lnc-T
164400210628                   COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED  =
164500210623                     (WS-T-UNIT-VALUE(TRNIDX)/ ln_TotAssetsAmt
164600210630                   * (ln_TotAssetsAmt - WS-M-LOWER-LIMIT(MSIDX))
164700210623                   *  WS-RATE / 100 / WS-DAYS-IN-YEAR)
164800210716              ELSE
164900210716                IF lc-MFRCalcInd = lnc-S
165000210716                   COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED  =
165100210716                   (WS-T-UNIT-VALUE(TRNIDX) * WS-RATE / 100 /
165200210716                    WS-DAYS-IN-YEAR )
165300210716      *RFS186019 - End
165400171130      *RFS167951 Ends
165500110516      * RFS 79774 - end
165600210716RF4697          ELSE
165700110516      *RFS 79774 - Defect 5
165800210716R79774          MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
165900210716                COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
166000210716                ((WS-T-UNIT-VALUE(TRNIDX) * WS-RATE) / 100) /
166100210716                                           WS-DAYS-IN-YEAR
166200210623      *RFS186019 - Start
166300210716                END-IF
166400210716              END-IF
166500210623      *RFS186019 - End
166600110516           END-IF.
166700210801      *RFS186019 - Start
166800210801           IF WS-T-MFR-VALUE(TRNIDX) < 0
166900210801               MOVE ZERO   TO WS-T-MFR-VALUE(TRNIDX)
167000210801           END-IF
167100210801      *RFS186019 - End
167200180128      *RFS177476-Starts
167300180128           IF WS-B-CURR(BUDIDX, BUDIDX2) NOT= lc_BaseCurrency AND
167400180128              lc_SameCurr = "N"
167500180128              COMPUTE WS-T-MFR-VALUE(TRNIDX) ROUNDED =
167600180128                      WS-T-MFR-VALUE(TRNIDX)*
167700180128                      WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
167800180128      *RFS177476-Ends
167900110516      *RFS 38381 - Begin
168000110516           IF lc-Phantom
168100110516              MOVE TRNIDX TO ln-Idx
168200110516              SET TOT-IDX TO ln-Idx
168300110516      * RFS49699 - Array logging logic
168400110516
168500110516              IF TOT-IDX          > WS-ARRAY5-MAX-USED
168600110516                  MOVE TOT-IDX                TO WS-ARRAY5-MAX-USED
168700110516              END-IF
168800110516
168900110516      * RFS49699 - End
169000110516              ADD  WS-T-UNIT-VALUE(TRNIDX) TO TOT-AMT(TOT-IDX)
169100110516           END-IF.
169200110516      *RFS 38381 - End
169300110516
169400110516       DPR-SKIP2-NO-RATE.
169500110516
169600110516           IF WS-B-DATE(BUDIDX) IS EQUAL WS-QTO-N
169700110516             GO TO DPR-END-FEE
169800110516           END-IF.
169900110516
170000110516           IF WS-B-BUDIDX-END(BUDIDX) IS NOT EQUAL TO "Y"
170100110516             GO TO DPR-COMP-ARRAY-0010
170200110516           END-IF.
170300110516
170400110516       DPR-END-FEE.
170500110516
170600171130      *RFS167951 Starts
170700171130           IF lb_IvrAccLvlYes
170800171130              GO TO DPR-EXIT
170900171130           END-IF.
171000171130      *RFS167951 Ends
171100171011
171200110516      *** SUMMARIZE ACCUMULATED TOTALS
171300110516
171400110516           SET TRNIDX TO TIDXFROM.
171500110516           SET TRNIDX DOWN BY 1.
171600110516
171700110516           MOVE 0            TO WS-TOT-MFR-AMT.
171800110516
171900110516       DPR-SUM-MFR-AMT.
172000110516
172100110516           SET TRNIDX UP BY 1.
172200110516           COMPUTE WS-TOT-MFR-AMT ROUNDED = WS-TOT-MFR-AMT +
172300110516                                   WS-T-MFR-VALUE(TRNIDX).
172400110516           IF TRNIDX < TIDXTO
172500110516             GO TO DPR-SUM-MFR-AMT
172600110516           END-IF.
172700110516
172800110516      *RFS 34759 - Start
172900110516R38381*    IF lc-Phantom
173000110516R38381*       COMPUTE ln-MfrAmtAAP = ln-MfrAmtAAP + WS-TOT-MFR-AMT
173100110516R38381*    END-IF.
173200110516      *RFS 34759 - End
173300110516
17340011051614388  DPR-SUM-TAX-AMT.
173500110516
173600110516R38381     IF LC-PHANTOM
173700110516R38381        PERFORM PHANTOM-FUND-CALCUALTION
173800110516R38381     END-IF.
173900110516
174000110516  ¦        INITIALIZE WS-TXN-SALES-TAX-FIELDS.
174100110516  ¦        MOVE ACCOUNT-NO OF ACCOUNT-INVESTMENT
174200110516  ¦          TO WS-ACCT-NO.
174300110516  ¦
174400110516  ¦        EXEC SQL
174500110516  ¦          WHENEVER SQLERROR CONTINUE
174600110516  ¦        END-EXEC.
174700110516  ¦
174800110516  ¦        EXEC SQL
174900110516  ¦          WHENEVER NOT FOUND CONTINUE
175000110516  ¦        END-EXEC.
175100110516  ¦
175200110516  ¦        EXEC SQL
175300110516  ¦          WHENEVER SQLWARNING CONTINUE
175400110516  ¦        END-EXEC.
175500110516  ¦
17560011051614388      EXEC SQL
175700110516  ¦          DECLARE TAXCUR CURSOR FOR
175800110516  ¦           SELECT C.SALES_TAX_CODE,
175900110516  ¦                  C.PROVINCIAL_TAX_PERCENT,
176000110516  ¦                  C.FEDERAL_TAX_PERCENT,
176100110516  ¦                  C.COMPOUND_TAX
176200110516  ¦            FROM  MFAACCNTP A, MFAIVRP B, MFATRNTXP C
176300110516  ¦           WHERE  A.ACCOUNT_NO      = :WS-ACCT-NO          AND
176400110516  ¦                  B.INVESTOR_NO     = A.INVESTOR_NO        AND
176500110516  ¦                  C.PROVINCE_CODE   = B.PROVINCE_CODE      AND
176600110516  ¦                  C.COUNTRY_CODE    = B.COUNTRY_CODE       AND
17670011051614388                C.TRANS_TYPE_CODE = :WS-MFR-TRANSACTION  AND
176800110516  ¦                  C.DEFAULT_FLAG    = "Y"                  AND
176900110516  ¦                  C.OPTIONAL_TAX    = "N"
177000110516  ¦        END-EXEC.
177100110516  ¦
177200110516  ¦        EXEC SQL
177300110516  ¦          OPEN TAXCUR
17740011051614388      END-EXEC.
177500110516  ¦
177600110516  ¦        EXEC SQL
177700110516  ¦          FETCH TAXCUR INTO :WS-SALES-TAX-CODE,
177800110516  ¦                            :WS-PRV-TAX-RATE,
177900110516  ¦                            :WS-FED-TAX-RATE,
178000110516  ¦                            :WS-COMPOUND-TAX
178100110516  ¦        END-EXEC.
178200110516  ¦
178300110516  ¦        IF SQLCODE = 0 AND WS-SALES-TAX-CODE NOT EQUAL "N"
178400110516  ¦           IF WS-FED-TAX-RATE > 0
178500110516  ¦              COMPUTE WS-GST-AMT ROUNDED =
178600110516  ¦                  (WS-TOT-MFR-AMT * (WS-FED-TAX-RATE / 100))
178700110516  ¦           END-IF
178800110516  ¦
178900110516  ¦           IF WS-PRV-TAX-RATE > 0
179000110516  ¦              IF WS-COMPOUND-TAX  = "Y"
17910011051614388               COMPUTE WS-PST-AMT ROUNDED =
179200110516  ¦                       ((WS-TOT-MFR-AMT      *
179300110516  ¦                         (1 + (WS-FED-TAX-RATE / 100))) *
179400110516  ¦                        (WS-PRV-TAX-RATE / 100))
179500110516  ¦              ELSE COMPUTE WS-PST-AMT ROUNDED =
179600110516  ¦                          (WS-TOT-MFR-AMT * (WS-PRV-TAX-RATE / 100))
179700110516  ¦              END-IF
179800110516  ¦           END-IF
179900110516  ¦
180000110516  ¦           IF WS-SALES-TAX-CODE = "G"
180100110516  ¦              MOVE 0 TO WS-PST-AMT
180200110516  ¦           END-IF
180300110516  ¦
180400110516  ¦           IF WS-SALES-TAX-CODE = "P"
18050011051614388            MOVE 0 TO WS-GST-AMT
180600110516  ¦           END-IF
180700110516
180800110516      *RFS 34759 - Start
180900110516R38381*       IF lc-Phantom
181000110516R38381*          COMPUTE ln-GstAmtAAP = ln-GstAmtAAP + WS-GST-AMT
181100110516R38381*          COMPUTE ln-PstAmtAAP = ln-PstAmtAAP + WS-PST-AMT
181200110516R38381*       END-IF
181300110516      *RFS 34759 - End
181400110516  ¦        END-IF.
181500110516  ¦
181600110516  ¦        EXEC SQL
181700110516  ¦          CLOSE TAXCUR
18180011051614388      END-EXEC.
181900110516
182000110516       DPR-UPDATE-REC.
182100110516
182200110516           IF COMM-PROCESS-OPTION = "O"
182300110516             GO TO DPR-UPDATE-ON-LINE-OPTION
182400110516           END-IF.
182500110516
182600110516           MOVE "00"         TO REJECTION-CODE OF MFR-PROCESS.
182700110516           MOVE 0            TO GROSS-AMT OF MFR-PROCESS
182800110516                                PST-AMT   OF MFR-PROCESS
182900110516                                GST-AMT   OF MFR-PROCESS.
183000110516
183100110516      *RFS 34759 - Start
183200110516      *Keep existing calculation for non phantom fund.
183300110516           IF NOT lc-Phantom
18340011051614388      COMPUTE PST-AMT   OF MFR-PROCESS ROUNDED =
183500110516  ¦                PST-AMT   OF MFR-PROCESS +  WS-PST-AMT
183600110516  ¦
183700110516  ¦        COMPUTE GST-AMT   OF MFR-PROCESS ROUNDED =
18380011051614388              GST-AMT   OF MFR-PROCESS +  WS-GST-AMT
183900110516
184000110516           COMPUTE GROSS-AMT OF MFR-PROCESS ROUNDED =
184100110516                   GROSS-AMT OF MFR-PROCESS +
18420011051614388              PST-AMT   OF MFR-PROCESS + GST-AMT OF MFR-PROCESS +
184300110516                   WS-TOT-MFR-AMT
184400110516           END-IF.
184500110516
184600110516      *Add logic to calculate for phantom fund.
184700110516           IF lc-Phantom
184800110516              COMPUTE Pst-Amt   OF Mfr-Process ROUNDED =
184900110516                      WS-PST-AMT
185000110516
185100110516              COMPUTE Gst-Amt   OF Mfr-Process ROUNDED =
185200110516                      WS-GST-AMT
185300110516
185400110516              COMPUTE Gross-Amt OF Mfr-Process ROUNDED =
185500110516                      WS-PST-AMT               +
185600110516                      WS-GST-AMT               +
185700110516                      WS-TOT-MFR-AMT
185800110516           END-IF.
185900110516      *RFS 34759 - End
186000110516
186100110516      *RFS 34759 - Start
186200110516      *    REWRITE MFR-PROCESS-REC.
186300110516           REWRITE MFR-PROCESS-REC
186400110516           INVALID KEY
186500110516             CONTINUE.
186600110516      *RFS 34759 - End
186700210623      *RFS186019 - Start
186800210716           MOVE 0  TO li_GROSS_AMT_MFR
186900210716                      li_PST_AMT_MFR
187000210716                      li_GST_AMT_MFR.
187100210716           PERFORM UPDATE-MFAACCMFP.
187200210716
187300210716       UPDATE-MFAACCMFP.
187400210716
187500210716           INITIALIZE lc-ProcessDate.
187600210716           CALL "RTVPRCDTP" USING lc-ProcessDate.
187700210716           MOVE lc-ProcessDate TO
187800210716                lc-ProcessDate-N.
187900210716
188000210716           MOVE GROSS-AMT OF MFR-PROCESS-REC
188100210716                 TO  li_GROSS_AMT_MFR
188200210716           MOVE PST-AMT   OF MFR-PROCESS-REC
188300210716                 TO li_PST_AMT_MFR
188400210716           MOVE GST-AMT   OF MFR-PROCESS-REC
188500210716                 TO li_GST_AMT_MFR
188600210716
188700210716           EXEC SQL
188800210716             UPDATE MFAACCMFP
188900210716               SET MFR_ACCRUED_AMOUNT    = :li_GROSS_AMT_MFR
189000210716                  ,PST_AMT               = :li_PST_AMT_MFR
189100210716                  ,GST_AMT               = :li_GST_AMT_MFR
189200210716                  ,LAST_ACCRUAL_DATE     = :lc-ProcessDate-N
189300210716                  ,HHLD_ACCRUED_AMOUNT   = :ln_TotAssetsAmt
189400210716                 WHERE  ACCOUNT_NO       = :ln_AccountNo
189500210716                 AND    INVESTMENT_CODE  = :lc_InvestmentCode
189600210716                 AND    MFR_GROUP_CODE   = :lc_MFR_Grp_code
189700210716           END-EXEC.
189800210716
189900210716           MOVE SQLSTATE  TO SW-SQL-STATES.
190000210716           EVALUATE TRUE
190100210716            WHEN SW-SQL-SUCCESSFUL OR SW-SQL-WARNING
190200210716                CONTINUE
190300210719                GO TO DPR-EXIT
190400210716            WHEN SW-SQL-END
190500210716                PERFORM INSERT-MFAACCMFP
190600210716            WHEN OTHER
190700210716               SET lncc_Err-20         TO TRUE
190800210716               MOVE lc_ErrCodeDescr20  TO lc_sqlErrShortDESCR
190900210716            END-EVALUATE.
191000210716
191100210716       INSERT-MFAACCMFP.
191200210716
191300210716           EXEC SQL
191400210716             INSERT
191500210716               INTO   MFAACCMFP
191600210716                  (  ACCOUNT_NO,
191700210716                     INVESTMENT_CODE,
191800210716                     MFR_GROUP_CODE,
191900210716                     MFR_ACCRUED_AMOUNT,
192000210716                     PST_AMT,
192100210716                     GST_AMT,
192200210716                     LAST_ACCRUAL_DATE,
192300210716                     HHLD_ACCRUED_AMOUNT)
192400210716             VALUES
192500210716                  ( :ln_AccountNo,
192600210716                    :lc_InvestmentCode,
192700210716                    :lc_MFR_Grp_code,
192800210716                    :li_GROSS_AMT_MFR,
192900210716                    :li_PST_AMT_MFR,
193000210716                    :li_GST_AMT_MFR,
193100210716                    :lc-ProcessDate-N,
193200210716                    :ln_TotAssetsAmt  )
193300210716           END-EXEC.
193400210716           MOVE SQLSTATE  TO SW-SQL-STATES.
193500210716           EVALUATE TRUE
193600210716            WHEN SW-SQL-SUCCESSFUL OR SW-SQL-WARNING
193700210716                CONTINUE
193800210716            WHEN OTHER
193900210716               SET lncc_Err-21         TO TRUE
194000210716               MOVE lc_ErrCodeDescr21  TO lc_sqlErrShortDESCR
194100210716            END-EVALUATE.
194200210623      *RFS186019 - End
194300110516           GO TO DPR-EXIT.
194400110516
194500110516       DPR-UPDATE-ON-LINE-OPTION.
194600110516
194700110516           MOVE "00"         TO COMM-REJECTION-CODE.
194800110516           MOVE 0            TO COMM-CALCULATED-AMT.
194900110516           MOVE 0            TO COMM-PST-AMT
195000110516                                COMM-GST-AMT.
195100110516
195200110516      *RFS 34759 - Start
195300110516      *Keep existing calculation for non phantom fund.
195400110516           IF NOT lc-phantom
19550011051614388      COMPUTE COMM-PST-AMT  ROUNDED =
195600110516  ¦                COMM-PST-AMT + WS-PST-AMT
195700110516  ¦
195800110516  ¦        COMPUTE COMM-GST-AMT  ROUNDED =
19590011051614388              COMM-GST-AMT + WS-GST-AMT
196000110516
196100110516           COMPUTE COMM-CALCULATED-AMT ROUNDED =
196200110516                   COMM-CALCULATED-AMT +
19630011051614388              COMM-PST-AMT + COMM-GST-AMT  +
196400110516                   WS-TOT-MFR-AMT
196500110516           END-IF.
196600110516
196700110516      *Add logic to calculate for phantom fund.
196800110516           IF lc-phantom
196900110516              COMPUTE Comm-Pst-Amt  ROUNDED =
197000110516R38381                WS-PST-AMT
197100110516
197200110516              COMPUTE Comm-Gst-Amt  ROUNDED =
197300110516R38381                WS-GST-AMT
197400110516
197500110516              COMPUTE Comm-Calculated-Amt ROUNDED =
197600110516                      WS-PST-AMT + WS-GST-AMT  +
197700110516R38381                WS-TOT-MFR-AMT
197800110516           END-IF.
197900110516
198000110516      *RFS 34759 - End
198100110516       DPR-EXIT.
198200110516           EXIT.
198300110516
198400110516      * RFS 79774 - begin
198500110516RF4697*GRADUATED-CALCULATION.
198600110516RF4697 GRADUATED-CALCULATION SECTION.
198700110516      * RFS 79774 - end
198800110516RF4697*    MOVE WS-T-UNIT-VALUE(TRNIDX) TO WS-UNIT-VALUE.
198900110516R79774     MOVE WS-T-MV(TRNIDX)    TO WS-UNIT-VALUE.
199000110516RF4697*    Search for the MFR schedule rate
199100110516RF4697
199200110516RF4697 GC-NEXT-TIER.
199300110516RF4697     SET MSIDX TO 1.
199400110516      * RFS 79774 - Begin
199500110516RF4697*    SET MSIDX DOWN BY 1.
199600110516      * RFS 79774 - End
199700110516RF4697     SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
199800110516RF4697     WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
199900110516RF4697        AND WS-M-UPPER-LIMIT(MSIDX) >= WS-UNIT-VALUE
200000110516RF4697        MOVE WS-M-RATE(MSIDX) TO WS-RATE
200100110516RF4697     WHEN WS-M-SCHEDULE(MSIDX) = SPACES
200200110516RF4697        GO TO GC-EXIT.
200300110516RF4697
200400110516      *RFS 79774 - Defect 5
200500110516R79774*    MOVE WS-T-MV(TRNIDX) TO WS-T-UNIT-VALUE(TRNIDX)
200600110516R79774*    MOVE WS-T-UNIT-VALUE(TRNIDX) TO WS-UNIT-VALUE.
200700110516
200800110516           COMPUTE WS-MFR-VALUE ROUNDED  =
200900110516                 (WS-UNIT-VALUE - WS-M-LOWER-LIMIT(MSIDX))
201000110516                         * WS-RATE / 100 / WS-DAYS-IN-YEAR.
201100110516RF4697     ADD WS-MFR-VALUE TO WS-T-MFR-VALUE(TRNIDX).
201200110516RF4697     MOVE WS-M-LOWER-LIMIT(MSIDX) TO WS-UNIT-VALUE.
201300110516RF4697     IF WS-UNIT-VALUE NOT = 0
201400110516RF4697         GO TO GC-NEXT-TIER.
201500110516RF4697 GC-EXIT.
201600110516RF4697     EXIT.
201700110516RF4697
201800110516      /
201900110516       INIT-ARRAY SECTION.
202000110516
202100110516           MOVE ZEROES       TO WS-T-UNIT-VALUE(TRNIDX)
202200110516                                WS-T-DATE(TRNIDX)
202300110516                                WS-T-PRICE(TRNIDX)
202400110516
202500110516                                WS-T-UNIT-BALANCE(TRNIDX)
202600110516                                WS-T-MFR-RATE(TRNIDX)
202700110516      * RFS 79774 - begin
202800110516      *                         WS-T-MFR-VALUE(TRNIDX).
202900110516                                WS-T-MFR-VALUE(TRNIDX)
203000110516                                WS-T-MV(TRNIDX)
203100110516                                WS-T-BV(TRNIDX)
203200110516                                WS-T-AVG-UNIT-COST(TRNIDX).
203300110516      * RFS 79774 - end
203400110516           MOVE SPACES       TO WS-T-UNIT-ADJUST(TRNIDX).
203500110516           MOVE SPACES       TO WS-T-INVESTMENT-CODE(TRNIDX).
203600110516
203700110516       INA-EXIT.
203800110516           EXIT.
203900110516      /
204000110516       LOAD-MFR-SCHEDULE-ARRAY SECTION.
204100110516      **********************************************
204200110516      ** LOAD MFR-SCHEDULE ARRAY                  **
204300110516      **********************************************
204400110516
204500110516           IF WS-MFR-SCHEDULE =
204600110516              WS-M-SCHEDULE(1)
204700110516             GO TO LMSA-EXIT
204800110516           END-IF.
204900110516
205000110516           INITIALIZE WS-MFR-SCHEDULE-ARRAY.
205100110516           SET  MSIDX        TO 1.
205200110516           SET  MSIDX        DOWN BY 1.
205300110516
205400110516           MOVE WS-MFR-SCHEDULE
205500110516                             TO MFR-SCHEDULE-CODE OF MFR-SCHEDULE.
205600110516           MOVE ZEROS        TO UPPER-LIMIT OF MFR-SCHEDULE.
205700110516
205800110516           START MFR-SCHEDULE
205900110516           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
206000110516           INVALID KEY
206100110516             GO TO LMSA-EXIT.
206200110516
206300110516       LMSA-0010.
206400110516
206500110516           READ MFR-SCHEDULE NEXT RECORD
206600110516           AT END
206700110516             GO TO LMSA-EXIT.
206800110516
206900110516           IF MFR-SCHEDULE-CODE OF MFR-SCHEDULE NOT =
207000110516              WS-MFR-SCHEDULE
207100110516             GO TO LMSA-EXIT
207200110516           END-IF.
207300110516
207400110516           SET MSIDX UP BY 1.
207500110516      * RFS49699 - Array logging logic
207600110516
207700110516           IF MSIDX  > WS-ARRAY2-MAX-USED
207800110516               MOVE MSIDX                  TO WS-ARRAY2-MAX-USED
207900110516           END-IF.
208000110516
208100110516      * RFS49699 - End
208200110516           MOVE MFR-SCHEDULE-CODE OF MFR-SCHEDULE
208300110516                             TO WS-M-SCHEDULE(MSIDX).
208400110516
208500110516           MOVE UPPER-LIMIT OF MFR-SCHEDULE
208600110516                             TO WS-M-UPPER-LIMIT(MSIDX).
208700110516           MOVE UPPER-LIMIT OF MFR-SCHEDULE
208800110516                             TO WS-M-LOWER-LIMIT(MSIDX + 1).
208900110516           MOVE MFR-RATE OF MFR-SCHEDULE
209000110516                             TO WS-M-RATE(MSIDX).
209100110516
209200110516           GO TO LMSA-0010.
209300110516
209400110516       LMSA-EXIT.
209500110516           EXIT.
209600110516      /
209700110516       INITIAL-LOGIC SECTION.
209800171116
209900210624      *RFS186019 - Begins
210000210624           ACCEPT lc_MFASYSPARM FROM WS-DTAARA-MFASYSPARM
210100210624                  FOR "MFASYSPARM".
210200210624      *RFS186019 - Ends
210300171130      *RFS167951 Starts
210400171130            INITIALIZE lc_BaseCurrency
210500171130            EXEC SQL
210600171130              SELECT CURRENCY
210700171130              INTO :lc_BaseCurrency
210800171130              FROM  MFACURP
210900171130              WHERE BASE_CURRENCY = "Y"
211000171130              FETCH FIRST ROW ONLY
211100171130            END-EXEC.
211200171130            INITIALIZE lc_ExchangeRateType.
211300171130            EXEC SQL
211400171130              SELECT EXCHANGE_RATE_TYPE
211500171130                INTO :lc_ExchangeRateType
211600171130              FROM  MFAPRGERP
211700171130              WHERE PROGRAM_CODE   = "MFRGEN"
211800171130                AND PROGRAM_ACTION = "DEFAULT"
211900171130              FETCH FIRST ROW ONLY
212000171130            END-EXEC.
212100171130            IF lc_ExchangeRateType IS EQUAL TO SPACES
212200171130               MOVE "N"  TO lc_ExchangeRateType
212300171130            END-IF.
212400171016
212500171130            SET lc-ASBOneOnlyYes TO TRUE.
212600171130            INITIALIZE ln_Count.
212700171130             EXEC SQL
212800171130              SELECT COUNT(1)
212900171130              INTO :ln_Count
213000171130              FROM MFAMFRPRP MFRPRP
213100171130              INNER JOIN MFAMFRHDP MFRHDP ON
213200171130              MFRHDP.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
213300210623      *RFS186019 - Start
213400210623      *       WHERE MFRHDP.ASSETS_BY_RULE IN ( "2" ,"3" )
213500210623              WHERE MFRHDP.ASSETS_BY_RULE IN ( "2" ,"3", "4" )
213600210623      *RFS186019 - End
213700171130             END-EXEC.
213800171010
213900171130             MOVE SQLSTATE      TO lc_sqlStates.
214000171130             IF lncc_sqlSuccessful
214100171130                CONTINUE
214200171130             ELSE
214300171130                SET lncc_Err-01         TO TRUE
214400171130                MOVE lc_ErrCodeDescr01  TO lc_sqlErrShortDESCR
214500171130             END-IF.
214600171130      *RFS167951 Ends
214700171130      *RFS167951 Starts
214800171130      *--------
214900171130       INT-001.
215000171130      *--------
215100171130      *RFS167951 Ends
215200110516      *RFS 34759 - Start
215300110516RF4697*    CALL "RTVCMPCD" USING WS-MCO.
215400110516RF4697*    CANCEL "RTVCMPCD".
215500110516      *RFS 34759 - End
215600110516      * OPEN FILES AND INITIALIZE ACCUMULATORS
215700110516
215800171011167951      SET lb_IvrAccLvlNo TO TRUE.
215900171011
216000110516      * RFS 79774 - Begin
216100110516      * FXSCEDTALW progam to validate screen edits
216200110516           MOVE "N" TO lc-MfrEfs-Edit.
216300110516           MOVE lc-MfrEfs-Screen-Code
216400110516             TO Screen-Code OF Screen-Edits-Allowed-Rec.
216500110516           MOVE lc-MfrEfs-Edit-Code
216600110516             TO Edit-Code OF Screen-Edits-Allowed-Rec.
216700110516           MOVE lc-MfrEfs-Level-Code
216800110516             TO Level-Code OF Screen-Edits-Allowed-Rec.
216900110516
217000110516           CALL "FXSCEDTALW" USING Screen-Edits-Allowed-Rec
217100110516                                   Ws-Sea-Edit-Sqllog
217200110516                                   Ws-Sea-Return-Code.
217300110516
217400110516           IF Ws-Sea-Return-Code IS EQUAL TO "00"
217500110516              MOVE "Y" TO lc-MfrEfs-Edit
217600110516           END-IF.
217700110516      * RFS 79774 - End
217800110516
217900110516           OPEN INPUT  INVESTMENT-UNIT-PRICE
218000110516                       BUSINESS-DAY-FILE
218100110516                       MFR-SCHEDULE
218200110516                       ACCOUNT-INVESTMENT
218300110516                       TRANS
218400171016167951                 EXCHANGE-RATE-M
218500110516      *RFS 34759 - Start
218600110516                       Inv-Ass-Alloc-Mod-Sch-Hd
218700110516                       Inv-Ass-Alloc-Model-Sch-Dt.
218800110516      *RFS 34759 - End
218900110516
219000110516           INITIALIZE  WS-MFR-SCHEDULE-ARRAY
219100110516                       WS-TRANS-DATE-ARRAY
219200110516                       WS-BUSINESS-DAY-ARRAY.
219300110516
219400110516           MOVE "Y"           TO WS-FIRST-READ-SW.
219500110516
219600110516           IF COMM-PROCESS-OPTION = "O"
219700110516             GO TO INL-ON-LINE-OPTION
219800110516           END-IF.
219900110516
220000171130      *RFS167951 Starts
220100171130           IF  COMM-PROCESS-OPTION = "B" AND
220200171130               ln_Count > 1
220300171130                 SET lb_IvrAccLvlYes    TO TRUE
220400171130                 SET lc-ASBOneOnlyNo     TO TRUE
220500171130                 MOVE ZEROS TO ln_Count
220600171130           END-IF.
220700171130      *RFS167951 Ends
220800171011
220900171130      *RFS167951 Starts
221000171128      *RFS157482 START
221100171128      *    IF COMM-PROCESS-OPTION = "B"
221200171128      *      MOVE COMM-FROM-DATE TO WS-QBEGIN-N
221300171128      *      MOVE COMM-TO-DATE   TO WS-QEND-N
221400171128      *      DIVIDE WS-QEND-YY BY 4 GIVING WS-LEAP0 REMAINDER WS-LEAP1
221500171128      *      IF WS-LEAP1 = 0
221600171128      *         MOVE 366 TO WS-DAYS-IN-YEAR
221700171128      *      ELSE
221800171128      *         MOVE 365 TO WS-DAYS-IN-YEAR
221900171128      *      END-IF
222000171128      *    END-IF.
222100160406      *RFS157482 ENDS
222200171130      *RFS167951 Ends
222300160406
222400171011       INL-BATCH-OPTION.
222500171011
222600171011           OPEN INPUT INVESTMENT
222700171011                I-O   MFR-PROCESS.
222800171011
222900110516           READ MFR-PROCESS NEXT RECORD
223000110516           AT END
223100110516             MOVE HIGH-VALUES TO CURR-CONTROLS
223200110516             GO TO INL-EXIT.
223300171130      *RFS167951 Starts
223400171130      *    MOVE MIN-DATE OF MFR-PROCESS
223500171130      *                      TO WS-QBEGIN-N.
223600171130      *    MOVE MAX-DATE OF MFR-PROCESS
223700171130      *                      TO WS-QEND-N.
223800171130           INITIALIZE ln_StartDate,
223900171130                      ln_EndDate.
224000171130           MOVE MIN-DATE OF MFR-PROCESS
224100171130                             TO WS-QBEGIN-N
224200171130                                ln_StartDate.
224300171130           MOVE MAX-DATE OF MFR-PROCESS
224400171130                             TO WS-QEND-N
224500171130                                ln_EndDate.
224600171130      *RFS167951 Ends
224700110516
224800171130      *RFS167951 Starts
224900171130           DIVIDE WS-QEND-YY BY 4 GIVING
225000171130                  WS-LEAP0 REMAINDER WS-LEAP1
225100171130           IF WS-LEAP1 = 0
225200171130              MOVE 366 TO WS-DAYS-IN-YEAR
225300171130           ELSE
225400171130              MOVE 365 TO WS-DAYS-IN-YEAR
225500171130           END-IF.
225600171130      *RFS167951 Ends
225700171128
225800110516           PERFORM LOAD-INITIAL-ARRAY.
225900171130
226000110516
226100110516           CLOSE INVESTMENT.
226200110516
226300171130      *RFS167951 Starts
226400171130           IF lb_IvrAccLvlYes
226500171130           OR (lb_IvrAccLvlNo AND lc-ASBOneOnlyYes)
226600180108      *RFS1000551-Starts
226700180111             EXEC SQL
226800180111              DROP INDEX QTEMP/TMPHHLDIVR_IDX1
226900180111             END-EXEC
227000180111
227100180111             EXEC SQL
227200180111              DROP INDEX QTEMP/TMPHHLDIVR_IDX2
227300180111             END-EXEC
227400180111
227500180111             EXEC SQL
227600180111              DROP INDEX QTEMP/TMPHHLDIVR_IDX3
227700180111             END-EXEC
227800180111
227900180111             EXEC SQL
228000180111              DROP INDEX QTEMP/TMPHHLDIVR_IDX4
228100180111             END-EXEC
228200180108      *RFS1000551-Ends
228300181227      *RFS 182065 - begin
228400181227             EXEC SQL
228500181227              DROP INDEX QTEMP/TMPHHLDIVR_IDX5
228600181227             END-EXEC
228700181227
228800181227             EXEC SQL
228900181227              DROP INDEX QTEMP/TMPHHLDIVR_IDX6
229000181227             END-EXEC
229100181227      *RFS 182065 - end
229200171130
229300171130             EXEC SQL
229400171130              DROP TABLE QTEMP/TMPHHLDIVR
229500171130             END-EXEC
229600171130
229700171130             EXEC SQL
229800171130              CREATE TABLE QTEMP/TMPHHLDIVR (
229900171130              MFR_GROUP_CODE        CHAR   (04)
230000171130                                    NOT NULL WITH DEFAULT,
230100171130              TRADE_DATE            NUM    (8,0)
230200171130                                    NOT NULL WITH DEFAULT,
230300171130              INVESTOR_NO           NUM    (9,0)
230400171130                                    NOT NULL WITH DEFAULT,
230500171130              ACCOUNT_NO            NUM    (9,0)
230600171130                                    NOT NULL WITH DEFAULT,
230700171130              INVESTMENT_CODE       CHAR   (05)
230800171130                                    NOT NULL WITH DEFAULT,
230900180128      *RFS177476-Starts
231000180128              CURRENCY              CHAR   (03)
231100180128                                    NOT NULL WITH DEFAULT,
231200180128              SAME_CURR             CHAR   (01)
231300180128                                    NOT NULL WITH DEFAULT,
231400180128      *RFS177476-Ends
231500171130              ASSETS_BY_RULE        CHAR   (01)
231600171130                                    NOT NULL WITH DEFAULT,
231700171130              MFR_SCHEDULE_CODE     CHAR   (03)
231800171130                                    NOT NULL WITH DEFAULT,
231900171130              OVR_MFR_SCHEDULE_CODE CHAR   (03)
232000171130                                    NOT NULL WITH DEFAULT,
232100210623      *RFS186019 - Start
232200210623              SECONDARY_ASSETS_FLAG CHAR   (01)
232300210623                                    NOT NULL WITH DEFAULT,
232400210706              ELIGIBLE_FOR_CALC     CHAR   (01)
232500210630                                    NOT NULL WITH DEFAULT,
232600210630              HOUSEHOLD_ID          NUM    (12)
232700210630                                    NOT NULL WITH DEFAULT,
232800210801              SIN_NO                NUM    (09)
232900210801                                    NOT NULL WITH DEFAULT,
233000210623      *RFS186019 - End
233100171130              INV_ASSETS_AMT        DEC    (13,2)
233200171130                                    NOT NULL WITH DEFAULT,
233300171130              TOT_ACC_ASSETS_AMT    DEC    (13,2)
233400171130                                    NOT NULL WITH DEFAULT,
233500171130              TOT_IVR_ASSETS_AMT    DEC    (13,2)
233600171130                                    NOT NULL WITH DEFAULT,
233700171130              INV_MARKET_VALUE      DEC    (13,2)
233800171130                                    NOT NULL WITH DEFAULT,
233900171130              TOT_ACC_MARKET_VALUE  DEC    (13,2)
234000171130                                    NOT NULL WITH DEFAULT,
234100171130              TOT_IVR_MARKET_VALUE  DEC    (13,2)
234200171130                                    NOT NULL WITH DEFAULT,
234300171130              TOT_IVR_MFR_AMT       DEC    (15,6)
234400171130                                    NOT NULL WITH DEFAULT,
234500171130              TOT_ACC_MFR_AMT       DEC    (15,6)
234600171130                                    NOT NULL WITH DEFAULT
234700171130              )
234800171130             END-EXEC
234900171130
235000171130             MOVE SQLSTATE      TO lc_sqlStates
235100171130             IF lncc_sqlSuccessful
235200171130                CONTINUE
235300171130             ELSE
235400171130                SET lncc_Err-05         TO TRUE
235500171130                MOVE lc_ErrCodeDescr05  TO lc_sqlErrShortDESCR
235600171130             END-IF
235700171130
235800180108      *RFS1000551-Starts
235900180111           EXEC SQL
236000180111             CREATE INDEX QTEMP/TMPHHLDIVR_IDX1
236100180111                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
236200180111                                     ACCOUNT_NO,
236300180111                                     INVESTMENT_CODE)
236400180111           END-EXEC
236500180111
236600180111           EXEC SQL
236700180111             CREATE INDEX QTEMP/TMPHHLDIVR_IDX2
236800180111                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
236900180111                                     ACCOUNT_NO,
237000180111                                     INVESTMENT_CODE,
237100180111                                     TRADE_DATE)
237200180111           END-EXEC
237300180111
237400180111           EXEC SQL
237500180111             CREATE INDEX QTEMP/TMPHHLDIVR_IDX3
237600180111                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
237700180111                                     INVESTOR_NO,
237800180111                                     ASSETS_BY_RULE,
237900180111                                     TRADE_DATE)
238000180111           END-EXEC
238100180111
238200180111           EXEC SQL
238300180111             CREATE INDEX QTEMP/TMPHHLDIVR_IDX4
238400180111                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
238500180111                                     ACCOUNT_NO,
238600180111                                     ASSETS_BY_RULE,
238700180111                                     TRADE_DATE)
238800180111           END-EXEC
238900180108      *RFS1000551-Ends
239000181227      *RFS 182065 - begin
239100181227           EXEC SQL
239200181227             CREATE INDEX QTEMP/TMPHHLDIVR_IDX5
239300181227                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
239400181227                                     INVESTOR_NO,
239500181227                                     TRADE_DATE)
239600181227           END-EXEC
239700181227
239800181227           EXEC SQL
239900181227             CREATE INDEX QTEMP/TMPHHLDIVR_IDX6
240000181227                 ON QTEMP/TMPHHLDIVR(MFR_GROUP_CODE,
240100181227                                     ACCOUNT_NO,
240200181227                                     TRADE_DATE)
240300181227           END-EXEC
240400181227      *RFS 182065 - end
240500171130
240600210630      *RFS186019 - Starts
240700210630           IF lc_RegrAccrFlag   = "Y"
240800171130           EXEC SQL
240900171130               INSERT INTO QTEMP/TMPHHLDIVR
241000171130               WITH TMPMFR   AS(
241100171130                 SELECT DISTINCT  "  "  BLANK,
241200171130                                  MFR_GROUP_CODE
241300171130                 FROM MFAMFRPRP),
241400171130               TMPBDAYS AS(
241500171130                 SELECT "  "  BLANK,
241600171130                        BUSINESS_DAY
241700171130                 FROM MFABUSDAP
241800171130                 WHERE BUSINESS_DAY >= :ln_StartDate AND
241900171130                       BUSINESS_DAY <= :ln_EndDate ),
242000171130               TMPMFRBDAY AS(
242100171130                 SELECT  MFR_GROUP_CODE ,
242200171130                         BUSINESS_DAY
242300171130                 FROM TMPMFR MFR
242400171130                 INNER JOIN TMPBDAYS BDAYS ON
242500171130                 MFR.BLANK = BDAYS.BLANK ),
242600210701                 TMPIVR4 AS (
242700210630                  SELECT DISTINCT
242800210701                      COALESCE(IVRHDP.INVESTOR_NO,0)
242900210701                      INVESTOR_NO,
243000210701                      COALESCE(IVRHDP.INVESTOR_NO_2,0)
243100210701                      INVESTOR_NO_2,
243200210701                      COALESCE(IVRHHP.MFR_SCHEDULE_CODE," ")
243300210701                      MFR_SCHEDULE_CODE,
243400210701                      COALESCE(IVRP.SOCIAL_INSURANCE_NO,0)
243500210701                      SOCIAL_INSURANCE_NO,
243600210706                      COALESCE(IVRHHP.HOUSEHOLD_ID,0)
243700210706                      HOUSEHOLD_ID,
243800210706                      COALESCE(IVRHDP.ACCOUNT_NO,0)
243900210706                      ACCOUNT_NO,
244000210701                      IVRHDP.HOUSEHOLD_START_DATE,
244100210701                      IVRHDP.HOUSEHOLD_STOP_DATE
244200210630
244300210701                      FROM MFAIVRHHP IVRHHP
244400210630
244500210701                      INNER JOIN MFAIVRHDP IVRHDP ON
244600210701                      IVRHDP.INVESTOR_NO =
244700210630                               IVRHHP.INVESTOR_NO AND
244800210701                      IVRHDP.HOUSEHOLD_LINKAGE_CODE =
244900210701                      IVRHHP.HOUSEHOLD_LINKAGE_CODE AND
245000210701                      IVRHDP.HOUSEHOLD_ID
245100210630                                 = IVRHHP.HOUSEHOLD_ID
245200210630
245300210701                      LEFT OUTER JOIN MFAIVRP IVRP ON
245400210801                      IVRHDP.INVESTOR_NO_2 = IVRP.INVESTOR_NO
245500210630
245600210701                      LEFT OUTER JOIN MFAIVRTYP IVRTYP ON
245700210701                      IVRP.INVESTOR_TYPE_CODE =
245800210630                        IVRTYP.INVESTOR_TYPE_CODE
245900210630
246000210701                    WHERE
246100210701                     IVRHHP.HOUSEHOLD_LINKAGE_CODE IN (
246200210701                     SELECT DISTINCT
246300210701                     COALESCE(MFRHDP.HOUSEHOLD_LINKAGE_CODE," ")
246400210701                        FROM MFAMFRHDP MFRHDP
246500210701                      WHERE MFRHDP.ASSETS_BY_RULE = "4" )
246600210701                      AND ((IVRTYP.INVESTOR_CATEGORY = "J" AND
246700210630                             IVRTYP.RECIPIENT_TYPE = "2") OR
246800210630                             IVRTYP.RECIPIENT_TYPE = "1")
246900210701                         ),
247000210630               TMPHDIVR4 AS (
247100210714                    SELECT COALESCE(IVR4.INVESTOR_NO,0)
247200210714                           INVESTOR_NO,
247300210714                           COALESCE(IVR4.INVESTOR_NO_2,0)
247400210714                           INVESTOR_NO_2,
247500210714                           COALESCE(IVR4.MFR_SCHEDULE_CODE, " ")
247600210714                           MFR_SCHEDULE_CODE,
247700210714                           COALESCE(IVR4.HOUSEHOLD_ID,0)
247800210714                           HOUSEHOLD_ID,
247900210801                           COALESCE(IVR4.SOCIAL_INSURANCE_NO,0)
248000210801                           SOCIAL_INSURANCE_NO,
248100210714                           COALESCE(IVR4.ACCOUNT_NO,0)
248200210714                           ACCOUNT_NO,
248300210714                           IVR4.HOUSEHOLD_START_DATE,
248400210802                           IVR4.HOUSEHOLD_STOP_DATE
248500210701                       FROM TMPIVR4 IVR4
248600210801                       WHERE IVR4.SOCIAL_INSURANCE_NO   <> 0
248700210630                         AND ((:lc_EffectiveFlag = "Y"  AND
248800210706                               IVR4.HOUSEHOLD_START_DATE
248900210727                             <> "1900-01-01" )
249000210630                         OR :lc_EffectiveFlag = "N" )
249100210630                        ),
249200171130               TMPHDIVR AS(
249300171130                 SELECT COALESCE(IVRHDP.INVESTOR_NO,0)
249400171130                        INVESTOR_NO,
249500171130                        COALESCE(IVRHDP.INVESTOR_NO_2,0)
249600171130                        INVESTOR_NO_2,
249700171130                        COALESCE(IVRHHP.MFR_SCHEDULE_CODE," ")
249800210705                        MFR_SCHEDULE_CODE,
249900210706                        COALESCE(IVRHHP.HOUSEHOLD_ID,0)
250000210706                        HOUSEHOLD_ID,
250100210801                        0 AS SOCIAL_INSURANCE_NO,
250200210706                        COALESCE(IVRHDP.ACCOUNT_NO,0)
250300210706                        ACCOUNT_NO,
250400210705                        IVRHDP.HOUSEHOLD_START_DATE,
250500210802                        IVRHDP.HOUSEHOLD_STOP_DATE,
250600210802                        "3" ASSETS_BY_RULE
250700171130                 FROM MFAIVRHHP IVRHHP
250800171130                 INNER JOIN MFAIVRHDP IVRHDP ON
250900171130                 IVRHDP.INVESTOR_NO = IVRHHP.INVESTOR_NO
251000171130                 AND IVRHDP.HOUSEHOLD_LINKAGE_CODE =
251100171130                     IVRHHP.HOUSEHOLD_LINKAGE_CODE
251200210630                 AND IVRHDP.HOUSEHOLD_ID = IVRHHP.HOUSEHOLD_ID
251300171130                 WHERE
251400210630                 IVRHHP.HOUSEHOLD_LINKAGE_CODE IN (
251500210630                 SELECT DISTINCT
251600210701                   COALESCE(MFRHDP.HOUSEHOLD_LINKAGE_CODE," ")
251700210701                   FROM MFAMFRHDP MFRHDP
251800210701                   WHERE MFRHDP.ASSETS_BY_RULE = "3"
251900210630                   AND ((:lc_EffectiveFlag = "Y"    AND
252000210630                         IVRHDP.HOUSEHOLD_START_DATE
252100210727                                  <> "1900-01-01")
252200210701                     OR :lc_EffectiveFlag = "N"  ))
252300210630
252400210630                   UNION ALL
252500210630
252600210630                   SELECT COALESCE(HDIVR4.INVESTOR_NO,0)
252700210630                          INVESTOR_NO,
252800210630                          COALESCE(HDIVR4.INVESTOR_NO_2,0)
252900210630                          INVESTOR_NO_2,
253000210630                          COALESCE(HDIVR4.MFR_SCHEDULE_CODE," ")
253100210630                          MFR_SCHEDULE_CODE,
253200210706                          COALESCE(HDIVR4.HOUSEHOLD_ID,0)
253300210706                          HOUSEHOLD_ID,
253400210801                          COALESCE(HDIVR4.SOCIAL_INSURANCE_NO,0)
253500210801                          SOCIAL_INSURANCE_NO,
253600210706                          COALESCE(HDIVR4.ACCOUNT_NO,0)
253700210706                          ACCOUNT_NO,
253800210630                          HDIVR4.HOUSEHOLD_START_DATE,
253900210802                          HDIVR4.HOUSEHOLD_STOP_DATE,
254000210802                          "4" ASSETS_BY_RULE
254100210630                      FROM TMPHDIVR4 HDIVR4
254200210630                      )
254300210714                 SELECT DISTINCT
254400210714                  COALESCE(MFRPRP.MFR_GROUP_CODE," "),
254500210714                  COALESCE(MFRBDAY.BUSINESS_DAY,0),
254600210714                  CASE WHEN COALESCE(HDIVR.INVESTOR_NO,0) = 0
254700210714                  THEN COALESCE(ACCNTP.INVESTOR_NO,0)
254800210714                  ELSE COALESCE(HDIVR.INVESTOR_NO,0)
254900210714                  END,
255000210714                  COALESCE(MFRPRP.ACCOUNT_NO,0),
255100210714                  COALESCE(MFRPRP.INVESTMENT_CODE," "),
255200210714                  COALESCE(INVP.CURRENCY," "),
255300210714                  " " ,
255400210714                  COALESCE(MFRHDP.ASSETS_BY_RULE," "),
255500210714                  COALESCE(MFRPRP.MFR_SCHEDULE_CODE," "),
255600210714                  COALESCE(HDIVR.MFR_SCHEDULE_CODE," "),
255700210714                  COALESCE(MFRHDP.SECONDARY_ASSETS_FLAG," "),
255800210714                  CASE
255900210801                    WHEN COALESCE(MFRHDP.ASSETS_BY_RULE," ") =  "2"
256000210801                    THEN "Y"
256100210727                    WHEN DECIMAL
256200210727                    (REPLACE(CHAR(HDIVR.HOUSEHOLD_START_DATE,ISO),
256300210727                                  "-","")) <=
256400210727                        COALESCE(MFRBDAY.BUSINESS_DAY,0)
256500210727                     AND HDIVR.HOUSEHOLD_STOP_DATE
256600210727                                  = "1900-01-01"
256700210727                     AND :lc_EffectiveFlag = "Y"
256800210727                     THEN "Y"
256900210705                    WHEN DECIMAL
257000210705                    (REPLACE(CHAR(HDIVR.HOUSEHOLD_START_DATE,ISO),
257100210705                                  "-","")) <=
257200210705                        COALESCE(MFRBDAY.BUSINESS_DAY,0)
257300210706                    AND DECIMAL
257400210706                    (REPLACE(CHAR(HDIVR.HOUSEHOLD_STOP_DATE,
257500210705                                ISO),"-","")) >=
257600210705                        COALESCE(MFRBDAY.BUSINESS_DAY,0)
257700210705                    AND :lc_EffectiveFlag = "Y"
257800210705                               THEN "Y"
257900210714                    WHEN :lc_EffectiveFlag = "Y"
258000210705                    THEN "N"
258100210630                    ELSE "Y"
258200210714                  END ELIGIBLE_FOR_CALC,
258300210714                  COALESCE(HDIVR.HOUSEHOLD_ID,0),
258400210801                  COALESCE(HDIVR.SOCIAL_INSURANCE_NO,0),
258500210714                  0,
258600210714                  0,
258700210714                  0,
258800210714                  0,
258900210714                  0,
259000210714                  0,
259100210714                  0,
259200210714                  0
259300171130                FROM MFAMFRPRP MFRPRP
259400171130
259500171130                INNER JOIN MFAMFRHDP MFRHDP ON
259600171130                MFRHDP.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
259700171130
259800171130                INNER JOIN MFAACCNTP ACCNTP ON
259900171130                ACCNTP.ACCOUNT_NO = MFRPRP.ACCOUNT_NO
260000171130
260100180128                INNER JOIN MFAINVP INVP ON
260200180128                INVP.INVESTMENT_CODE = MFRPRP.INVESTMENT_CODE
260300180128
260400171130                LEFT OUTER JOIN TMPHDIVR HDIVR ON
260500210701                HDIVR.INVESTOR_NO_2 = ACCNTP.INVESTOR_NO AND
260600210802                HDIVR.ACCOUNT_NO    = ACCNTP.ACCOUNT_NO  AND
260700210802                HDIVR.ASSETS_BY_RULE
260800210802                                    = MFRHDP.ASSETS_BY_RULE
260900171130
261000171130                LEFT OUTER JOIN TMPMFRBDAY MFRBDAY ON
261100171130                MFRBDAY.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
261200171130           END-EXEC
261300210630           ELSE
261400210630      *RFS186019 - End
261500210630           EXEC SQL
261600210630               INSERT INTO QTEMP/TMPHHLDIVR
261700210630               WITH TMPMFR   AS(
261800210630                 SELECT DISTINCT  "  "  BLANK,
261900210630                                  MFR_GROUP_CODE
262000210630                 FROM MFAMFRPRP),
262100210630               TMPBDAYS AS(
262200210630                 SELECT "  "  BLANK,
262300210630                        BUSINESS_DAY
262400210630                 FROM MFABUSDAP
262500210630                 WHERE BUSINESS_DAY >= :ln_StartDate AND
262600210630                       BUSINESS_DAY <= :ln_EndDate ),
262700210630               TMPMFRBDAY AS(
262800210630                 SELECT  MFR_GROUP_CODE ,
262900210630                         BUSINESS_DAY
263000210630                 FROM TMPMFR MFR
263100210630                 INNER JOIN TMPBDAYS BDAYS ON
263200210630                 MFR.BLANK = BDAYS.BLANK ),
263300210630               TMPHDIVR AS(
263400210630                 SELECT COALESCE(IVRHDP.INVESTOR_NO,0)
263500210630                        INVESTOR_NO,
263600210630                        COALESCE(IVRHDP.INVESTOR_NO_2,0)
263700210630                        INVESTOR_NO_2,
263800210630                        COALESCE(IVRHHP.MFR_SCHEDULE_CODE," ")
263900210630                        MFR_SCHEDULE_CODE
264000210630186019                 ,IVRHHP.HOUSEHOLD_ID HOUSEHOLD_ID
264100210630                 FROM MFAIVRHHP IVRHHP
264200210630
264300210630                 INNER JOIN MFAIVRHDP IVRHDP ON
264400210630                 IVRHDP.INVESTOR_NO = IVRHHP.INVESTOR_NO
264500210630                 AND IVRHDP.HOUSEHOLD_LINKAGE_CODE =
264600210630                     IVRHHP.HOUSEHOLD_LINKAGE_CODE
264700210630179223           AND IVRHDP.HOUSEHOLD_ID = IVRHHP.HOUSEHOLD_ID
264800210630
264900210630                 WHERE
265000210701      *RFS186019 - Starts
265100210630      *          IVRHHP.HOUSEHOLD_LINKAGE_CODE = "MFB")
265200210630                 IVRHHP.HOUSEHOLD_LINKAGE_CODE IN
265300210630                    (
265400210701                    SELECT DISTINCT
265500210701                          COALESCE(HOUSEHOLD_LINKAGE_CODE," ")
265600210630                    FROM MFAMFRHDP
265601211001                    WHERE ASSETS_BY_RULE = "3"
265800210701                    ))
265900210701      *RFS186019 - End
266000210630                   SELECT DISTINCT
266100210630                    COALESCE(MFRPRP.MFR_GROUP_CODE," "),
266200210630                    COALESCE(MFRBDAY.BUSINESS_DAY,0),
266300210630                    CASE WHEN COALESCE(HDIVR.INVESTOR_NO,0) = 0
266400210630                    THEN COALESCE(ACCNTP.INVESTOR_NO,0)
266500210630                    ELSE COALESCE(HDIVR.INVESTOR_NO,0)
266600210630                    END,
266700210630                    COALESCE(MFRPRP.ACCOUNT_NO,0),
266800210630                    COALESCE(MFRPRP.INVESTMENT_CODE," "),
266900210630      *RFS177476-Starts
267000210630                    COALESCE(INVP.CURRENCY," "),
267100210630                    " " ,
267200210630      *RFS177476-Ends
267300210630                    COALESCE(MFRHDP.ASSETS_BY_RULE," "),
267400210630                    COALESCE(MFRPRP.MFR_SCHEDULE_CODE," "),
267500210701                    COALESCE(HDIVR.MFR_SCHEDULE_CODE," "),
267600210701186019              COALESCE(MFRHDP.SECONDARY_ASSETS_FLAG," "),
267700210701186019              "Y",
267800210706186019              COALESCE(HDIVR.HOUSEHOLD_ID,0),
267900210801186019              0,
268000210630                    0,
268100210630                    0,
268200210630                    0,
268300210630                    0,
268400210630                    0,
268500210630                    0,
268600210630                    0,
268700210630                    0
268800210630                FROM MFAMFRPRP MFRPRP
268900210630
269000210630                INNER JOIN MFAMFRHDP MFRHDP ON
269100210630                MFRHDP.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
269200210630
269300210630                INNER JOIN MFAACCNTP ACCNTP ON
269400210630                ACCNTP.ACCOUNT_NO = MFRPRP.ACCOUNT_NO
269500210630
269600210630      *RFS177476-Starts
269700210630                INNER JOIN MFAINVP INVP ON
269800210630                INVP.INVESTMENT_CODE = MFRPRP.INVESTMENT_CODE
269900210630
270000210630      *RFS177476-Ends
270100210630                LEFT OUTER JOIN TMPHDIVR HDIVR ON
270200210630                HDIVR.INVESTOR_NO_2 = ACCNTP.INVESTOR_NO
270300210630
270400210630                LEFT OUTER JOIN TMPMFRBDAY MFRBDAY ON
270500210630                MFRBDAY.MFR_GROUP_CODE = MFRPRP.MFR_GROUP_CODE
270600210630
270700210630           END-EXEC
270800210630177476*    END-IF.
270900210701186019     END-IF
271000171130
271100171130             MOVE SQLSTATE      TO lc_sqlStates
271200171130             IF lncc_sqlSuccessful
271300171130                CONTINUE
271400171130             ELSE
271500171130                SET lncc_Err-06         TO TRUE
271600171130                MOVE lc_ErrCodeDescr06  TO lc_sqlErrShortDESCR
271700210701             END-IF
271800180202      *RFS177476-Starts
271900180202      *--------------------------------------
272000180202      *UPDATE-SAME-CURR-ACC-LEVEL
272100180202      *--------------------------------------
272200180202
272300180202           EXEC SQL
272400180202              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
272500180202              SET HHLDIVR.SAME_CURR =
272600180202              (SELECT CASE WHEN COUNT(DISTINCT HHLDIVR1.CURRENCY)> 1
272700180202                            THEN "N"
272800180202                           ELSE "Y"
272900180202                      END
273000180202               FROM QTEMP/TMPHHLDIVR HHLDIVR1
273100180202               WHERE HHLDIVR1.MFR_GROUP_CODE
273200180202                     = HHLDIVR.MFR_GROUP_CODE
273300210801      *RFS186019 - Start
273400210801               AND   HHLDIVR1.HOUSEHOLD_ID
273500210801                     = HHLDIVR.HOUSEHOLD_ID
273600210801      *RFS186019 - End
273700180202               AND   HHLDIVR1.ACCOUNT_NO
273800180202                     = HHLDIVR.ACCOUNT_NO
273900180202               AND   HHLDIVR1.ASSETS_BY_RULE
274000180202                     = HHLDIVR.ASSETS_BY_RULE
274100180202               AND   HHLDIVR1.ASSETS_BY_RULE
274200180202                     = "2"
274300180202              )
274400180202              WHERE EXISTS
274500180202                 (SELECT 1
274600180202                  FROM QTEMP/TMPHHLDIVR HHLDIVR2
274700180725      *RFS179061 - Starts
274800180725      *           WHERE HHLDIVR2.MFR_GROUP_CODE  =
274900180725      *                 HHLDIVR1.MFR_GROUP_CODE  AND
275000180725      *                 HHLDIVR2.ACCOUNT_NO      =
275100180725      *                 HHLDIVR1.ACCOUNT_NO      AND
275200180725      *                 HHLDIVR2.ASSETS_BY_RULE  =
275300180725      *                 HHLDIVR1.ASSETS_BY_RULE  AND
275400180725      *                 HHLDIVR2.ASSETS_BY_RULE  = "2" )
275500180725                  WHERE HHLDIVR2.MFR_GROUP_CODE  =
275600180725                        HHLDIVR.MFR_GROUP_CODE  AND
275700210801      *RFS186019 - Start
275800210801                        HHLDIVR2.HOUSEHOLD_ID   =
275900210801                        HHLDIVR.HOUSEHOLD_ID    AND
276000210801      *RFS186019 - End
276100180725                        HHLDIVR2.ACCOUNT_NO      =
276200180725                        HHLDIVR.ACCOUNT_NO      AND
276300180725                        HHLDIVR2.ASSETS_BY_RULE  =
276400180725                        HHLDIVR.ASSETS_BY_RULE  AND
276500180725                        HHLDIVR2.ASSETS_BY_RULE  = "2" )
276600180725      *RFS179061 - Ends
276700180202           END-EXEC
276800180202
276900180202           MOVE SQLSTATE      TO lc_sqlStates
277000180202           IF lncc_sqlSuccessful
277100180202              CONTINUE
277200180202           ELSE
277300180202              SET lncc_Err-17         TO TRUE
277400180202              MOVE lc_ErrCodeDescr17  TO lc_sqlErrShortDESCR
277500180202           END-IF
277600180202      *--------------------------------------
277700180202      *UPDATE-SAME-CURR-IVR-LEVEL
277800180202      *--------------------------------------
277900180202
278000180202           EXEC SQL
278100180202              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
278200180202              SET HHLDIVR.SAME_CURR =
278300180202              (SELECT CASE WHEN COUNT(DISTINCT HHLDIVR1.CURRENCY)> 1
278400180202                            THEN "N"
278500180202                           ELSE "Y"
278600180202                      END
278700180202               FROM QTEMP/TMPHHLDIVR HHLDIVR1
278800180202               WHERE HHLDIVR1.MFR_GROUP_CODE
278900180202                     = HHLDIVR.MFR_GROUP_CODE
279000180202               AND   HHLDIVR1.INVESTOR_NO
279100180202                     = HHLDIVR.INVESTOR_NO
279200210801      *RFS186019 - Start
279300210801               AND   HHLDIVR1.HOUSEHOLD_ID
279400210801                     = HHLDIVR.HOUSEHOLD_ID
279500210801      *RFS186019 - End
279600180202               AND   HHLDIVR1.ASSETS_BY_RULE
279700180202                     = HHLDIVR.ASSETS_BY_RULE
279800180202               AND   HHLDIVR1.ASSETS_BY_RULE
279900180202                     = "3"
280000180202              )
280100180202              WHERE EXISTS
280200180202                 (SELECT 1
280300180202                  FROM QTEMP/TMPHHLDIVR HHLDIVR2
280400180725      *RFS179061 - Starts
280500180725      *           WHERE HHLDIVR2.MFR_GROUP_CODE  =
280600180725      *                 HHLDIVR1.MFR_GROUP_CODE  AND
280700180725      *                 HHLDIVR2.INVESTOR_NO     =
280800180725      *                 HHLDIVR1.INVESTOR_NO     AND
280900180725      *                 HHLDIVR2.ASSETS_BY_RULE  =
281000180725      *                 HHLDIVR1.ASSETS_BY_RULE  AND
281100180725      *                 HHLDIVR2.ASSETS_BY_RULE  = "3" )
281200180725                  WHERE HHLDIVR2.MFR_GROUP_CODE  =
281300180725                        HHLDIVR.MFR_GROUP_CODE  AND
281400180725                        HHLDIVR2.INVESTOR_NO     =
281500180725                        HHLDIVR.INVESTOR_NO     AND
281600210801      *RFS186019 - Start
281700210801                        HHLDIVR2.HOUSEHOLD_ID   =
281800210801                        HHLDIVR.HOUSEHOLD_ID    AND
281900210801      *RFS186019 - End
282000180725                        HHLDIVR2.ASSETS_BY_RULE  =
282100180725                        HHLDIVR.ASSETS_BY_RULE  AND
282200180725                        HHLDIVR2.ASSETS_BY_RULE  = "3" )
282300180725      *RFS179061 - Ends
282400180202           END-EXEC
282500180202
282600180202           MOVE SQLSTATE      TO lc_sqlStates
282700180202           IF lncc_sqlSuccessful
282800180202              CONTINUE
282900180202           ELSE
283000180202              SET lncc_Err-18         TO TRUE
283100180202              MOVE lc_ErrCodeDescr18  TO lc_sqlErrShortDESCR
283200180202           END-IF
283300210801      *RFS186019 - Start
283400210801      *--------------------------------------
283500210801      *UPDATE-SAME-CURR-IVR-SAME-SIN-LEVEL
283600210801      *--------------------------------------
283700210801
283800210801           EXEC SQL
283900210801              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
284000210801              SET HHLDIVR.SAME_CURR =
284100210801              (SELECT CASE WHEN COUNT(DISTINCT HHLDIVR1.CURRENCY) > 1
284200210801                            THEN "N"
284300210801                           ELSE "Y"
284400210801                      END
284500210801               FROM QTEMP/TMPHHLDIVR HHLDIVR1
284600210801               WHERE HHLDIVR1.MFR_GROUP_CODE
284700210801                     = HHLDIVR.MFR_GROUP_CODE
284800210801               AND   HHLDIVR1.INVESTOR_NO
284900210801                     = HHLDIVR.INVESTOR_NO
285000210801               AND   HHLDIVR1.HOUSEHOLD_ID
285100210801                     = HHLDIVR.HOUSEHOLD_ID
285200210801               AND   HHLDIVR1.SIN_NO
285300210801                     = HHLDIVR.SIN_NO
285400210801               AND   HHLDIVR1.SIN_NO   <> 0
285500210801               AND   HHLDIVR1.ASSETS_BY_RULE
285600210801                     = HHLDIVR.ASSETS_BY_RULE
285700210801               AND   HHLDIVR1.ASSETS_BY_RULE
285800210801                     = "4"
285900210801              )
286000210801              WHERE EXISTS
286100210801                 (SELECT 1
286200210801                   FROM QTEMP/TMPHHLDIVR HHLDIVR2
286300210801                   WHERE HHLDIVR2.MFR_GROUP_CODE  =
286400210801                         HHLDIVR.MFR_GROUP_CODE  AND
286500210801                         HHLDIVR2.INVESTOR_NO     =
286600210801                         HHLDIVR.INVESTOR_NO     AND
286700210801                         HHLDIVR2.HOUSEHOLD_ID   =
286800210801                         HHLDIVR.HOUSEHOLD_ID    AND
286900210801                         HHLDIVR2.SIN_NO   =
287000210801                         HHLDIVR.SIN_NO          AND
287100210801                         HHLDIVR2.SIN_NO   <> 0  AND
287200210801                         HHLDIVR2.ASSETS_BY_RULE  =
287300210801                         HHLDIVR.ASSETS_BY_RULE  AND
287400210801                         HHLDIVR2.ASSETS_BY_RULE  = "4" )
287500210801           END-EXEC
287600210801
287700210801           MOVE SQLSTATE      TO lc_sqlStates
287800210801           IF lncc_sqlSuccessful
287900210801                CONTINUE
288000210801             ELSE
288100210801                SET lncc_Err-24         TO TRUE
288200210801                MOVE lc_ErrCodeDescr24  TO lc_sqlErrShortDESCR
288300210801           END-IF
288400210801      *RFS186019 - End
288500180202      *RFS177476-Ends
288600180202177476     END-IF.
288700171130
288800171130           IF lb_IvrAccLvlYes
288900171130
289000171130              EXEC SQL
289100171130                 DROP TABLE QTEMP/TMPACCINV
289200171130              END-EXEC
289300171130
289400171130              EXEC SQL
289500171130                CREATE TABLE QTEMP/TMPACCINV
289600171130                 (MFR_GROUP_CODE    CHAR   (04)
289700171130                                    NOT NULL WITH  DEFAULT,
289800171130                  ACCOUNT_NO        NUM   (9,0)
289900171130                                    NOT NULL WITH  DEFAULT,
290000171130                  INVESTMENT_CODE   CHAR   (05)
290100171130                                    NOT NULL WITH  DEFAULT,
290200171130                  TRADE_DATE        NUM   (8,0)
290300171130                                    NOT NULL WITH  DEFAULT,
290400171130                  INV_ASSETS_AMT    DEC   (13,2)
290500171130                                    NOT NULL WITH  DEFAULT,
290600171130                  INV_MARKET_VALUE  DEC   (13,2)
290700171130                                    NOT NULL WITH  DEFAULT)
290800171130              END-EXEC
290900171130
291000171130             MOVE SQLSTATE      TO lc_sqlStates
291100171130             IF lncc_sqlSuccessful
291200171130                CONTINUE
291300171130             ELSE
291400171130                SET lncc_Err-07         TO TRUE
291500171130                MOVE lc_ErrCodeDescr07  TO lc_sqlErrShortDESCR
291600171130             END-IF
291700171130
291800171130              EXEC SQL
291900171130               DECLARE TOT_MFR_CURSOR CURSOR FOR
292000180108      *RFS1000551-Starts
292100180106      *        SELECT HHLDIVR.TRADE_DATE,
292200180106               SELECT DISTINCT
292300180106                      HHLDIVR.TRADE_DATE,
292400180108      *RFS1000551-Ends
292500171130                      HHLDIVR.MFR_GROUP_CODE,
292600171130                      HHLDIVR.INVESTOR_NO,
292700171130                      HHLDIVR.ACCOUNT_NO,
292800180108      *RFS1000551-Starts
292900180108      *               HHLDIVR.INVESTMENT_CODE,
293000180108      *RFS1000551-Ends
293100171130                      HHLDIVR.ASSETS_BY_RULE,
293200171130               CASE WHEN HHLDIVR.OVR_MFR_SCHEDULE_CODE = " "
293300171130                    THEN HHLDIVR.MFR_SCHEDULE_CODE
293400171130               ELSE HHLDIVR.OVR_MFR_SCHEDULE_CODE END,
293500171130               CASE WHEN HHLDIVR.ASSETS_BY_RULE = "3"
293600171130                    THEN HHLDIVR.TOT_IVR_ASSETS_AMT
293700171130               ELSE HHLDIVR.TOT_ACC_ASSETS_AMT END,
293800171130               CASE WHEN HHLDIVR.ASSETS_BY_RULE = "3"
293900171130                    THEN HHLDIVR.TOT_IVR_MARKET_VALUE
294000171130               ELSE HHLDIVR.TOT_ACC_MARKET_VALUE END
294100171130               FROM  QTEMP/TMPHHLDIVR HHLDIVR
294200171130
294300171130               INNER JOIN MFAMFRDTP MFRDTP ON
294400171130               HHLDIVR.MFR_GROUP_CODE = MFRDTP.MFR_GROUP_CODE
294500171130               AND HHLDIVR.INVESTMENT_CODE
294600171130                   = MFRDTP.INVESTMENT_CODE
294700171130               WHERE HHLDIVR.ASSETS_BY_RULE IN ("2","3")
294800171130                 AND MFRDTP.MFR_CALCULATION_IND = "G"
294900171130               ORDER BY HHLDIVR.MFR_GROUP_CODE,
295000171130                        HHLDIVR.INVESTOR_NO,
295100171130                        HHLDIVR.ASSETS_BY_RULE  DESC,
295200171130                        HHLDIVR.ACCOUNT_NO,
295300171130                        HHLDIVR.TRADE_DATE
295400171130               END-EXEC
295500171130
295600171130             MOVE SQLSTATE      TO lc_sqlStates
295700171130             IF lncc_sqlSuccessful
295800171130                CONTINUE
295900171130             ELSE
296000171130                SET lncc_Err-08         TO TRUE
296100171130                MOVE lc_ErrCodeDescr08  TO lc_sqlErrShortDESCR
296200171130             END-IF
296300171130               END-IF.
296400171130
296500171130      *RFS167951 Ends
296600110516           GO TO INL-THE-REST.
296700110516
296800110516
296900110516       INL-ON-LINE-OPTION.
297000110516
297100110516           MOVE COMM-FROM-DATE
297200110516                             TO WS-QBEGIN-N.
297300110516           MOVE COMM-TO-DATE TO WS-QEND-N.
297400110516
297500110516RF4556* Leap year calculation  for end date
297600110516
297700110516RF4556     DIVIDE WS-QEND-YY BY 4 GIVING WS-LEAP0
297800110516RF4556     REMAINDER WS-LEAP1.
297900110516
298000110516RF4556        IF WS-LEAP1 = 0
298100110516RF4556           MOVE 366 TO WS-DAYS-IN-YEAR
298200110516RF4556        ELSE
298300110516RF4556           MOVE 365 TO WS-DAYS-IN-YEAR
298400110516RF4556        END-IF.
298500110516
298600110516
298700110516           PERFORM LOAD-INITIAL-ARRAY.
298800110516
298900110516       INL-THE-REST.
299000110516
299100110516           CLOSE INVESTMENT-UNIT-PRICE
299200110516                 BUSINESS-DAY-FILE.
299300110516
299400110516           MOVE LOW-VALUES   TO CURR-CONTROLS
299500110516                                PREV-CONTROLS.
299600110516
299700110516           ACCEPT WS-SYSTIME-LONG FROM TIME.
299800110516           ACCEPT WS-SYSDATE-YMD  FROM DATE.
299900110516
300000110516           IF WS-SYSDATE-YY LESS THAN 80
300100110516              MOVE 20        TO WS-SYSDATE-CC
300200110516           ELSE
300300110516              MOVE 19        TO WS-SYSDATE-CC
300400110516           END-IF.
300500171030
300600171130      *RFS167951 Starts
300700171130           IF COMM-PROCESS-OPTION = "B" AND
300800171130              lb_IvrAccLvlNo            AND
300900171130              lc-ASBOneOnlyNo
301000171130                IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
301100171130                   GO TO ML-1200
301200171130                ELSE
301300171130                  GO TO ML-0010
301400171130                END-IF
301500171130           END-IF.
301600171130      *RFS167951 Ends
301700171030
301800110516       INL-EXIT.
301900110516           EXIT.
302000110516      /
302100110516       END-JOB SECTION.
302200110516
302300110516           CLOSE TRANS
302400110516                 ACCOUNT-INVESTMENT
302500110516                 MFR-SCHEDULE
302600171016167951           EXCHANGE-RATE-M
302700110516      *RFS 34759 - Start
302800110516                 Inv-Ass-Alloc-Mod-Sch-Hd
302900110516                 Inv-Ass-Alloc-Model-Sch-Dt.
303000110516      *RFS 34759 - End
303100110516
303200110516
303300110516      * RFS49699 - Begin
303400110516
303500110516           MOVE "LOGARR"               to Pass-Screen-Code.
303600110516           MOVE "LOGARR"               to Pass-Edit-Code.
303700110516           MOVE "N"                    to Pass-Level-Code.
303800110516
303900110516           call "FXSCEDTAL1" using Pass-Screen-Code
304000110516                                   Pass-Edit-Code
304100110516                                   Pass-Level-Code
304200110516                                   Retn-Edit-Allowed-Flag.
304300110516
304400110516           IF Retn-Edit-Allowed
304500110516               PERFORM ARRAY-LOGGING
304600110516           END-IF.
304700110516
304800110516      * RFS49699 - End
304900110516
305000110516
305100110516           IF COMM-PROCESS-OPTION = "O"
305200110516             GO TO EOJ-EXIT
305300110516           END-IF.
305400110516
305500110516      * Close Batch process files
305600110516
305700110516           CLOSE MFR-PROCESS.
305800110516
305900110516       EOJ-EXIT.
306000110516           EXIT.
306100110516      * RFS49699 - Begin call array logging if on!
306200110516
306300110516       ARRAY-LOGGING SECTION.
306400110516
306500110516           MOVE "MFRCALC"              TO  pp-Program-Name.
306600110516
306700110516           MOVE WS-ARRAY1-NAME         TO  pp-Array-Name.
306800110516           SET  WS-ARR-INVUPLB         TO  TRUE.
306900110516           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
307000110516           MOVE WS-ARRAY1-MAX          TO  pp-Max-Size.
307100110516           MOVE WS-ARRAY1-MAX-USED     TO  pp-Max-Size-Used.
307200110516           MOVE SPACES                 TO  rp-Err-Flag.
307300110516
307400110516           CALL "FXLOGAU"      using PR-FXLOGAU.
307500110516
307600110516           MOVE WS-ARRAY2-NAME         TO  pp-Array-Name.
307700110516           SET  WS-ARR-MFRSCP          TO  TRUE.
307800110516           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
307900110516           MOVE WS-ARRAY2-MAX          TO  pp-Max-Size.
308000110516           MOVE WS-ARRAY2-MAX-USED     TO  pp-Max-Size-Used.
308100110516           MOVE SPACES                 TO  rp-Err-Flag.
308200110516
308300110516           CALL "FXLOGAU"      using PR-FXLOGAU.
308400110516
308500110516           MOVE WS-ARRAY3-NAME         TO  pp-Array-Name.
308600110516           SET  WS-ARR-BUSDAP          TO  TRUE.
308700110516           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
308800110516           MOVE WS-ARRAY3-MAX          TO  pp-Max-Size.
308900110516           MOVE WS-ARRAY3-MAX-USED     TO  pp-Max-Size-Used.
309000110516           MOVE SPACES                 TO  rp-Err-Flag.
309100110516
309200110516           CALL "FXLOGAU"      using PR-FXLOGAU.
309300110516
309400110516           MOVE WS-ARRAY4-NAME         TO  pp-Array-Name.
309500110516           SET  WS-ARR-INVMNT          TO  TRUE.
309600110516           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
309700110516           MOVE WS-ARRAY4-MAX          TO  pp-Max-Size.
309800110516           MOVE WS-ARRAY4-MAX-USED     TO  pp-Max-Size-Used.
309900110516           MOVE SPACES                 TO  rp-Err-Flag.
310000110516
310100110516           CALL "FXLOGAU"      using PR-FXLOGAU.
310200110516
310300110516           MOVE WS-ARRAY5-NAME         TO  pp-Array-Name.
310400110516           SET  WS-ARR-BUSDAP          TO  TRUE.
310500110516           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
310600110516           MOVE WS-ARRAY5-MAX          TO  pp-Max-Size.
310700110516           MOVE WS-ARRAY5-MAX-USED     TO  pp-Max-Size-Used.
310800110516           MOVE SPACES                 TO  rp-Err-Flag.
310900110516
311000110516           CALL "FXLOGAU"      using PR-FXLOGAU.
311100110516           CANCEL  "FXLOGAU".
311200110516
311300110516       ARL-EXIT.
311400110516           EXIT.
311500110516
311600110516      * RFS49699 - End
311700110516      /
311800110516       LOAD-INITIAL-ARRAY SECTION.
311900110516      ** LOAD BUSINESS-DAY ARRAY
312000110516       LIA-DAYS.
312100110516      ** INITIALIZE
312200110516           INITIALIZE WS-BUSINESS-DAY-ARRAY.
312300110516
312400110516           SET BUDIDX        TO 1.
312500110516           SET BUDIDX        DOWN BY 1.
312600110516
312700110516       LIA-D-0010.
312800110516
312900110516           MOVE WS-QBEGIN-N  TO BUSINESS-DAY OF BUD-REC.
313000110516
313100110516           START BUSINESS-DAY-FILE
313200110516           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
313300110516           INVALID KEY
313400110516             MOVE HIGH-VALUES TO CURR-CONTROLS
313500110516             GO TO LIA-EXIT.
313600110516
313700110516       LIA-D-0020.
313800110516
313900110516           READ BUSINESS-DAY-FILE NEXT RECORD
314000110516           AT END
314100110516             SET BUDMAX      TO BUDIDX
314200110516             MOVE "Y"        TO WS-B-BUDIDX-END(BUDIDX)
314300110516             GO TO LIA-EXIT.
314400110516
314500110516           IF BUSINESS-DAY OF BUD-REC IS GREATER THAN WS-QEND-N
314600110516             SET BUDMAX      TO BUDIDX
314700110516             MOVE "Y"        TO WS-B-BUDIDX-END(BUDIDX)
314800110516             GO TO LIA-EXIT
314900110516           END-IF.
315000110516
315100110516           SET BUDIDX UP BY 1.
315200110516
315300110516      * RFS49699 - Array logging logic
315400110516
315500110516           IF BUDIDX           > WS-ARRAY3-MAX-USED
315600110516               MOVE BUDIDX                 TO WS-ARRAY3-MAX-USED
315700110516           END-IF.
315800110516
315900110516      * RFS49699 - End
316000110516
316100110516           MOVE "N"          TO WS-B-BUDIDX-END(BUDIDX).
316200110516           MOVE BUSINESS-DAY OF BUD-REC
316300110516                             TO WS-B-DATE(BUDIDX).
316400110516           MOVE ALLOW-TRADING OF BUD-REC
316500110516                             TO WS-B-TRADING(BUDIDX).
316600110516
316700110516       LIA-PRICE.
316800110516
316900110516           IF COMM-PROCESS-OPTION = "O"
317000110516             GO TO LIA-P-ON-LINE-OPTION
317100110516           END-IF.
317200110516
317300110516           SET BUDIDX2       TO 1.
317400110516           SET BUDIDX2       DOWN BY 1.
317500110516
317600110516       LIA-P-0010.
317700110516
317800110516           MOVE LOW-VALUES   TO INVESTMENT-CODE OF INVESTMENT.
317900110516
318000110516           START INVESTMENT
318100110516           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
318200110516           INVALID KEY
318300110516             MOVE HIGH-VALUES TO CURR-CONTROLS
318400110516             GO TO LIA-EXIT.
318500110516
318600110516       LIA-P-0020.
318700110516           READ INVESTMENT NEXT RECORD
318800110516           AT END
318900110516             MOVE "Y"        TO WS-B-BUDIDX2-END(BUDIDX, BUDIDX2)
319000110516             GO TO LIA-D-0020.
319100110516
319200110516
319300110516       LIA-P-BATCH-OPTION.
319400110516      *RFS 34759 - Start  -Keep bellow logic if not phantom fund.
319500110516      *                   -Removed periods within IF/END-IF.
319600110516           MOVE lnc-Y TO lc-LoadBatchPrc.
319700110516           PERFORM Get-Product-Type-Rule.
319800110516           INITIALIZE lc-LoadBatchPrc.
319900110516           IF NOT lc-Phantom
320000110516              SET BUDIDX2 UP BY 1
320100110516      * RFS49699 - Array logging logic
320200110516
320300110516              IF BUDIDX2          > WS-ARRAY4-MAX-USED
320400110516                  MOVE BUDIDX2                TO WS-ARRAY4-MAX-USED
320500110516              END-IF
320600110516
320700110516      * RFS49699 - End
320800110516              MOVE INVESTMENT-CODE OF INVESTMENT
320900110516                             TO WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2)
321000110516
321100171016167951        MOVE CURRENCY-DDS OF INVESTMENT
321200171012167951                      TO WS-B-CURR(BUDIDX, BUDIDX2)
321300171012
321400110516              MOVE INVESTMENT-CODE OF INVESTMENT
321500110516                             TO INVESTMENT-CODE
321600110516                             OF INVESTMENT-UNIT-PRICE
321700110516
321800110516              GO TO LIA-P-GET-PRICE
321900110516           END-IF.
322000110516
322100110516      *Find holding funds for a phantom fund for batch option.
322200110516           IF lc-Phantom
322300110516      *RFS 38381 - Begin
322400110516              PERFORM INIT-ARRAY-AMT
322500110516              VARYING TOT-IDX  FROM 1 BY 1
322600110516              UNTIL TOT-IDX  IS GREATER THAN BUDMAX
322700110516      *RFS 38381 - End
322800110516              MOVE Investment-Code OF Investment
322900110516                TO lc-InvestmentCodeAAP
323000110516              PERFORM Get-Holding-Fund-Start
323100110516              PERFORM Get-Next-Holding-Fund
323200110516           END-IF.
323300110516
323400110516       LIA-P-BATCH-OPTION-01.
323500110516           IF lb-EOFHoldingFalse
323600110516              IF lc-InvestmentCodeAAH NOT = " "
323700110516                 SET BUDIDX2 UP BY 1
323800110516                 MOVE lc-InvestmentCodeAAH
323900110516                   TO WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2)
324000110516                 MOVE lc-InvestmentCodeAAH
324100110516                   TO Investment-Code OF Investment-Unit-Price
324200110516                 GO TO LIA-P-GET-PRICE
324300110516              ELSE
324400110516                 PERFORM Get-Next-Holding-Fund
324500110516                 GO TO LIA-P-BATCH-OPTION-01
324600110516              END-IF
324700110516           END-IF.
324800110516           IF lb-EOFHoldingTrue
324900110516              GO TO LIA-P-0020
325000110516           END-IF.
325100110516
325200110516      *RFS 34759 - End
325300110516
325400110516       LIA-P-ON-LINE-OPTION.
325500110516      *RFS 34759 - Start -Keep bellow logic if not phantom fund.
325600110516      *                  -Removed periods within IF/END-IF.
325700110516           PERFORM Get-Product-Type-Rule.
325800110516           IF NOT lc-Phantom
325900110516              SET BUDIDX2 TO 1
326000110516              MOVE COMM-INVESTMENT-CODE
326100110516                             TO WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2)
326200110516
326300110516              MOVE COMM-INVESTMENT-CODE
326400110516                             TO INVESTMENT-CODE
326500110516                             OF INVESTMENT-UNIT-PRICE
326600110516
326700110516              GO TO LIA-P-GET-PRICE
326800110516           END-IF.
326900110516
327000110516      *Find holding funds for a phantom fund for on line option.
327100110516           IF lc-Phantom
327200110516      *RFS 38381 - Begin
327300110516              PERFORM INIT-ARRAY-AMT
327400110516              VARYING TOT-IDX  FROM 1 BY 1
327500110516              UNTIL TOT-IDX  IS GREATER THAN BUDMAX
327600110516      *RFS 38381 - End
327700110516              SET BUDIDX2       TO 1
327800110516              SET BUDIDX2       DOWN BY 1
327900110516              MOVE Comm-Investment-Code TO lc-InvestmentCodeAAP
328000110516              PERFORM Get-Holding-Fund-Start
328100110516              PERFORM Get-Next-Holding-Fund
328200110516           END-IF.
328300110516
328400110516       LIA-P-ON-LINE-OPTION-01.
328500110516           IF lb-EOFHoldingFalse
328600110516              IF lc-InvestmentCodeAAH NOT = " "
328700110516                 SET BUDIDX2 UP BY 1
328800110516                 MOVE lc-InvestmentCodeAAH
328900110516                   TO WS-B-INVESTMENT-CODE(BUDIDX, BUDIDX2)
329000110516                 MOVE lc-InvestmentCodeAAH
329100110516                   TO Investment-Code OF Investment-Unit-Price
329200110516                 GO TO LIA-P-GET-PRICE
329300110516              ELSE
329400110516                 PERFORM Get-Next-Holding-Fund
329500110516                 GO TO LIA-P-ON-LINE-OPTION-01
329600110516              END-IF
329700110516           END-IF.
329800110516           IF lb-EOFHoldingTrue
329900110516              GO TO LIA-D-0020
330000110516           END-IF.
330100110516
330200110516      *RFS 34759 - End
330300110516
330400110516       LIA-P-GET-PRICE.
330500110516           MOVE WS-B-DATE(BUDIDX)
330600110516                             TO TRADE-DATE
330700110516                             OF INVESTMENT-UNIT-PRICE.
330800110516
330900110516           READ INVESTMENT-UNIT-PRICE
331000110516           INVALID KEY
331100110516             PERFORM GET-LAST-UNIT-PRICE
331200110516             MOVE WS-LAST-PRICE TO UNIT-PRICE
331300110516                             OF INVESTMENT-UNIT-PRICE.
331400110516
331500110516           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
331600110516                             TO WS-B-PRICE(BUDIDX, BUDIDX2).
331700110516
331800171130      *RFS167951 Starts
331900171130           PERFORM GET-EXCHANGE-RATE THRU GTER-EXIT.
332000171130           IF WS-EXCHANGE-RATE = ZERO
332100171130              MOVE 1 TO WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
332200171130           ELSE
332300171130              MOVE WS-EXCHANGE-RATE
332400171130                     TO WS-B-EXCHG-RATE(BUDIDX, BUDIDX2)
332500171130           END-IF.
332600171130      *RFS167951 Ends
332700171012
332800110516      *RFS 34759 - Start
332900110516           IF lc-Phantom AND
333000110516              lb-EOFHoldingFalse
333100110516                 PERFORM Get-Next-Holding-Fund
333200110516              IF Comm-Process-Option = "O"
333300110516                 GO TO LIA-P-ON-LINE-OPTION-01
333400110516              ELSE
333500110516                 GO TO LIA-P-BATCH-OPTION-01
333600110516              END-IF
333700110516           END-IF.
333800110516      *RFS 34759 - End
333900110516
334000110516           IF COMM-PROCESS-OPTION = "O"
334100110516             GO TO LIA-D-0020
334200110516           ELSE
334300110516             GO TO LIA-P-0020
334400110516           END-IF.
334500110516
334600110516       LIA-EXIT.
334700110516           EXIT.
334800110516      /
334900110516       GET-LAST-UNIT-PRICE SECTION.
335000110516
335100110516           IF BUDIDX IS NOT EQUAL TO 1
335200110516             SET BUDIDX DOWN BY 1
335300110516             MOVE WS-B-PRICE(BUDIDX, BUDIDX2)
335400110516                             TO WS-LAST-PRICE
335500110516             SET BUDIDX UP BY 1
335600110516             GO TO GLUP-EXIT
335700110516           END-IF.
335800110516
335900110516           IF COMM-PROCESS-OPTION = "O"
336000110516             GO TO GLUP-ON-LINE-OPTION-1
336100110516           END-IF.
336200110516
336300110516      *RFS 34759 - Start
336400110516      *If phantom fund entered, find last unit price for a holding fund.
336500110516      *If not phantom fund, keep existing logic to find last unit price.
336600110516           IF lc-Phantom
336700110516              MOVE lc-InvestmentCodeAAH
336800110516                             TO INVESTMENT-CODE
336900110516                             OF INVESTMENT-UNIT-PRICE
337000110516           ELSE
337100110516              MOVE INVESTMENT-CODE OF INVESTMENT
337200110516                             TO INVESTMENT-CODE
337300110516                             OF INVESTMENT-UNIT-PRICE
337400110516           END-IF.
337500110516      *RFS 34759 - End
337600110516
337700110516           GO TO GLUP-GET-PRICE.
337800110516
337900110516       GLUP-ON-LINE-OPTION-1.
338000110516
338100110516      *RFS 34759 - Start
338200110516      *If phantom fund entered, find last unit price for a holding fund.
338300110516      *If not phantom fund, keep existing logic to find last unit price.
338400110516           IF lc-Phantom
338500110516              MOVE lc-InvestmentCodeAAH
338600110516                             TO INVESTMENT-CODE
338700110516                             OF INVESTMENT-UNIT-PRICE
338800110516           ELSE
338900110516              MOVE COMM-INVESTMENT-CODE
339000110516                             TO INVESTMENT-CODE
339100110516                             OF INVESTMENT-UNIT-PRICE
339200110516           END-IF.
339300110516      *RFS 34759 - End
339400110516
339500110516       GLUP-GET-PRICE.
339600110516
339700110516           MOVE WS-B-DATE(BUDIDX)
339800110516                             TO TRADE-DATE
339900110516                             OF INVESTMENT-UNIT-PRICE.
340000110516
340100110516           START INVESTMENT-UNIT-PRICE
340200110516           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
340300110516           INVALID KEY
340400110516             MOVE 0          TO WS-LAST-PRICE
340500110516             GO TO GLUP-EXIT.
340600110516
34070011051642749  GLUP-GET-PRIOR.
340800110516
340900110516           READ INVESTMENT-UNIT-PRICE PRIOR RECORD
341000110516           AT END
341100110516             MOVE 0          TO WS-LAST-PRICE
341200110516             GO TO GLUP-EXIT.
341300110516
341400110516           IF COMM-PROCESS-OPTION = "O"
341500110516             GO TO GLUP-ON-LINE-OPTION-2
341600110516           END-IF.
341700110516
341800110516      *RFS 34759 - Start
341900110516      *    IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE
342000110516      *    IS NOT EQUAL TO INVESTMENT-CODE OF INVESTMENT
342100110516           IF (NOT lc-Phantom AND
342200110516               Investment-Code OF Investment-Unit-Price NOT =
342300110516               Investment-Code OF Investment) OR
342400110516              (lc-Phantom AND
342500110516               Investment-Code OF Investment-Unit-Price NOT =
342600110516               lc-InvestmentCodeAAH)
342700110516      *RFS 34759 - End
342800110516             MOVE 0          TO WS-LAST-PRICE
342900110516             GO TO GLUP-EXIT.
343000110516
343100110516      *rfs42749 begins
343200180131      *RFS177476 - Starts
343300180131      *      IF Distribution-Flag of Investment-Unit-Price = lc-S
343400180131             IF Distribution-Flag of Investment-Unit-Price
343500180131                NOT EQUAL TO SPACES
343600180131      *RFS177476 - Ends
343700110516                Go to GLUP-GET-PRIOR
343800110516             END-IF.
343900110516      *rfs42749 ends
344000110516
344100110516           GO TO GLUP-SET-PRICE.
344200110516
344300110516       GLUP-ON-LINE-OPTION-2.
344400110516
344500110516      *RFS 34759 - Start
344600110516      *    IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE
344700110516      *    IS NOT EQUAL TO COMM-INVESTMENT-CODE
344800110516           IF (NOT lc-Phantom AND
344900110516               Investment-Code OF Investment-Unit-Price NOT =
345000110516               Comm-Investment-Code) OR
345100110516              (lc-Phantom AND
345200110516               Investment-Code OF Investment-Unit-Price NOT =
345300110516               lc-InvestmentCodeAAH)
345400110516      *RFS 34759 - End
345500110516
34560011051642749       OR  Distribution-Flag of Investment-Unit-Price = lc-S
345700110516
345800110516             MOVE 0          TO WS-LAST-PRICE
345900110516           GO TO GLUP-EXIT.
346000110516
346100110516       GLUP-SET-PRICE.
346200110516
346300110516           MOVE UNIT-PRICE OF IUP-REC
346400110516                             TO WS-LAST-PRICE.
346500110516
346600110516       GLUP-EXIT.
346700110516           EXIT.
346800110516       REJECTION-ROUTINE SECTION.
346900110516      **********************************************
347000110516      ** REJECTION HANDLING ROUTINE               **
347100110516      **********************************************
347200110516           IF COMM-PROCESS-OPTION = "O"
347300110516             GO TO RR-ON-LINE-OPTION
347400110516           END-IF.
347500110516
347600110516           MOVE WS-REJECTION-CODE
347700110516                             TO REJECTION-CODE OF MFR-PROCESS.
347800110516
347900110516      *RFS 34759 - Start
348000110516      *    REWRITE MFR-PROCESS-REC.
348100110516           REWRITE MFR-PROCESS-REC
348200110516           INVALID KEY
348300110516             CONTINUE.
348400110516      *RFS 34759 - End
348500110516           GO TO RR-EXIT.
348600110516
348700110516       RR-ON-LINE-OPTION.
348800110516           MOVE WS-REJECTION-CODE
348900110516                             TO COMM-REJECTION-CODE.
349000110516
349100110516       RR-EXIT.
349200110516           EXIT.
349300110516
349400110516      *RFS 34759 - Start
349500110516
349600110516      /
349700110516       Get-Product-Type-Rule SECTION.
349800110516           MOVE SPACES TO lc-InvestmentCode
349900110516                          lc-ProductTypeRule.
350000110516
350100110516           IF Comm-Process-Option = "O"
350200110516              MOVE Comm-Investment-Code
350300110516                TO lc-InvestmentCode
350400110516           ELSE
350500110516              MOVE Investment-Code of MFR-Process
350600110516                TO lc-InvestmentCode
350700110516           END-IF.
350800110516
350900110516           IF lc-LoadBatchPrc = lnc-Y
351000110516              MOVE Investment-Code of Investment
351100110516                TO lc-InvestmentCode
351200110516           END-IF.
351300110516
351400110516           EXEC SQL
351500110516                SELECT prtcdp.Product_Type_Rule
351600110516                INTO   :lc-ProductTypeRule
351700110516                FROM   Mfainvp invp, Mfaprtcdp prtcdp
351800110516                WHERE  invp.Investment_Code = :lc-InvestmentCode AND
351900110516                       invp.Product_Type_Code =
352000110516                       prtcdp.Product_Type_Code
352100110516           END-EXEC.
352200110516
352300110516      /
352400110516       Get-Holding-Fund-Start SECTION.
352500110516
352600110516      *Get AS-AT-DATE from data area MFAPRCDTP
352700110516           INITIALIZE lc-ProcessDate.
352800110516           CALL "RTVPRCDTP" USING lc-ProcessDate.
352900110516
353000110516      *Start and read Inv-Ass-Alloc-Mod-Sch-Hd to get Start-Date.
353100110516
353200110516           INITIALIZE Mfaiamshp OF Inv-Ass-Alloc-Mod-Sch-Hd-Rec.
353300110516
353400110516           INITIALIZE lc-ModelHdrEnd.
353500110516
353600110516           MOVE lc-InvestmentCodeAAP
353700110516             TO Investment-Code2 OF Inv-Ass-Alloc-Mod-Sch-Hd.
353800110516
353900110516           MOVE 999999999
354000110516             TO Start-Date       OF Inv-Ass-Alloc-Mod-Sch-Hd.
354100110516
354200110516           START Inv-Ass-Alloc-Mod-Sch-Hd
354300110516             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
354400110516             INVALID KEY
354500110516               INITIALIZE Mfaiamshp OF Inv-Ass-Alloc-Mod-Sch-Hd-Rec
354600110516               MOVE lnc-Y TO lc-ModelHdrEnd
354700110516             NOT INVALID KEY
354800110516               PERFORM Find-Next-Inv-Model-Hdr
354900110516                 UNTIL lc-ModelHdrEnd = lnc-Y
355000110516           END-START.
355100110516
355200110516      *Start to get holding funds.
355300110516
355400110516           INITIALIZE Mfaiamsdp OF Inv-Ass-Alloc-Model-Sch-Dt-Rec.
355500110516           INITIALIZE lc-InvestmentCodeAAH.
355600110516           SET lb-EOFHoldingFalse TO True.
355700110516
355800110516           MOVE Investment-Code2 OF Inv-Ass-Alloc-Mod-Sch-Hd
355900110516             TO Investment-Code2 OF Inv-Ass-Alloc-Model-Sch-Dt.
356000110516
356100110516           MOVE AA-Model-Code    OF Inv-Ass-Alloc-Mod-Sch-Hd
356200110516             TO AA-Model-Code    OF Inv-Ass-Alloc-Model-Sch-Dt.
356300110516
356400110516           MOVE Start-Date       OF Inv-Ass-Alloc-Mod-Sch-Hd
356500110516             TO Start-Date       OF Inv-Ass-Alloc-Model-Sch-Dt.
356600110516
356700110516           MOVE LOW-VALUES
356800110516             TO Investment-Code  OF Inv-Ass-Alloc-Model-Sch-Dt.
356900110516
357000110516           START Inv-Ass-Alloc-Model-Sch-Dt
357100110516             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
357200110516             INVALID KEY
357300110516               INITIALIZE Mfaiamsdp OF Inv-Ass-Alloc-Model-Sch-Dt-Rec
357400110516               SET lb-EOFHoldingTrue TO True
357500110516           END-START.
357600110516
357700110516      /
357800110516       Get-Next-Holding-Fund SECTION.
357900110516           INITIALIZE lc-InvestmentCodeAAH.
358000110516           READ Inv-Ass-Alloc-Model-Sch-Dt NEXT
358100110516             AT END
358200110516                INITIALIZE lc-InvestmentCodeAAH
358300110516                SET lb-EOFHoldingTrue TO True
358400110516           END-READ.
358500110516
358600110516           IF Investment-Code2 of Inv-Ass-Alloc-Model-Sch-Dt NOT =
358700110516              Investment-Code2 of Inv-Ass-Alloc-Mod-Sch-Hd OR
358800110516              AA-Model-Code    of Inv-Ass-Alloc-Model-Sch-Dt NOT =
358900110516              AA-Model-Code    of Inv-Ass-Alloc-Mod-Sch-Hd OR
359000110516              Start-Date       of Inv-Ass-Alloc-Model-Sch-Dt NOT =
359100110516              Start-Date       of Inv-Ass-Alloc-Mod-Sch-Hd
359200110516                INITIALIZE lc-InvestmentCodeAAH
359300110516                SET lb-EOFHoldingTrue TO True
359400110516           END-IF.
359500110516
359600110516           IF lb-EOFHoldingFalse
359700110516              IF Percent-Allocation of Inv-Ass-Alloc-Model-Sch-Dt > 0
359800110516                 MOVE Investment-Code of Inv-Ass-Alloc-Model-Sch-Dt
359900110516                   TO lc-InvestmentCodeAAH
360000110516              END-IF
360100110516           END-IF.
360200110516
360300110516      /
360400110516       Find-Next-Inv-Model-Hdr SECTION.
360500110516      *Read Inv-Ass-Alloc-Mod-Sch-Hd record to get
360600110516      *the latest Start-Date just before the As-At-Date.
360700110516      *Same logic as in AABSLTXN.
360800110516
360900110516           READ Inv-Ass-Alloc-Mod-Sch-Hd NEXT
361000110516             AT END
361100110516                INITIALIZE Mfaiamshp OF Inv-Ass-Alloc-Mod-Sch-Hd-Rec
361200110516                MOVE lnc-Y TO lc-ModelHdrEnd
361300110516           END-READ.
361400110516
361500110516           IF Investment-Code2 OF Inv-Ass-Alloc-Mod-Sch-Hd =
361600110516              lc-InvestmentCodeAAP AND
361700110516              Percent-Allocation-Total
361800110516                         OF Inv-Ass-Alloc-Mod-Sch-Hd = 100 AND
361900110516              Start-Date OF Inv-Ass-Alloc-Mod-Sch-Hd < li-AsAtDate
362000110516                MOVE lnc-Y TO lc-ModelHdrEnd
362100110516           END-IF.
362200110516
362300110516      /
362400110516       Get-MFR-Calc-Ind SECTION.
362500110516           INITIALIZE lc-MFRGroupCode
362600110516                      lc-InvestmentCode.
362700110516
362800110516           IF Comm-Process-Option = "O"
362900110516              MOVE Comm-MFR-Group-Code TO lc-MFRGroupCode
363000110516              MOVE Comm-Investment-Code TO lc-InvestmentCode
363100110516           ELSE
363200110516              MOVE MFR-Group-Code  OF MFR-Process
363300110516                TO lc-MFRGroupCode
363400110516              MOVE Investment-Code OF MFR-Process
363500110516                TO lc-InvestmentCode
363600110516           END-IF.
363700110516
363800110516           EXEC SQL
363900110516              SELECT MFR_Calculation_Ind
364000110516              INTO   :lc-MFRCalcInd
364100110516              FROM   Mfamfrdtp
364200110516              WHERE  MFR_Group_Code = :lc-MFRGroupCode AND
364300110516                     Investment_Code = :lc-InvestmentCode
364400110516           END-EXEC.
364500110516      *RFS 34759 - End
364600110516      *RFS 38381 - Begin
364700110516
364800110516       INIT-ARRAY-AMT SECTION.
364900110516
365000110516           MOVE ZEROES       TO TOT-AMT(TOT-IDX).
365100110516
365200110516       PHANTOM-FUND-CALCUALTION SECTION.
365300110516
365400110516           MOVE 0 TO ln-Phmframt.
365500110516           PERFORM CAL-MFR-AMT
365600110516           VARYING TOT-IDX  FROM 1 BY 1
365700110516           UNTIL TOT-IDX  IS GREATER THAN BUDMAX.
365800110516
365900110516      * Reuse WS-TOT-MFR-AMT variable in order to calculate GST & PST
366000110516           MOVE ln-Phmframt TO WS-TOT-MFR-AMT.
366100110516
366200110516       CAL-MFR-AMT SECTION.
366300110516
366400110516           MOVE ZEROS        TO WS-RATE.
366500110516           SET MSIDX TO 1.
366600110516R79774*    SET MSIDX DOWN BY 1.
366700110516           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
366800110516           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
366900110516            AND WS-M-UPPER-LIMIT(MSIDX) >= TOT-AMT(TOT-IDX)
367000110516              MOVE WS-M-RATE(MSIDX) TO WS-RATE.
367100110516
367200110516           PERFORM Get-MFR-Calc-Ind
367300110516           IF lc-MFRCalcInd = lnc-G
367400110516              PERFORM PH-GRADUATED-CALCULATION
367500110516              ADD  ln-MfrAmtAAP TO ln-Phmframt
367600110516           ELSE
367700110516              COMPUTE ln-Phmframt ROUNDED =  ln-Phmframt +
367800110516               (TOT-AMT(TOT-IDX) * WS-RATE / 100 / WS-DAYS-IN-YEAR).
367900110516
368000110516       PH-GRADUATED-CALCULATION SECTION.
368100110516           MOVE 0 TO ln-MfrAmtAAP.
368200110516           MOVE TOT-AMT(TOT-IDX) TO WS-UNIT-VALUE.
368300110516      *    Search for the MFR schedule rate
368400110516
368500110516       PH-GC-NEXT-TIER.
368600110516
368700110516           SET MSIDX TO 1.
368800110516R79774*    SET MSIDX DOWN BY 1.
368900110516           SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
369000110516           WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
369100110516              AND WS-M-UPPER-LIMIT(MSIDX) >= WS-UNIT-VALUE
369200110516              MOVE WS-M-RATE(MSIDX) TO WS-RATE
369300110516           WHEN WS-M-SCHEDULE(MSIDX) = SPACES
369400110516              GO TO PH-GC-EXIT.
369500110516
369600110516           COMPUTE WS-MFR-VALUE ROUNDED  =
369700110516                 (WS-UNIT-VALUE - WS-M-LOWER-LIMIT(MSIDX))
369800110516                         * WS-RATE / 100 / WS-DAYS-IN-YEAR.
369900110516           ADD WS-MFR-VALUE TO ln-MfrAmtAAP.
370000110516           MOVE WS-M-LOWER-LIMIT(MSIDX) TO WS-UNIT-VALUE.
370100110516           IF WS-UNIT-VALUE NOT = 0
370200110516               GO TO PH-GC-NEXT-TIER.
370300110516
370400110516       PH-GC-EXIT.
370500110516           EXIT.
370600110516      * R38381 End
370700171011
370800171130      *RFS167951 Starts
370900171116      *------------------------------------
371000171116       GET-OVER-RIDE-MFR-SCHD-CODE SECTION.
371100171116      *------------------------------------
371200171011
371300171115            INITIALIZE  lc_ABRule,
371400171011                        lc_MfrSchdCode,
371500180128177476                  lc_SameCurr,
371600171115                        lc_OvrrideSchd.
371700171011
371800171011            EXEC SQL
371900171115             SELECT HHLDIVR.ASSETS_BY_RULE,
372000171029                    COALESCE(HHLDIVR.MFR_SCHEDULE_CODE," "),
372100180128177476              COALESCE(HHLDIVR.SAME_CURR," "),
372200171115                    HHLDIVR.OVR_MFR_SCHEDULE_CODE
372300171011
372400171115             INTO  :lc_ABRule :lc_NullIndicator,
372500171029                   :lc_MfrSchdCode :lc_NullIndicator,
372600180128177476             :lc_SameCurr :lc_NullIndicator,
372700171115                   :lc_OvrrideSchd :lc_NullIndicator
372800171011
372900171011             FROM QTEMP/TMPHHLDIVR HHLDIVR
373000171011
373100171029             WHERE HHLDIVR.MFR_GROUP_CODE  = :lc_MFR_Grp_code
373200171029               AND HHLDIVR.ACCOUNT_NO      = :ln_AccountNo
373300171029               AND HHLDIVR.INVESTMENT_CODE = :lc_InvestmentCode
373400171011             FETCH FIRST ROW ONLY
373500171011
373600171011            END-EXEC.
373700171011
373800171011            MOVE SQLSTATE      TO lc_sqlStates.
373900171011             IF lncc_sqlSuccessful
374000171011                CONTINUE
374100171011             ELSE
374200171011                SET lncc_Err-02         TO TRUE
374300171029                MOVE lc_ErrCodeDescr02  TO lc_sqlErrShortDESCR
374400171011             END-IF.
374500171011
374600171011            IF lc_OvrrideSchd IS NOT EQUAL TO  SPACES
374700171011               MOVE lc_OvrrideSchd TO WS-MFR-SCHEDULE
374800171011            END-IF.
374900171011
375000171116      *-----------------------------------
375100171116       GET-TOTAL-ASSET-MFR-AMOUNT SECTION.
375200171116      *-----------------------------------
375300171115
375400171115            INITIALIZE  ln_TotAssetsAmt,
375500171130                        ln_TotMfrAmt,
375600210623      *RFS186019 - Start
375700210623                        ln_SecondaryAssetsAmt,
375800210623                        ln_LastPaymentDate,
375900210701                        ln_EligibleForCalc,
376000210623      *RFS186019 - End
376100171130                        ln_TotMarketValue.
376200171115
376300171115            EXEC SQL
376400171115             SELECT CASE
376500210715                    WHEN HHLDIVR.ASSETS_BY_RULE = "3"
376600171115                    THEN COALESCE(HHLDIVR.TOT_IVR_ASSETS_AMT,0)
376700210715      *RFS186019 - Start
376800210715                    WHEN HHLDIVR.ASSETS_BY_RULE = "4"
376900210715                    THEN COALESCE(HHLDIVR.TOT_IVR_ASSETS_AMT,0)
377000210715      *RFS186019 - End
377100171115                    WHEN HHLDIVR.ASSETS_BY_RULE = "2"
377200171115                    THEN COALESCE(HHLDIVR.TOT_ACC_ASSETS_AMT,0)
377300171130                    ELSE COALESCE(HHLDIVR.INV_ASSETS_AMT,0)
377400171115                    END,
377500171115                    CASE
377600210715                    WHEN HHLDIVR.ASSETS_BY_RULE = "3"
377700171115                    THEN COALESCE(HHLDIVR.TOT_IVR_MFR_AMT,0)
377800210715      *RFS186019 - Start
377900210715                    WHEN HHLDIVR.ASSETS_BY_RULE = "4"
378000210715                    THEN COALESCE(HHLDIVR.TOT_IVR_MFR_AMT,0)
378100210715      *RFS186019 - End
378200171115                    WHEN HHLDIVR.ASSETS_BY_RULE = "2"
378300171115                    THEN COALESCE(HHLDIVR.TOT_ACC_MFR_AMT,0)
378400171115                    ELSE 0
378500171130                    END,
378600171130                    CASE
378700210715                    WHEN HHLDIVR.ASSETS_BY_RULE = "3"
378800171130                    THEN COALESCE(HHLDIVR.TOT_IVR_MARKET_VALUE,0)
378900210715      *RFS186019 - Start
379000210715                    WHEN HHLDIVR.ASSETS_BY_RULE = "4"
379100210715                    THEN COALESCE(HHLDIVR.TOT_IVR_MARKET_VALUE,0)
379200210715      *RFS186019 - End
379300171130                    WHEN HHLDIVR.ASSETS_BY_RULE = "2"
379400171130                    THEN COALESCE(HHLDIVR.TOT_ACC_MARKET_VALUE,0)
379500171130                    ELSE COALESCE(HHLDIVR.INV_MARKET_VALUE,0)
379600171130                    END
379700210630      *RFS186019 - Starts
379800210630                   ,CASE
379900210630                    WHEN SECONDARY_ASSETS_FLAG = "Y"
380000210630                    THEN COALESCE(
380100210630                    SEC_ASSET.HOUSEHOLD_SEC_ASSET_MARKET_VAL,0)
380200210630                    ELSE 0
380300210630                    END
380400210630                   ,COALESCE(ACCMFP.LAST_PAYMENT_DATE,0)
380500210713                   ,CASE WHEN :lc_EffectiveFlag = "Y"
380600210713                    THEN COALESCE(HHLDIVR.ELIGIBLE_FOR_CALC, "N")
380700210713                    ELSE "Y"
380800210713                    END
380900210630      *RFS186019 - End
381000171115             INTO  :ln_TotAssetsAmt :lc_NullIndicator,
381100171130                   :ln_TotMfrAmt :lc_NullIndicator,
381200171130                   :ln_TotMarketValue :lc_NullIndicator
381300210623      *RFS186019 - Start
381400210623                  ,:ln_SecondaryAssetsAmt :lc_NullIndicator
381500210623                  ,:ln_LastPaymentDate :lc_NullIndicator
381600210630                  ,:ln_EligibleForCalc :lc_NullIndicator
381700210623      *RFS186019 - End
381800171130
381900171115             FROM QTEMP/TMPHHLDIVR HHLDIVR
382000210623      *RFS186019 - Start
382100210630             LEFT OUTER JOIN
382200210630              (  SELECT HOUSEHOLD_ID,
382300210630                 HOUSEHOLD_SEC_ASSET_MARKET_VAL
382400210630                  FROM MFAIVRHSP
382500210630                 WHERE ( HOUSEHOLD_ID||
382600210630                         HOUSEHOLD_SEC_ASSET_EVAL_DATE)
382700210630                    IN ( SELECT ( HOUSEHOLD_ID
382800210630                         ||MAX(HOUSEHOLD_SEC_ASSET_EVAL_DATE))
382900210630                         FROM MFAIVRHSP
383000210630                         WHERE HOUSEHOLD_SEC_ASSET_EVAL_DATE
383100210630                                      <= :ld_TradeDte
383200210713                         GROUP BY HOUSEHOLD_ID ))
383300210713                            AS SEC_ASSET
383400210713                 ON SEC_ASSET.HOUSEHOLD_ID
383500210713                                        = HHLDIVR.HOUSEHOLD_ID
383600210630
383700210630                LEFT OUTER JOIN MFAACCMFP ACCMFP ON
383800210630                 ACCMFP.MFR_GROUP_CODE  =
383900210630                                  HHLDIVR.MFR_GROUP_CODE  AND
384000210630                 ACCMFP.ACCOUNT_NO      =
384100210630                               HHLDIVR.ACCOUNT_NO   AND
384200210630                 ACCMFP.INVESTMENT_CODE =
384300210630                               HHLDIVR.INVESTMENT_CODE
384400210623      *RFS186019 - End
384500171115
384600171115             WHERE HHLDIVR.MFR_GROUP_CODE  = :lc_MFR_Grp_code
384700171115               AND HHLDIVR.ACCOUNT_NO      = :ln_AccountNo
384800171115               AND HHLDIVR.INVESTMENT_CODE = :lc_InvestmentCode
384900171115               AND HHLDIVR.TRADE_DATE      = :ld_TradeDte
384901211013      *RFS1122059  - Begins
384902211013               AND HHLDIVR.ELIGIBLE_FOR_CALC = "Y"
384903211013      *RFS1122059  - Ends
385000171115             FETCH FIRST ROW ONLY
385100171115
385200171115            END-EXEC.
385300171115
385400171115            MOVE SQLSTATE      TO lc_sqlStates.
385500171115             IF lncc_sqlSuccessful
385600171115                CONTINUE
385700171115             ELSE
385800171115                SET lncc_Err-13         TO TRUE
385900171115                MOVE lc_ErrCodeDescr13  TO lc_sqlErrShortDESCR
386000171115             END-IF.
386100171115
386200171116      *-------------------------
386300171116       INSERT-TMPACCINV SECTION.
386400171116      *-------------------------
386500171011            EXEC SQL
386600171011               INSERT INTO QTEMP/TMPACCINV VALUES(
386700171011                                 :lc_MFR_Grp_code
386800171011                                ,:ln_AccountNo
386900171011                                ,:lc_InvestmentCode
387000171011                                ,:ld_TradeDte
387100171130                                ,:ln_InvAssetAmt
387200171130                                ,:ln_InvMarketValue)
387300171011            END-EXEC.
387400171011
387500171029            MOVE SQLSTATE      TO lc_sqlStates.
387600171029            IF lncc_sqlSuccessful
387700171029               CONTINUE
387800171029            ELSE
387900171029               SET lncc_Err-09         TO TRUE
388000171029               MOVE lc_ErrCodeDescr09  TO lc_sqlErrShortDESCR
388100171029            END-IF.
388200171011
388300171116      *-------------------------------------
388400171116       ACC-IVR-HHLD-TOT-MFR-PROCESS SECTION.
388500171116      *-------------------------------------
388600171011
388700171011            PERFORM UPDATE-ASSET-AMT-INV-LEVEL.
388800171011            PERFORM UPDATE-ASSET-AMT-ACC-LEVEL.
388900171011            PERFORM UPDATE-ASSET-AMT-IVR-LEVEL.
389000210801186019      PERFORM UPDATE-ASSET-AMT-IVR-SIN-LEVEL.
389100171130            PERFORM UPDATE-MARKET-VALUE-INV-LEVEL.
389200171130            PERFORM UPDATE-MARKET-VALUE-ACC-LEVEL.
389300171130            PERFORM UPDATE-MARKET-VALUE-IVR-LEVEL.
389400210801186019      PERFORM UPDATE-MRKT-VAL-IVR-SIN-LEVEL.
389500171011            PERFORM OPEN-TOT-MFR-CURSOR.
389600171011            SET lc-EndcursorNo TO TRUE.
389700171011            PERFORM FETCH-TOT-MFR-CURSOR UNTIL lc-EndcursorYes.
389800171011            PERFORM CLOSE-TOT-MFR-CURSOR.
389900171011            PERFORM CLOSE-ALL-FILE.
390000180709179061      PERFORM INSERT-WRKHHLDIVR-RECORDS.
390100171011
390200171116      *-----------------------------------
390300171116       UPDATE-ASSET-AMT-INV-LEVEL SECTION.
390400171116      *-----------------------------------
390500171011
390600171116            EXEC SQL
390700171116             CREATE VIEW QTEMP/ACCINV AS
390800171116            (SELECT DISTINCT *
390900171116             FROM QTEMP/TMPACCINV )
391000171116            END-EXEC
391100171116
391200171011            EXEC SQL
391300171011              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
391400171029              SET HHLDIVR.INV_ASSETS_AMT =
391500171029              (SELECT COALESCE(SUM(ACCINV.INV_ASSETS_AMT),0)
391600171116               FROM QTEMP/ACCINV ACCINV
391700171029               WHERE ACCINV.MFR_GROUP_CODE
391800171029                     = HHLDIVR.MFR_GROUP_CODE
391900171011               AND   ACCINV.ACCOUNT_NO = HHLDIVR.ACCOUNT_NO
392000171029               AND   ACCINV.INVESTMENT_CODE
392100171029                     = HHLDIVR.INVESTMENT_CODE
392200171115               AND   ACCINV.TRADE_DATE
392300171115                     = HHLDIVR.TRADE_DATE
392400171011              )
392500171011              WHERE EXISTS
392600171011                 (SELECT 1
392700171011                  FROM QTEMP/TMPHHLDIVR HHLDIVR1
392800171011                  WHERE HHLDIVR1.MFR_GROUP_CODE  =
392900171011                        HHLDIVR.MFR_GROUP_CODE  AND
393000171011                        HHLDIVR1.ACCOUNT_NO      =
393100171011                        HHLDIVR.ACCOUNT_NO      AND
393200171011                        HHLDIVR1.INVESTMENT_CODE =
393300171115                        HHLDIVR.INVESTMENT_CODE AND
393400171115                        HHLDIVR1.TRADE_DATE      =
393500171115                        HHLDIVR.TRADE_DATE)
393600171011              END-EXEC.
393700171011
393800171029              MOVE SQLSTATE      TO lc_sqlStates.
393900171029              IF lncc_sqlSuccessful
394000171029                 CONTINUE
394100171029              ELSE
394200171029                 SET lncc_Err-10         TO TRUE
394300171029                 MOVE lc_ErrCodeDescr10  TO lc_sqlErrShortDESCR
394400171029              END-IF.
394500171029
394600171116      *-----------------------------------
394700171116       UPDATE-ASSET-AMT-ACC-LEVEL SECTION.
394800171116      *-----------------------------------
394900171011
395000171029              EXEC SQL
395100171029               UPDATE QTEMP/TMPHHLDIVR HHLDIVR
395200171029               SET HHLDIVR.TOT_ACC_ASSETS_AMT =
395300171029               (SELECT COALESCE(SUM(HHLDIVR1.INV_ASSETS_AMT),0)
395400171029               FROM QTEMP/TMPHHLDIVR HHLDIVR1
395500171029               WHERE HHLDIVR1.MFR_GROUP_CODE
395600171029                     = HHLDIVR.MFR_GROUP_CODE
395700210801      *RFS186019 - Start
395800210801                 AND HHLDIVR1.HOUSEHOLD_ID
395900210801                      = HHLDIVR.HOUSEHOLD_ID
396000210801      *RFS186019 - End
396100171029                 AND HHLDIVR1.ACCOUNT_NO
396200171029                     = HHLDIVR.ACCOUNT_NO
396300171115                 AND HHLDIVR1.TRADE_DATE
396400171115                     = HHLDIVR.TRADE_DATE
396500171011                      )
396600171029               WHERE EXISTS
396700171029               (SELECT 1
396800171029               FROM QTEMP/TMPHHLDIVR HHLDIVR2
396900171029               WHERE HHLDIVR2.MFR_GROUP_CODE  =
397000171029                     HHLDIVR.MFR_GROUP_CODE
397100210801      *RFS186019 - Start
397200210801               AND HHLDIVR2.HOUSEHOLD_ID
397300210801                                        = HHLDIVR.HOUSEHOLD_ID
397400210801      *RFS186019 - End
397500171029               AND HHLDIVR2.ACCOUNT_NO  = HHLDIVR.ACCOUNT_NO
397600171115               AND HHLDIVR2.TRADE_DATE  = HHLDIVR.TRADE_DATE
397700171023                   )
397800171029              END-EXEC.
397900171011
398000171029              MOVE SQLSTATE      TO lc_sqlStates.
398100171029              IF lncc_sqlSuccessful
398200171029                 CONTINUE
398300171029              ELSE
398400171029                 SET lncc_Err-11         TO TRUE
398500171029                 MOVE lc_ErrCodeDescr11  TO lc_sqlErrShortDESCR
398600171029              END-IF.
398700171130
398800171116      *-----------------------------------
398900171116       UPDATE-ASSET-AMT-IVR-LEVEL SECTION.
399000171116      *-----------------------------------
399100171011            EXEC SQL
399200171029             UPDATE QTEMP/TMPHHLDIVR HHLDIVR
399300171029             SET HHLDIVR.TOT_IVR_ASSETS_AMT =
399400171029             (SELECT COALESCE(SUM(HHLDIVR1.INV_ASSETS_AMT),0)
399500171029             FROM QTEMP/TMPHHLDIVR HHLDIVR1
399600171029             WHERE HHLDIVR1.MFR_GROUP_CODE
399700171029                   = HHLDIVR.MFR_GROUP_CODE
399800171029              AND HHLDIVR1.INVESTOR_NO
399900171029                  = HHLDIVR.INVESTOR_NO
400000210801      *RFS186019 - Start
400100210801              AND HHLDIVR1.HOUSEHOLD_ID
400200210801                  = HHLDIVR.HOUSEHOLD_ID
400300210801              AND HHLDIVR1.ASSETS_BY_RULE
400400210801                  = HHLDIVR.ASSETS_BY_RULE
400500210801              AND HHLDIVR1.ASSETS_BY_RULE  = "3"
400600210801      *RFS186019 - End
400700171115              AND HHLDIVR1.TRADE_DATE
400800171115                  = HHLDIVR.TRADE_DATE
400900171029              )
401000171029             WHERE EXISTS
401100171029              (SELECT 1
401200171029              FROM QTEMP/TMPHHLDIVR HHLDIVR2
401300171029               WHERE HHLDIVR2.MFR_GROUP_CODE  =
401400171029                     HHLDIVR.MFR_GROUP_CODE
401500171029                 AND HHLDIVR2.INVESTOR_NO     =
401600171115                     HHLDIVR.INVESTOR_NO
401700210801      *RFS186019 - Start
401800210801                 AND HHLDIVR2.HOUSEHOLD_ID    =
401900210801                     HHLDIVR.HOUSEHOLD_ID
402000210801                 AND HHLDIVR2.ASSETS_BY_RULE  =
402100210801                     HHLDIVR.ASSETS_BY_RULE
402200210801                 AND HHLDIVR2.ASSETS_BY_RULE  = "3"
402300210801      *RFS186019 - End
402400171115                 AND HHLDIVR2.TRADE_DATE      =
402500171115                     HHLDIVR.TRADE_DATE )
402600171011            END-EXEC.
402700171011
402800171029              MOVE SQLSTATE      TO lc_sqlStates.
402900171029              IF lncc_sqlSuccessful
403000171029                 CONTINUE
403100171029              ELSE
403200171029                 SET lncc_Err-12         TO TRUE
403300171029                 MOVE lc_ErrCodeDescr12  TO lc_sqlErrShortDESCR
403400171029              END-IF.
403500210801      *RFS186019 - Start
403600210801      *---------------------------------------
403700210801       UPDATE-ASSET-AMT-IVR-SIN-LEVEL SECTION.
403800210801      *---------------------------------------
403900210801            EXEC SQL
404000210801             UPDATE QTEMP/TMPHHLDIVR HHLDIVR
404100210801             SET HHLDIVR.TOT_IVR_ASSETS_AMT =
404200210801             (SELECT COALESCE(SUM(HHLDIVR1.INV_ASSETS_AMT),0)
404300210801             FROM QTEMP/TMPHHLDIVR HHLDIVR1
404400210801             WHERE HHLDIVR1.MFR_GROUP_CODE  =
404500210801                   HHLDIVR.MFR_GROUP_CODE
404600210801              AND  HHLDIVR1.INVESTOR_NO      =
404700210801                   HHLDIVR.INVESTOR_NO
404800210801              AND  HHLDIVR1.HOUSEHOLD_ID     =
404900210801                   HHLDIVR.HOUSEHOLD_ID
405000210801              AND  HHLDIVR1.SIN_NO           =
405100210801                   HHLDIVR.SIN_NO
405200210801              AND  HHLDIVR1.SIN_NO   <> 0
405300210801              AND  HHLDIVR1.ASSETS_BY_RULE   =
405400210801                   HHLDIVR.ASSETS_BY_RULE
405500210801              AND  HHLDIVR1.ASSETS_BY_RULE   = "4"
405600210801              AND  HHLDIVR1.TRADE_DATE       =
405700210801                    HHLDIVR.TRADE_DATE
405800210801             )
405900210801             WHERE EXISTS
406000210801                (SELECT 1
406100210801                   FROM QTEMP/TMPHHLDIVR HHLDIVR2
406200210801                   WHERE HHLDIVR2.MFR_GROUP_CODE  =
406300210801                         HHLDIVR.MFR_GROUP_CODE
406400210801                     AND HHLDIVR2.INVESTOR_NO     =
406500210801                         HHLDIVR.INVESTOR_NO
406600210801                     AND HHLDIVR2.HOUSEHOLD_ID    =
406700210801                         HHLDIVR.HOUSEHOLD_ID
406800210801                     AND HHLDIVR2.SIN_NO          =
406900210801                         HHLDIVR.SIN_NO
407000210801                     AND HHLDIVR2.SIN_NO          <> 0
407100210801                     AND HHLDIVR2.ASSETS_BY_RULE  =
407200210801                         HHLDIVR.ASSETS_BY_RULE
407300210801                     AND HHLDIVR2.ASSETS_BY_RULE  = "4"
407400210801                     AND HHLDIVR2.TRADE_DATE      =
407500210801                         HHLDIVR.TRADE_DATE )
407600210801           END-EXEC.
407700210801
407800210801           MOVE SQLSTATE      TO lc_sqlStates.
407900210801           IF lncc_sqlSuccessful
408000210801               CONTINUE
408100210801             ELSE
408200210801               SET lncc_Err-22         TO TRUE
408300210801               MOVE lc_ErrCodeDescr22  TO lc_sqlErrShortDESCR
408400210801           END-IF.
408500210801      *RFS186019 - End
408600171130      *--------------------------------------
408700171130       UPDATE-MARKET-VALUE-INV-LEVEL SECTION.
408800171130      *--------------------------------------
408900171130
409000171130            EXEC SQL
409100171130              UPDATE QTEMP/TMPHHLDIVR HHLDIVR
409200171130              SET HHLDIVR.INV_MARKET_VALUE =
409300171130              (SELECT COALESCE(SUM(ACCINV.INV_MARKET_VALUE),0)
409400171130               FROM QTEMP/ACCINV ACCINV
409500171130               WHERE ACCINV.MFR_GROUP_CODE
409600171130                     = HHLDIVR.MFR_GROUP_CODE
409700171130               AND   ACCINV.ACCOUNT_NO = HHLDIVR.ACCOUNT_NO
409800171130               AND   ACCINV.INVESTMENT_CODE
409900171130                     = HHLDIVR.INVESTMENT_CODE
410000171130               AND   ACCINV.TRADE_DATE
410100171130                     = HHLDIVR.TRADE_DATE
410200171130              )
410300171130              WHERE EXISTS
410400171130                 (SELECT 1
410500171130                  FROM QTEMP/TMPHHLDIVR HHLDIVR1
410600171130                  WHERE HHLDIVR1.MFR_GROUP_CODE  =
410700171130                        HHLDIVR.MFR_GROUP_CODE  AND
410800171130                        HHLDIVR1.ACCOUNT_NO      =
410900171130                        HHLDIVR.ACCOUNT_NO      AND
411000171130                        HHLDIVR1.INVESTMENT_CODE =
411100171130                        HHLDIVR.INVESTMENT_CODE AND
411200171130                        HHLDIVR1.TRADE_DATE      =
411300171130                        HHLDIVR.TRADE_DATE)
411400171130              END-EXEC.
411500171130
411600171130              MOVE SQLSTATE      TO lc_sqlStates.
411700171130              IF lncc_sqlSuccessful
411800171130                 CONTINUE
411900171130              ELSE
412000171130                 SET lncc_Err-14         TO TRUE
412100171130                 MOVE lc_ErrCodeDescr14  TO lc_sqlErrShortDESCR
412200171130              END-IF.
412300171130
412400171130      *--------------------------------------
412500171130       UPDATE-MARKET-VALUE-ACC-LEVEL SECTION.
412600171130      *--------------------------------------
412700171130
412800171130              EXEC SQL
412900171130               UPDATE QTEMP/TMPHHLDIVR HHLDIVR
413000171130               SET HHLDIVR.TOT_ACC_MARKET_VALUE =
413100171130               (SELECT COALESCE(SUM(HHLDIVR1.INV_MARKET_VALUE),0)
413200171130               FROM QTEMP/TMPHHLDIVR HHLDIVR1
413300171130               WHERE HHLDIVR1.MFR_GROUP_CODE
413400171130                     = HHLDIVR.MFR_GROUP_CODE
413500210801      *RFS186019 - Start
413600210801                 AND HHLDIVR1.HOUSEHOLD_ID
413700210801                     = HHLDIVR.HOUSEHOLD_ID
413800210801      *RFS186019 - End
413900171130                 AND HHLDIVR1.ACCOUNT_NO
414000171130                     = HHLDIVR.ACCOUNT_NO
414100171130                 AND HHLDIVR1.TRADE_DATE
414200171130                     = HHLDIVR.TRADE_DATE
414300171130                      )
414400171130               WHERE EXISTS
414500171130               (SELECT 1
414600171130               FROM QTEMP/TMPHHLDIVR HHLDIVR2
414700171130               WHERE HHLDIVR2.MFR_GROUP_CODE  =
414800171130                     HHLDIVR.MFR_GROUP_CODE
414900210801      *RFS186019 - Start
415000210801               AND HHLDIVR2.HOUSEHOLD_ID
415100210801                                        = HHLDIVR.HOUSEHOLD_ID
415200210801      *RFS186019 - End
415300171130               AND HHLDIVR2.ACCOUNT_NO  = HHLDIVR.ACCOUNT_NO
415400171130               AND HHLDIVR2.TRADE_DATE  = HHLDIVR.TRADE_DATE
415500171130                   )
415600171130              END-EXEC.
415700171130
415800171130              MOVE SQLSTATE      TO lc_sqlStates.
415900171130              IF lncc_sqlSuccessful
416000171130                 CONTINUE
416100171130              ELSE
416200171130                 SET lncc_Err-15         TO TRUE
416300171130                 MOVE lc_ErrCodeDescr15  TO lc_sqlErrShortDESCR
416400171130              END-IF.
416500171130
416600171130      *--------------------------------------
416700171130       UPDATE-MARKET-VALUE-IVR-LEVEL SECTION.
416800171130      *--------------------------------------
416900171130
417000171130            EXEC SQL
417100171130             UPDATE QTEMP/TMPHHLDIVR HHLDIVR
417200171130             SET HHLDIVR.TOT_IVR_MARKET_VALUE =
417300171130             (SELECT COALESCE(SUM(HHLDIVR1.INV_MARKET_VALUE),0)
417400171130             FROM QTEMP/TMPHHLDIVR HHLDIVR1
417500171130             WHERE HHLDIVR1.MFR_GROUP_CODE
417600171130                   = HHLDIVR.MFR_GROUP_CODE
417700171130              AND HHLDIVR1.INVESTOR_NO
417800171130                  = HHLDIVR.INVESTOR_NO
417900210801      *RFS186019 - Start
418000210801              AND HHLDIVR1.HOUSEHOLD_ID
418100210801                  = HHLDIVR.HOUSEHOLD_ID
418200210801              AND HHLDIVR1.ASSETS_BY_RULE
418300210801                  = HHLDIVR.ASSETS_BY_RULE
418400210801              AND HHLDIVR1.ASSETS_BY_RULE   = "3"
418500210801      *RFS186019 - End
418600171130              AND HHLDIVR1.TRADE_DATE
418700171130                  = HHLDIVR.TRADE_DATE
418800171130              )
418900171130             WHERE EXISTS
419000171130              (SELECT 1
419100171130              FROM QTEMP/TMPHHLDIVR HHLDIVR2
419200171130               WHERE HHLDIVR2.MFR_GROUP_CODE  =
419300171130                     HHLDIVR.MFR_GROUP_CODE
419400171130                 AND HHLDIVR2.INVESTOR_NO     =
419500171130                     HHLDIVR.INVESTOR_NO
419600210801      *RFS186019 - Start
419700210801                 AND HHLDIVR2.HOUSEHOLD_ID    =
419800210801                     HHLDIVR.HOUSEHOLD_ID
419900210801                 AND HHLDIVR2.ASSETS_BY_RULE  =
420000210801                     HHLDIVR.ASSETS_BY_RULE
420100210801                 AND HHLDIVR2.ASSETS_BY_RULE  = "3"
420200210801      *RFS186019 - End
420300171130                 AND HHLDIVR2.TRADE_DATE      =
420400171130                     HHLDIVR.TRADE_DATE )
420500171130            END-EXEC.
420600171130
420700171130              MOVE SQLSTATE      TO lc_sqlStates.
420800171130              IF lncc_sqlSuccessful
420900171130                 CONTINUE
421000171130              ELSE
421100171130                 SET lncc_Err-16         TO TRUE
421200171130                 MOVE lc_ErrCodeDescr16  TO lc_sqlErrShortDESCR
421300171130              END-IF.
421400210801      *RFS186019 - Start
421500210801      *------------------------------------------
421600210801       UPDATE-MRKT-VAL-IVR-SIN-LEVEL SECTION.
421700210801      *------------------------------------------
421800210801
421900210801           EXEC SQL
422000210801             UPDATE QTEMP/TMPHHLDIVR HHLDIVR
422100210801             SET HHLDIVR.TOT_IVR_MARKET_VALUE =
422200210801             (SELECT COALESCE(SUM(HHLDIVR1.INV_MARKET_VALUE),0)
422300210801               FROM QTEMP/TMPHHLDIVR HHLDIVR1
422400210801               WHERE HHLDIVR1.MFR_GROUP_CODE
422500210801                    = HHLDIVR.MFR_GROUP_CODE
422600210801                AND HHLDIVR1.INVESTOR_NO
422700210801                    = HHLDIVR.INVESTOR_NO
422800210801                AND HHLDIVR1.HOUSEHOLD_ID
422900210801                    = HHLDIVR.HOUSEHOLD_ID
423000210801                AND HHLDIVR1.SIN_NO
423100210801                    = HHLDIVR.SIN_NO
423200210801                AND HHLDIVR1.SIN_NO    <> 0
423300210801                AND HHLDIVR1.ASSETS_BY_RULE
423400210801                    = HHLDIVR.ASSETS_BY_RULE
423500210801                AND HHLDIVR1.ASSETS_BY_RULE
423600210801                    = "4"
423700210801                AND HHLDIVR1.TRADE_DATE
423800210801                    = HHLDIVR.TRADE_DATE
423900210801              )
424000210801             WHERE EXISTS
424100210801              (SELECT 1
424200210801               FROM QTEMP/TMPHHLDIVR HHLDIVR2
424300210801               WHERE HHLDIVR2.MFR_GROUP_CODE  =
424400210801                     HHLDIVR.MFR_GROUP_CODE
424500210801                 AND HHLDIVR2.INVESTOR_NO     =
424600210801                     HHLDIVR.INVESTOR_NO
424700210801                 AND HHLDIVR2.HOUSEHOLD_ID    =
424800210801                     HHLDIVR.HOUSEHOLD_ID
424900210801                 AND HHLDIVR2.SIN_NO          =
425000210801                     HHLDIVR.SIN_NO
425100210801                 AND HHLDIVR2.SIN_NO          <> 0
425200210801                 AND HHLDIVR2.ASSETS_BY_RULE  =
425300210801                     HHLDIVR.ASSETS_BY_RULE
425400210801                AND  HHLDIVR2.ASSETS_BY_RULE
425500210801                     = "4"
425600210801                 AND HHLDIVR2.TRADE_DATE      =
425700210801                     HHLDIVR.TRADE_DATE
425800210801                   )
425900210801           END-EXEC.
426000210801
426100210801           MOVE SQLSTATE      TO lc_sqlStates.
426200210801           IF lncc_sqlSuccessful
426300210801                CONTINUE
426400210801             ELSE
426500210801                SET lncc_Err-23         TO TRUE
426600210801                MOVE lc_ErrCodeDescr23  TO lc_sqlErrShortDESCR
426700210801           END-IF.
426800210801      *RFS186019 - End
426900171116      *----------------------------
427000171116       OPEN-TOT-MFR-CURSOR SECTION.
427100171116      *----------------------------
427200171011
427300171011            EXEC SQL
427400171011                OPEN TOT_MFR_CURSOR
427500171011            END-EXEC.
427600171011
427700171011           MOVE SQLSTATE      TO lc_sqlStates.
427800171011           IF lncc_sqlSuccessful
427900171011              CONTINUE
428000171011           ELSE
428100171029              SET lncc_Err-03         TO TRUE
428200171029              MOVE lc_ErrCodeDescr03  TO lc_sqlErrShortDESCR
428300171011           END-IF.
428400171011
428500171116      *-----------------------------
428600171116       FETCH-TOT-MFR-CURSOR SECTION.
428700171116      *-----------------------------
428800180108      *RFS1000551-Starts
428900180107      *      INITIALIZE ln_Fetch_TradeDate,
429000180107      *                 lc_Fetch_MFRGrpCode,
429100180107      *                 ln_Fetch_InvestorNo,
429200180107      *                 ln_Fetch_AccountNo,
429300180107      *                 ln_Fetch_InvestmentCode,
429400180107      *                 ln_Fetch_AssetsByRule,
429500180107      *                 ln_Fetch_MfrSchdCode,
429600180107      *                 ln_Fetch_TotAssetsAMT,
429700180107      *                 ln_Fetch_TotMarketValue.
429800180107      *     EXEC SQL
429900180107      *      FETCH TOT_MFR_CURSOR
430000180107      *      INTO :ln_Fetch_TradeDate      :lc_NullIndicator,
430100180107      *           :lc_Fetch_MFRGrpCode     :lc_NullIndicator,
430200180107      *           :ln_Fetch_InvestorNo     :lc_NullIndicator,
430300180107      *           :ln_Fetch_AccountNo      :lc_NullIndicator,
430400180107      *           :ln_Fetch_InvestmentCode :lc_NullIndicator,
430500180107      *           :ln_Fetch_AssetsByRule   :lc_NullIndicator,
430600180107      *           :ln_Fetch_MfrSchdCode    :lc_NullIndicator,
430700180107      *           :ln_Fetch_TotAssetsAMT   :lc_NullIndicator,
430800180107      *           :ln_Fetch_TotMarketValue :lc_NullIndicator
430900180107      *     END-EXEC.
431000180107             INITIALIZE lc_FetchArrayRec.
431100180107             EXEC SQL
431200180107              FETCH NEXT FROM TOT_MFR_CURSOR FOR :li_FetchMax ROWS
431300180107              INTO :lc_FArrayRec
431400180107                   :ltb_Indicators
431500180107             END-EXEC.
431600180108      *RFS1000551-Ends
431700171011
431800171011             MOVE SQLSTATE  TO SW-SQL-STATES.
431900171011             EVALUATE TRUE
432000171011             WHEN SW-SQL-SUCCESSFUL OR SW-SQL-WARNING
432100180108      *RFS1000551-Starts
432200180107      *           MOVE ln_Fetch_MfrSchdCode TO
432300180107      *                WS-MFR-SCHEDULE
432400180107      *           PERFORM LOAD-MFR-SCHEDULE-ARRAY
432500180107      *           PERFORM CALC-TOT-MFR
432600180107      *           PERFORM UPDATE-TMPHHLDIVR
432700180107                  COMPUTE li_FetchedRows = SQLERRD (3)
432800180107                  COMPUTE li_RowNo       = 0
432900180107                  PERFORM PROCESS-FETCHED-ROW
433000180107                    UNTIL li_RowNo = li_FetchedRows
433100180108      *RFS1000551-Ends
433200171011              WHEN SW-SQL-END
433300171029               SET lc-EndcursorYes TO TRUE
433400171011              WHEN OTHER
433500171029               SET lncc_Err-04         TO TRUE
433600171029               MOVE lc_ErrCodeDescr04  TO lc_sqlErrShortDESCR
433700171011              END-EVALUATE.
433800171011
433900180108      *RFS1000551-Starts
434000180107      *----------------------------
434100180107       PROCESS-FETCHED-ROW SECTION.
434200180107      *----------------------------
434300180107             INITIALIZE lc_FetchFields.
434400180107             COMPUTE li_RowNo = li_RowNo + 1.
434500180107
434600180107             MOVE lc_FArrayRec(li_RowNo)
434700180107               TO lc_FetchRec.
434800180107
434900180107             MOVE ln_Fetch_MfrSchdCode TO WS-MFR-SCHEDULE.
435000180107             PERFORM LOAD-MFR-SCHEDULE-ARRAY.
435100180107             PERFORM CALC-TOT-MFR.
435200180107             PERFORM UPDATE-TMPHHLDIVR.
435300180108      *RFS1000551-Ends
435400171011             MOVE lc_Fetch_MFRGrpCode  TO lc_Prev_MFRGrpCode.
435500171016             MOVE ln_Fetch_InvestorNo  TO ln_Prev_InvestorNo.
435600171016             MOVE ln_Fetch_AccountNo   TO ln_Prev_AccountNo.
435700171115             MOVE ln_Fetch_TradeDate   TO ln_Prev_TradeDate.
435800171011
435900171116      *-----------------------------
436000171116       CLOSE-TOT-MFR-CURSOR SECTION.
436100171116      *-----------------------------
436200171011
436300171011             EXEC SQL
436400171011                 CLOSE TOT_MFR_CURSOR
436500171011             END-EXEC.
436600171011
436700171011
436800171116      *---------------------
436900171116       CALC-TOT-MFR SECTION.
437000171116      *---------------------
437100171023
437200171023             PERFORM CALC-ASSETS-MFR-AMT THRU CAMA-EXIT.
437300171011
437400171011      *---------------------------
437500171116       CALC-ASSETS-MFR-AMT SECTION.
437600171116      *---------------------------
437700171011
437800171011             MOVE 0 TO ln_MfrTot,
437900171011                       WS-MFR-VALUE,
438000171011                       WS-UNIT-VALUE.
438100171011             MOVE ln_Fetch_MfrSchdCode    TO WS-MFR-SCHEDULE.
438200171130             MOVE ln_Fetch_TotMarketValue TO WS-UNIT-VALUE.
438300171011
438400171011      *---------------
438500171011       CAMA-NEXT-TIER.
438600171011      *---------------
438700171011
438800171029            SET MSIDX TO 1.
438900171029            SEARCH WS-MFR-SCHEDULE-ENTRY VARYING MSIDX
439000171029            WHEN WS-M-SCHEDULE(MSIDX) = WS-MFR-SCHEDULE
439100171029            AND WS-M-UPPER-LIMIT(MSIDX) >= WS-UNIT-VALUE
439200171029            MOVE WS-M-RATE(MSIDX) TO WS-RATE
439300171029            WHEN WS-M-SCHEDULE(MSIDX) = SPACES
439400171029            GO TO CAMA-EXIT.
439500171011
439600171029            COMPUTE WS-MFR-VALUE ROUNDED  =
439700171029              (WS-UNIT-VALUE - WS-M-LOWER-LIMIT(MSIDX))
439800171029                * WS-RATE / 100 / WS-DAYS-IN-YEAR.
439900171029            ADD WS-MFR-VALUE TO ln_MfrTot.
440000171029            MOVE WS-M-LOWER-LIMIT(MSIDX) TO WS-UNIT-VALUE.
440100171029            IF WS-UNIT-VALUE NOT = 0
440200171029            GO TO CAMA-NEXT-TIER
440300171029            END-IF.
440400171011
440500171023      *----------
440600171023       CAMA-EXIT.
440700171023      *----------
440800171011             EXIT.
440900171011
441000171116      *--------------------------
441100171116       UPDATE-TMPHHLDIVR SECTION.
441200171116      *--------------------------
441300171011             IF ln_Fetch_AssetsByRule = "3"
441400171029               EXEC SQL
441500171029                UPDATE QTEMP/TMPHHLDIVR
441600171029                SET TOT_IVR_MFR_AMT = :ln_MfrTot
441700171029                WHERE MFR_GROUP_CODE = :lc_Fetch_MFRGrpCode
441800171029                 AND INVESTOR_NO    = :ln_Fetch_InvestorNo
441900171029                 AND ASSETS_BY_RULE = :ln_Fetch_AssetsByRule
442000171115                 AND TRADE_DATE     = :ln_Fetch_TradeDate
442100171029               END-EXEC
442200171029              ELSE
442300171029               EXEC SQL
442400171029                UPDATE QTEMP/TMPHHLDIVR
442500171029                SET TOT_ACC_MFR_AMT = :ln_MfrTot
442600171029                WHERE MFR_GROUP_CODE = :lc_Fetch_MFRGrpCode
442700171029                  AND ACCOUNT_NO     = :ln_Fetch_AccountNo
442800171029                  AND ASSETS_BY_RULE = :ln_Fetch_AssetsByRule
442900171115                  AND TRADE_DATE     = :ln_Fetch_TradeDate
443000171029                END-EXEC
443100171011             END-IF.
443200171011
443300171116      *--------------------------
443400171116       GET-EXCHANGE-RATE SECTION.
443500171116      *--------------------------
443600171012                 INITIALIZE EXCHANGE-RATE-M-REC,
443700171116                            WS-EXCHANGE-RATE,
443800171116                            ld_ExchgTradeDte.
443900171012
444000171012                 MOVE WS-B-DATE(BUDIDX)
444100171116                 TO  TRADE-DATE OF EXCHANGE-RATE-M-REC
444200171116                     ld_ExchgTradeDte.
444300171012                 MOVE WS-B-CURR(BUDIDX, BUDIDX2)
444400171012                 TO CURRENCY-DDS OF EXCHANGE-RATE-M-REC.
444500171116                 MOVE lc_ExchangeRateType
444600171116                 TO EXCHANGE-RATE-TYPE  OF EXCHANGE-RATE-M-REC.
444700171012
444800171012                 START EXCHANGE-RATE-M
444900171012                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
445000171012                 INVALID KEY
445100171116                 PERFORM GTER-LAST
445200171012                 END-START.
445300171116                 GO TO GTER-NEXT.
445400171012
445500171116      *Read the Last Record in Exchange Rate File.
445600171116      *------------------
445700171116       GTER-LAST.
445800171116      *------------------
445900171116               READ EXCHANGE-RATE-M LAST AT END
446000171116                 MOVE ZEROS TO EXCHANGE-RATE
446100171116                 OF EXCHANGE-RATE-M-REC
446200171116                GO TO GTER-EXIT
446300171116               END-READ.
446400171116
446500171116               IF EXCHANGE-RATE-TYPE
446600171116                  OF EXCHANGE-RATE-M-REC IS NOT EQUAL TO
446700171116                  lc_ExchangeRateType
446800171116                  GO TO GTER-0010
446900171116               END-IF.
447000171116               MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-REC
447100171116                    TO WS-EXCHANGE-RATE.
447200171116                GO TO GTER-EXIT.
447300171116
447400171116      * Read the Next Record in Exchange Rate File.
447500171116      *------------------
447600171116       GTER-NEXT.
447700171116      *------------------
447800171116               READ EXCHANGE-RATE-M NEXT AT END
447900171116                 MOVE ZEROS TO  EXCHANGE-RATE
448000171116                 OF EXCHANGE-RATE-M-REC
448100171116                GO TO GTER-EXIT
448200171116               END-READ.
448300171116               IF EXCHANGE-RATE-TYPE
448400171116                     OF EXCHANGE-RATE-M-REC IS NOT EQUAL TO
448500171116                     lc_ExchangeRateType
448600171116                   GO TO GTER-0010
448700171116               END-IF.
448800171116               MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-REC
448900171116                   TO WS-EXCHANGE-RATE
449000171116                GO TO GTER-EXIT.
449100171116
449200171012      *Read the Previous Record in Exchange Rate File.
449300171016      *------------------
449400171012       GTER-PRIOR.
449500171016      *------------------
449600171012
449700171012              READ EXCHANGE-RATE-M PRIOR AT END
449800171012                  MOVE ZEROS TO EXCHANGE-RATE
449900171012                             OF EXCHANGE-RATE-M-REC
450000171012                  GO TO GTER-EXIT
450100171012              END-READ.
450200171012
450300171116              IF EXCHANGE-RATE-TYPE
450400171116                     OF EXCHANGE-RATE-M-REC IS NOT EQUAL TO
450500171116                     lc_ExchangeRateType
450600171116                   GO TO GTER-PRIOR
450700171116              END-IF.
450800171012              MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-REC
450900171012                                 TO WS-EXCHANGE-RATE.
451000171116              GO TO GTER-0010.
451100171012
451200171012      * Check the Record Data.
451300171016      *------------------
451400171012        GTER-0010.
451500171016      *------------------
451600171116               IF TRADE-DATE OF EXCHANGE-RATE-M-REC
451700171116                          IS GREATER THAN ld_ExchgTradeDte
451800171116               OR EXCHANGE-RATE-TYPE
451900171116                  OF EXCHANGE-RATE-M-REC IS NOT EQUAL TO
452000171116                  lc_ExchangeRateType
452100171116                  GO TO GTER-PRIOR
452200171116               END-IF.
452300171012
452400171016      *------------------
452500171012        GTER-EXIT.
452600171016      *------------------
452700171012             EXIT.
452800171016
452900171116      *------------------------
453000171116        CLOSE-ALL-FILE SECTION.
453100171116      *------------------------
453200171016
453300171023            CLOSE EXCHANGE-RATE-M
453400171023                  TRANS
453500171023                  ACCOUNT-INVESTMENT
453600171023                  MFR-SCHEDULE
453700171023                  Inv-Ass-Alloc-Mod-Sch-Hd
453800171023                  Inv-Ass-Alloc-Model-Sch-Dt
453900171023                  MFR-PROCESS.
454000171130      *RFS167951 Ends
454100110516      /
454200180709
454300180709      *RFS179061 - Starts
454400180709      *--------------------------
454500180709        INSERT-WRKHHLDIVR-RECORDS.
454600180709      *--------------------------
454700180709           EXEC SQL
454800180709            INSERT INTO WRKHHLDIVR
454900180709                   SELECT MFR_GROUP_CODE,
455000180709                          TRADE_DATE,
455100180709                          INVESTOR_NO,
455200180709                          ACCOUNT_NO,
455300180709                          INVESTMENT_CODE,
455400180709                          CURRENCY,
455500180709                          SAME_CURR,
455600180709                          ASSETS_BY_RULE,
455700180709                          MFR_SCHEDULE_CODE,
455800180709                          OVR_MFR_SCHEDULE_CODE,
455900180709                          INV_ASSETS_AMT,
456000180709                          TOT_ACC_ASSETS_AMT,
456100180709                          TOT_IVR_ASSETS_AMT,
456200180709                          INV_MARKET_VALUE,
456300180709                          TOT_ACC_MARKET_VALUE,
456400180709                          TOT_IVR_MARKET_VALUE,
456500180709                          TOT_IVR_MFR_AMT,
456600180709                          TOT_ACC_MFR_AMT
456700180709                    FROM QTEMP/TMPHHLDIVR
456800180709           END-EXEC.
456900180709           MOVE SQLSTATE      TO lc_sqlStates
457000180709           IF lncc_sqlSuccessful
457100180709           CONTINUE
457200180709           ELSE
457300180710           SET lncc_Err-19    TO TRUE
457400180710           MOVE lc_ErrCodeDescr19  TO lc_sqlErrShortDESCR
457500180709           END-IF.
457600180709      *RFS179061 - Ends
