000100180315     A*%%***********************************************************************
000200180315     A*%%TS  RD  20100422  134834  JO77044DV   REL-V5R4M0  5722-WDS
000300180315     A*%%TS  RD  20150609  146240  NK12482DV
000400180321     A*%%TS  RD  20180309  175559  AM18529DV   EXTENDED LGLNM2 FIELD
000600180315     A*%%FI+10660100000000000000000000000000000000000000000000000000
000700180315     A*%%FI       0000000000000000000000000000000000000000000000000
000800180315     A*%%***********************************************************************
000900180315     A          R HDR
001000180315     A*%%***********************************************************************
001100180315     A*%%RI 00000
001200180315     A*%%***********************************************************************
001300180315     A                                      SKIPB(001)
001400180315     A            DATEDSP         L  O     1
001500180315     A                                    13
001600180315     A                                      TIME
001700180315     A            CONAME        40A  O    56
001800180315     A                                   +41
001900180315     A                                      'PAGE:'
002000180315     A                                    +2
002100180315     A                                      PAGNBR
002200180315     A                                     1
002300180315     A                                      'REPORT:'
002400180315     A                                      SPACEB(001)
002500180315     A            RPTLBL        10A  O    +1
002600180315     A                                    59
002700180315     A                                      'NOMINEE TRANSACTION DETAIL REPORT'
002800180315     A                                    52
002900180315     A                                      'FROM DATE :'
003000180315     A                                      SPACEB(001)
003100180315     A            FRMDTE        10A  O    66
003200180315     A                                    79
003300180315     A                                      'TO DATE :'
003400180315     A            TODTE         10A  O    91
003500180315     A                                     1
003600180315     A                                      'Nominee:'
003700180315     A                                      SPACEB(002)
003800180315     A            NOMCDE         5A  O    11
003900180315     A            NOMNME        35A  O    +2
004000180315     A*155449                             75
004100180315     A                                    71
004200180315     A                                      'R'
004300180315     A                                      SPACEB(003)
004400180315     A                                     1
004500180315     A                                      'NOM'
004600180315     A                                      SPACEB(001)
004700180315     A                                    +7
004800180315     A                                      'DEALER'
004900180315     A*155449                            +27
005000180315     A                                   +23
005100180315     A                                      'TRANS'
005200180315     A                                    +7
005300180315     A                                      'MANAGER TRADE'
005400180315     A                                    +6
005500180315     A                                      'V'
005600180315     A                                    +2
005700180315     A                                      'FUND'
005800180315     A*155449                            +42
005900180315     A                                   +45
006000180315     A                                      'TRANSACTION'
006100180315     A*155449                            +11
006200180315     A                                   +12
006300180315     A                                      'UNIT'
006400180315     A                                     1
006500180315     A                                      'BRCH'
006600180315     A                                      SPACEB(001)
006700180315     A                                    +2
006800180315     A                                      'ACCOUNT NUMBER'
006900180315     A                                    +2
007000180315     A                                      'REGISTRATION'
007100180315     A*155449                             +9
007200180315     A                                    +5
007300180315     A                                      'TYPE ORIGIN ACCOUNT DATE'
007400180315     A                                    +7
007500180315     A                                      'S'
007600180315     A                                    +2
007700180315     A                                      'NO.'
007800180315     A                                   +12
007900180315     A                                      'GROSS'
008000180315     A                                   +12
008100180315     A                                      'NET'
008200180315     A*155449                             +2
008300180315     A                                    +4
008400180315     A                                      'PRICE'
008500180315     A*155449                            +10
008600180315     A                                   +11
008700180315     A                                      'UNITS'
008800180315     A*155449                             +8
008900180315     A                                    +9
009000180315     A                                      'BALANCE'
009100180315     A                                     1
009200180315     A                                      '-----------------------------------
009300180315     A                                      ------------------------------------
009400180315     A                                      ------------------------------------
009500180315     A                                      ------------------------------------
009600180315     A                                      -----------'
009700180315     A                                      SPACEB(001)
009800180315     A*%%***********************************************************************
009900180315     A*%%SS
010000180315     A*%%CL 001
010100180315     A*%%CL 001
010200180315     A*%%CL 002
010300180315     A*%%CL 003
010400180315     A*%%CL 001
010500180315     A*%%CL 001
010600180315     A*%%CL 001
010700180315     A*%%***********************************************************************
010800180315     A          R HDR2
010900180315     A*%%***********************************************************************
011000180315     A*%%RI 00000
011100180315     A*%%***********************************************************************
011200180315     A                                      SKIPB(012)
011300180315     A            DATEDSP         L  O     1
011400180315     A                                    13
011500180315     A                                      TIME
011600180315     A            CONAME        40A  O    56
011700180315     A                                   +41
011800180315     A                                      'PAGE:'
011900180315     A                                    +2
012000180315     A                                      PAGNBR
012100180315     A                                     1
012200180315     A                                      'REPORT:'
012300180315     A                                      SPACEB(001)
012400180315     A            RPTLBL        10A  O    +1
012500180315     A                                    59
012600180315     A                                      'NOMINEE TRANSACTION DETAIL REPORT'
012700180315     A                                    62
012800180315     A                                      'As At Date'
012900180315     A                                      SPACEB(001)
013000180315     A            PDATE          8S 0O    74
013100180315     A                                      EDTWRD('    /  /  ')
013200180315     A                                     1
013300180315     A                                      'Nominee:'
013400180315     A                                      SPACEB(002)
013500180315     A            NOMCDE         5A  O    11
013600180315     A            NOMNME        35A  O    +2
013700180315     A*155449                             75
013800180315     A                                    71
013900180315     A                                      'R'
014000180315     A                                      SPACEB(003)
014100180315     A                                     1
014200180315     A                                      'NOM'
014300180315     A                                      SPACEB(001)
014400180315     A                                    +7
014500180315     A                                      'DEALER'
014600180315     A*155449                            +27
014700180315     A                                   +23
014800180315     A                                      'TRANS'
014900180315     A                                    +7
015000180315     A                                      'MANAGER TRADE'
015100180315     A                                    +6
015200180315     A                                      'V'
015300180315     A                                    +2
015400180315     A                                      'FUND'
015500180315     A*155449                            +42
015600180315     A                                   +45
015700180315     A                                      'TRANSACTION'
015800180315     A*155449                            +11
015900180315     A                                   +12
016000180315     A                                      'UNIT'
016100180315     A                                     1
016200180315     A                                      'BRCH'
016300180315     A                                      SPACEB(001)
016400180315     A                                    +2
016500180315     A                                      'ACCOUNT NUMBER'
016600180315     A                                    +2
016700180315     A                                      'REGISTRATION'
016800180315     A*155449                             +9
016900180315     A                                    +5
017000180315     A                                      'TYPE ORIGIN ACCOUNT DATE'
017100180315     A                                    +7
017200180315     A                                      'S'
017300180315     A                                    +2
017400180315     A                                      'NO.'
017500180315     A                                   +12
017600180315     A                                      'GROSS'
017700180315     A                                   +12
017800180315     A                                      'NET'
017900180315     A*155449                             +2
018000180315     A                                    +4
018100180315     A                                      'PRICE'
018200180315     A*155449                            +10
018300180315     A                                   +11
018400180315     A                                      'UNITS'
018500180315     A*155449                             +8
018600180315     A                                    +9
018700180315     A                                      'BALANCE'
018800180315     A                                     1
018900180315     A                                      '-----------------------------------
019000180315     A                                      ------------------------------------
019100180315     A                                      ------------------------------------
019200180315     A                                      ------------------------------------
019300180315     A                                      -----------'
019400180315     A                                      SPACEB(001)
019500180315     A*%%***********************************************************************
019600180315     A*%%SS
019700180315     A*%%CL 001
019800180315     A*%%CL 001
019900180315     A*%%CL 002
020000180315     A*%%CL 003
020100180315     A*%%CL 001
020200180315     A*%%CL 001
020300180315     A*%%CL 001
020400180315     A*%%***********************************************************************
020500180315     A          R NACT1
020600180315     A*%%***********************************************************************
020700180315     A*%%RI 00000
020800180315     A*%%***********************************************************************
020900180315     A                                      SPACEB(001)
021000180315     A                                     1
021100180315     A                                      'NOMINEE ACCT NUMBER:'
021200180315     A                                      SPACEB(001)
021300180315     A            NOMACTNO      15A  O    +2
021400180315     A*%%***********************************************************************
021500180315     A*%%SS
021600180315     A*%%CL 001
021700180315     A*%%***********************************************************************
021800180315     A          R DTL1
021900180315     A*%%***********************************************************************
022000180315     A*%%RI 00000
022100180315     A*%%***********************************************************************
022200180315     A                                      SPACEB(001)
022300180315     A                                      SPACEA(001)
022400180315     A            BRCH           5A  O     1
022500180315     A            DLRACTNO      15A  O    +1
022600180315     A*155449     LGLNME        21A  O    +1
022700180315     A            LGLNME        17A  O    +1
022800180315     A            TRANSCDE       3A  O    +1
022900180315     A            ORIGCDE        3A  O    +2
023000180315     A            ACCOUNTNO      9S 0O    +1
023100180315     A                                      EDTCDE(4)
023200180315     A            TRADEDTE       8S 0O    +1
023300180315     A                                      EDTWRD('    /  /  ')
023400180315     A            REVIND         1A  O    +1
023500180315     A            INVCDE         5A  O    +2
023600180315     A*155449     GROSS         10S 2O    +1
023700180315     A*155449                               EDTCDE(J $)
023800180315     A            GROSS         11S 2O    +1
023900180315     A                                      EDTCDE(J)
024000180315     A*155449     NET           10S 2O    +0
024100180315     A*155449                               EDTCDE(J $)
024200180315     A            NET           11S 2O    +0
024300180315     A                                      EDTCDE(J)
024400180315     A*146240     PRICE          5S 2O    +0
024500180315     A            PRICE          6S 2O    +0
024600180315     A                                      EDTCDE(J)
024700180315     A*155449     UNITS         11S 3O    +0
024800180315     A            UNITS         12S 3O    +0
024900180315     A                                      EDTCDE(J)
025000180315     A*155449     BAL           11S 3O    +0
025100180315     A            BAL           12S 3O    +0
025200180315     A                                      EDTCDE(J)
025300180315     A*175559     LGLNM2        40A  O    23
025400180315     A            LGLNM2        51A  O    23
025500180315     A                                      SPACEB(001)
025600180315     A*%%***********************************************************************
025700180315     A*%%SS
025800180315     A*%%SN DLRACTNO   xxxxxxxxxxxxxxx
025900180315     A*%%SN GROSS      9999999999
026000180315     A*%%SN NET        9999999999
026100180315     A*%%SN PRICE      99999
026200180315     A*%%SN UNITS      99999999999
026300180315     A*%%SN BAL        99999999999
026400180315     A*%%CL 001
026500180315     A*%%CL 001
026600180315     A*%%***********************************************************************
026700180315     A          R BRCH1
026800180315     A*%%***********************************************************************
026900180315     A*%%RI 00000
027000180315     A*%%***********************************************************************
027100180315     A                                      SPACEB(001)
027200180315     A                                     1
027300180315     A                                      'Nominee Branch.......'
027400180315     A                                      SPACEB(001)
027500180315     A            BRCH           5A  O    24
027600180315     A                                    +6
027700180315     A                                      'Total Accounts ......'
027800180315     A            ACCTCTR        7S 0O    57
027900180315     A                                      EDTCDE(Z)
028000180315     A                                    +1
028100180315     A                                      'Total Transactions ..'
028200180315     A            TRNCTR         7S 0O    87
028300180315     A                                      EDTCDE(Z)
028400180315     A*%%***********************************************************************
028500180315     A*%%SS
028600180315     A*%%CL 001
028700180315     A*%%***********************************************************************
028800180315     A          R NOM1
028900180315     A*%%***********************************************************************
029000180315     A*%%RI 00000
029100180315     A*%%***********************************************************************
029200180315     A                                      SPACEB(001)
029300180315     A                                     1
029400180315     A                                      'Nominee..............'
029500180315     A                                      SPACEB(001)
029600180315     A            NOMCDE         5A  O    24
029700180315     A                                    +6
029800180315     A                                      'Total Accounts ......'
029900180315     A            ACCTCTR        7S 0O    57
030000180315     A                                      EDTCDE(Z)
030100180315     A                                    +1
030200180315     A                                      'Total Transactions ..'
030300180315     A            TRNCTR         7S 0O    +1
030400180315     A                                      EDTCDE(Z)
030500180315     A*%%***********************************************************************
030600180315     A*%%SS
030700180315     A*%%CL 001
030800180315     A*%%***********************************************************************
030900180315     A          R GRND1
031000180315     A*%%***********************************************************************
031100180315     A*%%RI 00000
031200180315     A*%%***********************************************************************
031300180315     A                                      SPACEB(001)
031400180315     A                                     1
031500180315     A                                      'Grand Total....'
031600180315     A                                      SPACEB(001)
031700180315     A                                   +19
031800180315     A                                      'Accounts ......'
031900180315     A            ACCTCTR        7S 0O    51
032000180315     A                                      EDTCDE(Z)
032100180315     A                                    +7
032200180315     A                                      'Transactions ..'
032300180315     A            TRNCTR         7S 0O    81
032400180315     A                                      EDTCDE(Z)
032500180315     A*%%***********************************************************************
032600180315     A*%%SS
032700180315     A*%%CL 001
032800180315     A*%%***********************************************************************
032900180315     A          R FREEFMT
033000180315     A*%%***********************************************************************
033100180315     A*%%RI 00000
033200180315     A*%%***********************************************************************
033300180315     A                                      SPACEB(001)
033400180315     A            LINE1        150         1
033500180315     A*%%***********************************************************************
033600180315     A*%%SS
033700180315     A*%%CP+999CRTPRTF
033800180315     A*%%CP+    FILE(R04JO77044/NOMTRAN)
033900180315     A*%%CP+    DEVTYPE(*SCS)
034000180315     A*%%CP     PAGESIZE(*N       150      *N     )
034100180315     A*%%***********************************************************************
