000100180611      * %ATTR COMMIT(*CHG) DBGVIEW(*SOURCE)
000200190725       IDENTIFICATION DIVISION.
000300190704       PROGRAM-ID.     OETRNBUY.
000400190709       INSTALLATION.   Unisen Inc.
000500190709       AUTHOR.         Abdi Hassan.
000600190709       DATE-WRITTEN.   March 2004.
000700210803       DATE-COMPILED.
000800210531      ********************************************************************
000900190520      *       DATE: March 16, 2004                                       *
001000191018      * PROGRAMMER: Abdi Hassan                                          *
001100210512      *  OETRNBUY : Order Entry Buy program version 15.2                 *
001200200507      *    PURPOSE: Process a Buy Order. Buy order include commission    *
001300040427      *             rebates.                                             *
001400040427      *             This module was specificly designed for the new      *
001500040427      *             order entry process. This module use different       *
001600040427      *             modules and external working storages to achieve     *
001700040427      *             its objectives. The objective of this module is to   *
001800040427      *             place a buy transaction on unitrax when the          *
001900040427      *             necessary data is provided. If data provided fails   *
002000040427      *             the unitrax validation the order is rejected.        *
002100040323      *  CALLED BY: OETRANS15 - Order Entry Driver program               *
002200000000      *****************************************************************
002300000000      *    C H A N G E   H I S T O R Y                                *
002400000000      *****************************************************************
002500040313      * PROGRAMMER *YYYY/MM/DD* RFS COMMENTS                          *
002600000000      *****************************************************************
002700040809      * Karen Eng  * 040809 *23255 * Allow MasterAcct process for all
002800040809      *            *               * Account Types (Nominee & Client).
002900040812      * John Rab   *2004/08/11* RFS 23685 - Use child account if exists
003000040812      *            *          * as returned from MASTERACCT.
003100040824      * Clement Lui*2004/08/24* RFS23467 - To add "REBAL" attribute
003200040824      *            *          * code to account on initial purchase of
003300040824      *            *          * phantom fund into an account.
003400040927      * Michael    *2004/09/27* RFS 24359
003500040927      * Mondoux    *          * - Only provide a distribution warning
003600040927      *            *          *   when the distribution request is
003700040927      *            *          *   different than what is on system.
003800040927      *            *          *   This check will not go into the exact
003900040927      *            *          *   details of the distribution setup.
004000040927      *            *          * - BUY13 err ptr maybe used again.
004100041006      * Brian Z    *2004/10/06 RFS 24610
004200041006      *            *          * Exit the program when duplicate orders
004300040927      *            *          *
004400041025      * Brian Z    * 2004/09/15   * RFS 22427                          *
004500041025      *            *              * - Added the copy book CPYOE15CS    *
004600041025      *            *              *   Company Specifics record layout  *
004700041201      * Abdi Hassan*2004/12/01* RFS 24515 -
004800041201      *            *          * Validate annual contributions by
004900041201      *            *          * calling module "CHKCNTL" for direct
005000041201      *            *          * orders.
005100050201      * Brian Z    * 2005/02/01   * RFS 26423                          *
005200050201      *            *              * - Remove the Dealer Monitoring     *
005300050201      *            *              *                                    *
005400050331      * Waldi R.   * 2005/03/30   * RFS26514 - recompile due to
005500050331      *            *              * CPYOERES copy book changes.
005600050412      * Tony       *2005/03/31    *RFS26013 recompiled only ESG 16     *
005700050412      * Punzalan   *              *                                    *
005800050401      * Ewa K.     *2005/04/01    * RFS 25997 - Populate the Suppress  *
005900050401      *            *              * Confirm Indicator of MFATRNP.      *
006000050412      * Tony       *2005/04/12    *RFS23973-populate the trans-origina *
006100050412      * Punzalan   *              *  tor-no with the Original-order    *
006200050413      *            *              *  Identifier of the OE if AOT order *
006300050914      * Bojana J.  * 2005/09/14   * RFS 28121 - Recompile for file change*
006400051118      * Marek T    * 2005/11/18   * RFS30985-Recompile; Req. CESG chg.*
006500051215      * Shu Yin    * 2005/12/15   * RFS 30634 - Recompile for CPYOE15CS
006600051215      *            *              *             changes.
006700060214      * C.Lentini  * 2006/02/14   * RFS 29617 - ESG 17 Error Correction
006800060214      *            *              * Set DilSrc in Trans-Broker-Details.
006900060316      * Fatima Y.  * 2006/03/16   * RFS 33276 - Recompile
007000060324      * Bojana J.  * 2006/03/24   * RFS 32201 - Recompile due to GETCTLNUM*
007100060324      *            *              * module change. Also removed redundant*
007200060324      *            *              * comments.                         *
007300060626      * Frank Hong * 2006/06/26   * RFS 32873.
007400060626      *            *              * Call function FXCHKSEGAT if it is
007500060626      *            *              * a buy transaction for Segfund.
007600061106      * Kahkashan P* 2006/11/06   * RFS 37770 - Recompile
007700070625      * Lorne B    * 2007/06/25   * RFS 42682 - eGL Extract; Recompile
007800080304      * Emma Yala  * 2008/03/04   * RFS45781 - Enhacement to the Investment
007900080304      *            *              * minimum functionality
008000080630      * Sanjeev P  * 2008/06/26   * RFS50474 - Incorporate FXGLWBVLD
008100080825      * C.Lentini  * 2008/08/12   * RFS53706 - Set trans origin code
008200080825      *            *              * to ITX for w/o thru investor trax.
008300080908      * Sanjeev P  * 2008/09/08   * RFS56645 - Recompile.
008400080923      * Emma Yala  * 2008/09/22   * RFS57053 - Recompile.
008500090309      * Abdi H.    * 2009/03/05 * RFS64042 - Recompile for ESG19 file
008600090309      *            *            * changes
008700090622      * C.Lentini  * 2009/02/25 * RFS60350 - ESG 19 - ICT logic
008800090622      * C.Lentini  * 2009/06/22 * RFS 68916 - ICT paperwork tracking.
008900090817      * Bathuu L   * 2009/06/16 * RFS59853 - Recompile for MFATRNMSCP
009000090807      * Meynard B. * 2009/08/07 * RFS 72335 - Reinstate RFS63641. GLWB
009100090807      *            *            * validn to move err to COMM-RETURN-DESC
009200090908      * Bathuu L   * 2009/07/03 * RFS69179 - Recompile.
009300090923      * Kevin Shen * 2009/09/23 * RFS54431 - Validate RDSP purchase request
009400091224      * Esin A.    * 2009/12/23 * RFS64263 - Add FXACINVG for investment
009500091224      *            *            * grouping validation.
009600091224      * Lev O      * 2009/12/23 * RFS64263 - Added new parameters for
009700091224      *            *            *   stop deposit validation.
009800100517      * Richard S  * 2010/03/02 * RFS 68035 - RDSP dev
009900100517      * Andy Chan  * 2010/05/04 * RFS65695 - BMO Transfer In-kind
010000100629      * Esin A.    * 2010/05/28 * RFS81399 - Defect fix.
010100110211      * Emma Yala  * 2010/09/16 * RFS85040 - RDSP Phase 5.1 Part2
010200110211      *            *            * Not Allow Backdating prior to given date
010300110211      * TCS        * 2010/12/08 * RFS84988 - Recompile.
010400101013      * Bathuu L   * 2010/10/12 * RFS86061 - When new purchase with
010500101013      *            *            * blank distribution option is entered,
010600101013      *            *            * set up account-investment for cash
010700101013      *            *            * distribution options.
010800110313      * L. Wong    * 2010/12/22 * RFS89055 - Bulk Trans Data Upload
010900110313      *            *            * Change compile option with
011000110313      *            *            * COMMIT(*CHG).
011100110313      *            *            * Fix level 10 & 20 compile errors.
011200110313      * a Decepida * 2010/12/13 * RFS89055 - Bulk Data Upload
011300110313      *            *            *   Added MFR validation
011400110311      * a Decepida * 2011/03/11 * RFS84184 - Correct the size of
011500110311      *            *            * COMM-EXTERNAL-TRANS-TYPE s/b CHAR(3)
011600110322      * Abdi H.    * 2011/03/22 * RFS94218 - Correct ICT & Commission
011700110322      *            *            * Rebates issue
011800110425      * a Decepida * 2011/04/25 * RFS94524 - Suppress errors for
011900110425      *            *            * omitted optional fields
012000110519      * Abdi H.    * 2011/05/19 * RFS89568 - Add ESGADDRESS module
012100110704      * Ramya K    * 2011/06/03 * RFS92477 -Transaction MISC changes
012200110704      * Thilaga. K * 2011/06/23 * RFS92465 - Recompile for MFATRNREP
012300110728      * Andy Lo    * 2011/07/28 * RFS92513 - Recompile for MFAGRPPDP
012400110902      * Sai Kiran I* 2011/09/02   * RFS 92499 - Recompile
012500111004      * Andy Lo    * 2011/10/04 * RFS91768 - Recompile  .
012600120302      * K Naveen   * 2012/02/22 * RFS97573 - UTAS ESG 22.
012700120419      * Poornima V * 2012/04/19 * RFS108404 - Distribution Option
012800120419      *                         * Change Generates Warning (Defect)
012900120528      * Lisa Martin* 2012/05/28 * RFS109991 - Chg Msg for StandingOrdr
013000120702      * Divina Z   * 2012/07/02 * RFS110382 - Updating Distr Option and
013100120702      *                         * Payment type for Acc with currunit bal = 0
013200120801      * Rekha S    * 2012/08/01 * RFS99891 - Buy and Sell Update
013300120801      *            *            * Services
013400130104      * Thilaga K  * 2012/10/01 * RFS98866 - New SDSP Account Types
013500130104      *            *            * Added parameters to call FXRDSPCHK
013600121019      * Rekha S    * 2012/10/19 * Defect 29617 - Root RFS 99891- Fin Sel
013700180522      *            *            *  is populating with "?".
013800121024      * K Naveen   * 2012/10/24 * Defect 29707-  Root RFS 99891- when
013900121024      *            *            * payment type is I and corresponding
014000121024      *            *            * payment rule is C.
014100121029      * Michael Fan* 2012/10/29   * RFS115704 - Federal Tax Percent and  *
014200121029      *            *              * Provincial Tax Percent change to 5   *
014300180522      *            *              * decimal places instead of 2 on files *
014400121029      *            *              * MFATRNTXP and MFATRNTXDP.            *
014500121205      *  K Naveen  * 2012/11/28 * RFS99905 - Fixing QC defects for the
014600121205      *            *            * transaction assignments 29760, 29763
014700121205      *            *            * & 29764.
014800130104      * Alex       * 2012/12/03 * RFS116697 - Supress Stmt is not done l
014900130104      * Jayasundara*            * for BUY WOR.
015000130227      * Uday K A   * 2012/12/03 * RFS98265 - Recompile
015100130117      * Poornima V * 2013/01/09 * RFS118185 - Name and Address
015200130117      *            *            * grouping for Update Services
015300130211      * Suresh G.  * 2013/02/03 * RFS118744- Recompile for MFAINVPTP
015400130219      * Ganbold L. * 2013/02/19 * RFS119993- Recompile for MFATRNMSCP
015500130225      * Suresh G.  * 2013/02/15 * RFS113777 - Added New parameter
015600130225      *            *            * "Account Amount" field in
015700130225      *            *            *  XINRRPTMIN.
015800130305      * Abhisek M. * 2013/03/01 * RFS112137- Recompile for MFATRNMSCP
015900130806      * Sherene N.  * 2013/02/21 * RFS 117763 -to add 4 new input parameters
016000130806      *             *            * for XINRRPTMIN process.
016100130225      * Vinsfy J   * 2013/02/05 * RFS 112072 - Initial minimum bypass.
016200130311      * Pradeep    * 2013/01/29 * Rfs116694 - If address not provided
016300130311      * Kumar R    *            * default to investor address for Bulk.
016400130227      * Ramya K    * 2013/01/30 * RFS114676-UTAS ESG 23 Master RFS.
016500130702      * Saravanan R * 2013/05/27 * RFS119835- Recompile for CPYESBRECS
016600130808      * Abdi H./EY * 2013/06/26 * RFS124176 Add Network-id to populate always
016700130808      * Uday K A    * 2013/07/26 * RFS125878 - Recompile for CPYOE15CS *
016800130806      * Uday K A    * 2013/08/06 * RFS126078 - code retrofit to fix issue
016900130806      *             *            * related RFS117763
017000130807      * Abdi H.     * 2013/08/06 * RFS126078 - retrofit 117763         ue
017100130828      * Nagamani S  * 2013/08/21 * RFS126727 - Suppress other rejections
017200130828      *             *            * when the rejection code is 113
017300131003      * Thilaga K   * 2013/10/01 * RFS128265 - Recompile for MFAACCPMP
017400131001      * Rohan P     * 2013/10/01 * RFS119020 - Joint Screen Validation *
017500131003      * Rohan Patil * 2013/09/18 * RFS128329 - Added Missing Code for
017600131003      *             *            * RFS 119020 - Annuitant Type
017700131003      *             *            * Validation  for SEG.
017800131112      * Manjusha V  * 2013/10/28 * RFS127705-Recompile for CPYESBRECS
017900140416      * Thilaga K   * 2014/04/16 * RFS134936 - Recompile for MFATRNREP
018000140620      * Vinsfy J    * 2014/06/20   * RFS136634 -Recompile for MFAACCATP
018100140704      * Sushmita J  * 2014/05/29   * RFS127070 - Added the new paramater
018200140704      *             *              * pi_RDSPCHKSDSPTaxablePortion to the
018300140704      *             *              * call statement of FXRDSPCHK.
018400141105      * Manjusha V  * 2014/11/05 * RFS142052- Recompile for MFAORDACCP.
018500150318      * Gomathi S   * 2015/03/17 * RFS136894- BULK upload rejecting
018600150318      *             *            * for chqpayeename1 ,2
018700150413      * Ewa K.      * 2015/04/13 * RFS135598- Skip master accoount for
018800150413      *             *            * annuity.
018900150428      * Thilaga K   * 2015/03/19 * RFS 141445 - Replaced annuitant age
019000150428      *             *            * validation (OEAGELIMIT) by the
019100150428      *             *            * module FXTRNANNAG
019200150428      * TamilselviG * 2015/03/23 * RFS140532 - Recompile for MFAACCPMP
019300150513      * Muthulakshmi* 2015/04/07 * RFS145157 - RECOMPILE FOR MFAACBHRP
019400160111      * K Naveen.   * 2016/01/11 * RFS153523- Recompile for CPYESBRECS
019500160111      *             *            *            and CPYESBFATC.
019600160212      * Meenu K     * 2016/01/19 * RFS153674- Issue with the Account/INV
019700160212      *             *            * Distribution Option setup(ACIDSDTL).
019800160229      * V Lakshmi  *2016/01/28    *RFS151549-recompile for CPYESGERR
019900160229      *            *              * CPYOE15 ,CPXMLTAG15
020000160512      *V L Prasanna *2016/05/12 * RFS158785- recompile for MFAOELC15P,
020100160512      *             *           *    MFAORDC15P,WRKOEUTXP
020200160808      * Ewa K.      *2016/07/08 * RFS159042- modify call of FXCHKSEGAT
020300160808      *             *           * for Annuity
020400160826      *V L Prasanna *2016/08/26 * RFS162576- recompile for MFAORDACCP,
020500160826      *             *           * MFAORLACCP
020600160907      * Sushmita J  * 2016/09/07* RFS162922 - Recompile for MFAINVACP.
020700170327      * Ewa K.      * 2017/03/21*RFS168893 -Recompile for MFAORDD15P   *
020800170327      *             *           *MFAOELD15P,MFAORDACCP,MFAORLACCP      *
020900170919      *V.L.Prasanna * 2017/09/12*RFS170025 -Distribution validation
021000170919      *             *           *incorrectly applied for Investment with
021100170919      *             *           * Zero Balance
021200171213      *Lavanya V   * 2017/12/08*RFS165468 -Additional validation on   *
021300171213      *                PAC minimums
021400180129      * K Naveen.   * 2018/01/17 *RFS173538- Distribution payment      *
021500180129      *             *            *instructions are required when NA    *
021600180215      * K Naveen.   * 2018/02/19 *RFS174735- Error correction.         *
021700180611      * Lavanya V   * 2018/04/25 *RFS177667- Rep lvl inv Authorization *
021800180611      * K Naveen.   * 2018/05/02 *RFS178643- Modify to change for      *
021900180611      *             *            *distribution for new and existing.   *
022000180615      * V.Lavanya   * 2018/06/17 *RFS176315 Max Threshold Validation   *
022100180712      * K Naveen.   * 2018/05/21 *RFS178443- Default ERF applicable flg*
022200181017      *             *            *for BAJ transactions.                *
022300181017      * Prasanna Y * 2018/09/21 * RFS1005795 -  Direct switch over   *
022400181017      *                            Maximum Threshold Amount Validation.
022500190221      * Kavya K     * 2019/02/21 *RFS181057 - Recompile for MFAINVMDP  *
022600190222      *                          *          and MFAORDP15P             *
022700190508      * Kavya K     *2019/05/08 * RFS170270 - Passing additional       *
022800190508      *             *           * parameters screen code,trans type code*
022900190519      *             *           * and trans origin code while calling  *
023000190508      *             *           * pgm FXDLRREPAT.                      *
023100190603      * Kavya K     * 2019/06/03* RFS182833 - Recompile for MFAORDACCP *
023200190808      *             *           *            and MFAORLACCP            *
023300190808      * Kavya K     * 2019/07/22* RFS1016582- Fix to get correct reject*
023400190808      *             *           * -ion message when BUY is restricted  *
023500200506      * Kavya K     * 2020/02/03* RFS184869 - Recompile for CPYESGERR  *
023600200506      * Lavanya V   * 2020/05/05* RFS186122 - Fixing defects related to*
023700200407      *             *           *           assignments details of Buy *
023800200407      * Chaya SP    * 2020/03/26* RFS185170 - DJT Seg Fund Migration - *
023900200407      *             *           *  Gap Development - Managing Optional *
024000060316      *             *           *  Rider                               *
024100201230      * Mayilsamy D * 2020/07/04* RFS186092 - Recompile                *
024200201230      * Ewa K.      * 2020/10/15* RFS185174 Recompile for CPWSYSPARM   *
024300201215      * Kavya K     * 2020/10/13* RFS186497 - Recompile for CPYESGERR  *
024400210319      * Kavya K     * 2021/02/11* RFS186088 - Recompile for MFAINVMDP  *
024500210531      * Chaya SP   * 2021/01/27 * RFS180952 -HelloLife agreement number*
024600210408      * Ashwini B   * 2021/04/08* RFS187046 - Recompile for MFATRNREP *
024700210714      * Rajesh R    * 2021/06/21* RFS187440 - Recompile for MFAMFRHDP *
024701210914      * Lavanya V  * 2021/07/29 * RFS1118453 - Fix to Truncation issue *
024702210914      * Lavanya V   * 2021/07/13* RFS1115534- Get Redemption rule     *
024703210914      * Kavin K     * 2021/08/04* RFS187471 - Adding new error code   *
024900180628      *****************************************************************
025000000000       ENVIRONMENT DIVISION.
025100000000       CONFIGURATION SECTION.
025200190723       SOURCE-COMPUTER. IBM-AS400.
025300000000       OBJECT-COMPUTER. IBM-AS400.
025400040824       SPECIAL-NAMES.
025500040422R23467     LINKAGE TYPE IS PROCEDURE FOR "FXREBAL"
025600040427           LINKAGE TYPE IS PROCEDURE FOR "FXTRNCODE"
025700040427           LINKAGE TYPE IS PROCEDURE FOR "FXACCTYPE"
025800040427           LINKAGE TYPE IS PROCEDURE FOR "FXSCEDTALW"
025900040427           LINKAGE TYPE IS PROCEDURE FOR "OEVALFUND"
026000040427           LINKAGE TYPE IS PROCEDURE FOR "OEORDDATES"
026100040427           LINKAGE TYPE IS PROCEDURE FOR "OEDUPORD"
026200040427           LINKAGE TYPE IS PROCEDURE FOR "GETCTLNUM"
026300040427           LINKAGE TYPE IS PROCEDURE FOR "OEDLRREP"
026400040427           LINKAGE TYPE IS PROCEDURE FOR "ESGACCCRT"
026500180524           LINKAGE TYPE IS PROCEDURE FOR "OEACCTINF"
026600180524177667*    LINKAGE TYPE IS PROCEDURE FOR "OEDLRAUTH"
026700040427177667     LINKAGE TYPE IS PROCEDURE FOR "FXDLRREPAT"
026800040427           LINKAGE TYPE IS PROCEDURE FOR "OESETMET"
026900110313           LINKAGE TYPE IS PROCEDURE FOR "OEINVJURP"
027000110313      *Rfs89055 - Start
027100110313R89055*****LINKAGE TYPE IS PROCEDURE FOR "OEDLRMON"
027200110313           LINKAGE TYPE IS PROCEDURE FOR "OEBANKGEN"
027300040427      *Rfs89055 - End
027400040427           LINKAGE TYPE IS PROCEDURE FOR "OECRCODE"
027500040427           LINKAGE TYPE IS PROCEDURE FOR "OEAMTTYPE"
027600040427           LINKAGE TYPE IS PROCEDURE FOR "OEBANKEFT"
027700040427           LINKAGE TYPE IS PROCEDURE FOR "OEGETBATCH"
027800040427           LINKAGE TYPE IS PROCEDURE FOR "OEFBCOMM"
027900040427           LINKAGE TYPE IS PROCEDURE FOR "OECOMRBT"
028000040427           LINKAGE TYPE IS PROCEDURE FOR "OENBCMISC"
028100040427           LINKAGE TYPE IS PROCEDURE FOR "OEWRITES"
028200040427           LINKAGE TYPE IS PROCEDURE FOR "MASTERACCT"
028300040427           LINKAGE TYPE IS PROCEDURE FOR "ESGDISMOD"
028400040427           LINKAGE TYPE IS PROCEDURE FOR "XINRRPTMIN"
028500040427           LINKAGE TYPE IS PROCEDURE FOR "CHKCNTL"
028600040427           LINKAGE TYPE IS PROCEDURE FOR "OECAPRULES"
028700150428           LINKAGE TYPE IS PROCEDURE FOR "OESEGAUTH"
028800150428      * RFS 141445 Starts
028900150428      *    LINKAGE TYPE IS PROCEDURE FOR "OEAGELIMIT"
029000150428           LINKAGE TYPE IS PROCEDURE FOR "FXTRNANNAG"
029100040622      * RFS 141445 Ends
029200080630           LINKAGE TYPE IS PROCEDURE FOR "OECANCEL"
029300080630      *    RFS50474 begins (to remove period)
029400080630           LINKAGE TYPE IS PROCEDURE FOR "OEREVAOT"
02950011031332873      LINKAGE TYPE IS PROCEDURE FOR "FXCHKSEGAT"
02960008063050474      LINKAGE TYPE IS PROCEDURE FOR "FXGLWBVLD"
029700091224      *    RFS50474 ends
029800110519R54431     LINKAGE TYPE IS PROCEDURE FOR "FXRDSPCHK"
029900110704R89568     LINKAGE TYPE IS PROCEDURE FOR "ESGADDRESS"
030000200407R64263     LINKAGE TYPE IS PROCEDURE FOR "FXACINVG"
030100200407R92477*    LINKAGE TYPE IS PROCEDURE FOR "FXVLDSPTRN".
030200200425           LINKAGE TYPE IS PROCEDURE FOR "FXVLDSPTRN"
030300200407185170     LINKAGE TYPE IS PROCEDURE FOR "FXACCGLWBV"
030400200407           DATA-AREA    IS DATAARA-MFASEGPARM.
030500200407
030600000000       INPUT-OUTPUT SECTION.
030700040328       FILE-CONTROL.
030800040328           SELECT  ACCOUNT-TYPE-RD
030900040328                   ASSIGN TO DATABASE-MFAACCTYP
031000040328                   ORGANIZATION IS INDEXED
031100040328                   ACCESS IS DYNAMIC
031200040328                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
031300040328                   FILE STATUS IS WS-FILE-STATUS.
031400040330
031500040330           SELECT  INV-CODE-ACCOUNT-TYPE-RD
031600040330                   ASSIGN TO DATABASE-MFAATPIVP
031700040330                   ACCESS IS  DYNAMIC
031800040330                   ORGANIZATION IS INDEXED
031900040330                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
032000040330                   FILE STATUS IS WS-FILE-STATUS.
032100040328
032200040328           SELECT  ACCTYP-CONTRED-CODE-LIMIT-RD
032300040328                   ASSIGN TO DATABASE-MFAACCDLTP
032400040328                   ORGANIZATION IS INDEXED
032500040328                   ACCESS IS DYNAMIC
032600040328                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
032700040328                   FILE STATUS IS WS-FILE-STATUS.
032800040328
032900040328           SELECT  RESP-TYPE-SPECIMEN-PLAN-RD
033000040328                   ASSIGN TO DATABASE-MFARESPTP
033100040328                   ORGANIZATION IS INDEXED
033200040328                   ACCESS IS DYNAMIC
033300040328                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
033400040328                   FILE STATUS IS WS-FILE-STATUS.
033500040328
033600040328           SELECT  ACCOUNT-INVESTMENT-RD
033700040328                   ASSIGN TO DATABASE-MFAACCIVP
033800040328                   ORGANIZATION IS INDEXED
033900040328                   ACCESS IS DYNAMIC
034000040328                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
034100040328                   FILE STATUS IS WS-FILE-STATUS.
034200040328
034300040328           SELECT  ACCOUNT-BENEFICIARY-SPLIT-RD
034400040328                   ASSIGN TO DATABASE-MFAACCBPLC
034500040328                   ORGANIZATION IS INDEXED
034600040328                   ACCESS IS DYNAMIC
034700040328                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
034800040328                   WITH DUPLICATES
034900040328                   FILE STATUS IS WS-FILE-STATUS.
035000040328
035100040328           SELECT  INV-AUTHORIZATION-CODES-RD
035200040328                   ASSIGN TO DATABASE-MFAINVACP
035300040328                   ORGANIZATION IS INDEXED
035400040328                   ACCESS IS  RANDOM
035500040328                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
035600040328                   FILE STATUS IS WS-FILE-STATUS.
035700040329
035800040329           SELECT  TRANS-CONTR-REDEM-CODE-RD
035900040329                   ASSIGN TO DATABASE-MFATRNCRP
036000040329                   ORGANIZATION IS INDEXED
036100040329                   ACCESS IS DYNAMIC
036200040329                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
036300080721                   FILE STATUS IS WS-FILE-STATUS.
036400080721
036500080721R50474     SELECT  INVESTMENT-SEG
036600080721 |                 ASSIGN TO DATABASE-MFAINVSGP
036700080721 |                 ORGANIZATION IS INDEXED
036800080721 |                 ACCESS IS DYNAMIC
036900080721 |                 RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
037000000000R50474             FILE STATUS IS WS-FILE-STATUS.
037100040323      /
037200040323       DATA DIVISION.
037300110313       FILE SECTION.
037400040328       FD  ACCOUNT-TYPE-RD.
037500040328       01  ACCOUNT-TYPE-RD-REC.      COPY DD-ALL-FORMATS OF MFAACCTYP.
037600110313      /
037700040330       FD  INV-CODE-ACCOUNT-TYPE-RD.
037800040330       01  INV-CODE-ACCT-TYPE-RD-REC.
037900040330                                     COPY DD-ALL-FORMATS OF MFAATPIVP.
038000110313      /
038100040328       FD  ACCTYP-CONTRED-CODE-LIMIT-RD.
038200040328       01  ACCTYP-CONTRED-CODE-LMT-RD-REC.
038300040328                                     COPY DD-ALL-FORMATS OF MFAACCDLTP.
038400110313      /
038500040328       FD  RESP-TYPE-SPECIMEN-PLAN-RD.
038600040328       01  RESP-TYPE-SPEC-PLAN-RD-REC.
038700040328                             COPY DD-ALL-FORMATS OF MFARESPTP.
038800110313      /
038900040328       FD  ACCOUNT-INVESTMENT-RD.
039000040328       01  ACCOUNT-INVESTMENT-RD-REC.
039100040328                                     COPY DD-ALL-FORMATS OF MFAACCIVP.
039200110313      /
039300040328       FD  ACCOUNT-BENEFICIARY-SPLIT-RD.
039400040328       01  ACCOUNT-BEN-SPLIT-RD-REC.
039500040328                                     COPY DD-ALL-FORMATS OF MFAACCBPLC.
039600110313      /
039700040328       FD  INV-AUTHORIZATION-CODES-RD.
039800040328       01  INV-AUTHORIZATION-RD-REC.
039900040328                             COPY DD-ALL-FORMATS OF MFAINVACP.
040000110313      /
040100040329       FD  TRANS-CONTR-REDEM-CODE-RD.
040200040329       01  TRANS-CONTR-REDEM-CODE-RD-REC.
040300080721                             COPY DD-ALL-FORMATS OF MFATRNCRP.
040400110313R50474/
040500080721 |     FD  INVESTMENT-SEG.
040600080721 |     01  INVESTMENT-SEG-REC.
040700040329R50474                       COPY DD-ALL-FORMATS OF MFAINVSGP.
040800040323      /
040900040721       WORKING-STORAGE SECTION.
041000040721           COPY CPYESGERR.
041100040328           COPY CPWSYSPARM.
041200040330      ******************************************************************
041300040328      *    E X T E R N A L    C O P Y    B O O K S                     *
041400040721      ******************************************************************
041500040721           COPY CPYOE15.
041600040721           COPY CPYOERESWS.
041700040721           COPY CPYOE15REC.
041800120823           COPY CPYOE15FLD.
041900041025R99891     COPY CPYESBRECS.
042000060626R22427     COPY CPYOE15CS.
04210008063032873      COPY Cpchksegat.
04220009092350474      COPY CPYGLWBVLD.
042300101012R54431     COPY CPRDSPCHK.
042400101012R86061     COPY CPYSQLFLD
042500110313R86061          REPLACING == "CURRENT_PROGRAM" == BY == "OETRNBUY" ==.
042600130117R89055     COPY PRCDTWS.
042700131001118185     COPY CPYADDRREC.
042800200326119020     COPY CPCHKANN.
042900040423
043000120802       01 ACCOUNT-RESP-REC EXTERNAL. COPY DD-ALL-FORMATS OF MFAACCESP.
043100120803      *RFS99891 - Start
043200120803       01  TRANS-ASSIGNMENT-REC EXTERNAL.
043300120802                             COPY DD-ALL-FORMATS OF MFATRNASP.
043400040721      *RFS99891 - End
043500180405
043600180405174735 01 COMM-F50-FLAG                PIC X(1) EXTERNAL.
043700040328
043800120803       01 COMM-CAPPING-LEVEL-INDICATOR PIC X EXTERNAL.
043900120810R99891 01 COMM-WRITE-TRANS-ASSIGN      PIC X EXTERNAL.
044000180131R99891 01 Comm-UserId                  PIC X(10) EXTERNAL.
044100180131165468 01 Comm-Stdord-Edt-Code         PIC X EXTERNAL.
044200040424
044300040424       01 INV-LAST-UNIT-PRICE-REC EXTERNAL.
044400040328                                     COPY DD-ALL-FORMATS OF MFAINVLPP.
044500110704
044600110704R92477 01 ex-Oesplitedit               PIC X(1) EXTERNAL.
044700110704R92477 01 lc-SplitAllowed              PIC X(1) VALUE " ".
044701210914118453 01 COMM-BULK-AMOUNT             PIC S9(11)V9(04) EXTERNAL.
044800040328
044900040413       01 PERMENANT-WORK-FIELDS.
045000040413          02 WS-OPEN-FILE              PIC X(1) VALUE "Y".
045100040315             88 OPEN-FILE                  VALUE "N".
045200040328
045300040328          02 WS-TRANS-TYPE.
045400040328             03 WS-TRANS-TYPE-REC      PIC X(1).
045500040328                88 PURCHASE-TRANSACTION    VALUE "5" "I".
045600040328                88 SWITCH-IN-TRANSACTION   VALUE "I".
045700040328                88 SWITCH-OUT-TRANSACTION  VALUE "O".
045800040328                88 REDEMPTION-TRANSACTION  VALUE "6" "O" "4".
045900040328                88 SELL-TRANSACTION        VALUE "6" "4".
046000040328                88 FEE-TRANSACTION         VALUE "4".
046100040328                88 BUY-TRANSACTION         VALUE "5".
046200040330                88 SWITCH-TRANSACTION      VALUE "I" "O".
046300040328
046400180215             03 WS-TRANS-TYPE-DET      PIC X(1).
046500180215174735*         88 INTERNAL-TFR            VALUE "8".
046600180215174735*         88 EXTERNAL-TFR            VALUE "4".
046700040328174735*         88 SWITCH-TRN              VALUE "1".
046800180215                88 COMMISSION-REBATES      VALUE "5".
046900090225174735*         88 LSIF-ROLLOVER           VALUE "R".
047000180215R60350          88 In-Cash-Transfer        VALUE "9".
047100040320174735          88 PAC-PURCHASE            VALUE "6".
047200040408
047300130311             03 WS-EXTERNAL-TRANS-DET  PIC X(1).
047400040328
047500040328           02 WS-ORDER-TYPE            PIC X(1).
047600040328              88 WIRE-ORDER                VALUE " " "W".
047700040326              88 DIRECT-ORDER              VALUE "D".
047800040328
047900040328           02 ACTION-CODES             PIC X(3).
048000040319              88 VALID-ACTION-CODES        VALUES "NEW" "CHG" "CAN"
048100040328                                                 "REV" "AOT".
048200040328              88 ACTION-NEW                VALUE  "NEW".
048300040328              88 ACTION-CANCEL             VALUE  "CAN".
048400040328              88 ACTION-CHANGE             VALUE  "CHG".
048500040328              88 ACTION-REV-AOT            VALUE  "REV" "AOT".
048600040328              88 ACTION-REVERSAL           VALUE  "REV".
048700040320              88 ACTION-AS-OF-TRANS        VALUE  "AOT".
048800040328
048900040328           02 WS-FILE-STATUS           PIC X(2).
049000040328              88 WS-FILE-STATUS-FOUND      VALUE "00".
049100040328              88 WS-FILE-STATUS-EOF        VALUE "10".
049200040328              88 WS-FILE-STATUS-NOTFOUND   VALUE "23".
049300040326              88 WS-FILE-STATUS-LOCKED     VALUE "9D".
049400040328
049500040328           02 WS-ACCOUNT-DESINATION    PIC X(1).
049600040328              88 CLIENT-ACCOUNT            VALUE "1".
049700040328              88 NOMINEE-ACCOUNT           VALUE "2" "3".
049800040328              88 BROKER                    VALUE "2".
049900040319              88 INTERMEDIARY              VALUE "3".
050000040328
050100040602           02 WS-NETWORK-ID            PIC X(4).
050200130808              88 NETWORK-ORDER             VALUE "FSRV" "MFCS" "NSM9"
050300080825124176                                           "CSSS" "ITRX" "ATON"
050400080825R53706                                           "ITXA" "ITXP".
050500040326R53706        88 ITRX-ORDER                VALUE "ITXA" "ITXP".
050600040328
050700040328           02 WS-SETTLE-STATUS          PIC X(1).
050800040320              88 CSS-ORDER                  VALUE "C".
050900040328
051000040328           02 WS-ACCOUNT-TYPE-RULE      PIC X(1).
051100040328              88 CASH-ACCOUNT               VALUE "1".
051200040328              88 RRSP-ACCOUNT               VALUE "2".
051300040328              88 RRIF-ACCOUNT               VALUE "3".
051400090923              88 RESP-ACCOUNT               VALUE "4".
051500040421R54431        88 RDSP-ACCOUNT               VALUE "0".
051600040328           02 WS-ACCOUNT-TYPE-CODE      PIC X(5).
051700040319
051800040318      ******Character Fields.
051900040328           02 CHARACTER-WORK-FIELDS.
052000060214              03 WS-PROGRAM-CODE        PIC X(8) VALUE "ORDEN2.2".
052100040324
052200040321       01  TEMPORARY-WORK-FIELDS.
052300040324           02 WS-FUND-ACCOUNT-NO.
052400040321              03 WS-ACCOUNT-NO9        PIC 9(9).
052500040424              03 FILLER                PIC X(6).
052600040424
052700041201           02 WS-TOT-AMOUNT            PIC S9(11)V9(2) VALUE 0.
052800040320R24515     02 WS-LAST-UNIT-PRICE-FOUND PIC X(1) VALUE " ".
052900040322
053000040322           02 MISC-WORK-FIELD.
053100040322              03 WS-CREATE-NEW-ACCT    PIC X(1).
053200040322                 88 MASTER-ACCOUNT-CREATE  VALUE "Y".
053300040322              03 MASTER-DEALER-PROCESS PIC X(1).
053400101012              03 WS-MODULE-MASTER-ACC  PIC X(1).
053500101013      *RFS86061 - Start
053600101013           02 li-ValIns                PIC S9(4).
053700101013           02 lc-InvCode               PIC X(05).
053800101013           02 lc-AccType               PIC X(05).
053900101013           02 lc-DistOption            PIC X(01).
054000101013           02 lc-PaymentType           PIC X(01).
054100101012           02 lc-KeepOnVal             PIC X(01).
054200120411      *RFS86061 - End
054300210531180952     02 WS-FUND-ACCOUNT-NO1.
054400210531180952        03 WS-ACCOUNT-NO         PIC 9(9).
054500210531180952        03 FILLER                PIC X(6).
054600210531180952     02 lc_IndFndCode            PIC X(05).
054700210531180952     02 lc_AccountNo1            PIC S9(09) VALUE ZEROES.
054800120411      *RFS97573 - Start
054900120411           02 lc_WaiveMin              PIC X(01) VALUE SPACES.
055000120411           02 lc_MinAmtExist           PIC X(01) VALUE SPACES.
055100120411           02 lc_InvestCode            PIC X(05) VALUE SPACES.
055200120411           02 lc_PlanTrans             PIC X(03) VALUE SPACES.
055300120411           02 lc_ChqType               PIC X(03) VALUE SPACES.
055400120411           02 ln_MinAmt                PIC S9(11)V9(2) COMP-3 VALUE 0.
055500120411           02 ln_CurrUnitBal           PIC S9(10)V9(3) COMP-3 VALUE 0.
055600120411           02 ln_PACAmt                PIC S9(11)V9(2) COMP-3 VALUE 0.
055700120411           02 lc_TradeSubType          PIC X(01) VALUE SPACES.
055800130311      *RFS97573 - End
055900040322116694     02 ln_InvestorNo            PIC S9(9)       COMP-3 VALUE 0.
056000110313
056100110313      * RFS89055 - Begins
056200110313           02 lc_AccountTypeCode       PIC X(5)               VALUE " ".
056300110313           02 lc_BeneficiarySplitCode  PIC X(5)               VALUE " ".
056400110313           02 lc_BranchCode            PIC X(5)               VALUE " ".
056500110313           02 lc_ContrRedemCode        PIC X(6)               VALUE " ".
056600110313           02 lc_ContrRedemCodeRule    PIC X(2)               VALUE " ".
056700110313           02 lc_CompundTax            PIC X(1)               VALUE " ".
056800110313           02 lc_CountryCode           PIC X(3)               VALUE " ".
056900110313           02 lc_DefaultFlag           PIC X(1)               VALUE " ".
057000110313           02 lc_DealerCode            PIC X(4)               VALUE " ".
057100110313           02 lc_DealerRepCode         PIC X(6)               VALUE " ".
057200110313           02 lc_Group                 PIC X(1)               VALUE " ".
057300110313           02 lc_GroupCode             PIC X(6)               VALUE " ".
057400110313           02 lc_InstitutionCode       PIC X(5)               VALUE " ".
057500110313           02 lc_InvestmentCode        PIC X(5)               VALUE " ".
057600110313           02 lc_MfrGroupCode          PIC X(4)               VALUE " ".
057700110313           02 lc_MFRGroupCodeStatus    PIC X(1)               VALUE " ".
057800110313           02 lc_MfrScheduleCode       PIC X(3)               VALUE " ".
057900110313           02 lc_PaymentTypeCode       PIC X(1)               VALUE " ".
058000110313           02 lc_PaymentTypeRule       PIC X(1)               VALUE " ".
058100110313           02 lc_ProductTypeCode       PIC X(3)               VALUE " ".
058200110313           02 lc_ProvinceCode          PIC X(3)               VALUE " ".
058300110313           02 lc_SalesTaxCode          PIC X(1)               VALUE " ".
058400110313           02 lc_ScreenCode            PIC X(8)               VALUE " ".
058500110313           02 lc_TerminalTransferAllowed  PIC X(1)            VALUE " ".
058600110313           02 lc_TradeRejectFlag       PIC X(1)               VALUE " ".
058700110313           02 lc_TransTypeCode         PIC X(3)               VALUE " ".
058800110313
058900110313           02 li_AccountNo             PIC S9(9)              VALUE 0.
059000110313           02 li_Count                 PIC S9(9)              VALUE 0.
059100110313           02 li_HrdcFileDate          PIC S9(9)              VALUE 0.
059200110313           02 li_TradeDate             PIC S9(9)              VALUE 0.
059300110313
059400110313           02 ln_BeneficiarySeqNo      PIC S9(3)       COMP-3 VALUE 0.
059500110313           02 ln_PaymentCutoffTime     PIC S9(5)       COMP-3 VALUE 0.
059600110313           02 ln_SystemTime            PIC S9(4)       COMP-3 VALUE 0.
059700121102           02 ln_ContriLimit           PIC S9(11)V9(2) COMP-3 VALUE 0.
059800121102115704*    02 ln_FederalTaxPercent     PIC S9(5)V9(2)  COMP-3 VALUE 0.
059900121102115704*    02 ln_ProvincialTaxPercent  PIC S9(5)V9(2)  COMP-3 VALUE 0.
060000121102115704     02 ln_FederalTaxPercent     PIC S9(4)V9(5)  COMP-3 VALUE 0.
060100110313115704     02 ln_ProvincialTaxPercent  PIC S9(4)V9(5)  COMP-3 VALUE 0.
060200110313           02 ln_GSTAmount             PIC S9(11)V9(2) COMP-3 VALUE 0.
060300110313           02 ln_PSTAmount             PIC S9(11)V9(2) COMP-3 VALUE 0.
060400110313           02 ln_YtdContrDeductAmt     PIC S9(11)V9(2) COMP-3 VALUE 0.
060500110313           02 ln_LtdContrDeductAmt     PIC S9(11)V9(2) COMP-3 VALUE 0.
060600130326           02 ln_UnitPrice             PIC S9(5)V9(4)  COMP-3 VALUE 0.
060700120802114676     02 lc_Delcode               PIC X(04) VALUE SPACE.
060800120802      *RFS99891 - Start
060900120802           02 lc_InstCde               PIC X(05).
061000120817           02 lc_BchCde                PIC X(05).
061100120817           02 li_instvalid             PIC S9(4) COMP.
061200120817           02 li_Bchvalid              PIC S9(4) COMP.
061300120802           02 li_TrnAssSeqNO           PIC S9(3)              VALUE 0.
061400120803           02 lc_Splitcd               PIC X(1).
061500120803           02 li_Cnt                   PIC S9(9)              VALUE 0.
061600121024           02 lc_AssType               PIC X(1).
061700121024           02 lc_DlrCode               PIC X(04).
061800121024           02 lc_SuperRepCode          PIC X(06).
061900121024           02 li_Cnt1                  PIC S9(4) COMP.
062000120802           02 lnc_A                    PIC X(01)           VALUE "A".
062100110313      *RFS99891 - End
062200110313           02 lb_RecordFound           PIC X(1).
062300110313              88 lb_RecordFoundYes                         VALUE B"1".
062400110313              88 lb_RecordFoundNo                          VALUE B"0".
062500110313           02 lb_CommissionRebate      PIC X(1).
062600110313              88 lb_CommissionRebateYes                    VALUE B"1".
062700110313              88 lb_CommissionRebateNo                     VALUE B"0".
062800110313           02 lb_RespGrant             PIC X(1).
062900110313              88 lb_RespGrantYes                           VALUE B"1".
063000110313              88 lb_RespGrantNo                            VALUE B"0".
063100110313           02 lb_C1AcctBenSplEof       PIC X(1).
063200110313              88 lb_C1AcctBenSplEofYes                     VALUE B"1".
063300110313              88 lb_C1AcctBenSplEofNo                      VALUE B"0".
063400110313           02 lb_C2AcctBenFinEof       PIC X(1).
063500110313              88 lb_C2AcctBenFinEofYes                     VALUE B"1".
063600171213              88 lb_C2AcctBenFinEofNo                      VALUE B"0".
063700171213
063800171213      * RFS165468 Starts
063900171213           02 lb_StandingOrd           PIC X(1).
064000171213              88 lb_StandingOrdYes                         VALUE B"1".
064100171213              88 lb_StandingOrdNo                          VALUE B"0".
064200171213           02 lb_InitialBuy            PIC X(1).
064300171213              88 lb_InitialBuyYes                          VALUE B"1".
064400171213              88 lb_InitialBuyNo                           VALUE B"0".
064500171213           02 lb_StdordEdit            PIC X(1).
064600171213              88 lb_StdordEditYes                          VALUE B"1".
064700171213              88 lb_StdordEditNo                           VALUE B"0".
064800110313      * RFS165468 Ends
064900210531      * RFS180952 - Start.
065000210531           02 lb_ConstSeries        PIC X(1).
065100210531              88 lb_ConstSeriesYes        VALUES "Y".
065200210531              88 lb_ConstSeriesNo         VALUES "N".
065300210531           02 lb_HLIattribute       PIC X(1).
065400210531              88 lb_HLIattributeYes       VALUES "Y".
065500210531              88 lb_HLIattributeNo        VALUES "N".
065600210531      * RFS180952 - End.
065700110313
065800110313           02 li_TaxDate               PIC S9(9)              VALUE 0.
065900110313           02 li_TaxDateR  REDEFINES  li_TaxDate.
066000110313              05 li_TaxYear            PIC S9(5).
066100110313              05 li_TaxMonth           PIC S9(2).
066200110313              05 li_TaxDay             PIC S9(2).
066300110704           02 ln_TaxYear               PIC S9(5)       COMP-3 VALUE 0.
066400110704      *RFS92477 - START.
066500110704
066600120817        01 lncc-N                    PIC X(01) VALUE "N".
066700120817      *RFS99891 - Start
066800120817        01 lnc_Y                     PIC X(01) VALUE "Y".
066900120817        01 lnc_P                     PIC X(01) VALUE "P".
067000120817        01 lnc_PER                   PIC X(01) VALUE "%".
067100120817        01 lnc_Dollar                PIC X(01) VALUE "$".
067200121025        01 lnc_D                     PIC X(01) VALUE "D".
067300121025        01 lnc_U                     PIC X(01) VALUE "U".
067400130104        01 lnc_S                     PIC X(01) VALUE "S".
067500121205      *RFS99891 - End
067600121205      * RFS 99905 - Start
067700121205        01 lnc_BUY54                 PIC X(05) VALUE "BUY54".
067800121205        01 lnc_BUY55                 PIC X(05) VALUE "BUY55".
067900121205        01 lc_ValidDate              PIC X(01) VALUE SPACES.
068000121205        01 lnc_N                     PIC X(01) VALUE "N".
068100121205        01 li_ValDate                PIC 9(08) VALUE 0.
068200121205        01 li_ValDateR REDEFINES li_ValDate.
068300121205           03 li_CCYY                  PIC 9(04).
068400121205           03 li_MMDD                  PIC 9(04).
068500190808      * RFS 99905 - End
068600190808016582  01 lnc_ERR-INVALID-MSG-SEQ     PIC X(15)
068700120817016582                                 VALUE "MS:INV MSG SEQ".
068800180411
068900180411        01 lnc_NA                    PIC X(02) VALUE "NA".
069000110704
069100110704        01 lncc-BUY15                PIC X(05) VALUE "BUY15".
069200110704        01 lncc-Screenname01         PIC X(10) Value "TRNPURW".
069300180425        01 lncc-Screenname02         PIC X(10) value "TRNPURE".
069400180425177667  01 lncc-ESGORDER             PIC X(08) value "ESGORDER".
069500180425177667  01 WS-DEALER-CODE            PIC X(04) VALUE SPACES.
069600180425177667  01 WS-DEAREP-CODE            PIC X(06) VALUE SPACES.
069700180425177667  01 WS-INVEST-CODE            PIC X(05) VALUE SPACES.
069800180425177667  01 WS-PGM-CODE               PIC X(08) VALUE SPACES.
069900110704177667  01 WS-RETURN-CODE            PIC X(02) VALUE SPACES.
070000210809187471  01 lncc_05                   PIC X(02) VALUE "05".
070100110704
070200110313      *RFS92477 - END.
070300110313       01  wsFXSERIECHK-Variables.
070400110313           05  lc-fsc-SeriesID           PIC X(05).
070500110313           05  lc-fsc-SeriesType         PIC X(04).
070600110313           05  lc-fsc-ContractExists     PIC X(01).
070700110313           05  lc-fsc-ErrorCode          PIC X(02).
070800130227      * RFS89055 - Ends
070900130227      * RFS114676- Start
071000130227       01  lc_SettleMethod               PIC X(1).
071100130227         88  lnc_EFT                           VALUE "E".
071200130227         88  lnc_Cheque                        VALUE "C" .
071300130321         88  lnc_SettleNotAppl                 VALUE "#".
071400130321       01  lc_SettleStatus               PIC X(1).
071500130321         88  lnc_Bulk                          VALUE "B".
071600130227         88  lnc_Individual                    VALUE "I" .
071700110313      *RFS114676 End.
071800040322
071900040322       01  PROGRAM-PARMS-WORK-FIELDS.
072000040322           02 MST-PARMS                  PIC X(117).
072100040322           02 MST-PARMS-1 REDEFINES MST-PARMS.
072200040322              03 MST-ACCT-NO             PIC 9(9).
072300040322              03 MST-DEALER              PIC X(4).
072400040322              03 MST-INVEST              PIC X(5).
072500040322              03 MST-CALLING-FROM-SCRN   PIC X.
072600040322              03 MST-BUY-OR-SELL         PIC X.
072700040322              03 MST-AAP-FUND-SEP        PIC X.
072800040322              03 MST-MASTER-ACCT-MOD     PIC X.
072900040322              03 MST-RETURN-CODE         PIC X.
073000040322              03 MST-DETERMINE-FLAG      PIC X.
073100040322              03 MST-MASTER-ACCT         PIC 9(9).
073200040322              03 MST-NEW-ACCT            PIC 9(9).
073300040322              03 MST-RPT-MASTER-ACCT     PIC X.
073400040322              03 MST-ACCT-NO-2           PIC 9(9).
073500040322              03 MST-INVEST-2            PIC X(5).
073600040322              03 MST-TRANS-TYPE-CODE     PIC X(3).
073700040322              03 MST-SPLIT-OPTION-CODE   PIC X.
073800040322              03 MST-UPDATE-MFAACCIAP    PIC X(02).
073900040322              03 MST-PLACEMENT-DATE      PIC 9(8).
074000040322              03 MST-TRANS-NO            PIC 9(9).
074100040322
074200040322           02 COMM-CAP-AREA.
074300040322              03 COMM-CAP-MGMT-CO-CODE      PIC X(3).
074400040322              03 COMM-CAP-ACCOUNT-NO        PIC 9(9).
074500040322              03 COMM-CAP-INVESTOR-NO       PIC 9(9).
074600040322              03 COMM-CAP-INVESTMENT-GROUP  PIC X(5).
074700040322              03 COMM-CAP-INVESTMENT-CODE   PIC X(5).
074800040322              03 COMM-CAP-SIN               PIC 9(9).
074900040322                 88 INVALID-SIN      VALUES 111111118
075000040322                                            000000000.
075100040322              03  COMM-CAP-NOM-ACTTYPE       PIC X(5).
075200040322              03  COMM-CAP-DEALER-CODE       PIC X(4).
075300040322              03  COMM-CAP-TRANS-TYPE        PIC X.
075400040322              03  COMM-CAP-FROM-INVESTMENT   PIC X(5).
075500040322              03  COMM-CAP-IND               PIC X.
075600040322
075700040322           02 WS-PARM-PTMIN.
075800040322              05 WS-PTMIN-ACCOUNT-NO       PIC 9(9).
075900040322              05 WS-PTMIN-INVESTMENT-CODE  PIC X(5).
076000040322              05 WS-PTMIN-PLAN-TRANS       PIC X(5).
076100040322              05 WS-PTMIN-CHEQUE-TYPE      PIC X(3).
076200040322              05 WS-PTMIN-PRODUCT-RULE     PIC X.
076300130225              05 WS-PTMIN-MIN-AMT          PIC S9(11)V99 COMP-3.
076400130225112072        05 WS-PTMIN-DEALER-CODE      PIC X(04).
076500130225112072        05 WS-PTMIN-DEALER-REP-CODE  PIC X(06).
076600130806113777        05 WS-PTMIN-ACC-AMT          PIC S9(11)V99 COMP-3.
076700130806      * RFS126078 - Start
076800130807      * RFS117763 - Start
076900130807              05 WS-PTMIN-OutAccount        PIC X(09).
077000130807              05 PTMIN-OutAccount REDEFINES WS-PTMIN-OutAccount
077100130806                                            PIC 9(9).
077200130806              05 WS-PTMIN-OutTransType      PIC X(03).
077300130806              05 WS-PTMIN-OutTransOrigCode  PIC X(03).
077400130806              05 WS-PTMIN-OutContrRedemCode PIC X(06).
077500130806      * RFS117763 - End
077600180712      * RFS126078 - End
077700180703176315        05 WS-PTMIN-TransMode         PIC X(01).
077800180703176315        05 WS-PTMIN-INOUT-DATA.
077900180926176315           10 WS-PTMIN-TRADE-DATE     PIC 9(08).
078000180926005795           10 WS-PTMIN-PlacementDate  PIC 9(08).
078100190121005795           10 WS-PTMIN-TransNo        PIC 9(09).
078200040322176315           10 FILLER                  PIC X(22).
078300040322
078400040322           02 LMT-PARMS                      PIC X(100).
078500040322           02 LMT-PARMS-R REDEFINES LMT-PARMS.
078600040322              03 LMT-INVESTOR                PIC 9(9).
078700040322              03 LMT-ACCOUNT                 PIC 9(9).
078800040322              03 LMT-ACCOUNT-TYPE            PIC X(5).
078900040322              03 LMT-CONTR-REDEM-CODE        PIC X(6).
079000040322              03 LMT-CHECK-LEVEL             PIC X.
079100040322              03 LMT-CONTR-LIMIT             PIC S9(11)V99.
079200040322           02 LMT-REJECTION-CODE             PIC X(2).
079300040322           02 LMT-AMOUNT                     PIC S9(11)V99 COMP-3.
079400040326
079500040322           02 PARM-CONTROL-CODE          PIC X(4) VALUE "TRN#".
079600040322           02 PARM-CONTROL-NUM           PIC S9(9) COMP-3.
079700040322           02 PARM-RETURN-CODE           PIC X(2).
079800040322
079900040322           02 COMM-TRN-PARMS.
080000110311              03 COMM-GET-TRANS-TYPE      PIC X(1).
080100110311R84184********03 COMM-EXTERNAL-TRANS-TYPE PIC X(2).
080200040408R84184        03 COMM-EXTERNAL-TRANS-TYPE PIC X(3).
080300040322              03 COMM-UNITRAX-TRANS-TYPE  PIC X(3).
080400040330              03 COMM-TRANS-SEQ-NO        PIC S9(3).
080500040824              03 FX-RETURN-CODE           PIC X(2).
080600040824
080700040824R23467******************************************************************
080800040824   |  *    FXREBAL parameters                                          *
080900040824   |  ******************************************************************
081000040824   |       02 WS-PARM-FXREBAL.
081100040824   |          05 WS-FXREBAL-ACCOUNT-NO    PIC 9(9).
081200040824   |          05 WS-FXREBAL-SCREEN-CODE   PIC X(8) VALUE "ESGORDER".
081300040824   |          05 WS-FXREBAL-UPDATE-FILE   PIC X(1).
081400040824   |          05 WS-FXREBAL-SQL-LOG       PIC X(1).
081500040322R23467        05 WS-FXREBAL-RETURN-CODE   PIC X(2).
081600110313
081700110313      * RFS89055 - Begins
081800110313           02 pc_MfrcalcParms.
081900110313              05 pc_MfrcalcProcessOption  PIC X(1)            VALUE " ".
082000110313              05 pc_MfrcalcMfrSchedule    PIC X(3)            VALUE " ".
082100110313              05 pi_MfrcalcAccountNo      PIC 9(9)            VALUE 0.
082200110313              05 pc_MfrcalcInvestmentCode PIC X(5)            VALUE " ".
082300110313              05 pi_MfrcalcFromDate       PIC 9(8)            VALUE 0.
082400110313              05 pi_MfrcalcToDate         PIC 9(8)            VALUE 0.
082500110313              05 pc_MfrcalcRejectionCode  PIC X(3)            VALUE " ".
082600110313              05 pi_MfrcalcCalculatedAmt  PIC S9(11)V9(2)     VALUE 0.
082700110313              05 pi_MfrcalcPstAmt         PIC S9(11)V9(2)     VALUE 0.
082800110313              05 pi_MfrcalcGstAmt         PIC S9(11)V9(2)     VALUE 0.
082900110313              05 pc_MfrcalcMfrGroupCode   PIC X(4)            VALUE " ".
083000110313
083100110313           02 pc_FxtrnaucParms.
083200110313              05 pc_FxtrnaucProcessMode   PIC X(1)            VALUE " ".
083300110313              05 pn_FxtrnaucPlacementDate PIC S9(9)    COMP-3 VALUE 0.
083400110313              05 pn_FxtrnaucTransNo       PIC S9(9)    COMP-3 VALUE 0.
083500110313              05 pn_FxtrnaucAvgUnitCost   PIC S9(4)V9(4)      VALUE 0.
083600110313              05 pc_FxtrnaucReturnCode    PIC X(2)            VALUE " ".
083700110313
083800110313           02 pc_ChkinvmdtParms.
083900110313              05 pc_ChkinvmdtPassParms.
084000110313                 10 pc_ChkinvmdtAcctNo    PIC X(9)            VALUE " ".
084100110313                 10 pc_ChkinvmdtInvestCd  PIC X(5)            VALUE " ".
084200110313                 10 pc_ChkinvmdtScreenCd  PIC X(8)            VALUE " ".
084300110313                 10 pc_ChkinvmdtTradeDate PIC X(8)            VALUE " ".
084400110313              05 pc_ChkinvmdtRejectCode   PIC X(2)            VALUE " ".
084500110313              05 pc_ChkinvmdtRejectDescr  PIC X(50)           VALUE " ".
084600110313      * RFS89055 - Ends
084700040422
084800040422           02 COMM-GET-ACOUNT-TYPE       PIC X(1).
084900040422           02 COMM-ACCOUNT-TYPE-CODE     PIC X(5).
085000040422           02 COMM-NOMINEE-TYPE-CODE     PIC X(5).
085100040422           02 COMM-EXT-ACCT-TYPE-CODE    PIC X(2).
085200040422           02 COMM-ACCOUNT-DESIGNATION   PIC X(1).
085300041025
085400041025R22427**01 MANAGEMENT-COMPANY-SPECIFICS.
085500041025       01  WS-NBC-PAYMENT-TYPE-RULE         PIC X(1) VALUE SPACES.
085600041025       01  WS-NBC-FLAG                      PIC X(1).
085700041025           88 NBC-DIRECT-TRADES                 VALUE "D".
085800041025       01  WS-NBC-DIRECT-SETTLEMENT-FLAG    PIC X(1).
085900041025           88 NBC-DIRECT-CHQ                    VALUE "C".
086000040320           88 NBC-DIRECT-EFT                    VALUE "E".
086100040319
086200040319       01 SCREEN-EDITS-ALLOWED.
086300040319          02 SCREEN-EDITS-ALLOWED-REC.
086400040319                                     COPY DD-ALL-FORMATS OF MFAEDTSCP.
086500040319          02 WS-SCREEN-EDITS-ALLOWED.
086600040319             03 WS-SEA-EDIT-SQLLOG           PIC X(1) VALUE "N".
086700040319             03 WS-SEA-RETURN-CODE           PIC X(2) VALUE "00".
086800040319
086900040319          02 WS-SCREEN-EDITS-ALLOWED-REVAOT.
087000040319             03 WS-REVAOT-SCREEN-CODE        PIC X(8) VALUE "ESGOE".
087100040319             03 WS-REVAOT-EDIT-CODE          PIC X(6) VALUE "REVAOT".
087200040319             03 WS-REVAOT-LEVEL-CODE         PIC X(1) VALUE "A".
087300040319
087400040319          02 WS-SCREEN-EDITS-ALLOWED-DEAMNR.
087500040319             03 WS-DEAMNR-SCREEN-CODE        PIC X(8) VALUE "ESGORDER".
087600040319             03 WS-DEAMNR-EDIT-CODE          PIC X(6) VALUE "DEAMNR".
087700040824             03 WS-DEAMNR-LEVEL-CODE         PIC X(1) VALUE "T".
087800040824
087900040824R23467    02 WS-SCREEN-EDITS-ALLOWED-REBAL.
088000040824   |         03 WS-REBAL-SCREEN-CODE         PIC X(8) VALUE "ESGORDER".
088100040824   |         03 WS-REBAL-EDIT-CODE           PIC X(6) VALUE "REBAL ".
088200060626R23467       03 WS-REBAL-LEVEL-CODE          PIC X(1) VALUE "T".
088300110313
088400110313      * RFS89055 - Begins
088500110313       01 lcu_C1AcctBenSplRec.
088600110313          05 lcu_BeneficiaryPercent      PIC S9(5)V9(2) COMP-3 VALUE 0.
088700110313          05 lcu_BeneficiarySeqNo        PIC S9(3)      COMP-3 VALUE 0.
088800110313
088900110313       01 lcu_C2AcctBenFinRec.
089000110313          05 lcu_ContrRedemCodeRule      PIC X(2)             VALUE " ".
089100110313          05 lcu_YtdContrDeductAmt       PIC S9(11)V9(2) COMP-3 VALUE 0.
089200110313          05 lcu_LtdContrDeductAmt       PIC S9(11)V9(2) COMP-3 VALUE 0.
089300110313      * RFS89055 - Ends
089400060626
08950006062632873  01  Constants.
08960016080832873      03  lncc_ProgramName              PIC X(10) VALUE "OETRNBUY".
089700080630159042     03  lncc_Annuity                  PIC X(10) VALUE "ANNUITY" .
08980008063050474      03  ln_Invstr_Age_Err             PIC X(15) VALUE
08990011031350474                                                  "INVSTR AGE ERR".
090000150318      * RFS89055 - Begins
090100150318136894     03 lncc-Y                         PIC X(1) VALUE "Y".
090200110313136894     03 lnc_BULK                       PIC X(04) VALUE "BULK".
090300110313           03 lncc_B                         PIC X(1) VALUE "B".
090400110313           03 lncc_BAJ                       PIC X(3) VALUE "BAJ".
090500110313           03 lncc_C                         PIC X(1) VALUE "C".
090600110313           03 lncc_E                         PIC X(1) VALUE "E".
090700110313           03 lncc_G                         PIC X(1) VALUE "G".
090800110313           03 lncc_GRNTNF                    PIC X(6) VALUE "GRNTNF".
090900110313           03 lncc_MFR                       PIC X(3) VALUE "MFR".
091000110313           03 lncc_N                         PIC X(1) VALUE "N".
091100110313           03 lncc_O                         PIC X(1) VALUE "O".
091200110313           03 lncc_P                         PIC X(1) VALUE "P".
091300110313           03 lncc_T                         PIC X(1) VALUE "T".
091400110313           03 lncc_TRNPURE                   PIC X(8) VALUE "TRNPURE".
091500110313           03 lncc_TRNPURW                   PIC X(8) VALUE "TRNPURW".
091600110313           03 lncc_TRNREDE                   PIC X(8) VALUE "TRNREDE".
091700110313           03 lncc_TRNREDW                   PIC X(8) VALUE "TRNREDW".
091800110313           03 lncc_TRNMFRE                   PIC X(8) VALUE "TRNMFRE".
091900110313           03 lncc_TRNBADJ                   PIC X(8) VALUE "TRNBADJ".
092000110313           03 lncc_TRNSADJ                   PIC X(8) VALUE "TRNSADJ".
092100110313           03 lncc_W                         PIC X(1) VALUE "W".
092200120227           03 lncc_Y                         PIC X(1) VALUE "Y".
092300120411      *-- RFS97573 - Begins
092400120411           03 lnc_3                         PIC X(1) VALUE "3".
092500120411           03 lnc_I                         PIC X(1) VALUE "I".
092600120411           03 lnc_Buy44                     PIC X(5) VALUE "BUY44".
092700120411           03 lncc_R                        PIC X(1) VALUE "R".
092800120411           03 lncc_S                        PIC X(1) VALUE "S".
092900120227           03 lnc_Buy                       PIC X(3) VALUE "BUY".
093000120420      *-- RFS97573 - Ends
093100120420108404     03  lnc_BUY11                    PIC X(5) VALUE "BUY11".
093200160212108404     03  lnc_BUY12                    PIC X(5) VALUE "BUY12".
093300180215153674     03  lnc_BUY60                    PIC X(5) VALUE "BUY60".
093400180611174735     03  lnc_BUY61                    PIC X(5) VALUE "BUY61".
093500120712178643     03  lnc_BUY62                    PIC X(5) VALUE "BUY62".
093600130104110382     03  lnc_99                       PIC X(2) VALUE "99".
093700130227R98866     03  lnc_SDS                      PIC X(3) VALUE "SDS".
093800210531180952     03  lnc_HLI                      PIC X(5) VALUE "HLI".
093900210531180952     03  lnc_NONHLI                   PIC X(10) VALUE "NONHLI".
094000210531180952     03  lnc_XYZ                      PIC X(5) VALUE "XYZ".
094100130227      *RFS114676 Start.
094200130227           03  lnc_Err_Buy56                PIC X(5) VALUE "BUY56".
094300130326           03  lnc_Err_Buy57                PIC X(5) VALUE "BUY57".
094400130227           03  lnc_Err_Buy58                PIC X(5) VALUE "BUY58".
094500130227           03  lnc_CurrencyCAD              PIC X(3) VALUE "CAD".
094600130321           03  lnc_EFTProgramCd             PIC X(8) VALUE "EFTORDER".
094700130227           03  lnc_EFTPU                    PIC X(5) VALUE "EFTPU".
094800150428      *RFS114676 End.
094900150428      *RFS141445 STARTS
095000150428           03 lc_Screen                     PIC X(8).
095100150428           03 lc_DepLenEdit                 PIC X(2).
095200150428           03 lc_DlrAuthEdit                PIC X(2).
095300150428           03 lc_Zero                       PIC X(2) VALUE "00".
095400150428           03 lc_DelrCode                   PIC X(4).
095500150428           03 lc_RepCode                    PIC X(6).
095600150428           03 lc_InvProv                    PIC X(3).
095700150428           03 li_AccountNum                 PIC X(9).
095800150428           03 lc_InvstmentCode              PIC X(5).
095900150428           03 li_TDate                      PIC 9(8).
096000150428           03 lc_NomineeFlag                PIC X(1).
096100150428           03 lc_AccTypeCode                PIC X(5).
096200150428           03 lc_NomineeCode                PIC X(5).
096300150428           03 lc_AccountDesignation         PIC X(1).
096400150428           03 lc_InvStructureCode           PIC X(5).
096500150428           03 lc_TrnAnnAgeSeverity          PIC X(1).
096600150428           03 lc_ReturnWarnCode             PIC X(2).
096700150428           03 lc_ReturnErrorCode            PIC X(2).
096800150428           03 lc_MsgText                    PIC X(80).
096900150428           03 lc_Editcode                   PIC X(6) VALUE "TRANAG".
097000150428           03 lc_Levelcode                  PIC X(1) VALUE "T".
097100110313      *RFS141445 ENDS
097101210929187471     03  lncc_SETPOL                  PIC X(06) VALUE "SETPOL".
097200110313      ************************************
097300110313      *** Address Module Parameters    ***
097400110313      ************************************
097500110313       01 WS-ADDR-CODE            PIC X(1).
097600110313       01 WS-ADDRESS-INFO.
097700110313          05 WS-ADDR-LINE-1       PIC X(40).
097800110313          05 WS-ADDR-LINE-2       PIC X(40).
097900110313          05 WS-ADDR-LINE-3       PIC X(40).
098000110313          05 WS-CITY              PIC X(30).
098100110313          05 WS-PROV              PIC X(02).
098200110313          05 WS-COUNTRY           PIC X(03).
098300110313          05 WS-POSTAL            PIC X(10).
098400110313          05 WS-ADDR-REC          PIC X(65).
098500110313       01 NFU-ESG-LOG-REC.     COPY DD-ALL-FORMATS OF MFANFULGP.
098600110313       01 WS-ADDRESS-FLAGS.
098700110313          05 WS-NFULGP            PIC X(1).
098800110313          05 WS-IVRDLP            PIC X(1).
098900110313          05 WS-WRITE-ADDRESS     PIC X(1).
099000110313          05 WS-SAME-AS-IVR       PIC X(1).
099100110313       01 WS-ADDR-NO              PIC S9(7) COMP-3.
099200110313       01 WS-TAX-CODES.
099300110313          05 WS-PROV-TAX          PIC X(3).
099400110313          05 WS-COUNTRY-TAX       PIC X(3).
099500110313       01 WS-ADDRESS-COMPARE      PIC X(1).
099600091224      * RFS89055 - Ends
099700091224
099800091224      * -------------------
099900091224      * -- RFS 64263 begins
100000091224      * -------------------
100100091224       01  lc_returnCode                  PIC X(02).
100200091224       01  lc_returnCodeDesc              PIC X(65).
100300091224           88 lcc_returnDescSpaces        VALUE Spaces.
100400091224       01  lnc_OETRNBUY                   PIC X(10) VALUE "OETRNBUY".
100500091224       01  lnc_Err_Buy28                  PIC X(05) VALUE "BUY28".
100600091224      * -------------------
100700091224      * -- RFS 64263 ends
100800101012      * -------------------
100900101012
101000101012      *RFS86061 - Start
101100101012       01 Ws-Err-Code                  PIC X(02) VALUE SPACES.
101200101012          88 Ws-Err-01                           VALUE "01".
101300110322      *RFS86061 - End
101400110322      *Rfs94218 - Start
101500110322       01 lc-Ext-Trans-Det             PIC X(01).
101600180411      *Rfs94218 - End
101700180411      *Rfs178643 - Start
101800180411        01 lc_DivOpt                   PIC X(01).
101900180411           88 lnc_ValidDivOptions      VALUES "1" "4".
102000180411           88 lnc_DivOpt-Reinvest      VALUE "1".
102100180611           88 lnc_DivOpt-Cash          VALUE "4".
102200180611        01  lc_InvestCde               PIC X(05) VALUE SPACES.
102300180411        01  lc_AccountNo               PIC S9(09) VALUE ZEROES.
102400190121      *Rfs178643 - End
102500190121179709   01  lb_ICTWMIN                 PIC X(01).
102600190121179709     88  lb_ICTWMINYes               VALUE "Y".
102700190508179709     88  lb_ICTWMINNo                VALUE "N".
102800190508
102801210914      *RFS1115534 Starts
102802210914        01 lc_ConRedCode             PIC X(06) VALUE SPACES.
102803210914        01 lc-Cont-Redem-Rule        PIC X(02) VALUE SPACES.
102804210914      *RFS1115534 Ends
102805210914
102900190618      *RFS170270 - Start
103000190618        01 WS-TRANS-TYPE-CODE        PIC X(03) VALUE SPACES.
103100190618        01 WS-TRANS-ORIGIN-CODE      PIC X(03) VALUE SPACES.
103200190508        01 WS-SCREEN-CODE            PIC X(10) VALUE SPACES.
103300200407      *RFS170270 - End
103400200407
103500200407      *RFS185170 - Start.
103600200407        01 lc_Mfasegparm.
103700200407          05 FILLER                    PIC X(50).
103800200407          05 lc_AccountLevelGLWB       PIC X(01).
103900200407            88 lb_AccountLevelGLWBYes   VALUE "Y".
104000200407            88 lb_AccountLevelGLWBNo    VALUE "N".
104100200425
104200200407        COPY CPACCGLWBV.
104300200425      *RFS185170 - End.
104400101012
104500101012      *RFS86061 - Start
104600101012           EXEC SQL
104700101012             INCLUDE SQLCA
104800101012           END-EXEC.
104900080630      *RFS86061 - End
105000000000
105100040329       LINKAGE SECTION.
105200060324       PROCEDURE DIVISION.
105300000000
105400040316       MAINLINE.
105500040316           PERFORM INITIAL-LOGIC     THRU INL-EXIT.
105600040316           PERFORM DETAIL-PROCESSING THRU DPR-EXIT.
105700040313           PERFORM END-OF-PROCESSING THRU EOP-EXIT.
105800000000
105900000000           GOBACK.
106000040423      /
106100040423       INITIAL-LOGIC.
106200040423      ***** Initialize level-88 work fields. And any other used fields
106300040423      ***** or records.
106400040427      ****************************************************************
106500040427      * ROUTINE: INITIAL-LOGIC                                       *
106600040423      * PURPOSE: Initialize work fields                              *
106700040423      ****************************************************************
106800040424           INITIALIZE
106900040423                            MFAINVLPP OF INV-LAST-UNIT-PRICE-REC
107000040423      **** External Fields
107100040423                            COMM-SPLIT-OPTION-RULE
107200040423                            COMM-AFTER-CUT-OFF
107300040423      *****Write flags
107400040831                            COMM-WRITE-ACCOUNT-INVESTMENT
107500100517R23467                      COMM-WRITE-ACCOUNT-ATTRIBUTES
107600040423R65695                      COMM-WRITE-TRANS-ADJ-UNIT-COST
107700040423                            COMM-WRITE-TRANS-RESP-DETAILS
107800040423                            COMM-WRITE-TRANS-MISC-DEATILS
107900040423                            COMM-WRITE-TRANS-TARGET
108000110313                            COMM-WRITE-TRANS-LSIF
108100110313R89055                      COMM-WRITE-TRANS-CALLER-INFO
108200110313R89055                      COMM-WRITE-TRANS-CHARGES
108300110313R89055                      COMM-WRITE-TRANS-CDSC-ORIG-DET
108400110313R89055                      COMM-WRITE-TRANS-ERF-PURCHASE
108500110313R89055                      COMM-WRITE-TRANS-EXCHANGE-RATE
108600110313R89055                      COMM-WRITE-TRANS-MFR-GROUP
108700110313R89055                      COMM-WRITE-TRANS-PAY-DETAILS
108800040423R89055                      COMM-WRITE-TRANS-REDEM-DTL
108900040423                            COMM-WRITE-IMAGE-COMMITTED
109000040423                            COMM-WRITE-INVESTMENT-DIS-CHQ
109100120811                            COMM-WRITE-INVESTMENT-DIS-EFT
109200040423R99891                      COMM-WRITE-TRANS-ASSIGN
109300040423      ***Asset Allocations
109400040423                            COMM-HOLDING-FUND-ALLOWED
109500040424                            COMM-UPDATE-MFAACCIAP
109600040423      *  Create new account for master account, will passed acct-setup
109700120811                            COMM-MASTER-ACCOUNT-NO.
109800040423
109900040423           IF NOT OPEN-FILE
110000040423              OPEN INPUT     ACCOUNT-TYPE-RD
110100040423                             INV-CODE-ACCOUNT-TYPE-RD
110200040423                             ACCTYP-CONTRED-CODE-LIMIT-RD
110300040423                             RESP-TYPE-SPECIMEN-PLAN-RD
110400040423                             ACCOUNT-INVESTMENT-RD
110500040423                             ACCOUNT-BENEFICIARY-SPLIT-RD
110600040423                             INV-AUTHORIZATION-CODES-RD
110700080721                             TRANS-CONTR-REDEM-CODE-RD
110800040423R50474                       INVESTMENT-SEG
110900040423             MOVE "N" TO WS-OPEN-FILE
111000190121           END-IF.
111100040423179709     SET lb_ICTWMINNo TO TRUE.
111200040423
111300040423           MOVE ORDER-TYPE OF ESG-OE-DTL-REC TO WS-ORDER-TYPE.
111400040423           MOVE NETWORK-ID OF ESG-OE-DTL-REC TO WS-NETWORK-ID.
111500040423
111600040423           IF TRANS-TYPE-REC OF ESG-OE-DTL-REC = "8"
111700040423              MOVE "I" TO TRANS-TYPE-REC OF ESG-OE-DTL-REC
111800040423           END-IF.
111900040423           MOVE TRANS-TYPE-REC OF ESG-OE-DTL-REC TO WS-TRANS-TYPE-REC.
112000040621           MOVE TRANS-TYPE-DET OF ESG-OE-DTL-REC TO WS-TRANS-TYPE-DET.
112100130227           MOVE ACTION-CODE OF ESG-OE-DTL-REC TO ACTION-CODES.
112200130321114676     MOVE SETTLEMENT-METHOD OF ESG-OE-DTL-REC TO lc_SettleMethod.
112300180312114676     MOVE SETTLEMENT-STATUS OF ESG-OE-DTL-REC TO lc_SettleStatus.
112400060214
112500110313
112600110313R89055     CALL "RTVPRCDTP"  USING PROCESS-DATE-DATA-AREA.
112700100517
112800100517R65695     IF MANAGEMENT-COMPANY-CODE OF ESG-OE-DTL-REC = "GGF"
112900100517R65695        AND DIRECT-ORDER
113000100517R65695        MOVE MANAGEMENT-COMPANY-SPECIFIC OF ESG-OE-DTL-REC
113100100517R65695          TO WS-MANAGEMENT-COMPANY-SPEC-GGF
113200100517R65695     END-IF.
113300200407
113400200407      *RFS185170 - Start.
113500200407           ACCEPT lc_Mfasegparm FROM DATAARA-MFASEGPARM
113600200407                                FOR "MFASEGPARM".
113700200407      *RFS185170 - End.
113800040423
113900040423       INL-EXIT.
114000040423           EXIT.
114100040316      /
114200040329       DETAIL-PROCESSING.
114300040427      *****************************************************************
114400040427      * PURPOSE: This module will process a buy or a commission rebate.
114500040427      *          OETRNBUY would call different modules to achieve
114600040427      *          its objectives. The following are the files that
114700040427      *          maybe updated: The first 3 files are always updated.
114800040427      *          The other files are conditional update.
114900040427      *             1): MFATRNP    - Trans
115000040427      *             2): MFATRNBKP  - Trans-broker-details
115100040427      *             3): MFATRNCMP  - Trans-commission
115200040427      *             4): MFATRNWLP  - Trans-wo-locator
115300040427      *             5): MFATRNTGP  - Trans-target
115400040427      *             6): MFATRNMSCP - Trans-misc-details
115500040427      *             7): MFATRNREP  - Trans-redemption-details
115600040427      *             8): MFATRNTXDP - Trans-sales-tax-details
115700040427      *             9): MFATRNRFP  - Trans-resp-details
115800040427      *            10): MFATLWCP   - Trans-lsif-waive-clawback
115900040427      *            11): MFATRNBP   - Trans-pay-to-bank
116000040427      *            12): MFATRNCP   - Trans-pay-to-cheque
116100040427      *            13): IMGCODEFP  - Image-committed-definition
116200040427      *            14): MFAACCIVP  - Account-investment
116300040427      *            15): MFADISCQP  - Investment-distrib-cheque
116400040427      *            16): MFADISEFP  - Investment-distrib-eft
116500040427      *            17): MFAADDP    - Address
116600040329      *            18): MFAIVRBKP  - Investor-bank-acct
116700040423      *****************************************************************
116800040423           INITIALIZE
116900040423             MFATRNP    OF  TRANS-REC
117000040424             MFATRNCMP  OF  TRANS-COMMISSION-REC
117100040423             MFATRNBKP  OF  TRANS-BROKER-DETAILS-REC.
117200040329
117300040329      *****Set Contribution for commission rebates
117400040329           IF COMMISSION-REBATES
117500040329              MOVE "C" TO CONTRIB-REDEM-CODE OF ESG-OE-DTL-REC
117600040329           END-IF.
117700040324
117800040323           MOVE ZEROES TO WS-FUND-ACCOUNT-NO.
117900040323           MOVE ACCOUNT-DESIGNATION OF ESG-OE-DTL-REC
118000040320                TO WS-ACCOUNT-DESINATION.
118100040323
118200040324           IF FUND-ACCOUNT-NO OF ESG-OE-DTL-REC NOT = SPACES AND 0
118300040324              MOVE FUND-ACCOUNT-NO OF ESG-OE-DTL-REC TO
118400040320                   WS-FUND-ACCOUNT-NO
118500040323           END-IF.
118600040506
118700040506           IF WS-FUND-ACCOUNT-NO(1:9) IS NOT NUMERIC
118800040408              MOVE ERR-INVALID-ACCOUNT TO COMM-RETURN-DESC
118900040326              MOVE "BUY01" TO COMM-ERROR-PTR
119000040326              PERFORM ESG-REJECTION THRU ERJ-EXIT
119100040321              GO TO DPR-EXIT
119200040330           END-IF.
119300040318
119400040318       DPR-TRANS-TYPE.
119500110322      *****Get Unitrax transaction type.
119600110322      *Rfs94218 - Start
119700110322           MOVE Trans-Type-Det OF Esg-Oe-Dtl-Rec TO lc-Ext-Trans-Det.
119800180215           IF In-Cash-Transfer OR Commission-Rebates
119900110322174735     OR PAC-PURCHASE
120000110322              MOVE SPACES TO lc-Ext-Trans-Det
120100110322           END-IF.
120200040320      *Rfs94218 - End
120300040321           INITIALIZE COMM-TRN-PARMS.
120400040408           MOVE "U" TO COMM-GET-TRANS-TYPE.
120500110313           STRING TRANS-TYPE-REC OF ESG-OE-DTL-REC DELIMITED BY SIZE
120600110322R89055************WS-EXTERNAL-TRANS-DET DELIMITED BY SPACE
120700110313R94218            lc-Ext-Trans-Det                    DELIMITED BY SIZE
120800040408R89055            PRODUCT-INDICATOR OF ESG-OE-DTL-REC DELIMITED BY SIZE
120900040408             INTO COMM-EXTERNAL-TRANS-TYPE
121000040422           END-STRING.
121100040422
121200040330           CALL "FXTRNCODE" USING COMM-TRN-PARMS.
121300040326           IF FX-RETURN-CODE = "99"
121400040408              MOVE ERR-INV-TXN-TY-DT TO COMM-RETURN-DESC
121500040324              MOVE "BUY02" TO COMM-ERROR-PTR
121600040318              PERFORM ESG-REJECTION THRU ERJ-EXIT
121700040318              GO TO DPR-EXIT
121800040326           END-IF.
121900040408
122000040326           MOVE COMM-UNITRAX-TRANS-TYPE TO
122100040326                TRANS-TYPE-CODE OF TRANS-REC.
122200040331           MOVE COMM-TRANS-SEQ-NO TO TRANS-SEQ-NO OF TRANS-REC.
122300040331
122400040331       DPR-INVESTMENT.
122500040427      *****Get Investment Information.
122600040331           CALL "OEVALFUND".
122700040331           IF COMM-RETURN-CODE = "99"
122800040331              GO TO DPR-EXIT
122900040331           END-IF.
123000040331
123100040331      *****Note delete later for two sided transaction this would be
123200040331      ***** the from trade date and saved for comparison
123300040331       DPR-TRADE-DATE.
123400040427      *****Get Trade and Settlement date.
123500040331           CALL "OEORDDATES".
123600040331           IF COMM-RETURN-CODE = "99"
123700040331              GO TO DPR-EXIT
123800090318           END-IF.
123900040331
124000040331       DRP-ACTION-CANCEL.
124100040621      *****Cancel Previous order
124200040505           IF ACTION-CANCEL
124300040505              CALL "OECANCEL"
124400040505              GO TO DPR-EXIT
124500090318           END-IF.
124600040331
124700040331       DRP-ACTION-CHANGE.
124800090319      *****Change prevoius order
124900090319           IF ACTION-CHANGE AND
125000040505R60350        NOT In-Cash-Transfer
125100040505              CALL "OECANCEL"
125200040505              IF COMM-RETURN-CODE = "99"
125300040505                 GO TO DPR-EXIT
125400040505              END-IF
125500040331           END-IF.
125600040331
125700040331       DPR-DUPLICATE-SOURCE-NO.
125800110313      *****Check Duplicate Source number.
125900110313      *Rfs89055 - Start
126000110313      *    IF WIRE-ORDER AND
126100110313           IF Comm-Esb-Process = "Y"
126200110313           OR (WIRE-ORDER AND
126300110313R60350        NOT In-Cash-Transfer)
126400090318      *Rfs89055 - End
126500041006              CALL "OEDUPORD"
126600041007              IF COMM-RETURN-CODE = "99"   OR
126700040331R24610           COMM-DUPLICATE-ORDER = "Y"
126800040331                 GO TO DPR-EXIT
126900040331              END-IF
127000130227           END-IF.
127100130328      *RFS114676 Start.
127200130328           IF ( (COPY-BNKINFO of ESG-OE-FIN-15-REC = lnc_Y
127300130328                 AND Bank-No OF Esg-Oe-Dtl-Rec NOT= SPACES
127400130328                 AND Bank-Transit-No OF Esg-Oe-Dtl-Rec NOT= SPACES
127500130328                 AND Bank-Account-No OF Esg-Oe-Dtl-Rec NOT= SPACES
127600130328                )
127700130328           OR   (Bank-No of ESG-OE-FIN-15-REC NOT  = SPACES
127800130328                 AND Bank-Transit-No OF ESG-OE-FIN-15-REC NOT = SPACES
127900130328                 AND Bank-Account-No OF ESG-OE-FIN-15-REC NOT = SPACES
128000130328              ) )
128100130328           AND (NOT CLIENT-ACCOUNT OR NOT lnc_Individual OR not lnc_EFT)
128200130328
128300130328              MOVE lc-EFTSettleNotSupp-261 TO COMM-RETURN-DESC
128400130328              MOVE lnc_Err_Buy56           TO COMM-ERROR-PTR
128500130328              PERFORM ESG-REJECTION THRU ERJ-EXIT
128600130328              GO TO DPR-EXIT
128700130321           END-IF.
128800130227           IF CLIENT-ACCOUNT AND lnc_Individual AND lnc_EFT
128900130227              PERFORM ValidateEFTSettlement THRU EFS-EXIT
129000130227              IF COMM-RETURN-CODE = "99"
129100130227                 GO TO DPR-EXIT
129200130227              END-IF
129300130227              MOVE lnc_Y  to COMM-BUY-EFT-SETTLE
129400130227           END-IF.
129500040331      *RFS114676 End.
129600040323       DPR-GET-TRANS-NO.
129700040320     **** Get a new Trans No
129800040427           MOVE ZEROES TO PARM-CONTROL-NUM.
129900040320           CALL "GETCTLNUM" USING  PARM-CONTROL-CODE,
130000040320                                   PARM-CONTROL-NUM,
130100040320                                   PARM-RETURN-CODE.
130200040320
130300040326           IF PARM-RETURN-CODE = "99"
130400040408              MOVE ERR-DBASE-NOT-AVAILAB TO COMM-RETURN-DESC
130500040324              MOVE "BUY03" TO COMM-ERROR-PTR
130600040320              PERFORM ESG-REJECTION THRU ERJ-EXIT
130700040320              GO TO DPR-EXIT
130800040320           END-IF.
130900040405
131000040405           MOVE PARM-CONTROL-NUM TO
131100040405                                 TRANS-NO OF TRANS-REC
131200040405                                 TRANS-NO OF TRANS-BROKER-DETAILS-REC
131300040328                                 TRANS-NO OF TRANS-COMMISSION-REC.
131400040328           MOVE COMM-SYSDATE TO
131500040328                             PLACEMENT-DATE OF TRANS-REC
131600040329                             PLACEMENT-DATE OF TRANS-BROKER-DETAILS-REC
131700040320                             PLACEMENT-DATE OF TRANS-COMMISSION-REC.
131800040320
131900040319      *****AOT and REV are allowed on Buy and Sell only
132000040323           IF ACTION-REV-AOT
132100040326              IF NOT BUY-TRANSACTION
132200040408                 MOVE ERR-INV-TXN-TY-DT TO COMM-RETURN-DESC
132300040324                 MOVE "BUY04" TO COMM-ERROR-PTR
132400040319                 PERFORM ESG-REJECTION THRU ERJ-EXIT
132500040319                 GO TO DPR-EXIT
132600040319              END-IF
132700040319           END-IF.
132800040320
132900040319      *****Nominee trades can not have certificate
133000040321           IF (PURCHASE-TRANSACTION AND NOT CLIENT-ACCOUNT)
133100040326              IF (CERT-CODE OF ESG-OE-DTL-REC NOT = "N" AND SPACES)
133200040422                 MOVE ERR-INVALID-CERT-IND TO COMM-RETURN-DESC
133300040324                 MOVE "BUY05" TO COMM-ERROR-PTR
133400040319                 PERFORM ESG-REJECTION THRU ERJ-EXIT
133500040319                 GO TO DPR-EXIT
133600040319              END-IF
133700040320           END-IF.
133800040321
133900040320           IF WIRE-ORDER
134000040320             MOVE "WOR"       TO TRANS-ORIGIN-CODE OF TRANS-REC
134100040320             MOVE "UNC"       TO TRANS-STATUS-CODE OF TRANS-REC
134200040320             MOVE "N"         TO SETTLED-GROSS-OR-NET OF TRANS-REC
134300040320             MOVE "N"         TO ORIGINAL-DOCUMENTS-RECVD OF TRANS-REC
134400040320             MOVE "Y"         TO WIRE-ORDER-FLAG OF TRANS-REC
134500040320           ELSE
134600040320             MOVE "DIR"       TO TRANS-ORIGIN-CODE OF TRANS-REC
134700040320             MOVE "PND"       TO TRANS-STATUS-CODE OF TRANS-REC
134800040320             MOVE "Y"         TO SETTLED-GROSS-OR-NET OF TRANS-REC
134900040320             MOVE "Y"         TO ORIGINAL-DOCUMENTS-RECVD OF TRANS-REC
135000040320             MOVE "N"         TO WIRE-ORDER-FLAG OF TRANS-REC
135100080825           END-IF
135200080825
135300080825      *R53706 - Begin
135400080825           IF ITRX-ORDER
135500080825              MOVE "ITX"      TO TRANS-ORIGIN-CODE OF TRANS-REC
135600080825           END-IF.
135700040320      *R53706 - End
135800040320
135900040320           MOVE "00"          TO REJECTION-CODE OF TRANS-REC.
136000040320           MOVE "N"           TO HIDDEN-TRANS OF TRANS-REC.
136100040320           MOVE "N"           TO RECEIPTED OF TRANS-REC.
136200040320           MOVE "N"           TO REVERSE OF TRANS-REC.
136300040320           MOVE "N"           TO ADJUST OF TRANS-REC.
136400040422
136500040422           MOVE COMM-SYSTIME(1:4) TO TIME-PLACED  OF TRANS-REC
136600040328                                     CHANGED-TIME OF TRANS-REC.
136700040329           MOVE COMM-SYSDATE TO CHANGED-DATE OF TRANS-REC.
136800050406           MOVE CLERK-ID OF ESG-OE-DTL-REC TO ENTERED-BY OF TRANS-REC.
136900050406R25997     IF  SUPPRESS-CONFIRMATION OF ESG-OE-DTL-REC = "Y"
137000050406R25997         MOVE SUPPRESS-CONFIRMATION OF ESG-OE-DTL-REC
137100050406R25997                  TO SUPPRESS-CONFIRMATION OF TRANS-REC
137200050406R25997     ELSE
137300050406R25997         MOVE "N" TO SUPPRESS-CONFIRMATION OF TRANS-REC
137400130104R25997     END-IF.
137500130104      *Rfs116697- Start
137600130104      *    -- Supp. Stmt.
137700130104           IF HIDDEN-TRANS OF ESG-OE-DTL-REC = "Y"
137800130104              MOVE HIDDEN-TRANS OF ESG-OE-DTL-REC TO
137900130104                   HIDDEN-TRANS OF TRANS-REC
138000130104           END-IF.
138100040331      *Rfs116697- Start
138200040331           MOVE SOURCE-NUMBER-2 OF ESG-OE-DTL-REC TO
138300050413                SOURCE-TRANS-NO OF TRANS-BROKER-DETAILS-REC.
138400050413R23973     IF  ACTION-AS-OF-TRANS  AND
138500050413  ¦            ORIGINAL-ORDER-IDENTIFIER OF ESG-OE-DTL-REC NOT = " "
138600050413  ¦            MOVE ORIGINAL-ORDER-IDENTIFIER  OF ESG-OE-DTL-REC  TO
138700050413  ¦            ORIGINATOR-TRANS-NO OF TRANS-BROKER-DETAILS-REC
138800050413R23973     ELSE
138900050413           MOVE ORIGINATED-NETWORK-ID OF ESG-OE-DTL-REC TO
139000040427                ORIGINATOR-TRANS-NO OF TRANS-BROKER-DETAILS-REC
139100050413
139200180215R23973     END-IF.
139300180215      * RFS 174735 - Start
139400180215           IF  ACTION-AS-OF-TRANS
139500180215           AND DIL-LINK-ID OF ESG-OE-DTL-REC NOT= SPACES
139600180215               MOVE DIL-LINK-ID OF ESG-OE-DTL-REC  TO
139700180215                    DILUTION-LINK-ID OF TRANS-BROKER-DETAILS-REC
139800180215               MOVE DIL-NUM     OF ESG-OE-DTL-REC  TO
139900180215                    MULTI-LINE-RECORD OF TRANS-BROKER-DETAILS-REC
140000180215               MOVE DIL-TOT-NUM OF ESG-OE-DTL-REC  TO
140100180218                    MULTI-LINE-TOTAL OF TRANS-BROKER-DETAILS-REC
140200180220               MOVE "50" TO RETURN-CODE-DDS
140300180218                                     OF TRANS-BROKER-DETAILS-REC
140400180215
140500180220           END-IF.
140600180314           IF  ACTION-AS-OF-TRANS
140700180314           AND DIL-LINK-ID OF ESG-OE-DTL-REC NOT= SPACES
140800180314           AND PROGRAM-CODE OF ESG-OE-DTL-REC = SPACES
140900180220               MOVE "F5X" TO REJECTION-CODE OF TRANS-REC
141000180314           END-IF.
141100180314
141200180314           IF  ACTION-AS-OF-TRANS
141300180314               MOVE "WAOT" TO REVERSAL-CODE OF TRANS-REC
141400180215           END-IF.
141500090225      * RFS 174735 - End
141600090225
141700090225      *** RFS60350 - Begin
141800090225           MOVE Comm-Other-Management-Code
141900090225             TO Other-Management-Code   OF Trans-Broker-Details-Rec.
142000090225           MOVE Comm-Other-Fund-Account-No
142100090225             TO Other-Fund-Account-No   OF Trans-Broker-Details-Rec.
142200090225           MOVE Comm-Other-Dealer-Account-No
142300090225             TO Other-Dealer-Account-No OF Trans-Broker-Details-Rec.
142400090622      *** RFS60350 - End
142500090731      *** R68916 - Begins
142600090731           IF In-Cash-Transfer
142700090731              MOVE Comm-Orig-Doc-Recvd  TO
142800090731                   Original-Documents-Recvd OF Trans-Rec
142900090622           END-IF.
143000090225      *** R68916 - Ends
143100040331
143200040331           MOVE SETTLEMENT-METHOD OF ESG-OE-DTL-REC TO
143300040320                SETTLEMENT-METHOD OF TRANS-BROKER-DETAILS-REC.
143400040331
143500040331           MOVE TRANS-TYPE-DET OF ESG-OE-DTL-REC TO
143600040420                TRANS-TYPE-DET OF TRANS-BROKER-DETAILS-REC.
143700040420           MOVE TRANS-TYPE-REC OF ESG-OE-DTL-REC TO
143800040427                TRANS-TYPE-REC OF TRANS-BROKER-DETAILS-REC.
143900040427           MOVE ACTION-CODE OF ESG-OE-DTL-REC TO
144000040405                ACTION-CODE OF TRANS-BROKER-DETAILS-REC
144100040321           MOVE INDUSTRY-FUND-CODE OF ESG-OE-DTL-REC TO
144200040316                PLACED-AS-FUND-CODE OF TRANS-BROKER-DETAILS-REC.
144300040331
144400040331           MOVE SETTLEMENT-SOURCE OF ESG-OE-DTL-REC TO
144500040331                SETTLEMENT-SOURCE OF TRANS-BROKER-DETAILS-REC.
144600040331           MOVE ORDER-SOURCE OF ESG-OE-DTL-REC TO
144700040328                ORDER-SOURCE OF TRANS-BROKER-DETAILS-REC.
144800040328           IF (MANAGEMENT-COMPANY-CODE
144900040328                OF ESG-OE-DTL-REC IS = "DJT" OR "MAE" OR "NWT")
145000040328           AND DIRECT-ORDER
145100040328              MOVE "X" TO ORDER-SOURCE OF TRANS-BROKER-DETAILS-REC
145200040331           END-IF.
145300040331           MOVE TRANS-REVISION-NO OF ESG-OE-DTL-REC TO
145400040331                TRANS-REVISION-NO OF TRANS-BROKER-DETAILS-REC.
145500040331           MOVE COMM-SYSDATE TO
145600040413                LOG-PROCESS-DATE OF TRANS-BROKER-DETAILS-REC.
145700040331           MOVE COMM-OE-OER-LINK TO
145800040321                OE-OER-LINK OF TRANS-BROKER-DETAILS-REC.
145900040321           MOVE NETWORK-ORDER-NO OF ESG-OE-DTL-REC TO
146000040320                WIRE-ORDER-NO OF TRANS-REC.
146100060214
146200060215      *RFS29617 - Start
146300060215           MOVE Dilution-Source OF Esg-Oe-Dtl-Rec TO
146400060214                Dilution-Source OF Trans-Broker-Details-Rec.
146500130227      *RFS29617 - End
146600130227      *RFS114676 Start.
146700130227           IF COMM-BUY-EFT-SETTLE = lncc_Y
146800130227              MOVE lnc_EFTProgramCd TO
146900130227                   PROGRAM-CODE  OF TRANS-BROKER-DETAILS-REC
147000130227           END-IF.
147100120802      *RFS114676 End.
147200120817      *RFS99891 - Start
147300130808           IF COMM-ESB-PROCESS = lnc_Y
147400130808124176*       MOVE NETWORK-ID OF Esg-Oe-Dtl-Rec   TO
147500120802124176*            NETWORK-ID OF Trans-Broker-Details-Rec
147600120802              MOVE NETWORK-ID OF Esg-Oe-Dtl-Rec   TO
147700120813                   USER-ID OF Trans-Broker-Details-Rec
147800120813              MOVE USER-ID OF ESG-OE-CLT-REC TO
147900120817                           ENTERED-BY OF TRANS-REC
148000120918              IF ASSIGNMENT-TYPE  OF ESG-OE-CLT-REC NOT = SPACES
148100120918                 PERFORM DPR-TRANS-ASSIGN THRU DTA-EXIT
148200120918                 IF COMM-RETURN-CODE = "99"
148300120918                    GO TO DPR-EXIT
148400120803                 END-IF
148500120802              END-IF
148600120802           END-IF.
148700130808      *RFS99891 - End
148800130808      *RFS124176 - Start
148900130808           MOVE NETWORK-ID OF Esg-Oe-Dtl-Rec   TO
149000180215                NETWORK-ID OF Trans-Broker-Details-Rec
149100130808                .
149200060214      *RFS124176 - End
149300040326
149400040326       DPR-DEALER-AND-REP.
149500040427      *****Get Dealer and Rep Information
149600040324           CALL "OEDLRREP".
149700040318           IF COMM-RETURN-CODE = "99"
149800040318              GO TO DPR-EXIT
149900040327           END-IF.
150000150413
150100150413      *RFS135598 - Start.
150200150413           IF Comm-Esb-Process = lncc-Y
150300150413              AND Gross-Amt OF BLK-Acct-Contr-Annu-ExtRec > 0
150400150413              GO TO DPR-ACCOUNT-INFO
150500150413           END-IF.
150600150413      *RFS135598 - End.
150700040326
150800040326       DPR-MASTER-ACCOUNT.
150900040326      *****Check Master Account Or Account Seperator.
151000040326           MOVE "N" TO WS-CREATE-NEW-ACCT.
151100040326           MOVE MASTER-ACCT-PROCESS OF DEALER-MISC-DETAILS-REC TO
151200040809                MASTER-DEALER-PROCESS.
151300040809R23255**** Start
151400040809      ****Allow MasterAcct for all account types
151500040809           MOVE COMM-MASTER-ACCOUNT TO WS-MODULE-MASTER-ACC.
151600040329R23255**** End
151700040329           IF ((COMM-ACCOUNT-SEPARATOR NOT = "N") OR
151800040329                   (COMM-MASTER-ACCOUNT = "Y"))
151900040326              PERFORM CHECK-MASTER-ACCOUNTS THRU CMA-EXIT
152000040326              IF COMM-RETURN-CODE = "99"
152100040326                 GO TO DPR-EXIT
152200040326              END-IF
152300040326           END-IF.
152400040326
152500040326       DPR-CREATE-NEW-ACCOUNT.
152600040326      *****Create new Account.
152700040427           IF MASTER-ACCOUNT-CREATE
152800040326              CALL "ESGACCCRT"
152900040326              IF COMM-RETURN-CODE = "99"
153000040326                 GO TO DPR-EXIT
153100040326              END-IF
153200040329           END-IF.
153300040326
153400040326       DPR-ACCOUNT-INFO.
153500040427      *****Get Account Information.
153600040326           CALL "OEACCTINF".
153700040326           IF COMM-RETURN-CODE = "99"
153800040326              GO TO DPR-EXIT
153900040326           END-IF.
154000040331
154100040331       DPR-DEALER-AUTHORITY.
154200180425      ***** Check dealer authority of the fund.
154300180425      *RFS177667 starts
154400180425      *    CALL "OEDLRAUTH".
154500180425      *    IF COMM-RETURN-CODE = "99"
154600180425      *       GO DPR-EXIT
154700180425      *    END-IF.
154800180425      ***** Check dealer/Rep authority of the fund.
154900180425
155000180425           MOVE Dealer-Code     OF Trans-Rec TO WS-DEALER-CODE.
155100180425           MOVE Dealer-Rep-Code OF Trans-Rec TO WS-DEAREP-CODE.
155200180425           MOVE INVESTMENT-CODE OF TRANS-REC TO WS-INVEST-CODE.
155300190508           MOVE lncc-ESGORDER                TO WS-PGM-CODE.
155400190508      *RFS170270 - Start
155500190508           MOVE Trans-Type-Code    OF Trans-Rec
155600190508                                        TO WS-TRANS-TYPE-CODE.
155700190508           MOVE TRANS-ORIGIN-CODE  OF TRANS-REC
155800190618                                        TO WS-TRANS-ORIGIN-CODE.
155900190618           IF WS-TRANS-ORIGIN-CODE = "DIR"
156000190618              MOVE lncc-Screenname02  TO  WS-SCREEN-CODE
156100190618           ELSE
156200190618              MOVE lncc-Screenname01  TO  WS-SCREEN-CODE
156300190508           END-IF.
156400180425      *RFS170270 - End.
156500180507
156600180425           CALL "FXDLRREPAT"  USING WS-DEALER-CODE
156700180425                                   WS-DEAREP-CODE
156800180425                                   WS-INVEST-CODE
156900190508                                   WS-PGM-CODE
157000190618      *RFS170270 - Start
157100190508                                   WS-SCREEN-CODE
157200190508                                   WS-TRANS-TYPE-CODE
157300190508                                   WS-TRANS-ORIGIN-CODE
157400180425      *RFS170270 - End.
157500190808                                   WS-RETURN-CODE.
157600190808      *RFS1016582 - Starts
157700190808      *    IF WS-RETURN-CODE = "01" OR "02"
157800190808      *       MOVE ERR-INVALID-FUND TO COMM-RETURN-DESC
157900190808      *       MOVE "BUY62" TO COMM-ERROR-PTR
158000190808      *       PERFORM ESG-REJECTION THRU ERJ-EXIT
158100190808      *       GO TO DPR-EXIT
158200190808      *    END-IF.
158300180425           IF WS-RETURN-CODE = "01"
158400180425              MOVE ERR-INVALID-FUND TO COMM-RETURN-DESC
158500180425              MOVE "BUY62" TO COMM-ERROR-PTR
158600180425              PERFORM ESG-REJECTION THRU ERJ-EXIT
158700180425              GO TO DPR-EXIT
158800190808           END-IF.
158900190808
159000190808           IF WS-RETURN-CODE = "02"
159100190808              MOVE lnc_ERR-INVALID-MSG-SEQ TO COMM-RETURN-DESC
159200190808              MOVE "BUY63" TO COMM-ERROR-PTR
159300190808              PERFORM ESG-REJECTION THRU ERJ-EXIT
159400190808              GO TO DPR-EXIT
159500190808           END-IF.
159600190808      *RFS1016582 - Ends
159700180425
159800180425      *RFS177667 Ends
159900040331
160000040331
160100040331       DPR-DLR-NOM-AND-SETTLEMENT.
160200040427      ***** Process Dealer Settlement Method.
160300040331           CALL "OESETMET".
160400040331           IF COMM-RETURN-CODE = "99"
160500040331              GO DPR-EXIT
160600040331           END-IF.
160700040622
160800040622       DRP-ACTION-REV-AOT.
160900040622      *****Reversals and As Of transactions
161000040622           IF ACTION-AS-OF-TRANS
161100040622              CALL "OEREVAOT"
161200040622              IF COMM-RETURN-CODE = "99"
161300040622                 GO TO DPR-EXIT
161400040622              END-IF
161500040622           END-IF.
161600040331
161700040331       DPR-ACCOUNT-INVESTMENT.
161800040331      *****Do account investment process
161900040331      *****If new investmnet set distribution options
162000040331           PERFORM GET-ACCOUNT-INVESTMENT THRU CAI-EXIT.
162100040331           IF COMM-RETURN-CODE = "99"
162200040331              GO TO DPR-EXIT
162300040331           END-IF.
162400040331
162500040328
162600040328       DPR-JURISDICTIONS.
162700040330      *****Call Jurisdiction module to check investor and LSIF juris.
162800040427      *****So, it has to after account information is retrieved.
162900040328           CALL "OEINVJURP".
163000040328           IF COMM-RETURN-CODE  = "99"
163100040328              GO TO DPR-EXIT
163200040328           END-IF.
163300040330
163400040330           PERFORM VALIDATE-INVEST-ACCOUNT-TYPE THRU VIAT-EXIT.
163500040330           IF COMM-RETURN-CODE = "99"
163600040330              GO TO DPR-EXIT
163700040330           END-IF.
163800040421
163900040421           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC TO
164000040421                                        WS-ACCOUNT-TYPE-CODE.
164100040327           MOVE WS-ACCOUNT-TYPE-CODE TO
164200040326                ACCOUNT-TYPE-CODE OF ACCOUNT-TYPE-RD-REC.
164300040330           PERFORM GET-ACCOUNT-TYPE-RULE THRU GATR-EXIT.
164400040330           IF COMM-RETURN-CODE = "99"
164500040330              GO TO DPR-EXIT
164600040328           END-IF.
164700040328           MOVE ACCOUNT-TYPE-RULE OF ACCOUNT-TYPE-RD-REC  TO
164800040326                                     WS-ACCOUNT-TYPE-RULE.
164900040328
165000040328           IF RESP-ACCOUNT
165100040326              PERFORM PROCESS-RESP-SPECIFICS THRU PRS-EXIT
165200040320              IF COMM-RETURN-CODE = "99"
165300040319                 GO TO DPR-EXIT
165400040319              END-IF
165500040321           END-IF.
165600040318
165700040320       DPR-CONTRIBUTIONS.
165800040427      *****Get Contribution Codes/Period setup
165900040328           CALL "OECRCODE".
166000040318           IF COMM-RETURN-CODE  = "99"
166100040318              GO TO DPR-EXIT
166200040331           END-IF.
166300040331           IF MANAGEMENT-COMPANY-CODE OF ESG-OE-DTL-REC = "GCM"
166400040331           AND DIRECT-ORDER
166500040331              PERFORM PROCESS-GCM-SPECIFIC THRU PGS-EXIT
166600040331              IF COMM-RETURN-CODE  = "99"
166700040331                  GO TO DPR-EXIT
166800040329              END-IF
166900040320           END-IF.
167000100517
167100100517R65695     PERFORM PROCESS-GGF-ACB THRU PGA-EXIT.
167200040330
167300040330       DPR-SEG-FUND-SPECIFIC.
167400040330      ****Validate seg fund specifics.
167500040330           IF PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC = "6"
167600040330              PERFORM VALIDATE-SEG-FUND THRU VSF-EXIT
167700040330              IF COMM-RETURN-CODE  = "99"
167800040330                 GO TO DPR-EXIT
167900040330              END-IF
168000091224           END-IF.
168100091224
168200091224      *----------------------
168300091224      *-- RFS 64263 begins --
168400091224      *----------------------
168500091224R64263 DPR-Validate-Investment-Group.
168600091224  |        MOVE spaces TO lc_returnCodeDesc.
168700091224  |        CALL "FXACINVG" using lnc_OETRNBUY
168800091224  |                              account-no of Trans-Rec
168900091224  |                              investment-code of Trans-Rec
169000091224  |                              lc_returnCodeDesc
169100091224  |                              lc_returnCode.
169200091224  |        IF not lcc_returnDescSpaces
169300091224  |           MOVE err-not-eligiable-plan  TO COMM-RETURN-DESC
169400091224  |           MOVE lnc_err_buy28 TO COMM-ERROR-PTR
169500091224  |           PERFORM ESG-REJECTION THRU ERJ-EXIT
169600091224  |           GO TO DPR-EXIT
169700091224R64263     END-IF.
169800091224      *----------------------
169900091224      *-- RFS 64263 ends   --
170000040824      *----------------------
170100040824
170200040824R23467 DPR-PHANTOM-FUND-SPECIFIC.
170300040824   |  ****Validate phantom fund specifics.
170400040824   |       IF PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC = "3"
170500040824   |          PERFORM VALIDATE-PHANTOM-FUND THRU VPF-EXIT
170600040824   |          IF COMM-RETURN-CODE  = "99"
170700040824   |             GO TO DPR-EXIT
170800040824   |          END-IF
170900040330R23467     END-IF.
171000040320
171100040320       DPR-AMOUNT-AND-TYPE.
171200040427      *****Get amount and amount type
171300040328           CALL "OEAMTTYPE".
171400040320           IF COMM-RETURN-CODE  = "99"
171500040320              GO TO DPR-EXIT
171600090923           END-IF.
171700090923R54431*Begins - Validate RDSP purchase request
171800090923           IF RDSP-ACCOUNT
171900090923             MOVE ACCOUNT-NO OF ACCOUNT-REC
172000090923               TO pi_RDSPCHKAccountNo
172100090923             MOVE GROSS-AMT OF TRANS-REC
172200090923               TO pi_RDSPCHKTransactionAmt
172300090923             MOVE TRADE-DATE OF TRANS-REC
172400090923               TO pi_RDSPCHKTransactionDate
172500100517             SET pb_RDSPCHKInteractive TO TRUE
172501210914      *RFS1115534 Starts
172502210914R68035*      MOVE "1" TO pc_RDSPCHKContrRule
172503210914             PERFORM GetRedemptionRule
172504210914      *RFS1115534 Ends
172700130104             MOVE "00"     to pc_RDSPCHKReturnCode
172800130104      *RFS98866 - Start
172900130104             MOVE ZERO TO Pi_RDSPCHKSDSPDAPTaxableAmt
173000140704                          Pi_RDSPCHKSDSPDAPTaxableMax
173100130104127070                    Pi_RDSPCHKSDSPTaxablePortion
173200130104             MOVE SPACES TO Pc_RDSPCHKSDSPFlag
173300090923      *RFS98866 - End
173400090923             CALL "FXRDSPCHK" USING
173500090923                  pi_RDSPCHKAccountNo
173600090923                  pi_RDSPCHKTransactionAmt
173700090923                  pi_RDSPCHKTransactionDate
173800100517                  pc_RDSPCHKMode
173900090923R68035            pc_RDSPCHKContrRule
174000090923                  pc_RDSPCHKAgeLimit
174100090923                  pc_RDSPCHKResidency
174200090923                  pc_RDSPCHKContrLimit
174300100517                  pc_RDSPCHKReturnCode
174400100517R68035            pc_RDSPCHKErrorCode
174500100517  |               pc_RDSPCHKErrorType
174600130104R68035            pc_RDSPCHKErrorMessage
174700130104R98866            pi_RDSPCHKSDSPDAPTaxableAmt
174800130104  |               pi_RDSPCHKSDSPDAPTaxableMax
174900140704R98866            pc_RDSPCHKSDSPFlag
175000130104127070            pi_RDSPCHKSDSPTaxablePortion
175100090923
175101210914115534      IF pc_RDSPCHKErrorCode    NOT = "000" AND
175102210914115534         pc_RDSPCHKErrorMessage NOT = SPACES
175200090923             IF pb_RDSPCHKAgeLimitFail
175300090923               MOVE Err-BenefExceedAgeLTD-408 TO COMM-RETURN-DESC
175400090923               MOVE "BUY25" TO COMM-ERROR-PTR
175500090923               PERFORM ESG-REJECTION THRU ERJ-EXIT
175600090923               GO TO DPR-EXIT
175700090923             END-IF
175800090923             IF pb_RDSPCHKResidencyFail
175900090923               MOVE ERR-XML-INV-CNTRY-BENE TO COMM-RETURN-DESC
176000090923               MOVE "BUY26" TO COMM-ERROR-PTR
176100090923               PERFORM ESG-REJECTION THRU ERJ-EXIT
176200090923               GO TO DPR-EXIT
176300090923             END-IF
176400090923             IF pb_RDSPCHKContrLimitFail
176500090923               MOVE ERR-AMT-EXD-LIMIT TO COMM-RETURN-DESC
176600090923               MOVE "BUY27" TO COMM-ERROR-PTR
176700090923               PERFORM ESG-REJECTION THRU ERJ-EXIT
176800090923               GO TO DPR-EXIT
176900110211             END-IF
17700011021185040        IF pc_RDSPCHKErrorCode = "DSB"
177100110211  |            MOVE ERR-INVALID-TDATE TO COMM-RETURN-DESC
177200110211  |            MOVE "BUY28" TO COMM-ERROR-PTR
177300110211  |            PERFORM ESG-REJECTION THRU ERJ-EXIT
177400110211  |            GO TO DPR-EXIT
17750013010485040        END-IF
177600130104      *RFS98866 - Start
177700130104             IF pc_RDSPCHKErrorCode =  lnc_SDS
177800130104                MOVE ERR-NOT-ELIGIABLE-PLAN TO COMM-RETURN-DESC
177900130104                MOVE "BUY53" TO COMM-ERROR-PTR
178000130104                PERFORM ESG-REJECTION THRU ERJ-EXIT
178100130104                GO TO DPR-EXIT
178200130104             END-IF
178201210914115534     END-IF
178300090923      *RFS98866- End
178400090923           END-IF.
178500040320R54431*Ends
178600110313
178700110313      * RFS89055 - Begins
178800110313       DPR-VALIDATE-MFR.
178900110313      ****Validate MFR transaction
179000110313           IF TRANS-TYPE-CODE OF TRANS-REC = lncc_MFR
179100110313              PERFORM VALIDATE-MFR-TRANSACTIONS  THRU VMT-EXIT
179200110313              IF COMM-RETURN-CODE  = "99"
179300110313                 GO TO DPR-EXIT
179400110313              END-IF
179500110313           END-IF.
179600110313      * RFS89055 - Ends
179700040320
179800040320       DPR-EFT-PAYMENT-TYPE.
179900040427      *****Process EFT Payment Types
180000040328           CALL "OEBANKEFT".
180100040320           IF COMM-RETURN-CODE = "99"
180200040320              GO TO DPR-EXIT
180300040320           END-IF.
180400040320
180500040320       DPR-BATCH-HEADER.
180600040328      *****Set batch header
180700040427           IF DIRECT-ORDER
180800040328              CALL "OEGETBATCH"
180900040328              IF COMM-RETURN-CODE = "99"
181000040328                 GO TO DPR-EXIT
181100040320              END-IF
181200120410           END-IF.
181300120410
181400120410      *-- RFS97573 Begins
181500120410       DPR-STANDING-ORDER.
181600120410      *--- Validate standing Order
181700120410
181800120411           IF STANDING-ORDER OF ESG-OE-DTL-REC = lncc_Y
181900120411              IF CLIENT-ACCOUNT                       OR
182000120411                 (Trans-Type-Det    OF Esg-Oe-Dtl-Rec
182100120411                                    NOT = SPACES      OR
182200120411                  Product-Indicator OF Esg-Oe-Dtl-Rec
182300120411                                    NOT = SPACES)     OR
182400120411                 (WS-ACCOUNT-DESINATION = lnc_3       AND
182500120411                  Order-Source      OF Esg-Oe-Dtl-Rec
182600120411                                    NOT = lnc_I)
182700120411
182800120411                    MOVE lc-InvDlrInitStandOrd-258
182900120411                                         TO COMM-RETURN-DESC
183000120411                    MOVE lnc_Buy44          TO COMM-ERROR-PTR
183100120411                    PERFORM ESG-REJECTION    THRU ERJ-EXIT
183200120410              END-IF
183300120410           END-IF.
183400120410
183500180215      *-- RFS97573 - Ends
183600180215      *-- RF174735 - Start
183700180215       DPR-PAC-VALIDATION.
183800180215      *--- PAC validation
183900180215
184000180215           IF  PAC-PURCHASE
184100180215           AND WS-ACCOUNT-DESINATION = lnc_3
184200180215           AND ORDER-SOURCE  OF ESG-OE-DTL-REC NOT = lnc_I
184300180215               MOVE ERR-INV-TXN-TY-DT TO COMM-RETURN-DESC
184400180215               MOVE lnc_BUY61         TO COMM-ERROR-PTR
184500180215               PERFORM ESG-REJECTION THRU ERJ-EXIT
184600180215           END-IF.
184700180215
184800120410      *-- RFS174735- Ends
184900040320
185000040321
185100040321       DPR-MIN-PURCHASE.
185200110704      *****Validate minimum allawable for purchase
185300110704      *RFS92477 - START.
185400110704           IF ex-OeSplitEdit = lncc_Y
185500110704               IF WIRE-ORDER
185600110704                  Call "FXVLDSPTRN" using COMM-SPLIT-OPTION-RULE
185700110704                                          lncc-Screenname01
185800110704                                          lc-SplitAllowed
185900110704               ELSE
186000110704                  Call "FXVLDSPTRN" using COMM-SPLIT-OPTION-RULE
186100110704                                          lncc-Screenname02
186200110704                                          lc-SplitAllowed
186300110704               END-IF
186400110704                  IF lc-SplitAllowed = lncc-N
186500110704                   MOVE ERR-INVALID-PURCHASE TO COMM-RETURN-DESC
186600110704                   MOVE lncc-BUY15 to COMM-ERROR-PTR
186700110704                   MOVE "99" TO COMM-RETURN-CODE
186800110704                   PERFORM ESG-REJECTION THRU ERJ-EXIT
186900110704                   GO TO DPR-EXIT
187000110704                  END-IF
187100110704           END-IF
187200120410      *RFS92477 - END.
187300171213
187400120410      *RFS165468 Starts
187500171213      *RFS97573 - Begins.
187600171213      *    IF STANDING-ORDER OF ESG-OE-DTL-REC = lncc_Y
187700171213      *       PERFORM GET-MIN-PAC THRU GMC-EXIT
187800171213      *       IF COMM-RETURN-CODE = "99"
187900171213      *          GO TO DPR-EXIT
188000171213      *       END-IF
188100120410      *    ELSE
188200171213      *RFS97573 - Ends.
188300171213      *       PERFORM GET-MIN-PURCHASE THRU GMP-EXIT
188400171213      *       IF COMM-RETURN-CODE = "99"
188500171213      *          GO TO DPR-EXIT
188600171213      *       END-IF
188700171213      *    END-IF.
188800171213
188900171213           SET lb_StdordEditNo TO TRUE.
189000171213           SET lb_StandingOrdNo TO TRUE.
189100171213           SET lb_InitialBuyNo TO TRUE.
189200171213
189300171213           IF Comm-Stdord-Edt-Code = lncc_Y
189400171213              SET lb_StdordEditYes To TRUE
189500171213           END-IF.
189600171213
189700180215           IF STANDING-ORDER OF ESG-OE-DTL-REC = lncc_Y
189800171213174735     OR PAC-PURCHASE
189900171213              SET lb_StandingOrdYes TO TRUE
190000171213           END-IF.
190100171213
190200171213           IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC = 0
190300171213              SET lb_InitialBuyYes TO TRUE
190400171213           END-IF.
190500180131
190600180131           EVALUATE TRUE
190700180131             WHEN (lb_StdordEditYes AND lb_InitialBuyYes AND
190800180131                  lb_StandingOrdYes)
190900180131               OR lb_StandingOrdNo
191000180131                PERFORM GET-MIN-PURCHASE THRU GMP-EXIT
191100180131             WHEN lb_StandingOrdYes
191200180131                PERFORM GET-MIN-PAC THRU GMC-EXIT
191300180131            END-EVALUATE.
191400120410      *RFS165468 Ends
191500090923
191600040321       DPR-MAX-ANNUAL-CONTRIBUTION.
191700041108      *****Get Maximum allowable annual contribution.
191800040930           IF DIRECT-ORDER
191900040930              IF BUY-TRANSACTION AND NOT COMMISSION-REBATES
192000040930                 PERFORM GET-MAX-ANNUAL-PUR-LIMIT THRU MAP-EXIT
192100040930                 IF COMM-RETURN-CODE = "99"
192200040930                    GO TO DPR-EXIT
192300040930                 END-IF
192400041108              END-IF
192500040321           END-IF.
192600040321
192700040321       DPR-PROCESS-COMMISION.
192800040427      *****Get applicable commisions
192900040326           CALL "OEFBCOMM".
193000040321           IF COMM-RETURN-CODE = "99"
193100040321              GO TO DPR-EXIT
193200040321           END-IF.
193300040321
193400040321       DPR-CAPPING-RULES.
193500040321      *****Validate capping rules
193600040326           PERFORM PROCESS-CAPPING-RULES THRU PCR-EXIT.
193700040321           IF COMM-RETURN-CODE = "99"
193800040321              GO TO DPR-EXIT
193900040320           END-IF.
194000040328
194100040328       DPR-COMMISSION-REBATES.
194200040328      *****Peocess Commission rebates
194300040427           IF COMMISSION-REBATES
194400040328              CALL "OECOMRBT"
194500040328              IF COMM-RETURN-CODE = "99"
194600040328                 GO TO DPR-EXIT
194700040328              END-IF
194800040328           END-IF.
194900040330
195000040330       DPR-NBC-SPECIFICS.
195100040330      *****NBC specific process
195200040427           IF MANAGEMENT-COMPANY-CODE OF ESG-OE-DTL-REC = "NBC"
195300040330              CALL "OENBCMISC"
195400040330              IF COMM-RETURN-CODE = "99"
195500040330                 GO TO DPR-EXIT
195600040330              END-IF
195700040328           END-IF.
195800100517       DPR-WRITE-RECORDS.
19590010051765695
19600010051765695      IF WS-ACB-DOL-AMT-GGF  IS NOT NUMERIC
19610010051765695      OR WS-ACB-CENT-AMT-GGF IS NOT NUMERIC
19620010051765695         MOVE "N" TO COMM-WRITE-TRANS-ADJ-UNIT-COST
19630010051765695        ELSE
19640010051765695         MOVE "Y" TO COMM-WRITE-TRANS-ADJ-UNIT-COST
19650010051765695         MOVE WS-ACB-DOL-AMT-GGF  TO WS-ACB-DOL-AMT
19660010051765695         MOVE WS-ACB-CENT-AMT-GGF TO WS-ACB-CENT-AMT
19670010051765695      END-IF.
19680011031365695
196900110313
197000110313      * RFS89055 - Begins
197100110313      * Write CDSC Original Details
197200110313           IF COMM-ESB-PROCESS = lncc_Y
197300121019           AND LOAD-STRUCTURE OF INVESTMENT-REC = lncc_B
197400110313R99891        INITIALIZE  MFATNCODP OF TRANS-CDSC-ORIGINAL-DET-REC
197500110313              MOVE PLACEMENT-DATE OF TRANS-REC
197600110313                TO PLACEMENT-DATE OF TRANS-CDSC-ORIGINAL-DET-REC
197700110313              MOVE TRANS-NO       OF TRANS-REC
197800110313                TO TRANS-NO       OF TRANS-CDSC-ORIGINAL-DET-REC
197900110313              MOVE 0
198000110313                TO ORIGINAL-VALUE OF TRANS-CDSC-ORIGINAL-DET-REC
198100110313              MOVE TRADE-DATE     OF TRANS-REC
198200110313                TO AGE-DATE       OF TRANS-CDSC-ORIGINAL-DET-REC
198300110313
198400110313               MOVE lncc_Y  TO COMM-WRITE-TRANS-CDSC-ORIG-DET
198500110313           END-IF.
198600110313
198700110313      * Write Average Unit Cost
198800110313           IF NOMINEE OF ACCOUNT-REC = lncc_N
198900110313              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC
199000110313                TO lc_AccountTypeCode
199100110313           ELSE
199200110313              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE-REC
199300110313                TO lc_AccountTypeCode
199400110313           END-IF.
199500110313           MOVE CONTR-REDEM-CODE OF TRANS-REC
199600110313             TO lc_ContrRedemCode.
199700110313           IF COMM-ESB-PROCESS = lncc_Y
199800110313              PERFORM GET-CONTR-REDEM-CODE-RULE
199900110313           END-IF.
200000110313           IF COMM-RETURN-CODE = "99"
200100110313              GO TO DPR-EXIT
200200110313           END-IF.
200300110313
200400110313           IF COMM-ESB-PROCESS = lncc_Y
200500110313           AND DIRECT-ORDER
200600110313           AND AVERAGE-UNIT-COST OF TRANS-REC > 0
200700110313           AND lc_ContrRedemCodeRule = "79"
200800110313
200900110313              INITIALIZE pc_FxtrnaucParms
201000110313              MOVE lncc_P  TO pc_FxtrnaucProcessMode
201100110313              MOVE PLACEMENT-DATE OF TRANS-REC
201200110313                TO pn_FxtrnaucPlacementDate
201300110313              MOVE TRANS-NO OF TRANS-REC
201400110313                TO pn_FxtrnaucTransNo
201500110313              MOVE AVERAGE-UNIT-COST OF TRANS-REC
201600110313                TO pn_FxtrnaucAvgUnitCost
201700110313
201800110313              CALL "FXTRNAUC"  USING pc_FxtrnaucParms
201900110313              IF pc_FxtrnaucReturnCode  NOT =  "00"
202000110313                 MOVE ERR-INV-AC-FCOMP  TO COMM-RETURN-DESC
202100110313                 MOVE "BUY29"           TO COMM-ERROR-PTR
202200110313                 PERFORM ESG-REJECTION THRU ERJ-EXIT
202300110313                 GO TO DPR-EXIT
202400110313              END-IF
202500121024           END-IF.
202600121024
202700121024      *RFS99891 - Start
202800121024           IF COMM-ESB-PROCESS = lncc_Y
202900181227           AND DIRECT-ORDER
203000121024           AND Supervisor-Dealer-Rep-Code OF ESG-OE-CLT-REC
203100121024           NOT = SPACES
203200121024              MOVE DEALER-CODE OF ESG-OE-DTL-REC
203300121024                                          TO lc_DlrCode
203400121024              MOVE Supervisor-Dealer-Rep-Code OF ESG-OE-CLT-REC
203500121024                                          TO lc_SuperRepCode
203600121024              INITIALIZE li_Cnt1
203700121024              EXEC SQL
203800121024                   SELECT COUNT(*)
203900121024                   INTO :li_Cnt1
204000121024                   FROM MFADEAREP
204100121024                   WHERE DEALER_CODE = :lc_DlrCode
204200121024                   AND DEALER_REP_CODE = :lc_SuperRepCode
204300121024                   AND DEALER_REP_STATUS = :lnc_A
204400121024              END-EXEC
204500121024
204600121024              IF li_Cnt1 = 0
204700121024                 MOVE ERR-INVALID-REP TO COMM-RETURN-DESC
204800121024                 MOVE "SEL46" TO COMM-ERROR-PTR
204900121024                 PERFORM ESG-REJECTION THRU ERJ-EXIT
205000121024              END-IF
205100121024           END-IF.
205200190102      *RFS99891 - End
205300190102           IF COMM-ESB-PROCESS = lncc_Y
205400190121           AND DIRECT-ORDER
205500110313179709     OR (lb_ICTWMINYes)
205600110313      * Write Relinquishing Account Type
205700110313              IF RELINQUISHING-ACCOUNT-TYPE OF ESG-OE-DTL-REC
205800120801                                                NOT = SPACES
205900120817      *RFS99891 - Start
206000120801                 OR SUPERVISOR-DEALER-REP-CODE OF ESG-OE-CLT-REC
206100120801                                                NOT = SPACES
206200190121      *RFS99891 - End
206300110313179709     OR (lb_ICTWMINYes)
206400110313                 INITIALIZE MFATRNMSCP OF TRANS-MISC-DETAILS-REC
206500110313                 MOVE PLACEMENT-DATE OF TRANS-REC TO
206600110313                      PLACEMENT-DATE OF TRANS-MISC-DETAILS-REC
206700110313                 MOVE TRANS-NO OF TRANS-REC TO
206800110313                      TRANS-NO OF TRANS-MISC-DETAILS-REC
206900110313                 MOVE RELINQUISHING-ACCOUNT-TYPE OF ESG-OE-DTL-REC TO
207000120803                 RELINQUISHING-ACCOUNT-TYPE OF TRANS-MISC-DETAILS-REC
207100120803      *RFS99891 - Start
207200120803                 MOVE SUPERVISOR-DEALER-REP-CODE OF ESG-OE-CLT-REC TO
207300120803                      SUPERVISOR-DEALER-REP-CODE OF
207400120803                                                 TRANS-MISC-DETAILS-REC
207500190121      *RFS99891 - End
207600190121179709           IF  lb_ICTWMINYes
207700190121179709              MOVE "Y" TO WAIVE-INV-MIN-THRESHOLD OF
207800190121179709                              TRANS-MISC-DETAILS-REC
207900181227179709           END-IF
208000110313                 MOVE lncc_Y  TO COMM-WRITE-TRANS-MISC-DEATILS
208100110313              END-IF
208200110313           END-IF.
208300110425
208400110313      *** RFS94524 - Starts
208500110425      * Validate Payment Type info
208600110425      *****IF Comm-Esb-Process= lncc_Y
208700110425      *****AND Direct-Order
208800110425      *****AND Payment-Type-Code OF Esg-Oe-Dtl-Rec = SPACE
208900110425      *****AND Trans-Type-Code OF Trans-rec = "BUY"
209000110425      *****    MOVE Err-Inv-Pay-Id TO Comm-Return-Desc
209100110425      *****    MOVE "BUY99" TO Comm-Error-Ptr
209200110425      *****    PERFORM Esg-Rejection THRU Erj-Exit
209300110425      *****    GO TO DPR-EXIT
209400110425      *****END-IF.
209500110425      *** RFS94524 - Ends
209600110313
209700110313           IF COMM-ESB-PROCESS = lncc_Y
209800110313           AND PAYMENT-TYPE-CODE OF ESG-OE-DTL-REC  NOT =  SPACES
209900110313              PERFORM CHECK-PAYMENT-TYPES  THRU CPT-EXIT
210000110313              IF COMM-RETURN-CODE = "99"
210100110313                 GO TO DPR-EXIT
210200110313              END-IF
210300110313
210400110313              EVALUATE lc_PaymentTypeRule
210500110313                WHEN lncc_T
210600110313                  PERFORM PROCESS-PAYMENT-TYPE-T  THRU PPTT-EXIT
210700110313                  IF COMM-RETURN-CODE = "99"
210800110313                     GO TO DPR-EXIT
210900110313                  END-IF
211000121024
211100121024                WHEN lncc_C
211200110313R99891            IF Payment-Type-Code OF Esg-Oe-Dtl-Rec = "C"
211300110313                  PERFORM PROCESS-PAYMENT-TYPE-C  THRU PPTC-EXIT
211400110313                  IF COMM-RETURN-CODE = "99"
211500110313                     GO TO DPR-EXIT
211600121024                  END-IF
211700110313R99891            END-IF
211800110313                WHEN lncc_W
211900110313                  PERFORM PROCESS-PAYMENT-TYPE-W  THRU PPTW-EXIT
212000110313                  IF COMM-RETURN-CODE = "99"
212100110313                     GO TO DPR-EXIT
212200110313                  END-IF
212300110313              END-EVALUATE
212400110313              MOVE Payment-Type-Code OF Esg-Oe-Dtl-Rec TO
212500110313                   Payment-Type-Code OF Trans-Rec
212600110313           END-IF.
212700110313
212800130227      * Write EFT
212900130227      *RFS114676 Start.
213000130227      *    IF COMM-ESB-PROCESS = lncc_Y
213100130227      *    AND PAYMENT-TYPE-CODE OF TRANS-REC = lncc_E
213200130227           IF (COMM-ESB-PROCESS = lncc_Y
213300130227           AND PAYMENT-TYPE-CODE OF TRANS-REC = lncc_E)
213400130227           OR COMM-BUY-EFT-SETTLE = lncc_Y
213500110313      *RFS114676 End.
213600110313              CALL "OEBANKGEN"
213700110313              IF COMM-RETURN-CODE = "99"
213800110313                 GO TO DPR-EXIT
213900110313              END-IF
214000110313           END-IF.
214100110313
214200110313      *    -- Direct Buy Validation
214300110313           IF COMM-ESB-PROCESS = lncc_Y
214400110313           AND DIRECT-ORDER
214500110313           AND TRANS-TYPE-CODE OF TRANS-REC = "BUY"
214600110313              IF PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC = "6"
214700110313      *          -- rig to call FXSERIECHK
214800110313                 INITIALIZE wsFXSERIECHK-Variables
214900110313                 CALL "FXSERIECHK" USING li_AccountNo
215000110313                                         lc_InvestmentCode
215100110313                                         lc-fsc-SeriesID
215200110313                                         lc-fsc-SeriesType
215300110313                                         lc-fsc-ContractExists
215400110313                                         lc-fsc-ErrorCode
215500110313                 IF  lc-fsc-SeriesType = "SPIA"
215600110313                 AND lc-fsc-ContractExists = "Y"
215700110313                    MOVE ERR-INVALID-FUND TO COMM-RETURN-DESC
215800110313                    MOVE "BUY43" TO COMM-ERROR-PTR
215900110313                    PERFORM ESG-REJECTION THRU ERJ-EXIT
216000110313                    GO TO DPR-EXIT
216100110313                 END-IF
216200110313              END-IF
216300110313           END-IF.
216400180712      * RFS89055 - Ends
216500180712
216600180712      *RFS 178443 - Start
216700180712           IF  Comm-Esb-Process  = lncc_Y
216800180712           AND COMM-ERFEE-MODULE = lncc_Y
216900180712           AND TRANS-TYPE-CODE OF TRANS-REC = lncc_BAJ
217000180712           AND COMM-RETURN-CODE NOT= "99"
217100180712               MOVE "Y"  TO COMM-WRITE-TRANS-ERF-PURCHASE
217200180712           END-IF.
217300110313      *RFS 178443 - End
217400180405
217500180405      *Rfs174735 - Start
217600180405           IF COMM-F50-FLAG  =  lnc_Y
217700180405           AND COMM-NEW-ACCT-CREATED  =  lnc_Y
217800180405               COMMIT
217900180405           END-IF.
218000180405      *Rfs174735 - End
218100210531      *RFS180952 Start.
218200210531           INITIALIZE lb_HLIattribute
218300210531                      Lc_Accountno1.
218400210531           MOVE FUND-ACCOUNT-NO OF ESG-OE-DTL-REC   TO
218500210531                                  WS-FUND-ACCOUNT-NO1.
218600210531           MOVE WS-ACCOUNT-NO TO Lc_Accountno1.
218700210531           EXEC SQL
218800210531             SELECT "Y"
218900210531             INTO :lb_HLIattribute
219000210531             FROM MFAACCATP
219100210531             WHERE ACCOUNT_NO =  :Lc_Accountno1
219200210531             AND  ACCOUNT_ATTRIBUTE_CODE = :lnc_HLI
219300210531           END-EXEC
219400210531           IF lb_HLIattributeYes
219500210531              PERFORM GetInvStr
219600210531              IF SQLCODE = 0 AND lb_ConstSeriesYes
219700210531                 MOVE ERR-NOT-ELIGIABLE-PLAN  TO COMM-RETURN-DESC
219800210531                 MOVE "BUY65"                 TO COMM-ERROR-PTR
219900210531                 PERFORM ESG-REJECTION THRU ERJ-EXIT
220000210531                 GO TO DPR-EXIT
220100210531              END-IF
220200210531           END-IF.
220300210531      *RFS180952 End.
220400180405
220500040328
220600040427      *****Write records
220700040328           CALL "OEWRITES".
220800040328           IF COMM-RETURN-CODE = "99"
220900040328              GO TO DPR-EXIT
221000040328           END-IF.
221100040316
221200040313       DPR-EXIT.
221300040315           EXIT.
221400040313      /
221500040405       END-OF-PROCESSING.
221600040313           CONTINUE.
221700040315
221800040315       EOP-EXIT.
221900040315           EXIT.
222000040319      /
222100040319       CHECK-MASTER-ACCOUNTS.
222200040319      *****Check Master Account Process
222300040319           MOVE "N" TO WS-CREATE-NEW-ACCT.
222400040323           INITIALIZE MST-PARMS.
222500040323           MOVE WS-ACCOUNT-NO9 TO MST-ACCT-NO.
222600040323           MOVE DEALER-CODE OF DEALER-REC TO  MST-DEALER.
222700040323           MOVE INVESTMENT-CODE OF INVESTMENT-REC TO MST-INVEST.
222800040319           MOVE "N" TO MST-CALLING-FROM-SCRN.
222900040323           IF PURCHASE-TRANSACTION
223000040319              MOVE "B" TO MST-BUY-OR-SELL
223100040323           ELSE
223200040319              MOVE "S" TO  MST-BUY-OR-SELL
223300040329           END-IF.
223400040323           MOVE COMM-ACCOUNT-SEPARATOR TO MST-AAP-FUND-SEP.
223500040319           MOVE WS-MODULE-MASTER-ACC TO MST-MASTER-ACCT-MOD.
223600040325
223700040325           MOVE ZEROES TO MST-ACCT-NO-2.
223800040326           MOVE SPACES TO MST-INVEST-2.
223900040321           MOVE TRANS-TYPE-CODE OF TRANS-REC TO MST-TRANS-TYPE-CODE.
224000040319           MOVE SHARE-FLAG OF ESG-OE-DTL-REC TO MST-SPLIT-OPTION-CODE.
224100040330
224200040427           MOVE 0 TO MST-TRANS-NO, MST-PLACEMENT-DATE.
224300040330           CALL "MASTERACCT"  USING  MST-PARMS.
224400040812           IF MST-RETURN-CODE NOT = SPACES
224500040330R23255        MOVE "BUY19" TO COMM-ERROR-PTR
224600040319              GO TO CMA-9999
224700040330           END-IF.
224800040330
224900040330      ***** When 01 is returned by the "MASTERACCT" it means
225000040330      ***** create pending MFAACCIAP
225100040330           IF MST-UPDATE-MFAACCIAP = "01"
225200040330              MOVE MST-UPDATE-MFAACCIAP TO COMM-UPDATE-MFAACCIAP
225300040330           END-IF.
225400040319
225500040330      *** Use same account number.
225600040330           IF MST-DETERMINE-FLAG = "Y"
225700040319              GO TO CMA-EXIT
225800040319           END-IF.
225900040319
226000040319      *** Revised account number.
226100040319           IF  MST-DETERMINE-FLAG = "R"   AND
226200040812               MST-NEW-ACCT  = ZEROES
226300040319R23255         MOVE "BUY20" TO COMM-ERROR-PTR
226400040319               GO TO CMA-9999
226500040319           ELSE
226600040319           IF  MST-DETERMINE-FLAG = "R"   AND
226700040319               MST-NEW-ACCT  NOT = ZEROES
226800040319               GO TO CMA-9000
226900040319           END-IF.
227000040319
227100040321      *** Create a new account.
227200040321           IF MST-DETERMINE-FLAG = "N"
227300040321              IF MST-NEW-ACCT = ZEROES AND
227400040812                 MST-MASTER-ACCT = ZEROES
227500040321R23255           MOVE "BUY21" TO COMM-ERROR-PTR
227600040321                 GO TO CMA-9999
227700040321              END-IF
227800040321              IF PURCHASE-TRANSACTION
227900040321                 MOVE SPACES TO FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
228000040321                 MOVE "Y" TO WS-CREATE-NEW-ACCT
228100040812              ELSE
228200040321R23255           MOVE "BUY22" TO COMM-ERROR-PTR
228300040321                 GO TO CMA-9999
228400040319              END-IF
228500040319           END-IF.
228600040319
228700040319       CMA-9000.
228800040902           MOVE MST-NEW-ACCT    TO WS-ACCOUNT-NO9.
228900040902R23685     IF MST-NEW-ACCT = ZEROES
229000040902R23685        MOVE ZEROES TO FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
229100040902R23685     ELSE
229200040902R23685        MOVE MST-NEW-ACCT TO FUND-ACCOUNT-NO OF ESG-OE-DTL-REC
229300040329R23685     END-IF.
229400040319           MOVE MST-MASTER-ACCT TO COMM-MASTER-ACCOUNT-NO.
229500040319           MOVE MST-RPT-MASTER-ACCT TO MASTER-DEALER-PROCESS.
229600040319           GO TO CMA-EXIT.
229700040319
229800040326       CMA-9999.
229900040330           MOVE ERR-INVALID-ACCOUNT TO COMM-RETURN-DESC.
230000040319           PERFORM ESG-REJECTION THRU ERJ-EXIT.
230100040319
230200040319       CMA-EXIT.
230300040319           EXIT.
230400040330      /
230500040321       VALIDATE-INVEST-ACCOUNT-TYPE.
230600040330      ****************************************************************
230700040330      * ROUTINE:VALIDATE INVEST ACCOUNT TYPE                         *
230800040330      * PURPOSE:Check if the account is allowed to hold the fund on  *
230900040321      *         the order.                                           *
231000040330      ****************************************************************
231100040330           MOVE INVESTMENT-CODE OF INVESTMENT-REC TO
231200040330                INVESTMENT-CODE OF INV-CODE-ACCT-TYPE-RD-REC.
231300040330           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC TO
231400040330                ACCOUNT-TYPE-CODE OF INV-CODE-ACCT-TYPE-RD-REC.
231500040330           IF NOMINEE OF ACCOUNT-REC = "Y"
231600040330              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE-REC TO
231700040330                   NOMINEE-ACCOUNT-TYPE OF INV-CODE-ACCT-TYPE-RD-REC
231800040330           ELSE
231900040330              MOVE SPACES TO
232000040330                   NOMINEE-ACCOUNT-TYPE OF INV-CODE-ACCT-TYPE-RD-REC
232100040330           END-IF.
232200040330            READ INV-CODE-ACCOUNT-TYPE-RD
232300040330             INVALID KEY
232400040422               MOVE ERR-INVALID-ACTYP TO COMM-RETURN-DESC
232500040330               MOVE "BUY07" TO COMM-ERROR-PTR
232600040330               PERFORM ESG-REJECTION THRU ERJ-EXIT
232700040330            END-READ.
232800040330
232900040330       VIAT-EXIT.
233000040330            EXIT.
233100040330      /
233200040330       GET-ACCOUNT-TYPE-RULE.
233300040330      ****************************************************************
233400040330      * ROUTINE: GET ACCOUNT TYPE RULE                               *
233500040330      * PURPOSE: Get account type rule of the account.               *
233600040327      ****************************************************************
233700040319           READ ACCOUNT-TYPE-RD
233800040326             INVALID KEY
233900040422               MOVE ERR-INVALID-ACTYP TO COMM-RETURN-DESC
234000040328               MOVE "BUY08" TO COMM-ERROR-PTR
234100040319               PERFORM ESG-REJECTION THRU ERJ-EXIT
234200040319           END-READ.
234300040319
234400040319       GATR-EXIT.
234500040319            EXIT.
234600040319      /
234700040323      *****Validate RESP specimen plan.
234800040422       CHECK-SPECIMEN-PLAN-RTN.
234900040421           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC TO
235000040423              ACCOUNT-TYPE-CODE OF RESP-TYPE-SPEC-PLAN-RD-REC.
235100040422           MOVE RESP-TYPE-CODE OF ACCOUNT-RESP-REC TO
235200040422                RESP-TYPE-CODE OF RESP-TYPE-SPEC-PLAN-RD-REC.
235300040319           READ RESP-TYPE-SPECIMEN-PLAN-RD
235400040326             INVALID KEY
235500040602              MOVE ERR-INVALID-ACTYP TO COMM-RETURN-DESC
235600040328              MOVE "BUY09" TO COMM-ERROR-PTR
235700040422              PERFORM ESG-REJECTION THRU ERJ-EXIT
235800040422              GO TO CSP-EXIT
235900040319           END-READ.
236000040319
236100040328           IF SPECIMEN-PLAN-NO
236200040422              OF RESP-TYPE-SPEC-PLAN-RD-REC = SPACES OR ZEROES
236300040602              MOVE ERR-INV-RESP-SRC-CE TO COMM-RETURN-DESC
236400040328              MOVE "BUY10" TO COMM-ERROR-PTR
236500040326              PERFORM ESG-REJECTION THRU ERJ-EXIT
236600040319              GO TO CSP-EXIT.
236700040319
236800040319       CSP-EXIT.
236900040320           EXIT.
237000040331      /
237100040321       GET-ACCOUNT-INVESTMENT.
237200040321      ***** Account investment would be processed here
237300040927      ****************************************************************
237400040927      * ROUTINE: Get Account Investment                              *
237500040927      * PURPOSE: Retrieve the Account Investment record. If found,   *
237600040927      *          compare the distribution setup.  If not found,      *
237700040321      *          setup a new Account Investment record.              *
237800120419      ****************************************************************
237900180411           MOVE "N" TO COMM-WRITE-ACCOUNT-INVESTMENT.
238000180411           MOVE DIVIDEND-OPTION OF ESG-OE-DTL-REC
238100040321             TO lc_DivOpt.
238200040321           MOVE ACCOUNT-NO OF TRANS-REC TO
238300040321                ACCOUNT-NO OF ACCOUNT-INVESTMENT-RD-REC.
238400040321           MOVE INVESTMENT-CODE OF TRANS-REC TO
238500040329                INVESTMENT-CODE OF ACCOUNT-INVESTMENT-RD-REC.
238600040329           READ ACCOUNT-INVESTMENT-RD INTO
238700040321                ACCOUNT-INVESTMENT-REC
238800040405            INVALID KEY
238900040329             GO TO CAI-CREATE
239000040321           END-READ.
239100180411
239200180411
239300180411      *Rfs178643 - Start
239400180411R24359*     IF DIVIDEND-OPTION OF ESG-OE-DTL-REC = " " OR "#"
239500180411      *  When dividend option isnot cash(4) or re-invest(1) exist
239600040927            IF NOT lnc_ValidDivOptions
239700040927              GO TO CAI-LEAVE
239800180411           END-IF.
239900180411
240000180411      *  When fund has position then accept order with warning
240100180411           IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC > ZEROES
240200180411               MOVE lnc_BUY12           TO COMM-ERROR-PTR
240300180411               MOVE ERR-DISTRIB-IGNORED TO COMM-WARN-DESC
240400180411               PERFORM ESG-WARNING      THRU EWN-EXIT
240500180411
240600180411               GO TO CAI-LEAVE
240700180411           END-IF.
240800180411
240900180611           IF DISTR-FREQ OF INVESTMENT-GROUP-REC = lnc_NA
241000180611              IF PAYMENT-TYPE-CODE OF ACCOUNT-INVESTMENT-REC ="N"
241100180611178643        AND DIVIDEND-OPTION OF ESG-OE-DTL-REC = "1"
241200180611178643            GO TO CAI-LEAVE
241300180411178643        END-IF
241400180411              MOVE "R" TO
241500180411                   CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
241600180411              MOVE "R" TO
241700180411                   INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
241800180411              MOVE "N" TO
241900180411                   PAYMENT-TYPE-CODE OF ACCOUNT-INVESTMENT-REC
242000180411              MOVE lncc_R TO COMM-WRITE-ACCOUNT-INVESTMENT
242100180411              MOVE lnc_BUY11           TO COMM-ERROR-PTR
242200180411              MOVE ERR-DISTRIB-IGNORED TO COMM-WARN-DESC
242300180411              PERFORM ESG-WARNING      THRU EWN-EXIT
242400180411              GO TO CAI-LEAVE
242500180411           END-IF.
242600180411
242700180411      *  When fund matches DivOpt(1) on order then skip Dividen option
242800180411           IF  DIVIDEND-OPTION OF ESG-OE-DTL-REC = "1"
242900180411           AND (CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
243000180411                 = "R"
243100180411                AND INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC = "R"
243200180411                )
243300180411               GO TO CAI-LEAVE
243400180411           END-IF.
243500180411      *  When fund matches DivOpt cash on order then skip Dividen option
243600180411           IF  DIVIDEND-OPTION OF ESG-OE-DTL-REC = "4"
243700180411           AND (CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
243800180411                 = "C"
243900180411                AND INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC = "C"
244000180411                )
244100180411               GO TO CAI-LEAVE
244200180411           END-IF.
244300180411
244400180411
244500180611           IF  DIVIDEND-OPTION OF ESG-OE-DTL-REC = "1"
244600180611           AND (CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
244700180611                 = "C"
244800180611                AND INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC = "C"
244900180611               )
245000180611               PERFORM VALIDATE-DIV-OPT
245100180611               IF li-ValIns > 0
245200180411                  PERFORM DELETE-CHQ-EFT
245300180611               END-IF
245400180411               MOVE lncc_R TO COMM-WRITE-ACCOUNT-INVESTMENT
245500180411               GO TO CAI-LEAVE
245600180611           END-IF.
245700180611      *     IF  DIVIDEND-OPTION OF ESG-OE-DTL-REC = "1"
245800180611      *         PERFORM VALIDATE-DIV-OPT
245900180611      *         IF li-ValIns > 0
246000180611      *            MOVE lncc_R TO COMM-WRITE-ACCOUNT-INVESTMENT
246100180611      *         END-IF
246200180611      *         GO TO CAI-LEAVE
246300180411      *     END-IF.
246400180411
246500180611           IF  DIVIDEND-OPTION OF ESG-OE-DTL-REC = "4"
246600180611           AND (CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
246700180611                 = "R"
246800180611                AND INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC = "R"
246900180411               )
247000180411              CALL "ESGDISMOD"
247100180411              GO TO CAI-LEAVE
247200180411           END-IF.
247300180411
247400180411      *Rfs178643 - End
247500180411      *  Commented all below
247600180411      *---------------------------------------------*
247700180411
247800040927
247900180129R24359***** Re-invest distribution
248000180129      * RFS 173538 - Start
248100180129      *    IF DIVIDEND-OPTION OF ESG-OE-DTL-REC = "1" AND
248200180129      *          (CAPITAL-GAIN-DISTR-OPTION
248300180129      *                       OF ACCOUNT-INVESTMENT-REC NOT = "R" OR
248400180129      *            INCOME-DISTR-OPTION
248500120419      *                       OF ACCOUNT-INVESTMENT-REC NOT = "R")
248600120419      *-- RFS108404 - Begins
248700120419      *       MOVE "BUY11" TO COMM-ERROR-PTR
248800120419      *       MOVE ERR-DISTRIB-IGNORED TO COMM-WARN-DESC
248900180129      *       PERFORM ESG-WARNING THRU EWN-EXIT
249000180129      *         IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC = ZEROES
249100180129      *            MOVE lncc_R   TO CAPITAL-GAIN-DISTR-OPTION
249200180129      *                        OF ACCOUNT-INVESTMENT-REC
249300180129      *            MOVE lncc_R   TO INCOME-DISTR-OPTION
249400180129      *                        OF ACCOUNT-INVESTMENT-REC
249500180411      *            MOVE lncc_R   TO COMM-WRITE-ACCOUNT-INVESTMENT
249600180411      *    IF  DIVIDEND-OPTION OF ESG-OE-DTL-REC = "1"
249700180411      *        IF  CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC = ZEROES
249800180411      *            PERFORM VALIDATE-DIV-OPT
249900180129      *            GO TO CAI-SET-DEFAULT
250000180411      * RFS 173538 - End
250100180411      *         ELSE
250200180411      *            MOVE lnc_BUY11           TO COMM-ERROR-PTR
250300180411      *            MOVE ERR-DISTRIB-IGNORED TO COMM-WARN-DESC
250400180411      *            PERFORM ESG-WARNING      THRU EWN-EXIT
250500120419      *         END-IF
250600120709      *-- RFS108404 - Ends
250700180411110382*       GO TO CAI-LEAVE
250800180411      *    END-IF.
250900180411      *
251000040927      *
251100180129R24359***** Cash distribution
251200180129      * RFS 173538 - Start
251300180129      *    IF DIVIDEND-OPTION OF ESG-OE-DTL-REC = "4" AND
251400180129      *          (CAPITAL-GAIN-DISTR-OPTION
251500180129      *                       OF ACCOUNT-INVESTMENT-REC NOT = "C" OR
251600180129      *           INCOME-DISTR-OPTION
251700120419      *                       OF ACCOUNT-INVESTMENT-REC NOT = "C")
251800120419      *-- RFS108404 - Begins
251900120419      *       MOVE "BUY12" TO COMM-ERROR-PTR
252000120419      *       MOVE ERR-DISTRIB-IGNORED TO COMM-WARN-DESC
252100120419      *       PERFORM ESG-WARNING THRU EWN-EXIT
252200180129
252300180129      *       IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC = ZEROES
252400180129      *         MOVE lncc_C    TO CAPITAL-GAIN-DISTR-OPTION
252500180129      *                        OF ACCOUNT-INVESTMENT-REC
252600180129      *         MOVE lncc_C    TO INCOME-DISTR-OPTION
252700180129      *                        OF ACCOUNT-INVESTMENT-REC
252800180129      *         MOVE lncc_R    TO COMM-WRITE-ACCOUNT-INVESTMENT
252900180129      *
253000180411      *       ELSE
253100180411      *    IF DIVIDEND-OPTION OF ESG-OE-DTL-REC = "4"
253200180411      *       IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC > ZEROES
253300180411      *         MOVE lnc_BUY12           TO COMM-ERROR-PTR
253400180411      *         MOVE ERR-DISTRIB-IGNORED TO COMM-WARN-DESC
253500180411      *         PERFORM ESG-WARNING      THRU EWN-EXIT
253600180411178643*         GO TO CAI-LEAVE
253700120419      *       END-IF
253800120709      *-- RFS108404 - Ends
253900180411110382*       GO TO CAI-LEAVE
254000180129      *    END-IF.
254100180411      * RFS 173538 - End
254200120709      *
254300180411      *RFS110382 - STARTS
254400180411      *    IF CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC = ZEROES
254500180411173538*    AND  DIVIDEND-OPTION OF ESG-OE-DTL-REC = "4"
254600180411      *       CALL "ESGDISMOD"
254700180411      *       IF COMM-RETURN-CODE = lnc_99
254800180411      *          MOVE lncc_N TO COMM-WRITE-ACCOUNT-INVESTMENT
254900180411      *       ELSE
255000180411173538*          MOVE lncc_R TO COMM-WRITE-ACCOUNT-INVESTMENT
255100180411173538*          MOVE lncc_Y TO COMM-WRITE-ACCOUNT-INVESTMENT
255200180411178643*          MOVE lncc_R TO COMM-WRITE-ACCOUNT-INVESTMENT
255300180411      *       END-IF
255400180411      *
255500120709      *    END-IF.
255600180411      *RFS110382 - ENDS
255700120709      *---------------------------------------------*
255800040602
255900040321       CAI-LEAVE.
256000040321           GO TO CAI-EXIT.
256100040405
256200040321       CAI-CREATE.
256300040321           INITIALIZE MFAACCIVP OF ACCOUNT-INVESTMENT-REC.
256400040321           MOVE ACCOUNT-NO OF TRANS-REC TO
256500040321                ACCOUNT-NO OF ACCOUNT-INVESTMENT-REC.
256600040321           MOVE INVESTMENT-CODE OF TRANS-REC TO
256700040321                INVESTMENT-CODE OF ACCOUNT-INVESTMENT-REC.
256800040329           MOVE ZEROES TO
256900040329              CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC
257000040329              CERT-UNITS OF ACCOUNT-INVESTMENT-REC
257100040329              NON-CERT-UNITS OF ACCOUNT-INVESTMENT-REC
257200040329              OUTSTANDING-REDEMPTION-BALANCE OF ACCOUNT-INVESTMENT-REC
257300040329              AVERAGE-UNIT-COST OF ACCOUNT-INVESTMENT-REC
257400040329              DATE-OF-AVERAGE-UNIT-COST OF ACCOUNT-INVESTMENT-REC
257500040329              AVERAGE-UNIT-COST-BASIS   OF ACCOUNT-INVESTMENT-REC
257600040329              LIFE-TO-DATE-PURCH        OF ACCOUNT-INVESTMENT-REC
257700040329              LIFE-TO-DATE-REDEM   OF ACCOUNT-INVESTMENT-REC
257800040329              YEAR-TO-DATE-PURCHASES OF ACCOUNT-INVESTMENT-REC
257900040329              YEAR-TO-DATE-REDEM OF ACCOUNT-INVESTMENT-REC
258000040329              LAST-FINANCIAL-ACTIVITY  OF ACCOUNT-INVESTMENT-REC
258100040329              RECORD-DATE-BAL OF ACCOUNT-INVESTMENT-REC
258200040329              RECORD-DATE-WO-BUYS OF ACCOUNT-INVESTMENT-REC
258300040329              RECORD-DATE-WO-SELLS OF ACCOUNT-INVESTMENT-REC
258400040329              MONTH-UNIT-BALANCE OF ACCOUNT-INVESTMENT-REC
258500040329              MONTH-CERT-UNITS OF ACCOUNT-INVESTMENT-REC
258600040329              CREATION-DATE OF ACCOUNT-INVESTMENT-REC.
258700040321           MOVE "Y" TO CORRECT-AVE-UNIT-COST OF ACCOUNT-INVESTMENT-REC.
258800040405
258900040405       CAI-SET-DISTRIBUTION.
259000040405      ***** ESG Cash distribution
259100040506           IF DIVIDEND-OPTION OF ESG-OE-DTL-REC = "4"
259200180110              CALL "ESGDISMOD"
259300040405              GO TO CAI-WRITE
259400040405           END-IF.
259500160212
259600160212      *RFS 153674 - Start.
259700160212           IF DIVIDEND-OPTION OF ESG-OE-DTL-REC = "1"
259800160212              PERFORM VALIDATE-DIV-OPT
259900160212           END-IF.
260000160212      *RFS153674 - Ends.
260100180411
260200101012173538 CAI-SET-DEFAULT.
260300101012      *RFS86061 - Start
260400101012           IF DIVIDEND-OPTION OF ESG-OE-DTL-REC = "#" OR " "
260500101012              MOVE INVESTMENT-CODE OF TRANS-REC     TO lc-InvCode
260600101012              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC TO lc-AccType
260700101012              MOVE "R" TO lc-DistOption
260800101013              MOVE "N" TO lc-PaymentType
260900101018              MOVE "N" TO lc-KeepOnVal
261000101013              PERFORM VALIDATE-DISTRIB-INSTRUCTIONS
261100101012              IF lc-KeepOnVal = "Y"
261200101012                 MOVE "C" TO lc-DistOption
261300101018                 MOVE "I" TO lc-PaymentType
261400101012                 PERFORM VALIDATE-DISTRIB-INSTRUCTIONS
261500101012                 IF li-ValIns = 2
261600101012                    MOVE "C" TO
261700101012                    CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
261800101012                    MOVE "C" TO
261900101012                      INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
262000101012                    MOVE "I" TO
262100101012                      PAYMENT-TYPE-CODE OF ACCOUNT-INVESTMENT-REC
262200101012                    GO TO CAI-WRITE
262300101012                 END-IF
262400101012              END-IF
262500101012           END-IF.
262600101012      *RFS86061 - End
262700160212
262800160212      *RFS153674- Start
262900160212           IF CAPITAL-GAIN-DISTR-OPTION
263000160212                                  OF ACCOUNT-INVESTMENT-REC = SPACE
263100160212           OR INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC  = SPACE
263200160212              MOVE "R" TO
263300160212                   CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
263400160212              MOVE "R" TO
263500160212                   INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
263600160212              MOVE "N" TO
263700160212                   PAYMENT-TYPE-CODE OF ACCOUNT-INVESTMENT-REC
263800160212           END-IF.
263900160212      *    IF DIVIDEND-OPTION OF ESG-OE-DTL-REC = "1" OR "#" OR " "
264000160212      *       MOVE "R" TO
264100160212      *            CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
264200160212      *       MOVE "R" TO
264300160212      *            INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
264400160212      *       MOVE "N" TO
264500160212      *            PAYMENT-TYPE-CODE OF ACCOUNT-INVESTMENT-REC
264600160212      *    END-IF.
264700040405      *RFS153674- Ends
264800040405
264900040405       CAI-WRITE.
265000040405           IF COMM-RETURN-CODE = "99"
265100040405              MOVE "N" TO COMM-WRITE-ACCOUNT-INVESTMENT
265200040405           ELSE
265300040405              MOVE "Y" TO COMM-WRITE-ACCOUNT-INVESTMENT
265400040405           END-IF.
265500040322
265600040321       CAI-EXIT.
265700160212           EXIT.
265800160212      /
265900160212      *RFS153674 - Start
266000160212       VALIDATE-DIV-OPT.
266100160212
266200160212           MOVE ZEROES TO li-ValIns.
266300160212           MOVE INVESTMENT-CODE OF TRANS-REC     TO lc-InvCode.
266400160212           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC TO lc-AccType.
266500160212           MOVE "R" TO lc-DistOption.
266600160212           EXEC SQL
266700160212            SELECT COUNT(*)
266800160212              INTO :li-ValIns
266900160212            FROM Mfaacctip Acctip
267000160212            WHERE
267100160212             Acctip.Investment_Code = :lc-InvCode AND
267200160212             Acctip.Account_Type_Code = :lc-AccType AND
267300160212             Acctip.Income_Or_Capital_Gains IN ("I", "C") AND
267400160212             Acctip.Distr_Option_Code = :lc-DistOption
267500160212           END-EXEC.
267600160212
267700160212           IF li-ValIns > 0
267800160212              MOVE "R" TO
267900160212                CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
268000160212              MOVE "R" TO
268100160212                INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
268200160212              MOVE "N" TO
268300160212                PAYMENT-TYPE-CODE OF ACCOUNT-INVESTMENT-REC
268400160212           ELSE
268500160212              MOVE " " TO DIVIDEND-OPTION OF ESG-OE-DTL-REC
268600170919              MOVE lnc_BUY60 TO COMM-ERROR-PTR
268700170919170025*       MOVE ERR-DISTRIB-IGNORED TO COMM-WARN-DESC
268800160212170025        MOVE ERR-INVALID-DIV-OPT TO COMM-WARN-DESC
268900160212              PERFORM ESG-WARNING      THRU EWN-EXIT
269000160212           END-IF.
269100040321      * RFS153674 - Ends
269200040320      /
269300040427       GET-SCREEN-EDITS-ALLOWED.
269400040320           CALL  "FXSCEDTALW" USING SCREEN-EDITS-ALLOWED-REC,
269500040320                                    WS-SEA-EDIT-SQLLOG,
269600040320                                    WS-SEA-RETURN-CODE.
269700040320       GSEA-EXIT.
269800040328           EXIT.
269900120411      /
270000120411      *Rfs97573 Starts
270100120410
270200120410       GET-MIN-PAC.
270300120410      * When waive investment minimum threshold flag is not 'Y',
270400120411      * perform all minimum validations.
270500120411           INITIALIZE  lc_WaiveMin, lc_MinAmtExist,
270600120411                       lc_InvestCode, ln_MinAmt, lc_PlanTrans
270700120411                       lc_ChqType, ln_CurrUnitBal.
270800120411
270900120411           MOVE "PAC" TO lc_PlanTrans.
271000120411           MOVE INVESTMENT-CODE  OF ACCOUNT-INVESTMENT-REC
271100120411                                          TO lc_InvestCode.
271200120411           MOVE CURR-UNIT-BAL OF ACCOUNT-INVESTMENT-REC
271300120411                                          TO ln_CurrUnitBal.
271400120411           MOVE GROSS-AMT OF TRANS-REC TO ln_PACAmt.
271500120410
271600120410           EXEC SQL
271700120410              SELECT WAIVE_INV_MIN_THRESHOLD
271800120410              INTO   :lc_WaiveMin
271900120411              FROM   MFAINVMDP
272000120410              WHERE  INVESTMENT_CODE = :lc_InvestCode
272100120411           END-EXEC.
272200120411
272300120411      *If there are holdings in the investment, validate amount
272400120411      *against minimum amount for subsequent PACs
272500120411           IF lc_WaiveMin NOT = lncc_Y  AND ln_CurrUnitBal > 0
272600120411              MOVE 'SUB' to lc_ChqType
272700120411              EXEC SQL
272800120411               SELECT COALESCE(MIN_AMT, 0)
272900120411                 INTO :ln_MinAmt
273000120411                FROM MFAINVPTP INVPTP
273100120411               WHERE
273200120411                 INVPTP.INVESTMENT_CODE = :lc_InvestCode    AND
273300120411                 INVPTP.PLAN_TRANS      = :lc_PlanTrans     AND
273400120411                 INVPTP.CHEQUE_TYPE     = :lc_ChqType
273500120411              END-EXEC
273600120411              IF SQLCODE = ZEROS
273700120411                 MOVE "Y" to lc_MinAmtExist
273800120411                 IF ln_PACAmt < ln_MinAmt
273900120411                     MOVE ERR-INVALID-AMT-UNT TO COMM-RETURN-DESC
274000120411                     MOVE "BUY14" TO COMM-ERROR-PTR
274100120411                     PERFORM ESG-REJECTION THRU ERJ-EXIT
274200120411                 END-IF
274300120411              END-IF
274400120411           END-IF.
274500120411
274600120411      *If there is no SUBSEQUENT entry set up, check for INITIAL entry
274700120411           IF lc_WaiveMin NOT = lncc_Y
274800120411                     AND lc_MinAmtExist NOT = lncc_Y
274900120411              MOVE 'INI' to lc_ChqType
275000120411              EXEC SQL
275100120411               SELECT COALESCE(MIN_AMT, 0)
275200120411                 INTO :ln_MinAmt
275300120411                FROM MFAINVPTP INVPTP
275400120411               WHERE
275500120411                 INVPTP.INVESTMENT_CODE = :lc_InvestCode    AND
275600120411                 INVPTP.PLAN_TRANS      = :lc_PlanTrans     AND
275700120411                 INVPTP.CHEQUE_TYPE     = :lc_ChqType
275800120411              END-EXEC
275900120411              IF SQLCODE = ZEROS
276000120411                 IF ln_PACAmt < ln_MinAmt
276100120411                     MOVE ERR-INVALID-AMT-UNT TO COMM-RETURN-DESC
276200120411                     MOVE "BUY46" TO COMM-ERROR-PTR
276300120411                     PERFORM ESG-REJECTION THRU ERJ-EXIT
276400120411                 END-IF
276500120411              END-IF
276600120411           END-IF.
276700120411
276800120411       GMC-EXIT.
276900120411           EXIT.
277000120410      * RFS97573 - End
277100040321
277200040321       GET-MIN-PURCHASE.
277300041201      ****************************************************************
277400041201      * ROUTINE: G E T   M I N I M U M   P U R C H A S E
277500041201      * PURPOSE: The purpose of this routine is to check minimum
277600040321      *        : allowable purchase for a fund.
277700110313      ****************************************************************
277800110313      *Rfs89055 - Start
277900110313           IF Comm-Esb-Process = lncc_Y
278000110313           AND Trans-Type-Code OF Trans-Rec = lncc_MFR
278100110313               GO TO GMP-EXIT
278200110313           END-IF.
278300041201      *Rfs89055 - End
278400041108R24515     MOVE "N" TO WS-LAST-UNIT-PRICE-FOUND.
278500120817           MOVE ZEROES TO WS-TOT-AMOUNT.
278600041108           IF COMM-SPLIT-OPTION-RULE NOT = "$"
278700041108              IF UNIT-PRICE OF INV-LAST-UNIT-PRICE-REC IS NOT NUMERIC
278800041108              OR UNIT-PRICE OF INV-LAST-UNIT-PRICE-REC NOT > 0
278900041108                GO TO GMP-EXIT
279000041108              END-IF
279100041108           END-IF.
279200041108           IF COMM-SPLIT-OPTION-RULE = "U"
279300041108              COMPUTE WS-TOT-AMOUNT ROUNDED =
279400041108                      UNIT-PRICE OF INV-LAST-UNIT-PRICE-REC *
279500041108                      AMOUNT-13 OF ESG-OE-DTL-REC
279501210914118453        IF NETWORK-ID OF ESG-OE-DTL-REC = lnc_BULK
279502210914118453          COMPUTE WS-TOT-AMOUNT ROUNDED =
279503210914118453                UNIT-PRICE OF INV-LAST-UNIT-PRICE-REC *
279504210914118453                COMM-BULK-AMOUNT
279505210914118453        END-IF
279600041201           END-IF.
279700041201R24515     IF COMM-SPLIT-OPTION-RULE = "$"
279800041201  ¦           MOVE GROSS-AMT OF TRANS-REC TO WS-TOT-AMOUNT
279900041201  ¦        END-IF.
280000040421R24515     MOVE "Y" TO WS-LAST-UNIT-PRICE-FOUND.
280100040321
280200040328           INITIALIZE WS-PARM-PTMIN.
280300040328           MOVE ACCOUNT-NO OF ACCOUNT-REC TO
280400040328                              WS-PTMIN-ACCOUNT-NO.
280500040328           MOVE INVESTMENT-CODE OF INVESTMENT-REC TO
280600040321                                   WS-PTMIN-INVESTMENT-CODE.
280700040424           MOVE "BUY" TO WS-PTMIN-PLAN-TRANS.
280800040424           MOVE PRODUCT-TYPE-RULE OF PRODUCT-TYPE-CODES-REC TO
280900080305                WS-PTMIN-PRODUCT-RULE.
28100013022545781      MOVE WS-TOT-AMOUNT TO  WS-PTMIN-MIN-AMT.
281100130225      *RFS112072 - Begin
281200130225           MOVE DEALER-CODE OF TRANS-REC     TO
281300130225                              WS-PTMIN-DEALER-CODE.
281400130225           MOVE DEALER-REP-CODE OF TRANS-REC TO
281500130807                              WS-PTMIN-DEALER-REP-CODE .
281600130225117763     MOVE ZEROES TO  PTMIN-OutAccount.
281700180615      *RFS112072 - End
281800190121176315     MOVE Trade-Date OF Trans-Rec TO WS-PTMIN-TRADE-DATE.
281900190121      * RFS179709 - Starts
282000190121           IF  In-cash-Transfer
282100190121             PERFORM VALIDATE-INVMINFUNCTIONCODE
282200190122           END-IF.
282300180615      *RFS179709- Ends
282400190122
282500040427179709     IF lb_ICTWMINNo
282600040321           CALL "XINRRPTMIN" USING
282700040321                                    WS-PTMIN-ACCOUNT-NO
282800040321                                    WS-PTMIN-INVESTMENT-CODE
282900040321                                    WS-PTMIN-PLAN-TRANS
283000040321                                    WS-PTMIN-CHEQUE-TYPE
283100130225                                    WS-PTMIN-PRODUCT-RULE
283200130225113777*                             WS-PTMIN-MIN-AMT.
283300130225113777                              WS-PTMIN-MIN-AMT
283400130225112072                              WS-PTMIN-DEALER-CODE
283500130806112072                              WS-PTMIN-DEALER-REP-CODE
283600130806      * RFS126078 - Start
283700130806      * RFS117763 - Start
283800130806113777*                             WS-PTMIN-ACC-AMT.
283900130806                                    WS-PTMIN-ACC-AMT
284000130806                                    WS-PTMIN-OutAccount
284100130806                                    WS-PTMIN-OutTransType
284200180615                                    WS-PTMIN-OutTransOrigCode
284300180618176315*                             WS-PTMIN-OutContrRedemCode.
284400180712176315                              WS-PTMIN-OutContrRedemCode
284500190121176315                              WS-PTMIN-TransMode
284600190121176315*179709                       WS-PTMIN-INOUT-DATA.
284700130806179709                              WS-PTMIN-INOUT-DATA
284800130806
284900130806           IF WS-PTMIN-CHEQUE-TYPE   = "S56"
285000130806              MOVE "S56"            TO COMM-ERROR-PTR
285100130806              MOVE ERR-INVALID-PURCHASE TO COMM-RETURN-DESC
285200130828              PERFORM ESG-REJECTION THRU ERJ-EXIT
285300190121126727        GO TO GMP-EXIT
285400130806179709     END-IF
285500130806           END-IF.
285600130806      * RFS117763 - End
285700040321      * RFS126078 - End
285800080304
28590008030445781s***Validation is now done against the Cheque-Type returned
286000080304  ¦   *    IF WS-TOT-AMOUNT < WS-PTMIN-MIN-AMT
28610004032645781e     IF WS-PTMIN-CHEQUE-TYPE NOT = " "
286200040602              MOVE ERR-INVALID-AMT-UNT TO COMM-RETURN-DESC
286300040328              MOVE "BUY14" TO COMM-ERROR-PTR
286400040321              PERFORM ESG-REJECTION THRU ERJ-EXIT
286500040321           END-IF.
286600040321
286700040321       GMP-EXIT.
286800040328           EXIT.
286900040321      /
287000040321       GET-MAX-ANNUAL-PUR-LIMIT.
287100041201      ****************************************************************
287200041201      * ROUTINE: G E T   M A X   A N N U A L   P U R   L I M I T
287300041201      * PURPOSE: The purpose of this is maximum allowable contribution
287400040321      *        : for a specific fund. DJT development.
287500110313      ****************************************************************
287600110313      *Rfs89055 - Start
287700110313           IF Comm-Esb-Process = lncc_Y
287800110313           AND Trans-Type-Code OF Trans-Rec = lncc_MFR
287900110313               GO TO MAP-EXIT
288000110313           END-IF.
288100041201      *Rfs89055 - End
288200041201R24515     IF WS-LAST-UNIT-PRICE-FOUND NOT = "Y"
288300041201              GO TO MAP-EXIT
288400041108R24515     END-IF.
288500040328
288600040328            MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC TO
288700040321                 ACCOUNT-TYPE-CODE OF ACCTYP-CONTRED-CODE-LMT-RD-REC.
288800040328            MOVE CONTR-REDEM-CODE OF TRANS-REC TO
288900040328                 CONTR-REDEM-CODE OF ACCTYP-CONTRED-CODE-LMT-RD-REC.
289000040321            READ ACCTYP-CONTRED-CODE-LIMIT-RD
289100040322             INVALID KEY
289200040321              GO TO MAP-EXIT
289300040321            END-READ.
289400040321            INITIALIZE LMT-PARMS
289500040321                       LMT-REJECTION-CODE
289600040321                       LMT-AMOUNT.
289700040328
289800040328            MOVE INVESTOR-NO OF ACCOUNT-REC TO LMT-INVESTOR.
289900040328            MOVE ACCOUNT-NO OF ACCOUNT-REC TO LMT-ACCOUNT.
290000040321            MOVE ACCOUNT-TYPE-CODE OF ACCTYP-CONTRED-CODE-LMT-RD-REC TO
290100040328                                      LMT-ACCOUNT-TYPE.
290200040321            MOVE CONTR-REDEM-CODE OF ACCTYP-CONTRED-CODE-LMT-RD-REC TO
290300040328                                     LMT-CONTR-REDEM-CODE.
290400040321            MOVE LEVEL-CODE OF ACCTYP-CONTRED-CODE-LMT-RD-REC TO
290500040328                               LMT-CHECK-LEVEL.
290600040321            MOVE CONTR-LIMIT OF ACCTYP-CONTRED-CODE-LMT-RD-REC TO
290700040424                                LMT-CONTR-LIMIT.
290800041201            MOVE WS-TOT-AMOUNT TO LMT-AMOUNT.
290900040321            CALL "CHKCNTL" USING LMT-PARMS,
291000040321                                 LMT-REJECTION-CODE,
291100040321                                 LMT-AMOUNT.
291200040326            IF LMT-REJECTION-CODE NOT = "00"
291300040602               MOVE ERR-INVALID-PURCHASE TO COMM-RETURN-DESC
291400040328               MOVE "BUY15" TO COMM-ERROR-PTR
291500040321               PERFORM ESG-REJECTION THRU ERJ-EXIT
291600040321            END-IF.
291700040321
291800040321       MAP-EXIT.
291900040328           EXIT.
292000040321      /
292100040321       PROCESS-CAPPING-RULES.
292200040321      ***** This routine is executed if the account no is not given.
292300040321      ***** For contribution code if the account is given we need
292400040321      ***** to find the account designation & also, check if the client
292500120329      ***** put the wrong account type in the order entry.
292600040321
292700040321           IF NOT PURCHASE-TRANSACTION
292800040321               GO TO PCR-EXIT
292900040321           END-IF.
293000040328
293100040321           IF COMM-CAPPING-LEVEL-INDICATOR NOT = "S"
293200040321              GO TO PCR-EXIT
293300120411           END-IF.
293400120411
293500120411      *Rfs97573 Begins
293600120411           PERFORM GET-INVEST-TRANS-CONTROL.
293700120527           IF lc_TradeSubType NOT = " "
293800120527      *Rfs109991  Begins
293900120527      *       IF lc_TradeSubType = lncc_N OR
294000120527      *          (STANDING-ORDER OF ESG-OE-DTL-REC = lncc_Y
294100120527      *           AND lc_TradeSubType NOT = lncc_S) OR
294200120527      *          (STANDING-ORDER OF ESG-OE-DTL-REC NOT = lncc_Y
294300120527              IF (STANDING-ORDER OF ESG-OE-DTL-REC NOT = lncc_Y
294400120411      *Rfs109991  Ends
294500120411                 AND lc_TradeSubType NOT = lncc_R)
294600120411                   MOVE ERR-STOP-PURCHASE TO COMM-RETURN-DESC
294700120411                   MOVE "BUY45"           TO COMM-ERROR-PTR
294800120527                   PERFORM ESG-REJECTION THRU ERJ-EXIT
294900120527      *Rfs109991  Begins
295000120527              ELSE
295100120527              IF (STANDING-ORDER OF ESG-OE-DTL-REC = lncc_Y
295200120527                 AND lc_TradeSubType NOT = lncc_S)
295300120527                   MOVE lc-Inv-DlrStandOrder-260 TO COMM-RETURN-DESC
295400120527                   MOVE "BUY47"                  TO COMM-ERROR-PTR
295500120527                   PERFORM ESG-REJECTION THRU ERJ-EXIT
295600120527              END-IF
295700120527      *Rfs109991  Ends
295800120411              END-IF
295900120411           END-IF.
296000040321      *Rfs97573 Ends
296100040321
296200040321       PCR-CALL-CAP-PROGRAM.
296300040321           INITIALIZE  COMM-CAP-AREA.
296400040322
296500040322           MOVE MANAGEMENT-COMPANY-CODE OF ESG-OE-DTL-REC TO
296600040328                COMM-CAP-MGMT-CO-CODE.
296700040322           IF ACCOUNT-NO OF ACCOUNT-REC NOT NUMERIC
296800040321             MOVE ZEROES TO COMM-CAP-ACCOUNT-NO
296900040328           ELSE
297000040328             MOVE ACCOUNT-NO OF ACCOUNT-REC TO COMM-CAP-ACCOUNT-NO
297100040321           END-IF.
297200040322           MOVE ZEROES TO COMM-CAP-INVESTOR-NO.
297300040321           MOVE INVESTMENT-GROUP-CODE OF INVESTMENT-REC
297400040321                  TO COMM-CAP-INVESTMENT-GROUP.
297500040328           MOVE INVESTMENT-CODE OF TRANS-REC TO COMM-CAP-INVESTMENT-CODE.
297600040321           MOVE SOCIAL-INSURANCE-NO OF INVESTOR-REC
297700040328                                  TO COMM-CAP-SIN.
297800040321           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE-REC
297900040321               TO COMM-CAP-NOM-ACTTYPE.
298000040321           MOVE TRANS-TYPE-REC OF ESG-OE-DTL-REC
298100040322               TO COMM-CAP-TRANS-TYPE.
298200040321           MOVE SPACES TO COMM-CAP-FROM-INVESTMENT.
298300040321           MOVE DEALER-CODE OF TRANS-REC TO COMM-CAP-DEALER-CODE.
298400040321
298500040427           MOVE "Y" TO COMM-CAP-IND.
298600040321           CALL "OECAPRULES" USING COMM-CAP-AREA.
298700040321
298800120411           IF COMM-CAP-IND = "Y"
298900120411R97573*        MOVE ERR-FUND-NOT-ACTIVE TO COMM-RETURN-DESC
299000040602R97573         MOVE ERR-FUND-CAPPED TO COMM-RETURN-DESC
299100040328               MOVE "BUY16" TO COMM-ERROR-PTR
299200040322               PERFORM ESG-REJECTION THRU ERJ-EXIT
299300040321           END-IF.
299400040321
299500040321       PCR-EXIT.
299600040328           EXIT.
299700120411      /
299800120411      *Rfs97573 Begins
299900120411       GET-INVEST-TRANS-CONTROL.
300000120411
300100120411           INITIALIZE  lc_TradeSubType, lc_InvestCode.
300200120411           MOVE INVESTMENT-CODE OF TRANS-REC TO lc_InvestCode.
300300120411           EXEC SQL
300400120411              SELECT COALESCE(TRADE_SUB_TYPE, " ")
300500120411              INTO   :lc_TradeSubType
300600120411              FROM   MFAIVTRCP
300700120411              WHERE  INVESTMENT_CODE = :lc_InvestCode
300800120411                     AND TRANS_TYPE_CODE = :lnc_BUY
300900120411           END-EXEC.
301000120411      *Rfs97573 Ends
301100120411
301200040328      /
301300110313       VALIDATE-SEG-FUND.
301400040328R84184     CONTINUE.
301500040328      ***** These validations are specific to seg funds
301600040328       VSF-SEG-AUTHORITY.
301700040427      ***** Seg authority.
301800040328           CALL "OESEGAUTH".
301900040328           IF COMM-RETURN-CODE = "99"
302000040328              GO TO VSF-EXIT
302100040328           END-IF.
302200040328
302300040328       VSF-ANNUITANT-AGE-LIMIT.
302400150428      *****Get Annuitant Age Limit.
302500150428
302600150428      *RFS141445 Starts
302700150428      *    CALL "OEAGELIMIT".
302800150428      *    IF COMM-RETURN-CODE = "99"
302900150428      *       GO TO VSF-EXIT
303000150428      *    END-IF.
303100150428
303200150428           PERFORM CALL-FXTRNANNAG.
303300150428           IF lc_ReturnErrorCode  NOT = "00"
303400150428              STRING "BUX"             DELIMITED BY SIZE
303500150428                    lc_ReturnErrorCode DELIMITED BY SIZE
303600150428                INTO                   COMM-ERROR-PTR
303700150428              END-STRING
303800210804      *RFS187471 - Starts
303900210809              IF lc_ReturnErrorCode = lncc_05
304000210804                 MOVE lc-Investor-Age-Error-195  TO COMM-RETURN-DESC
304100210804              ELSE
304200210804      *RFS187471 - End
304300150428              MOVE ERR-INVALID-PURCHASE TO COMM-RETURN-DESC
304400210804187471        END-IF
304500150428              PERFORM ESG-REJECTION THRU ERJ-EXIT
304600150428              GO TO VSF-EXIT
304700150428           END-IF.
304800060626      *RFS141445 End
304900060626
30500006062632873  Vsf-Seg-Attributes.
30510006062632873 *****Check Seg attributes of the investment.
30520006062632873      PERFORM Validate-Seg-Attributes.
30530006062632873      IF Comm-Return-Code = "99"
30540006062632873         GO TO Vsf-Exit
30550008063032873      END-IF.
305600131001
305700131001      * RFS 119020 starts.
305800131001       Vsf-Annuitant-Type.
305900131001           PERFORM Validate-Annuitant-Type.
306000131001           IF Comm-Return-Code = "99"
306100131001              GO TO Vsf-Exit
306200131001           END-IF.
306300131001      * RFS 119020 ends.
306400080630
30650008063050474  Vsf-GLWB-Attributes.
306600080721  |   *****Check GLWB attributes of the investment.
306700080721  |        MOVE INVESTMENT-CODE OF INVESTMENT-REC TO
306800080721  |                      INVESTMENT-CODE OF INVESTMENT-SEG.
306900080721  |        READ INVESTMENT-SEG
307000080721  |          INVALID KEY
307100080721  |           GO TO Vsf-Exit
307200200407  |         END-READ.
307300200415      *RFS185170 - Start.
307400200407           IF lb_AccountLevelGLWBYes AND Comm-Esb-Process NOT = "Y"
307500200407              PERFORM RiderValidation
307600200407           END-IF.
307700200407  |   *    IF INVESTMENT-SERIES OF INVESTMENT-SEG  NOT = SPACES
307800200407           IF INVESTMENT-SERIES OF INVESTMENT-SEG  NOT = SPACES OR
307900200407              lb_AccountLevelGLWBYes
308000080721      *RFS185170 - End.
308100080721  |           PERFORM Validate-GLWB-Attributes
308200080721  |           IF Comm-Return-Code = "99"
308300080721  |              GO TO Vsf-Exit
308400080721  |           END-IF
30850020032650474      END-IF.
308600110313
308700110313      * RFS89055 - Begins
308800110313       VSF-INVEST-MATURITY-DATE-VAL.
308900110313      *****Investment Maturity Date Range Validation
309000110313           IF NOT SWITCH-TRANSACTION
309100110313              INITIALIZE pc_ChkinvmdtParms
309200110313              MOVE ACCOUNT-NO OF TRANS-REC
309300110313                TO pc_ChkinvmdtAcctNo
309400110313              MOVE INVESTMENT-CODE OF TRANS-REC
309500110313                TO pc_ChkinvmdtInvestCd
309600110313              MOVE COMM-SCREEN-CODE
309700110313                TO pc_ChkinvmdtScreenCd
309800110313              MOVE TRADE-DATE OF TRANS-REC
309900110313                TO pc_ChkinvmdtTradeDate
310000110313
310100110313              CALL "CHKINVMDT"  USING pc_ChkinvmdtPassParms
310200110313                                      pc_ChkinvmdtRejectCode
310300110313                                      pc_ChkinvmdtRejectDescr
310400110313              IF pc_ChkinvmdtRejectCode  NOT =  "00"
310500110313                 MOVE ERR-INVALID-FUND  TO COMM-RETURN-DESC
310600110313                 MOVE "BUY30"           TO COMM-ERROR-PTR
310700110313                 PERFORM ESG-REJECTION THRU ERJ-EXIT
310800110313                 GO TO VSF-EXIT
310900110313              END-IF
311000110313           END-IF.
311100110313      * RFS89055 - Ends
311200040328
311300040824       VSF-EXIT.
311400060626           EXIT.
311500060626
31160006062632873  Validate-Seg-Attributes.
31170006062632873      MOVE lncc_ProgramName TO pc_FunctionToProcess.
31180006062632873      MOVE Account-No OF Trans-Rec TO pi_AccountNo.
31190006062632873      MOVE Investment-Code OF Trans-Rec TO pc_InvestmentCode.
31200009122432873      MOVE Trade-Date OF Trans-Rec To pi_TradeDate.
312100091224      * RFS64263 - Begin: added new parameters
312200091224           MOVE reversal-code   OF Trans-Rec TO pc_ReversalCode
312300091224           MOVE placement-date  OF Trans-Rec TO pi_placementDate
312400091224           MOVE trans-no        OF Trans-Rec TO pi_transNo
312500100629      * RFS64263 - End
312600100629
312700100629      * RFS81399 Begins
312800100629           MOVE Zeroes    TO    pi_AccountOther.
312900100629           MOVE Spaces    TO    pc_InvestmentOther.
313000160808      * RFS81399 Ends
313100160808      *RFS159042 - Starts
313200160808           IF Comm-Esb-Process = lncc-Y
313300160808              And Msg-Id  OF  BLK-Acct-Contr-Annu-ExtRec NOT = SPACES
313400160808              And Account-No  OF BLK-Acct-Contr-Annu-ExtRec =
313500160808                  Account-No  OF ACCOUNT-REC
313600160808              And Contract-No OF BLK-Acct-Contr-Annu-ExtRec > 0
313700160808                  MOVE lncc_Annuity  TO pc_FunctionToProcess
313800160808                  MOVE Contract-No   OF BLK-Acct-Contr-Annu-ExtRec
313900160808                                     TO pi_AccountOther
314000160808           END-IF.
314100060626      *RFS159042 - Ends
314200060626
31430006062632873      CALL "FXCHKSEGAT" USING pc_FunctionToProcess,
31440006062632873                              pi_InvestorNo,
31450006062632873                              pi_AccountNo,
31460006062632873                              pc_InvestmentCode,
31470006062632873                              pi_TradeDate,
31480006062632873                              pi_SystematicPlanSeqNo,
31490006062632873                              pi_InstructionDate,
31500009122432873                              pi_InstructionNo,
315100091224      * RFS64263 - Begin: added new parameters
315200091224                                   pc_ReversalCode,
315300091224                                   pi_placementDate,
315400091224                                   pi_transNo,
315500060630      * RFS64263 - End
31560010062932873                              pc_SegAttReturnMessage,
31570010062932873                              pc_SegAttReturnCode,
315800100629      * RFS81399 Begins
315900100629                                   pi_AccountOther,
316000100629                                   pc_InvestmentOther.
316100060626      * RFS81399 Ends
316200100105
31630010010832873      IF pncc_SegAttReturnCodeFail
316400100108      * RFS64263 - Begin
316500100108            IF pncc_SegAttYoungerAnnuit
316600100108              MOVE ln_Invstr_age_err       to Comm-Return-Desc
316700100108            ELSE
316800100105      * RFS64263 - End
31690010010832873         MOVE Err-Invalid-Fund TO Comm-Return-Desc
317000100108      * RFS64263 - Begin
317100100108            END-IF
317200100108      * RFS64263 - End
31730010010532873         MOVE "BUY23" TO Comm-Error-Ptr
31740010010532873         PERFORM Esg-Rejection THRU Erj-Exit
31750008063032873      END-IF.
317600131001
317700131001      * RFS 119020 starts
317800131001       Validate-Annuitant-Type.
317900131001           MOVE Account-No of Trans-Rec TO pi_AcctNo.
318000131001           MOVE Investment-Code of Trans-Rec TO pc_InvCd.
318100131001           MOVE "CHKANN" TO pc_Mode.
318200131001           CALL "FXCHKANN" using pi_AcctNo,
318300131001                                 pc_InvCd,
318400131001                                 pc_Mode,
318500131001                                 pc_RtnCd.
318600131001           IF pc_RtnCd NOT = "00"
318700131001             MOVE ERR-INVALID-FUND TO COMM-RETURN-DESC
318800200326             MOVE "BUY59" TO COMM-ERROR-PTR
318900131001             PERFORM ESG-REJECTION THRU ERJ-EXIT
319000131001           END-IF.
319100131001      * RFS 119020 ends
319200200326
319300200326      * RFS185170 - Start.
319400200425       RiderValidation.
319500200425           INITIALIZE pc_ACCGLWBV_UserID
319600200425                      pc_ACCGLWBV_ReturnCode.
319700200425           MOVE lncc_ProgramName
319800200425             TO pc_ACCGLWBV_CalledBy.
319900200425           MOVE ACCOUNT-NO       OF TRANS-REC
320000200425             TO pi_ACCGLWBV_TargetAccNo.
320100200425           MOVE INVESTMENT-CODE  OF TRANS-REC
320200200326             TO pc_ACCGLWBV_TargetInvCode.
320300200425
320400200425           CALL "FXACCGLWBV" USING pc_ACCGLWBV_CalledBy,
320500200425                                   pc_ACCGLWBV_UserID,
320600200425                                   pi_ACCGLWBV_TargetAccNo,
320700200425                                   pc_ACCGLWBV_TargetInvCode,
320800200326                                   pc_ACCGLWBV_ReturnCode.
320900200425
321000200326           IF NOT pb_ACCGLWBV_Allow
321100200326              MOVE ERR-INELIGIABLE-XACTION TO Comm-Return-Desc
321200200326              MOVE "BUY64" TO Comm-Error-Ptr
321300200326              PERFORM Esg-Rejection THRU Erj-Exit
321400200326              IF Comm-Return-Code = "99"
321500200326                 GO TO Vsf-Exit
321600200326              END-IF
321700200326           END-IF.
321800200326      * RFS185170 - End.
321900080630
32200008063050474  Validate-GLWB-Attributes.
322100080630  |        MOVE Account-No       OF Trans-Rec TO pi_GLWBVldAccountNo.
322200080714  |        MOVE Investment-Code  OF Trans-Rec TO pc_GLWBVldInvestCode.
322300110311  |        MOVE Trade-Date       OF Trans-Rec TO pi_GLWBVldTradeDate.
322400080714  |        MOVE " "              TO pc_GLWBVldSameAcctSwitchFlag.
322500080702  |
322600080702  |        CALL "FXGLWBVLD"  USING pi_GLWBVldPlacementDate     ,
322700080702  |                                pi_GLWBVldTransNo           ,
322800080702  |                                pc_GLWBVldContMatchFlag     ,
322900080702  |                                pi_GLWBVldAccountNo         ,
323000080702  |                                pi_GLWBVldContractNo        ,
323100080702  |                                pc_GLWBVldYearEndFlag       ,
323200080714  |                                pc_GLWBVldInvestCode        ,
323300080702  |                                pi_GLWBVldTradeDate         ,
323400080702  |                                pc_GLWBVldReversalCode      ,
323500080702  |                                pc_GLWBVldSameAcctSwitchFlag,
323600080702  |                                pi_GLWBVldEligDate          ,
323700080702  |                                pi_GLWBVldForceDate         ,
323800080702  |                                pn_GLWBVldGWAPercent        ,
323900080702  |                                pi_GLWBVldAnnuitantAge      ,
324000080702  |                                pc_GLWBVldInitPurchaseFlag  ,
324100080630  |                                pc_GLWBVldRejectionCode.
324200080630  |
324300090807  |        IF not pb_GLWBVldRejectionOK
32440009080772335 *       MOVE ln_Invstr_age_err       to Comm-Response-Data
32450008063072335         MOVE ln_Invstr_age_err       to Comm-Return-Desc
324600080630  |           MOVE "BUY24" TO Comm-Error-Ptr
324700080630  |           PERFORM Esg-Rejection THRU Erj-Exit
32480004082450474      END-IF.
324900040824      /
325000040824R23467 VALIDATE-PHANTOM-FUND.
325100040824   |  ****************************************************************
325200040824   |  * ROUTINE: Validate Phantom Fund                               *
325300040824   |  * PURPOSE: These validations are specific to phantom funds.    *
325400040824   |  ****************************************************************
325500040824   |  ***** Check if the screen edit REBAL exists.
325600040824   |       INITIALIZE MFAEDTSCP OF SCREEN-EDITS-ALLOWED-REC.
325700040824   |       MOVE WS-REBAL-SCREEN-CODE TO
325800040824   |                    SCREEN-CODE OF SCREEN-EDITS-ALLOWED-REC.
325900040824   |       MOVE WS-REBAL-EDIT-CODE TO
326000040824   |                    EDIT-CODE OF SCREEN-EDITS-ALLOWED-REC.
326100040824   |       MOVE WS-REBAL-LEVEL-CODE TO
326200040824   |                    LEVEL-CODE OF SCREEN-EDITS-ALLOWED-REC.
326300040824   |       PERFORM GET-SCREEN-EDITS-ALLOWED.
326400040824   |       IF WS-SEA-RETURN-CODE = "99"
326500040824   |          GO TO VPF-EXIT
326600040824   |       END-IF.
326700040830   |
326800040824   |  ***** If the screen edit REBAL exists, call FXREBAL.
326900040824   |       MOVE ACCOUNT-NO OF ACCOUNT-REC TO
327000040824   |                          WS-FXREBAL-ACCOUNT-NO.
327100040826   |       MOVE SPACES     TO WS-FXREBAL-UPDATE-FILE.
327200040824   |       MOVE "N"        TO WS-FXREBAL-SQL-LOG.
327300040824   |       MOVE SPACES     TO WS-FXREBAL-RETURN-CODE.
327400040824   |       CALL "FXREBAL" USING
327500040824   |                             WS-FXREBAL-ACCOUNT-NO
327600040824   |                           , WS-FXREBAL-SCREEN-CODE
327700040824   |                           , WS-FXREBAL-UPDATE-FILE
327800040824   |                           , WS-FXREBAL-SQL-LOG
327900040824   |                           , WS-FXREBAL-RETURN-CODE
328000040824   |       END-CALL.
328100040830   |
328200040831   |  ***** If return-code from FXREBAL is O.K., and the
328300040830   |  *****  Update-File = 'Y', write Account-Attributes rec.
328400040830   |       IF WS-FXREBAL-RETURN-CODE = "99"    OR
328500040824   |          WS-FXREBAL-UPDATE-FILE NOT = "Y"
328600040824   |          GO TO VPF-EXIT
328700040824   |       END-IF.
328800040824   |
328900040824   |       INITIALIZE MFAACCATP OF ACCOUNT-ATTRIBUTES-REC.
329000040824   |
329100040824   |       MOVE ACCOUNT-NO OF ACCOUNT-REC
329200040824   |         TO ACCOUNT-NO OF ACCOUNT-ATTRIBUTES-REC.
329300040824   |
329400040824   |       MOVE "REBAL"
329500040824   |         TO ACCOUNT-ATTRIBUTE-CODE OF ACCOUNT-ATTRIBUTES-REC.
329600040831   |
329700040824   |       MOVE "Y" TO COMM-WRITE-ACCOUNT-ATTRIBUTES.
329800040824   |
329900040824   |   VPF-EXIT.
330000040328R23467     EXIT.
330100040328      /
330200040328       PROCESS-RESP-SPECIFICS.
330300040328      ***** Process RESP specifics
330400040328           PERFORM CHECK-SPECIMEN-PLAN-RTN THRU CSP-EXIT
330500040328           IF COMM-RETURN-CODE = "99"
330600040328              GO TO PRS-EXIT
330700040328           END-IF.
330800040328
330900040328           IF NOT CLIENT-ACCOUNT
331000040328              GO PRS-EXIT
331100040328           END-IF.
331200040328
331300040328           MOVE ACCOUNT-NO OF ACCOUNT-REC TO
331400040328                ACCOUNT-NO OF ACCOUNT-BEN-SPLIT-RD-REC
331500040328           IF REDEMPTION-TRANSACTION
331600040328              MOVE "R" TO BENEFICIARY-SPLIT-DEFAULT
331700040328                          OF ACCOUNT-BEN-SPLIT-RD-REC
331800040328           ELSE
331900040328              MOVE "P" TO BENEFICIARY-SPLIT-DEFAULT
332000040328                          OF ACCOUNT-BEN-SPLIT-RD-REC
332100040328           END-IF.
332200040328           MOVE ZEROES TO HRDC-FILE-DATE
332300040328                          OF ACCOUNT-BEN-SPLIT-RD-REC
332400040328           READ ACCOUNT-BENEFICIARY-SPLIT-RD
332500040328            INVALID KEY
332600040328             INITIALIZE MFAACCBPP OF ACCOUNT-BEN-SPLIT-RD-REC
332700040328           END-READ.
332800040329
332900040328           INITIALIZE MFATRNRFP OF TRANS-RESP-DETAILS-REC
333000040329           MOVE PLACEMENT-DATE OF TRANS-REC TO
333100040328                PLACEMENT-DATE OF TRANS-RESP-DETAILS-REC
333200040329           MOVE TRANS-NO OF TRANS-REC TO
333300040328                TRANS-NO OF TRANS-RESP-DETAILS-REC
333400040329           MOVE ACCOUNT-NO OF TRANS-REC  TO
333500040328                ACCOUNT-NO OF TRANS-RESP-DETAILS-REC
333600040329           MOVE BENEFICIARY-SPLIT-CODE OF ACCOUNT-BEN-SPLIT-RD-REC TO
333700040328                BENEFICIARY-SPLIT-CODE OF TRANS-RESP-DETAILS-REC.
333800040329
333900040328           MOVE "Y" TO COMM-WRITE-TRANS-RESP-DETAILS.
334000110313
334100110313      * RFS89055 - Begins
334200110313      *** RESP Validations
334300110313           MOVE BENEFICIARY-SPLIT-CODE OF ACCOUNT-BEN-SPLIT-RD-REC
334400110313             TO lc_BeneficiarySplitCode.
334500110313
334600110313           IF  TRADE-DATE OF TRANS-REC >
334700110313               CONTRIBUTION-END-DATE OF ACCOUNT-RESP-REC
334800110313           AND CONTRIBUTION-END-DATE OF ACCOUNT-RESP-REC > 0
334900110313               MOVE ERR-INVALID-CONTRD  TO COMM-WARN-DESC
335000110313               MOVE "BUY31"             TO COMM-ERROR-PTR
335100110313               PERFORM ESG-WARNING    THRU EWN-EXIT
335200110313           END-IF.
335300110313
335400110313           IF NOMINEE OF ACCOUNT-REC = lncc_N
335500110313              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC
335600110313                TO lc_AccountTypeCode
335700110313           ELSE
335800110313              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE-REC
335900110313                TO lc_AccountTypeCode
336000110313           END-IF.
336100110313           MOVE CONTR-REDEM-CODE OF TRANS-REC
336200110313             TO lc_ContrRedemCode.
336300110313           PERFORM GET-CONTR-REDEM-CODE-RULE.
336400110313           IF COMM-RETURN-CODE = "99"
336500110313              GO TO PRS-EXIT
336600110313           END-IF.
336700110313
336800110313           IF  lc_ContrRedemCodeRule = "14"
336900110313           AND lc_BeneficiarySplitCode = SPACES
337000110313           AND BENEFICIARY-SPLIT-DEFAULT OF ACCOUNT-BEN-SPLIT-RD-REC
337100110313               NOT =  "P"
337200110313               MOVE ERR-INVALID-BENE-INDICATOR  TO COMM-WARN-DESC
337300110313               MOVE "BUY32"                     TO COMM-ERROR-PTR
337400110313               PERFORM ESG-WARNING  THRU EWN-EXIT
337500110313           END-IF.
337600110313
337700110313           IF  UNIT-AMT   OF TRANS-REC > 0
337800110313           AND TRADE-DATE OF TRANS-REC > 0
337900110313           AND TRADE-DATE OF TRANS-REC < PDDA-AS-AT-DATE
338000110313               MOVE TRADE-DATE OF TRANS-REC
338100110313                 TO li_TradeDate
338200110313               MOVE INVESTMENT-CODE OF TRANS-REC
338300110313                 TO lc_InvestmentCode
338400110313               PERFORM GET-UNIT-PRICE
338500110313               IF lb_RecordFoundNo
338600110313                  MOVE UNIT-PRICE OF INV-LAST-UNIT-PRICE-REC
338700110313                    TO ln_UnitPrice
338800110313               END-IF
338900110313           END-IF.
339000110313
339100110313           IF NOMINEE OF ACCOUNT-REC = lncc_N
339200110313              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC
339300110313                TO lc_AccountTypeCode
339400110313           ELSE
339500110313              MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE-REC
339600110313                TO lc_AccountTypeCode
339700110313           END-IF.
339800110313           MOVE TRADE-DATE OF TRANS-REC  TO li_TaxDate.
339900110313           MOVE li_TaxYear               TO ln_TaxYear.
340000110313           PERFORM GET-ACCOUNT-TYPE-PARMS.
340100110313
340200110313           PERFORM GET-CONTR-REDEM-CODE-RULE-2.
340300110313           IF li_Count > 0
340400110313              MOVE ACCOUNT-NO OF ACCOUNT-REC
340500110313                TO li_AccountNo
340600110313              MOVE HRDC-FILE-DATE OF TRANS-RESP-DETAILS-REC
340700110313                TO li_HrdcFileDate
340800110313              PERFORM DECLARE-CURSOR-C1-ACCT-BEN-SPL
340900110313
341000110313              PERFORM UNTIL lb_C1AcctBenSplEofYes
341100110313                PERFORM READ-CURSOR-C1-ACCT-BEN-SPL
341200110313                INITIALIZE ln_YtdContrDeductAmt
341300110313                           ln_LtdContrDeductAmt
341400110313                MOVE lcu_BeneficiarySeqNo
341500110313                  TO ln_BeneficiarySeqNo
341600110313                PERFORM DECLARE-CURSOR-C2-ACCT-BEN-FIN
341700110313
341800110313                PERFORM UNTIL lb_C2AcctBenFinEofYes
341900110313                  PERFORM READ-CURSOR-C2-ACCT-BEN-FIN
342000110313                  IF lcu_ContrRedemCodeRule = "1"
342100110313                     COMPUTE ln_YtdContrDeductAmt =
342200110313                             ln_YtdContrDeductAmt +
342300110313                             lcu_YtdContrDeductAmt
342400110313                  END-IF
342500110313                  COMPUTE ln_LtdContrDeductAmt =
342600110313                          ln_LtdContrDeductAmt +
342700110313                          lcu_LtdContrDeductAmt
342800110313                END-PERFORM
342900110313
343000110313                IF GROSS-AMT OF TRANS-REC > 0
343100110313                   COMPUTE ln_YtdContrDeductAmt ROUNDED =
343200110313                           ln_YtdContrDeductAmt +
343300110313                         ( GROSS-AMT OF TRANS-REC *
343400110313                           lcu_BeneficiaryPercent )
343500110313                   COMPUTE ln_LtdContrDeductAmt ROUNDED =
343600110313                           ln_LtdContrDeductAmt +
343700110313                         ( GROSS-AMT OF TRANS-REC *
343800110313                           lcu_BeneficiaryPercent )
343900110313                   IF  ln_YtdContrDeductAmt > ln_ContriLimit
344000110313                   AND lc_ContrRedemCodeRule  NOT =  "2"
344100110313                     SET lb_C1AcctBenSplEofYes    TO TRUE
344200110313                     MOVE ERR-XML-INV-BENE-SPLIT  TO COMM-RETURN-DESC
344300110313                     MOVE "BUY33"                 TO COMM-ERROR-PTR
344400110313                     PERFORM ESG-REJECTION THRU ERJ-EXIT
344500110313                   END-IF
344600110313                   IF  ln_LtdContrDeductAmt > ln_ContriLimit
344700110313                   AND lc_ContrRedemCodeRule  NOT =  "2"
344800110313                     SET lb_C1AcctBenSplEofYes    TO TRUE
344900110313                     MOVE ERR-XML-INV-BENE-SPLIT  TO COMM-RETURN-DESC
345000110313                     MOVE "BUY34"                 TO COMM-ERROR-PTR
345100110313                     PERFORM ESG-REJECTION THRU ERJ-EXIT
345200110313                   END-IF
345300110313                ELSE
345400110313                  IF UNIT-AMT OF TRANS-REC > 0
345500110313                     COMPUTE ln_YtdContrDeductAmt ROUNDED =
345600110313                             ln_YtdContrDeductAmt +
345700110313                           ( UNIT-AMT OF TRANS-REC *
345800110313                             ln_UnitPrice *
345900110313                             lcu_BeneficiaryPercent )
346000110313                     COMPUTE ln_LtdContrDeductAmt ROUNDED =
346100110313                             ln_LtdContrDeductAmt +
346200110313                           ( UNIT-AMT OF TRANS-REC *
346300110313                             ln_UnitPrice *
346400110313                             lcu_BeneficiaryPercent )
346500110313                     IF  ln_YtdContrDeductAmt > ln_ContriLimit
346600110313                     AND lc_ContrRedemCodeRule  NOT =  "2"
346700110313                       SET lb_C1AcctBenSplEofYes    TO TRUE
346800110313                       MOVE ERR-XML-INV-BENE-SPLIT  TO COMM-RETURN-DESC
346900110313                       MOVE "BUY35"                 TO COMM-ERROR-PTR
347000110313                       PERFORM ESG-REJECTION THRU ERJ-EXIT
347100110313                     END-IF
347200110313                     IF  ln_LtdContrDeductAmt > ln_ContriLimit
347300110313                     AND lc_ContrRedemCodeRule  NOT =  "2"
347400110313                       SET lb_C1AcctBenSplEofYes    TO TRUE
347500110313                       MOVE ERR-XML-INV-BENE-SPLIT  TO COMM-RETURN-DESC
347600110313                       MOVE "BUY36"                 TO COMM-ERROR-PTR
347700110313                       PERFORM ESG-REJECTION THRU ERJ-EXIT
347800110313                     END-IF
347900110313                  END-IF
348000110313                END-IF
348100110313              END-PERFORM
348200110313           END-IF.
348300110313
348400110313           IF COMM-SCREEN-CODE = lncc_TRNPURE
348500110313           AND COMM-GRNTNF-TRNPURE-EDIT-CODE = lncc_Y
348600110313              SET lb_RespGrantNo   TO TRUE
348700110313
348800110313              IF (lc_ContrRedemCodeRule = "5"   OR
348900110313                  lc_ContrRedemCodeRule = "15"  OR
349000110313                  lc_ContrRedemCodeRule = "16")
349100110313                SET lb_RespGrantYes  TO TRUE
349200110313              END-IF
349300110313
349400110313              IF  lb_RespGrantYes
349500110313              AND CLIENT-PAID-COMM OF ESG-OE-DTL-REC > 0
349600110313                  MOVE ERR-INVALID-COMMISS  TO COMM-RETURN-DESC
349700110313                  MOVE "BUY37"              TO COMM-ERROR-PTR
349800110313                  PERFORM ESG-REJECTION THRU ERJ-EXIT
349900110313                 GO TO PRS-EXIT
350000110313              END-IF
350100110313           END-IF.
350200110313      * RFS89055 - Ends
350300040328
350400040328       PRS-EXIT.
350500040328           EXIT.
350600040329      /
350700040331       PROCESS-GCM-SPECIFIC.
350800040331      *****************************************************************
350900040331      *              G              C             M                   *
351000040331      *    P R O C E S S   M A N A G E M E N T   S P E C I F I C      *
351100040331      *****************************************************************
351200040329           IF MANAGEMENT-COMPANY-SPECIFIC OF ESG-OE-DTL-REC = SPACES
351300040329              GO TO PGS-EXIT
351400040329           END-IF.
351500040331
351600040721           MOVE MANAGEMENT-COMPANY-SPECIFIC OF ESG-OE-DTL-REC TO
351700040329                           WS-MANAGEMENT-COMPANY-SPEC-GCM.
351800040329
351900040329           IF WS-CONTR-REDEM-CODE IS = SPACES
352000040329              GO TO PGS-EXIT
352100040329           END-IF.
352200040329
352300040329           MOVE WS-CONTR-REDEM-CODE TO CONTR-REDEM-CODE
352400040329                         OF TRANS-CONTR-REDEM-CODE-RD-REC.
352500040329
352600040329           READ TRANS-CONTR-REDEM-CODE-RD
352700040408                INVALID KEY
352800040602                MOVE ERR-INVALID-CONTRD TO COMM-RETURN-DESC
352900040329                MOVE "BUY17" TO COMM-ERROR-PTR
353000040329                PERFORM ESG-REJECTION THRU ERJ-EXIT
353100040329                GO TO PGS-EXIT
353200040329           END-READ.
353300040329
353400040329           MOVE WS-CONTR-REDEM-CODE TO CONTR-REDEM-CODE
353500040329                                       OF TRANS-REC.
353600040329           MOVE WS-INSTITUT-CODE    TO INSTITUTION-CODE
353700040329                                       OF TRANS-REC.
353800040329           MOVE WS-BRANCH-CODE      TO BRANCH-CODE
353900040329                                       OF TRANS-REC.
354000040329
354100040329           IF INSTITUTION-REQD
354200040329              OF TRANS-CONTR-REDEM-CODE-RD-REC IS NOT = "Y"
354300040329              GO TO PGS-EXIT.
354400040329
354500040329           IF WS-INSTITUT-CODE IS = SPACES
354600040408           OR WS-BRANCH-CODE IS = SPACES
354700040602              MOVE ERR-INVALID-CONTRD TO COMM-RETURN-DESC
354800040329              MOVE "BUY18" TO COMM-ERROR-PTR
354900040329              PERFORM ESG-REJECTION THRU ERJ-EXIT
355000040329           END-IF.
355100040329
355200040329       PGS-EXIT.
355300100517           EXIT.
355400100517
355500100517R65695 PROCESS-GGF-ACB.
355600100517R65695*****************************************************************
355700100517R65695     IF MANAGEMENT-COMPANY-SPECIFIC OF ESG-OE-DTL-REC = SPACES
355800100517R65695        OR WS-CONTR-REDEM-CD-GGF = SPACES
355900100517R65695        GO TO PGA-EXIT
356000100517R65695     END-IF.
356100100517R65695
356200100517R65695     MOVE WS-CONTR-REDEM-CD-GGF TO CONTR-REDEM-CODE
356300100517R65695                   OF TRANS-CONTR-REDEM-CODE-RD-REC.
356400100517R65695
356500100517R65695     READ TRANS-CONTR-REDEM-CODE-RD
356600100517R65695          INVALID KEY
356700100517R65695          MOVE ERR-INVALID-CONTRD TO COMM-RETURN-DESC
356800100517R65695          MOVE "BUY17" TO COMM-ERROR-PTR
356900100517R65695          PERFORM ESG-REJECTION THRU ERJ-EXIT
357000100517R65695          GO TO PGA-EXIT
357100100517R65695     END-READ.
357200100517R65695
357300100517R65695     MOVE WS-CONTR-REDEM-CD-GGF TO CONTR-REDEM-CODE
357400100517R65695                                   OF TRANS-REC.
357500100517R65695
357600100517R65695 PGA-EXIT.
357700040329R65695     EXIT.
357800101012      /
357900101012      *RFS86061 - Start
358000101012       VALIDATE-DISTRIB-INSTRUCTIONS.
358100101013      *****************************************************************
358200101013           EXEC SQL
358300101013              WHENEVER SQLERROR CONTINUE
358400101013           END-EXEC.
358500101012
358600101012           MOVE ZEROES TO li-ValIns.
358700101012
358800101012           EXEC SQL
358900101013            SELECT COALESCE(DECIMAL(COUNT(*),4,0), DECIMAL(0,4,0))
359000101018              INTO :li-ValIns
359100101018            FROM Mfaacctip Acctip
359200101018              INNER JOIN Mfadstpayp Dstpayp ON
359300101018                Acctip.Account_Type_Code =
359400101018                       Dstpayp.Account_Type_Code                 AND
359500101018                Acctip.Income_Or_Capital_Gains =
359600101018                       Dstpayp.Income_Or_Capital_Gains           AND
359700101018                Acctip.Distr_Option_Code = Dstpayp.Distr_Option_Code
359800101018            WHERE
359900101018              Acctip.Investment_Code    = :lc-InvCode            AND
360000101018              Acctip.Account_Type_Code  = :lc-AccType            AND
360100101018              Acctip.Income_Or_Capital_Gains IN ("I", "C")       AND
360200101013              Acctip.Distr_Option_Code  = :lc-DistOption         AND
360300101012              Dstpayp.Payment_Type_Code = :lc-PaymentType
360400101012           END-EXEC.
360500101012
360600101013           MOVE SQLSTATE TO Ws-Sql-States.
360700101012           IF NOT lncc_sqlSuccessful
360800101013              SET Ws-Err-01 TO TRUE
360900101012              MOVE "Distribution Setup Validation Failed"
361000101012                TO Ws-Sql-Err-Short-Descr
361100101012              MOVE SQLSTATE TO Ws-Sqlstate
361200101013              PERFORM Dsp-Error
361300101013           ELSE IF li-ValIns < 2
361400101012              MOVE "Y" TO lc-KeepOnVal
361500160212           END-IF.
361600160212      *RFS153674 - Starts.
361700160212           IF lc-DistOption = "R"
361800160212           AND li-ValIns  > 0
361900160212              MOVE "R" TO
362000160212                   CAPITAL-GAIN-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
362100160212              MOVE "R" TO
362200160212                   INCOME-DISTR-OPTION OF ACCOUNT-INVESTMENT-REC
362300160212              MOVE "N" TO
362400160212                   PAYMENT-TYPE-CODE OF ACCOUNT-INVESTMENT-REC
362500160212              MOVE "N" TO lc-KeepOnVal
362600160212           END-IF.
362700160212      *RFS153674 - Ends.
362800101012
362900110313      *RFS86061 - End
363000110313
363100110313      * RFS89055 - Begins
363200110313       VALIDATE-MFR-TRANSACTIONS.
363300110313
363400110313           MOVE Investment-Code OF Trans-Rec TO lc_InvestmentCode
363500110313           MOVE Account-No OF Trans-Rec TO li_AccountNo
363600110313
363700110313           IF TRANS-TYPE-CODE OF TRANS-REC = lncc_MFR
363800110313              MOVE MFR-GROUP-CODE OF  ESG-OE-DTL-REC
363900110313                TO lc_MFRGroupCode
364000110313
364100110313      *       -- Fetch the MFR-GROUP-HEADER
364200110313              EXEC SQL
364300110313                SELECT STATUS
364400110313                  INTO :lc_MFRGroupCodeStatus
364500110313                  FROM MFAMFRHDP
364600110313                  WHERE MFR_GROUP_CODE = :lc_MFRGroupCode
364700110313              END-EXEC
364800110313
364900110313              MOVE SQLSTATE  TO lc_SqlStates
365000110313              IF lncc_sqlSuccessful
365100110313      *       -- Fetch the MFR-GROUP-DETAIL
365200110313                 EXEC SQL
365300110313                   SELECT COUNT(*)
365400110313                     INTO :li_Count
365500110313                     FROM MFAMFRDTP
365600110313                    WHERE MFR_GROUP_CODE = :lc_MFRGroupCode
365700110313                      AND INVESTMENT_CODE = :lc_InvestmentCode
365800110313                 END-EXEC
365900110313              END-IF
366000110313
366100110313              IF lc_MFRGroupCodeStatus NOT = "A"
366200110313              OR li_Count = ZERO
366300110313      *       -- Here whether the last SQL EXECs succeeded or not
366400110313      *       -- 1) Inactive MFR Group Code from the header or
366500110313      *       -- 2) MFR-GROUP-HEADER not found or
366600110313      *       -- 3) MFR-GROUP-DETAIL not found
366700110313                 MOVE ERR-INVALID-FEES TO COMM-RETURN-DESC
366800110313                 MOVE "BUY40" TO COMM-ERROR-PTR
366900110313                 PERFORM ESG-REJECTION THRU ERJ-EXIT
367000110313                 GO TO VMT-EXIT
367100110313              END-IF
367200110313
367300110313              MOVE ZERO TO li_Count
367400110313              EXEC SQL
367500110313                 SELECT COUNT(*)
367600110313                    INTO :li_Count
367700110313                    FROM MFAACCMGP
367800110313                   WHERE ACCOUNT_NO = :li_AccountNo
367900110313                     AND MFR_GROUP_CODE = :lc_MFRGroupCode
368000110313              END-EXEC
368100110313              IF li_Count = ZERO
368200110313                 MOVE DEALER-CODE OF TRANS-REC
368300110313                                         TO lc_DealerCode
368400110313                 MOVE DEALER-REP-CODE OF TRANS-REC
368500110313                                         TO lc_DealerRepCode
368600110313
368700110313                 EXEC SQL
368800110313                 SELECT COUNT(*)
368900110313                   INTO :li_Count
369000110313                   FROM MFADEAMGP
369100110313                  WHERE DEALER_CODE = :lc_DealerCode
369200110313                    AND DEALER_REP_CODE = :lc_DealerRepCode
369300110313                    AND MFR_GROUP_CODE = :lc_MFRGroupCode
369400110313                 END-EXEC
369500110313                 IF li_Count = ZERO
369600110313                     EXEC SQL
369700110313                       SELECT GROUP
369800110313                         INTO :lc_Group
369900110313                         FROM MFAACCNTP
370000110313                        WHERE ACCOUNT_NO = :li_AccountNo
370100110313                     END-EXEC
370200110313
370300110313                     IF lc_Group = "Y"
370400110313                        EXEC SQL
370500110313                          SELECT GROUP_CODE
370600110313                            INTO :lc_GroupCode
370700110313                            FROM MFAACCGPP
370800110313                           WHERE ACCOUNT_NO = :li_AccountNo
370900110313                        END-EXEC
371000110313
371100110313                        MOVE ZERO TO li_Count
371200110313                        EXEC SQL
371300110313                          SELECT COUNT(*)
371400110313                            INTO :li_Count
371500110313                            FROM MFAGRPMGP
371600110313                           WHERE GROUP_CODE = :lc_GroupCode
371700110313                             AND MFR_GROUP_CODE = :lc_MFRGroupCode
371800110313                        END-EXEC
371900110313
372000110313                        IF li_Count = 0
372100110313                           MOVE ERR-INVALID-FEES TO COMM-RETURN-DESC
372200110313                           MOVE "BUY41" TO COMM-ERROR-PTR
372300110313                           PERFORM ESG-REJECTION THRU ERJ-EXIT
372400110313                           GO TO VMT-EXIT
372500110313                        END-IF
372600110313
372700110313                     ELSE
372800110313                        MOVE ERR-INVALID-FEES TO COMM-RETURN-DESC
372900110313                        MOVE "BUY42" TO COMM-ERROR-PTR
373000110313                        PERFORM ESG-REJECTION THRU ERJ-EXIT
373100110313                        GO TO VMT-EXIT
373200110313                     END-IF
373300110313                 END-IF
373400110313              END-IF
373500110313           END-IF
373600110313
373700110313           IF  FROM-DATE OF ESG-OE-DTL-REC > 0
373800110313           AND TO-DATE   OF ESG-OE-DTL-REC > 0
373900110313
374000110313               MOVE MFR-GROUP-CODE OF ESG-OE-DTL-REC
374100110313                 TO lc_MfrGroupCode
374200110313               MOVE INVESTMENT-CODE OF TRANS-REC
374300110313                 TO lc_InvestmentCode
374400110313
374500110313               PERFORM GET-MFR-GROUP-DETAIL
374600110313
374700110313               IF lb_RecordFoundYes
374800110313                  INITIALIZE pc_MfrcalcParms
374900110313                  MOVE lncc_O  TO pc_MfrcalcProcessOption
375000110313                  MOVE lc_MfrScheduleCode
375100110313                    TO pc_MfrcalcMfrSchedule
375200110313                  MOVE ACCOUNT-NO OF TRANS-REC
375300110313                    TO pi_MfrcalcAccountNo
375400110313                  MOVE INVESTMENT-CODE OF TRANS-REC
375500110313                    TO pc_MfrcalcInvestmentCode
375600110313                  MOVE FROM-DATE OF ESG-OE-DTL-REC
375700110313                    TO pi_MfrcalcFromDate
375800110313                  MOVE TO-DATE OF ESG-OE-DTL-REC
375900110313                    TO pi_MfrcalcToDate
376000110313                  MOVE MFR-GROUP-CODE OF ESG-OE-DTL-REC
376100110313                    TO pc_MfrcalcMfrGroupCode
376200110313
376300110313                  CALL "MFRCALC" USING pc_MfrcalcProcessOption
376400110313                                       pc_MfrcalcMfrSchedule
376500110313                                       pi_MfrcalcAccountNo
376600110313                                       pc_MfrcalcInvestmentCode
376700110313                                       pi_MfrcalcFromDate
376800110313                                       pi_MfrcalcToDate
376900110313                                       pc_MfrcalcRejectionCode
377000110313                                       pi_MfrcalcCalculatedAmt
377100110313                                       pi_MfrcalcPstAmt
377200110313                                       pi_MfrcalcGstAmt
377300110313                                       pc_MfrcalcMfrGroupCode
377400110313
377500110313                  IF pc_MfrcalcRejectionCode  NOT =  "00"
377600110313                     MOVE ERR-INV-TXN-TY-DT  TO COMM-RETURN-DESC
377700110313                     MOVE "BUY38"            TO COMM-ERROR-PTR
377800110313                     PERFORM ESG-REJECTION THRU ERJ-EXIT
377900110313                     GO TO VMT-EXIT
378000110313                  END-IF
378100110313                  MOVE PLACEMENT-DATE OF TRANS-REC TO
378200110313                       PLACEMENT-DATE OF TRANS-MFR-GROUP-REC
378300110313                  MOVE TRANS-NO       OF TRANS-REC TO
378400110313                       TRANS-NO       OF TRANS-MFR-GROUP-REC
378500110313                  MOVE MFR-GROUP-CODE OF ESG-OE-DTL-REC TO
378600110313                       MFR-GROUP-CODE OF TRANS-MFR-GROUP-REC
378700110313                  MOVE FROM-DATE      OF ESG-OE-DTL-REC TO
378800110313                       FROM-DATE      OF TRANS-MFR-GROUP-REC
378900110313                  MOVE TO-DATE        OF ESG-OE-DTL-REC TO
379000110313                       TO-DATE        OF TRANS-MFR-GROUP-REC
379100110313                  MOVE pi_MfrcalcCalculatedAmt TO
379200110313                       Gross-Amt OF Trans-Rec
379300110313                  MOVE pi_MfrcalcPstAmt        TO
379400110313                       PST-AMT OF TRANS-MFR-GROUP-REC
379500110313                  MOVE pi_MfrcalcGstAmt        TO
379600110313                       GST-AMT OF TRANS-MFR-GROUP-REC
379700110313
379800110313                  MOVE lncc_Y  TO COMM-WRITE-TRANS-MFR-GROUP
379900110313               END-IF
380000110313           END-IF
380100110313
380200110313           IF  FROM-DATE OF ESG-OE-DTL-REC = 0
380300110313           AND TO-DATE   OF ESG-OE-DTL-REC = 0
380400110313
380500110313               MOVE COUNTRY-CODE  OF INVESTOR-REC
380600110313                 TO lc_CountryCode
380700110313               MOVE PROVINCE-CODE OF INVESTOR-REC
380800110313                 TO lc_ProvinceCode
380900110313               MOVE lncc_MFR  TO lc_TransTypeCode
381000110313
381100110313               PERFORM GET-TRANS-TYPE-SALES-TAX
381200110313
381300110313               IF  lb_RecordFoundYes
381400110313               AND lc_SalesTaxCode  NOT =  lncc_N
381500110313
381600110313      *       Calculate GST amount
381700110313                   INITIALIZE ln_GSTAmount
381800110313                   IF ln_FederalTaxPercent > 0
381900110313                      COMPUTE ln_GSTAmount ROUNDED =
382000110313                             (GROSS-AMT OF TRANS-REC *
382100110313                             ln_FederalTaxPercent / 100)
382200110313                   END-IF
382300110313
382400110313      *       Calculate PST amount
382500110313                   INITIALIZE ln_PSTAmount
382600110313                   IF ln_ProvincialTaxPercent > 0
382700110313                      IF lc_CompundTax = lncc_Y
382800110313                         COMPUTE ln_PSTAmount ROUNDED =
382900110313                                 GROSS-AMT OF TRANS-REC *
383000110313                                (1 + (ln_FederalTaxPercent / 100) ) *
383100110313                                (ln_ProvincialTaxPercent / 100)
383200110313                      ELSE
383300110313                         COMPUTE ln_PSTAmount ROUNDED =
383400110313                                (GROSS-AMT OF TRANS-REC *
383500110313                                 ln_ProvincialTaxPercent / 100)
383600110313                      END-IF
383700110313                   END-IF
383800110313
383900110313                   IF lc_SalesTaxCode = lncc_G
384000110313                      COMPUTE ln_PSTAmount = 0
384100110313                   END-IF
384200110313                   IF lc_SalesTaxCode = lncc_P
384300110313                      COMPUTE ln_GSTAmount = 0
384400110313                   END-IF
384500110313                   COMPUTE GROSS-AMT OF TRANS-REC =
384600110313                           GROSS-AMT OF TRANS-REC +
384700110313                           ln_PSTAmount +
384800110313                           ln_GSTAmount
384900110313               END-IF
385000110313
385100110313               MOVE PLACEMENT-DATE OF TRANS-REC
385200110313                 TO PLACEMENT-DATE OF TRANS-MFR-GROUP-REC
385300110313               MOVE TRANS-NO       OF TRANS-REC
385400110313                 TO TRANS-NO       OF TRANS-MFR-GROUP-REC
385500110313               MOVE MFR-GROUP-CODE OF ESG-OE-DTL-REC
385600110313                 TO MFR-GROUP-CODE OF TRANS-MFR-GROUP-REC
385700110313               MOVE FROM-DATE      OF ESG-OE-DTL-REC
385800110313                 TO FROM-DATE      OF TRANS-MFR-GROUP-REC
385900110313               MOVE TO-DATE        OF ESG-OE-DTL-REC
386000110313                 TO TO-DATE        OF TRANS-MFR-GROUP-REC
386100110313               MOVE ln_PSTAmount
386200110313                 TO PST-AMT        OF TRANS-MFR-GROUP-REC
386300110313               MOVE ln_GSTAmount
386400110313                 TO GST-AMT        OF TRANS-MFR-GROUP-REC
386500110313
386600110313               MOVE lncc_Y  TO COMM-WRITE-TRANS-MFR-GROUP
386700110313           END-IF
386800110313           .
386900110313
387000110313       VMT-EXIT.
387100110313           EXIT.
387200110313
387300110313       GET-MFR-GROUP-DETAIL.
387400110313
387500110313           INITIALIZE lc_MfrScheduleCode
387600110313
387700110313           EXEC SQL
387800110313             SELECT MFR_SCHEDULE_CODE
387900110313               INTO :lc_MfrScheduleCode
388000110313               FROM MFAMFRDTP
388100110313              WHERE MFR_GROUP_CODE  = :lc_MfrGroupCode
388200110313                AND INVESTMENT_CODE = :lc_InvestmentCode
388300110313           END-EXEC
388400110313
388500110313           MOVE SQLSTATE  TO lc_SqlStates
388600110313           IF lncc_sqlSuccessful
388700110313              SET lb_RecordFoundYes  TO TRUE
388800110313           ELSE
388900110313              SET lb_RecordFoundNo   TO TRUE
389000110313           END-IF
389100110313           .
389200110313
389300110313       GET-TRANS-TYPE-SALES-TAX.
389400110313
389500110313           INITIALIZE lc_SalesTaxCode
389600110313                      ln_FederalTaxPercent
389700110313                      ln_ProvincialTaxPercent
389800110313                      lc_CompundTax
389900110313
390000110313           EXEC SQL
390100110313             SELECT SALES_TAX_CODE
390200110313                   ,FEDERAL_TAX_PERCENT
390300110313                   ,PROVINCIAL_TAX_PERCENT
390400110313                   ,COMPOUND_TAX
390500110313               INTO :lc_SalesTaxCode
390600110313                   ,:ln_FederalTaxPercent
390700110313                   ,:ln_ProvincialTaxPercent
390800110313                   ,:lc_CompundTax
390900110313               FROM MFATRNTXP
391000110313              WHERE COUNTRY_CODE    = :lc_CountryCode
391100110313                AND PROVINCE_CODE   = :lc_ProvinceCode
391200110313                AND TRANS_TYPE_CODE = :lc_TransTypeCode
391300110313                AND DEFAULT_FLAG    = :lncc_Y
391400110313                AND OPTIONAL_TAX    = :lncc_N
391500110313           END-EXEC
391600110313
391700110313           MOVE SQLSTATE  TO lc_SqlStates
391800110313           IF lncc_sqlSuccessful
391900110313              SET lb_RecordFoundYes  TO TRUE
392000110313           ELSE
392100110313              SET lb_RecordFoundNo   TO TRUE
392200110313           END-IF
392300110313           .
392400110313
392500110313       GET-CONTR-REDEM-CODE-RULE.
392600110313
392700110313           INITIALIZE lc_ContrRedemCodeRule
392800110313
392900110313           EXEC SQL
393000110313             SELECT CONTR_REDEM_CODE_RULE
393100110313               INTO :lc_ContrRedemCodeRule
393200110313               FROM MFACNTRRP
393300110313              WHERE ACCOUNT_TYPE_CODE = :lc_AccountTypeCode
393400110313                AND CONTR_REDEM_CODE  = :lc_ContrRedemCode
393500110313           END-EXEC.
393600110313
393700110313      *    MOVE SQLSTATE  TO lc_SqlStates
393800110313      *    IF lncc_sqlEnd
393900110313      *       MOVE ERR-INVALID-CONTRD  TO COMM-RETURN-DESC
394000110313      *       MOVE "BUY39"             TO COMM-ERROR-PTR
394100110313      *       PERFORM ESG-REJECTION THRU ERJ-EXIT
394200110313      *    END-IF
394300110313      /
394400110313       GET-CONTR-REDEM-CODE-RULE-2.
394500110313
394600110313           INITIALIZE li_Count
394700110313
394800110313           EXEC SQL
394900110313             SELECT COUNT(1)
395000110313               INTO :li_Count
395100110313               FROM MFACNTRRP
395200110313              WHERE ACCOUNT_TYPE_CODE = :lc_AccountTypeCode
395300110313                AND CONTR_REDEM_CODE  = :lc_ContrRedemCode
395400110313                AND CONTR_REDEM_CODE_RULE IN ("1","2")
395500110313           END-EXEC
395600110313
395700110313           MOVE SQLSTATE  TO lc_SqlStates
395800110313           IF lncc_sqlSuccessful
395900110313              SET lb_RecordFoundYes  TO TRUE
396000110313           ELSE
396100110313              SET lb_RecordFoundNo   TO TRUE
396200110313           END-IF
396300120802           .
396400110313
396500110313       GET-UNIT-PRICE.
396600110313
396700110313           INITIALIZE ln_UnitPrice
396800110313
396900110313           EXEC SQL
397000110313             SELECT UNIT_PRICE
397100110313               INTO :ln_UnitPrice
397200110313               FROM MFAINVUPP
397300110313              WHERE TRADE_DATE        = :li_TradeDate
397400110313                AND INVESTMENT_CODE   = :lc_InvestmentCode
397500110313                AND DISTRIBUTION_FLAG = " "
397600110313           END-EXEC
397700110313
397800110313           MOVE SQLSTATE  TO lc_SqlStates
397900110313           IF lncc_sqlSuccessful
398000110313              SET lb_RecordFoundYes  TO TRUE
398100110313           ELSE
398200110313              SET lb_RecordFoundNo   TO TRUE
398300110313           END-IF
398400110313           .
398500110313
398600110313       GET-ACCOUNT-TYPE-PARMS.
398700110313
398800110313           INITIALIZE ln_ContriLimit
398900110313
399000110313           EXEC SQL
399100110313             SELECT CONTR_LIMIT
399200110313               INTO :ln_ContriLimit
399300110313               FROM MFAACCPMP
399400110313              WHERE ACCOUNT_TYPE_CODE = :lc_AccountTypeCode
399500110313                AND TAX_YEAR          = :ln_TaxYear
399600110313           END-EXEC
399700110313
399800110313           MOVE SQLSTATE  TO lc_SqlStates
399900110313           IF lncc_sqlSuccessful
400000110313              SET lb_RecordFoundYes  TO TRUE
400100110313           ELSE
400200110313              SET lb_RecordFoundNo   TO TRUE
400300110313           END-IF
400400110313           .
400500110313
400600110313       DECLARE-CURSOR-C1-ACCT-BEN-SPL.
400700110313
400800110313           SET lb_C1AcctBenSplEofNo  TO TRUE
400900110313
401000110313           EXEC SQL DECLARE lcu_C1AcctBenSpl CURSOR FOR
401100110313             SELECT BENEFICIARY_SEQ_NO
401200110313                   ,BENEFICIARY_PERCENT
401300110313               FROM MFAACCBPP
401400110313              WHERE ACCOUNT_NO             = :li_AccountNo
401500110313                AND BENEFICIARY_SPLIT_CODE = :lc_BeneficiarySplitCode
401600110313                AND HRDC_FILE_DATE         = :li_HrdcFileDate
401700110313           END-EXEC
401800110313
401900110313           EXEC SQL  OPEN lcu_C1AcctBenSpl  END-EXEC
402000110313
402100110313           MOVE SQLSTATE  TO lc_SqlStates
402200110313           IF NOT lncc_sqlSuccessful
402300110313              SET lb_C1AcctBenSplEofYes  TO TRUE
402400110313           END-IF
402500110313           .
402600110313
402700110313       READ-CURSOR-C1-ACCT-BEN-SPL.
402800110313
402900110313           INITIALIZE lcu_BeneficiarySeqNo
403000110313                      lcu_BeneficiaryPercent
403100110313
403200110313           EXEC SQL
403300110313             FETCH FROM lcu_C1AcctBenSpl
403400110313              INTO :lcu_BeneficiarySeqNo
403500110313                  ,:lcu_BeneficiaryPercent
403600110313           END-EXEC
403700110313
403800110313           MOVE SQLSTATE  TO lc_SqlStates
403900110313           EVALUATE TRUE
404000110313             WHEN lncc_sqlSuccessful
404100110313               OR lncc_sqlWarning
404200110313               SET lb_C1AcctBenSplEofNo   TO TRUE
404300110313
404400110313             WHEN lncc_SqlEnd
404500110313               SET lb_C1AcctBenSplEofYes  TO TRUE
404600110313               EXEC SQL  CLOSE lcu_C1AcctBenSpl  END-EXEC
404700110313
404800110313             WHEN OTHER
404900110313               SET lb_C1AcctBenSplEofYes  TO TRUE
405000110313               EXEC SQL  CLOSE lcu_C1AcctBenSpl  END-EXEC
405100110313           END-EVALUATE
405200110313           .
405300110313
405400110313       DECLARE-CURSOR-C2-ACCT-BEN-FIN.
405500110313
405600110313           SET lb_C2AcctBenFinEofNo   TO TRUE
405700110313
405800110313           EXEC SQL DECLARE lcu_C2AcctBenFin CURSOR FOR
405900110313             SELECT CONTR_REDEM_CODE_RULE
406000110313                   ,YTD_CONTR_DEDUCT_AMT
406100110313                   ,LTD_CONTR_DEDUCT_AMT
406200110313               FROM MFAACBFP
406300110313              WHERE ACCOUNT_NO             = :li_AccountNo
406400110313                AND BENEFICIARY_SEQ_NO     = :ln_BeneficiarySeqNo
406500110313                AND CONTR_OR_REDEMEMPTION  = :lncc_C
406600110313                AND CONTR_REDEM_CODE_RULE IN ("1","2")
406700110313           END-EXEC
406800110313
406900110313           EXEC SQL  OPEN lcu_C2AcctBenFin  END-EXEC
407000110313
407100110313           MOVE SQLSTATE  TO lc_SqlStates
407200110313           IF NOT lncc_sqlSuccessful
407300110313              SET lb_C2AcctBenFinEofYes  TO TRUE
407400110313           END-IF
407500110313           .
407600110313
407700110313       READ-CURSOR-C2-ACCT-BEN-FIN.
407800110313
407900110313           INITIALIZE lcu_ContrRedemCodeRule
408000110313                      lcu_YtdContrDeductAmt
408100110313                      lcu_LtdContrDeductAmt
408200110313
408300110313           EXEC SQL
408400110313             FETCH FROM lcu_C2AcctBenFin
408500110313              INTO :lcu_ContrRedemCodeRule
408600110313                  ,:lcu_YtdContrDeductAmt
408700110313                  ,:lcu_LtdContrDeductAmt
408800110313           END-EXEC
408900110313
409000110313           MOVE SQLSTATE  TO lc_SqlStates
409100110313           EVALUATE TRUE
409200110313             WHEN lncc_sqlSuccessful
409300110313               OR lncc_sqlWarning
409400110313               SET lb_C2AcctBenFinEofNo   TO TRUE
409500110313
409600110313             WHEN lncc_SqlEnd
409700110313               SET lb_C2AcctBenFinEofYes  TO TRUE
409800110313               EXEC SQL  CLOSE lcu_C2AcctBenFin  END-EXEC
409900110313
410000110313             WHEN OTHER
410100110313               SET lb_C2AcctBenFinEofYes  TO TRUE
410200110313               EXEC SQL  CLOSE lcu_C2AcctBenFin  END-EXEC
410300110313           END-EVALUATE
410400120803           .
410500120803      *RFS99891 - Start
410600120813       DPR-TRANS-ASSIGN.
410700120813           MOVE ZEROES TO UNITS-PURCHASED OF TRANS-ASSIGNMENT-REC
410800120813                          UNITS-SOLD  OF TRANS-ASSIGNMENT-REC
410900120813                          ASSIGN-PERCENT  OF TRANS-ASSIGNMENT-REC
411000120813                          Amnt-Purchased  OF TRANS-ASSIGNMENT-REC
411100120813                          AMNT-SOLD OF TRANS-ASSIGNMENT-REC
411200120813                          UNITS-ASSN-BEF OF TRANS-ASSIGNMENT-REC
411300130104                          AMNT-ASSN-BEF  OF TRANS-ASSIGNMENT-REC
411400120813R99905                    DATE-ISSUED    OF TRANS-ASSIGNMENT-REC
411500120811                          ASSIGN-AMT     OF TRANS-ASSIGNMENT-REC.
411600121004
411700121004           MOVE INSTITUTION-CODE2 OF ESG-OE-CLT-REC TO lc_InstCde.
411800121004           MOVE BRANCH-CODE2      OF ESG-OE-CLT-REC TO lc_BchCde.
411900120811           MOVE ASSIGNMENT-TYPE   OF ESG-OE-CLT-REC TO lc_AssType.
412000120803
412100120809
412200120809           IF lc_InstCde NOT = SPACES AND lc_BchCde = SPACES
412300120817              MOVE ERR-INELIGIABLE-XACTION TO COMM-RETURN-DESC
412400120809              MOVE "BUY48"  TO COMM-ERROR-PTR
412500120918              PERFORM ESG-REJECTION THRU ERJ-EXIT
412600120809              GO TO DTA-EXIT
412700120803           END-IF.
412800120809
412900120809           IF lc_InstCde = SPACES AND lc_BchCde NOT = SPACES
413000120817              MOVE ERR-INELIGIABLE-XACTION TO COMM-RETURN-DESC
413100120809              MOVE "BUY49"   TO COMM-ERROR-PTR
413200120918              PERFORM ESG-REJECTION THRU ERJ-EXIT
413300120809              GO TO DTA-EXIT
413400120803           END-IF.
413500120809
413600120809           IF lc_InstCde NOT = SPACES AND lc_BchCde NOT = SPACES
413700120809              PERFORM Read-Institution
413800120809              PERFORM Read-Institution-Branch
413900120809              PERFORM Read-AssignmentType
414000120803           END-IF.
414100120803
414200120803           MOVE ASSIGNMENT-TYPE OF ESG-OE-CLT-REC  TO
414300200506                ASSIGNMENT-TYPE OF TRANS-ASSIGNMENT-REC.
414400200506186122*    MOVE INSTITUTION-CODE OF ESG-OE-CLT-REC TO
414500120803186122     MOVE INSTITUTION-CODE2 OF ESG-OE-CLT-REC TO
414600200506                INSTITUTION-CODE OF TRANS-ASSIGNMENT-REC.
414700200506186122*    MOVE BRANCH-CODE OF ESG-OE-CLT-REC TO
414800120803186122     MOVE BRANCH-CODE2 OF ESG-OE-CLT-REC TO
414900120810                BRANCH-CODE OF TRANS-ASSIGNMENT-REC.
415000120803           MOVE ASSIGN-AMOUNT-TYPE   OF ESG-OE-CLT-REC TO
415100120803                SPLIT-OPTION-CODE  OF TRANS-ASSIGNMENT-REC.
415200120803           MOVE SPLIT-OPTION-CODE OF TRANS-ASSIGNMENT-REC
415300120803                                                 TO lc_Splitcd.
415400120803
415500120817           EVALUATE lc_Splitcd
415600121025           WHEN lnc_U
415700120810           WHEN lnc_S
415800120803                MOVE ASSIGN-AMOUNT-13 OF ESG-OE-CLT-REC TO
415900120817                Units-Purchased OF TRANS-ASSIGNMENT-REC
416000120817           WHEN lnc_Dollar
416100120810           WHEN lnc_D
416200120803                MOVE ASSIGN-AMOUNT-13 OF ESG-OE-CLT-REC TO
416300120817                Amnt-Purchased OF TRANS-ASSIGNMENT-REC
416400120817           WHEN lnc_PER
416500120810           WHEN lnc_P
416600120803                MOVE ASSIGN-AMOUNT-13  OF ESG-OE-CLT-REC TO
416700120803                ASSIGN-PERCENT OF TRANS-ASSIGNMENT-REC
416800120803           END-EVALUATE.
416900120803
417000120803           MOVE Loan-Id OF ESG-OE-CLT-REC TO
417100120803                Loan-Id OF TRANS-ASSIGNMENT-REC.
417200120803           MOVE TO-DATE OF ESG-OE-CLT-REC TO
417300200506                End-Date OF TRANS-ASSIGNMENT-REC.
417400200506186122*    MOVE ORIGINAL-DOCUMENTS-RECVD OF ESG-OE-CLT-REC TO
417500120803186122     MOVE DOCUMENTS-RECVD OF ESG-OE-CLT-REC TO
417600120803                Documents-Recvd OF TRANS-ASSIGNMENT-REC.
417700120803           MOVE LETTER-SENT OF ESG-OE-CLT-REC TO
417800121205                LETTER-SENT OF TRANS-ASSIGNMENT-REC.
417900121205      * RFS 99905 - Start
418000121205           IF DATE-ISSUED OF ESG-OE-CLT-REC NOT= ZEROES
418100121205             MOVE DATE-ISSUED OF ESG-OE-CLT-REC TO li_ValDate
418200121205             PERFORM VALIDATEDATE
418300121205             IF lc_ValidDate = lnc_N
418400121205                MOVE lnc_BUY54 TO COMM-ERROR-PTR
418500121205                MOVE Err-XML-Start-Cut-Missed TO COMM-RETURN-DESC
418600121205                PERFORM ESG-REJECTION THRU ERJ-EXIT
418700121205                PERFORM DTA-EXIT
418800121205             END-IF
418900121205             IF li_ValDate < COMM-SYSDATE
419000121205                MOVE lnc_BUY55 TO COMM-ERROR-PTR
419100121205                MOVE Err-XML-Start-Cut-Missed TO COMM-RETURN-DESC
419200121205                PERFORM ESG-REJECTION THRU ERJ-EXIT
419300121205                PERFORM DTA-EXIT
419400121205             END-IF
419500121205              MOVE DATE-ISSUED OF ESG-OE-CLT-REC TO
419600121205                           DATE-ISSUED OF TRANS-ASSIGNMENT-REC
419700121205              MOVE lnc_Y                         TO
419800121205                           LETTER-SENT OF TRANS-ASSIGNMENT-REC
419900121205           END-IF.
420000121205      *    MOVE DATE-ISSUED OF ESG-OE-CLT-REC TO
420100121205      *         DATE-ISSUED OF TRANS-ASSIGNMENT-REC.
420200120808      * RFS 99905 - End
420300120808
420400120808           MOVE WS-FUND-ACCOUNT-NO(1:9) TO
420500120803                ACCOUNT-NO OF TRANS-ASSIGNMENT-REC.
420600120817
420700120817           COMPUTE li_TrnAssSeqNO = li_TrnAssSeqNO + 1.
420800120803           MOVE li_TrnAssSeqNO TO ASSIGN-SEQ-NO
420900120803                                  OF TRANS-ASSIGNMENT-REC.
421000120803           MOVE PLACEMENT-DATE OF TRANS-REC TO
421100120803           PLACEMENT-DATE OF TRANS-ASSIGNMENT-REC.
421200120803           MOVE TRANS-NO OF TRANS-REC TO TRANS-NO OF
421300120803                                               TRANS-ASSIGNMENT-REC.
421400120803           MOVE INVESTMENT-CODE OF TRANS-REC TO INVESTMENT-CODE OF
421500120803                                            TRANS-ASSIGNMENT-REC.
421600120817           MOVE COMM-SYSDATE   TO START-DATE OF TRANS-ASSIGNMENT-REC.
421700120803           MOVE lnc_P        TO ASSIGNMENT-STATUS OF
421800120803                                            TRANS-ASSIGNMENT-REC.
421900120803           MOVE COMM-SYSDATE  TO CREATION-DATE OF TRANS-ASSIGNMENT-REC.
422000120811           MOVE lncc_Y     TO COMM-WRITE-TRANS-ASSIGN.
422100120918
422200120918       DTA-EXIT.
422300120918           EXIT.
422400121205      /
422500121205      * RFS 99905 - Start
422600121205      * ---------------------------------
422700121205       ValidateDate.
422800121205      * ---------------------------------
422900121205           IF li_ValDate NOT = 0
423000121205              IF FUNCTION TEST-DATE-TIME
423100121205                 (li_ValDate DATE "@Y%m%d") = B"1"
423200121205                 MOVE lnc_Y TO lc_ValidDate
423300121205              ELSE
423400121205                 MOVE lnc_N TO lc_ValidDate
423500121205              END-IF
423600121205              IF lc_ValidDate = lnc_Y
423700121205                 IF (li_CCYY < 1900 OR li_CCYY > 2100)
423800121205                    MOVE lnc_N TO lc_ValidDate
423900121205                 END-IF
424000121205              END-IF
424100121205           END-IF.
424200121205      /
424300120803      * RFS 99905 - End
424400120803       Read-Institution.
424500120803           EXEC SQL
424600120817                SELECT 1
424700120803                INTO :li_instvalid
424800120803                FROM   MFAINSP
424900120803                WHERE  INSTITUTION_CODE = :lc_InstCde
425000120803           END-EXEC.
425100120803
425200120803           IF SQLCODE NOT = 0
425300120803              MOVE ERR-INELIGIABLE-XACTION TO COMM-RETURN-DESC
425400120803              MOVE "BUY50" TO COMM-ERROR-PTR
425500120803              PERFORM ESG-REJECTION THRU ERJ-EXIT
425600120803              GO TO DPR-EXIT
425700120803           END-IF.
425800120803
425900120803       Read-Institution-Branch.
426000120803           EXEC SQL
426100120817              SELECT 1
426200120803              INTO   :li_Bchvalid
426300120803              FROM   MFAINSBRP
426400120803              WHERE  INSTITUTION_CODE = :lc_InstCde
426500120803              AND    BRANCH_CODE = :lc_BchCde
426600120803           END-EXEC.
426700120803
426800120803           IF SQLCODE NOT = 0
426900120803              MOVE ERR-UNKW-BRANCH-C TO COMM-RETURN-DESC
427000120803              MOVE "BUY51" TO COMM-ERROR-PTR
427100120803              PERFORM ESG-REJECTION THRU ERJ-EXIT
427200120803              GO TO DPR-EXIT
427300120803           END-IF.
427400120803
427500120803       Read-AssignmentType.
427600120803           EXEC SQL
427700120817                SELECT COUNT(*)
427800120803                INTO :li_Cnt
427900120803                FROM MFAASNP
428000120803                WHERE ASSIGNMENT_TYPE = :lc_AssType
428100120803           END-EXEC.
428200120817
428300120803           IF li_Cnt NOT > 0
428400120803              MOVE ERR-INELIGIABLE-XACTION TO COMM-RETURN-DESC
428500120803              MOVE "BUY52" TO COMM-ERROR-PTR
428600120803              PERFORM ESG-REJECTION THRU ERJ-EXIT
428700120803              GO TO DPR-EXIT
428800120803           END-IF.
428900120803
429000110313      *RFS99891 - End
429100110313      /
429200110313           EXEC SQL  INCLUDE OEPAYMNT  END-EXEC.
429300110313      /
429400130227      * RFS89055 - Ends
429500130227      * RFS114676 - Start
429600130227      * ---------------------------------
429700130227       ValidateEFTSettlement.
429800130326      * ---------------------------------
429900130326           INITIALIZE lc_Delcode
430000130326
430100130227           MOVE DEALER-CODE OF ESG-OE-DTL-REC TO lc_Delcode
430200130326           EXEC SQL
430300130326               SELECT DEALER_CODE
430400130326               INTO :lc_Delcode
430500130321               FROM MFADEAATP
430600130326               WHERE DEALER_ATTRIBUTE_CODE = :lnc_EFTPU
430700130227               AND  DEALER_CODE = :lc_Delcode
430800130227           END-EXEC.
430900130227
431000130227           IF SQLCODE NOT = 0
431100130326              MOVE lc-EFTSettleNotSupp-261 TO COMM-RETURN-DESC
431200130227              MOVE lnc_Err_Buy57           TO COMM-ERROR-PTR
431300130227              PERFORM ESG-REJECTION THRU ERJ-EXIT
431400130227              GO TO DPR-EXIT
431500130227           END-IF.
431600130227           IF Bank-No          OF Esg-Oe-Dtl-Rec  = SPACES AND
431700130227              Bank-Transit-No  OF Esg-Oe-Dtl-Rec  = SPACES AND
431800130227              Bank-Account-No  OF Esg-Oe-Dtl-Rec  = SPACES AND
431900130227              Copy-BNKINFO     OF ESG-OE-FIN-15-REC NOT = SPACE
432000130326              MOVE lc-CpyBnkInfoNotAppl-262 TO COMM-RETURN-DESC
432100130227              MOVE lnc_Err_Buy58            TO COMM-ERROR-PTR
432200130227              PERFORM ESG-REJECTION THRU ERJ-EXIT
432300130227              GO TO DPR-EXIT
432400130305           END-IF.
432500130305       EFS-EXIT.
432600130227           EXIT.
432700101012      *RFS114676 End.
432800040324      /
432900101012                                     COPY CPYOERES.
433000180611      /
433100180611      *RFS178643 Start.
433200180611      * -------------------*
433300180611       DELETE-CHQ-EFT.
433400180611      * -------------------*
433500180611           INITIALIZE  lc_AccountNo
433600180611                       lc_InvestCde
433700180611           MOVE ACCOUNT-NO OF TRANS-REC TO lc_AccountNo
433800180611           MOVE INVESTMENT-CODE OF TRANS-REC TO lc_InvestCde
433900180611
434000180611           EXEC SQL
434100180611              DELETE FROM MFADISCQP
434200180611              WHERE
434300180611              ACCOUNT_NO = :lc_AccountNo AND
434400180611              INVESTMENT_CODE = :lc_InvestCde
434500180611           END-EXEC
434600180611
434700180611      *  DELETE MFADISEFP
434800180611           EXEC SQL
434900180611              DELETE FROM MFADISEFP
435000180611              WHERE
435100180611              ACCOUNT_NO = :lc_AccountNo  AND
435200180611              INVESTMENT_CODE = :lc_InvestCde
435300180611           END-EXEC
435400180611           .
435500180611      /
435600190121      *RFS178643 End
435700190121      *RFS179709- Starts
435800190121      *******************************
435900190121       VALIDATE-INVMINFUNCTIONCODE.
436000190121      *******************************
436100190121           INITIALIZE li_Count.
436200190121           EXEC SQL
436300190121               SELECT COUNT(*)
436400190121               INTO   :li_Count
436500190121               FROM   MFAISTFNP
436600190121               WHERE  INVESTMENT_CODE = :WS-PTMIN-INVESTMENT-CODE AND
436700190121                      FUNCTION_CODE   = "ICTWMIN"     AND
436800190121                      INVESTMENT_STRUCTURE_CODE = "ICT"
436900190121           END-EXEC.
437000190121           IF li_Count = 1
437100190121             SET lb_ICTWMINYes TO TRUE
437200190121           END-IF.
437300181204      * RFS179709 - Ends
437400150428
437500210531      * RFS180952 - Start.
437600210531      ************************************
437700210531       GetInvStr.
437800210531      ************************************
437900210531           INITIALIZE lc_IndFndCode
438000210531                      lb_ConstSeries.
438100210531
438200210531           MOVE INDUSTRY-FUND-CODE OF ESG-OE-DTL-REC
438300210531                                        TO lc_IndFndCode
438400210531           EXEC SQL
438500210531            SELECT :lnc_Y
438600210531            INTO :lb_ConstSeries
438700210531            FROM MFAFNCTP FNCTP
438800210531            INNER JOIN MFAINVSXP INVSXP ON
438900210531            INVSXP.INVESTMENT_STRUCTURE_CODE =
439000210531            FNCTP.INVESTMENT_STRUCTURE_CODE
439100210531            INNER JOIN MFAINVP INVP ON
439200210531            INVP.INVESTMENT_CODE = INVSXP.INVESTMENT_CODE
439300210531            WHERE INVP.INDUSTRY_FUND_CODE = :lc_IndFndCode
439400210531            AND  FNCTP.FUNCTION_CODE = :lnc_NONHLI
439500210531           END-EXEC.
439600210531
439700210531      *RFS180952 - End.
439800150428      *RFS141445 Start.
439900150428      * ---------------------------------
440000150428       CALL-FXTRNANNAG.
440100210203      * ---------------------------------
440200150428
440300150428           INITIALIZE lc_TrnAnnAgeSeverity
440400150428                      li_AccountNum
440500150428                      lc_NomineeFlag
440600150428                      lc_NomineeCode
440700150428                      lc_InvStructureCode
440800150428                      lc_Screen
440900150428                      lc_DelrCode
441000150428                      lc_RepCode
441100150428                      lc_InvProv
441200150428                      li_TDate
441300150428                      lc_AccTypeCode
441400150428                      lc_AccountDesignation.
441500150428
441600150428           IF WIRE-ORDER
441700150428              MOVE lncc_TRNPURW TO lc_Screen
441800150428           ELSE
441900150428              MOVE lncc_TRNPURE TO lc_Screen
442000150428           END-IF.
442100150428
442200150428           EXEC SQL
442300150428             SELECT COALESCE(SEVERITY," ")
442400150428             INTO   :lc_TrnAnnAgeSeverity
442500150428             FROM   MFAEDTSCP
442600150428             WHERE  SCREEN_CODE = :lc_Screen
442700150428             AND    EDIT_CODE =   :lc_Editcode
442800150428             AND    LEVEL_CODE =  :lc_Levelcode
442900150428           END-EXEC.
443000150428
443100150428           MOVE SQLSTATE TO SW-SQL-STATES
443200150428           IF NOT lncc_sqlSuccessful
443300150428              MOVE SPACES TO lc_TrnAnnAgeSeverity
443400150428           END-IF.
443500150428
443600150428
443700150428           MOVE Account-No OF Trans-Rec   TO li_AccountNum.
443800150428           MOVE Nominee    OF Account-Rec TO lc_NomineeFlag.
443900150428           MOVE Nominee-Code OF Nominee-Rec TO lc_NomineeCode.
444000150428           MOVE Investment-Code OF Trans-Rec TO lc_InvestmentCode.
444100150428
444200150428           EXEC SQL
444300150428             SELECT COALESCE(INVESTMENT_STRUCTURE_CODE," ")
444400150428             INTO   :lc_InvStructureCode
444401210929      *RFS187471 - Starts
444500210929      *      FROM   MFAINVSXP
444501210929             FROM   MFAISTFNP
444600150428             WHERE  INVESTMENT_CODE = :lc_investmentcode
444601210929               AND  FUNCTION_CODE = :lncc_SETPOL
444602210929      *RFS187471 - End
444700150428             FETCH FIRST ROW ONLY
444800150428           END-EXEC.
444900150428
445000150428           MOVE SQLSTATE TO SW-SQL-STATES
445100150428           IF NOT lncc_sqlSuccessful
445200150428              MOVE SPACES TO lc_InvStructureCode
445300150428           END-IF.
445400150428
445500150428           MOVE lc_Zero TO lc_DepLenEdit
445600150428           MOVE lc_Zero TO lc_DlrAuthEdit
445700150428           MOVE Dealer-Code     OF Trans-Rec  TO lc_DelrCode
445800150428           MOVE Dealer-Rep-Code OF Trans-Rec  TO lc_RepCode
445900150428           MOVE Province-Code   OF Investor-Rec TO lc_InvProv
446000150428           MOVE Trade-Date      OF Trans-Rec  TO li_TDate
446100150428           MOVE Account-Type-code OF Account-Rec TO lc_AccTypeCode
446200150428           MOVE Account-Designation OF ESG-OE-DTL-REC
446300150428                               TO lc_AccountDesignation
446400150428
446500150428
446600150428           CALL "FXTRNANNAG" USING lc_Screen,
446700150428                                   lc_DepLenEdit,
446800150428                                   lc_DlrAuthEdit,
446900150428                                   lc_DelrCode,
447000150428                                   lc_RepCode,
447100150428                                   lc_InvProv,
447200150428                                   li_AccountNum,
447300150428                                   lc_InvestmentCode,
447400150428                                   li_TDate,
447500150428                                   lc_NomineeFlag,
447600150428                                   lc_AccTypeCode,
447700150428                                   lc_NomineeCode,
447800150428                                   lc_AccountDesignation,
447900150428                                   lc_InvStructureCode,
448000150428                                   lc_TrnAnnAgeSeverity,
448100150428                                   lc_ReturnWarnCode,
448200150428                                   lc_ReturnErrorCode,
448300150428                                   lc_MsgText.
448400150428      *RFS141445 Ends
448500101012
448501210914      *RFS1115534 Starts
448502210914      * ---------------------------------
448503210914       GetRedemptionRule.
448504210914      * ---------------------------------
448505210914           MOVE Contr-Redem-Code  OF Trans-Rec
448506210914                                  TO lc_ConRedCode.
448507210914           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC
448508210914                                  TO lc_AccountTypeCode.
448509210914
448510210914           INITIALIZE lc-Cont-Redem-Rule.
448511210914
448512210914           EXEC SQL
448513210914             SELECT CONTR_REDEM_CODE_RULE
448514210914               INTO :lc-Cont-Redem-Rule
448515210914               FROM MFACNTRRP
448516210914              WHERE ACCOUNT_TYPE_CODE = :lc_AccountTypeCode
448517210914                AND CONTR_REDEM_CODE  = :lc_ConRedCode
448518210914           END-EXEC.
448519210914
448520210914           IF lc_ConRedCode = SPACES OR
448521210914              COMM-ESB-PROCESS NOT = "Y"
448522210914             MOVE "1" TO pc_RDSPCHKContrRule
448523210914           ELSE
448524210914             MOVE lc-Cont-Redem-Rule TO pc_RDSPCHKContrRule
448525210914           END-IF.
448526210914      *RFS1115534 Ends
448527210914
448600999999R86061     COPY CPYSQLRTN.
