000100990126     A
000200990412     A          R PRCEXTR                   TEXT('Mail_Merge_Extract_File')
000300990125     A
000400990308     A            RECID          6A         ALIAS(RECORD_ID)
000500990308     A
000600990309     A            RECFIL        54A
