000100170331      * %ATTR OPTION(*XREF *GEN) CLOSQLCSR(*ENDMOD) DBGVIEW(*SOURCE)+
000110170331      * %ATTR COMPILEOPT('ACTGRP(QILE)')
000120191030       IDENTIFICATION DIVISION.
000130120827       PROGRAM-ID. RESPIQE.
000140120827       AUTHOR.        Emmanuel Yala.
000150120827       INSTALLATION.  Citigroup Fund Services Canada.
000160171212       DATE-WRITTEN.  April 10, 2008.
000170120827       DATE-COMPILED.
000180120827      *****************************************************************
000190120827      **   RFS41245 : Quebec RESP Incentive                           *
000200120827      **   DESCRIPTION: Creates IQEE requests in (MFAACBIRP)          *
000210120827      **                ACC-BEN-IQEE-REQUEST-APP and                  *
000220170913      **                creates the requests in the MRQ Record Type 02*
000230120827      **                                                              *
000240120827      **   CALLED     : By JOBRESPIQE                                 *
000250121019      **   PARAMETERS :                                               *
000260121019      **               - Report Mode         ( added by 107668 )      *
000270121019      **               - Process Filing Year ( added by 107668 )      *
000280120827      **                                                              *
000290120827      *****************************************************************
000300120827      *    C H A N G E   H I S T O R Y
000310120827      *****************************************************************
000320120827      *****************************************************************
000330120827      * PROGRAMMER   *DATE OF CHANGE* DESCRIPTION OF CHANGE           *
000340120827      *****************************************************************
000350120827      * Emmanuel Yala* 2008/04/05 * RFS41245 - New Program            *
000360120827      * Emmanuel Yala* 2008/05/27 * RFS52744 - Fixing issue#2 & 4     *
000370120827      * Shu Yin      * 2008/06/02 * RFS52744 - Issue - joint tenant   *
000380120827      *              *            * relationship with bene should be  *
000390120827      *              *            * always 0.                         *
000400120827      *              *            * Issue  - Get investor address for *
000410120827      *              *            * address type IVR.                 *
000420120827      *              *            * Issue  - Retrieve joint subscriber*
000430120827      *              *            * info by checking w. investor SIN. *
000440120827      * Shu Yin      * 2008/06/13 * RFS51045 - Recompile for MFAACBIRP*
000450120827      * Shu Yin      * 2008/06/27 * RFS48928 - Exclude accounts with  *
000460120827      *              *            * account attribute code NMRQ.      *
000470120827      * Daniel Mielke* 2008/08/27 * RFS54596 - Correct foreign addr.  *
000480120827      *              *            * issues.                           *
000490120827      * Shu Yin      * 2008/12/03 * RFS57825 - File tenant info for   *
000500120827      *              *            * RECIPIENT-TYPE "2" - Joint Account*
000510120827      * L Martin     * 2009/06/02 * RFS58589 - changes to type 02 rec *
000520120827      *              *            * Add type 03, 04, 05 and 06 rec    *
000530120827      *              *            * for Quebec RESP Incentive         *
000540120827      * Sanjeev P    * 2009/08/18 * RFS 54431 Recomplie for MFABRELTP *
000550120827      * L Martin     * 2009/08/19 * RFS72749 - consolidate type 06    *
000560120827      *              *            * records on event date and update  *
000570120827      *              *            * the year value of MFATRNQAP with  *
000580120827      *              *            * using the year value of event date*
000590120827      * Shu Yin      * 2009/09/28 * RFS73992 - Correct mapping issues *
000600120827      *              *            * in rec type 04,05, combined with  *
000610120827      *              *            * RFS74099 & 74158                  *
000620120827      * L Martin     * 2009/09/30 * RFS73992 - remove date range      *
000630120827      *              *            * when updating rec types           *
000640120827      *              *            * 02/03/04/05/06 and include a      *
000650120827      *              *            * specific date for each rec type   *
000660120827      *              *            * Use filler to temporarily store   *
000670120827      *              *            * transfer seq no and bene seq  no  *
000680120827      *              *            * to be used later for udpate status*
000690120827      * L Martin     * 2009/10/15 * RFS74636 - realign fetch def'n    *
000700120827      *              *            * and cursor def'n for Type 04.     *
000710120827      *              *            * Remove update of pcg_seq_no from  *
000720120827      *              *            * InitialUpdate paragraph and create*
000730120827      *              *            * a new paragraph to retrieve it.   *
000740120827      *              *            * Retrieve legal name for rec type  *
000750120827      *              *            * 2 and 4 when recip type is 3.     *
000760120827      *              *            * Include calculations for YTD contr*
000770120827      *              *            * and YTD Transfer in amts in Type02*
000780120827      * L Martin     * 2009/11/26 * RFS76555 - when applying I004,    *
000790120827      *              *            * qualify the b.date (76555),       *
000800120827      *              *            * qualify year of MFATRNQAP in the  *
000810120827      *              *            * selection criteria for EAPPSETBL4
000820120827      *              *            * (76520), change li_F4_Account_No_ *
000830120827      *              *            * Othr to X(15) (76508), chg format *
000840120827      *              *            * of repayment_reason_code (76432), *
000850120827      *              *            * use pcg type code for first name, *
000860120827      *              *            * last name and business (76334),   *
000870120827      *              *            * use >= to qualify Transfer_Amount,*
000880120827      *              *            * and YTD_Amount(76508)             *
000890120827      * Kevin Shen   * 2009/11/03 * RFS73672                          *
000900120827      *              *            * - Remove Repayment_Reson_Code 23  *
000910120827      * Kevin Shen   * 2009/11/03 * RFS75878
000920120827      *              *            * - For Refile, Get
000930120827      *              *            * REPAYMENT_SPECIFIC_AMT from
000940120827      *              *            * MFATRNQAP directly
000950120827      * Emmanuel Yala* 2010/02/03 * RFS76915 - Change InitialUpdate for
000960120827      *              *            * not stopping current Year events 02
000970120827      * Emmanuel Yala* 2010/02/04 * RFS76890 - Fixed order of Type 02
000980120827      *              *            * records in the MRQ file
000990120827      * Goran Z.     * 2011/01/12 * RFS90545 - Modified BENSEQNO and
001000120827      *              *            * ACTTYPR data type and size.
001010120827      * Zelenovic G. * 2010/19/11 * RFS84977 - Modified the program to
001020120827      *              *            * include RESP EAP trans. with contr.
001030120827      *              *            * red. code of 30.
001040120827      * Shu Yin      * 2011/02/09 * 84977.13 - Fixed EAP IQEE amount in
001050120827      *              *            * record type 05.
001060120827      * Daniel M.    * 2011/06/02 * 96966 Rollback 9 0 1 0 5
001070120827      * Nasra F      * 2011/01/11 * RFS 90105 - QESI pro-rating
001080120827      *              *            * processing
001090120827      * Daniel M.    * 2011/04/11 * RFS 90105.7 - YTD Amount not to be included
001100120827      *              *            *               with LTD UC for transfers (04)
001110120827      * Daniel M.    * 2011/06/13 * 97333 Reinstate 90105
001120120827      * Manohar J.   * 2011/05/10 * RFS 78268 QESI phase-3 funcationality
001130120827      * Deepthi      * 2011/07/27 * RFS92917 - Change to generate     *
001140120827      *              *            * filing information for type 05 and*
001150120827      *              *            * 06 when the EXTQESI module exists *
001160120827      * Emmanuel Yala* 2011/08/02 * RFS 99039 - pull 9 7 3 3 3
001170120827      * Richard S.   * 2011/08/02 * RFS 98370 - changing of primary key
001180120827      *              *            * for Mfaacpcgp.
001190120827      * Daniel M.    * 2011/08/09 * RFS 98370 - Add WITH DUPLICATES
001200120827      * Waldi R.     * 2011/07/05 * RFS 96990 - update the filing status when
001210120827      *              *            * filing 06 record.
001220120827      * Waldi R.     * 2011/07/11 * RFS 96990.2 - defect item #2 fix.
001230120827      * Shu Yin      * 2011/09/13 * RFS 99447 - Reinstate 90105 & 96990
001240120827      * Deepthi      * 2011/09/19 * 92917.7 - Fixed looping issue
001250120827      * Deepthi      * 2011/09/19 * 92917.8 - Fixed missing trailer record
001260120827      * Daniel M.    * 2011/09/19 * 78268.17 - Fix cancellation version code
001270120827      *              *            * for transfer and replacement
001280120827      *              *            * Validate cutoff date for values
001290120827      * Daniel M.    * 2011/10/21 * 92917.29 - assign the address-no correctly
001300120827      * Daniel M.    * 2011/10/26 * 78268.25 - Clear the province code only if
001310120827      *              *            * an error occurs with the State name
001320120827      *              *            * retrieval.
001330120827      *              *            * Set the record-type-2
001340120827      * Nasra F.     * 2011/11/09 * 78268.30 - Remove year from EAPPSESUM and
001350120827      *              *            * populate status with a literal
001360120827      * Daniel M.    * 2011/11/11 * 78268.33 - Allow the continuation of
001370120827      *              *            * 02/06 filing if either 02/06 cancellation
001380120827      *              *            * was found
001390120827      * Nasra F.     * 2011/11/22 * 103174 - 78268.30 Remove year from work
001400120827      *              *            * tables for EAP
001410120827      * Emmanuel Yala* 2011/11/30 * RFS103067- QESI LTD amount contains
001420120827      *              *            * invalid characters
001430120827      * Shu Yin      * 2011/11/30 * RFS103453 - Commented validation for
001440120827      *              *            * reason I003 and I004 since the
001450120827      *              *            * validations are in MRQVAL
001460120827      * Asritha      * 2011/12/02 * RFS103463-02 (original) filed
001470120827      *                           *  record amended with RESCW
001480120827      *              *            *  (Contri Withdrawal)
001490120827      * Daniel M     * 2011/12/05 * RFS103463d clear the values in the filing
001500120827      *              *            * log as well
001510120827      * Manohar J.   * 2011/12/06 * RFS103461 Set MRQ_Approval_Status  filing
001520120827      *              *            * for Systematic cancel/amend
001530120827      * Walde R.     * 2011/12/19 * RFS104129 - defect fix.
001540120827      * Walde R.     * 2011/12/19 * RFS104159 - defect fix.
001550120827      * Nasra F      * 2011/12/22 * RFS104214 - Incorrect requests produced
001560120827      *              *            * when switching between '02' and '06'
001570120827      * Daniel M     * 2011/12/22 * RFS104214d  - Process 0 YTD when requested
001580120827      * Nasra F      * 2011/12/30 * RFS104430 - Add Edu postal code for 06(23)
001590120827      * Nasra F      * 2011/12/28 * RFS104390 - Process reversed trades with
001600120827      *              *            * status not U or S
001610120827      * Nasra F      * 2012/01/09 * RFS104599 - systematically validate if there
001620120827      *              *            * was any 02 previously filed  for filing year
001630120827      * Deepthi TVN  * 2012/02/07 * RFS105558 - QESI filing process does not
001640120827      *              *            * generate cancel/amend requests past 3 year
001650120827      *              *            * limit
001660120827      * RajKumar A   * 2012/02/21 * RFS106265 - File net amount to MRQ
001670120827      *              *            * instead of gross amount for CR rule 29
001680120827      *              *            * in Type 06 event, in position 056-064
001690120827      * Dharmendra D * 2012/03/13 * RFS106682 - QESI filling process updated to
001700120827      *              *            * file cancellation/amend after original
001710120827      *              *            * filling for any change in contribution.
001720120827      * Nasra F      * 2012/04/09 * RFS106682.2-Defect fix
001730120827      * Boopathy D   * 2012/04/25 * RFS108180 - Amended QESI annual
001740120827      *              *            * request generated where original
001750120827      *              *            * request hasn't been filed
001760120827      * Poornima V   * 2012/05/15 * RFS109472 - External QESI -
001770120827      *              *            * Negative unassisted in type
001780120827      *              *            * type 04 transfer out
001790120827      * Boopathy D   * 2012/05/22 * RFS109131 - Don't apply 3 year
001800120827      *              *            * limit to type 02 re-file and
001810120827      *              *            * 03/04/05/06 un-file/re-file.
001820120827      *              *            * - Enhance SQL error description
001830120827      *              *            * on fetching cursors.
001840120827      * Manohar J.   * 2012/06/05 * RFS109558  QESI filing process generates
001850120827      *              *            * incorrect annual request 02 record type
001860120827      * Boopathy D   * 2012/07/02 * RFS110780 - Replacement of
001870120827      *              *            * Beneficiary changes filed requests
001880120827      *              *            * to 'U'
001890120827      * Vinsfy J .   * 2012/07/02 * RFS110964:QESI: adjustments to grant
001900120827      *              *            * repayments are not filed correctly
001910120827      * Vinsfy J .   * 2012/07/18 * RFS110763: RESPIQE sends incorrect
001920120827      *              *            * records for refiled EAP transactions.
001930120830      * TVN Deepthi  * 2012/07/30 * RFS98805: Recompile
001940120827      * TVN Deepthi  * 2012/08/06 * RFS112178: Filing status modified to
001950120827      *              *            * 'Original' for SIN number change.
001960120827      * TVN Deepthi  * 2012/08/21 * RFS112219- Fix to Auto Cancel and
001970120827      *              *            * amend not generated for EAP Rvsl
001980121017      * Ambikapathy  * 2012/09/21 * RFS99609: Recompile
001990120925      * Deepthi TVN  * 2012/09/17 * RFS107668 - QESI Variance Report
002000121018      * Waldi R.     * 2012/10/17 * RFS107542  - add new Prescribed
002010121018      *              *            * Form field with fixed text.
002020121029      * Muthulaxmi M.* 2012/10/19 * RFS114764 -QESI REPAYMENT amount
002030121029      *              *            * on Record Type 06 file
002040121107      * Boopathy D   * 2012/11/07 * RFS107668.1 - Defect Fix
002050121204      * Daniel M.    * 2012/11/13 * RFS116287 - Change field order for
002060121204      *              *            * GetLastFiled info
002070121204      * Ambikapathy  * 2012/10/11 * RFS105992 - Enhancement to MRQ Reporting -
002080121204      *              *            * Beneficiary Age 16/17 Eligibility
002090130110      * Boopathy D   * 2012/11/22 * RFS103860 - UNITRAX QESI Enhancements
002100130201      * Vinsfy J     * 2012/11/29 * RFS116795- JOBRESPIQE sent record
002110130201      *              *            * type 06 version code 2.
002120130201      * Boopathy D   * 2013/01/17 * RFS118702 - EXT QESI: EAP's and
002130130201      *              *            * Repayments are not filing to MRQ
002140130201      * Ambikapathy  * 2013/01/16 * RFS118181 - Filing Year is not always
002150130201      *              *            * reported correctly on QESI Variance Report
002160130201      * Shu Yin      * 2013/01/31 * RFS115288 - Fix issue in RT 06: filed
002170130201      *              *            * data had event date after filing year
002180130627      * Ambikapathy  * 2013/04/12 * RFS120065 - External QESI: Not all 05(EAP)
002190130627      *              *            * records are picked up for filing
002200130709      * Sherene N    * 2013/07/09 * RFS119929 - QESI mandatory updates for
002210130709      *              *            * ITS version 2012-11.
002220130723      * Revathi P    * 2013/07/23 * RFS124236 - RECOMPILE
002230130902      * Boopathy D   * 2013/09/13 * RFS127392 - Modified the incorrect logic
002240130902      *              *            * of interplantransfercursor with loop
002250130902      *              *            * and end of flag
002260131008      * Sangeetha V  * 2013/10/08 * RFS128196 - Defect Fix.
002270131008      *              *            * 2012 response file from MRQ shows
002280131008      *              *            * significant amount of errors to new
002290131008      *              *            *  error code.
002300140421      * Noble T      * 2013/12/12 * RFS130249 - To fix the refiling issue of
002310140421      *              *            * previously rejected transactions.
002320150306      *VINSFY J      *2014/06/13  * RFS136634 -Recompile for MFAACCATP
002330140603      * Sangeetha V  * 2014/06/03 * RFS135546 - Defect Fix.
002340140603      *              *            * Invalid characters in record type 4
002350140603      *              *            * when unassisted capital is negative
002360140609      * Shakina      * 2014/06/09 * RFS136198 - Defect Fix -
002370140609      *              *            * Cancel and Amend records were
002380140609      *              *            * created when special module not
002390140609      *              *            * activated.
002400150306      * Arthy K    * 2014/07/02   * RFS 138089 - Recompile for MFAIVRTEP
002410140923      * Siddharth N  * 2014/09/23 * RFS139963 - To remove the Leading
002420140923      *              *            * Zeroes for record type 02 03 04 05 06
002430141001      * Daniel Mielke* 2014/10/01 * RFS132831 - Refile Cancel/Amend instead
002440141001      *              *            * of Original, where applicable.
002450141002      *              *            * Undo 1 1 0 7 6 3 and manage.
002460150414      * Zaheer A     * 2015/03/10 * RFS145431 -
002470150414      *              *            * 2014 QESI FILE - RECORD TYPE 04
002480150505      * JATIN S      * 2015/05/05 * RFS143887 -
002490150505      *              *            * QESI Type 04 record  contains invalid
002500150505      *              *            * character in pos 075 - 083
002510150908      * Eswaran T    * 2015/05/19 * RFS147117 - Recompile for MFAARTNDP
002520150826      * JATIN S      * 2015/08/26 * RFS150565 -QESI Type 04 cancelled amount
002530150826      *              *              with invalid digit for pos 677
002540150923      *Muthulakshmi M* 2015/08/03 * RFS149389 - RECOMPILE MFAMRQTSP   *
002550151027      * Eswaran T    * 2015/09/01 * RFS142097 - QESI - Wrong value in
002560151027      *              *            * Rec type 03 and missing error codes
002570151103      * JATIN S      * 2015/10/14 * RFS151502 -RESP QESI: Incorrect
002580151103      *              *            * record count
002590160212      * Zaheer A     * 2016/01/29 * RFS148410 -QESI: Change of Beneficiary
002600160212      *              *            * SIN is filed incorrectly to MRQ
002610160219      * Sairam       * 2016/02/19 * RFS155900 -Recompile
002620160219      *Muthulakshmi M* 2016/02/01 * RFS145606 - QESI - Unitrax Changes
002630160219      *              *            * to comply with MRQ
002640160219      *              *            * ITS Version 2015-05
002650160301      * Daniel M.    * 2016/03/01 * RFS143171 - Only report AC for 06-22/23/24
002660160301      *              *            * but allow zero value if not Cancellation
002670160425      *Muthulakshmi M* 2016/04/21 * RFS158868 -RT02 Cancellation record
002680160425      *              *            * generated MRQ Trans Id with
002690160425      *              *            * wrong sequence number
002700160523      *Muthulakshmi M* 2016/05/17 * RFS159637 - Prescribed-form on
002710160523      *              *            * record 02 and 06 are on wrong
002720160523      *              *            * position in file.
002730160831      *Swathi J      *            *RFS161999- EXTQESI: RT 06 filing
002740160831      *              *            *with repayment reason 'Zero'+<blank>
002750170118      *Muthulakshmi M* 2017/01/18 * RFS164896 - ESTQESI: Special Tax
002760170118      *              *            * Return (Record type 06) has an
002770170118      *              *            * invalid repayment reason.
002780170302      *Zaheer A      * 2017/02/15 * RFS165204 - MRQ re-filing of error
002790170302      *              *            * files cancel/amend instead of original
002800170308      *Zaheer A      * 2017/02/27 * RFS167582 - Grant repayment types
002810170308      *              *            * updates with incorrect version code
002820180921      *Sethu B       * 2018/09/20 * RFS1004139- QESI: Reversed transaction
002830180921      *              *            * with record type  06 not submitted
002840180921      *              *            * to RQ
002850190102      *Sindhu M K    * 2018/12/28 * RFS1007680- QESI: Refused 1004139
002860190102      *              *            * Reversed transaction T06 submitted
002870190102      *              *            * to RQ with version 0
002880190702      *JASON JOSHUA  * 2019/07/02 * RFS1015083- QESI: Contribution amount
002890190702      *              *            * automatically updated to zero.
002900190925      *Jason Joshua  * 2019/08/07 * RFS182660 - RECOMPILE MFAMRQTSP
002910191024      *M K SINDHU    * 2019/10/24 * RFS1019378 - RESP QESI filing;
002920191024      *              *            * Age16/17 logic is being applied
002930191024      *              *            * to all filing years
002940201021      *Poojasri M    * 2020/10/16 * RFS1104456-QESI-Recognized replacement
002950201021      *              *            * is not updated correctly
002960210220      * M K SINDHU   * 2020/02/04 * RFS1107299- Blood Relative is always
002970210301      *              *            * populated as zero in the beneficiary
002980210301      *              *            * MRQ approval file
002990210511      *Poojasri M    * 2021/05/10 * RFS1113313-Changes to not print the
003000210511      *              *            * error message when not found in
003010210916      *              *            * MFAABPCGX file
003020210916      * Swathi J     * 2021/09/16 * RFS1120048- MFAHRDADP Recompile
003030191024      *****************************************************************
003040120827
003050120827       ENVIRONMENT DIVISION.
003060120827       CONFIGURATION SECTION.
003070120827       SOURCE-COMPUTER. IBM-AS400.
003080120827       OBJECT-COMPUTER. IBM-AS400.
003090120827       SPECIAL-NAMES. DATA-AREA    IS DATAARA-MFAPRCDTP.
003100120827       INPUT-OUTPUT SECTION.
003110120827       FILE-CONTROL.
003120120827
003130120827      *RFS 52744 - start
003140120827           SELECT  INVESTOR-TENANTS
003150120827                   ASSIGN TO DATABASE-MFAIVRTEP
003160120827                   ORGANIZATION IS INDEXED
003170120827                   ACCESS IS DYNAMIC
003180120827                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
003190120827
00320012082774636      SELECT  ACCOUNT-PRIMARY-CARE-GIVER
003210120827      *            RFS98370 - Begins - Change key
00322012082774636 *            ASSIGN TO DATABASE-MFAACPCGP
00323012082798370              ASSIGN TO DATABASE-MFAACPCGL
003240120827      *            RFS98370 - Ends
00325012082774636              ORGANIZATION IS INDEXED
00326012082774636              ACCESS IS DYNAMIC
003270120827      *            RFS98370 - Begins - Add WITH DUPLICATES
00328012082774636 *            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
003290120827                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
003300120827                   WITH DUPLICATES.
003310120827      *            RFS98370 - Ends
003320120827
003330120827      * RFS110780 Begin
003340120827           SELECT  ACCOUNT
003350120827                   ASSIGN TO DATABASE-MFAACCNTP
003360120827                   ORGANIZATION IS INDEXED
003370120827                   ACCESS IS DYNAMIC
003380120827                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
003390120827
003400120827           SELECT  TRANS
003410120827                   ASSIGN TO DATABASE-MFATRNL1
003420120827                   ORGANIZATION IS INDEXED
003430120827                   ACCESS IS DYNAMIC
003440120827                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
003450120827                   WITH DUPLICATES.
003460120827
003470120827           SELECT  TRANS-RESP-REPAYMENT-DTL
003480120827                   ASSIGN TO DATABASE-MFATRNRRP
003490120827                   ORGANIZATION IS INDEXED
003500120827                   ACCESS IS DYNAMIC
003510120827                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
003520120827
003530120827           SELECT  TRANS-RESP-DETAILS
003540120827                   ASSIGN TO DATABASE-MFATRNRFLC
003550120827                   ORGANIZATION IS INDEXED
003560120827                   ACCESS IS DYNAMIC
003570120827                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
003580120827
003590120827           SELECT  CONTR-REDEM-CODE-RULES
003600120827                   ASSIGN TO DATABASE-MFACNTRRP
003610120827                   ORGANIZATION IS INDEXED
003620120827                   ACCESS IS DYNAMIC
003630120827                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
003640120827      * RFS110780 End
003650120827
003660120827       DATA DIVISION.
003670120827       FILE SECTION.
003680120827      /
003690120827       FD  INVESTOR-TENANTS
003700120827           LABEL RECORDS ARE STANDARD.
003710120827       01  INVESTOR-TENANTS-REC.      COPY DD-ALL-FORMATS OF MFAIVRTEP.
003720120827
003730120827      *RFS 52744 - end
003740120827
00375012082774636  FD  ACCOUNT-PRIMARY-CARE-GIVER
00376012082774636      LABEL RECORDS ARE STANDARD.
00377012082798370  01  ACCOUNT-PCG-REC.           COPY DD-ALL-FORMATS OF MFAACPCGL.
003780120827
003790120827      * RFS110780 Begin
003800120827       FD  ACCOUNT
003810120827           LABEL RECORDS ARE STANDARD.
003820120827       01  ACCOUNT-REC.               COPY DD-ALL-FORMATS OF MFAACCNTP.
003830120827      /
003840120827       FD  TRANS
003850120827           LABEL RECORDS ARE STANDARD.
003860120827       01  TRANS-REC.                 COPY DD-ALL-FORMATS OF MFATRNL1.
003870120827      /
003880120827       FD  TRANS-RESP-REPAYMENT-DTL
003890120827           LABEL RECORDS ARE STANDARD.
003900120827       01  TRANS-RESP-REPAYMENT-DTL-REC.
003910120827                                      COPY DD-ALL-FORMATS OF MFATRNRRP.
003920120827      /
003930120827       FD  TRANS-RESP-DETAILS
003940120827           LABEL RECORDS ARE STANDARD.
003950120827       01  TRANS-RESP-DETAILS-REC.   COPY DD-ALL-FORMATS OF MFATRNRFLC.
003960120827      /
003970120827       FD  CONTR-REDEM-CODE-RULES
003980120827           LABEL RECORDS ARE STANDARD.
003990120827       01  CONTR-REDEM-CODE-RULES-REC.
004000120827                                      COPY DD-ALL-FORMATS OF MFACNTRRP.
004010120827      /
004020120827      * RFS110780 End
004030120827
004040120827       WORKING-STORAGE SECTION.
004050120827
004060120827      *SQL Error Handling.
004070120827          COPY CPYSQLFLD
004080120827               REPLACING == "CURRENT_PROGRAM" == BY == "RESPIQE" ==.
004090120827
004100120827           EXEC SQL
004110120827             INCLUDE SQLCA
004120120827           END-EXEC.
004130120827
004140120827      *Error Codes, Uniquely Identify where the error happened
004150120827       01 Ws-Err-Code                   PIC X(02) VALUE SPACES.
004160120827          88  lncc_Err_Ok                           VALUE SPACES.
004170120827          88  lncc_Err_Fetch                        VALUE "FT".
004180120827          88  lncc_Err_I1                           VALUE "I1".
004190120827          88  lncc_Err_U1                           VALUE "U1".
004200120827          88  lncc_Err_U2                           VALUE "U2".
00421012082752744     88  lncc_Err_S1                           VALUE "S1".
00422012082757825     88  lncc_Err_S2                           VALUE "S2".
004230130110      * RFS103860 - Start
004240130110          88  lncc_Err_F1                           VALUE "F1".
004250130110          88  lncc_Err_F2                           VALUE "F2".
004260130110      * RFS103860 - End
004270160219145606    88  lncc_Err_Select                       VALUE "SL".
004280120827
004290120827       01 Flags.
004300120827          03  lb_EndOfCursorFlag            PIC 1.
004310120827              88  lb_EndOfCursorTrue        VALUE B"1".
004320120827              88  lb_EndOfCursorFalse       VALUE B"0".
004330120827
004340120827      * RFS92917 - START
004350120827          03  lc_SpecModEXTQESI             PIC X(01).
004360120827              88  lb_EXTQESIYes             VALUE "Y".
004370120827              88  lb_EXTQESINo              VALUE "N".
004380120827      * RFS92917 - END
004390120827
004400120827      * RFS104599 - Start
004410120827          03  Lc_PrevFiled02                PIC X(01).
004420120827              88  Lb_PrevFiled02Yes         VALUE "Y".
004430120827              88  Lb_PrevFiled02No          VALUE "N".
004440120827          03  Lc_0622Cancelled              PIC X(01).
004450120827              88  Lb_0622CancelledYes       VALUE "Y".
004460120827              88  Lb_0622CancelledNo        VALUE "N".
004470120827          03  Lc_0623Cancelled              PIC X(01).
004480120827              88  Lb_0623CancelledYes       VALUE "Y".
004490120827              88  Lb_0623CancelledNo        VALUE "N".
004500120827          03  Lc_0624Cancelled              PIC X(01).
004510120827              88  Lb_0624CancelledYes       VALUE "Y".
004520120827              88  Lb_0624CancelledNo        VALUE "N".
004530120827      * RFS104599 - END
004540120827      * RFS110964 - BEGIN
004550120827          03  Lc_NonCapitalRepayment        PIC X(01).
004560120827              88 Lb_NonCapitalRepaymentNo   VALUE "N".
004570120827              88 Lb_NonCapitalRepaymentYes  VALUE "Y".
004580120827      * RFS110964 - END
004590120827
004600160212      * RFS148410 - BEGIN
004610160212          03  Lc_BeneChange                 PIC X(01).
004620160212              88 Lb_BeneChangeYes           VALUE "Y".
004630160212              88 Lb_BeneChangeNo            VALUE "N".
004640160212      * RFS148410 - END
004650160212
004660120827      * RFS 110780 Begin
004670120827          03  lb_EndOfTrans                 PIC X(01).
004680120827              88  lb_EndOfTransYes             VALUE "Y".
004690120827              88  lb_EndOfTransNo              VALUE "N".
004700120827      * RFS 110780 End
004710120925      * RFS107668 - Start
004720120929          03  lb_EndOfYear                  PIC X(01).
004730120929              88  lncc_EndOfYearYes            VALUE "Y".
004740120929              88  lncc_EndOfYearNo             VALUE "N".
004750120929
004760121009          03  lb_Rec_Exit                   PIC X(01).
004770121009              88  lncc_Rec_ExitYes             VALUE "Y".
004780121009              88  lncc_Rec_ExitNo              VALUE "N".
004790120925      * RFS107668 - End
004800120827
004810120827       01 lc_Working_Variables.
004820120827          03 lc_ProcessDateDataArea.
004830120827             05 lc_AsAtDate             PIC X(08).
004840120827              05 li_AsAtDate REDEFINES lc_AsAtDate  PIC S9(08).
004850120827             05 FILLER1                 PIC X(85).
004860120827             05 lc_LastYearEnd          PIC X(04).
004870120827             05 ln_LastYearEnd REDEFINES
004880120827                lc_LastYearEnd          PIC S9(04).
004890120827             05 FILLER2                 PIC X(72).
004900120827
004910120827          03 lc_ErrCode               PIC X(02) VALUE SPACES.
004920120827          03 lc_ErrDesc               PIC X(80) VALUE SPACES.
004930120827          03 li_MaxAddrNo             PIC S9(07).
004940170131164896    03 lc_Tax_Reason_Code       PIC X(02).
004950120827          03 li_NoOfRecordsProc       PIC S9(09).
004960120827          03 lc_NoOfRecordsProcX  REDEFINES li_NoOfRecordsProc
004970120827                                      PIC  X(09).
004980120827          03 li_NoOfRowsFetched       PIC S9(03) VALUE 0.
004990120827          03 li_Counter               PIC S9(03) VALUE 0.
005000120827          03 li_RESP_FillingYear      PIC S9(04) VALUE 0.
005010120827          03 li_Year1                 PIC S9(04) VALUE 0.
005020120827          03 li_Year2                 PIC S9(04) VALUE 0.
00503012082773992     03 li_YYYYMMDD.
00504012082773992        05 li_YYYY                  PIC S9(04) VALUE 0.
00505012082773992        05 li_MMDD                  PIC S9(04) VALUE 0.
00506012082774636     03 li_FilingYrEnd              PIC S9(08) VALUE 0.
00507012082774636     03 li_FilingYrEnd-X REDEFINES li_FilingYrEnd.
00508012082776555 *      05 li_FilingYYYY            PIC X(04) VALUE SPACES.
00509012082776555 *      05 li_FilingMMDD            PIC X(04) VALUE "1231".
00510012082776555        05 li_FilingYYYY            PIC S9(04).
00511012082776555        05 li_FilingMMDD            PIC S9(04).
005120120827      * RFS 78268 - Start
005130120827          03 Li_AIP_Count                PIC S9(09) VALUE 0.
005140120827          03 Li_MFAMRQTXP-COUNT          PIC S9(09) VALUE 0.
005150120827          03 li_MFAMRQRQP-COUNT          PIC S9(09) VALUE 0.
005160120827106682    03 li_CANCELLED_TODAY          PIC S9(09) VALUE 0.
005170120827106682    03 li_CANCELLED_ONLY           PIC S9(09) VALUE 0.
005180120827          03 Li_TMPCount                 PIC S9(09) VALUE 0.
005190120827          03 Li_TMPCount2                PIC S9(09) VALUE 0.
005200120827          03 Li_Fetch-Ben-AddrNo         PIC S9(07).
005210120827          03 Li_Fetch-Sub-AddrNo         PIC S9(07).
005220120827          03 Li_Validate-AddrNo          PIC S9(07).
005230120827          03 Lc_Validate-AptNo           PIC X(06).
005240120827          03 Lc_Validate-CivicNo         PIC X(10).
005250120827          03 Lc_Validate-Street          PIC X(50).
005260120827          03 Lc_Validate-Addr2           PIC X(14).
005270120827          03 Lc_Validate-Addr3           PIC X(40).
005280120827          03 Lc_Validate-City            PIC X(30).
005290120827          03 Lc_Validate-Prov            PIC X(02).
005300120827          03 Lc_Validate-Country         PIC X(03).
005310120827          03 Lc_Validate-Postal          PIC X(10).
005320120827          03 Li_Fetch-AddrNo             PIC S9(07).
005330120827          03 Lc_Fetch-AptNo              PIC X(06).
005340120827          03 Lc_Fetch-CivicNo            PIC X(10).
005350120827          03 Lc_Fetch-Street             PIC X(50).
005360120827          03 Lc_Fetch-Addr2              PIC X(14).
005370120827          03 Lc_Fetch-Addr3              PIC X(40).
005380120827          03 Lc_Fetch-City               PIC X(30).
005390120827          03 Lc_Fetch-Prov               PIC X(02).
005400120827          03 Lc_Fetch-Country            PIC X(03).
005410120827          03 Lc_Fetch-Postal             PIC X(10).
005420120827          03 lc_CancelField              PIC  X(01) VALUE SPACES.
005430120827          03 lc_Flag                     PIC  X(01) VALUE SPACES.
005440120827      * RFS104214   - Begins - Add variables
005450120827       01 Li_LastFiledAccountNo          PIC S9(09).
005460120827       01 Li_LastFiledBeneSeq            PIC S9(03).
005470120827       01 Li_LastFiledYear               PIC S9(04).
005480120827       01 Li_LastFiledYear1231           PIC S9(08).
005490120827       01 Li_LastFiledMrqFileDate        PIC S9(08).
005500120827       01 Li_LastFiledRecType            PIC X(02).
005510120827       01 Li_LastFiledVersion            PIC S9(1).
005520120827      * RFS104214 - Ends
005530120827104599 01 Li_PrevFiled02_Count           PIC S9(09) VALUE 0.
005540130110103860 01  li_PCG-Seq-No                 PIC S9(02) VALUE 0.
005550120827
005560120827
005570120827       01 Lc_Original                    PIC X(01) VALUE SPACES.
005580120827          88  Lc_Originalfound                     VALUE "Y".
005590120827          88  Lc_OriginalNotfound                  VALUE "N".
005600120827      * RFS78268.33 - Begins - Add variable
005610120827       01 Lc_AnyOriginal                    PIC X(01) VALUE SPACES.
005620120827          88  Lb_AnyOriginalfound                     VALUE "Y".
005630120827          88  Lb_AnyOriginalNotfound                  VALUE "N".
005640120827      * RFS78268.33 - Ends
005650120827
005660120827      * RFS 78268 - End
005670130715
005680130715      * RFS119929 - Start
005690130718       01  li_InterplanAccountNo         PIC S9(15).
005700130718       01  li_InterplanTrnsfrNo          PIC S9(07).
005710130718       01  li_InterplanBenSeqNo          PIC S9(03).
005720130718       01  li_InterplanTransferDate      PIC S9(08).
005730130718       01  li_InterplanTrxnVersCde       PIC S9(01).
005740130718       01  li_InterplanMRQFileDate       PIC S9(08).
005750130715      * RFS119929 - End
005760160219      * RFS145606 - START
005770160219       01  lc_get_mrq_trans_id           PIC X(15).
005780160219       01  li_mrq_trans_id               PIC 9(15).
005790160219       01  lc_mrq_trans_id REDEFINES li_mrq_trans_id
005800160219                                         PIC X(15).
005810160219       01  li_seq_num                    PIC 9(07).
005820160219       01  lc_seq_num      REDEFINES li_seq_num
005830160219                                         PIC X(07).
005840160222      *01  ln_mrq_trans_IndNull          PIC S9(04) COMP-4.
005850160219      * RFS145606 - END
005860120827
005870160212      * RFS148410 - Begin
005880160212       01  Li_BeneMMDDBefore             PIC S9(04).
005890160212       01  Li_BeneMMDDAfter              PIC S9(04).
005900160212      * RFS148410 - End
005910160212
005920120827       01 Constants.
005930120827          03  lnci_MaxFetchRec            PIC S9(03) VALUE 200.
005940120827          03  lncc_E                      PIC X(01) VALUE "E".
005950120827          03  lncc_02                     PIC X(02) VALUE "02".
005960120827          03  lncc_06                     PIC X(02) VALUE "06".
005970120827      *   RFS78268 - Begins - New constants
005980120827          03  lncc_03                     PIC X(02) VALUE "03".
005990120827          03  lncc_04                     PIC X(02) VALUE "04".
006000120827          03  lncc_05                     PIC X(02) VALUE "05".
006010120827      *   RFS78268 - Ends
006020120827      *   RFS78268 - Begins - Override 96990
00603012082796990 *   03  lncc_22                     PIC X(02) VALUE "22".
00604012082796990 *   03  lncc_23                     PIC X(02) VALUE "23".
00605012082796990 *   03  lncc_24                     PIC X(02) VALUE "24".
006060120827      *   RFS78268 - Ends
00607012082758589     03  lnci_02                     PIC S9(02) VALUE 2.
00608012082758589     03  lnci_03                     PIC S9(02) VALUE 3.
00609012082758589     03  lnci_04                     PIC S9(02) VALUE 4.
00610012082758589     03  lnci_05                     PIC S9(02) VALUE 5.
00611012082758589     03  lnci_06                     PIC S9(02) VALUE 6.
00612012082758589     03  lnci_0                      PIC S9(01) VALUE 0.
006130120827          03  lncc_Unfiled                PIC X(01) VALUE "U".
006140120827
006150120827      * RFS92917 - Start
006160120827          03 lncc_21                      PIC X(02)  VALUE "21".
006170120827          03 lncc_EXTQESI                 PIC X(07)  VALUE "EXTQESI".
006180120827          03 lnci_92                      PIC S9(02) VALUE 92.
006190120827          03 lncc_13                      PIC S9(02) VALUE 13.
006200120827      * RFS92917 - END
006210120827
006220140609136198    03 lncc_IQEE3                   PIC X(05)  VALUE "IQEE3".
006230140609
006240120827      * RFS78268 - Start
006250120827          03  lnci_1                      PIC S9(01) VALUE 1.
006260120827          03  lnci_1231                   PIC S9(04) VALUE 1231.
006270120827          03  lnci_2                      PIC S9(01) VALUE 2.
006280120827          03  lnci_6                      PIC S9(01) VALUE 06.
006290120827          03  lncc_Original               PIC X(01) VALUE "O".
006300120827          03  lncc_aMend                  PIC X(01) VALUE "M".
006310120827          03  lncc_Cancel                 PIC X(01) VALUE "C".
006320120827          03  lncc_P                      PIC X(01) VALUE "P".
006330120827          03  lncc_HSC                    PIC X(03) VALUE "HSC".
006340120827          03  lncc_HST                    PIC X(03) VALUE "HST".
006350120827          03  lncc_M                      PIC X(01) VALUE "M".
006360120827          03  lncc_O                      PIC X(01) VALUE "O".
006370120827          03  lncc_C                      PIC X(01) VALUE "C".
006380120827          03  lncc_N                      PIC X(01) VALUE "N".
006390120827          03  lncc_Y                      PIC X(01) VALUE "Y".
006400120827          03  lncc_RVS                    PIC X(03) VALUE "RVS".
006410120827          03  lncc_4                      PIC X(01) VALUE "4".
006420120827          03  lncc_22                     PIC X(02) VALUE "22".
006430120827          03  lncc_23                     PIC X(02) VALUE "23".
006440120827          03  lncc_24                     PIC X(02) VALUE "24".
006450121003107668    03  lncc_R                      PIC X(01) VALUE "R".
006460120827          03  Lncc_AddressNo              PIC X(04) VALUE "ADD#".
006470120827          03  lncc_GetAddNum              PIC X(45) VALUE "Error while
006480120827      -                                  "retrieving address #".
006490120827          03  lc_Normal                   PIC  X(2) VALUE "00".
006500120827          03  lC_CURRENT_PROGRAM          PIC  X(8) VALUE "RESPIQE ".
006510120827          03  COMM-CONTROL-CODE           PIC X(4).
006520120827          03  COMM-NEXT-NUMBER            PIC S9(9) COMP-3.
006530120827          03  COMM-RETURN-CODE            PIC X(2).
006540120827
006550121018
006560121018      * RFS 107542 - begins.
006570121018          03  lncc_PreScribedForm PIC X(49)
006580121018             VALUE "Formulaire prescrit - Président-directeur général".
006590121018      * RFS 107542 - ends.
006600121018
006610120827      * RFS 78268 - End
006620120827          03  lncc_Refiling               PIC X(01) VALUE "R".
00663012082754596     03  lncc_AUT                    PIC X(03) VALUE "AUT".
00664012082752744 *   03  lncc_Spaces                 PIC X(342) VALUE SPACES.
00665012082752744     03  lncc_Spaces_PCG_Address     PIC X(165) VALUE SPACES.
00666012082758589 *   03  lncc_Spaces                 PIC X(167) VALUE SPACES.
006670120827      * RFS 78268 - Start
00668012082758589 *   03  lncc_Spaces                 PIC X(154) VALUE SPACES.
006690160219      * RFS145606 - START
006700160219      *   03  lncc_Spaces                 PIC X(142) VALUE SPACES.
006710160219          03  lncc_Spaces                 PIC X(78) VALUE SPACES.
006720160219      * RFS145606 - END
006730120827      * RFS 78268 - End
00674012082774636 *   03  lncc_Spaces_SubscAddr       PIC X(164) VALUE SPACES.
00675012082774636     03  lncc_Spaces_SubscAddr       PIC X(175) VALUE SPACES.
00676012082758589     03  lncc_Spaces_Inst_Name       PIC X(150) VALUE SPACES.
00677012082758589     03  lncc_Spaces_Postal_Code     PIC X(10) VALUE SPACES.
006780120827      * RFS 78268 - Start
00679012082758589 *   03  lncc_Spaces_C3              PIC X(669) VALUE SPACES.
006800160219      * RFS145606 - START
006810160219      *   03  lncc_Spaces_C3              PIC X(654) VALUE SPACES.
006820160219          03  lncc_Spaces_C3              PIC X(638) VALUE SPACES.
006830160219      * RFS145606 - END
006840120827      * RFS 78268 - End
00685012082773992 *   03  lncc_Spaces_C4              PIC X(313) VALUE SPACES.
00686012082774636 *   03  lncc_Spaces_C4              PIC X(305) VALUE SPACES.
006870120827      * RFS 78268 - Start
00688012082774636 *   03  lncc_Spaces_C4              PIC X(313) VALUE SPACES.
006890130712119929*   03  lncc_Spaces_C4              PIC X(303) VALUE SPACES.
006900160219      * RSF145606 - START
006910160219119929*   03  lncc_Spaces_C4              PIC X(287) VALUE SPACES.
006920160219          03  lncc_Spaces_C4              PIC X(280) VALUE SPACES.
006930160219      * RFS145606 - END
00694012082758589 *   03  lncc_Spaces_C5              PIC X(629) VALUE SPACES.
006950160219      * RFS145606 - START
006960160219      *   03  lncc_Spaces_C5              PIC X(615) VALUE SPACES.
006970160219          03  lncc_Spaces_C5              PIC X(600) VALUE SPACES.
006980160219      * RFS145606 - END
00699012082758589 *   03  lncc_Spaces_C6              PIC X(662) VALUE SPACES.
007000160219      * RFS145606 - START
007010160219      *   03  lncc_Spaces_C6              PIC X(648) VALUE SPACES.
007020160219          03  lncc_Spaces_C6              PIC X(584) VALUE SPACES.
007030160219      * RFS145606
007040120827      * RFS 78268 - End
007050160219      * RFS145606 - START
007060160219          03  lncc_Spaces_49              PIC X(49)  VALUE SPACES.
007070160219          03  lncc_Spaces_15              PIC X(15)  VALUE SPACES.
007080160219      * RFS145606 - END
007090120827          03  lncc_StartingYear           PIC S9(04) VALUE 2007.
007100120827      * RFS109131 - Start
007110120827      *   03  lncc_ErrorFetchingCursor    PIC X(80)
007120120827      *       VALUE "Error while fetching cursor".
007130120827          03  lncc_ErrorFetchingCursor_02     PIC X(80)
007140120827              VALUE "Error while fetching cursor Type 02".
007150120827          03  lncc_ErrorFetchingCursor_03     PIC X(80)
007160120827              VALUE "Error while fetching cursor Type 03".
007170120827          03  lncc_ErrorFetchingCursor_04     PIC X(80)
007180120827              VALUE "Error while fetching cursor Type 04".
007190120827          03  lncc_ErrorFetchingCursor_05     PIC X(80)
007200120827              VALUE "Error while fetching cursor Type 05".
007210120827          03  lncc_ErrorFetchingCursor_06     PIC X(80)
007220120827              VALUE "Error while fetching cursor Type 06".
007230120827      * RFS109131 - End
007240130715      * RFS119929 - STARTS
007250130718          03  lnc_ErrorFetchingCursor07     PIC X(80)
007260130715              VALUE "Error while fetching cursor Interplan".
007270130715      * RFS119929 - ENDS
007280120926      * RFS107668 - Start
007290120926          03  lncc_ErrorFetchMRQRQP           PIC X(80)
007300120926              VALUE "Error while fetching MFAMRQRQP".
007310120927          03  lncc_ErrorFetchMRQBRP           PIC X(80)
007320120927              VALUE "Error while fetching MFAMRQBRP".
007330120927          03  lncc_ErrorFetchMRQTP            PIC X(80)
007340120927              VALUE "Error while fetching MFAMRQTP".
007350121001          03  lncc_ErrorFetchMRQTXP           PIC X(80)
007360121001              VALUE "Error while fetching MFAMRQTXP".
007370120926          03  lncc_ErrorFetchWKQESI           PIC X(80)
007380120926              VALUE "Error while fetching WKRSPQESIV".
007390121003          03  lncc_ErrorFetchMRQXFP           PIC X(80)
007400121003              VALUE "Error while fetching MFAMRQXFP".
007410121003          03  lncc_ErrorFetchTransfStatus     PIC X(80)
007420121003              VALUE "Error while fetching Transf Status from MFAARTNP".
007430120926      * RFS107668 - End
007440160219      * RFS145606 - START
007450160219          03  lncc_ErrorSelectingMax          PIC X(80)
007460160219              VALUE "Error while selecting MRQ Trans Id".
007470160219      * RFS145606 - END
007480130110
007490130110      * RFS103860 - Start
007500130110          03  lncc_ErrorFetchABPCGXP          PIC X(80)
007510130110              VALUE "Error while fetching MFAABPCGXP".
007520130110          03  lncc_ErrorFetchACPCGP           PIC X(80)
007530130110              VALUE "Error while fetching MFAACPCGP".
007540130110      * RFS103860 - End
007550120827          03  lncc_ErrorUpdatingFile.
007560120827              05 Filler_Upd PIC X(21) VALUE "Error while Updating ".
007570120827              05 lncc_UpdateFileName PIC X(10) VALUE SPACES.
007580120827          03  lncc_ErrorInsertingFile.
007590120827              05 Filler_Ins PIC X(22) VALUE "Error while Inserting ".
007600120827              05 lncc_InsertFileName PIC X(10) VALUE SPACES.
007610120827      * RFS 78268 - Start
007620120827          03  lncc_ErrorFetchingCancel.
007630120827              05 Filler_Ins PIC X(43)
007640120827                  VALUE "Error while Fetching Cancellation Records ".
007650120827              05 lncc_FileName PIC X(10) VALUE SPACES.
007660120827      * RFS 78268 - End
007670120827
007680120827      * RFS92917 - Start
007690120827          03  lncc_ErrorSelectingFile.
007700120827              05  Filler_Sel          PIC X(22)
007710120827                                      VALUE "Error while Selecting ".
007720120827              05  lncc_SelectFileName PIC X(10) VALUE SPACES.
007730120827      * RFS92917 - END
007740120827104390    03  lncc_U                      PIC X(01) VALUE "U".
007750120827104390    03  lncc_S                      PIC X(01) VALUE "S".
007760120827106682    03  Lc_PrevFiled06              PIC X(01).
007770120827106682        88  Lb_PrevFiled06Yes       VALUE "Y".
007780120827106682        88  Lb_PrevFiled06No        VALUE "N".
007790120827
007800160212      * RFS148410 - Begin
007810160212          03  Lc_CancelFromRecType        PIC X(02).
007820160212              88  Lb_CancelFromRecType02  VALUE "02".
007830160212              88  Lb_CancelFromRecType06  VALUE "06".
007840160212      * RFS148410 - End
007850160212
007860120827       01 ltb_FetchMainCurTable.
007870120827            05 ltb_FetchCursor OCCURS 200 TIMES.
007880120827               07 li_F_RecordType          PIC S9(02).
00789012082758589          07 li_F_Trxn_VersCde        PIC S9(01).
007900120827               07 li_F_FilingYear          PIC S9(04).
007910120827               07 lc_F_PromoterID          PIC  X(10).
007920120827               07 li_F_Account_No          PIC S9(15).
007930120827               07 li_F_SpecimenPlanNo      PIC S9(10).
007940120827               07 li_F_Plan_Setup_Date     PIC S9(08).
00795012082758589 *        07 lc_F_Resp_Type_Code      PIC  X(01).
00796012082758589          07 lc_F_Resp_Type_Code      PIC S9(01).
00797012082758589          07 lc_F_No_Yrs_QcResident   PIC S9(02).
007980120827               07 ln_F_YTD_Amount          PIC S9(07)V99.
007990120827               07 ln_F_YTD_Transfer_Amount PIC S9(07)V99.
00800012082758589          07 ln_F_YTD_Deposit_Amount  PIC S9(07)V99.
008010120827               07 ln_F_LTD_Amount          PIC S9(07)V99.
008020120827               07 li_F_Benef_SIN           PIC S9(09).
008030120827               07 lc_F_Benef_LastName      PIC  X(20).
008040120827               07 lc_F_Benef_FirstName     PIC  X(20).
008050120827               07 li_F_Benef_DOB           PIC S9(08).
00806012082758589 *        07 lc_F_Benef_Sex           PIC  X(01).
00807012082758589          07 lc_F_Benef_Sex           PIC S9(01).
008080120827               07 lc_F_Benef_AptNo         PIC  X(06).
008090120827               07 lc_F_Benef_StreetNo      PIC  X(10).
008100120827               07 lc_F_Benef_StreetName    PIC  X(50).
008110120827               07 lc_F_Benef_AddLine2      PIC  X(14).
008120120827               07 lc_F_Benef_AddLine3      PIC  X(40).
008130120827               07 lc_F_Benef_City          PIC  X(30).
008140120827               07 lc_F_Benef_Prov          PIC  X(02).
008150120827               07 lc_F_Benef_Country       PIC  X(03).
008160120827               07 lc_F_Benef_PostalCode    PIC  X(10).
00817012082758589 *        07 lc_F_Benef_QcResident    PIC  X(01).
00818012082758589          07 lc_F_Benef_QcResident    PIC S9(01).
00819012082758589 *        07 lc_F_Subsc_Type          PIC  X(01).
00820012082758589          07 lc_F_Subsc_Type          PIC S9(01).
008210120827               07 li_F_Subsc_SIN           PIC S9(09).
008220120827               07 lc_F_Subsc_BusNumber     PIC  X(10).
00823012082774636          07 lc_F_Subsc_Name          PIC  X(40).
00824012082774636 *        07 lc_F_Subsc_LastName      PIC  X(20).
00825012082774636 *        07 lc_F_Subsc_FirstName     PIC  X(20).
008260120827               07 lc_F_Subsc_BenRelation   PIC  X(01).
008270120827               07 lc_F_Subsc_Address       PIC  X(175).
008280120827               07 li_F_JoinSub_SIN         PIC S9(09).
008290120827               07 lc_F_JoinSub_LastName    PIC  X(20).
008300120827               07 lc_F_JoinSub_FirstName   PIC  X(20).
008310120827               07 lc_F_JoinSub_BenRelation PIC  X(01).
008320120827               07 lc_F_JoinSub_Phone       PIC  X(10).
00833012082758589 *        07 lc_F_PCG_Type_Code       PIC  X(01).
00834012082758589          07 lc_F_PCG_Type_Code       PIC S9(01).
008350120827               07 li_F_PCG_SIN             PIC S9(09).
008360120827               07 lc_F_PCG_BusinessNo      PIC  X(10).
008370120827               07 lc_F_PCG_Name            PIC  X(40).
008380120827               07 lc_F_PCG_BenRelation     PIC  X(01).
00839012082752744 *        07 lc_F_PCG_AndAll_Filler   PIC  X(342).
00840012082752744          07 lc_F_PCG_Address         PIC  X(165).
00841012082752744          07 lc_F_PCG_PhoneNumber     PIC  X(10).
00842012082758589          07 lc_F_IQEE_Trnsfr_Ind     PIC S9(01).
008430160219145606         07 lc_F_PrescribedForm      PIC X(49).
008440160219145606         07 lc_F_MRQ_Trans_Id        PIC X(15).
00845012082758589 *        07 lc_F_PCG_AndAll_Filler   PIC  X(167).
008460120827      * RFS 78268 - Starts
00847012082758589 *        07 lc_F_PCG_AndAll_Filler   PIC  X(154).
008480120827               07 lc_F_Status              PIC  X(01).
008490120827               07 li_F_MRQ_File_Date       PIC S9(08).
008500120827               07 li_F_Ben_seq_no          PIC S9(03).
008510160219      * RFS145606 - START
008520160219      *        07 lc_F_PCG_AndAll_Filler   PIC  X(142).
008530160219               07 lc_F_PCG_AndAll_Filler   PIC  X(78).
008540160219      * RFS145606 - END
008550120827      * RFS 78268 - End
008560120827
008570120827       01 ltb_IndicatorsTable.
008580120827           05  ltb_Indicators          OCCURS 200 TIMES.
008590120827               07  ltb_Indicator       PIC S9(04) BINARY
00860012082758589 *                                OCCURS 43  TIMES.
008610120827      * RFS 78268 - Start
00862012082758589 *                                OCCURS 48  TIMES.
00863012082778268                                  OCCURS 51  TIMES.
008640120827      * RFS 78268 - End
008650120827
00866012082758589 *Begins
008670120827      * IQEE Transaction Request File Type 03
008680120827      * Beneficiary Replacement Events
008690120827       01 ltb_FetchC3Table.
008700120827            05 ltb_C3Cursor OCCURS 200 TIMES.
008710120827               07 li_F3_RecordType           PIC S9(02).
008720120827               07 li_F3_Trxn_VersCde         PIC S9(01).
008730120827               07 lc_F3_PromoterID           PIC  X(10).
008740120827               07 li_F3_Account_No           PIC S9(15).
008750120827               07 li_F3_SpecimenPlanNo       PIC S9(10).
008760120827               07 li_F3_Replacement_Date     PIC S9(08).
008770120827               07 lc_F3_Resp_Type_Code       PIC S9(01).
008780120827               07 li_F3_Benef_SIN_Old        PIC S9(09).
008790120827               07 lc_F3_Benef_LastName_Old   PIC  X(20).
008800120827               07 lc_F3_Benef_FirstName_Old  PIC  X(20).
008810120827               07 li_F3_Benef_DOB_Old        PIC S9(08).
008820120827               07 lc_F3_Benef_Sex_Old        PIC S9(01).
008830120827               07 li_F3_Benef_SIN_New        PIC S9(09).
008840120827               07 lc_F3_Benef_LastName_New   PIC  X(20).
008850120827               07 lc_F3_Benef_FirstName_New  PIC  X(20).
008860120827               07 li_F3_Benef_DOB_New        PIC S9(08).
008870120827               07 lc_F3_Benef_Sex_New        PIC S9(01).
008880120827               07 lc_F3_Benef_AptNo          PIC  X(06).
008890120827               07 lc_F3_Benef_StreetNo       PIC  X(10).
008900120827               07 lc_F3_Benef_StreetName     PIC  X(50).
008910120827               07 lc_F3_Benef_AddLine2       PIC  X(14).
008920120827               07 lc_F3_Benef_AddLine3       PIC  X(40).
008930120827               07 lc_F3_Benef_City           PIC  X(30).
008940120827               07 lc_F3_Benef_Prov           PIC  X(02).
008950120827               07 lc_F3_Benef_Country        PIC  X(03).
008960120827               07 lc_F3_Benef_PostalCode     PIC  X(10).
008970120827               07 lc_F3_Subsc_Type           PIC S9(01).
008980120827               07 li_F3_Benef_QcResident     PIC S9(01).
008990120827               07 lc_F3_Subsc_BenRelation    PIC S9(01).
009000130722119929         07 li_F3_Blood_Relative       PIC S9(01).
009010160219145606         07 lc_F3_MRQ_Trans_Id         PIC X(15).
009020120827      * RFS 78268 - Start
009030120827      *        07 lc_F3_Filler                PIC  X(669).
009040120827               07 li_F3_MRQ_File_Date         PIC  S9(08).
009050120827               07 lc_F3_Mrq_Approval_Status   PIC   X(01).
009060120827               07 li_F3_Beneficiary_seq_no    PIC  S9(03).
009070120827               07 li_F3_To_Beneficiary_seq_no PIC  S9(03).
009080130718      * RFS119929 - Start
009090130718      *        07 lc_F3_Filler                PIC  X(654).
009100160219      * RFS145606 - START
009110160219      *        07 lc_F3_Filler                PIC  X(653).
009120160219               07 lc_F3_Filler                PIC  X(638).
009130160219      * RFS145606 - END
009140130719      * RFS119929 - End
009150120827      *RFS 78268 - End
009160120827
009170120827       01 ltb_F3IndicatorsTable.
009180120827           05  ltb_F3Indicators          OCCURS 200 TIMES.
009190120827               07  ltb_F3Indicator       PIC S9(04) BINARY
009200120827                                         OCCURS 30  TIMES.
009210120827
009220120827      * IQEE Transaction Request File Type 04
009230120827      * Notional Transfer Events
009240120827       01 ltb_FetchC4Table.
009250120827            05 ltb_C4Cursor OCCURS 200 TIMES.
009260120827               07 li_F4_RecordType           PIC S9(02).
009270120827               07 li_F4_Trxn_VersCde         PIC S9(01).
009280120827               07 li_F4_TrusteeType          PIC S9(02).
009290120827               07 lc_F4_PromoterID           PIC  X(10).
009300120827               07 li_F4_Account_No           PIC S9(15).
009310120827               07 li_F4_SpecimenPlanNo       PIC S9(10).
009320120827               07 li_F4_Plan_Setup_Date      PIC S9(08).
009330120827               07 li_F4_Transfer_Date        PIC S9(08).
009340120827               07 ln_F4_Tot_Transfer_Amt     PIC S9(07)V99.
009350120827               07 ln_F4_MRQ_Assisted_Amt     PIC S9(07)V99.
009360120827               07 ln_F4_MRQ_Unassisted_Amt   PIC S9(07)V99.
009370120827               07 li_F4_IQEE_Trnsfr_Amt      PIC S9(07)V99.
009380120827               07 lc_F4_PromoterID_Othr      PIC  X(10).
00939012082776555 *        07 li_F4_Account_No_Othr      PIC S9(15).
00940012082776555          07 lc_F4_Account_No_Othr      PIC  X(15).
009410120827               07 li_F4_SpecimenPlanNo_Othr  PIC S9(10).
009420120827               07 li_F4_Benef_SIN            PIC S9(09).
009430120827               07 lc_F4_Benef_LastName       PIC  X(20).
009440120827               07 lc_F4_Benef_FirstName      PIC  X(20).
009450120827               07 li_F4_Benef_DOB            PIC S9(08).
009460120827               07 lc_F4_Benef_Sex            PIC S9(01).
009470120827               07 lc_F4_Benef_AptNo          PIC  X(06).
009480120827               07 lc_F4_Benef_StreetNo       PIC  X(10).
009490120827               07 lc_F4_Benef_StreetName     PIC  X(50).
009500120827               07 lc_F4_Benef_AddLine2       PIC  X(14).
009510120827               07 lc_F4_Benef_AddLine3       PIC  X(40).
009520120827               07 lc_F4_Benef_City           PIC  X(30).
009530120827               07 lc_F4_Benef_Prov           PIC  X(02).
009540120827               07 lc_F4_Benef_Country        PIC  X(03).
009550120827               07 lc_F4_Benef_PostalCode     PIC  X(10).
009560120827               07 li_F4_Tot_Trnsfr_Ind       PIC S9(01).
009570120827               07 li_F4_AIP_Paid_Ind         PIC S9(01).
009580120827               07 ln_F4_Fair_Mkt_Value       PIC S9(07)V99.
009590120827               07 ln_F4_CLB_Amt              PIC S9(07)V99.
009600120827               07 li_F4_Auth_Trnsfr_Ind      PIC S9(01).
009610120827               07 lc_F4_Subsc_Type           PIC S9(01).
009620120827               07 li_F4_Subsc_SIN            PIC S9(09).
009630120827               07 lc_F4_Subsc_BusNumber      PIC  X(10).
00964012082774636          07 lc_F4_Subsc_Name           PIC  X(40).
00965012082774636 *        07 lc_F4_Subsc_LastName       PIC  X(20).
00966012082774636 *        07 lc_F4_Subsc_FirstName      PIC  X(20).
009670120827               07 lc_F4_Subsc_BenRelation    PIC S9(01).
00968012082774636          07 lc_F4_Subsc_Address        PIC  X(175).
00969012082774636 *        07 lc_F4_Subsc_AptNo          PIC X(06).
00970012082774636 *        07 lc_F4_Subsc_StreetNo       PIC X(10).
00971012082774636 *        07 lc_F4_Subsc_StreetName     PIC X(50).
00972012082774636 *        07 lc_F4_Subsc_AddrLine2      PIC X(14).
00973012082774636 *        07 lc_F4_Subsc_AddrLine3      PIC X(40).
00974012082774636 *        07 lc_F4_Subsc_City           PIC X(30).
00975012082774636 *        07 lc_F4_Subsc_Prov           PIC X(02).
00976012082774636 *        07 lc_F4_Subsc_Country        PIC X(03).
00977012082774636 *        07 lc_F4_Subsc_PostalCode     PIC X(10).
00978012082774636 *        07 lc_F4_Subsc_Phone          PIC X(10).
009790120827               07 li_F4_JoinSub_SIN          PIC S9(09).
009800120827               07 lc_F4_JoinSub_LastName     PIC  X(20).
009810120827               07 lc_F4_JoinSub_FirstName    PIC  X(20).
009820120827               07 li_F4_JoinSub_BenRelation  PIC S9(01).
009830120827               07 li_F4_JoinSub_Phone        PIC S9(10).
009840130719      * RFS119929 - Start
009850130814               07 ln_F4Pre2007UnassCap       PIC S9(7)V99.
009860130814               07 ln_F4Post2007UnassCap      PIC S9(7)V99.
009870130719      * RFS119929 - End
009880160219      * RFS145606 - START
009890160219               07 lc_F4_MRQ_Trans_Id         PIC  X(15).
009900160219      * RFS145606 - END
00991012082773992 * use filler temporarily to store the transfer sequence number
00992012082773992 * and the beneficiary sequence number to be used when updating
00993012082773992 * the values in MFAARTNDP file (Update_TransferStatus)
00994012082773992          07 li_F4_Trnsfr_No            PIC S9(07).
00995012082773992          07 li_F4_Ben_Seq_No           PIC S9(03).
00996012082773992**        07 lc_F4_Filler               PIC  X(333).
00997012082774636**        07 lc_F4_Filler               PIC  X(305).
009980120827      * RFS 78268 - Start
00999012082774636 *        07 lc_F4_Filler               PIC  X(323).
010000120827               07 li_F4_MRQ_File_Date        PIC S9(08).
010010120827               07 lc_F4_Mrq_Approval_Status  PIC  X(01).
010020120827               07 lc_F4_Transfer_Status      PIC  X(01).
010030130712      * RFS119929 - Start
010040130715      *        07 lc_F4_Filler               PIC  X(313).
010050160219      * RFS145606 - START
010060160219      *        07 lc_F4_Filler               PIC  X(295).
010070160219               07 lc_F4_Filler               PIC  X(280).
010080160219      * RFS145606 - END
010090130719      * RFS119929 - End
010100120827      * RFS 78268 - End
010110120827
010120120827       01 ltb_F4IndicatorsTable.
010130120827           05  ltb_F4Indicators          OCCURS 200 TIMES.
010140120827               07  ltb_F4Indicator       PIC S9(04) BINARY
01015012082773992                                    OCCURS 50  TIMES.
01016012082773992**                                  OCCURS 48  TIMES.
010170120827
010180120827      * IQEE Transaction Request File Type 05
010190120827      * EAP/PSE Redemption Events
010200120827       01 ltb_FetchC5Table.
010210120827            05 ltb_C5Cursor OCCURS 200 TIMES.
010220120827               07 li_F5_RecordType          PIC S9(02).
010230120827               07 li_F5_Trxn_VersCde        PIC S9(01).
010240120827               07 li_F5_Payment_Type        PIC S9(02).
010250120827               07 lc_F5_PromoterID          PIC  X(10).
010260120827               07 li_F5_Account_No          PIC S9(15).
010270120827               07 li_F5_SpecimenPlanNo      PIC S9(10).
010280120827               07 li_F5_Payment_Date        PIC S9(08).
010290120827               07 li_F5_Accum_Income_Ind    PIC S9(01).
010300120827               07 ln_F5_Contr_Withdr_Amt    PIC S9(07)V99.
010310120827               07 ln_F5_IQEE_Amt_Paid       PIC S9(07)V99.
010320120827               07 ln_F5_EAP_Amt_Paid        PIC S9(07)V99.
010330120827               07 ln_F5_IQEE_Balance        PIC S9(07)V99.
010340120827               07 ln_F5_Fair_Mkt_Amt        PIC S9(07)V99.
010350120827               07 ln_F5_Tot_Contr_Paid      PIC S9(07)V99.
010360120827               07 ln_F5_OthrBen_CLB_Amt     PIC S9(07)V99.
010370120827               07 ln_F5_Benef_CLB_Amt       PIC S9(07)V99.
010380120827               07 ln_F5_Bal_Cdn_Grant       PIC S9(07)V99.
010390120827               07 ln_F5_Othr_ProvPgm_Amt    PIC S9(07)V99.
010400120827               07 li_F5_Benef_SIN           PIC S9(09).
010410120827               07 lc_F5_Benef_LastName      PIC  X(20).
010420120827               07 lc_F5_Benef_FirstName     PIC  X(20).
010430120827               07 li_F5_Benef_DOB           PIC S9(08).
010440120827               07 lc_F5_Benef_Sex           PIC S9(01).
010450120827               07 lc_F5_Benef_QcResident    PIC S9(01).
010460120827               07 li_F5_PSE_Pgm_Type        PIC S9(01).
010470120827               07 li_F5_PSE_Pgm_Length      PIC S9(01).
010480120827               07 li_F5_PSE_Pgm_Year        PIC S9(01).
010490120827               07 li_F5_AcadYr_Start_Date   PIC S9(08).
010500120827               07 li_F5_AcadYr_Lgth_Weeks   PIC S9(02).
010510120827               07 lc_F5_Educ_Postal_Code    PIC  X(10).
010520120827               07 lc_F5_Educ_Name           PIC  X(150).
010530160219145606         07 lc_F5_MRQ_Trans_Id        PIC  X(15).
010540120827      * RFS 78268 - Start
010550120827      *        07 lc_F5_Filler              PIC  X(629).
010560120827               07 li_F5_Beneficiary_Seq_No  PIC S9(03).
010570120827               07 lc_F5_ReversalFlag        PIC  X(01).
010580120827               07 lc_F5_CancelFlag          PIC  X(01).
010590120827               07 lc_F5_MRQ_Approval_Status PIC  X(01).
010600120827               07 li_F5_MRQ_File_Date       PIC S9(08).
010610160219      * RFS145606 - START
010620160219      *        07 lc_F5_Filler              PIC  X(615).
010630160219               07 lc_F5_Filler              PIC  X(600).
010640160219      * RFS145606 - END
010650120827      * RFS 78268 - End
010660120827
010670120827       01 ltb_F5IndicatorsTable.
010680120827           05  ltb_F5Indicators          OCCURS 200 TIMES.
010690120827               07  ltb_F5Indicator       PIC S9(04) BINARY
010700120827                                         OCCURS 32  TIMES.
010710120827
010720120827
010730120827      * IQEE Transaction Request File Type 06
010740120827      * Special Tax/Grant Repayment Events
010750120827       01 ltb_FetchC6Table.
010760120827            05 ltb_C6Cursor OCCURS 200 TIMES.
010770120827               07 li_F6_RecordType          PIC S9(02).
010780120827               07 li_F6_Trxn_VersCde        PIC S9(01).
010790120827               07 lc_F6_PromoterID          PIC  X(10).
010800120827               07 li_F6_Account_No          PIC S9(15).
010810120827               07 li_F6_SpecimenPlanNo      PIC S9(10).
010820120827               07 li_F6_Event_Date          PIC S9(08).
010830120827               07 ln_F6_Contr_Withdr_Amt    PIC S9(07)V99.
010840120827               07 ln_F6_IQEE_Refund_Amt     PIC S9(07)V99.
010850120827               07 ln_F6_EAP_WriteOff_Amt    PIC S9(07)V99.
010860120827               07 ln_F6_IQEE_Tot_Contr_Amt  PIC S9(07)V99.
010870120827               07 ln_F6_Fair_Mkt_Val_Amt    PIC S9(07)V99.
010880120827               07 ln_F6_CLB_Amt             PIC S9(07)V99.
010890120827               07 ln_F6_Cdn_Grant_Amt       PIC S9(07)V99.
010900120827               07 ln_F6_IQEE_Balance        PIC S9(07)V99.
010910120827               07 li_F6_Benef_SIN           PIC S9(09).
010920120827               07 lc_F6_Benef_LastName      PIC  X(20).
010930120827               07 lc_F6_Benef_FirstName     PIC  X(20).
010940120827               07 li_F6_Benef_DOB           PIC S9(08).
010950120827               07 li_F6_Benef_Sex           PIC S9(01).
010960120827               07 lc_F6_Tax_Reason_Code     PIC  X(02).
010970120827               07 lc_F6_Estb_Postal_Code    PIC  X(10).
010980120827               07 lc_F6_Estb_Name           PIC  X(150).
010990160219      * RFS145606 - START
011000160219               07 lc_F6_PrescribdForm       PIC  X(49).
011010160219               07 lc_F6_MRQ_Trans_Id        PIC  X(15).
011020160219      * RFS145606 - END
011030120827      * RFS 78268 - Start
011040120827      *        07 lc_F6_Filler              PIC  X(662).
011050120827               07 li_F6_Beneficiary_Seq_No  PIC S9(03).
011060120827               07 lc_F6_ReversalFlag        PIC  X(01).
011070120827               07 lc_F6_CancelFlag          PIC  X(01).
011080120827               07 lc_F6_MRQ_Approval_Status PIC  X(01).
011090120827               07 li_F6_MRQ_File_Date       PIC S9(08).
011100160219      * RFS145606 - START
011110160219      *        07 lc_F6_Filler              PIC  X(648).
011120160219               07 lc_F6_Filler              PIC  X(584).
011130160219      * RFS145606 - END
011140120827      * RFS 78268 - End
011150120827
011160120827       01 ltb_F6IndicatorsTable.
011170120827           05  ltb_F6Indicators          OCCURS 200 TIMES.
011180120827               07  ltb_F6Indicator       PIC S9(04) BINARY
011190120827                                         OCCURS 23  TIMES.
011200120827
01121012082758589 *Ends
011220120827
011230120827       01 lc_Current_02_Record.
011240120827          03 li_C_RecordType          PIC S9(02).
01125012082758589     03 li_C_Trxn_VersCde        PIC S9(01).
011260120827          03 li_C_FilingYear          PIC S9(04).
011270120827          03 lc_C_PromoterID          PIC  X(10).
011280120827          03 li_C_Account_No          PIC S9(15).
011290120827          03 li_C_SpecimenPlanNo      PIC S9(10).
011300120827          03 li_C_Plan_Setup_Date     PIC S9(08).
01131012082758589 *   03 lc_C_Resp_Type_Code      PIC  X(01).
01132012082758589     03 li_C_Resp_Type_Code      PIC S9(01).
01133012082758589     03 li_C_No_Years_QcResident PIC S9(02).
011340120827          03 ln_C_YTD_Amount          PIC S9(07)V99.
011350120827          03 ln_C_YTD_Transfer_Amount PIC S9(07)V99.
01136012082758589     03 ln_C_YTD_Deposit_Amount  PIC S9(07)V99.
011370120827          03 ln_C_LTD_Amount          PIC S9(07)V99.
011380120827      *RFS 78268 - Start  * regrouped the existed elements
01139012082778268     03 lc_C_Benef-rec           PIC X(224).
01140012082778268     03 lc_C_Benef-rec-x REDEFINES lc_C_Benef-rec.
011410120827             05 li_C_Benef_SIN           PIC S9(09).
011420120827             05 lc_C_Benef_LastName      PIC  X(20).
011430120827             05 lc_C_Benef_FirstName     PIC  X(20).
011440120827             05 li_C_Benef_DOB           PIC S9(08).
01145012082758589 *      05 lc_C_Benef_Sex           PIC  X(01).
01146012082758589        05 lc_C_Benef_Sex           PIC S9(01).
011470120827             05 lc_C_Benef_AptNo         PIC  X(06).
011480120827             05 lc_C_Benef_StreetNo      PIC  X(10).
011490120827             05 lc_C_Benef_StreetName    PIC  X(50).
011500120827             05 lc_C_Benef_AddLine2      PIC  X(14).
011510120827             05 lc_C_Benef_AddLine3      PIC  X(40).
011520120827             05 lc_C_Benef_City          PIC  X(30).
011530120827             05 lc_C_Benef_Prov          PIC  X(02).
011540120827             05 lc_C_Benef_Country       PIC  X(03).
011550120827             05 lc_C_Benef_PostalCode    PIC  X(10).
01156012082758589 *   03 lc_C_Benef_QcResident    PIC  X(01).
01157012082758589        05 li_C_Benef_QcResident    PIC S9(01).
011580120827      *RFS 78268 - End    * regrouped the existed elements
01159012082758589 *   03 lc_C_Subsc_Type          PIC  X(01).
01160012082758589     03 li_C_Subsc_Type          PIC S9(01).
011610120827          03 li_C_Subsc_SIN           PIC S9(09).
011620120827          03 lc_C_Subsc_BusNumber     PIC  X(10).
01163012082774636     03 lc_C_Subsc_Name          PIC  X(40).
01164012082774636     03 lc_C_Subsc_NameFields REDEFINES lc_C_Subsc_Name.
01165012082774636        05 lc_C_Subsc_LastName      PIC  X(20).
01166012082774636        05 lc_C_Subsc_FirstName     PIC  X(20).
011670120827          03 lc_C_Subsc_BenRelation   PIC  X(01).
011680120827          03 lc_C_Subsc_Address       PIC  X(175).
011690120827           03 lc_C_Subsc_AddressFields REDEFINES lc_C_Subsc_Address.
011700120827              05 lc_C_Subsc_AptNo      PIC X(06).
011710120827              05 lc_C_Subsc_StreetNo   PIC X(10).
011720120827              05 lc_C_Subsc_StreetName PIC X(50).
011730120827              05 lc_C_Subsc_AddrLine2  PIC X(14).
011740120827              05 lc_C_Subsc_AddrLine3  PIC X(40).
011750120827              05 lc_C_Subsc_City       PIC X(30).
011760120827              05 lc_C_Subsc_Prov       PIC X(02).
011770120827              05 lc_C_Subsc_Country    PIC X(03).
011780120827              05 lc_C_Subsc_PostalCode PIC X(10).
011790120827              05 lc_C_Subsc_Phone      PIC X(10).
011800120827          03 li_C_JoinSub_SIN         PIC S9(09).
011810120827          03 lc_C_JoinSub_LastName    PIC  X(20).
011820120827          03 lc_C_JoinSub_FirstName   PIC  X(20).
011830120827          03 lc_C_JoinSub_BenRelation PIC  X(01).
011840120827          03 lc_C_JoinSub_Phone       PIC  X(10).
01185012082758589 *   03 lc_C_PCG_Type_Code       PIC  X(01).
01186012082758589     03 li_C_PCG_Type_Code       PIC S9(01).
011870120827          03 li_C_PCG_SIN             PIC S9(09).
011880120827          03 lc_C_PCG_BusinessNo      PIC  X(10).
011890120827          03 lc_C_PCG_Name            PIC  X(40).
01190012082774636     03 lc_C_PCG_NameFields REDEFINES lc_C_PCG_Name.
01191012082774636        05 lc_C_PCG_LastName     PIC  X(20).
01192012082774636        05 lc_C_PCG_FirstName    PIC  X(20).
011930120827          03 lc_C_PCG_BenRelation     PIC  X(01).
01194012082752744 *   03 lc_C_PCG_AndAll_Filler   PIC  X(342).
01195012082752744     03 lc_C_PCG_Address         PIC  X(165).
01196012082752744     03 lc_C_PCG_PhoneNumber     PIC  X(10).
01197012082758589     03 lc_C_IQEE_Trnsfr_Ind     PIC S9(01).
01198012082758589 *   03 lc_C_PCG_AndAll_Filler   PIC  X(167).
011990160219      * RFS145606 - START
01200016021958589 *   03 lc_C_PCG_AndAll_Filler   PIC  X(154).
012010160219145606    03 lc_C_PrescribedForm      PIC  X(49).
012020160219          03 lc_C_MRQ_Trans_Id        PIC  X(15).
012030160219          03 lc_C_PCG_AndAll_Filler   PIC  X(90).
012040160219      * RFS145606 - END
012050120827      * RFS 78268 - Start
012060120827          03 lc_C_PCG_AndAll_FillerX REDEFINES lc_C_PCG_AndAll_Filler.
012070120827             05 lc_C_Status           PIC  X(01).
012080120827             05 lc_C_Mrq_File_DateX   PIC  X(08).
012090120827             05 lc_C_Mrq_File_Date_1 REDEFINES lc_C_Mrq_File_DateX.
012100120827                07 li_C_Mrq_File_Date PIC S9(08).
012110120827             05 lc_C_Ben_seq_nox      PIC  X(03).
012120120827             05 li_C_Ben_seq_no_1 REDEFINES lc_C_Ben_seq_nox.
012130120827                07 li_C_Ben_seq_no    PIC S9(03).
012140160219      * RFS145606 - START
012150160219      *      05 lc_C_Filler           PIC  X(142).
012160160219             05 lc_C_Filler           PIC  X(78).
012170160219      * RFS145606 - END
012180120827      * RFS 78268 - End
01219012082758589 *Begins
012200120827      * IQEE Transaction Request File Type 03
012210120827      * Beneficiary Replacement Events
012220120827       01 lc_Current_03_Record.
012230120827          03 li_C3_RecordType           PIC S9(02).
012240120827          03 li_C3_Trxn_VersCde         PIC S9(01).
012250120827          03 lc_C3_PromoterID           PIC  X(10).
012260120827          03 li_C3_Account_No           PIC S9(15).
012270120827          03 li_C3_SpecimenPlanNo       PIC S9(10).
012280120827          03 li_C3_Replacement_Date     PIC S9(08).
012290120827          03 lc_C3_Resp_Type_Code       PIC S9(01).
012300120827          03 li_C3_Benef_SIN_Old        PIC S9(09).
012310120827          03 lc_C3_Benef_LastName_Old   PIC  X(20).
012320120827          03 lc_C3_Benef_FirstName_Old  PIC  X(20).
012330120827          03 li_C3_Benef_DOB_Old        PIC S9(08).
012340120827          03 lc_C3_Benef_Sex_Old        PIC S9(01).
012350120827          03 li_C3_Benef_SIN_New        PIC S9(09).
012360120827          03 lc_C3_Benef_LastName_New   PIC  X(20).
012370120827          03 lc_C3_Benef_FirstName_New  PIC  X(20).
012380120827          03 li_C3_Benef_DOB_New        PIC S9(08).
012390120827          03 lc_C3_Benef_Sex_New        PIC S9(01).
012400120827          03 lc_C3_Benef_AptNo          PIC  X(06).
012410120827          03 lc_C3_Benef_StreetNo       PIC  X(10).
012420120827          03 lc_C3_Benef_StreetName     PIC  X(50).
012430120827          03 lc_C3_Benef_AddLine2       PIC  X(14).
012440120827          03 lc_C3_Benef_AddLine3       PIC  X(40).
012450120827          03 lc_C3_Benef_City           PIC  X(30).
012460120827          03 lc_C3_Benef_Prov           PIC  X(02).
012470120827          03 lc_C3_Benef_Country        PIC  X(03).
012480120827          03 lc_C3_Benef_PostalCode     PIC  X(10).
012490120827          03 lc_C3_Subsc_Type           PIC S9(01).
012500120827          03 li_C3_Benef_QcResident     PIC S9(01).
012510120827          03 lc_C3_Subsc_BenRelation    PIC S9(01).
012520130722119929    03 li_C3_Blood_Relative       PIC S9(01).
012530160219145606    03 lc_C3_MRQ_Trans_Id         PIC X(15).
012540120827      * RFS 78268 - Start
012550120827      *   03 lc_C3_Filler               PIC  X(669).
012560130718      * RFS119929 - Start
012570130718      *   03 lc_C3_Filler               PIC  X(669).
012580160219      * RFS145606 - START
012590160219      *   03 lc_C3_Filler               PIC  X(668).
012600160219          03 lc_C3_Filler               PIC  X(653).
012610160219      * RFS145606 - END
012620130718      * RFS119929 - End
012630120827          03 lc_C3_Fillerx   Redefines  lc_C3_Filler.
012640120827            05 li_C3_MRQ_File_Date         PIC S9(08).
012650120827            05 lc_C3_Mrq_Approval_Status   PIC  X(01).
012660120827            05 li_C3_Beneficiary_seq_no    PIC S9(03).
012670120827            05 li_C3_To_Beneficiary_seq_no PIC S9(03).
012680130719      * RFS119929 - Start
012690130719      *     05 lc_C3_Fillerxx              PIC  X(654).
012700160219      * RFS145606 - START
012710160219      *     05 lc_C3_Fillerxx              PIC  X(653).
012720160219            05 lc_C3_Fillerxx              PIC  X(638).
012730160219      * RFS145606 - END
012740130719      * RFS119929 - End
012750120827      *RFS 78268 - End
012760120827
01277012082773992 * reformat lc_Current_04_Record
012780120827      * IQEE Transaction Request File Type 04
012790120827      * Notional Transfer Events
012800120827       01 lc_Current_04_Record.
012810120827          03 lc_C4_Detail.
012820120827              05 li_C4_RecordType          PIC S9(02).
012830120827              05 li_C4_Trxn_VersCde        PIC S9(01).
012840120827              05 li_C4_TrusteeType         PIC S9(02).
012850120827              05 lc_C4_PromoterID          PIC  X(10).
012860120827              05 li_C4_Account_No          PIC S9(15).
012870120827              05 li_C4_SpecimenPlanNo      PIC S9(10).
012880120827              05 li_C4_Plan_Setup_Date     PIC S9(08).
012890120827              05 li_C4_Transfer_Date       PIC S9(08).
012900120827              05 ln_C4_Tot_Transfer_Amt    PIC S9(07)V99.
012910120827              05 ln_C4_MRQ_Assisted_Amt    PIC S9(07)V99.
012920140605      *RFS 135546 - Begins.
012930140604              05 ln_C4_MRQ_Assisted_Amt_1 REDEFINES
012940140604                 ln_C4_MRQ_Assisted_Amt            .
012950140604                 07 ln_C4_MRQ_Assisted_Amt_Sign PIC X(1).
012960140604                 07 ln_C4_MRQ_Assisted_Amt_R PIC S9(06)V99.
012970140605      *RFS 135546 - Ends.
012980120827              05 ln_C4_MRQ_Unassisted_Amt  PIC S9(07)V99.
01299012082790105         05 ln_C4_MRQ_Unassisted_Amt_1 REDEFINES
01300012082790105            ln_C4_MRQ_Unassisted_Amt           .
01301012082790105            07 ln_C4_MRQ_Unassisted_Amt_Sign PIC X(1).
01302012082790105            07 ln_C4_MRQ_Unassisted_Amt_R PIC S9(06)V99.
013030120827              05 li_C4_IQEE_Trnsfr_Amt     PIC S9(07)V99.
013040120827              05 lc_C4_PromoterID_Othr     PIC  X(10).
01305012082776555 *       05 li_C4_Account_No_Othr     PIC S9(15).
01306012082776555         05 li_C4_Account_No_Othr     PIC  X(15).
013070120827              05 li_C4_SpecimenPlanNo_Othr PIC S9(10).
013080120827              05 li_C4_Benef_SIN           PIC S9(09).
013090120827              05 lc_C4_Benef_LastName      PIC  X(20).
013100120827              05 lc_C4_Benef_FirstName     PIC  X(20).
013110120827              05 li_C4_Benef_DOB           PIC S9(08).
013120120827              05 lc_C4_Benef_Sex           PIC S9(01).
013130120827              05 lc_C4_Benef_AptNo         PIC  X(06).
013140120827              05 lc_C4_Benef_StreetNo      PIC  X(10).
013150120827              05 lc_C4_Benef_StreetName    PIC  X(50).
013160120827              05 lc_C4_Benef_AddLine2      PIC  X(14).
013170120827              05 lc_C4_Benef_AddLine3      PIC  X(40).
013180120827              05 lc_C4_Benef_City          PIC  X(30).
013190120827              05 lc_C4_Benef_Prov          PIC  X(02).
013200120827              05 lc_C4_Benef_Country       PIC  X(03).
013210120827              05 lc_C4_Benef_PostalCode    PIC  X(10).
013220120827              05 li_C4_Tot_Trnsfr_Ind      PIC S9(01).
013230120827              05 li_C4_AIP_Paid_Ind        PIC S9(01).
013240120827              05 ln_C4_Fair_Mkt_Value      PIC S9(07)V99.
013250120827              05 ln_C4_CLB_Amt             PIC S9(07)V99.
013260120827              05 li_C4_Auth_Trnsfr_Ind     PIC S9(01).
013270120827              05 lc_C4_Subsc_Type          PIC S9(01).
013280120827              05 li_C4_Subsc_SIN           PIC S9(09).
013290120827              05 lc_C4_Subsc_BusNumber     PIC  X(10).
01330012082774636         05 lc_C4_Subsc_Name          PIC  X(40).
01331012082774636         05 lc_C4_Subsc_NameFields REDEFINES lc_C4_Subsc_Name.
01332012082774636            07 lc_C4_Subsc_LastName   PIC  X(20).
01333012082774636            07 lc_C4_Subsc_FirstName  PIC  X(20).
013340120827              05 lc_C4_Subsc_BenRelation   PIC S9(01).
013350120827              05 lc_C4_Subsc_Address       PIC  X(175).
013360120827              05 lc_C4_Subsc_AddressFields
013370120827                       REDEFINES lc_C4_Subsc_Address.
013380120827                 07 lc_C4_Subsc_AptNo      PIC X(06).
013390120827                 07 lc_C4_Subsc_StreetNo   PIC X(10).
013400120827                 07 lc_C4_Subsc_StreetName PIC X(50).
013410120827                 07 lc_C4_Subsc_AddrLine2  PIC X(14).
013420120827                 07 lc_C4_Subsc_AddrLine3  PIC X(40).
013430120827                 07 lc_C4_Subsc_City       PIC X(30).
013440120827                 07 lc_C4_Subsc_Prov       PIC X(02).
013450120827                 07 lc_C4_Subsc_Country    PIC X(03).
013460120827                 07 lc_C4_Subsc_PostalCode PIC X(10).
013470120827                 07 lc_C4_Subsc_Phone      PIC X(10).
013480120827              05 li_C4_JoinSub_SIN          PIC S9(09).
013490120827              05 lc_C4_JoinSub_LastName     PIC  X(20).
013500120827              05 lc_C4_JoinSub_FirstName    PIC  X(20).
013510120827              05 li_C4_JoinSub_BenRelation  PIC S9(01).
013520120827              05 li_C4_JoinSub_Phone        PIC S9(10).
013530130718      * RFS119929 - Start
013540140603              05 ln_C4Pre2007UnassCap        PIC S9(7)V99.
013550140603      *RFS 135546 - Begins.
013560140603              05 ln_C4Pre2007UnassCap_1 REDEFINES
013570140603                 ln_C4Pre2007UnassCap                .
013580140603                07 ln_C4Pre2007UnassCap_Sign PIC X(1).
013590140603                07 ln_C4Pre2007UnassCap_R    PIC S9(6)V99.
013600140603      *RFS 135546 - Ends.
013610130814              05 ln_C4Post2007UnassCap      PIC S9(7)V99.
013620140603      *RFS 135546 - Begins.
013630140603              05 ln_C4Post2007UnassCap_1 REDEFINES
013640140603                 ln_C4Post2007UnassCap            .
013650140603                07 ln_C4Post2007UnassCap_Sign PIC X(1).
013660140603                07 ln_C4Post2007UnassCap_R    PIC S9(6)V99.
013670140603      *RFS 135546 - Ends.
013680130718      * RFS119929 - End
013690160219      * RFS145606 - START
013700160219              05 lc_C4_MRQ_Trans_Id           PIC  X(15).
013710160219      * RFS145606 - END
013720130712
01373012082773992 * use filler temporarily to store the transfer sequence number
01374012082773992 * and the beneficiary sequence number to be used when updating
01375012082773992 * the values in MFAARTNDP file (Update_TransferStatus)
01376012082773992     03 lc_C4_Filler.
01377012082773992         05 li_C4_TrnsfrSeq_No        PIC S9(07).
01378012082773992         05 li_C4_BenSeq_No           PIC S9(03).
01379012082774636 *       05 lc_C4_Filler2             PIC  X(305).
013800130712      * RFS119929 - Start
01381013071274636 *       05 lc_C4_Filler2             PIC  X(323).
013820160219      * RFS145606 - START
013830160219      *       05 lc_C4_Filler2             PIC  X(305).
013840160219              05 lc_C4_Filler2             PIC  X(290).
013850160219      * RFS145606 - END
013860130712      * RFS119929 - End
013870120827      * RFS 78268 - Start
013880120827              05 lc_C4_Filler2x       Redefines lc_C4_Filler2.
013890120827                 07 li_C4_MRQ_File_Date           PIC S9(08).
013900120827                 07 lc_C4_Mrq_Approval_Status     PIC  X(01).
013910120827                 07 lc_C4_Transfer_Status         PIC  X(01).
013920130719      * RFS119929 - Start
013930130719      *          07 lc_C4_Filler2xx               PIC  X(313).
013940160219      * RFS145606 - START
013950160219      *          07 lc_C4_Filler2xx               PIC  X(295).
013960160219                 07 lc_C4_Filler2xx               PIC  X(280).
013970160219      * RFS145606 - END
013980130719      * RFS119929 - End
013990120827      * RFS 78268 - End
01400012082773992 * end reformat lc_Current_04_Record
014010130712
014020130712      * RFS119929 - Start
014030130722      *01  lc_Current_04_InterplanRecord.
014040130722      *   03  lc_C4_InterplanDetail.
014050130722      *       05  li_C4RecordTypeI             PIC S9(02).
014060130722      *       05  li_C4TrxnVersCdeI            PIC S9(01).
014070130722      *       05  li_C4TrusteeTypeI            PIC S9(02).
014080130722      *       05  lc_C4PromoterIDI             PIC X(10).
014090130722      *       05  li_C4AccountNoI              PIC S9(15).
014100130722      *       05  li_C4SpecimenPlanNoI         PIC S9(10).
014110130722      *       05  li_C4PlanSetupDateI          PIC S9(08).
014120130722      *       05  li_C4TransferDateI           PIC S9(08).
014130130722      *       05  ln_C4TotTransferAmtI         PIC S9(07)V99.
014140130722      *       05  ln_C4MRQAssistedAmtI         PIC S9(07)V99.
014150130722      *       05  ln_C4MRQUnassistedAmtI       PIC S9(07)V99.
014160130722      *       05  li_C4IQEETrnsfrAmtI          PIC S9(07)V99.
014170130722      *       05  lc_C4PromoterIDOthrI         PIC X(10).
014180130722      *       05  li_C4AccountNo_OthrI         PIC X(15).
014190130722      *       05  li_C4SpecimenPlanNoOthrI     PIC S9(10).
014200130722      *       05  li_C4BenefSINI               PIC S9(09).
014210130722      *       05  lc_C4BenefLastNameI          PIC X(20).
014220130722      *       05  lc_C4BenefFirstNameI         PIC X(20).
014230130722      *       05  li_C4BenefDOBI               PIC S9(08).
014240130722      *       05  lc_C4BenefSexI               PIC S9(01).
014250130722      *       05  lc_C4BenefAptNoI             PIC X(06).
014260130722      *       05  lc_C4BenefStreetNoI          PIC X(10).
014270130722      *       05  lc_C4BenefStreetNameI        PIC X(50).
014280130722      *       05  lc_C4BenefAddLine2I          PIC X(14).
014290130722      *       05  lc_C4BenefAddLine3I          PIC X(40).
014300130722      *       05  lc_C4BenefCityI              PIC X(30).
014310130722      *       05  lc_C4BenefProvI              PIC X(02).
014320130722      *       05  lc_C4BenefCountryI           PIC X(03).
014330130722      *       05  lc_C4BenefPostalCodeI        PIC X(10).
014340130722      *       05  li_C4TotTrnsfrIndI           PIC S9(01).
014350130722      *       05  li_C4AIPPaidIndI             PIC S9(01).
014360130722      *       05  ln_C4FairMktValueI           PIC S9(07)V99.
014370130722      *       05  ln_C4CLBAmtI                 PIC S9(07)V99.
014380130722      *       05  li_C4AuthTrnsfrIndI          PIC S9(01).
014390130722      *       05  lc_C4SubscTypeI              PIC S9(01).
014400130722      *       05  li_C4SubscSINI               PIC S9(09).
014410130722      *       05  lc_C4SubscBusNumberI         PIC X(10).
014420130722      *       05  lc_C4SubscNameI              PIC X(40).
014430130722      *       05  lc_C4SubscNameFieldsI REDEFINES lc_C4SubscNameI.
014440130722      *          07  lc_C4SubscLastNameI       PIC X(20).
014450130722      *          07  lc_C4SubscFirstNameI      PIC X(20).
014460130722      *       05  lc_C4SubscBenRelationI       PIC S9(01).
014470130722      *       05  lc_C4SubscAddressI           PIC X(175).
014480130722      *       05  lc_C4SubscAddressFieldsI
014490130722      *                REDEFINES lc_C4SubscAddressI.
014500130722      *          07  lc_C4SubscAptNoI          PIC X(06).
014510130722      *          07  lc_C4SubscStreetNoI       PIC X(10).
014520130722      *          07  lc_C4SubscStreetNameI     PIC X(50).
014530130722      *          07  lc_C4SubscAddrLine2I      PIC X(14).
014540130722      *          07  lc_C4SubscAddrLine3I      PIC X(40).
014550130722      *          07  lc_C4SubscCityI           PIC X(30).
014560130722      *          07  lc_C4SubscProvI           PIC X(02).
014570130722      *          07  lc_C4SubscCountryI        PIC X(03).
014580130722      *          07  lc_C4SubscPostalCodeI     PIC X(10).
014590130722      *          07  lc_C4SubscPhoneI          PIC X(10).
014600130722      *       05  li_C4JoinSubSINI             PIC S9(09).
014610130722      *       05  lc_C4JoinSubLastNameI        PIC X(20).
014620130722      *       05  lc_C4JoinSubFirstNameI       PIC X(20).
014630130722      *       05  li_C4JoinSubBenRelationI     PIC S9(01).
014640130722      *       05  li_C4JoinSubPhoneI           PIC S9(10).
014650130722      *       05  ln_C4Pre2007UnassCapI        PIC S9(011)V99.
014660130722      *       05  ln_C4Post2007UnassCapI       PIC S9(011)V99.
014670130722      *   03  lc_C4FillerI                     PIC X(307).
014680130712
014690130712       01  WS-MFAPRCDTP.
014700130718          03  WS-AS-AT-DATE            PIC S9(08) VALUE ZEROES.
014710130718          03  FILLER                   PIC X(161).
014720130712
014730130712       01  LT-LITERALS.
014740130712           05 LT-MFAPRCDTP             PIC X(10) VALUE "MFAPRCDTP".
014750130712
014760130712      * RFS119929 - End
014770120827
014780120827109472 01 ln_MRQ_Unassisted_Amt_04         PIC  S9(07)V99 VALUE 0.
014790150507143887 01 ln_MRQ_Assisted_Amt_04           PIC  S9(07)V99 VALUE 0.
014800120827
01481012082773992 * The following record definition is used for the final input
01482012082773992 * with the required length of filler cleared out (see above)
01483012082773992  01 lc_Current_04_Record_Final.
01484012082773992 *   03 lc_C4_DetailFinal             PIC  X(685).
01485013071873992 *   03 lc_C4_FillerFinal             PIC  X(315).
014860130722      * RSF119929 - Start
01487013072274636 *   03 lc_C4_DetailFinal             PIC  X(667).
014880160222      * RFS145606 - START
014890160222      *   03 lc_C4_DetailFinal             PIC  X(685).
014900160222          03 lc_C4_DetailFinal             PIC  X(700).
014910160222      * RFS145606 - END
01492013071574636 *   03 lc_C4_FillerFinal             PIC  X(333).
014930130814          03 lc_C4_FillerFinal             PIC  X(315).
014940130715      * RFS119929 - End
014950120827
014960120827      * IQEE Transaction Request File Type 05
014970120827      * EAP/PSE Redemption Events
014980120827       01 lc_Current_05_Record.
014990120827          03 li_C5_RecordType          PIC S9(02).
015000120827          03 li_C5_Trxn_VersCde        PIC S9(01).
015010120827          03 li_C5_Payment_Type        PIC S9(02).
015020120827          03 lc_C5_PromoterID          PIC  X(10).
015030120827          03 li_C5_Account_No          PIC S9(15).
015040120827          03 li_C5_SpecimenPlanNo      PIC S9(10).
015050120827          03 li_C5_Payment_Date        PIC S9(08).
015060120827          03 li_C5_Accum_Income_Ind    PIC S9(01).
015070120827          03 ln_C5_Contr_Withdr_Amt    PIC S9(07)V99.
015080120827          03 ln_C5_IQEE_Amt_Paid       PIC S9(07)V99.
015090120827          03 ln_C5_EAP_Amt_Paid        PIC S9(07)V99.
015100120827          03 ln_C5_IQEE_Balance        PIC S9(07)V99.
015110120827          03 ln_C5_Fair_Mkt_Amt        PIC S9(07)V99.
015120120827          03 ln_C5_Tot_Contr_Paid      PIC S9(07)V99.
015130120827          03 ln_C5_OthrBen_CLB_Amt     PIC S9(07)V99.
015140120827          03 ln_C5_Benef_CLB_Amt       PIC S9(07)V99.
015150120827          03 ln_C5_Bal_Cdn_Grant       PIC S9(07)V99.
015160120827          03 ln_C5_Othr_ProvPgm_Amt    PIC S9(07)V99.
015170120827          03 li_C5_Benef_SIN           PIC S9(09).
015180120827          03 lc_C5_Benef_LastName      PIC  X(20).
015190120827          03 lc_C5_Benef_FirstName     PIC  X(20).
015200120827          03 li_C5_Benef_DOB           PIC S9(08).
015210120827          03 lc_C5_Benef_Sex           PIC S9(01).
015220120827          03 lc_C5_Benef_QcResident    PIC S9(01).
015230120827          03 li_C5_PSE_Pgm_Type        PIC S9(01).
015240120827          03 li_C5_PSE_Pgm_Length      PIC S9(01).
015250120827          03 li_C5_PSE_Pgm_Year        PIC S9(01).
015260120827          03 li_C5_AcadYr_Start_Date   PIC S9(08).
015270120827          03 li_C5_AcadYr_Lgth_Weeks   PIC S9(02).
015280120827          03 lc_C5_Educ_Postal_Code    PIC  X(10).
015290120827          03 lc_C5_Educ_Name           PIC  X(150).
015300160219      * RFS145606 - START
015310160219          03 lc_C5_MRQ_Trans_Id        PIC  X(15).
015320160219      *   03 lc_C5_Filler              PIC  X(629).
015330160219          03 lc_C5_Filler              PIC  X(614).
015340160219      * RFS145606 - END
015350120827      * RFS 78268 - Start
015360120827          03 lc_C5_Fillerx   redefines lc_C5_Filler.
015370120827            05 li_C5_Beneficiary_Seq_No  PIC S9(03).
015380120827            05 lc_C5_ReversalFlag        PIC  X(01).
015390120827            05 lc_C5_CancelFlag          PIC  X(01).
015400120827            05 lc_C5_MRQ_Approval_Status PIC  X(01).
015410120827            05 li_C5_MRQ_File_Date       PIC S9(08).
015420160219      * RFS145606 - START
015430160219      *     05 lc_C5_Fillerxx            PIC  X(615).
015440160219            05 lc_C5_Fillerxx            PIC  X(600).
015450160219      * RFS145606 - END
015460120827      * RFS 78268 - End
015470120827
015480120827      * IQEE Transaction Request File Type 06
015490120827      * Special Tax/Grant Repayment Events
015500120827       01 lc_Current_06_Record.
015510120827          03 li_C6_RecordType          PIC S9(02).
015520120827          03 li_C6_Trxn_VersCde        PIC S9(01).
015530120827          03 lc_C6_PromoterID          PIC  X(10).
015540120827          03 li_C6_Account_No          PIC S9(15).
015550120827          03 li_C6_SpecimenPlanNo      PIC S9(10).
015560120827          03 li_C6_Event_Date          PIC S9(08).
015570120827          03 ln_C6_Contr_Withdr_Amt    PIC S9(07)V99.
015580120827          03 ln_C6_IQEE_Refund_Amt     PIC S9(07)V99.
015590120827          03 ln_C6_EAP_WriteOff_Amt    PIC S9(07)V99.
015600120827          03 ln_C6_IQEE_Tot_Contr_Amt  PIC S9(07)V99.
015610120827          03 ln_C6_Fair_Mkt_Val_Amt    PIC S9(07)V99.
015620120827          03 ln_C6_CLB_Amt             PIC S9(07)V99.
015630120827          03 ln_C6_Cdn_Grant_Amt       PIC S9(07)V99.
015640120827          03 ln_C6_IQEE_Balance        PIC S9(07)V99.
015650120827          03 li_C6_Benef_SIN           PIC S9(09).
015660120827          03 lc_C6_Benef_LastName      PIC  X(20).
015670120827          03 lc_C6_Benef_FirstName     PIC  X(20).
015680120827          03 li_C6_Benef_DOB           PIC S9(08).
015690120827          03 li_C6_Benef_Sex           PIC S9(01).
015700120827          03 lc_C6_Tax_Reason_Code     PIC  X(02).
015710120827          03 lc_C6_Estb_Postal_Code    PIC  X(10).
015720120827          03 lc_C6_Estb_Name           PIC  X(150).
015730160219      * RFS145606 - START
015740160219          03 lc_C6_PrescribdForm       PIC  X(49).
015750160219          03 lc_C6_MRQ_Trans_Id        PIC  X(15).
015760160219      *   03 lc_C6_Filler              PIC  X(662).
015770160219          03 lc_C6_Filler              PIC  X(598).
015780160219      * RFS145606 - END
015790120827      * RFS 78268 - Start
015800120827          03 lc_C6_Fillerx    redefines   lc_C6_Filler.
015810120827            05 li_C6_Beneficiary_Seq_No  PIC S9(03).
015820120827            05 lc_C6_ReversalFlag        PIC  X(01).
015830120827            05 lc_C6_CancelFlag          PIC  X(01).
015840120827            05 lc_C6_MRQ_Approval_Status PIC  X(01).
015850120827            05 li_C6_MRQ_File_Date       PIC S9(08).
015860160219      *RFS145606 - START
015870160219      *     05 lc_C6_Fillerxx            PIC  X(648).
015880160219            05 lc_C6_Fillerxx            PIC  X(584).
015890160219      *RFS145606 - END
015900140923      *RFS139963 - Begins
015910140923       01 Lc_AccountNo_Out             PIC X(15).
015920140923       01 Li_AccountNo_In              PIC S9(15).
015930140923      *For 02 record type:
015940140923       01 lc_Temp_02_Record.
015950140923          03 Filler1                   PIC X(17).
015960140923          03 lc_temp_02_acct           PIC X(15).
015970140923          03 Filler2                   PIC X(968).
015980140923      *For 03 and 06 record type:
015990140923       01 lc_Temp_0306_Record.
016000140923          03 Filler3                   PIC X(13).
016010140923          03 lc_temp_0306_acct         PIC X(15).
016020140923          03 Filler4                   PIC X(972).
016030140923      *For 04 and 05 record type:
016040140923       01 lc_Temp_0405_Record.
016050140923          03 Filler5                   PIC X(15).
016060140923          03 lc_temp_0405_acct         PIC X(15).
016070150414      * RFS145431 - START
016080150414      *   03 Filler6                   PIC X(970).
016090160219      * RFS145606 - START
016100160219      *   03 DataOf04                  PIC X(655).
016110160219          03 DataOf04                  PIC X(670).
016120160219      *   03 FillerOf04                PIC X(315).
016130160219          03 FillerOf04                PIC X(300).
016140160219      * RFS145606 - END
016150150414      * RFS145431 - END
016160140923      *RFS139963 - Ends
016170120827
016180120827       01 li_F3_C_MRQ_File_Date          PIC  S9(08).
016190120827       01 li_F4_C_MRQ_File_Date          PIC  S9(08).
016200120827       01 li_F5_C_MRQ_File_Date          PIC  S9(08).
016210120827
016220120827       01 li_F3_C_Beneficiary_seq_no     PIC  S9(03).
016230120827       01 li_F5_C_Beneficiary_seq_no     PIC  S9(03).
016240120827       01 li_F6_C_Beneficiary_seq_no     PIC  S9(03).
016250120827
016260120827       01 li_F3_C_To_Beneficiary_seq_no  PIC  S9(03).
016270120827      * RFS 78268 - End
01628012082758589 *Ends
016290191030
016300191030      *RFS1019378 START
016310191106       01 lc_C_beneDOB_YYYY              PIC S9(04).
016320191106       01 li_C_beneDOB_YYYY REDEFINES lc_C_beneDOB_YYYY PIC S9(04).
016330191030      *RFS1019378 START
016340120827
016350120917      * RFS107668 - Start
016360121010       01  li_Report-Variables.
016370121010         03  lc_ReportFilingRectype         PIC      X(02).
016380121010         03  li_WK-Beneficiary-SIN          PIC     S9(09).
016390121010         03  li_WK-Contract-Start-Date      PIC     S9(08).
016400121010         03  li_WK-Beneficiary-DOB          PIC     S9(08).
016410121010         03  li_WK-RESP-Plan-Type           PIC     S9(01).
016420121010         03  li_WK-QC-Resident-Ind          PIC     S9(01).
016430121010         03  li_WK-Annual-Request-Amt       PIC  S9(07)V99.
016440121010         03  lc_WK-SpecTaxReasonCode        PIC      X(02).
016450121010         03  lc_WK-NEQ-of-Other-Agent       PIC      X(15).
016460121010         03  li_WK-Authorized-Trans-Ind     PIC     S9(01).
016470121010         03  li_WK-Total-Transfer-Ind       PIC     S9(01).
016480121010         03  li_WK-Total-Transfer-Amt       PIC  S9(07)V99.
016490121010         03  li_WK-Total-Assisted-Amt       PIC  S9(07)V99.
016500121010         03  li_WK-Total-Unassisted-Amt     PIC  S9(07)V99.
016510121010         03  li_WK-QESI-Amt-Received        PIC  S9(07)V99.
016520121010         03  lc_WK-Transfer-Status          PIC      X(01).
016530121010         03  li_02-Account-No               PIC     S9(15).
016540121010         03  li_02-MRQ-File-Date            PIC     S9(08).
016550121010         03  li_02-Ben-Seq-No               PIC     S9(03).
016560121010         03  li_02-Year                     PIC     S9(04).
016570121010         03  li_02-Plan-Setup-Date          PIC     S9(08).
016580121010         03  li_02-Ben-SIN                  PIC     S9(09).
016590121010         03  li_02-Ben-DOB                  PIC     S9(08).
016600121010         03  li_02-IND-SIB-Only             PIC     S9(01).
016610121010         03  li_02-Ben-QC-Resi-IND          PIC     S9(01).
016620121010         03  li_02-Net-contribution         PIC  S9(07)V99.
016630121010         03  lc_02-Ben-Name                 PIC      X(41).
016640121010         03  li_03-Account-No               PIC     S9(15).
016650121010         03  li_03-To-Ben-Seq-No            PIC     S9(03).
016660121010         03  li_03-TO-SIN                   PIC     S9(09).
016670121010         03  li_03-TO-DOB                   PIC     S9(08).
016680121010         03  li_03-Year                     PIC     S9(04).
016690121010         03  lc_03-Ben-Name                 PIC      X(41).
016700121010         03  li_05-Account-No               PIC     S9(15).
016710121010         03  li_05-Ben-Seq-No               PIC     S9(03).
016720121010         03  li_05-Ben-SIN                  PIC     S9(09).
016730121010         03  li_05-Ben-DOB                  PIC     S9(08).
016740121010         03  li_05-Year                     PIC     S9(04).
016750121010         03  lc_05-Ben-Name                 PIC      X(41).
016760121010         03  li_06-Account-No               PIC     S9(15).
016770121010         03  li_06-Ben-Seq-No               PIC     S9(03).
016780121010         03  lc_06-Spec-Tax-Reason          PIC      X(02).
016790121010         03  li_06-Ben-SIN                  PIC     S9(09).
016800121010         03  li_06-Ben-DOB                  PIC     S9(08).
016810121010         03  li_06-Year                     PIC     S9(04).
016820121010         03  lc_06-Ben-Name                 PIC      X(41).
016830121010         03  li_06-Contr-Withdrawal-Amt     PIC  S9(07)V99.
016840121010         03  li_04-Account-No               PIC     S9(15).
016850121010         03  li_04-Ben-Seq-No               PIC     S9(03).
016860121010         03  li_04-Transfer-Seq-No          PIC     S9(07).
016870121010         03  li_04-Transfer-Date            PIC     S9(08).
016880121010         03  li_04-MRQ-File-Date            PIC     S9(08).
016890121010         03  li_04-Txn-Vers-Code            PIC     S9(01).
016900121010         03  li_04-Pln-Setup-Date           PIC     S9(08).
016910121010         03  li_04-Ben-SIN                  PIC     S9(09).
016920121010         03  lc_04-Ben-Name                 PIC      X(41).
016930121010         03  lc_04-Quebec-Enterprise-No     PIC      X(10).
016940121010         03  li_04-Authorized-Transf-1      PIC     S9(01).
016950121010         03  li_04-Transf-Ind-1             PIC     S9(01).
016960121010         03  li_04-Tot-Transf-Value         PIC  S9(07)V99.
016970121010         03  li_04-MRQ-Assis-capital        PIC  S9(07)V99.
016980121010         03  li_04-MRQ-Unassis-Capital      PIC  S9(07)V99.
016990121010         03  li_04-IQEE-Recei-Amt           PIC  S9(07)V99.
017000121010         03  li_04-Year                     PIC     S9(04).
017010121010         03  li_04-Ben-DOB                  PIC     S9(08).
017020121010         03  lc_04-Transf-Status            PIC      X(01).
017030120926       01  li_WKQESI-Year                 PIC     S9(04).
017040120926       01  li_Rec-Cnt                     PIC     S9(01).
017050120925
017060120924       01  li_Variance-Constants.
017070120924         03  lnc_Acct-No                  PIC      X(30)
017080120924                                 VALUE  "Account No".
017090120924         03  lnc_Ben-SIN                  PIC      X(30)
017100120924                                 VALUE  "Beneficiary SIN#".
017110120924         03  lnc_Year                     PIC      X(30)
017120120924                                 VALUE  "Year".
017130120924         03  lnc_Cont-Start-Dte           PIC      X(30)
017140120924                                 VALUE  "Contract Start Date".
017150120924         03  lnc_Ben-DOB                  PIC      X(30)
017160120924                                 VALUE  "Beneficiary DOB".
017170120924         03  lnc_RESP-Pln-Type            PIC      X(30)
017180120924                                 VALUE  "RESP Plan Type".
017190120924         03  lnc_QC-Resi-Ind              PIC      X(30)
017200120924                                 VALUE  "QC Resident Ind".
017210120924         03  lnc_Annual-Req-Amt           PIC      X(30)
017220120924                                 VALUE  "Annual Request Amt".
017230120924         03  lnc_MRQ-File-Date            PIC      X(30)
017240120924                                 VALUE  "MRQ File Date".
017250120924         03  lnc_Mrq-Ver-Code             PIC      X(30)
017260120924                                 VALUE  "Mrq Version Code".
017270120924         03  lnc_Event-Date               PIC      X(30)
017280120924                                 VALUE  "Event Date".
017290120924         03  lnc_Special-Tax-Reason-Code  PIC      X(30)
017300120924                                 VALUE  "Special Tax reason code".
017310120924         03  lnc_NEQ-of-other-agent       PIC      X(30)
017320120924                                 VALUE  "NEQ# of other agent".
017330120924         03  lnc_Aut-Transf-Ind           PIC      X(30)
017340120924                                 VALUE  "Authorized transfer ind".
017350120924         03  lnc_Tot-Transf-Ind           PIC      X(30)
017360120924                                 VALUE  "Total transfer ind".
017370120924         03  lnc_Tot-Transf-Amt           PIC      X(30)
017380120924                                 VALUE  "Total Transfer Amount".
017390120924         03  lnc_Tot-Assis-Amt            PIC      X(30)
017400120924                                 VALUE  "Total Assisted Amount".
017410120924         03  lnc_Tot-Unassis-Amt          PIC      X(30)
017420120924                                 VALUE  "Total Unassisted Amount".
017430120924         03  lnc_QESI-Amt-Received        PIC      X(30)
017440120924                                 VALUE  "QESI Amount Received".
017450120924         03  lnc_Transf-Status            PIC      X(30)
017460120924                                 VALUE  "Transfer status".
017470120924      * RFS107668 - End
017480120917
017490120827       01 lc_RecordToInsert            PIC X(1000) VALUE SPACES.
017500120827       01 lc_Iqee_Header.
017510120827          03 lc_Header_RecordType    PIC X(02) VALUE "01".
017520120827          03 lc_Header_PromoterID    PIC X(10) VALUE SPACES.
017530120827          03 lc_Header_Filler        PIC X(988) VALUE SPACES.
017540120827       01  lc_Iqee_Trailer.
017550120827          03 lc_Trailer_RecordType   PIC X(02) VALUE "99".
017560120827          03 lc_Trailer_PromoterID   PIC X(10) VALUE SPACES.
017570120827          03 lc_Trailer_NoOfRecords  PIC X(09) VALUE SPACES.
017580120827          03 lc_Trailer_Filler       PIC X(979) VALUE SPACES.
017590120827
017600120827       01 lc_Resp_Parms                PIC X(1000) VALUES SPACES.
017610120827       01 lc_Resp_ParmsFields REDEFINES lc_Resp_Parms.
017620120827          03   lc_QC_BusinessNo        PIC X(10).
017630120827          03   lc_FilingYear           PIC X(04).
017640120827          03   li_FilingYear   REDEFINES lc_FilingYear PIC S9(04).
017650120827          03   lc_Last_FillingDate     PIC X(08).
017660120827      * RFS78268 - Start
017670120827      *   03   lc_Resp_Filler          PIC X(978).
017680120827          03   lc_MaxAcadYrLength      PIC X(03).
017690120827          03   li_MaxAcadYrLength  REDEFINES
017700120827               lc_MaxAcadYrLength      PIC S9(03).
017710120827          03   lc_FilingCutOff         PIC X(04).
017720120827      *        RFS78268.17 - Begins - Fix spelling
017730120827      *   03   Li_FilingCuttoffMMDD REDEFINES
017740120827          03   Li_FilingCutoffMMDD REDEFINES
017750120827      *        RFS78268.17 - Ends
017760120827               lc_FilingCutOff          PIC S9(04).
017770120827          03   lc_Resp_Filler          PIC X(971).
017780120827
017790120827      * RFS78268 - End
017800120827
017810120827      * RFS 52744 - start
017820120827       01 li_Investor_No              PIC S9(9) COMP-3 VALUE 0.
017830120827       01 lc_Area_Code                PIC X(3)         VALUE SPACES.
017840120827       01 lc_Phone_No                 PIC X(7)         VALUE SPACES.
017850120827
017860120827       01 Lb-EOF-IVRTEP               PIC X(01).
017870120827         88 Lb-EOF-IVRTEP-YES          VALUE "Y".
017880120827         88 Lb-EOF-IVRTEP-NO           VALUE "N".
017890120827
017900120827      * RFS 52744 - end
017910120827
01792012082757825  01 Lc_Recipient_Type           PIC X(01) VALUE " ".
01793012082774636  01 li_PCGSeqNo                 PIC S9(02) VALUE 0.
017940120827
01795012082774636  01 Lb-EOF-PCG                  PIC X(01).
01796012082774636    88 Lb-EOF-PCG-YES              VALUE "Y".
01797012082774636    88 Lb-EOF-PCG-NO               VALUE "N".
017980120827
01799012082792917  01 WS-MODULE-ID                PIC X(10).
018000140616
018010140616      *RFS136198 - Start
018020140616       01 lc_ModuleID                 PIC X(10).
018030140616       01 lc_SpecModIQEE3             PIC X(01).
018040140616      *RFS136198 - End
018050120827
018060120827      *RFS 78268 - Start
018070120827       01 ltr_02FilingLog.   COPY DD-ALL-FORMATS OF MFAMRQRQP.
018080120827
018090120827       01 Ltr_03FilingLog.   COPY DD-ALL-FORMATS OF MFAMRQBRP.
018100120827
018110120827       01 Ltr_04FilingLog.   COPY DD-ALL-FORMATS OF MFAMRQXFP.
018120120827
018130120827       01 ltr_05FilingLog.   COPY DD-ALL-FORMATS OF MFAMRQTP.
018140120827
018150120827       01 ltr_06FilingLog.   COPY DD-ALL-FORMATS OF MFAMRQTXP.
018160120827
018170120827       01 lc_Current_06_Record_BKP        PIC X(1000) VALUE  SPACES.
018180170124
018190170124164896 01 lc_Current_06_Record_BKP1.
018200170124164896    03 Filler1                   PIC X(176).
018210170131164896    03 li_Tax_Reason_Code        PIC S9(02).
018220170124164896    03 Filler2                   PIC X(822).
018230120827
018240120827       COPY Cpctlp.
018250120827
018260120827      *RFS 78268 - End
018270120827      * RFS 103463 - Start
018280120827       01 lc_AmendToZero                  PIC X(01) VALUE SPACES.
018290120827          88 lb_AmendToZeroYes                       VALUE "Y".
018300120827          88 lb_AmendToZeroNo                        VALUE "N" " ".
018310120827      * RFS 103463 - End
018320120827      * RFS 109558 - Start
018330120827       01  lc_Original02Filed             PIC X(01).
018340120827           88 Lb_Original02FiledYes       VALUE "Y".
018350120827           88 Lb_Original02FiledNo        VALUE "N".
018360120827       01  lc_Original06Filed             PIC X(01).
018370120827           88 Lb_Original06FiledYes       VALUE "Y".
018380120827           88 Lb_Original06FiledNo        VALUE "N".
018390120827       01  li_AmendTo0FileDate            PIC S9(08).
018400120827       01  li_HoldFileDate                PIC S9(08).
018410120827      * RFS 109558 - End
018420120827      * RFS 110780 Begin
018430120827       01  li_TransNo                     PIC S9(09)  VALUE 0.
018440120827       01  li_PlacementDate               PIC S9(09)  VALUE 0.
018450120827       01  lnc_29                         PIC X(2)    VALUE "29".
018460120827       01  lc_Contr_Redem-Code            PIC X(6)    VALUE SPACES.
018470120827       01  lc_BeneSplitcode               PIC X(5)    VALUE SPACES.
018480120827      * RFS 110780 End
018490120827      * RFS 112178 - Start
018500120827       01  li_LastFiledSIN                PIC S9(09).
018510120827       01  li_LastFiledPlan               PIC S9(01).
018520120827      * RFS 112178 - End
018530121204      * RFS 105992 - Start
018540121204       01  lc_MrQBypassAge1617Rule        PIC X(01).
018550121204       01  li_CntHrdAdp                   PIC S9(10).
018560121204       01  li_CntMrqTsp                   PIC S9(10).
018570121205       01  lnc_7                          PIC X(01) VALUE "7".
018580121204       01  lnc_MfaHrdadp                  PIC X(10) VALUE "MFAHRDADP ".
018590121204       01  lnc_MfaMrqtsp                  PIC X(10) VALUE "MFAMRQTSP ".
018600121204       01  lnc_MfaAccbnp                  PIC X(10) VALUE "MFAACCBNP ".
018610141001
018620141001      *RFS132831 - Begins - New working storage variables
018630141001      *Constants
018640141001       01  Lncc_F                      PIC X VALUE "F".
018650141001       01  Lncc_V                      PIC X VALUE "V".
018660141001       01  Lnci_9                      PIC S9 VALUE 9.
018670141001      *Variable
018680141001       01  Li_RefileAccountNo          PIC S9(09).
018690141001       01  Li_RefileBeneSeq            PIC S9(03).
018700141001       01  Li_RefileToBeneSeq          PIC S9(03).
018710141001       01  Li_RefileTsfSeq             PIC S9(03).
018720141001       01  Li_RefileYear               PIC S9(04).
018730141001       01  Li_RefileYear1231           PIC S9(08).
018740141001       01  Li_RefileMrqFileDate        PIC S9(08).
018750141001       01  Li_RefileSuccessfulMrqFileDate PIC S9(08).
018760141001       01  Lc_RefileRecType            PIC X(02).
018770141001       01  Li_RefileEffectiveDate      PIC S9(08).
018780141001       01  Li_RefilePymtType           PIC S9(02).
018790141001       01  Li_RefileReasonCode         PIC X(02).
018800141001       01  Li_RefileVersion            PIC S9(1).
018810141001       01  Lc_RefileStatus             PIC X(1).
018820141001             88 Lb_RefileStatusCancel   VALUE "C".
018830141001             88 Lb_RefileStatusAmend    VALUE "M".
018840141001       01  Lc_RefileMode               PIC X(1).
018850141001             88 Lb_RefileModeVersion   VALUE "V".
018860141001             88 Lb_RefileModeFileDate  VALUE "F".
018870141001      *RFS132831 - Ends
018880141001
018890121204      * RFS 105992 - End
018900120925      * Linkage to fxiqenot program
018910120925107668 COPY CPIQENOT.
018920120827        LINKAGE SECTION.
018930120917      * RFS 107668 - Start
018940120918        01  lc_ReportMode                 PIC  X(01).
018950121008        01  li_ProcessFilingYear          PIC S9(04) COMP-3.
018960150306      * RFS 107668 - End
018970120827
018980120827      ********************
018990120917      * RFS107668 - Start
019000120917      *PROCEDURE DIVISION.
019010120917       PROCEDURE DIVISION USING lc_ReportMode
019020120917                                li_ProcessFilingYear.
019030120924      * RFS107668 - End
019040120827      ********************
019050120827      *---------*
019060141001       Mainline.
019070120827      *---------*
019080120827           PERFORM Initial_Steps.
019090120827      * RFS92917 - START
019100120827           IF  lb_EXTQESIYes
019110120827               PERFORM EXTQESI_Detail
019120120827               PERFORM EndOfProgram
019130120827           ELSE
019140120827      *    PERFORM Detail_Process.
019150120827      *    PERFORM EndOfProgram.
019160120827               PERFORM Detail_Process
019170120827               PERFORM EndOfProgram
019180120827           END-IF.
019190120827
019200120827      * Detail Processing para of 02,04,05 and 06 record types in
019210120827      * EXTQESI module
019220120827      *-------------
019230120827       EXTQESI_Detail.
019240120827      *-------------
019250120827           PERFORM InitialUpdate.
019260120827           PERFORM Create_Header.
019270120827           PERFORM CreateCursor.
019280120827           SET lb_EndOfCursorFalse TO TRUE.
019290120827           PERFORM Create_Request  UNTIL lb_EndOfCursorTrue.
019300120827           PERFORM CreateTransferCursor.
019310120827           SET lb_EndOfCursorFalse TO TRUE.
019320120827           PERFORM Create_Transfer UNTIL lb_EndOfCursorTrue.
019330130715      * RFS119929 - Start
019340130902      * RFS127392 - Start
019350130902      *    SET lb_EndOfCursorFalse TO TRUE.
019360130902      *    PERFORM Create_InterPlanTransferCursor UNTIL
019370130902      *            lb_EndOfCursorTrue.
019380130902           PERFORM Create_InterPlanTransferCursor.
019390130902      * RFS127392 - End
019400130718           SET lb_EndOfCursorFalse TO TRUE.
019410130718           PERFORM Create_InterPlanTransfer UNTIL lb_EndOfCursorTrue.
019420130715      * RFS119929 - End
019430120827           PERFORM EXTQESI_Type05.
019440120827           PERFORM EXTQESI_Type06.
019450120827      * 92917.8 - Start
019460120827           PERFORM Create_Trailer.
019470120827      * 92917.8 - End
019480120827      * RFS92917 - END
019490120827
019500120827      *---------------
019510120827       Detail_Process.
019520120827      *---------------
019530120827      *    PERFORM InitialUpdate.
01954012082774636      PERFORM InitialUpdate.
019550120827           PERFORM Create_Header.
019560120827
019570120827      *Process Type 02 Records
019580120827           PERFORM CreateCursor.
019590120827           SET lb_EndOfCursorFalse TO TRUE.
019600120827           PERFORM Create_Request UNTIL lb_EndOfCursorTrue.
019610120827
01962012082758589 *Begins
019630120827      *Process Type 03 Records
019640120827           PERFORM CreateReplacementCursor.
019650120827           SET lb_EndOfCursorFalse TO TRUE.
019660120827           PERFORM Create_Replacement UNTIL lb_EndOfCursorTrue.
019670120827
019680120827      *Process Type 04 Records
019690120827           PERFORM CreateTransferCursor.
019700120827           SET lb_EndOfCursorFalse TO TRUE.
019710120827           PERFORM Create_Transfer UNTIL lb_EndOfCursorTrue.
019720130709
019730130709      * RFS119929 - Start
019740130709      *Process Type 04 Trustee Type 03 Records
019750130715           PERFORM Create_InterPlanTransferCursor.
019760130709           SET lb_EndOfCursorFalse TO TRUE.
019770130709           PERFORM Create_InterPlanTransfer UNTIL lb_EndOfCursorTrue.
019780130709      * RFS119929 - End
019790130709
019800120827      *Process Type 05 Records
019810120827           PERFORM BuildEapPseTables.
019820120827           PERFORM CreateEapPseCursor.
019830120827           SET lb_EndOfCursorFalse TO TRUE.
019840120827           PERFORM Create_EapPse UNTIL lb_EndOfCursorTrue.
019850120827
019860120827      *Process Type 06 Records
019870120827           PERFORM BuildType06Table.
019880120827           PERFORM CreateType06Cursor.
019890120827           SET lb_EndOfCursorFalse TO TRUE.
019900120827           PERFORM Create_Type06 UNTIL lb_EndOfCursorTrue.
01991012082758589 *Ends
019920120827
019930120827           PERFORM Create_Trailer.
019940120827
019950120827      *-------------
019960120827       CreateCursor.
019970120827      *-------------
019980120827           EXEC SQL
019990120827           DECLARE Main_Cursor CURSOR FOR
020000120827             SELECT DISTINCT
020010120827                :lnci_02,
02002012082758589           :lnci_0,
020030120827                ACBIRP.Year,
020040120827                :lc_Header_PromoterID,
020050120827                ACBIRP.Account_No,
020060120827                Coalesce(RESPTP.Specimen_Plan_No,"0"),
020070120827                ACCESP.Plan_Setup_Date,
020080120827                CASE
02009012082758589 *          WHEN ACCESP.Resp_Type_Code IN ("I","S") THEN "O"
02010012082758589 *          ELSE "N"
02011012082758589            WHEN ACCESP.Resp_Type_Code IN ("I","S") THEN 1
02012012082758589            ELSE 0
020130120827                END,
02014012082758589           ACBIRP.No_Of_Years_Qc_Resident,
02015012082774636 * Starts
020160120827      *         ACBIRP.YTD_Amount,
020170120827      *         ACBIRP.YTD_Transfer_Amount,
02018012082790105 *         CASE
02019012082790105 *          WHEN ACBIRP.YTD_Amount > 0 THEN
02020012082790105 *               ACBIRP.YTD_Amount
02021012082790105 *          ELSE 0
02022012082790105 *         END,
02023012082790105           CASE
02024012082790105            WHEN IQENOT.YTD_Amount > 0 THEN
02025012082790105                 IQENOT.YTD_Amount
02026012082790105            ELSE 0
02027012082790105           END,
020280120827      * Note: Type 02 records are only selected when
020290120827      * (ACBIRP.YTD_Amount + ACBIRP.YTD_Transfer_Amount) > 0
020300120827                CASE
020310120827      *RFS 90105 Begins
020320120827      *          WHEN ACBIRP.YTD_Transfer_Amount > 0
02033012082776555 *               AND ACBIRP.YTD_Amount > 0
02034012082776555 *               AND ACBIRP.YTD_Amount >= 0
020350120827      *               THEN ACBIRP.YTD_Transfer_Amount
020360120827      *          WHEN ACBIRP.YTD_Transfer_Amount > 0
020370120827      *               AND ACBIRP.YTD_Amount < 0
020380120827      *               THEN
020390120827      *               (ACBIRP.YTD_Amount +
020400120827      *                      ACBIRP.YTD_Transfer_Amount)
020410120827                 WHEN IQENOT.YTD_Transfer_Amount > 0
020420120827                      AND IQENOT.YTD_Amount >= 0
020430120827                      THEN IQENOT.YTD_Transfer_Amount
020440120827                 WHEN IQENOT.YTD_Transfer_Amount > 0
020450120827                      AND IQENOT.YTD_Amount < 0
020460120827                      THEN
020470120827                      (IQENOT.YTD_Amount +
020480120827                             IQENOT.YTD_Transfer_Amount)
020490120827                 ELSE 0
020500120827                END,
02051012082790105 *         (ACBIRP.YTD_Amount + ACBIRP.YTD_Transfer_Amount),
020520120827                (IQENOT.YTD_Amount + IQENOT.YTD_Transfer_Amount),
020530120827      *RFS 90105 Ends
02054012082774636 * Ends
02055012082790105 *         ACBIRP.LTD_Amount,
020560120827103067***       IQENOT.LTD_Amount,                                       90105
020570120827103067          0                ,
020580120827                ACBIRP.Social_Insurance_No,
020590120827                ACCBNP.Last_Name,
020600120827                ACCBNP.First_Name,
020610120827                ACCBNP.Date_Of_Birth,
02062012082758589 *         ACCBNP.Sex,
02063012082758589           CASE
02064012082758589            WHEN ACCBNP.Sex = "F" THEN 1
02065012082758589            WHEN ACCBNP.Sex = "M" THEN 2
02066012082758589            ELSE 0
02067012082758589           END,
020680120827
02069012082758589 *Begins
020700120827      *         ADDRB.Misc_First_Addr_Line,
020710120827      *         ADDRB.Street_No,
020720120827      *         SUBSTR (ADDRB.Street_Name,1,30) CONCAT
020730120827      *             SUBSTR (ADDRB.Street_Type_Code,1,6) CONCAT
020740120827      *                 SUBSTR (ADDRB.Street_Dirct_Code,1,2),
020750120827      *         ADDRB.Misc_Second_Addr_Line,
020760120827      *         CASE WHEN ADDRB.Country_Code = "CAN" THEN " "
02077012082754596b***            WHEN ADDRB.Country_Code = "USA" THEN ADDRB.City
020780120827  |   *              WHEN ADDRB.Country_Code = "USA"
02079012082754596e*              THEN PRVDC.Province_Code_Descr
020800120827      *              ELSE CNTRY.Country_Name
020810120827      *         END,
020820120827      *         ADDRB.City,
020830120827      *         CASE WHEN ADDRB.Country_Code = "CAN"
020840120827      *              THEN ADDRB.Province_Code
020850120827      *              ELSE " "
020860120827      *         END,
02087012082754596b***       ADDRB.Country_Code,
020880120827  |   *         CASE WHEN ADDRB.Country_Code IN("CAN","USA")
020890120827  |   *              THEN ADDRB.Country_Code
020900120827  |   *              ELSE :lncc_AUT
02091012082754596e*         END,
020920120827      *         ADDRB.Postal_Code,
020930120827      *         CASE WHEN ADDRB.Province_Code = "QC"  THEN "O"
020940120827      *              ELSE                                 "N"
020950120827      *         END,
020960120827
02097012082758589 *Begins
020980120827                ACBIRP.Misc_First_Addr_Line,
020990120827                ACBIRP.Street_No,
021000120827                SUBSTR (ACBIRP.Street_Name,1,30) CONCAT
021010120827                    SUBSTR (ACBIRP.Street_Type_Code,1,6) CONCAT
021020120827                        SUBSTR (ACBIRP.Street_Dirct_Code,1,2),
021030120827                ACBIRP.Misc_Second_Addr_Line,
021040120827                CASE WHEN ACBIRP.Country_Code = "CAN" THEN " "
021050120827                     WHEN ACBIRP.Country_Code = "USA"
021060120827                     THEN PRVDC.Province_Code_Descr
021070120827                     ELSE CNTRY.Country_Name
021080120827                END,
021090120827                ACBIRP.City,
021100120827                CASE WHEN ACBIRP.Country_Code = "CAN"
021110120827                     THEN ACBIRP.Province_Code
021120120827                     ELSE " "
021130120827                END,
021140120827                CASE WHEN ACBIRP.Country_Code IN("CAN","USA")
021150120827                     THEN ACBIRP.Country_Code
021160120827                     ELSE :lncc_AUT
021170120827                END,
021180120827                ACBIRP.Postal_Code,
02119012082758589 *Ends
02120012082758589 *         CASE WHEN ACBIRP.Province_Code = "QC"  THEN "O"
02121012082758589 *              ELSE                                 "N"
02122012082758589           CASE WHEN ACBIRP.Qc_Resident_On_Dec31 = "Y"  THEN 1
02123012082758589                ELSE                                         0
021240120827                END,
021250120827
02126012082758589 *         CASE WHEN IVRTYP.Recipient_Type = "3" THEN "E"
02127012082758589 *         ELSE                                       "P"
02128012082758589           CASE WHEN IVRTYP.Recipient_Type = "3" THEN 2
02129012082758589           ELSE                                       1
021300120827                END,
021310120827                IVRP.Social_Insurance_No,
021320120827                Coalesce (IVRBNP.Business_Number_Revq, " "),
02133012082774636 *         IVRP.Last_Name,
02134012082774636 *         IVRP.First_Name,
02135012082774636           CASE
02136012082774636            WHEN IVRTYP.Recipient_Type = "3" THEN
02137012082774636                IVRP.Legal_Name
02138012082774636            ELSE
02139012082774636             SUBSTR (IVRP.Last_Name, 1, 20) CONCAT
02140012082774636             SUBSTR (IVRP.First_Name, 1, 20)
02141012082774636           END,
021420120827                CASE WHEN IVRTYP.Recipient_Type = "3" THEN "7"
021430120827                     ELSE Coalesce (BRELTP.Ben_Relation_Type_Xref, "1")
021440120827                END,
021450120827S.Addr          " ",
02146012082752744 * Joint subscriber info is done in a seperate routine
021470120827  ¦   *         Coalesce(IVRTEP.Social_Insurance_No, 0),
021480120827  ¦   *         Coalesce(IVRTEP.Last_Name, " "),
021490120827  ¦   *         Coalesce(IVRTEP.First_Name," "),
021500120827  ¦   *         Coalesce(BRELTP2.Ben_Relation_Type_XREF,"0"),
021510120827  ¦   *         "0",
021520120827  ¦   *         CASE WHEN Coalesce(IVRTEP.Phone_No, 0) = 0
021530120827  ¦   *              THEN "0000000000"
021540120827  ¦   *              ELSE SUBSTR (IVRTEP.Area_Code,1,3)
021550120827  ¦   *                   CONCAT SUBSTR (IVRTEP.Phone_No, 1,7)
021560120827  ¦   *         END,
021570120827  ¦             0,
021580120827  ¦             " ",
021590120827  ¦             " ",
021600120827  ¦             "0",
02161012082752744           " ",
02162012082774636 *         CASE WHEN Coalesce(ACPCGP.PCG_Type_Code, " ") = "P"
02163012082758589 *                   THEN "P"
02164012082774636 *                   THEN 1
02165012082774636 *              WHEN Coalesce(ACPCGP.PCG_Type_Code, " ")
02166012082758589 *                   IN ("A","E") THEN "E"
02167012082774636 *                   IN ("A","E") THEN 2
02168012082758589 *              ELSE " "
02169012082774636 *              ELSE 0
02170012082774636 *         END,
02171012082774636 *         Coalesce(ACPCGP.Social_Insurance_No, 0),
02172012082774636 *         Coalesce(ACPCGP.Business_Number_Revq, " "),
02173012082774636 *         CASE
02174012082774636 *          WHEN Coalesce(ACPCGP.PCG_Type_Code," ") = "P" THEN
02175012082774636 *           SUBSTR (ACPCGP.Last_Name, 1, 20) CONCAT
02176012082774636 *           SUBSTR (ACPCGP.First_Name, 1, 20)
02177012082774636 *          WHEN Coalesce(ACPCGP.PCG_Type_Code, " ") IN ("A","E")
02178012082774636 *            THEN ACPCGP.Business_Name
02179012082774636 *          ELSE " "
02180012082774636 *         END,
02181012082774636 *         CASE
02182012082774636 *          WHEN Coalesce(ACPCGP.PCG_Type_Code, " ") IN ("A","E")
02183012082774636 *          THEN "7"
02184012082752744 *          ELSE " "
02185012082774636 *          ELSE "0"
02186012082774636 *         END,
02187012082774636 *Primary Care Giver (PCG) Info is done in a separate routine
02188012082774636 *PCG Type, PCG SIN, PCG NEQ#, PCG Name, PCG Ben Rel (optional)
02189012082774636           0,
02190012082774636           0,
02191012082774636           " ",
02192012082774636           " ",
02193012082774636           0,
02194012082774636 *Primary Care Giver (PCG) Address is optional
02195012082752744           :lncc_Spaces_PCG_Address,
02196012082752744           "0000000000",
02197012082758589           0,
021980160219145606          :lncc_Spaces_49,
021990160219145606          :lncc_Spaces_15,
022000120827      * RFS78268 - Start
022010120918      * RFS107668 - Start
022020120918                CASE WHEN (:lc_ReportMode = :lncc_Y)
022030120918                     THEN "U"
022040120918                     ELSE ACBIRP.mrq_Approval_Status
022050120918                END,
022060120918      *         ACBIRP.mrq_Approval_Status,
022070120918      * RFS107668 - End
022080120827                ACBIRP.mrq_File_Date,
022090120827                ZONED(ACBIRP.Beneficiary_seq_no,3,0),
022100120827      * RFS78268 - End
022110120827                :lncc_Spaces
022120120827
022130120827      * ACC-BEN-IQEE-REQUEST-APP
022140120827             FROM MFAACBIRP  ACBIRP
022150120827
022160120827      * RFS90105 Begins
022170120827      * WKIQENOT
022180120827             INNER JOIN WKIQENOT IQENOT ON
022190120827               ACBIRP.ACCOUNT_NO = IQENOT.ACCOUNT_NO AND
022200120827               ACBIRP.BENEFICIARY_SEQ_NO = IQENOT.BENEFICIARY_SEQ_NO
022210120827               AND ACBIRP.YEAR = IQENOT.YEAR
022220120827      * RFS90105 Ends
022230120827
02224012082748928 * Exclude accounts with account attribute code NMRQ
02225012082748928        EXCEPTION JOIN MFAACCATP ACCATP ON
02226012082748928             ACCATP.Account_No = ACBIRP.Account_No AND
02227012082748928             ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
022280120827
022290120827      * ACCOUNT-RESP
022300120827             LEFT JOIN MFAACCESP ACCESP ON
022310120827                  ACBIRP.Account_No = ACCESP.Account_No
022320120827      * ACCOUNT
022330120827             LEFT JOIN MFAACCNTP ACCNTP ON
022340120827                  ACBIRP.Account_No = ACCNTP.Account_No
022350120827      * RESP-TYPE-SPECIMEN-PLAN
022360120827             LEFT OUTER JOIN MFARESPTP RESPTP ON
022370120827               ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code AND
022380120827               ACCESP.Resp_Type_Code = RESPTP.Resp_Type_Code
022390120827      * ACCOUNT-BENEFICIARY
022400120827             LEFT JOIN MFAACCBNP ACCBNP ON
022410120827                ACBIRP.Account_No = ACCBNP.Account_No AND
022420120827                ACBIRP.Beneficiary_Seq_No = ACCBNP.Beneficiary_Seq_No
022430120827      * BENEFICIARY-RELATIONSHIP-TYPES
022440120827             LEFT OUTER JOIN MFABRELTP BRELTP ON
022450120827               ACCBNP.Relationship_Type = BRELTP.Ben_Relation_Type_Code
022460120827      * ADDRESS (for Beneficiary)
02247012082758589 *      LEFT JOIN MFAADDP ADDRB ON
02248012082758589 *          ACCBNP.Addr_No = ADDRB.Addr_No
02249012082754596b* PROVINCE-CODES-DESCR
022500120827  |          LEFT JOIN MFAPRVDCP PRVDC ON
02251012082758589 *          ADDRB.Country_Code  = PRVDC.Country_Code
02252012082758589 *      AND ADDRB.Province_Code = PRVDC.Province_Code
02253012082758589            ACBIRP.Country_Code  = PRVDC.Country_Code
02254012082758589        AND ACBIRP.Province_Code = PRVDC.Province_Code
02255012082754596e       AND PRVDC.Language_Code = :lncc_E
022560120827      * COUNTRY
022570120827             LEFT JOIN MFACOUP CNTRY ON
02258012082758589 *          ADDRB.Country_Code = CNTRY.Country_Code
02259012082758589            ACBIRP.Country_Code = CNTRY.Country_Code
022600120827      * INVESTOR
022610120827             LEFT JOIN MFAIVRP IVRP ON
022620120827                  ACCNTP.Investor_No = IVRP.Investor_No
022630120827      * INVESTOR-TYPE
022640120827             LEFT JOIN MFAIVRTYP IVRTYP ON
022650120827                  IVRP.Investor_Type_Code = IVRTYP.Investor_Type_Code
022660120827      * INVESTOR-BUSINESS-NUMBERS
022670120827             LEFT OUTER JOIN MFAIVRBNP IVRBNP ON
022680120827                  IVRP.Investor_No = IVRBNP.Investor_No
02269012082758589 * INVESTOR-ADDRESS retrieved in separate routine
02270012082758589 *      LEFT JOIN MFAIVRADP IVRADP ON
02271012082758589 *           IVRP.Investor_No = IVRADP.Investor_No AND
02272012082758589 *           IVRADP.Addr_Type_Code = "IVR"
022730120827
022740120827      * INVESTOR-TENANTS
022750120827      *      LEFT OUTER JOIN MFAIVRTEP IVRTEP ON
022760120827      *           IVRP.Investor_No = IVRTEP.Investor_No AND
022770120827      *           IVRTEP.Tenant_Seq_No = 2
022780120827
022790120827      * BENEFICIARY-RELATIONSHIP-TYPES2
02280012082752744 *      LEFT OUTER JOIN MFABRELTP BRELTP2 ON
02281012082752744 *       IVRTEP.Relationship_Type = BRELTP2.Ben_Relation_Type_Code
022820120827
022830120827      * ACCOUNT-PRIMARY-CARE-GIVER
02284012082774636 * PCG Info retrieved in a separate routine
02285012082774636 *      LEFT OUTER JOIN MFAACPCGP ACPCGP ON
02286012082774636 *           ACBIRP.Account_No = ACPCGP.Account_No AND
02287012082774636 *           ACBIRP.PCG_Seq_No = ACPCGP.PCG_Seq_No
022880120827             WHERE
022890120827      *RFS106682- Start
02290012082758589 *         ACBIRP.Record_Type_2 = :lncc_02                 AND
02291012082758589 *         ACBIRP.QC_Resident_on_Dec31 = "Y"               AND
02292012082758589 *         ACBIRP.Beneficiary_Active_On_Dec31 = "Y"        AND
022930120827                ACBIRP.Record_Type_2 = :lncc_02                 AND
022940120930      * RFS107668 - START
022950120930               ((:lc_ReportMode = :lncc_Y  AND
022960120930                ((ACBIRP.Year BETWEEN :li_ProcessFilingYear AND
022970120930                 :li_Year2)
022980120930                 AND
022990120930                 ACBIRP.MRQ_FILE_DATE > :lnci_0)) OR
023000120930               (:lc_ReportMode <> :lncc_Y AND
023010120930      * RFS107668 - END
023020120827               ((ACBIRP.Mrq_Approval_Status IN(:lncc_U,
023030120827                                               :lncc_Refiling)  AND
023040120827                ACBIRP.QC_Resident_on_Dec31 = "Y"               AND
023050120827                ACBIRP.Beneficiary_Active_On_Dec31 = "Y")       OR
023060120827                ACBIRP.Mrq_Approval_Status IN(:lncc_M, :lncc_C,
023070120827                                              :lncc_O ))        AND
023080120827      *RFS106682- End
023090120827
023100120827      * RFS 105558 - Start
023110120827
023120120827      * RFS 78268 - Start
023130120827      *         (ACBIRP.Mrq_Approval_Status = :lncc_Refiling
023140120827      *          OR
023150120827      *           (ACBIRP.Mrq_Approval_Status = :lncc_Unfiled AND
023160120827      *           (ACBIRP.Mrq_Approval_Status
023170120827      *           IN(:lncc_Unfiled,
023180120827      *              :lncc_O, :lncc_M, :lncc_C) AND
023190120827      * RFS 78268 - End
023200120827      *            ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2)
023210120827      *         )                                               AND
023220120827      * RFS 109131 - start
023230120827      *         ((ACBIRP.Mrq_Approval_Status IN (:lncc_Refiling,
023240120827      *                                          :lncc_Unfiled)
023250120827      *           AND ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2)
023260120930                ((ACBIRP.Mrq_Approval_Status = :lncc_Unfiled
023270120930                  AND ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2)
023280120930                  OR
023290120930                 (ACBIRP.Mrq_Approval_Status = :lncc_Refiling
023300120930                  AND ACBIRP.Year <= :li_Year2)
023310120924      * RFS 109131 - End
023320120930                  OR  (ACBIRP.Mrq_Approval_Status
023330120930      * RFS107668 - START
023340120930      *               IN (:lncc_O, :lncc_M, :lncc_C))) AND
023350120930                      IN (:lncc_O, :lncc_M, :lncc_C))))) AND
023360120918      * RFS 107668 - End
023370120827      * RFS 105558 - End
023380120827
02339012082758589 *         ACBIRP.Ytd_Amount  > 0
02340012082758589 *90105    (ACBIRP.Ytd_Amount + ACBIRP.Ytd_Transfer_Amount) > 0
023410120827      * RFS 103461        - Starts
02342012082790105 *         (IQENOT.Ytd_Amount + IQENOT.Ytd_Transfer_Amount) > 0
023430120827                ((IQENOT.Ytd_Amount + IQENOT.Ytd_Transfer_Amount) > 0 )
023440120827                   OR
023450120827                ((IQENOT.Ytd_Amount + IQENOT.Ytd_Transfer_Amount) = 0
023460120827      * RFS 104214d - Begins - Allow the processing of 0 YTD if O/M/C
023470120827      *           AND ACBIRP.Mrq_Approval_Status = :Lncc_M)
023480120827                  AND ACBIRP.Mrq_Approval_Status
023490120827                      IN(:Lncc_M, :Lncc_O, :Lncc_C))
023500120827      * RFS 104214d - Ends
023510120827      * RFS 103461        - End
02352012082790105           AND IQENOT.REC_TYPE_2  = :lncc_02
023530120827
023540120827             FOR FETCH ONLY
023550120827             OPTIMIZE FOR ALL ROWS
023560120827           END-EXEC.
023570120827
023580120827           EXEC SQL
023590120827             OPEN Main_Cursor
023600120827           END-EXEC.
023610120827           EXEC SQL
023620120827           WHENEVER NOT FOUND CONTINUE
023630120827           END-EXEC.
023640120827
023650120827      *-------------
023660120827       Create_Header.
023670120827      *-------------
023680120827           MOVE lc_QC_BusinessNo  TO lc_Header_PromoterID.
023690120827           MOVE lc_Iqee_Header TO lc_RecordToInsert.
023700120827           PERFORM InsertRecord.
023710120827
023720120827      *-------------
023730120827       Create_Request.
023740120827      *-------------
023750120827
023760120827           INITIALIZE ltb_FetchMainCurTable.
023770120827           EXEC SQL
023780120827           WHENEVER NOT FOUND CONTINUE
023790120827           END-EXEC.
023800120827
023810120827           EXEC SQL
023820120827              FETCH NEXT FROM Main_Cursor
023830120827                FOR :lnci_MaxFetchRec ROWS
023840120827              INTO  :ltb_FetchCursor:ltb_Indicators
023850120827           END-EXEC.
023860120827
023870120827           MOVE SQLSTATE TO lc_sqlStates.
023880120827           EVALUATE TRUE
023890120827               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
023900120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
023910120827               WHEN lncc_sqlEnd
023920120827                    SET lb_EndOfCursorTrue TO TRUE
023930120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
023940120827               WHEN OTHER
023950120827                    SET lncc_Err_Fetch TO TRUE
023960120827      * RFS109131 - Start
023970120827      *             MOVE lncc_ErrorFetchingCursor
023980120827                    MOVE lncc_ErrorFetchingCursor_02
023990120827      * RFS109131 - End
024000120827                      TO lc_sqlErrShortDESCR
024010120827                    PERFORM SQLFailProcess
024020120827           END-EVALUATE.
024030120827
024040120827           COMPUTE li_Counter = 1.
024050120827           PERFORM GetNextRow          TEST BEFORE
024060120827             UNTIL li_Counter > li_NoOfRowsFetched.
024070120827
024080120827      *-----------
024090120827       GetNextRow.
024100120827
024110120827108180     SET Lb_PrevFiled02No TO TRUE.
024120120827109558     Set Lb_Original02FiledNo TO TRUE.
024130160212148410     Set Lb_BeneChangeNo      TO TRUE.
024140160212148410     Set Lb_CancelFromRecType02 TO TRUE.
024150120827           MOVE ltb_FetchCursor(li_Counter) TO lc_Current_02_Record.
024160141001      * RFS132831 - Begins - Evaluate for 'R'efile status
024170141001           IF lc_F_Status(li_Counter)  =  lncc_R
024180141001              PERFORM ResetRefileVariables
024190141001              COMPUTE Li_RefileAccountNo = li_C_Account_No
024200141001              COMPUTE Li_RefileBeneSeq   = li_C_Ben_seq_no
024210141001              COMPUTE Li_RefileYear      = li_C_FilingYear
024220141001              COMPUTE Li_RefileYear1231 =
024230141001                      (Li_C_FilingYear * 10000) + 1231
024240141001              COMPUTE Li_RefileMrqFileDate = li_C_Mrq_File_Date
024250141001              MOVE Lncc_02 TO Lc_RefileRecType
024260141001              COMPUTE Li_RefileEffectiveDate =
024270141001                      (Li_C_FilingYear * 10000) + 1231
024280141001              SET Lb_RefileModeVersion TO TRUE
024290141001              PERFORM GetRefileInfo
024300141001              IF Li_RefileVersion = Lnci_1 OR Lnci_2
024310141001                 SET Lb_RefileModeFileDate TO TRUE
024320150128                 PERFORM GetSuccReflDate
024330141001                 IF Li_RefileSuccessfulMrqFileDate NOT = 0
024340141001                    IF Li_RefileVersion = Lnci_1
024350141001                       MOVE Lncc_C TO lc_F_Status(li_Counter)
024360141001                    END-IF
024370141001                    IF Li_RefileVersion = Lnci_2
024380141001                       MOVE Lncc_M TO lc_F_Status(li_Counter)
024390141001                    END-IF
024400141001                    COMPUTE li_C_Mrq_File_Date =
024410141001                            Li_RefileSuccessfulMrqFileDate
024420150205                    COMPUTE li_F_MRQ_File_Date(li_Counter) =
024430150205                            Li_RefileSuccessfulMrqFileDate
024440141001      *             or leave as is (which is "R" which means original
024450141001      *             will be filed)
024460141001                 END-IF
024470141001              END-IF
024480141001           END-IF.
024490141001      * RFS132831 - Ends
024500120827      * RFS 104214 - Start
024510120827           IF lc_F_Status(li_Counter)  =  lncc_C OR lncc_M OR lncc_O
024520120827              MOVE li_C_Account_No         TO Li_LastFiledAccountNo
024530120827              MOVE li_C_Ben_seq_no         TO Li_LastFiledBeneSeq
024540120827              MOVE li_C_FilingYear         TO Li_LastFiledYear
024550120827              STRING li_C_FilingYear lnci_1231
024560120827                     DELIMITED BY SIZE INTO Li_LastFiledYear1231
024570120827              PERFORM GetLastFiledData
024580120827           END-IF.
024590120827      * RFS 104214 - End
024600120827      * RFS 78268 - Start
024610120827                Set  Lc_OriginalFound    To true
024620120827      *    RFS 104599 - Begins - Trigger cancellation only if last filed
024630120827      *                          was not a stand-alone cancellation
024640120827      **
024650120827      **RFS 104214 - Start
024660120827104214**   IF   lc_F_Status(li_Counter)  =  lncc_C OR lncc_M OR lncc_O
024670120827      **   IF   lc_F_Status(li_Counter)  =  lncc_C OR
024680120827      **        lc_F_Status(li_Counter)  =  lncc_M OR
024690120827      **       (lc_F_Status(li_Counter)  =  lncc_O AND
024700120827      **    NOT(Li_LastFiledRecType = "06"         AND
024710120827      **        Li_LastFiledVersion = 1))
024720120827      **RFS 104214 - End
024730120827           IF  (lc_F_Status(li_Counter)  =  lncc_C OR lncc_M OR lncc_O )
024740120827      *         AND
024750120827      *         NOT(Li_LastFiledRecType = SPACES)
024760120827      *    RFS 104599 - Ends
024770120827
024780120827                Set  Lc_OriginalNotFound To true
024790120827                INITIALIZE                  lc_Current_06_Record
024800120827                MOVE li_C_Account_No     TO li_C6_Account_No
024810120827                MOVE li_C_Ben_seq_no     TO li_C6_Beneficiary_Seq_no
024820120827                STRING li_C_FilingYear lnci_1231
024830120827                        DELIMITED BY SIZE INTO
024840120827                                             li_C6_Event_Date
024850120827                MOVE li_C_Mrq_File_Date  TO li_C6_MRQ_File_Date
024860120827                MOVE SPACES              TO lc_C6_Tax_Reason_Code
024870120827                MOVE lnci_6              TO li_C6_RecordType
024880120827      *         RFS78268.33 - Begins - Set AnyOriginal
024890120827      *                       If we find any type of original 02 or 06
024900120827      *                       for cancellation then OriginalFound should be set
024910120827                Set  Lb_AnyOriginalNotFound TO TRUE
024920120827      *         RFS78268.33 - Ends
024930120827
024940120827      * RFS106682 - START
024950120827104599*         IF Lb_PrevFiled02No
024960120827      *         PERFORM Generate06Cancellation
024970120827104599*         END-IF
024980120827                IF Lb_PrevFiled06Yes
024990120827                PERFORM Generate06Cancellation
025000120827                END-IF
025010120827      * RFS106682 - END
025020120827
025030120827                MOVE ltb_FetchCursor(li_Counter) TO
025040120827                                            lc_Current_02_Record
025050120827      * RFS106682 - START
025060120827      *         PERFORM Generate02Cancellation
025070120827      * RFS106682   - Start
025080120827                IF Lb_PrevFiled06No
025090120827                PERFORM Generate02Cancellation
025100120827      * RFS109558   - Start
025110120827                 ELSE
025120120827                 IF li_AmendTo0FileDate NOT = 0 AND
025130120827                    li_AmendTo0FileDate NOT = li_C_Mrq_File_Date
025140120827                    MOVE li_C_MRQ_File_Date    TO li_HoldFileDate
025150120827                    MOVE li_AmendTo0FileDate   TO li_C_MRQ_File_Date
025160120827                    PERFORM Generate02Cancellation
025170120827                    MOVE li_HoldFileDate       TO li_C_MRQ_File_Date
025180120827                    MOVE 0 to li_HoldFileDate
025190120827                 END-IF
025200120827      * RFS109558 - END
025210120827
025220120827                END-IF
025230120827      * RFS106682 - END
025240120827
025250120827      *         RFS78268.33 - Begins - Set OriginalNotFound based on Any
025260120827                IF Lb_AnyOriginalNotFound
025270120827                   SET Lc_OriginalNotFound TO TRUE
025280120827                ELSE
025290120827                   SET Lc_OriginalFound TO TRUE
025300120827                END-IF
025310120827      *         RFS78268.33 - Ends
025320120827           END-IF.
025330120827           MOVE ltb_FetchCursor(li_Counter) TO lc_Current_02_Record
025340120827
025350120827      *106682.5 For requests after 06 Cancellation ONLY we need to pick
025360120827      *up the new amendments
025370120827           IF li_C6_MRQ_File_Date IS NUMERIC
025380120827           EXEC SQL
025390120827                 SELECT COUNT(1)
025400120827                   INTO :li_CANCELLED_ONLY
025410120827                FROM   MFAMRQTXP
025420120827                WHERE  MFAMRQTXP.ACCOUNT_NO = :li_C6_Account_No
025430120827                  AND  MFAMRQTXP.BENEFICIARY_SEQ_NO =
025440120827                                              :li_C6_Beneficiary_Seq_No
025450120827                  AND  MFAMRQTXP.MRQ_FILE_DATE = :li_C6_MRQ_File_Date
025460120827                  AND  MFAMRQTXP.EVENT_DATE = :li_C6_Event_Date
025470120827                  AND  MFAMRQTXP.MRQ_Version_Code =  1
025480120827                  AND  NOT EXISTS
025490120827                        (SELECT 1
025500120827                         FROM   MFAMRQTXP
025510120827                         WHERE  MFAMRQTXP.ACCOUNT_NO = :li_C6_Account_No
025520120827                           AND  MFAMRQTXP.BENEFICIARY_SEQ_NO =
025530120827                                              :li_C6_Beneficiary_Seq_No
025540120827                  AND  MFAMRQTXP.MRQ_FILE_DATE = :li_C6_MRQ_File_Date
025550120827                  AND  MFAMRQTXP.EVENT_DATE = :li_C6_Event_Date
025560120827                  AND  MFAMRQTXP.MRQ_Version_Code <> 1
025570120827                   )
025580120827                        FETCH FIRST ROW ONLY
025590120827           END-EXEC
025600120827
025610120827            MOVE SQLSTATE TO lc_sqlStates
025620120827            IF  lncc_sqlSuccessful
025630120827               SET   lc_OriginalFound    TO TRUE
025640120827            END-IF
025650120827           END-IF
025660120827      *RFS106682.5 end
025670120827
025680120827           IF   Lc_OriginalFound
025690120827      * RFS 78268 - End
025700120827      *         RFS104214d - Begins - Don't file if YTD = 0 and Cancellation
025710120827      *         RFS104599  - Starts
025720120827104599*         IF   NOT (lc_F_Status(li_Counter) = lncc_C  AND
025730120827      *RFS106682 - Start
025740120827104599*         IF ((NOT (lc_F_Status(li_Counter) = lncc_C  AND
025750120827      *              (ln_C_YTD_Amount + ln_C_YTD_Transfer_Amount) = 0))
025760120827      *            AND ( NOT Lb_PrevFiled02Yes  AND
025770120827      *             ((ln_C_YTD_Amount + ln_C_YTD_Transfer_Amount) > 0)))
025780120827      *             OR Lb_PrevFiled02Yes
025790120827                IF ( NOT Lb_PrevFiled02Yes  AND
025800120827                    ((ln_C_YTD_Amount + ln_C_YTD_Transfer_Amount) > 0))
025810120827                    OR Lb_PrevFiled02Yes
025820120827      *RFS106682 - Ends
025830120827      *         RFS104599  - Ends
025840120827      *         RFS104214d - Ends
025850120827
02586012082774636           PERFORM Get_PCG_Info
025870120827                PERFORM Get_SubscriberAddress
025880120827      *RFS 57825 - Start
02589012082752744 *         PERFORM Get_Joint_Subscriber
025900120827                PERFORM Get_Recipient-Type
025910120827                IF Lc_Recipient_Type = "2"
025920120827                   PERFORM Get_Joint_Subscriber
025930120827                END-IF
025940120827      *RFS 57825 - End
025950120827      *RFS 78268 - Start
025960120827104214*         IF   lc_F_Status(li_Counter) = lncc_C OR lncc_M
025970120827104214*104599   IF   lc_F_Status(li_Counter) = lncc_M
025980120827
025990120827      * RFS106682 - START
026000120827104599*         IF   Lb_PrevFiled02Yes
026010120827      *               MOVE lnci_2 TO li_C_Trxn_VersCde
026020120827      *         END-IF
026030120827      * RFS109558 - START
026040120827      *         IF   Lb_PrevFiled02Yes  AND Lb_PrevFiled06No
026050120827      * RFS 112178 - Start
026060120827      *         IF   (Lb_PrevFiled02Yes  AND Lb_PrevFiled06No)
026070120827                IF ((Lb_PrevFiled02Yes  AND Lb_PrevFiled06No)
026080120827                                        AND
026090130715      * RFS119929 - Start
026100130715      *           (NOT(li_LastFiledSIN  NOT= li_C_Benef_SIN OR
026110160212      * RFS148410 - Start
026120160212      *           (NOT(li_LastFiledSIN  NOT= li_C_Benef_SIN)))
026130160212                  (NOT(li_LastFiledSIN  NOT= li_C_Benef_SIN)) AND
026140160212                   NOT Lb_BeneChangeYes)
026150160212      * RFS148410 - End
026160130715      *                li_LastFiledPlan NOT= li_C_Resp_Type_Code)))
026170130715      * RFS119929 -End
026180120827      * RFS 112178 - End
026190120827                                         OR
026200120827      * RFS 112178 - Start
026210120827      *               Lb_Original02FiledYes
026220120827                     (Lb_Original02FiledYes AND
026230130715      * RFS119929 - Start
026240130715      *              (NOT(li_LastFiledSIN   NOT=  li_C_Benef_SIN OR
026250130715                     (NOT(li_LastFiledSIN   NOT=  li_C_Benef_SIN)))
026260130715      *                   li_LastFiledPlan  NOT= li_C_Resp_Type_Code)))
026270130715      * RFS119929 - End
026280120827      * RFS 112178 - End
026290120827      * RFS109558 - END
026300120827                      MOVE lnci_2 TO li_C_Trxn_VersCde
026310120827                END-IF
026320120827      * RFS106682 - END
02633012082792917           INITIALIZE MFAMRQRQP OF ltr_02FilingLog
026340120827
026350120827                MOVE li_C_Account_No  TO ACCOUNT-NO
026360120827                                      OF ltr_02FilingLog
026370120827                MOVE li_C_Ben_seq_no  TO BENEFICIARY-SEQ-NO
026380120827                                      OF ltr_02FilingLog
026390120827                MOVE li_C_FilingYear  TO YEAR
026400120827                                      OF ltr_02FilingLog
026410120827                MOVE li_C_Benef_SIN   TO BEN-SIN
026420120827                                      OF ltr_02FilingLog
026430120926      * RFS107668 - Start Updates MRQ-FILE-DATE only if Report <> 'Y'
026440121018                IF lc_ReportMode NOT = lncc_Y
026450120921                  MOVE li_AsAtDate      TO MRQ-FILE-DATE
026460120921                                        OF ltr_02FilingLog
026470120921                END-IF
026480120921      *         MOVE li_AsAtDate      TO MRQ-FILE-DATE
026490120921      *                               OF ltr_02FilingLog
026500120926      * RFS107668 - End
026510120827                MOVE li_C_Trxn_VersCde TO  MRQ-VERSION-CODE
026520120827                                      OF ltr_02FilingLog
026530120827      *         RFS78268.17 - Begins - Log the BN
026540120827                MOVE lc_C_PromoterID  TO  VENDOR-BN
026550120827                                     OF ltr_02FilingLog
026560120827      *         RFS78268.17 - Ends
026570120827                MOVE li_C_SpecimenPlanNo  TO SPECIMEN-ID
026580120827                                      OF ltr_02FilingLog
026590120827                MOVE li_C_Plan_Setup_Date TO PLAN-SETUP-DATE
026600120827                                      OF ltr_02FilingLog
026610120827                MOVE li_C_Resp_Type_Code  TO IND-SIBLING-ONLY
026620120827                                      OF ltr_02FilingLog
026630120827                MOVE li_C_No_Years_QcResident TO
026640120827                     NO-OF-YEARS-QC-RESIDENT OF ltr_02FilingLog
026650120827      *RFS106682- Start
026660120827                IF  li_C_Benef_QcResident = ZERO
026670120827                    MOVE ZERO TO ln_C_YTD_Amount
026680120827                    MOVE ZERO TO ln_C_YTD_Transfer_Amount
026690120827                    MOVE ZERO TO ln_C_YTD_Deposit_Amount
026700120827                END-IF
026710120827      *RFS106682-End
026720121204      *RFS105992 - Start
026730121204      *  Perform CheckAge1617Rule and set
026740121204      *  ln_C_YTD_Amount ,
026750121204      *  ln_C_YTD_Transfer_Amount ,
026760121204      *  ln_C_YTD_Deposit_Amount    to zero if criteria is satisfied.
026770191024      *RFS1019378 START
026780191030           EXEC SQL
026790191106            select SUBSTR(TRIM(CHAR(:li_C_Benef_DOB)), 1, 4)
026800191106            into :lc_C_beneDOB_YYYY
026810191030            from sysibm.sysdummy1
026820191030           END-EXEC
026830191106           MOVE SQLSTATE TO lc_sqlStates
026840191106      *RFS1019378 END
026850191106           PERFORM CheckAge1617Rule
026860121204           IF lc_MrQBypassAge1617Rule    NOT = 'Y'           AND
026870191105
026880191105      *RFS1019378 START
026890191105              (li_C_FilingYear - li_C_beneDOB_YYYY) >= 16    and
026900191105      *RFS1019378 END
026910191105
026920121204              (li_CntMrqTsp NOT = 0 OR li_CntHrdAdp NOT = 0) AND
026930121204              li_C_Trxn_VersCde  = 02
026940121204              COMPUTE ln_C_YTD_Amount          = 0
026950121204              COMPUTE ln_C_YTD_Transfer_Amount = 0
026960191204              COMPUTE ln_C_YTD_Deposit_Amount  = 0
026970191106
026980121204           END-IF
026990121204      *RFS105992 - End
027000120827                MOVE ln_C_YTD_Amount      TO YTD-AMOUNT
027010120827                                      OF ltr_02FilingLog
027020120827                MOVE ln_C_YTD_Transfer_Amount TO YTD-TRANSFER-AMOUNT
027030120827                                      OF ltr_02FilingLog
027040120827                compute NET-CONTRIBUTION OF ltr_02FilingLog
027050120827                     = ln_C_YTD_Amount + ln_C_YTD_Transfer_Amount
027060120827                MOVE ln_C_LTD_Amount      TO LTD-AMOUNT
027070120827                                      OF ltr_02FilingLog
027080120827                MOVE lc_C_Benef_LastName  TO BEN-LAST-NAME
027090120827                                      OF ltr_02FilingLog
027100120827                MOVE lc_C_Benef_FirstName TO BEN-FIRST-NAME
027110120827                                      OF ltr_02FilingLog
027120120827                MOVE li_C_Benef_DOB TO BEN-DATE-OF-BIRTH
027130120827                                      OF ltr_02FilingLog
027140120827                MOVE lc_C_Benef_Sex TO BEN-GENDER
027150120827                                      OF ltr_02FilingLog
027160120827                MOVE li_C_Benef_QcResident TO BEN-QC-RESIDENT-IND
027170120827                                      OF ltr_02FilingLog
027180120827                MOVE li_C_Subsc_Type     TO SUBSCRIBER-TYPE
027190120827                                      OF ltr_02FilingLog
027200120827                MOVE li_C_Subsc_SIN      TO IVR-SIN
027210120827                                      OF ltr_02FilingLog
027220120827                MOVE lc_C_Subsc_BusNumber  TO IVR-BUSINESS-NUMBER-REVQ
027230120827                                      OF ltr_02FilingLog
027240120827                MOVE lc_C_Subsc_Name     TO IVR-NAME
027250120827                                      OF ltr_02FilingLog
027260120827                MOVE lc_C_Subsc_BenRelation TO IVR-BEN-RELATION
027270120827                                      OF ltr_02FilingLog
027280120827                MOVE lc_C_Subsc_Phone    TO IVR-PHONE-NUMBER
027290120827                                         OF ltr_02FilingLog
027300120827                MOVE li_C_JoinSub_SIN    TO JNT-SIN
027310120827                                         OF ltr_02FilingLog
027320120827                MOVE lc_C_JoinSub_LastName  TO JNT-LAST-NAME
027330120827                                         OF ltr_02FilingLog
027340120827                MOVE lc_C_JoinSub_FirstName TO JNT-FIRST-NAME
027350120827                                         OF ltr_02FilingLog
027360120827                MOVE lc_C_JoinSub_BenRelation TO JNT-BEN-RELATION
027370120827                                         OF ltr_02FilingLog
027380120827                MOVE lc_C_JoinSub_Phone  TO JNT-PHONE-NUMBER
027390120827                                         OF ltr_02FilingLog
027400120827                MOVE li_C_PCG_Type_Code  TO PCG-TYPE
027410120827                                         OF ltr_02FilingLog
027420120827                MOVE li_C_PCG_SIN        TO PCG-SIN
027430120827                                         OF ltr_02FilingLog
027440120827                MOVE lc_C_PCG_BusinessNo TO PCG-BUSINESS-NUMBER-REVQ
027450120827                                         OF ltr_02FilingLog
027460120827                MOVE lc_C_PCG_Name       TO PCG-NAME
027470120827                                         OF ltr_02FilingLog
027480120827                MOVE lc_C_PCG_BenRelation   TO PCG-BEN-RELATION
027490120827                                         OF ltr_02FilingLog
027500120827                MOVE lc_C_PCG_PhoneNumber   TO PCG-PHONE-NUMBER
027510120827                                         OF ltr_02FilingLog
027520120827                MOVE lc_C_IQEE_Trnsfr_Ind   TO QESI-ASSIGNMENT-IND
027530120827                                         OF ltr_02FilingLog
027540120827
027550120827                PERFORM Request_Address
027560120827
027570120827                MOVE Li_Fetch-Ben-AddrNo    TO Ben-Addr-No
027580120827                                         OF Ltr_02FilingLog
027590120827                MOVE Li_Fetch-Sub-AddrNo    TO Sub-Addr-No
027600120827                                         OF Ltr_02FilingLog
027610120827      * while filing status should always 'P'
027620120827                MOVE lncc_P              TO MRQ-APPROVAL-STATUS
027630120827                                         OF Ltr_02FilingLog
027640160219      * RFS145606 - START
027650160229                PERFORM NewSeqNoGen
027660160219                MOVE lc_mrq_trans_id     TO lc_C_MRQ_Trans_Id
027670160219                MOVE lc_mrq_trans_id     TO MRQ-TRANS-ID
027680160219                                         OF Ltr_02FilingLog
027690160219      * RFS145606 - END
027700120827                PERFORM Write02FilingLog
027710120827                MOVE SPACES              TO lc_C_PCG_AndAll_Filler
027720120827
027730160523      * RFS159637 - START
027740121018      * RFS 107542 - begins.
027750160523      *         MOVE lncc_PreScribedForm TO lc_C_PCG_AndAll_Filler
027760121018      * RFS 107542 - ends.
027770160523                MOVE lncc_PreScribedForm TO lc_C_PrescribedForm
027780160523      * RFS159637 - END
027790121018
027800120827      *RFS 78268 - End
027810140923      *RFS139963 - Begins
027820140923                MOVE lc_Current_02_Record TO lc_Temp_02_Record
027830140923                MOVE lc_temp_02_acct TO Li_AccountNo_In
027840140923                PERFORM AccountEdit
027850140923                MOVE Lc_AccountNo_Out  TO lc_temp_02_acct
027860140923                MOVE lc_Temp_02_Record TO lc_RecordToInsert
027870140923      *         MOVE lc_Current_02_Record TO lc_RecordToInsert
027880140923      *RFS139963 - Ends
027890120827                PERFORM InsertRecord
027900120827                PERFORM Update_ApprovalStatus
027910120827                COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
027920120827      *         RFS104214d - Begins - Don't file if YTD = 0 and Cancellation
027930120827      *                (But still update to P, since we filed a cancellation)
027940120827                ELSE
027950120827                   PERFORM Update_ApprovalStatus
027960120827                END-IF
027970120827      *         Above END-IF is for the end of IF NOT..statement
027980120827      *         RFS104214d - Ends
027990120827           END-IF.
028000120827                COMPUTE li_Counter = li_Counter + 1.
028010121204      * RFS 105992 - Start
028020121204      *  Determine if refusal reason is '7'.
028030121204      *  Select record from MFAHRDADP based on criteria.
028040121204      *  If record not found and EXTQESI module exists select record
028050121204      *  from MFAMRQTSP.
028060121204      *  If record found check Bypass Flag in account beneficiary table.
028070121204      *-------------
028080121204       CheckAge1617Rule.
028090121204      *-------------
028100121206           INITIALIZE li_CntHrdAdp
028110121206                      li_CntMrqTsp
028120121206                      lc_MrQBypassAge1617Rule.
028130121204           EXEC SQL
028140121204             SELECT COUNT(*)
028150121204             INTO :li_CntHrdAdp
028160121204             FROM MFAHRDADP HRDADP
028170121204             INNER JOIN MFATRNHAP TRNHAP ON
028180121204                  HRDADP.VENDOR_TRANSACTION_ID =
028190121204                  TRNHAP.VENDOR_TRANSACTION_ID
028200121204             INNER JOIN MFATRNP TRNP ON
028210121204                  TRNP.PLACEMENT_DATE    = TRNHAP.PLACEMENT_DATE   AND
028220121204                  TRNP.TRANS_NO          = TRNHAP.TRANS_NO
028230121204             WHERE
028240121204               TRNP.ACCOUNT_NO           = :li_C_Account_No        AND
028250121204               TRNHAP.BENEFICIARY_SEQ_NO = :li_C_Ben_seq_no        AND
028260121205               HRDADP.HRDC_REASON_CODE   = :lnc_7
028270190702      *RFS1015083 - START
028280190702               AND TRNP.REVERSE <> :Lncc_Y
028290190702      *RFS1015083 - Ends
028300121204             FETCH FIRST ROW ONLY
028310121204           END-EXEC.
028320121204
028330121204           MOVE SQLSTATE TO lc_sqlStates.
028340121204           IF NOT lncc_sqlSuccessful
028350121204              MOVE SQLSTATE     TO WS-SQLSTATE
028360121204              MOVE SQLCODE      TO WS-DSP-SQLCODE
028370121204              MOVE lnc_MfaHrdadp            TO lncc_FileName
028380121204              MOVE lncc_ErrorSelectingFile  TO lc_sqlErrShortDESCR
028390121204              PERFORM DISPLAYERROR
028400121204           END-IF.
028410121204
028420121204           IF li_CntHrdAdp = 0 AND lb_EXTQESIYes
028430121204            EXEC SQL
028440121204             SELECT COUNT(*)
028450121204             INTO :li_CntMrqTsp
028460121204             FROM MFAMRQTSP MRQTSP
028470121204             WHERE
028480121204                  MRQTSP.ACCOUNT_NO         = :li_C_Account_No  AND
028490121204                  MRQTSP.BENEFICIARY_SEQ_NO = :li_C_Ben_seq_no  AND
028500121205                  MRQTSP.HRDC_REASON_CODE   = :lnc_7
028510190702      *RFS1015083 - START
028520190702                  AND MRQTSP.REVERSAL_FLAG <> :Lncc_Y
028530190702      *RFS1015083 - Ends
028540121204             FETCH FIRST ROW ONLY
028550121204            END-EXEC
028560121204
028570121204              MOVE SQLSTATE TO lc_sqlStates
028580121204              IF NOT lncc_sqlSuccessful
028590121204                 MOVE SQLSTATE     TO WS-SQLSTATE
028600121204                 MOVE SQLCODE      TO WS-DSP-SQLCODE
028610121204                 MOVE lnc_MfaMrqtsp               TO lncc_FileName
028620121204                 MOVE lncc_ErrorSelectingFile  TO lc_sqlErrShortDESCR
028630121204                 PERFORM DISPLAYERROR
028640121204              END-IF
028650121204           END-IF.
028660121204
028670121204           IF li_CntMrqTsp NOT = 0 OR li_CntHrdAdp NOT = 0
028680121204            EXEC SQL
028690121204             SELECT MRQ_BYPASS_AGE1617_RULE
028700121204             INTO :lc_MrQBypassAge1617Rule
028710121204             FROM MFAACCBNP ACCBNP
028720121204             WHERE
028730121204                  ACCBNP.ACCOUNT_NO         = :li_C_Account_No     AND
028740121204                  ACCBNP.BENEFICIARY_SEQ_NO = :li_C_Ben_seq_no
028750121204             FETCH FIRST ROW ONLY
028760121204            END-EXEC
028770121204
028780121204              MOVE SQLSTATE TO lc_sqlStates
028790121204              IF NOT lncc_sqlSuccessful
028800121204                 MOVE SQLSTATE                 TO WS-SQLSTATE
028810121204                 MOVE SQLCODE                  TO WS-DSP-SQLCODE
028820121204                 MOVE lnc_MfaAccbnp            TO lncc_FileName
028830121204                 MOVE lncc_ErrorSelectingFile  TO lc_sqlErrShortDESCR
028840121204                 PERFORM DISPLAYERROR
028850121204              END-IF
028860121204           END-IF.
028870121204      * RFS 105992 - End
028880160219      * RFS145606 - START
028890160219      *---------------
028900160219       GetMRQTransID.
028910160219      *---------------
028920160219             EXEC SQL
028930160219                SELECT MAX(A) INTO
028940160222                       :lc_get_mrq_trans_id
028950160219                  FROM (
028960160222                        SELECT COALESCE(MAX(MRQRQP.MRQ_TRANS_ID)
028970160222                                 ," ") A
028980160219                          FROM MFAMRQRQP MRQRQP
028990160219                         WHERE MRQRQP.MRQ_FILE_DATE = :li_AsAtDate
029000160219                        UNION ALL
029010160222                        SELECT COALESCE(MAX(MRQBRP.MRQ_TRANS_ID)
029020160222                                 ," ") A
029030160219                          FROM MFAMRQBRP MRQBRP
029040160219                         WHERE MRQBRP.MRQ_FILE_DATE = :li_AsAtDate
029050160219                        UNION ALL
029060160222                        SELECT COALESCE(MAX(MRQXFP.MRQ_TRANS_ID)
029070160222                                 ," ") A
029080160219                          FROM MFAMRQXFP MRQXFP
029090160219                         WHERE MRQXFP.MRQ_FILE_DATE = :li_AsAtDate
029100160219                        UNION ALL
029110160222                        SELECT COALESCE(MAX(MRQTP.MRQ_TRANS_ID)
029120160222                                 ," ") A
029130160219                          FROM MFAMRQTP MRQTP
029140160219                         WHERE MRQTP.MRQ_FILE_DATE = :li_AsAtDate
029150160219                        UNION ALL
029160160222                        SELECT COALESCE(MAX(MRQTXP.MRQ_TRANS_ID)
029170160222                                 ," ") A
029180160219                          FROM MFAMRQTXP MRQTXP
029190160219                         WHERE MRQTXP.MRQ_FILE_DATE = :li_AsAtDate
029200160219                       ) AS TEMP
029210160219             END-EXEC.
029220160219             MOVE SQLSTATE TO lc_sqlStates.
029230160219             EVALUATE TRUE
029240160219             WHEN lncc_sqlSuccessful
029250160222                    IF lc_get_mrq_trans_id NOT = " "
029260160219                      MOVE lc_get_mrq_trans_id(9:7)
029270160219                             TO lc_seq_num
029280160222                    ELSE
029290160229                      INITIALIZE li_seq_num
029300160222                    END-IF
029310160219             WHEN lncc_sqlEnd
029320160229                  INITIALIZE li_seq_num
029330160219             WHEN OTHER
029340160219                  SET lncc_Err_Select TO TRUE
029350160219                  MOVE lncc_ErrorSelectingMax
029360160219                    TO lc_sqlErrShortDESCR
029370160219                  PERFORM SQLFailProcess
029380160219             END-EVALUATE.
029390160229      *---------------
029400160229       NewSeqNoGen.
029410160229      *---------------
029420160229             IF li_seq_num = 9999999
029430160229                INITIALIZE li_seq_num
029440160229                COMPUTE li_seq_num
029450160229                       = li_seq_num + 1
029460160229             ELSE
029470160229                COMPUTE li_seq_num
029480160229                       = li_seq_num + 1
029490160229             END-IF.
029500160229             STRING li_AsAtDate DELIMITED BY SIZE
029510160229                    li_seq_num  DELIMITED BY SIZE
029520160229                    INTO li_mrq_trans_id.
029530160219      * RFS145606 - END
029540120827
029550120827      * RFS 104214 - Start
029560120827      *-------------
029570120827       GetLastFiledData.
029580120827      *-------------
029590120827           INITIALIZE Li_LastFiledMrqFileDate.
029600120827           INITIALIZE Li_LastFiledVersion.
029610120827           INITIALIZE Li_LastFiledRecType.
029620120827      * RFS 112178 - Start
029630120827           INITIALIZE li_LastFiledSIN.
029640120827           INITIALIZE li_LastFiledPlan.
029650120827      * RFS 112178 - End
029660120827      * RFS 104599 - Start
029670120827
029680120827      * RFS104599 - Begins - Do not select Amend to zero for amendments
029690120827           Set Lb_PrevFiled02No TO TRUE.
029700120827           IF li_C_MRQ_File_Date is NUMERIC
029710120827           EXEC SQL
029720120827             SELECT COUNT(1)
029730120827               INTO :li_MFAMRQRQP-COUNT
029740120827               FROM MFAMRQRQP RQP
029750120827              WHERE RQP.ACCOUNT_NO         = :Li_LastFiledAccountNo
029760120827                AND RQP.BENEFICIARY_SEQ_NO = :Li_LastFiledBeneSeq
029770120827                AND RQP.YEAR               = :Li_LastFiledYear
029780120827                AND MRQ_FILE_DATE          = :li_C_MRQ_File_Date
029790120827                AND  MRQ_VERSION_CODE  <> :lnci_1
029800141001      * RFS132831 - Begins - select only non-error
029810141001                AND MRQ_APPROVAL_STATUS <> :Lncc_E
029820141001      * RFS132831 - Ends
029830120827                     FETCH FIRST ROW ONLY
029840120827           END-EXEC
029850120827
029860120827           MOVE SQLSTATE TO lc_sqlStates
029870120827           EVALUATE TRUE
029880120827               WHEN Not lncc_sqlSuccessful
029890120827                    CONTINUE
029900120827           END-EVALUATE
029910120827           END-IF
029920120827
029930120827           IF li_MFAMRQRQP-COUNT > 0
029940120827              Set Lb_PrevFiled02Yes TO TRUE
029950120827           END-IF
029960120827      * RFS 104599 - End
029970120827
029980120827      * RFS 109558 - Start
029990120827           INITIALIZE      li_AmendTo0FileDate
030000120827           EXEC SQL
030010120827             SELECT RQP.MRQ_File_Date
030020120827               INTO :li_AmendTo0FileDate
030030120827               FROM MFAMRQRQP RQP
030040120827              WHERE RQP.ACCOUNT_NO         = :Li_LastFiledAccountNo
030050120827                AND RQP.BENEFICIARY_SEQ_NO = :Li_LastFiledBeneSeq
030060120827                AND RQP.YEAR               = :Li_LastFiledYear
030070120827                AND  MRQ_VERSION_CODE      = :lnci_2
030080141001      * RFS132831 - Begins - select only non-error
030090141001                AND MRQ_APPROVAL_STATUS <> :Lncc_E
030100141001      * RFS132831 - Ends
030110120827                     FETCH FIRST ROW ONLY
030120120827           END-EXEC
030130120827
030140120827           MOVE SQLSTATE TO lc_sqlStates
030150120827           EVALUATE TRUE
030160120827               WHEN lncc_sqlSuccessful
030170120827                    Set Lb_Original02FiledYes TO TRUE
030180120827               WHEN Not lncc_sqlSuccessful
030190120827                    CONTINUE
030200120827           END-EVALUATE
030210120827
030220120827      *   Fetch record from MFAMRQTXP(record_type_06)
030230120827
030240120827           INITIALIZE li_MFAMRQTXP-COUNT
030250120827
030260120827           EXEC SQL
030270120827             SELECT COUNT(1)
030280120827               INTO :li_MFAMRQTXP-COUNT
030290120827               FROM MFAMRQTXP TXP
030300120827              WHERE TXP.ACCOUNT_NO         = :Li_LastFiledAccountNo
030310120827                AND TXP.BENEFICIARY_SEQ_NO = :Li_LastFiledBeneSeq
030320120827                AND TXP.EVENT_DATE         = :Li_LastFiledYear1231
030330120827                AND TXP.SPECIAL_TAX_REASON = :lc_C6_Tax_Reason_Code
030340120827                AND TXP.MRQ_VERSION_CODE   = :lnci_0
030350141001      * RFS132831 - Begins - select only non-error
030360141001                AND TXP.MRQ_APPROVAL_STATUS <> :Lncc_E
030370141001      * RFS132831 - Ends
030380120827              FETCH FIRST ROW ONLY
030390120827           END-EXEC
030400120827
030410120827           MOVE SQLSTATE TO lc_sqlStates
030420120827           EVALUATE TRUE
030430120827               WHEN Not lncc_sqlSuccessful
030440120827                    CONTINUE
030450120827           END-EVALUATE
030460120827
030470120827           IF li_MFAMRQTXP-COUNT > 0
030480120827              SET Lb_Original06FiledYes TO TRUE
030490120827           END-IF
030500120827
030510120827      * RFS 109558 - End
030520120827
030530120827      * RFS106682 - START
030540120827           Set Lb_PrevFiled06No TO TRUE.
030550120827           IF li_C_MRQ_File_Date is NUMERIC
030560120827           EXEC SQL
030570120827             SELECT COUNT(1)
030580120827               INTO :li_MFAMRQTXP-COUNT
030590120827               FROM MFAMRQTXP TXP
030600120827              WHERE TXP.ACCOUNT_NO         = :Li_LastFiledAccountNo
030610120827                AND TXP.BENEFICIARY_SEQ_NO = :Li_LastFiledBeneSeq
030620120827                AND TXP.EVENT_DATE         = :Li_LastFiledYear1231
030630120827                AND MRQ_FILE_DATE          = :li_C_MRQ_File_Date
030640120827                AND MRQ_VERSION_CODE      <> :lnci_1
030650141001      * RFS132831 - Begins - select only non-error
030660141001                AND TXP.MRQ_APPROVAL_STATUS <> :Lncc_E
030670141001      * RFS132831 - Ends
030680120827              FETCH FIRST ROW ONLY
030690120827           END-EXEC
030700120827
030710120827           MOVE SQLSTATE TO lc_sqlStates
030720120827           EVALUATE TRUE
030730120827               WHEN Not lncc_sqlSuccessful
030740120827                    CONTINUE
030750120827           END-EVALUATE
030760120827           END-IF
030770120827
030780120827           IF li_MFAMRQTXP-COUNT > 0
030790120827              Set Lb_PrevFiled06Yes TO TRUE
030800120827           END-IF
030810120827      * RFS106682 - END
030820120827
030830120827      * RFS 104599 - The purpose of this select is to determine if the last
030840120827      *              filing was just a cancellation or if it included an
030850120827      *              original or amendment.  If the last filing was only a
030860120827      *              cancellation, then no further cancellation is required
030870120827      *              and the cancellation process in the 02 or 06 process can
030880120827      *              be bypassed.
030890120827      *              This select will bring any original or amend into "last
030900120827      *              filed" and will remain blank if *only* a cancellation was
030910120827      *              filed
030920120827           EXEC SQL
030930120827             SELECT *
030940120827             INTO
030950121204      * RFS 116287 - Begins - Comment list and re-sequence
030960121204      *              **************************************************
030970121204      *              When adding fields to this selection, do so to the end
030980121204      *              of the list.  The sort order of the data retrieved from
030990121204      *              both tables needs to be in mrq_file_date descending
031000121204      *              **************************************************
031010120827      * RFS 112178 - Start
031020121204      *          :li_LastFiledSIN,
031030121204      *          :li_LastFiledPlan,
031040120827      * RFS 112178 - End
031050121204      *          :Li_LastFiledMrqFileDate,
031060121204      *          :Li_LastFiledVersion,
031070121204      *          :Li_LastFiledRecType
031080121204      *          New sequence
031090121204                 :Li_LastFiledMrqFileDate,
031100121204                 :Li_LastFiledVersion,
031110121204                 :Li_LastFiledRecType,
031120121204                 :li_LastFiledSIN,
031130121204                 :li_LastFiledPlan
031140121204      * RFS 116287 - Ends - Comment list and re-sequence
031150120827               FROM (SELECT
031160121204      * RFS 116287 - Begins - Comment list and re-sequence
031170120827      * RFS 112178 - Start
031180121204      *                     BEN_SIN,
031190121204      *                     IND_SIBLING_ONLY,
031200120827      * RFS 112178 - End
031210121204      *                     MRQ_FILE_DATE,
031220121204      *                     MRQ_VERSION_CODE,
031230121204      *                     RECORD_TYPE_2
031240121204      *              New sequence
031250121204                            MRQ_FILE_DATE,
031260121204                            MRQ_VERSION_CODE,
031270121204                            RECORD_TYPE_2,
031280121204                            BEN_SIN,
031290121204                            IND_SIBLING_ONLY
031300121204      * RFS 116287 - Ends - Comment list and re-sequence
031310120827                       FROM MFAMRQRQP
031320120827                      WHERE Account_no = :Li_LastFiledAccountNo
031330120827                        AND Beneficiary_seq_no = :Li_LastFiledBeneSeq
031340120827                        AND Year = :Li_LastFiledYear
031350120827      *                 RFS 104599 - Begins - Suppress cancellation
031360120827                        AND MRQ_VERSION_CODE <> :Lnci_1
031370120827      *                 RFS 104599 - Ends
031380141001      * RFS132831 - Begins - select only non-error
031390141002                        AND MRQ_APPROVAL_STATUS <> :Lncc_E
031400141001      * RFS132831 - Ends
031410120827                      UNION ALL
031420120827                     SELECT
031430121204      * RFS 116287 - Begins - Comment list and re-sequence
031440120827      * RFS 112178 - Start
031450121204      *                     BEN_SIN,
031460121204      *                     ZONED(0,1,0),
031470120827      * RFS 112178 - End
031480121204      *                     MRQ_FILE_DATE,
031490121204      *                     MRQ_VERSION_CODE,
031500121204      *                     RECORD_TYPE_2
031510121204      *              New sequence
031520121204                            MRQ_FILE_DATE,
031530121204                            MRQ_VERSION_CODE,
031540121204                            RECORD_TYPE_2,
031550121204                            BEN_SIN,
031560121204                            ZONED(0,1,0)
031570121204      * RFS 116287 - Ends - Comment list and re-sequence
031580120827                       FROM MFAMRQTXP
031590120827                      WHERE Account_no = :Li_LastFiledAccountNo
031600120827                        AND Beneficiary_seq_no = :Li_LastFiledBeneSeq
031610120827                        AND Event_Date = :Li_LastFiledYear1231
031620120827                        AND MRQ_FILE_DATE  <> :li_AsAtDate
031630120827                        AND SPECIAL_TAX_REASON = :lc_C6_Tax_Reason_Code
031640141001      * RFS132831 - Begins - select only non-error
031650141002                        AND MRQ_APPROVAL_STATUS <> :Lncc_E
031660141001      * RFS132831 - Ends
031670120827      *                 AND SPECIAL_TAX_REASON in("22","23","24")
031680120827      *                 RFS 104599 - Begins - Suppress cancellation
031690120827      *                AND MRQ_VERSION_CODE <> :Lnci_1
031700120827      *                 RFS 104599 - Ends
031710120827                        ) as DATA
031720120827                     ORDER BY 1 DESC
031730120827                     FETCH FIRST ROW ONLY
031740120827           END-EXEC
031750120827
031760120827           MOVE SQLSTATE TO lc_sqlStates.
031770120827           IF Not lncc_sqlSuccessful
031780120827              CONTINUE
031790120827           END-IF.
031800120827      * RFS 104214 - End
031810120827
03182012082758589 *Begins
031830120827      *------------------------
031840120827       CreateReplacementCursor.
031850120827      *------------------------
031860120827           EXEC SQL
031870120827           DECLARE Replacement_Cursor CURSOR FOR
031880120827             SELECT DISTINCT
031890120827                :lnci_03,
031900120827                :lnci_0,
031910120827                :lc_Header_PromoterID,
031920120827                ACCBRP.Account_No,
031930120827                Coalesce(RESPTP.Specimen_Plan_No,"0"),
031940120827                ACCBRP.Replacement_Date,
031950120827                CASE
031960151027142097*          WHEN ACCESP.Resp_Type_Code IN ("I","S") THEN 1
031970151027142097           WHEN ACCESP.Resp_Type_Code IN ("I","S")
031980201021      * RFS1104456 - Starts
031990201021142097*          AND Coalesce(BRELTP.Blood_Relative, "N") = "Y" THEN 1
032000201021                 AND (Coalesce(BRELTP.Blood_Relative, "N") = "Y" OR
032010201030                     ACCBRP.Relationship_Type = "S") AND
032020201030                 (CASE WHEN ACCBN2.DATE_OF_BIRTH > 0
032030201030                  THEN YEAR(
032040201030                  DATE(SUBSTR(CHAR(ACCBRP.REPLACEMENT_DATE),1,4)
032050201030                  || "-" || SUBSTR(CHAR(ACCBRP.REPLACEMENT_DATE),5,2)
032060201030                  || "-" || SUBSTR(CHAR(ACCBRP.REPLACEMENT_DATE),7,2))-
032070201030                     DATE(SUBSTR(CHAR(ACCBN2.DATE_OF_BIRTH),1,4)
032080201030                  || "-" || SUBSTR(CHAR(ACCBN2.DATE_OF_BIRTH),5,2)
032090201030                  || "-" || SUBSTR(CHAR(ACCBN2.DATE_OF_BIRTH),7,2)))
032100201030                  ELSE YEAR(
032110201030                        DATE(SUBSTR(CHAR(ACCBRP.REPLACEMENT_DATE),1,4)
032120201030                  || "-" || SUBSTR(CHAR(ACCBRP.REPLACEMENT_DATE),5,2)
032130201030                  || "-" || SUBSTR(CHAR(ACCBRP.REPLACEMENT_DATE),7,2))-
032140201030                        DATE("9999-12-31"))
032150201030                  END
032160201030                  ) < 21
032170201029                  THEN 1
032180201021      * RFS1104456 - Ends
032190120827                 ELSE 0
032200120827                END,
032210120827                ACCBN1.Social_Insurance_No,
032220120827                ACCBN1.Last_Name,
032230120827                ACCBN1.First_Name,
032240120827                ACCBN1.Date_Of_Birth,
032250120827                CASE
032260120827                 WHEN ACCBN1.Sex = "F" THEN 1
032270120827                 WHEN ACCBN1.Sex = "M" THEN 2
032280120827                 ELSE 0
032290120827                END,
032300120827                ACCBN2.Social_Insurance_No,
032310120827                ACCBN2.Last_Name,
032320120827                ACCBN2.First_Name,
032330120827                ACCBN2.Date_Of_Birth,
032340120827                CASE
032350120827                 WHEN ACCBN2.Sex = "F" THEN 1
032360120827                 WHEN ACCBN2.Sex = "M" THEN 2
032370120827                 ELSE 0
032380120827                END,
032390120827                ADDP.Misc_First_Addr_Line,
032400120827                ADDP.Street_No,
032410120827                SUBSTR (ADDP.Street_Name,1,30) CONCAT
032420120827                    SUBSTR (ADDP.Street_Type_Code,1,6) CONCAT
032430120827                        SUBSTR (ADDP.Street_Dirct_Code,1,2),
032440120827                ADDP.Misc_Second_Addr_Line,
032450120827                CASE WHEN ADDP.Country_Code = "CAN" THEN " "
032460120827                     WHEN ADDP.Country_Code = "USA"
032470120827                     THEN PRVDC.Province_Code_Descr
032480120827                     ELSE CNTRY.Country_Name
032490120827                END,
032500120827                ADDP.City,
032510120827                CASE WHEN ADDP.Country_Code = "CAN"
032520120827                     THEN ADDP.Province_Code
032530120827                     ELSE " "
032540120827                END,
032550120827                CASE WHEN ADDP.Country_Code IN("CAN","USA")
032560120827                     THEN ADDP.Country_Code
032570120827                     ELSE :lncc_AUT
032580120827                END,
032590120827                ADDP.Postal_Code,
032600120827                CASE WHEN IVRTYP.Recipient_Type = "3" THEN "7"
032610120827                     ELSE Coalesce (BRELTP.Ben_Relation_Type_Xref, "1")
032620120827                END,
032630120827                0,
032640120827                CASE
032650120827                 WHEN Coalesce(BRELTP.Blood_Relative, "N") = "Y"
032660120827                    THEN 1
032670120827                 ELSE 0
032680120827                END,
032690130718      * RFS119929 - Start
032700130718                CASE
032710130718                 WHEN ACCBRP.Relationship_Type = "S"
032720130718                    THEN 1
032730130718                 ELSE 0
032740130718                END,
032750130718      * RFS119929 - End
032760120827      * RFS 78268 - Start
032770160219145606          :lncc_Spaces_15,
032780120827                ACCBRP.MRQ_File_Date,
032790120927
032800120927      * RFS107668 - Start
032810120927                CASE WHEN (:lc_ReportMode = :lncc_Y)
032820120927                     THEN "U"
032830120927                     ELSE ACCBRP.MRQ_Approval_Status
032840120927                END,
032850120927      *         ACCBRP.MRQ_Approval_Status,
032860120927      * RFS107668 - End
032870120827                ZONED(ACCBRP.Beneficiary_Seq_no,3,0),
032880120827                ZONED(ACCBRP.To_Beneficiary_Seq_no,3,0),
032890120827      * RFS 78268 - End
032900120827                :lncc_Spaces_C3
032910120827
032920120827      * ACCOUNT-BENEFICIARY-REPLACE
032930120827             FROM MFAACCBRP  ACCBRP
032940120827      * Exclude accounts with account attribute code NMRQ
032950120827             EXCEPTION JOIN MFAACCATP ACCATP ON
032960120827                 ACCATP.Account_No = ACCBRP.Account_No
032970120827             AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
032980120827      * ACCOUNT-RESP
032990120827             JOIN MFAACCESP ACCESP ON
033000120827                ACCBRP.Account_No = ACCESP.Account_No
033010120827      * ACCOUNT-BENEFICIARY OLD/REPLACED BENEFICIARY(1)
033020120827             JOIN MFAACCBNP ACCBN1 ON
033030120827                 ACCBRP.Account_No = ACCBN1.Account_No
033040120827             AND ACCBRP.Beneficiary_Seq_No = ACCBN1.Beneficiary_Seq_No
033050120827      * ACCOUNT-BENEFICIARY NEW/REPLACING BENEFICIARY(2)
033060120827             JOIN MFAACCBNP ACCBN2 ON
033070120827                 ACCBRP.Account_No = ACCBN2.Account_No
033080120827             AND ACCBRP.To_Beneficiary_Seq_No =
033090120827                        ACCBN2.Beneficiary_Seq_No
033100120827      * ADDRESS
033110120827             JOIN MFAADDP ADDP ON
033120120827                 ACCBN2.Addr_No = ADDP.Addr_No
033130120827      * ACCOUNT
033140120827             JOIN MFAACCNTP ACCNTP ON
033150120827                 ACCBRP.Account_No = ACCNTP.Account_No
033160120827      * INVESTOR
033170120827             JOIN MFAIVRP IVRP ON
033180120827                 ACCNTP.Investor_No = IVRP.Investor_No
033190120827      * INVESTOR-TYPE
033200120827             JOIN MFAIVRTYP IVRTYP ON
033210120827                 IVRP.Investor_Type_Code = IVRTYP.Investor_Type_Code
033220120827      * RESP-TYPE-SPECIMEN-PLAN
033230120827             LEFT OUTER JOIN MFARESPTP RESPTP ON
033240120827                 ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code
033250120827                 AND ACCESP.Resp_Type_Code = RESPTP.Resp_Type_Code
033260120827      * BENEFICIARY-RELATIONSHIP-TYPES
033270120827             LEFT OUTER JOIN MFABRELTP BRELTP ON
033280120827               ACCBN2.Relationship_Type = BRELTP.Ben_Relation_Type_Code
033290120827      * PROVINCE-CODES-DESCR
033300120827             LEFT JOIN MFAPRVDCP PRVDC ON
033310120827                 ADDP.Country_Code  = PRVDC.Country_Code
033320120827             AND ADDP.Province_Code = PRVDC.Province_Code
033330120827             AND PRVDC.Language_Code = :lncc_E
033340120827      * COUNTRY
033350120827             LEFT JOIN MFACOUP CNTRY ON
033360120827                 ADDP.Country_Code = CNTRY.Country_Code
033370120827
033380120827      * RFS105558 - Start
033390120827      *      WHERE
033400120827      *         (ACCBRP.Mrq_Approval_Status
033410120827      * RFS78268 - Start
033420120827      *         IN (:lncc_Refiling, :lncc_Unfiled)
033430120827      *         IN (:lncc_Refiling, :lncc_Unfiled, :lncc_O,
033440120827      *             :lncc_M, :lncc_C)
033450120827      * RFS78268 - End
033460120827      *          AND SUBSTR(DEC(ACCBRP.Replacement_Date),1,4)
033470120827      *          BETWEEN :li_Year1 AND :li_Year2)
033480120827             WHERE
033490120927      * RFS107668 - Start
033500120927              (:lc_ReportMode = :lncc_Y          AND
033510120927                ((SUBSTR(DEC(ACCBRP.Replacement_Date),1,4)
033520121003                  BETWEEN :li_ProcessFilingYear AND :li_Year2) AND
033530120927                 ACCBRP.MRQ_File_Date > :lnci_0)) OR
033540120927               (:lc_ReportMode <> :lncc_Y AND
033550120927      * RFS107668 - End
033560120827               ((ACCBRP.Mrq_Approval_Status
033570120827                        IN (:lncc_Refiling, :lncc_Unfiled)
033580120827                 AND SUBSTR(DEC(ACCBRP.Replacement_Date),1,4)
033590120827      * RFS 109131 - Start
033600120827      *          BETWEEN :li_Year1 AND :li_Year2)
033610120827                 <=  :li_Year2)
033620120827      * RFS 109131 - End
033630120827                 OR ACCBRP.Mrq_Approval_Status
033640120927      * RFS107668 - Start
033650120927      *                 IN (:lncc_O, :lncc_M, :lncc_C))
033660120927                        IN (:lncc_O, :lncc_M, :lncc_C)))
033670120927      * RFS107668 - End
033680120827      *RFS105558 - End
033690120827
033700120827             FOR FETCH ONLY
033710120827             OPTIMIZE FOR ALL ROWS
033720120827           END-EXEC.
033730120827
033740120827           EXEC SQL
033750120827             OPEN Replacement_Cursor
033760120827           END-EXEC.
033770120827
033780120827           MOVE SQLSTATE   TO WS-SQL-STATES.
033790120827
033800120827           EXEC SQL
033810120827           WHENEVER NOT FOUND CONTINUE
033820120827           END-EXEC.
033830120827
033840120827
033850120827      *-------------
033860120827       Create_Replacement.
033870120827      *-------------
033880120827
033890120827           INITIALIZE ltb_FetchC3Table.
033900120827           EXEC SQL
033910120827           WHENEVER NOT FOUND CONTINUE
033920120827           END-EXEC.
033930120827
033940120827           EXEC SQL
033950120827              FETCH NEXT FROM Replacement_Cursor
033960120827                FOR :lnci_MaxFetchRec ROWS
033970120827              INTO  :ltb_C3Cursor:ltb_Indicators
033980120827           END-EXEC.
033990120827
034000120827           MOVE SQLSTATE TO lc_sqlStates.
034010120827           EVALUATE TRUE
034020120827               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
034030120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
034040120827               WHEN lncc_sqlEnd
034050120827                    SET lb_EndOfCursorTrue TO TRUE
034060120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
034070120827               WHEN OTHER
034080120827                    SET lncc_Err_Fetch TO TRUE
034090120827      * RFS 109131 - Start
034100120827      *             MOVE lncc_ErrorFetchingCursor
034110120827                    MOVE lncc_ErrorFetchingCursor_03
034120120827      * RFS 109131 - End
034130120827                      TO lc_sqlErrShortDESCR
034140120827                    PERFORM SQLFailProcess
034150120827           END-EVALUATE.
034160120827
034170120827           COMPUTE li_Counter = 1.
034180120827           PERFORM GetNextType03Row   TEST BEFORE
034190120827             UNTIL li_Counter > li_NoOfRowsFetched.
034200120827
034210120827
034220120827      *-----------
034230120827       GetNextType03Row.
034240120827      *-----------
034250120827
034260120827           MOVE ltb_C3Cursor(li_Counter) TO lc_Current_03_Record.
034270120827      * RFS 78268 - Start
034280120827           MOVE li_F3_MRQ_File_Date(li_Counter)
034290120827                                       TO li_F3_C_MRQ_File_Date
034300120827           MOVE li_F3_Beneficiary_seq_no(li_Counter)
034310120827                                       TO li_F3_C_Beneficiary_seq_no
034320120827           MOVE li_F3_To_Beneficiary_seq_no(li_Counter)
034330120827                                       TO li_F3_C_To_Beneficiary_seq_no
034340120827           SET lc_OriginalFound        TO    True
034350141001      * RFS132831 - Begins - Evaluate for 'R'efile status
034360141001           IF lc_F3_MRQ_Approval_Status(li_Counter) = lncc_R
034370141001              PERFORM ResetRefileVariables
034380141001              COMPUTE Li_RefileAccountNo = li_C3_Account_No
034390141001              COMPUTE Li_RefileBeneSeq   = li_F3_C_Beneficiary_seq_no
034400141001              COMPUTE Li_RefileToBeneSeq = li_F3_C_To_Beneficiary_seq_no
034410141001              COMPUTE Li_RefileMrqFileDate = li_F3_C_MRQ_File_Date
034420141001              MOVE Lncc_03 TO Lc_RefileRecType
034430141001              COMPUTE Li_RefileEffectiveDate = li_C3_Replacement_Date
034440141001              SET Lb_RefileModeVersion TO TRUE
034450141001              PERFORM GetRefileInfo
034460141001              IF Li_RefileVersion = Lnci_1 OR Lnci_2
034470141001                 SET Lb_RefileModeFileDate TO TRUE
034480150128                 PERFORM GetSuccReflDate
034490141001                 IF Li_RefileSuccessfulMrqFileDate NOT = 0
034500141001                    IF Li_RefileVersion = Lnci_1
034510141001                       MOVE Lncc_C
034520141001                         TO lc_F3_MRQ_Approval_Status(li_Counter)
034530141001                    END-IF
034540141001                    IF Li_RefileVersion = Lnci_2
034550141001                       MOVE Lncc_M
034560141001                         TO lc_F3_MRQ_Approval_Status(li_Counter)
034570141001                    END-IF
034580141001                    COMPUTE li_F3_C_MRQ_File_Date =
034590141001                            Li_RefileSuccessfulMrqFileDate
034600150205                    COMPUTE li_F3_MRQ_File_Date(li_Counter) =
034610150205                            Li_RefileSuccessfulMrqFileDate
034620141001      *             or leave as is (which is "R" which means original
034630141001      *             will be filed)
034640141001                 END-IF
034650141001              END-IF
034660141001           END-IF.
034670141001      * RFS132831 - Ends
034680120827           IF   lc_F3_MRQ_Approval_Status(li_Counter) =
034690120827                lncc_C OR lncc_O or lncc_M
034700120827                PERFORM Generate03Cancellation
034710120827           END-IF.
034720120827      *    Original/aMendment Filing record
034730120827           MOVE ltb_C3Cursor(li_Counter) TO lc_Current_03_Record
034740120827
034750120827           IF lc_OriginalFound    AND
034760120827              lc_F3_Mrq_Approval_Status(li_Counter)   Not= lncc_C
034770120827               If lc_F3_Mrq_Approval_Status (Li_Counter) = lncc_M
034780120827                 MOVE lnci_2           TO  li_C3_Trxn_VersCde
034790120827               END-IF
034800120827
03481012082792917         INITIALIZE MFAMRQBRP OF Ltr_03FilingLog
034820120827              MOVE li_C3_Account_No TO ACCOUNT-NO
034830120827                                         OF Ltr_03FilingLog
034840120827              MOVE li_C3_Beneficiary_seq_no
034850120827                   TO BENEFICIARY-SEQ-NO OF Ltr_03FilingLog
034860120827              MOVE li_C3_To_Beneficiary_seq_no
034870120827                   TO TO-BENEFICIARY-SEQ-NO OF Ltr_03FilingLog
034880120827              MOVE li_C3_Replacement_Date   TO REPLACEMENT-DATE
034890120827                                    OF Ltr_03FilingLog
034900120926      * RFS107668 - Start Updates MRQ-FILE-DATE only if Report <> 'Y'
034910121018              IF lc_ReportMode NOT = lncc_Y
034920120921                MOVE li_AsAtDate           TO MRQ-FILE-DATE
034930120921                                      OF Ltr_03FilingLog
034940120921              END-IF
034950120921      *       MOVE li_AsAtDate           TO MRQ-FILE-DATE
034960120921      *                             OF Ltr_03FilingLog
034970120926      * RFS107668 - End
034980120827              MOVE li_C3_Trxn_VersCde    TO MRQ-VERSION-CODE
034990120827                                    OF Ltr_03FilingLog
035000120827
035010120827              MOVE lc_C3_PromoterID      TO VENDOR-BN
035020120827                                    OF Ltr_03FilingLog
035030120827              MOVE li_C3_SpecimenPlanNo  TO SPECIMEN-ID
035040120827                                    OF Ltr_03FilingLog
035050120827              MOVE lc_C3_Resp_Type_Code  TO IND-SIBLING-ONLY
035060120827                                    OF Ltr_03FilingLog
035070120827              MOVE li_C3_Benef_SIN_Old   TO OLD-BEN-SIN
035080120827                                    OF Ltr_03FilingLog
035090120827              MOVE lc_C3_Benef_LastName_Old  TO OLD-BEN-LAST-NAME
035100120827                                    OF Ltr_03FilingLog
035110120827              MOVE lc_C3_Benef_FirstName_Old TO OLD-BEN-FIRST-NAME
035120120827                                    OF Ltr_03FilingLog
035130120827              MOVE li_C3_Benef_DOB_Old   TO OLD-BEN-BIRTH-DATE
035140120827                                    OF Ltr_03FilingLog
035150120827              MOVE lc_C3_Benef_Sex_Old   TO OLD-BEN-GENDER
035160120827                                    OF Ltr_03FilingLog
035170120827              MOVE li_C3_Benef_SIN_New   TO TO-SOCIAL-INSURANCE-NO
035180120827                                    OF Ltr_03FilingLog
035190120827              MOVE lc_C3_Benef_LastName_New  TO TO-BEN-LAST-NAME
035200120827                                    OF Ltr_03FilingLog
035210120827              MOVE lc_C3_Benef_FirstName_New TO TO-BEN-FIRST-NAME
035220120827                                    OF Ltr_03FilingLog
035230120827              MOVE li_C3_Benef_DOB_New   TO TO-BEN-DATE-OF-BIRTH
035240120827                                    OF Ltr_03FilingLog
035250120827              MOVE lc_C3_Benef_Sex_New   TO TO-BEN-GENDER
035260120827                                    OF Ltr_03FilingLog
035270120827              MOVE lc_C3_Subsc_Type      TO SUBSCRIBER-TYPE
035280120827                                    OF Ltr_03FilingLog
035290120827              MOVE li_C3_Benef_QcResident    TO BEN-QC-RESIDENT-IND
035300120827                                    OF Ltr_03FilingLog
035310120827              MOVE lc_C3_Subsc_BenRelation   TO IVR-BEN-RELATION
035320120827                                    OF Ltr_03FilingLog
035330210220
035340210220      *RFS1107299 START
035350210220              MOVE  li_C3_Blood_Relative TO BLOOD-RELATIVE-1
035360210220                                     OF Ltr_03FilingLog
035370210220      *RFS1107299 END
035380210220
035390120827              PERFORM  Replacement_Address
035400120827              MOVE Li_Fetch-Ben-AddrNo TO Ben-Addr-No of
035410120827                                          Ltr_03FilingLog
035420120827              MOVE lncc_P                      TO
035430120827                   MRQ-APPROVAL-STATUS         OF Ltr_03FilingLog
035440160219      * RFS145606 - START
035450160229              PERFORM NewSeqNoGen
035460160219              MOVE lc_mrq_trans_id TO lc_C3_MRQ_Trans_Id
035470160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
035480160219                                      OF Ltr_03FilingLog
035490160219      * RFS145606 - END
035500120827              PERFORM  Write03FilingLog
035510120827
035520120827              MOVE SPACES               TO lc_C3_Filler
035530120827      * RFS 78268 - End
035540140923      *RFS139963 - Begins
035550140923              MOVE lc_Current_03_Record TO lc_Temp_0306_Record
035560140923              MOVE lc_temp_0306_acct TO Li_AccountNo_In
035570140923              PERFORM AccountEdit
035580140923              MOVE Lc_AccountNo_Out  TO lc_temp_0306_acct
035590140923              MOVE lc_Temp_0306_Record TO lc_RecordToInsert
035600140923      *       MOVE lc_Current_03_Record TO lc_RecordToInsert
035610140923      *RFS139963 - Ends
035620120827              PERFORM InsertRecord
035630120827              PERFORM Update_ReplacementStatus
035640120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
035650120827      * RFS78268 - Begins - Update status if cancellation
035660120827           ELSE
035670120827              IF lc_OriginalFound
035680120827                 PERFORM Update_ReplacementStatus
035690120827              END-IF
035700120827      * RFS78268 - Ends
03571012082778268      END-IF.
035720120827              COMPUTE li_Counter = li_Counter + 1.
035730120827
035740120827      *RFS 78268 - Start
035750120827
035760120827      *-------------------
035770120827       Replacement_Address.
035780120827      *-------------------
035790120827      * RFS78268.25 - Begins - Initialize fields
035800120827           INITIALIZE Li_Fetch-Ben-AddrNo.
035810120827      * RFS78268.25 - Ends
035820120827           EXEC SQL
035830120827                SELECT  COALESCE(BRP.Ben_Addr_No,0) INTO
035840120827                       :Li_Fetch-Ben-AddrNo
035850120827
035860120827                       FROM MFAACCNTP ACCNTP
035870120827                LEFT JOIN   MFAMRQBRP BRP ON
035880120827                            ACCNTP.Account_no = BRP.Account_no
035890120827                      AND   BRP.Beneficiary_Seq_No  =
035900120827                            :li_C3_beneficiary_seq_no
035910120827
035920120827                WHERE  ACCNTP.Account_no =  :li_C3_Account_No
035930120827                AND    BRP.MRQ_Version_Code <> 1
035940120827                ORDER BY
035950120827                       BRP.MRQ_File_Date Desc,
035960120827                       BRP.MRQ_Version_Code
035970120827                FETCH FIRST ROW ONLY
035980120827           END-EXEC.
035990120827
036000120827           MOVE Li_Fetch-Ben-AddrNo    TO   Li_Validate-AddrNo.
036010120827
036020120827           MOVE lc_C3_Benef_AptNo      TO   Lc_Validate-AptNo
036030120827           MOVE lc_C3_Benef_StreetNo   TO   Lc_Validate-CivicNo
036040120827           MOVE lc_C3_Benef_StreetName TO   Lc_Validate-Street
036050120827           MOVE lc_C3_Benef_AddLine2   TO   Lc_Validate-Addr2
036060120827           MOVE lc_C3_Benef_AddLine3   TO   Lc_Validate-Addr3
036070120827           MOVE lc_C3_Benef_City       TO   Lc_Validate-City
036080120827           MOVE lc_C3_Benef_Prov       TO   Lc_Validate-Prov
036090120827           MOVE lc_C3_Benef_Country    TO   Lc_Validate-Country
036100120827           MOVE lc_C3_Benef_PostalCode TO   Lc_Validate-Postal.
036110120827
036120120827           IF Li_Fetch-Ben-AddrNo NOT = lnci_0
036130120827              PERFORM Validate_Address
036140120827           END-IF.
036150120827
036160120827           IF Li_Validate-AddrNo = lnci_0
036170120827              PERFORM Create_Address
036180120827              MOVE Li_Validate-AddrNo     TO    Li_Fetch-Ben-AddrNo
036190120827           END-IF.
036200120827
036210120827      *------------------------
036220120827       Generate03Cancellation.
036230120827      *------------------------
036240120827           Set  lc_OriginalFound TO True.
036250120827           Initialize MFAMRQBRP OF ltr_03FilingLog
036260120827           EXEC SQL
036270120827                SELECT * INTO :MFAMRQBRP
036280120827                FROM   MFAMRQBRP
036290120827                WHERE   ACCOUNT_NO  = :li_C3_Account_No
036300120827                  AND   BENEFICIARY_SEQ_NO  =
036310120827                                       :li_F3_C_Beneficiary_seq_no
036320120827                  AND   TO_BENEFICIARY_SEQ_NO  =
036330120827                                       :li_F3_C_To_Beneficiary_seq_no
036340120827                  AND   REPLACEMENT_DATE   =
036350120827                                       :li_C3_Replacement_Date
036360120827                  AND   MRQ_FILE_DATE      =
036370120827                                       :li_F3_C_MRQ_File_Date
036380120827                  AND   MRQ_Version_Code <> :lnci_1
036390120827                         FETCH FIRST ROW ONLY
036400120827           END-EXEC.
036410120827
036420120827           MOVE SQLSTATE TO lc_sqlStates.
036430120827           IF Not lncc_sqlSuccessful
036440120827              Set  lc_OriginalNotFound TO True
036450120827              MOVE SQLSTATE     TO WS-SQLSTATE
036460120827              MOVE SQLCODE      TO WS-DSP-SQLCODE
036470120827              MOVE "MFAMRQBRP " To lncc_FileName
036480120827              MOVE lncc_ErrorFetchingCancel  To
036490120827                                   Ws-Sql-Err-Short-Descr
036500120827              PERFORM DisplayError
036510120827           END-IF.
036520120827
036530120827
036540120827           IF lc_OriginalFound
036550120827              MOVE ACCOUNT-NO OF Ltr_03FilingLog
036560120827                                         TO li_C3_Account_No
036570120827              MOVE BENEFICIARY-SEQ-NO OF Ltr_03FilingLog TO
036580120827                   li_C3_Beneficiary_seq_no
036590120827              MOVE TO-BENEFICIARY-SEQ-NO OF Ltr_03FilingLog TO
036600120827                   li_C3_To_Beneficiary_seq_no
036610120827              MOVE REPLACEMENT-DATE      OF Ltr_03FilingLog
036620120827                                         TO li_C3_Replacement_Date
036630120827      *       RFS78268 - Begins - Do not populate asatdate
036640120827      *       MOVE MRQ-FILE-DATE         OF Ltr_03FilingLog
036650120827      *                                  TO li_AsAtDate
036660120827      *       RFS78268 - Ends
036670120827      *       RFS78268.17 - Begins - Set the version code to cancellation
036680120827      *       MOVE MRQ-VERSION-CODE      OF Ltr_03FilingLog
036690120827              MOVE lnci_1
036700120827      *       RFS78268.17 - Ends
036710120827                                         TO li_C3_Trxn_VersCde
036720120827
036730120827              MOVE VENDOR-BN             OF Ltr_03FilingLog
036740120827                                         TO lc_C3_PromoterID
036750120827              MOVE SPECIMEN-ID           OF Ltr_03FilingLog
036760120827                                         TO li_C3_SpecimenPlanNo
036770120827              MOVE IND-SIBLING-ONLY      OF Ltr_03FilingLog
036780120827                                         TO lc_C3_Resp_Type_Code
036790120827              MOVE OLD-BEN-SIN           OF Ltr_03FilingLog
036800120827                                         TO li_C3_Benef_SIN_Old
036810120827              MOVE OLD-BEN-LAST-NAME     OF Ltr_03FilingLog
036820120827                                         TO lc_C3_Benef_LastName_Old
036830120827              MOVE OLD-BEN-FIRST-NAME    OF Ltr_03FilingLog
036840120827                                         TO lc_C3_Benef_FirstName_Old
036850120827              MOVE OLD-BEN-BIRTH-DATE    OF Ltr_03FilingLog
036860120827                                         TO li_C3_Benef_DOB_Old
036870120827              MOVE OLD-BEN-GENDER        OF Ltr_03FilingLog
036880120827                                         TO lc_C3_Benef_Sex_Old
036890120827              MOVE TO-SOCIAL-INSURANCE-NO OF Ltr_03FilingLog
036900120827                                         TO li_C3_Benef_SIN_New
036910120827              MOVE TO-BEN-LAST-NAME      OF Ltr_03FilingLog
036920120827                                         TO lc_C3_Benef_LastName_New
036930120827              MOVE TO-BEN-FIRST-NAME     OF Ltr_03FilingLog
036940120827                                         TO lc_C3_Benef_FirstName_New
036950120827              MOVE TO-BEN-DATE-OF-BIRTH  OF Ltr_03FilingLog
036960120827                                         TO li_C3_Benef_DOB_New
036970120827              MOVE TO-BEN-GENDER         OF Ltr_03FilingLog
036980120827                                         TO lc_C3_Benef_Sex_New
036990120827              MOVE Ben-Addr-No  OF Ltr_03FilingLog
037000120827                                         TO     Li_Fetch-AddrNo
037010120827              PERFORM Fetch_Address
037020120827              MOVE Lc_Fetch-AptNo        TO lc_C3_Benef_AptNo
037030120827              MOVE Lc_Fetch-CivicNo      TO lc_C3_Benef_StreetNo
037040120827              MOVE Lc_Fetch-Street       TO lc_C3_Benef_StreetName
037050120827              MOVE Lc_Fetch-Addr2        TO lc_C3_Benef_AddLine2
037060120827              MOVE Lc_Fetch-Addr3        TO lc_C3_Benef_AddLine3
037070120827              MOVE Lc_Fetch-City         TO lc_C3_Benef_City
037080120827              MOVE Lc_Fetch-Prov         TO lc_C3_Benef_Prov
037090120827              MOVE Lc_Fetch-Country      TO lc_C3_Benef_Country
037100120827              MOVE Lc_Fetch-Postal       TO lc_C3_Benef_PostalCode
037110120827              MOVE SUBSCRIBER-TYPE       OF Ltr_03FilingLog
037120120827                                         TO lc_C3_Subsc_Type
037130120827              MOVE BEN-QC-RESIDENT-IND   OF Ltr_03FilingLog
037140120827                                         TO li_C3_Benef_QcResident
037150120827              MOVE IVR-BEN-RELATION      OF Ltr_03FilingLog
037160120827                                         TO lc_C3_Subsc_BenRelation
037170120827              MOVE SPACES                TO lc_C3_Filler
037180160219      *RFS145606 - START
037190160229              PERFORM NewSeqNoGen
037200160219              MOVE lc_mrq_trans_id TO lc_C3_MRQ_Trans_Id
037210160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
037220160219                                      OF Ltr_03FilingLog
037230160219      *RFS145606 - END
037240140923      *RFS139963 - Begins
037250140923              MOVE lc_Current_03_Record TO lc_Temp_0306_Record
037260140923              MOVE lc_temp_0306_acct TO Li_AccountNo_In
037270140923              PERFORM AccountEdit
037280140923              MOVE Lc_AccountNo_Out  TO lc_temp_0306_acct
037290140923              MOVE lc_Temp_0306_Record TO lc_RecordToInsert
037300140923      *       MOVE lc_Current_03_Record TO lc_RecordToInsert
037310140923      *RFS139963 - Ends
037320120827              PERFORM InsertRecord
037330120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
037340120827
037350120827      *    cancellation filing record
037360120827
037370120926      * RFS107668 - Start Updates MRQ-FILE-DATE only if Report <> 'Y'
037380121018           IF lc_ReportMode NOT = lncc_Y
037390120921             MOVE li_AsAtDate   TO MRQ-FILE-DATE OF Ltr_03FilingLog
037400120921           END-IF
037410120921      *    MOVE li_AsAtDate   TO MRQ-FILE-DATE OF Ltr_03FilingLog
037420120926      * RFS107668 - End
037430120827           MOVE lnci_1        TO MRQ-VERSION-CODE OF Ltr_03FilingLog
037440120827      *    RFS78268.17 - Begins - Set the filing status
037450120827           MOVE Lncc_P        TO MRQ-APPROVAL-STATUS OF Ltr_03FilingLog
037460120827      *    RFS78268.17 - Ends
037470120827           PERFORM Write03FilingLog
037480120827           END-IF.
037490120827      *---------------------
037500120827       Write03FilingLog.
037510120827      *---------------------
037520120926      * RFS107668 - START - Moved the existing logic into IF condition
037530121018           IF lc_ReportMode NOT = lncc_Y
037540120926      * RFS107668 - END
037550120827      *        RFS78268.25 - Begins - Set the record-type-2
037560120925               MOVE Lncc_03
037570120925                 TO RECORD-TYPE-2
037580120927      * RFS107668 - START
037590120927      *             OF Ltr_03FilingLog.
037600120927                    OF Ltr_03FilingLog
037610120927      * RFS107668 - END
037620120827      *        RFS78268.25 - Ends
037630120827
037640120925           EXEC SQL
037650120925             INSERT INTO MFAMRQBRP VALUES(:MFAMRQBRP)
037660120927      * RFS107668 - START
037670120927      *    END-EXEC.
037680120927           END-EXEC
037690120927      * RFS107668 - END
037700120827
037710120927      * RFS107668 - Start
037720120927      *    MOVE SQLSTATE TO lc_sqlStates.
037730120927           MOVE SQLSTATE TO lc_sqlStates
037740120927      * RFS107668 - End
037750120925           IF not lncc_sqlSuccessful
037760120925              SET lncc_Err_I1 TO TRUE
037770120925              MOVE "MFAMRQBRP " TO lncc_InsertFileName
037780120925              MOVE lncc_ErrorInsertingFile TO lc_sqlErrShortDESCR
037790120925              PERFORM SQLFailProcess
037800120926      * RFS107668 - Start
037810120926      *    END-IF.
037820120925           END-IF
037830120921           ELSE
037840121010                INITIALIZE li_Report-Variables
037850121010                MOVE li_C3_RecordType     TO lc_ReportFilingRectype
037860120921                MOVE li_C3_Benef_SIN_New  TO li_WK-Beneficiary-SIN
037870120921                MOVE li_C3_Benef_DOB_New  TO li_WK-Beneficiary-DOB
037880120921                PERFORM Record_Comparison
037890120921           END-IF.
037900120827      *RFS 78268 - End
037910120927      * RFS107668 - End
037920120827
037930120827      *---------------------
037940120827       CreateTransferCursor.
037950120827      *---------------------
037960120827           EXEC SQL
037970120827           DECLARE Transfer_Cursor CURSOR FOR
037980120827             SELECT DISTINCT
037990120827                :lnci_04,
038000120827                :lnci_0,
038010120827                CASE
038020120827                   WHEN ARTNP.Transfer_Contr_Or_Redem = "R" THEN 1
038030120827                   WHEN ARTNP.Transfer_Contr_Or_Redem = "C" THEN 2
038040120827                   ELSE 0
038050120827                END,
038060120827                :lc_Header_PromoterID,
038070120827                ARTNDP.Account_No,
038080120827                Coalesce(RESPTP.Specimen_Plan_No,"0"),
038090120827                ACCESP.Plan_Setup_Date,
038100120827                ARTNP.Transfer_Date,
038110120827                ARTNP.Total_Transfer_Value,
038120120827                ARTNDP.Mrq_Assisted_Capital,
038130120827      **        RFS90105.7 - Begins - Use only the UC - Do not add the YTD
03814012082790105 **        ARTNDP.Mrq_Unassisted_Capital,
03815012082790105 **        ARTNDP.Mrq_Unassisted_Capital +
03816012082790105 **          + ARTNDP.YTD_Net_Contribution,
038170120827                ARTNDP.Mrq_Unassisted_Capital,
038180120827      **        RFS90105.7 - Ends
038190120827      *RFS 73992 starts
038200120827      *         ARTNDP.IQEE_Transferred_Amt,
038210120827                ARTNDP.IQEE_Received_Amt,
038220120827      *RFS 73992 ends
038230120827                ARTNDP.Quebec_Enterprise_No,
038240120827                ARTNP.Contract,
038250120827                ARTNP.Specimen_ID,
038260120827                ACCBNP.Social_Insurance_No,
038270120827                ACCBNP.Last_Name,
038280120827                ACCBNP.First_Name,
038290120827                ACCBNP.Date_Of_Birth,
038300120827                CASE
038310120827                 WHEN ACCBNP.Sex = "F" THEN 1
038320120827                 WHEN ACCBNP.Sex = "M" THEN 2
038330120827                 ELSE 0
038340120827                END,
038350120827                ADDP.Misc_First_Addr_Line,
038360120827                ADDP.Street_No,
038370120827                SUBSTR (ADDP.Street_Name,1,30) CONCAT
038380120827                    SUBSTR (ADDP.Street_Type_Code,1,6) CONCAT
038390120827                        SUBSTR (ADDP.Street_Dirct_Code,1,2),
038400120827                ADDP.Misc_Second_Addr_Line,
038410120827                CASE WHEN ADDP.Country_Code = "CAN" THEN " "
038420120827                     WHEN ADDP.Country_Code = "USA"
038430120827                     THEN PRVDC.Province_Code_Descr
038440120827                     ELSE CNTRY.Country_Name
038450120827                END,
038460120827                ADDP.City,
038470120827                CASE WHEN ADDP.Country_Code = "CAN"
038480120827                     THEN ADDP.Province_Code
038490120827                     ELSE " "
038500120827                END,
038510120827                CASE WHEN ADDP.Country_Code IN("CAN","USA")
038520120827                     THEN ADDP.Country_Code
038530120827                     ELSE :lncc_AUT
038540120827                END,
038550120827                ADDP.Postal_Code,
038560120827                CASE
038570120827                   WHEN ARTNDP.Total_Transfer_Ind = "Y" THEN 1
038580120827                   ELSE 0
038590120827                END,
038600120827                0,
038610120827                0,
038620120827                0,
038630120827                CASE
038640120827                   WHEN ARTNDP.Authorized_Transfer = "Y" THEN 1
038650120827                   ELSE 0
038660120827                END,
038670120827                CASE
038680120827                   WHEN IVRTYP.Recipient_Type = "3" THEN 2
038690120827                   ELSE 1
038700120827                END,
038710120827                IVRP.Social_Insurance_No,
038720120827                Coalesce (IVRBNP.Business_Number_Revq, " "),
03873012082774636 *         IVRP.Last_Name,
03874012082774636 *         IVRP.First_Name,
03875012082774636           CASE
03876012082774636            WHEN IVRTYP.Recipient_Type = "3" THEN
03877012082774636                Coalesce(IVRP.Legal_Name, " ")
03878012082774636            ELSE
03879012082774636             SUBSTR (IVRP.Last_Name, 1, 20) CONCAT
03880012082774636             SUBSTR (IVRP.First_Name, 1, 20)
03881012082774636           END,
038820120827                CASE
038830120827                   WHEN IVRTYP.Recipient_Type = "3" THEN "7"
038840120827                   ELSE Coalesce (BRELTP.Ben_Relation_Type_Xref, "1")
038850120827                END,
038860120827      * Subscriber Address done in a separate routine
03887012082773992 *         " ",
038880120827                :lncc_Spaces_SubscAddr,
03889012082774636 *         0,
038900120827      * Joint subscriber info is done in a separate routine
038910120827                0,
038920120827                " ",
038930120827                " ",
038940120827                0,
038950120827                0,
038960130717      * RSF119929 - Start
038970160219                ARTNDP.MRQ_PRE_2007_CAPITAL,
038980130717                ARTNDP.MRQ_UNASSISTED_CAPITAL,
038990130717      * RFS119929 - End
039000160219145606          :lncc_Spaces_15,
03901012082773992           ARTNDP.Transfer_Seq_No,
03902012082773992           ARTNDP.Beneficiary_Seq_No,
039030120827      * RFS 78268 - Start
039040120827                ARTNDP.MRQ_File_Date,
039050121003      * RFS107668 - Start
039060121003                CASE WHEN (:lc_ReportMode = :lncc_Y)
039070121003                     THEN "U"
039080121003                     ELSE ARTNDP.MRQ_Approval_Status
039090121003                END,
039100121003      *         ARTNDP.MRQ_Approval_Status,
039110121003      * RFS107668 - End
039120120827                ARTNP.Transfer_Status,
039130120827      * RFS 78268 - End
039140120827                :lncc_Spaces_C4
039150120827
039160120827      * ACCOUNT-RESP-TSF-NOTNL-INFO-DTL
039170120827             FROM MFAARTNDP  ARTNDP
039180120827
039190120827      * Exclude accounts with account attribute code NMRQ
039200120827             EXCEPTION JOIN MFAACCATP ACCATP ON
039210120827                 ACCATP.Account_No = ARTNDP.Account_No
039220120827             AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
039230120827      * ACCOUNT-RESP-TSF-NOTIONAL-INFO
039240120827             JOIN MFAARTNP ARTNP ON
039250120827                 ARTNDP.Account_No = ARTNP.Account_No
039260120827             AND ARTNDP.Transfer_Seq_No = ARTNP.Transfer_Seq_No
039270120827      * ACCOUNT-RESP
039280120827             JOIN MFAACCESP ACCESP ON
039290120827                 ARTNDP.Account_No = ACCESP.Account_No
039300120827      * ACCOUNT
039310120827             JOIN MFAACCNTP ACCNTP ON
039320120827                 ARTNDP.Account_No = ACCNTP.Account_No
039330120827      * RESP-TYPE-SPECIMEN-PLAN
039340120827             LEFT OUTER JOIN MFARESPTP RESPTP ON
039350120827                 ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code
039360120827             AND ACCESP.Resp_Type_Code = RESPTP.Resp_Type_Code
039370120827      * ACCOUNT-BENEFICIARY
039380120827             JOIN MFAACCBNP ACCBNP ON
039390120827                 ARTNDP.Account_No = ACCBNP.Account_No
039400120827             AND ARTNDP.Beneficiary_Seq_No = ACCBNP.Beneficiary_Seq_No
039410120827      * ADDRESS
039420120827             JOIN MFAADDP ADDP ON
039430120827                 ACCBNP.Addr_No = ADDP.Addr_No
039440120827      * BENEFICIARY-RELATIONSHIP-TYPES
039450120827             LEFT OUTER JOIN MFABRELTP BRELTP ON
039460120827               ACCBNP.Relationship_Type = BRELTP.Ben_Relation_Type_Code
039470120827      * PROVINCE-CODES-DESCR
039480120827             LEFT JOIN MFAPRVDCP PRVDC ON
039490120827                 ADDP.Country_Code  = PRVDC.Country_Code
039500120827             AND ADDP.Province_Code = PRVDC.Province_Code
039510120827             AND PRVDC.Language_Code = :lncc_E
039520120827      * COUNTRY
039530120827             LEFT JOIN MFACOUP CNTRY ON
039540120827                 ADDP.Country_Code = CNTRY.Country_Code
039550120827      * INVESTOR
039560120827             JOIN MFAIVRP IVRP ON
039570120827                 ACCNTP.Investor_No = IVRP.Investor_No
039580120827      * INVESTOR-TYPE
039590120827             JOIN MFAIVRTYP IVRTYP ON
039600120827                  IVRP.Investor_Type_Code = IVRTYP.Investor_Type_Code
039610120827      * INVESTOR-BUSINESS-NUMBERS
039620120827             LEFT OUTER JOIN MFAIVRBNP IVRBNP ON
039630120827                  IVRP.Investor_No = IVRBNP.Investor_No
039640120827
039650120827      * RFS105558 - Start
039660120827      *      WHERE
039670120827      *         (ARTNDP.Mrq_Approval_Status
039680120827      * 78268 Begin
039690120827      *         IN (:lncc_Refiling, :lncc_Unfiled)
039700120827      *         IN (:lncc_Refiling, :lncc_Unfiled,
039710120827      *             :lncc_O, :lncc_M, :lncc_C)
039720120827      * 78268 End
039730120827      *          AND SUBSTR(DEC(ARTNP.Transfer_Date),1,4)
039740120827      *          BETWEEN :li_Year1 AND :li_Year2)
039750120827             WHERE
039760121003      * RFS107668 - Start
039770121003             (:lc_ReportMode = :lncc_Y          AND
039780121003               ((SUBSTR(DEC(ARTNP.Transfer_Date),1,4)
039790121003                 BETWEEN :li_ProcessFilingYear AND :li_Year2) AND
039800121003                 ARTNDP.MRQ_File_Date > :lnci_0)) OR
039810121003              (:lc_ReportMode <> :lncc_Y AND
039820121003      * RFS107668 - End
039830120827               ((ARTNDP.Mrq_Approval_Status
039840120827                        IN (:lncc_Refiling, :lncc_Unfiled)
039850120827                AND SUBSTR(DEC(ARTNP.Transfer_Date),1,4)
039860120827      * RFS109131 - Start
039870120827      *         BETWEEN :li_Year1 AND :li_Year2)
039880120827                <=  :li_Year2)
039890120827      * RFS109131 - End
039900120827                OR ARTNDP.Mrq_Approval_Status
039910121003      * RFS107668 - Start
039920121003      *            IN (:lncc_O, :lncc_M, :lncc_C))
039930121003                   IN (:lncc_O, :lncc_M, :lncc_C)))
039940121003      * RFS107668 - End
039950120827      *RFS 105558 - End
039960120827
039970120827             FOR FETCH ONLY
039980120827             OPTIMIZE FOR ALL ROWS
039990120827           END-EXEC.
040000120827
040010120827           EXEC SQL
040020120827             OPEN Transfer_Cursor
040030120827           END-EXEC.
040040120827           MOVE SQLSTATE   TO WS-SQL-STATES.
040050120827           EXEC SQL
040060120827           WHENEVER NOT FOUND CONTINUE
040070120827           END-EXEC.
040080120827
040090120827      *-------------
040100120827       Create_Transfer.
040110120827      *-------------
040120120827
040130120827           INITIALIZE ltb_FetchC4Table.
040140120827           EXEC SQL
040150120827           WHENEVER NOT FOUND CONTINUE
040160120827           END-EXEC.
040170120827
040180120827           EXEC SQL
040190120827              FETCH NEXT FROM Transfer_Cursor
040200120827                FOR :lnci_MaxFetchRec ROWS
040210120827              INTO  :ltb_C4Cursor:ltb_Indicators
040220120827           END-EXEC.
040230120827
040240120827           MOVE SQLSTATE TO lc_sqlStates.
040250120827           EVALUATE TRUE
040260120827               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
040270120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
040280120827               WHEN lncc_sqlEnd
040290120827                    SET lb_EndOfCursorTrue TO TRUE
040300120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
040310120827               WHEN OTHER
040320120827                    SET lncc_Err_Fetch TO TRUE
040330120827      * RFS109131 - Start
040340120827      *             MOVE lncc_ErrorFetchingCursor
040350120827                    MOVE lncc_ErrorFetchingCursor_04
040360120827      * RFS109131 - End
040370120827                      TO lc_sqlErrShortDESCR
040380120827                    PERFORM SQLFailProcess
040390120827           END-EVALUATE.
040400120827
040410120827           COMPUTE li_Counter = 1.
040420120827           PERFORM GetNextType04Row   TEST BEFORE
040430120827             UNTIL li_Counter > li_NoOfRowsFetched.
040440120827
040450120827
040460120827      *-----------
040470120827       GetNextType04Row.
040480120827      *-----------
040490120827
040500120827           MOVE ltb_C4Cursor(li_Counter) TO lc_Current_04_Record.
040510120827      * RFS 78268 - Start
040520120827           MOVE li_F4_MRQ_File_Date(li_Counter)
040530120827                                         TO li_F4_C_MRQ_File_Date.
040540120827           SET lc_OriginalFound        TO    True
040550141001           IF lc_F4_Mrq_Approval_Status (li_Counter) = lncc_R
040560141001              PERFORM ResetRefileVariables
040570141001              COMPUTE Li_RefileAccountNo   = li_C4_Account_No
040580141001              COMPUTE Li_RefileBeneSeq     = li_C4_BenSeq_No
040590141001              COMPUTE Li_RefileTsfSeq      = li_C4_TrnsfrSeq_No
040600141001              COMPUTE Li_RefileMrqFileDate = li_F4_C_MRQ_File_Date
040610141001              MOVE Lncc_04 TO Lc_RefileRecType
040620141001              SET Lb_RefileModeVersion TO TRUE
040630141001              PERFORM GetRefileInfo
040640141001              IF Li_RefileVersion = Lnci_1 OR Lnci_2
040650141001                 SET Lb_RefileModeFileDate TO TRUE
040660141001                 PERFORM GetRefileInfo
040670141001                 IF Li_RefileSuccessfulMrqFileDate NOT = 0
040680141001                    IF Li_RefileVersion = Lnci_1
040690141001                       MOVE Lncc_C
040700141001                         TO lc_F4_Mrq_Approval_Status (li_Counter)
040710141001                    END-IF
040720141001                    IF Li_RefileVersion = Lnci_2
040730141001                       MOVE Lncc_M
040740141001                         TO lc_F4_Mrq_Approval_Status (li_Counter)
040750141001                    END-IF
040760141001                    COMPUTE li_F4_C_MRQ_File_Date =
040770141001                            Li_RefileSuccessfulMrqFileDate
040780150205                    COMPUTE li_F4_MRQ_File_Date(li_Counter) =
040790150205                            Li_RefileSuccessfulMrqFileDate
040800141001      *             or leave as is (which is "R" which means original
040810141001      *             will be filed)
040820141001                 END-IF
040830141001              END-IF
040840141001           END-IF.
040850141001      * RFS132831 - Ends
040860120827           IF   lc_F4_Mrq_Approval_Status (li_Counter) =
040870120827                lncc_C OR lncc_O OR lncc_M
040880120827                Perform Generate04Cancellation
040890120827           END-IF.
040900120827      *    Original/aMendment Filing record
040910120827           MOVE ltb_C4Cursor(li_Counter) TO lc_Current_04_Record
040920120827
040930120827           IF lc_OriginalFound     AND
040940120827              lc_F4_Mrq_Approval_Status(li_Counter) Not= lncc_C
040950120827
040960120827      * RFS 78268 - End
040970150505
040980150505      *RFS143887- BEGINS
040990150505
041000150505            PERFORM FormatTransferCapital
041010150505
041020120827      *RFS90105 Begins
041030150505      *       IF ln_C4_MRQ_Unassisted_Amt < 0
041040150505      *          MOVE "-" TO ln_C4_MRQ_Unassisted_Amt_Sign
041050150505      *          COMPUTE ln_C4_MRQ_Unassisted_Amt_R =
041060150505      *                  (ln_C4_MRQ_Unassisted_Amt_R * -1)
041070150505      *       ELSE
041080150505      *          MOVE "0" TO ln_C4_MRQ_Unassisted_Amt_Sign
041090150505      *       END-IF
041100120827      *RFS90105 Ends
041110140604      *RFS 135546 - Begins.
041120150505      *      IF ln_C4_MRQ_Assisted_Amt < 0
041130150505      *         MOVE "-" TO ln_C4_MRQ_Assisted_Amt_Sign
041140150505      *         COMPUTE ln_C4_MRQ_Assisted_Amt_R =
041150150505      *                 (ln_C4_MRQ_Assisted_Amt_R * -1)
041160150505      *      ELSE
041170150505      *         MOVE "0" TO ln_C4_MRQ_Assisted_Amt_Sign
041180150505      *      END-IF
041190140604      *RFS 135546 - Ends.
041200150505
041210150505      *RFS143887- ENDS
041220150505
041230120827              MOVE li_C4_Account_No to li_C_Account_No
041240120827              PERFORM Get_SubscriberAddress
041250120827              MOVE lc_C_Subsc_Address        to lc_C4_Subsc_Address
041260120827              PERFORM Get_Recipient-Type
041270120827              IF Lc_Recipient_Type = "2"
041280120827                 MOVE li_C4_Subsc_SIN        to li_C_Subsc_SIN
041290120827                 PERFORM Get_Joint_Subscriber
041300120827                 MOVE li_C_JoinSub_SIN       to li_C4_JoinSub_SIN
041310120827                 MOVE lc_C_JoinSub_LastName  to lc_C4_JoinSub_LastName
041320120827                 MOVE lc_C_JoinSub_FirstName to lc_C4_JoinSub_FirstName
041330120827                 MOVE lc_C_JoinSub_Phone     to li_C4_JoinSub_Phone
041340120827              END-IF
041350120827 73992*       MOVE lc_Current_04_Record TO lc_RecordToInsert
041360120827      * RFS 78268 - Start
041370120827              IF lc_F4_Mrq_Approval_Status (Li_Counter)  =
041380120827                 lncc_M
041390120827                 MOVE  lnci_02           TO li_C4_Trxn_VersCde
041400120827              END-IF
041410120827
041420120827              IF li_C4_TrusteeType       =  Lnci_1
041430120827      * RFS92917 - START
041440120827                 IF  lb_EXTQESIYes
041450120827                     PERFORM EXTQESI_AIP_Validation
041460120827                 ELSE
041470120827      *          PERFORM AIP_Validation
041480120827                     PERFORM AIP_Validation
041490120827                 END-IF
041500120827      * RFS92917 - END
041510120827              END-IF
041520120827
04153012082792917         INITIALIZE MFAMRQXFP OF Ltr_04FilingLog
041540120827              MOVE li_C4_Account_No   TO ACCOUNT-NO OF Ltr_04FilingLog
041550120827              MOVE li_C4_TrnsfrSeq_No TO TRANSFER-SEQ-NO
041560120827                                      OF Ltr_04FilingLog
041570120827              MOVE li_C4_BenSeq_No    TO BENEFICIARY-SEQ-NO
041580120827                                      OF Ltr_04FilingLog
041590120926      * RFS107668 - Start Updates MRQ-FILE-DATE only if Report <> 'Y'
041600121018              IF lc_ReportMode NOT = lncc_Y
041610120921                MOVE li_AsAtDate        TO MRQ-FILE-DATE
041620120921                                        OF Ltr_04FilingLog
041630120921              END-IF
041640120921      *       MOVE li_AsAtDate        TO MRQ-FILE-DATE
041650120921      *                               OF Ltr_04FilingLog
041660120926      * RFS107668  - End
041670120827              MOVE li_C4_Trxn_VersCde TO MRQ-VERSION-CODE
041680120827                                      OF Ltr_04FilingLog
041690120827              MOVE lc_C4_PromoterID   TO VENDOR-BN
041700120827                                      OF Ltr_04FilingLog
041710120827              MOVE li_C4_SpecimenPlanNo   TO SPECIMEN-ID
041720120827                                      OF Ltr_04FilingLog
041730120827              MOVE li_C4_Plan_Setup_Date  TO PLAN-SETUP-DATE
041740120827                                      OF Ltr_04FilingLog
041750120827              MOVE li_C4_Transfer_Date    TO TRANSFER-DATE
041760120827                                      OF Ltr_04FilingLog
041770120827              MOVE ln_C4_Tot_Transfer_Amt TO TOTAL-TRANSFER-VALUE
041780120827                                      OF Ltr_04FilingLog
041790150507      *RFS143887-STARTS
041800150507              INITIALIZE ln_MRQ_Assisted_Amt_04
041810150507
041820150507              IF ln_C4_MRQ_Assisted_Amt_Sign = "-"
041830150507                 COMPUTE ln_MRQ_Assisted_Amt_04 =
041840150507                         ln_C4_MRQ_Assisted_Amt * -1
041850150507              ELSE
041860150507                 COMPUTE ln_MRQ_Assisted_Amt_04 =
041870150507                         ln_C4_MRQ_Assisted_Amt
041880150507              END-IF
041890150507
041900150507      *       MOVE ln_C4_MRQ_Assisted_Amt TO MRQ-ASSISTED-CAPITAL
041910150507      *                               OF Ltr_04FilingLog
041920150507              MOVE ln_MRQ_Assisted_Amt_04 TO MRQ-ASSISTED-CAPITAL
041930150507                                      OF Ltr_04FilingLog
041940150507      *RFS143887-END
041950150507
041960120827      *-- RFS109472 - Begins
041970120827      *       MOVE ln_C4_MRQ_Unassisted_Amt TO MRQ-UNASSISTED-CAPITAL
041980120827      *                               OF Ltr_04FilingLog
041990120827
042000120827              INITIALIZE ln_MRQ_Unassisted_Amt_04
042010120827
042020120827              IF ln_C4_MRQ_Unassisted_Amt_Sign = "-"
042030120827                 COMPUTE ln_MRQ_Unassisted_Amt_04 =
042040120827                         ln_C4_MRQ_Unassisted_Amt * -1
042050120827              ELSE
042060120827                 COMPUTE ln_MRQ_Unassisted_Amt_04 =
042070120827                         ln_C4_MRQ_Unassisted_Amt
042080120827              END-IF
042090120827
042100120827              MOVE ln_MRQ_Unassisted_Amt_04
042110120827                                      TO MRQ-UNASSISTED-CAPITAL
042120120827                                      OF Ltr_04FilingLog
042130120827      *-- RFS109472 - Ends
042140120827              MOVE li_C4_IQEE_Trnsfr_Amt  TO IQEE-RECEIVED-AMT
042150120827                                      OF Ltr_04FilingLog
042160120827              MOVE lc_C4_PromoterID_Othr  TO QUEBEC-ENTERPRISE-NO
042170120827                                      OF Ltr_04FilingLog
042180120827              MOVE li_C4_Account_No_Othr  TO CONTRACT
042190120827                                      OF Ltr_04FilingLog
042200120827              MOVE li_C4_SpecimenPlanNo_Othr TO  OTHER-SPECIMEN-ID
042210120827                                      OF Ltr_04FilingLog
042220120827              MOVE li_C4_Benef_SIN        TO BEN-SIN
042230120827                                      OF Ltr_04FilingLog
042240120827              MOVE lc_C4_Benef_LastName   TO BEN-LAST-NAME
042250120827                                      OF Ltr_04FilingLog
042260120827              MOVE lc_C4_Benef_FirstName  TO BEN-FIRST-NAME
042270120827                                      OF Ltr_04FilingLog
042280120827              MOVE li_C4_Benef_DOB    TO BEN-DATE-OF-BIRTH
042290120827                                      OF Ltr_04FilingLog
042300120827              MOVE lc_C4_Benef_Sex    TO BEN-GENDER
042310120827                                      OF Ltr_04FilingLog
042320120827              MOVE li_C4_Tot_Trnsfr_Ind   TO TOTAL-TRANSFER-IND-1
042330120827                                          OF Ltr_04FilingLog
042340120827              MOVE li_C4_AIP_Paid_Ind     TO AIP-PAID-IND
042350120827                                          OF Ltr_04FilingLog
042360120827              MOVE li_C4_Auth_Trnsfr_Ind  TO AUTHORIZED-TRANSFER-1
042370120827                                          OF Ltr_04FilingLog
042380120827              MOVE lc_C4_Subsc_Type       TO SUBSCRIBER-TYPE
042390120827                                          OF Ltr_04FilingLog
042400120827              MOVE li_C4_Subsc_SIN        TO IVR-SIN
042410120827                                          OF Ltr_04FilingLog
042420120827              MOVE lc_C4_Subsc_BusNumber  TO IVR-BUSINESS-NUMBER-REVQ
042430120827                                          OF Ltr_04FilingLog
042440120827              MOVE lc_C4_Subsc_Name       TO IVR-NAME
042450120827                                          OF Ltr_04FilingLog
042460120827              MOVE lc_C4_Subsc_BenRelation TO IVR-BEN-RELATION
042470120827                                          OF Ltr_04FilingLog
042480120827              MOVE lc_C4_Subsc_Phone      TO IVR-PHONE-NUMBER
042490120827                                          OF Ltr_04FilingLog
042500120827              MOVE li_C4_JoinSub_SIN      TO JNT-SIN
042510120827                                          OF Ltr_04FilingLog
042520120827              MOVE lc_C4_JoinSub_LastName TO JNT-LAST-NAME
042530120827                                          OF Ltr_04FilingLog
042540120827              MOVE lc_C4_JoinSub_FirstName   TO JNT-FIRST-NAME
042550120827                                          OF Ltr_04FilingLog
042560120827              MOVE li_C4_JoinSub_BenRelation TO JNT-BEN-RELATION
042570120827                                          OF Ltr_04FilingLog
042580120827              MOVE li_C4_JoinSub_Phone    TO JNT-PHONE-NUMBER
042590120827                                          OF Ltr_04FilingLog
042600120827              PERFORM Transfer_Address
042610120827
042620120827              MOVE Li_Fetch-Ben-AddrNo    TO Ben-Addr-No
042630120827                               OF Ltr_04FilingLog
042640120827              MOVE Li_Fetch-Sub-AddrNo    TO Sub-Addr-No
042650120827                               OF Ltr_04FilingLog
042660120827              MOVE lncc_P                 TO
042670120827                   MRQ-APPROVAL-STATUS         OF Ltr_04FilingLog
042680130712      * RFS119929 - Start
042690130718              MOVE ln_C4Pre2007UnassCap TO
042700130715                   MRQ-PRE-2007-CAPITAL OF Ltr_04FilingLog
042710130715
042720130814              COMPUTE ln_F4Post2007UnassCap (li_Counter) =
042730130814              ln_F4Post2007UnassCap (li_Counter)
042740130814              - ln_F4Pre2007UnassCap (li_Counter)
042750130814
042760130814              MOVE ln_F4Post2007UnassCap (li_Counter) TO
042770130814                        ln_C4Post2007UnassCap
042780130814
042790130814              MOVE ln_C4Post2007UnassCap              TO
042800130814                 MRQ-POST-2007-UNASSIST-CAPITAL OF Ltr_04FilingLog
042810160219      * RFS145606 - START
042820160229              PERFORM NewSeqNoGen
042830160219              MOVE lc_mrq_trans_id TO lc_C4_MRQ_Trans_Id
042840160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID OF
042850160219                                      Ltr_04FilingLog
042860160219      * RFS145606 - END
042870130814
042880130712      * RFS119929 - End
042890120827              PERFORM Write04FilingLog
042900150826      *RFS150565 -BEGINS
042910150826
042920140603      *RFS 135546 - Begins.
042930150826      *      IF ln_C4Pre2007UnassCap < 0
042940150826      *       MOVE "-" TO ln_C4Pre2007UnassCap_Sign
042950150826      *       COMPUTE ln_C4Pre2007UnassCap_R =
042960150826      *               (ln_C4Pre2007UnassCap_R * -1)
042970150826      *      ELSE
042980150826      *       MOVE "0" TO ln_C4Pre2007UnassCap_Sign
042990150826      *      END-IF
043000150826      *      IF ln_C4Post2007UnassCap < 0
043010150826      *       MOVE "-" TO ln_C4Post2007UnassCap_Sign
043020150826      *       COMPUTE ln_C4Post2007UnassCap_R =
043030150826      *               (ln_C4Post2007UnassCap_R * -1)
043040150826      *      ELSE
043050150826      *        MOVE "0" TO ln_C4Post2007UnassCap_Sign
043060150826      *      END-IF
043070140603      *RFS 135546 - Ends.
043080150826
043090150826              PERFORM FormatPrePost2007Transfer
043100150826
043110150826      *RFS150565-ENDS
043120150826
043130120827              MOVE SPACES                     TO lc_C4_Filler2
043140120827      * RFS 78268 - End
043150120827 73992        MOVE lc_C4_Detail               TO lc_C4_DetailFinal
043160140923      *RFS139963 - Begins
043170140923              MOVE lc_Current_04_Record TO lc_Temp_0405_Record
043180140923              MOVE lc_temp_0405_acct TO Li_AccountNo_In
043190140923              PERFORM AccountEdit
043200140923              MOVE Lc_AccountNo_Out  TO lc_temp_0405_acct
043210150414145431        MOVE SPACES TO FillerOf04
043220140923              MOVE lc_Temp_0405_Record TO lc_RecordToInsert
043230140923 73992*       MOVE lc_Current_04_Record_Final TO lc_RecordToInsert
043240140923      *RFS139963 - Ends
043250120827              PERFORM InsertRecord
043260120827              PERFORM Update_TransferStatus
043270120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
043280120827      * RFS78268 - Begins - Update status if cancellation
043290120827           ELSE
043300120827              IF lc_OriginalFound
043310120827                 PERFORM Update_TransferStatus
043320120827              END-IF
043330120827           END-IF.
043340120827      * RFS78268 - Ends
043350120827           COMPUTE li_Counter = li_Counter + 1.
043360120827
043370120827      * RFS 78268 - Start
043380120827
043390120827      *---------------------
043400120827       Generate04Cancellation.
043410120827      *---------------------
043420120827
043430120827           SET  lc_OriginalFound TO TRUE.
043440120827           Initialize MFAMRQXFP OF ltr_04FilingLog
043450120827           EXEC SQL
043460120827                 SELECT * INTO :MFAMRQXFP
043470120827                 FROM   MFAMRQXFP
043480120827                 WHERE  ACCOUNT_NO         = :li_C4_Account_No
043490120827                   AND  TRANSFER_SEQ_NO    = :li_C4_TrnsfrSeq_No
043500120827                   AND  BENEFICIARY_SEQ_NO = :li_C4_BenSeq_No
043510120827                   AND  MRQ_FILE_DATE      = :li_F4_C_MRQ_File_Date
043520120827                   AND  MRQ_Version_Code <> :lnci_1
043530120827                        FETCH FIRST ROW ONLY
043540120827           END-EXEC.
043550120827
043560120827           MOVE SQLSTATE TO lc_sqlStates.
043570120827           IF not lncc_sqlSuccessful
043580120827              SET  lc_OriginalNotFound TO TRUE
043590120827              MOVE SQLSTATE     TO WS-SQLSTATE
043600120827              MOVE SQLCODE      TO WS-DSP-SQLCODE
043610120827              MOVE "MFAMRQXFP " To lncc_FileName
043620120827              MOVE lncc_ErrorFetchingCancel  To
043630120827                                   Ws-Sql-Err-Short-Descr
043640120827              PERFORM DisplayError
043650120827           END-IF.
043660120827
043670120827
043680120827           IF lc_OriginalFound
043690120827      *       RFS78268.17 - Begins - Set the version code to cancellation
043700120827      *       MOVE MRQ-VERSION-CODE   OF Ltr_04FilingLog
043710120827              MOVE lnci_1
043720120827                                      TO li_C4_Trxn_VersCde
043730120827      *       RFS78268.17 - Ends
043740120827              MOVE VENDOR-BN          OF Ltr_04FilingLog
043750120827                                      TO lc_C4_PromoterID
043760120827              MOVE ACCOUNT-NO         OF Ltr_04FilingLog
043770120827                                      TO li_C4_Account_No
043780120827              MOVE SPECIMEN-ID        OF Ltr_04FilingLog
043790120827                                      TO li_C4_SpecimenPlanNo
043800120827              MOVE PLAN-SETUP-DATE    OF Ltr_04FilingLog
043810120827                                      TO li_C4_Plan_Setup_Date
043820120827              MOVE TRANSFER-DATE      OF Ltr_04FilingLog
043830120827                                      TO li_C4_Transfer_Date
043840120827              MOVE TOTAL-TRANSFER-VALUE  OF Ltr_04FilingLog
043850120827                                      TO ln_C4_Tot_Transfer_Amt
043860120827              MOVE MRQ-ASSISTED-CAPITAL  OF Ltr_04FilingLog
043870120827                                      TO ln_C4_MRQ_Assisted_Amt
043880120827              MOVE MRQ-UNASSISTED-CAPITAL OF Ltr_04FilingLog
043890120827                                      TO ln_C4_MRQ_Unassisted_Amt
043900120827              MOVE IQEE-RECEIVED-AMT      OF Ltr_04FilingLog
043910120827                                      TO li_C4_IQEE_Trnsfr_Amt
043920120827              MOVE QUEBEC-ENTERPRISE-NO   OF Ltr_04FilingLog
043930120827                                      TO lc_C4_PromoterID_Othr
043940120827              MOVE CONTRACT               OF Ltr_04FilingLog
043950120827                                      TO li_C4_Account_No_Othr
043960120827              MOVE OTHER-SPECIMEN-ID  OF Ltr_04FilingLog
043970120827                                  TO li_C4_SpecimenPlanNo_Othr
043980120827              MOVE BEN-SIN            OF Ltr_04FilingLog
043990120827                                      TO     li_C4_Benef_SIN
044000120827              MOVE BEN-LAST-NAME      OF Ltr_04FilingLog
044010120827                                      TO     lc_C4_Benef_LastName
044020120827              MOVE BEN-FIRST-NAME     OF Ltr_04FilingLog
044030120827                                      TO     lc_C4_Benef_FirstName
044040120827              MOVE BEN-DATE-OF-BIRTH  OF Ltr_04FilingLog
044050120827                                      TO     li_C4_Benef_DOB
044060120827              MOVE BEN-GENDER         OF Ltr_04FilingLog
044070120827                                      TO     lc_C4_Benef_Sex
044080120827              MOVE Ben-Addr-No OF Ltr_04FilingLog
044090120827                                      TO     Li_Fetch-AddrNo
044100120827              PERFORM Fetch_Address
044110120827              MOVE Lc_Fetch-AptNo    TO  lc_C4_Benef_AptNo
044120120827              MOVE Lc_Fetch-CivicNo  TO  lc_C4_Benef_StreetNo
044130120827              MOVE Lc_Fetch-Street   TO  lc_C4_Benef_StreetName
044140120827              MOVE Lc_Fetch-Addr2    TO  lc_C4_Benef_AddLine2
044150120827              MOVE Lc_Fetch-Addr3    TO  lc_C4_Benef_AddLine3
044160120827              MOVE Lc_Fetch-City     TO  lc_C4_Benef_City
044170120827              MOVE Lc_Fetch-Prov     TO  lc_C4_Benef_Prov
044180120827              MOVE Lc_Fetch-Country  TO  lc_C4_Benef_Country
044190120827              MOVE Lc_Fetch-Postal   TO  lc_C4_Benef_PostalCode
044200120827              MOVE TOTAL-TRANSFER-IND-1  OF Ltr_04FilingLog
044210120827                                     TO li_C4_Tot_Trnsfr_Ind
044220120827              MOVE AIP-PAID-IND      OF Ltr_04FilingLog
044230120827                                     TO  li_C4_AIP_Paid_Ind
044240120827              MOVE lnci_0            TO ln_C4_Fair_Mkt_Value
044250120827              MOVE lnci_0            TO ln_C4_CLB_Amt
044260120827              MOVE AUTHORIZED-TRANSFER-1 OF Ltr_04FilingLog
044270120827                                     TO li_C4_Auth_Trnsfr_Ind
044280120827              MOVE SUBSCRIBER-TYPE   OF Ltr_04FilingLog
044290120827                                     TO lc_C4_Subsc_Type
044300120827              MOVE IVR-SIN           OF Ltr_04FilingLog
044310120827                                     TO li_C4_Subsc_SIN
044320120827              MOVE IVR-BUSINESS-NUMBER-REVQ OF Ltr_04FilingLog
044330120827                                     TO lc_C4_Subsc_BusNumber
044340120827              MOVE IVR-NAME                 OF Ltr_04FilingLog
044350120827                                     TO lc_C4_Subsc_Name
044360120827              MOVE IVR-BEN-RELATION         OF Ltr_04FilingLog
044370120827                                     TO lc_C4_Subsc_BenRelation
044380120827              MOVE Sub-Addr-No OF Ltr_04FilingLog
044390120827                                     TO     Li_Fetch-AddrNo
044400120827              PERFORM Fetch_Address
044410120827              MOVE Lc_Fetch-AptNo    TO     lc_C4_Subsc_AptNo
044420120827              MOVE Lc_Fetch-CivicNo  TO     lc_C4_Subsc_StreetNo
044430120827              MOVE Lc_Fetch-Street   TO     lc_C4_Subsc_StreetName
044440120827              MOVE Lc_Fetch-Addr2    TO     lc_C4_Subsc_AddrLine2
044450120827              MOVE Lc_Fetch-Addr3    TO     lc_C4_Subsc_AddrLine3
044460120827              MOVE Lc_Fetch-City     TO     lc_C4_Subsc_City
044470120827              MOVE Lc_Fetch-Prov     TO     lc_C4_Subsc_Prov
044480120827              MOVE Lc_Fetch-Country  TO     lc_C4_Subsc_Country
044490120827              MOVE Lc_Fetch-Postal   TO     lc_C4_Subsc_PostalCode
044500120827              MOVE IVR-PHONE-NUMBER  OF Ltr_04FilingLog
044510120827                                     TO     lc_C4_Subsc_Phone
044520120827              MOVE JNT-SIN           OF Ltr_04FilingLog
044530120827                                     TO     li_C4_JoinSub_SIN
044540120827              MOVE JNT-LAST-NAME     OF Ltr_04FilingLog
044550120827                                     TO     lc_C4_JoinSub_LastName
044560120827              MOVE JNT-FIRST-NAME    OF Ltr_04FilingLog
044570120827                                     TO     lc_C4_JoinSub_FirstName
044580120827              MOVE JNT-BEN-RELATION  OF Ltr_04FilingLog
044590120827                                     TO     li_C4_JoinSub_BenRelation
044600120827              MOVE JNT-PHONE-NUMBER  OF Ltr_04FilingLog
044610120827                                     TO     li_C4_JoinSub_Phone
044620120827
044630120827      *       RFS78268.17 - Begins - Change the filler section
044640120827      *       MOVE SPACES            TO     lc_C4_Filler2
044650120827              MOVE SPACES            TO     lc_C4_Filler
044660120827      *       RFS78268.17 - Ends
044670140923      *RFS139963 - Begins
044680150505
044690150505      *RFS143887 - BEGINS
044700150826150565        MOVE MRQ-PRE-2007-CAPITAL OF Ltr_04FilingLog
044710150826150565                                  TO ln_C4Pre2007UnassCap
044720150826150565        MOVE MRQ-POST-2007-UNASSIST-CAPITAL  OF Ltr_04FilingLog
044730150826150565                                  TO ln_C4Post2007UnassCap
044740150505              PERFORM FormatTransferCapital
044750150826150565        PERFORM FormatPrePost2007Transfer
044760160219      *RFS145606 - START
044770160229              PERFORM NewSeqNoGen
044780160219              MOVE lc_mrq_trans_id TO lc_C4_MRQ_Trans_Id
044790160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
044800160219                                      OF Ltr_04FilingLog
044810160219      *RSF145606 - END
044820150505      *RFS143887 - ENDS
044830150505
044840140923              MOVE lc_Current_04_Record TO lc_Temp_0405_Record
044850140923              MOVE lc_temp_0405_acct TO Li_AccountNo_In
044860140923              PERFORM AccountEdit
044870140923              MOVE Lc_AccountNo_Out  TO lc_temp_0405_acct
044880150414145431        MOVE SPACES TO FillerOf04
044890140923              MOVE lc_Temp_0405_Record TO lc_RecordToInsert
044900140923      *       MOVE lc_Current_04_Record TO     lc_RecordToInsert
044910140923      *RFS139963 - Ends
044920120827              PERFORM InsertRecord
044930120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
044940120827
044950120827      *    cancellation filing record
044960120921
044970120926      * RFS107668 -  Start Updates MRQ-FILE-DATE only if Report <> 'Y'
044980121018           IF lc_ReportMode NOT = lncc_Y
044990120921             MOVE li_AsAtDate   TO MRQ-FILE-DATE OF Ltr_04FilingLog
045000120921           END-IF
045010120921      *    MOVE li_AsAtDate   TO MRQ-FILE-DATE OF Ltr_04FilingLog
045020120926      * RFS107668 - End
045030120827
045040120827           MOVE lnci_1        TO MRQ-VERSION-CODE OF Ltr_04FilingLog
045050120827      *    RFS78268.17 - Begins - Set the filing status to P
045060120827           MOVE Lncc_P        TO MRQ-APPROVAL-STATUS
045070120827                              OF Ltr_04FilingLog
045080120827      *    RFS78268.17 - Ends
045090120827           PERFORM Write04FilingLog
045100120827
045110120827      *    Original/aMendment Filing record
045120120827
045130120827           END-IF.
045140120827
045150120827      *---------------------
045160120827       Write04FilingLog.
045170120827      *---------------------
045180120827
045190120921      * RFS107668 - Start - Moved the existing logic into IF condition
045200121018           IF lc_ReportMode NOT = lncc_Y
045210120926      * RFS107668 - End
045220120827      *        RFS78268.25 - Begins - Set the record-type-2
045230120925               MOVE Lncc_04
045240120925                 TO RECORD-TYPE-2
045250120925                    OF Ltr_04FilingLog
045260120827      *        RFS78268.25 - Ends
045270120827
045280120925           EXEC SQL
045290120925             INSERT INTO MFAMRQXFP VALUES(:MFAMRQXFP)
045300120925           END-EXEC
045310120827
045320120925           MOVE SQLSTATE TO lc_sqlStates
045330120925           IF not lncc_sqlSuccessful
045340120925              SET lncc_Err_I1 TO TRUE
045350120925              MOVE "MFAMRQXFP " TO lncc_InsertFileName
045360120925              MOVE lncc_ErrorInsertingFile TO lc_sqlErrShortDESCR
045370120925              PERFORM SQLFailProcess
045380120926      * RFS107668 - Start
045390120926      *    END-IF.
045400120925           END-IF
045410120921           ELSE
045420121010             INITIALIZE li_Report-Variables
045430121010             MOVE li_C4_RecordType        TO lc_ReportFilingRectype
045440120921             MOVE li_C4_Plan_Setup_Date   TO li_WK-Contract-Start-Date
045450120921             MOVE li_C4_Benef_SIN         TO li_WK-Beneficiary-SIN
045460120921             MOVE li_C4_Benef_DOB         TO li_WK-Beneficiary-DOB
045470120921             MOVE lc_C4_PromoterID_Othr   TO lc_WK-NEQ-of-Other-Agent
045480120921             MOVE li_C4_Auth_Trnsfr_Ind   TO li_WK-Authorized-Trans-Ind
045490120921             MOVE li_C4_Tot_Trnsfr_Ind    TO li_WK-Total-Transfer-Ind
045500120921             MOVE ln_C4_Tot_Transfer_Amt  TO li_WK-Total-Transfer-Amt
045510150507143887*      MOVE ln_C4_MRQ_Assisted_Amt  TO li_WK-Total-Assisted-Amt
045520150507143887       MOVE ln_MRQ_Assisted_Amt_04  TO li_WK-Total-Assisted-Amt
045530120921             MOVE ln_MRQ_Unassisted_Amt_04
045540120921                                          TO li_WK-Total-Unassisted-Amt
045550120921             MOVE li_C4_IQEE_Trnsfr_Amt   TO li_WK-QESI-Amt-Received
045560120921             MOVE lc_C4_Transfer_Status   TO lc_WK-Transfer-Status
045570120921             PERFORM Record_Comparison
045580120921           END-IF.
045590120921      * RFS107668 - End
045600120921
045610120827      * RFS92917 - START
045620120827      *---------------
045630120827       EXTQESI_AIP_Validation.
045640120827      *---------------
045650120827           MOVE lnci_0 TO  Li_AIP_Count.
045660120827           EXEC SQL
045670120827             SELECT COUNT(*)
045680120827             INTO   :Li_AIP_Count
045690120827             FROM   MFAMRQTSP MRQTSP
045700120827             WHERE  MRQTSP.Transaction_type_2   = :Lnci_92
045710120827             AND    MRQTSP.REVERSAL_FLAG       <> :Lncc_Y
045720120827             AND    MRQTSP.TRADE_DATE          <= :li_C4_Transfer_Date
045730120827           END-EXEC.
045740120827
045750120827           MOVE SQLSTATE                     TO lc_sqlStates.
045760130201      * RFS118702 - Start
045770130201           EVALUATE TRUE
045780130201             WHEN lncc_sqlSuccessful OR lncc_SqlWarning OR lncc_sqlEnd
045790130201               CONTINUE
045800130201             WHEN OTHER
045810130201               MOVE SQLSTATE                 TO WS-SQLSTATE
045820130201               MOVE SQLCODE                  TO WS-DSP-SQLCODE
045830130201               MOVE "MFAMRQTSP "             TO lncc_SelectFileName
045840130201               MOVE lncc_ErrorSelectingFile  TO
045850130201                                     Ws-Sql-Err-Short-Descr
045860130201               PERFORM DisplayError
045870130201           END-EVALUATE.
045880130201      * RFS118702 - End
045890120827           IF  Li_AIP_Count > lnci_0
045900120827               MOVE lnci_1                   TO li_C4_AIP_Paid_Ind
045910130201      * RFS118702 - Start
045920130201      *    ELSE
045930130201      *        MOVE SQLSTATE                 TO WS-SQLSTATE
045940130201      *        MOVE SQLCODE                  TO WS-DSP-SQLCODE
045950130201      *        MOVE "MFAMRQTSP "             TO lncc_FileName
045960130201      *        MOVE lncc_ErrorSelectingFile  TO
045970130201      *                             Ws-Sql-Err-Short-Descr
045980130201      *        PERFORM DisplayError
045990130201      * RFS118702 - End
046000120827           END-IF.
046010120827
046020120827      * RFS92917 - END
046030120827
046040120827      *---------------
046050120827       AIP_Validation.
046060120827      *---------------
046070120827           MOVE lnci_0 TO  Li_AIP_Count.
046080120827
046090120827           EXEC SQL
046100120827                SELECT COUNT(*) INTO :Li_AIP_Count
046110120827                         FROM MFATRNP TRNP
046120120827                INNER JOIN    MFAACCNTP CNTP ON
046130120827                              TRNP.Account_NO    = CNTP.Account_No
046140120827                INNER JOIN    MFAACCTYP  TYP ON
046150120827                              CNTP.Account_type_code  =
046160120827                              TYP.Account_type_code
046170120827                INNER JOIN    MFACNTRRP RRP  ON
046180120827                              CNTP.Account_type_code  =
046190120827                              RRP.Account_type_code
046200120827                       AND    TRNP.contr_redem_code   =
046210120827                              RRP.contr_redem_code
046220120827                WHERE         TRNP.Account_NO = :li_C4_Account_No
046230120827                       AND    TYP.account_type_rule  = :lncc_4
046240120827                       AND    RRP.contr_redem_code_rule  = :lncc_4
046250120827                       AND    TRNP.trade_date <=
046260120827                              :li_C4_Transfer_Date
046270120827                       AND    TRNP.Trans_Status_Code
046280120827                              IN(:Lncc_HST,:Lncc_HSC)
046290120827                       AND    TRNP.Reverse <> :Lncc_Y
046300120827
046310120827           END-EXEC.
046320120827
046330120827            MOVE SQLSTATE TO lc_sqlStates.
046340120827            IF not lncc_sqlSuccessful
046350120827               MOVE SQLSTATE     TO WS-SQLSTATE
046360120827               MOVE SQLCODE      TO WS-DSP-SQLCODE
046370120827               MOVE "MFATRNP   " To lncc_FileName
046380120827               MOVE "Failed on AIP TRANS   " TO lc_sqlErrShortDESCR
046390120827              PERFORM DisplayError
046400120827            END-IF.
046410120827
046420120827           IF Li_AIP_Count > lnci_0
046430120827              MOVE lnci_1 TO li_C4_AIP_Paid_Ind
046440120827           END-IF.
046450120827
046460120827      *---------------------
046470120827       Transfer_Address.
046480120827      *---------------------
046490120827
046500120827      * RFS78268.25 - Begins - Initialize fields
046510120827           INITIALIZE Li_Fetch-Ben-AddrNo
046520120827                      Li_Fetch-Sub-AddrNo.
046530120827      * RFS78268.25 - Ends
046540120827
046550120827
046560120827           EXEC SQL
046570120827                SELECT   COALESCE(XFP.Ben_Addr_No,0),
046580120827                         COALESCE(XFP.Sub_Addr_No,0)
046590120827                  INTO   :Li_Fetch-Ben-AddrNo,
046600120827                         :Li_Fetch-Sub-AddrNo
046610120827                  FROM   MFAACCNTP ACCNTP
046620120827             LEFT JOIN   MFAMRQXFP XFP ON
046630120827                         ACCNTP.Account_no = XFP.Account_no
046640120827                   AND   XFP.Beneficiary_Seq_No  =
046650120827                         :li_C4_benSeq_no
046660120827                  WHERE  ACCNTP.Account_no =  :li_C4_Account_No
046670120827                    AND  XFP.MRQ_Version_Code <> 1
046680120827               ORDER BY  XFP.MRQ_File_Date Desc,
046690120827                         XFP.MRQ_Version_Code
046700120827                  FETCH FIRST ROW ONLY
046710120827
046720120827           END-EXEC.
046730120827
046740120827           MOVE Li_Fetch-Ben-AddrNo    TO Li_Validate-AddrNo.
046750120827           MOVE lc_C4_Benef_AptNo      TO   Lc_Validate-AptNo
046760120827           MOVE lc_C4_Benef_StreetNo   TO   Lc_Validate-CivicNo
046770120827           MOVE lc_C4_Benef_StreetName TO   Lc_Validate-Street
046780120827           MOVE lc_C4_Benef_AddLine2   TO   Lc_Validate-Addr2
046790120827           MOVE lc_C4_Benef_AddLine3   TO   Lc_Validate-Addr3
046800120827           MOVE lc_C4_Benef_City       TO   Lc_Validate-City
046810120827           MOVE lc_C4_Benef_Prov       TO   Lc_Validate-Prov
046820120827           MOVE lc_C4_Benef_Country    TO   Lc_Validate-Country
046830120827           MOVE lc_C4_Benef_PostalCode TO   Lc_Validate-Postal.
046840120827
046850120827           PERFORM Validate_Address.
046860120827           IF Li_Validate-AddrNo  = lnci_0
046870120827              PERFORM Create_Address
046880120827              MOVE Li_Validate-AddrNo  TO Li_Fetch-Ben-AddrNo
046890120827           END-IF.
046900120827           IF Li_Fetch-Sub-AddrNo = lnci_0
046910120827              MOVE Li_Fetch-Ben-AddrNo TO Li_Fetch-Sub-AddrNo
046920120827           END-IF.
046930120827
046940120827           MOVE Li_Fetch-Sub-AddrNo       TO   Li_Validate-AddrNo.
046950120827           MOVE lc_C4_Subsc_AptNo         TO   Lc_Validate-AptNo
046960120827           MOVE lc_C4_Subsc_StreetNo      TO   Lc_Validate-CivicNo
046970120827           MOVE lc_C4_Subsc_StreetName    TO   Lc_Validate-Street
046980120827           MOVE lc_C4_Subsc_AddrLine2     TO   Lc_Validate-Addr2
046990120827           MOVE lc_C4_Subsc_AddrLine3     TO   Lc_Validate-Addr3
047000120827           MOVE lc_C4_Subsc_City          TO   Lc_Validate-City
047010120827           MOVE lc_C4_Subsc_Prov          TO   Lc_Validate-Prov
047020120827           MOVE lc_C4_Subsc_Country       TO   Lc_Validate-Country
047030120827           MOVE lc_C4_Subsc_PostalCode    TO   Lc_Validate-Postal.
047040120827
047050120827           PERFORM Validate_Address.
047060120827
047070120827           IF Li_Validate-AddrNo = lnci_0
047080120827              IF  Li_Fetch-Sub-AddrNo = Li_Fetch-Ben-AddrNo
047090120827                PERFORM Create_Address
047100120827      *         RFS92917.29 - Begins - Assign to Sub-AddrNo
047110120827      *         MOVE Li_Validate-AddrNo TO Li_Fetch-Ben-AddrNo
047120120827                MOVE Li_Validate-AddrNo TO Li_Fetch-Sub-AddrNo
047130120827      *         RFS92917.29 - Ends
047140120827              ELSE
047150120827                MOVE Li_Fetch-Ben-AddrNo  TO  Li_Fetch-Sub-AddrNo
047160120827                PERFORM Validate_Address
047170120827                IF Li_Validate-AddrNo = lnci_0
047180120827                  PERFORM Create_Address
047190120827      *           RFS92917.29 - Begins - Assign to Sub-AddrNo
047200120827      *           MOVE Li_Validate-AddrNo TO Li_Fetch-Ben-AddrNo
047210120827                  MOVE Li_Validate-AddrNo TO Li_Fetch-Sub-AddrNo
047220120827      *         RFS92917.29 - Ends
047230120827                END-IF
047240120827              END-IF
047250120827           END-IF.
047260120827
047270130711      * RFS119929 - Start
047280130711
047290130715       Create_InterPlanTransferCursor.
047300130711
047310130711           EXEC SQL
047320130718              DECLARE InterPlanTransferCursor CURSOR FOR
047330130718           SELECT
047340130711             MRQXFP.RECORD_TYPE_2,
047350130711             MRQXFP.MRQ_VERSION_CODE,
047360130711             MRQXFP.TRUSTEE_TYPE,
047370130711             MRQXFP.VENDOR_BN,
047380130711             MRQXFP.ACCOUNT_NO,
047390130711             MRQXFP.SPECIMEN_ID,
047400130711             MRQXFP.PLAN_SETUP_DATE,
047410130711             MRQXFP.TRANSFER_DATE,
047420130711             MRQXFP.TOTAL_TRANSFER_VALUE,
047430130711             MRQXFP.MRQ_ASSISTED_CAPITAL,
047440130711             MRQXFP.MRQ_UNASSISTED_CAPITAL,
047450130711             MRQXFP.IQEE_RECEIVED_AMT,
047460130711             MRQXFP.QUEBEC_ENTERPRISE_NO,
047470130711             MRQXFP.CONTRACT,
047480130711             MRQXFP.OTHER_SPECIMEN_ID,
047490130711             MRQXFP.BEN_SIN,
047500130711             MRQXFP.BEN_LAST_NAME,
047510130711             MRQXFP.BEN_FIRST_NAME,
047520130711             MRQXFP.BEN_DATE_OF_BIRTH,
047530130711             MRQXFP.BEN_GENDER,
047540130711             ADDP.MISC_FIRST_ADDR_LINE,
047550130711             ADDP.Street_No,
047560130711             SUBSTR (ADDP.Street_Name,1,30) CONCAT
047570130711                 SUBSTR (ADDP.Street_Type_Code,1,6) CONCAT
047580130711                     SUBSTR (ADDP.Street_Dirct_Code,1,2),
047590130711             ADDP.Misc_Second_Addr_Line,
047600130712             " ",
047610130712             ADDP.City,
047620130712             CASE WHEN ADDP.Country_Code = "CAN"
047630130712                  THEN ADDP.Province_Code
047640130712                  ELSE " "
047650130712             END,
047660130712      *      CASE WHEN ADDP.Country_Code = "CAN" THEN " "
047670130712      *           WHEN ADDP.Country_Code = "USA"
047680130712      *           THEN PRVDC.Province_Code_Descr
047690130712      *           ELSE CNTRY.Country_Name
047700130712      *      END,
047710130712
047720130711             CASE WHEN ADDP.Country_Code IN("CAN","USA")
047730130711                  THEN ADDP.Country_Code
047740130711                  ELSE :lncc_AUT
047750130711             END,
047760130711             ADDP.Postal_Code,
047770130711             MRQXFP.TOTAL_TRANSFER_IND_1,
047780130711             MRQXFP.AIP_PAID_IND,
047790130711             0,
047800130711             0,
047810130711             MRQXFP.AUTHORIZED_TRANSFER_1,
047820130711             MRQXFP.SUBSCRIBER_TYPE,
047830130711             MRQXFP.IVR_SIN,
047840130711             MRQXFP.IVR_BUSINESS_NUMBER_REVQ,
047850130711             MRQXFP.IVR_NAME,
047860130711             MRQXFP.IVR_BEN_RELATION,
047870130711             :lncc_Spaces_SubscAddr,
047880130711             MRQXFP.JNT_SIN,
047890130711             MRQXFP.JNT_LAST_NAME,
047900130711             MRQXFP.JNT_FIRST_NAME,
047910130711             MRQXFP.JNT_BEN_RELATION,
047920130712             MRQXFP.JNT_PHONE_NUMBER,
047930130717             MRQXFP.MRQ_PRE_2007_CAPITAL,
047940130717             MRQXFP.MRQ_POST_2007_UNASSIST_CAPITAL,
047950130717             0,
047960130722             MRQXFP.BENEFICIARY_SEQ_NO,
047970130717             0,
047980130717             " ",
047990130715             " ",
048000130717             " "
048010130711           FROM
048020130711             MFAMRQXFP MRQXFP
048030130715           JOIN MFAACCBNP ACCBNP ON
048040130715               MRQXFP.Account_No = ACCBNP.Account_No
048050130715           AND MRQXFP.Beneficiary_Seq_No = ACCBNP.Beneficiary_Seq_No
048060130715           JOIN MFAADDP ADDP ON
048070130715               ACCBNP.Addr_No = ADDP.Addr_No
048080130711           WHERE
048090130711             MRQXFP.TRANSFER_SEQ_NO = 0 AND
048100130711             MRQXFP.MRQ_FILE_DATE   = 0 AND
048110130711             MRQXFP.MRQ_APPROVAL_STATUS  = "U" AND
048120130711             MRQXFP.MRQ_APPROVAL_STATUS_REASON = " " AND
048130130711             MRQXFP.RECORD_TYPE_2  = "04" AND
048140130711             MRQXFP.TRUSTEE_TYPE   = "03"
048150130711           FOR FETCH ONLY
048160130711           OPTIMIZE FOR ALL ROWS
048170130711           END-EXEC.
048180130711
048190130711           EXEC SQL
048200130715             OPEN InterPlanTransferCursor
048210130711           END-EXEC.
048220130712
048230130711           MOVE SQLSTATE   TO WS-SQL-STATES.
048240130711           EXEC SQL
048250130711           WHENEVER NOT FOUND CONTINUE
048260130711           END-EXEC.
048270130711
048280130718       Create_InterPlanTransfer.
048290130711
048300130711           INITIALIZE ltb_FetchC4Table.
048310130711           EXEC SQL
048320130711           WHENEVER NOT FOUND CONTINUE
048330130711           END-EXEC.
048340130711
048350130711           EXEC SQL
048360130715              FETCH NEXT FROM InterPlanTransferCursor
048370130718                FOR :lnci_MaxFetchRec ROWS
048380130718                INTO  :ltb_C4Cursor:ltb_Indicators
048390130711           END-EXEC.
048400130711
048410130711           MOVE SQLSTATE TO lc_sqlStates.
048420130711           EVALUATE TRUE
048430130711               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
048440130711                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
048450130711               WHEN lncc_sqlEnd
048460130711                    SET lb_EndOfCursorTrue TO TRUE
048470130711                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
048480130711               WHEN OTHER
048490130711                    SET lncc_Err_Fetch TO TRUE
048500130718                    MOVE lnc_ErrorFetchingCursor07
048510130711                      TO lc_sqlErrShortDESCR
048520130711                    PERFORM SQLFailProcess
048530130711               END-EVALUATE.
048540130711
048550130711               COMPUTE li_Counter = 1.
048560130712               PERFORM GetNext_InterplanType04Row   TEST BEFORE
048570130711                 UNTIL li_Counter > li_NoOfRowsFetched.
048580130711
048590130712       GetNext_InterplanType04Row.
048600130712
048610130715           ACCEPT WS-MFAPRCDTP  FROM DATAARA-MFAPRCDTP
048620130715                                FOR LT-MFAPRCDTP.
048630130715
048640130718           MOVE li_F4_Account_No(li_Counter) TO li_InterplanAccountNo
048650130718           MOVE li_F4_Trnsfr_No (li_Counter) TO li_InterplanTrnsfrNo
048660130718           MOVE li_F4_Ben_Seq_No(li_Counter) TO li_InterplanBenSeqNo
048670130715           MOVE li_F4_Transfer_Date(li_Counter)
048680130718                TO li_InterplanTransferDate
048690130715           MOVE li_F4_Trxn_VersCde(li_Counter)
048700130718                TO li_InterplanTrxnVersCde
048710130715           MOVE li_F4_MRQ_File_Date(li_Counter)
048720130718                TO li_InterplanMRQFileDate
048730130718           MOVE li_InterplanAccountNo TO li_C_Account_No
048740130715           EXEC SQL
048750130715             UPDATE MFAMRQXFP MRQXFP
048760130715             SET MRQXFP.MRQ_APPROVAL_STATUS = :lncc_P,
048770130715                 MRQXFP.MRQ_FILE_DATE       = :WS-AS-AT-DATE
048780130715             WHERE
048790130718             MRQXFP.Account_No       = :li_InterplanAccountNo
048800130715             AND
048810130718             MRQXFP.Transfer_Seq_No  = :li_InterplanTrnsfrNo
048820130715             AND
048830130718             MRQXFP.BENEFICIARY_SEQ_NO = :li_InterplanBenSeqNo
048840130715             AND
048850130718             MRQXFP.Transfer_Date    = :li_InterplanTransferDate
048860130715             AND
048870130718             MRQXFP.MRQ_Version_Code = :li_InterplanTrxnVersCde
048880130715             AND
048890130718             MRQXFP.MRQ_File_Date    = :li_InterplanMRQFileDate
048900130715           END-EXEC.
048910130722
048920130722      *    MOVE ltb_C4Cursor(li_Counter) TO
048930130722      *         lc_Current_04_InterplanRecord.
048940130712
048950130722           MOVE ltb_C4Cursor(li_Counter) TO
048960130722                lc_Current_04_Record.
048970130722
048980130716           PERFORM Get_SubscriberAddress.
048990130722      *    MOVE lc_C_Subsc_AptNo  TO lc_C4SubscAptNoI
049000130722      *    MOVE lc_C_Subsc_StreetNo TO lc_C4SubscStreetNoI
049010130722      *    MOVE lc_C_Subsc_StreetName TO lc_C4SubscStreetNameI
049020130722      *    MOVE lc_C_Subsc_AddrLine2  TO lc_C4SubscAddrLine2I
049030130722      *    MOVE lc_C_Subsc_AddrLine3  TO lc_C4SubscAddrLine3I
049040130722      *    MOVE lc_C_Subsc_City  TO lc_C4SubscCityI
049050130722      *    MOVE lc_C_Subsc_Prov  TO lc_C4SubscProvI
049060130722      *    MOVE lc_C_Subsc_Country TO lc_C4SubscCountryI
049070130722      *    MOVE lc_C_Subsc_PostalCode TO lc_C4SubscPostalCodeI
049080130722      *    MOVE lc_C_Subsc_Phone  TO lc_C4SubscPhoneI
049090130712
049100130722           MOVE lc_C_Subsc_AptNo  TO lc_C4_Subsc_AptNo
049110130722           MOVE lc_C_Subsc_StreetNo TO lc_C4_Subsc_StreetNo
049120130722           MOVE lc_C_Subsc_StreetName TO lc_C4_Subsc_StreetName
049130130722           MOVE lc_C_Subsc_AddrLine2  TO lc_C4_Subsc_AddrLine2
049140130722           MOVE lc_C_Subsc_AddrLine3  TO lc_C4_Subsc_AddrLine3
049150130722           MOVE lc_C_Subsc_City  TO lc_C4_Subsc_City
049160130722           MOVE lc_C_Subsc_Prov  TO lc_C4_Subsc_Prov
049170130722           MOVE lc_C_Subsc_Country TO lc_C4_Subsc_Country
049180130722           MOVE lc_C_Subsc_PostalCode TO lc_C4_Subsc_PostalCode
049190130722           MOVE lc_C_Subsc_Phone  TO lc_C4_Subsc_Phone
049200130722
049210130722      *    MOVE SPACES                     TO lc_C4FillerI.
049220130722           MOVE SPACES                     TO lc_C4_Filler2.
049230130722      *    MOVE lc_Current_04_InterplanRecord
049240130722      *         TO lc_RecordToInsert
049250160222      * RFS145606 - START
049260160229                PERFORM NewSeqNoGen
049270160222                MOVE lc_mrq_trans_id     TO lc_C4_MRQ_Trans_Id
049280160222      * RFS145606 - END
049290160405           MOVE lc_C4_Detail               TO lc_C4_DetailFinal
049300130722           MOVE lc_Current_04_Record_Final TO lc_RecordToInsert
049310130712           PERFORM InsertRecord
049320151103151502     COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1.
049330130712           COMPUTE li_Counter = li_Counter + 1.
049340130712
049350130711      * RFS119929 - End
049360130711
049370120827      * RFS 78268 - End
049380120827      *---------------------
049390121003       BuildEapPseTables.
049400120827      *---------------------
049410120827
049420120827           EXEC SQL
049430120827             DROP TABLE
049440120827               QTEMP/EAPPSETBL1
049450120827           END-EXEC.
049460120827
049470120827           EXEC SQL
049480120827             DROP TABLE
049490120827               QTEMP/EAPPSETBL2
049500120827           END-EXEC.
049510120827
049520120827      *84977.13 - Begin
049530120827      * RFS92917 - START
049540120827      * Moved the below Commented code to initial_steps para.
049550120827      *    EXEC SQL
049560120827      *      DROP TABLE
049570120827      *        QTEMP/EAPPSETBL
049580120827      *    END-EXEC.
049590120827      * RFS92917 - END
049600120827      *84977.13 - End
049610120827
049620120827      *RFS 78268 - Start
049630120827           EXEC SQL
049640120827             DROP TABLE
049650120827               QTEMP/EAPPSESUM
049660120827           END-EXEC.
049670120827
049680120827           EXEC SQL
049690120827             DROP TABLE
049700120827               QTEMP/EAPPSESUM2
049710120827           END-EXEC.
049720120827
049730120827      *RFS 78268 - End
049740120827
049750120827      *Records are consolidated on account no, beneficiary seq no
049760120827      *payment type, and trade date. Payment type is determined by
049770120827      *contribution redemption code rule and account type rule
049780120827      *CRC Rule = 28 Acct Type rule = 4, payment type = 01
049790120827      *CRC Rule = 12 Acct Type rule = 4, payment type = 02
049800120827      *In the first table, sum values where there is a direct link
049810120827      *between MFATRNQAP and MFATRNP. In the second table, sum
049820120827      *values where transactions are associated to MFATRNQAP by
049830120827      *account number and trade date
049840120827           EXEC SQL
049850120827             CREATE TABLE QTEMP/EAPPSETBL1
049860120827              (ACCTNO     NUMERIC ( 9) NOT NULL WITH DEFAULT,
04987012082790545 *        BENSEQNO   NUMERIC ( 2) NOT NULL WITH DEFAULT,
04988012082790545          BENSEQNO   NUMERIC ( 3) NOT NULL WITH DEFAULT,
049890120827               YEAR       NUMERIC ( 4) NOT NULL WITH DEFAULT,
049900120827               QCRSDIND   CHAR    ( 1) NOT NULL WITH DEFAULT,
049910120827               TRDDATE    DECIMAL ( 9) NOT NULL WITH DEFAULT,
049920120827      * 84977.13 Begin
049930120827               PAYTYPE    NUMERIC ( 2) NOT NULL WITH DEFAULT,
049940120827      * 84977.13 End
049950120827               CRCRULE    CHAR    ( 2) NOT NULL WITH DEFAULT,
04996012082790545 *        ACTTYPR    NUMERIC ( 2) NOT NULL WITH DEFAULT,
04997012082790545          ACTTYPR    CHAR    ( 1) NOT NULL WITH DEFAULT,
049980120827               GRSAMT1    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
049990120827      * RFS 78268 - Start
050000120827      *        GRSAMT2    DECIMAL (9, 2) NOT NULL WITH DEFAULT
050010120827               GRSAMT2    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
050020120827               RVSL       CHAR    ( 1) NOT NULL WITH DEFAULT,
050030120827               CANCEL     CHAR    ( 1) NOT NULL WITH DEFAULT,
050040120827               MRQAPRSTAT CHAR    ( 1) NOT NULL WITH DEFAULT,
050050120827               MRQFILEDT  NUMERIC ( 8) NOT NULL WITH DEFAULT
050060120827      * RFS 78268 - End
050070120827              )
050080120827           END-EXEC.
050090120827
050100120827           EXEC SQL
050110120827             INSERT INTO QTEMP/EAPPSETBL1
050120120827              SELECT
050130120827                TRNQAP.Account_No,
050140120827                TRNQAP.Beneficiary_Seq_No,
050150120827                TRNQAP.Year,
050160120827                TRNQAP.QC_Resident_Ind,
050170120827                TRANS.Trade_Date,
050180120827      * 84977.13 Begin
050190120827                CASE
050200120827                 WHEN CNTRRP.Contr_Redem_Code_Rule IN ("28", "30")
050210120827                      THEN 1
050220120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "12"
050230120827                      THEN 2
050240120827                 ELSE 0
050250120827                END,
050260120827      * 84977.13 End
050270120827                CNTRRP.Contr_Redem_Code_Rule,
050280120827                ACCTYP.Account_Type_Rule,
050290120827                CASE
050300120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "12" AND
050310120827                      ACCTYP.Account_Type_Rule = "4"  THEN
050320120827                        DEC(ROUND(SUM(TRANS.Gross_Amt *
050330120827                        (ACCBPP.Beneficiary_Percent / 100.00)),
050340120827                          2), 9, 2)
050350120827                 ELSE 0
050360120827                END,
050370120827                CASE
050380120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "28" AND
050390120827                      ACCTYP.Account_Type_Rule = "4"  THEN
050400120827                        DEC(ROUND(SUM(TRANS.Gross_Amt *
050410120827                        (ACCBPP.Beneficiary_Percent / 100.00)),
050420120827                          2), 9, 2)
050430120827      * RFS84977 - Added contribution redemption rule of 30 - Start
050440120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "30" AND
050450120827                      ACCTYP.Account_Type_Rule = "4"  THEN
050460120827                         DEC(ROUND(SUM(COALESCE(TRNEAP.EAP_IQEE, 0)),
050470120827                         2),9, 2)
050480120827      * RFS84977 - Ends
050490120827                 ELSE 0
050500120827                END,
050510120827      * RFS78268 - Start
050520120827                MAX("N"),
050530120827                 MAX
050540120827                 (CASE
050550120827                   WHEN TRNQAP.Mrq_Approval_Status
050560120827                        IN (:lncc_O, :lncc_M, :lncc_C)
050570120827                        THEN :lncc_Y
050580120827                   ELSE :lncc_N
050590120827                   END),
050600120827                MAX
050610120827                (CASE
050620120827                  WHEN TRNQAP.Mrq_Approval_Status
050630141002      * RFS132831 - Begins - needs to carry Refile status
050640141002      *                IN (:lncc_O, :lncc_M, :lncc_C)
050650141002                       IN (:lncc_O, :lncc_M, :lncc_C, :Lncc_R)
050660141002      * RFS132831 -Ends
050670120827                       THEN TRNQAP.Mrq_Approval_Status
050680120827                   ELSE " "
050690120827                  END),
050700141002      * RFS132831 - Undo 110763 - begins
050710141002                MAX(TRNQAP.MRQ_File_Date)
050720120827      * RFS110763 - begin
050730120827      *         MAX(TRNQAP.MRQ_File_Date)
050740141002      *         MAX
050750141002      *         (CASE
050760141002      *           WHEN TRNQAP.Mrq_Approval_Status = :lncc_Refiling
050770141002      *           THEN  0
050780141002      *           ELSE
050790141002      *           TRNQAP.MRQ_File_Date
050800141002      *           END)
050810120827      * RFS110763 - end
050820141002      * RFS132831 - Undo 110763 - ends
050830120827      * RFS78268 - End
050840120827
050850120827      * TRANS-RESP-MRQ-APPROVAL
050860120827             FROM MFATRNQAP  TRNQAP
050870120827      * Exclude accounts with account attribute code NMRQ
050880120827             EXCEPTION JOIN MFAACCATP ACCATP ON
050890120827                  ACCATP.Account_No = TRNQAP.Account_No
050900120827                  AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
050910120827      * ACCOUNT
050920120827             JOIN MFAACCNTP ACCNTP ON
050930120827                  TRNQAP.Account_No = ACCNTP.Account_No
050940120827      * ACCOUNT-TYPE
050950120827             JOIN MFAACCTYP ACCTYP ON
050960120827                  ACCNTP.Account_Type_Code = ACCTYP.Account_Type_Code
050970120827      * TRANS
050980120827             JOIN MFATRNP TRANS ON
050990120827                  TRNQAP.Account_No = TRANS.Account_No
051000120827                  AND TRNQAP.Placement_Date = TRANS.Placement_Date
051010120827                  AND TRNQAP.Trans_No = TRANS.Trans_No
051020120827      * CONTR-REDEM-CODE-RULES
051030120827             JOIN MFACNTRRP CNTRRP ON
051040120827                  ACCNTP.Account_Type_Code = CNTRRP.Account_Type_Code
051050120827                  AND TRANS.Contr_Redem_Code = CNTRRP.Contr_Redem_Code
051060120827      * TRANS-RESP-DETAILS
051070120827             JOIN MFATRNRFP TRNRFP ON
051080120827                  TRANS.Account_No = TRNRFP.Account_No
051090120827                  AND TRANS.Placement_Date = TRNRFP.Placement_Date
051100120827                  AND TRANS.Trans_No = TRNRFP.Trans_No
051110120827      * ACCOUNT-BENEFICIARY-SPLIT
051120120827             JOIN MFAACCBPP ACCBPP ON
051130120827                  TRNRFP.Account_No = ACCBPP.Account_No
051140120827                  AND TRNRFP.Beneficiary_Split_Code =
051150120827                       ACCBPP.Beneficiary_Split_Code
051160120827                  AND TRNRFP.HRDC_File_Date = ACCBPP.HRDC_File_Date
051170120827                  AND TRNQAP.Beneficiary_Seq_No =
051180120827                      ACCBPP.Beneficiary_Seq_No
051190120827      * RFS84977 - Starts
051200120827             LEFT OUTER JOIN MFATRNEAP TRNEAP ON
051210120827                  TRNEAP.PLACEMENT_DATE =
051220120827                  TRNQAP.PLACEMENT_DATE AND
051230120827                  TRNEAP.TRANS_NO = TRNQAP.TRANS_NO AND
051240120827                  TRNEAP.BENEFICIARY_SEQ_NO =
051250120827                  TRNQAP.BENEFICIARY_SEQ_NO
051260120827      * RFS84977 - Ends
051270120827             WHERE
051280120827      * note: MFATRNQAP contains only transactions that have
051290120827      * account type rule 4 and contr redem code rule 12 or 28.
051300120827      * Trxns with C/R Rule 28 are also associated with trxns
051310120827      * with C/R rule 7,6,17 and 18. Gross Amounts on Transactions
051320120827      * associated with C/R rules 28, 7, 6, 17 and 18 for field EAP
051330120827      * Amount Paid (GRSAMT3) are totalled in table EAPPSETBL2
05134012082784977 *          CNTRRP.Contr_Redem_Code_Rule IN ("12" , "28")
051350120827      * RFS78268 - Start
05136012082784977 *          CNTRRP.Contr_Redem_Code_Rule IN ("12" , "28", "30")
051370120827                 CNTRRP.Contr_Redem_Code_Rule IN ("28", "30")
051380120827      * RFS78268 - End
051390120827                 AND ACCTYP.Account_Type_Rule = "4"
051400120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
051410180925004139*          AND TRANS.Reverse <> "Y"
051420180925004139           AND (TRANS.Reverse <> "Y" OR
051430180925004139                (TRANS.Reverse = "Y" AND
051440180925004139                 TRNQAP.Mrq_Approval_Status = "C"))
051450120827
051460120827      * RFS105558 - Start
051470120827      *          AND (TRNQAP.Mrq_Approval_Status
051480120827      * RFS78268 - Start
051490120827      *              IN (:lncc_Refiling, :lncc_Unfiled)
051500120827      *              IN (:lncc_Refiling, :lncc_Unfiled, :lncc_O,
051510120827      *                  :lncc_M, :lncc_C)
051520120827      * RFS78268 - End
051530120827      *              AND SUBSTR(DEC(TRANS.Trade_Date),1,4)
051540120827      *              BETWEEN :li_Year1 AND :li_Year2)
051550120927      * RFS107668 - Start
051560120927                 AND
051570120927           ((:lc_ReportMode = :lncc_Y  AND
051580120927            ((SUBSTR(DEC(TRANS.Trade_Date),1,4)
051590121003              BETWEEN :li_ProcessFilingYear AND :li_Year2)
051600120927              AND
051610120927              TRNQAP.MRQ_FILE_DATE > :lnci_0)) OR
051620120927           (:lc_ReportMode <> :lncc_Y
051630120927      * RFS107668 - End
051640120827           AND  ((TRNQAP.Mrq_Approval_Status
051650120827                         IN (:lncc_Refiling, :lncc_Unfiled)
051660120827                  AND SUBSTR(DEC(TRANS.Trade_Date),1,4)
051670120827      * RFS 109131 - Start
051680120827      *                  BETWEEN :li_Year1 AND :li_Year2)
051690120827                         <=  :li_Year2)
051700120827      * RFS 109131 - End
051710120827                  OR (TRNQAP.Mrq_Approval_Status
051720120927      * RFS107668 - Start
051730120927      *                  IN (:lncc_O, :lncc_M, :lncc_C)))
051740120927                         IN (:lncc_O, :lncc_M, :lncc_C)))))
051750120827      * RFS105558 - End
051760120927      * RFS107668 - End
051770120827
051780120827             GROUP BY
051790120827                TRNQAP.Account_No,
051800120827                TRNQAP.Beneficiary_Seq_No,
051810120827                TRNQAP.Year,
051820120827                TRNQAP.QC_Resident_Ind,
051830120827                TRANS.Trade_Date,
051840120827                CNTRRP.Contr_Redem_Code_Rule,
051850120827                ACCTYP.Account_Type_Rule
051860120827             ORDER BY
051870120827                TRNQAP.Account_No,
051880120827                TRNQAP.Beneficiary_Seq_No,
051890120827                TRNQAP.Year,
051900120827                TRNQAP.QC_Resident_Ind,
051910120827                TRANS.Trade_Date,
051920120827                CNTRRP.Contr_Redem_Code_Rule,
051930120827                ACCTYP.Account_Type_Rule
051940120827           END-EXEC.
051950120827
051960120827      * RFS78268 - Start
051970120827      * ==============New insertion for RVSL ==============
051980120827           EXEC SQL
051990120827             INSERT INTO QTEMP/EAPPSETBL1
052000120827              SELECT
052010120827                TRNQAP.Account_No,
052020120827                TRNQAP.Beneficiary_Seq_No,
052030120827                TRNQAP.Year,
052040120827      * RFS112219 - STARTE
052050120827      *         TRNQAP.QC_Resident_Ind,
052060120827                CHAR(" ",1),
052070120827      * RFS112219 - END
052080120827                TRANS.Trade_Date,
052090120827                CASE
052100120827                 WHEN CNTRRP.Contr_Redem_Code_Rule IN ("28", "30")
052110120827                      THEN 1
052120120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "12"
052130120827                      THEN 2
052140120827                 ELSE 0
052150120827                END,
052160120827                CNTRRP.Contr_Redem_Code_Rule,
052170120827                ACCTYP.Account_Type_Rule,
052180120827                0,
052190120827                0,
052200120827                MAX("Y"),
052210120827                MAX("Y"),
052220120827                MAX
052230120827                (CASE
052240120827                  WHEN TRNQAP.Mrq_Approval_Status
052250120827                      IN (:lncc_O, :lncc_M, :lncc_C)
052260120827                      THEN TRNQAP.Mrq_Approval_Status
052270120827                 ELSE " "
052280120827                 END),
052290120827                MAX(TRNQAP.MRQ_File_Date)
052300120827
052310120827      * TRANS-RESP-MRQ-APPROVAL
052320120827             FROM MFATRNQAP  TRNQAP
052330120827      * Exclude accounts with account attribute code NMRQ
052340120827             EXCEPTION JOIN MFAACCATP ACCATP ON
052350120827                  ACCATP.Account_No = TRNQAP.Account_No
052360120827                  AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
052370120827      * MFATRNTGP
052380120827             JOIN MFATRNTGP TGP ON
052390120827                  TRNQAP.Placement_Date = TGP.Placement_Date
052400120827                  AND TRNQAP.Trans_No   = TGP.Trans_No
052410120827                  AND TGP.Relationship_Type = :lncc_RVS
052420120827      * MFATRNQAP
052430120827             LEFT OUTER JOIN MFATRNQAP  QAP2  ON
052440120827                  TGP.Placement_Date_2 = QAP2.Placement_Date
052450120827                  AND TGP.Trans_No_2   = QAP2.Trans_No
052460120827                  AND TRNQAP.Beneficiary_Seq_No =
052470120827                  QAP2.Beneficiary_Seq_No
052480120827      * ACCOUNT
052490120827             JOIN MFAACCNTP ACCNTP ON
052500120827                  TRNQAP.Account_No = ACCNTP.Account_No
052510120827      * ACCOUNT-TYPE
052520120827             JOIN MFAACCTYP ACCTYP ON
052530120827                  ACCNTP.Account_Type_Code = ACCTYP.Account_Type_Code
052540120827      * TRANS
052550120827             JOIN MFATRNP TRANS ON
052560120827                  TRNQAP.Account_No = TRANS.Account_No
052570120827                  AND TRNQAP.Placement_Date = TRANS.Placement_Date
052580120827                  AND TRNQAP.Trans_No = TRANS.Trans_No
052590120827      * CONTR-REDEM-CODE-RULES
052600120827             JOIN MFACNTRRP CNTRRP ON
052610120827                  ACCNTP.Account_Type_Code = CNTRRP.Account_Type_Code
052620120827                  AND TRANS.Contr_Redem_Code = CNTRRP.Contr_Redem_Code
052630120827      * TRANS-RESP-DETAILS
052640120827             JOIN MFATRNRFP TRNRFP ON
052650120827                  TRANS.Account_No = TRNRFP.Account_No
052660120827                  AND TRANS.Placement_Date = TRNRFP.Placement_Date
052670120827                  AND TRANS.Trans_No = TRNRFP.Trans_No
052680120827      * ACCOUNT-BENEFICIARY-SPLIT
052690120827             JOIN MFAACCBPP ACCBPP ON
052700120827                  TRNRFP.Account_No = ACCBPP.Account_No
052710120827                  AND TRNRFP.Beneficiary_Split_Code =
052720120827                       ACCBPP.Beneficiary_Split_Code
052730120827                  AND TRNRFP.HRDC_File_Date = ACCBPP.HRDC_File_Date
052740120827                  AND TRNQAP.Beneficiary_Seq_No =
052750120827                      ACCBPP.Beneficiary_Seq_No
052760120827             LEFT OUTER JOIN MFATRNEAP TRNEAP ON
052770120827                  TRNEAP.PLACEMENT_DATE =
052780120827                  TRNQAP.PLACEMENT_DATE AND
052790120827                  TRNEAP.TRANS_NO = TRNQAP.TRANS_NO AND
052800120827                  TRNEAP.BENEFICIARY_SEQ_NO =
052810120827                  TRNQAP.BENEFICIARY_SEQ_NO
052820120827             WHERE
052830120827      * note: MFATRNQAP contains only transactions that have
052840120827      * account type rule 4 and contr redem code rule 12 or 28.
052850120827      * Trxns with C/R Rule 28 are also associated with trxns
052860120827      * with C/R rule 7,6,17 and 18. Gross Amounts on Transactions
052870120827      * associated with C/R rules 28, 7, 6, 17 and 18 for field EAP
052880120827      * Amount Paid (GRSAMT3) are totalled in table EAPPSETBL2
052890120827                 CNTRRP.Contr_Redem_Code_Rule IN ("28", "30")
052900120827                 AND ACCTYP.Account_Type_Rule = "4"
052910120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
052920120827                 AND TRANS.Reverse = "Y"
052930120827
052940120827      * RFS105558 - start
052950120827      *RFS104390 Starts
052960120827      *          AND (TRNQAP.Mrq_Approval_Status = "P"
052970120827      *               NOT IN(:Lncc_U, :Lncc_S)
052980120827      *RFS104390 Ends
052990120827      *              AND SUBSTR(DEC(TRANS.Trade_Date),1,4)
053000120827      *              BETWEEN :li_Year1 AND :li_Year2)
053010120827                AND TRNQAP.Mrq_Approval_Status NOT IN ("E", "S",:lncc_U)
053020120827      * RFS105558 - end
053030120827
053040120827                 AND QAP2.Placement_Date is null
053050120827                 AND TRNQAP.MRQ_File_Date <> 0
053060120827             GROUP BY
053070120827                TRNQAP.Account_No,
053080120827                TRNQAP.Beneficiary_Seq_No,
053090120827                TRNQAP.Year,
053100120827                TRNQAP.QC_Resident_Ind,
053110120827                TRANS.Trade_Date,
053120120827                CNTRRP.Contr_Redem_Code_Rule,
053130120827                ACCTYP.Account_Type_Rule
053140120827             ORDER BY
053150120827                TRNQAP.Account_No,
053160120827                TRNQAP.Beneficiary_Seq_No,
053170120827                TRNQAP.Year,
053180120827                TRNQAP.QC_Resident_Ind,
053190120827                TRANS.Trade_Date,
053200120827                CNTRRP.Contr_Redem_Code_Rule,
053210120827                ACCTYP.Account_Type_Rule
053220120827           END-EXEC.
053230120827
053240120827      *  ==========creating new table EAPPSESUM
053250120827
053260120827           EXEC SQL
053270120827             CREATE TABLE QTEMP/EAPPSESUM
053280120827              (ACCTNO     NUMERIC ( 9) NOT NULL WITH DEFAULT,
053290120827               BENSEQNO   NUMERIC ( 3) NOT NULL WITH DEFAULT,
053300120827      * RFS78268.30 Remove year not needed   Start
053310120827      *        YEAR       NUMERIC ( 4) NOT NULL WITH DEFAULT,
053320120827      * RFS78268.30 Remove year not needed   End
053330120827112219*        QCRSDIND   CHAR    ( 1) NOT NULL WITH DEFAULT,
053340120827               TRDDATE    DECIMAL ( 9) NOT NULL WITH DEFAULT,
053350120827               PAYTYPE    NUMERIC ( 2) NOT NULL WITH DEFAULT
053360120827               )
053370120827           END-EXEC.
053380120827
053390120827           EXEC SQL
053400120827             INSERT INTO QTEMP/EAPPSESUM
053410120827      * RFS112219 - START
053420120827      *       (SELECT ACCTNO,BENSEQNO,QCRSDIND,TRDDATE,PAYTYPE
053430120827              (SELECT ACCTNO,BENSEQNO,TRDDATE,PAYTYPE
053440120827      * RFS112219 - END
053450120827      *RFS78268.30 field Year was removed Start
053460120827      *       (SELECT ACCTNO,BENSEQNO,YEAR,QCRSDIND,TRDDATE,PAYTYPE
053470120827             FROM   EAPPSETBL1
053480120827             GROUP BY
053490120827      * RFS112219 - START
053500120827      *             ACCTNO,BENSEQNO,QCRSDIND,TRDDATE,PAYTYPE)
053510120827                    ACCTNO,BENSEQNO,TRDDATE,PAYTYPE)
053520120827      * RFS112219 - END
053530120827      *             ACCTNO,BENSEQNO,YEAR,QCRSDIND,TRDDATE,PAYTYPE)
053540120827      *RFS78268.30 field Year was removed End
053550120827           END-EXEC.
053560120827
053570120827      *  ==============new record insertion to EAPPSETBL1 =============
053580120827
053590120827           EXEC SQL
053600120827             INSERT INTO QTEMP/EAPPSETBL1
053610120827              SELECT
053620120827                TRNQAP.Account_No,
053630120827                TRNQAP.Beneficiary_Seq_No,
053640120827      *RFS78268.30 Add MAX function start
053650120827                MAX(TRNQAP.Year),
053660120827      *RFS78268.30 Add MAX function  end
053670120827                TRNQAP.QC_Resident_Ind,
053680120827                TRANS.Trade_Date,
053690120827      *RFS78268.30 Start
053700120827      *RFS78268.30 Add MAX function
053710120827                MAX(
053720120827                CASE
053730120827                 WHEN CNTRRP.Contr_Redem_Code_Rule IN ("28", "30")
053740120827                      THEN 1
053750120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "12"
053760120827                      THEN 2
053770120827                 ELSE 0
053780120827                END),
053790120827                CNTRRP.Contr_Redem_Code_Rule,
053800120827                ACCTYP.Account_Type_Rule,
053810120827      *         MAX(
053820120827      *         CASE
053830120827      *          WHEN CNTRRP.Contr_Redem_Code_Rule = "12" AND
053840120827      *               ACCTYP.Account_Type_Rule = "4"  THEN
053850120827      *                 DEC(ROUND(SUM(TRANS.Gross_Amt *
053860120827      *                 (ACCBPP.Beneficiary_Percent / 100.00)),
053870120827      *                   2), 9, 2)
053880120827      *          ELSE 0
053890120827      *         END),
053900120827      *RFS78268.30 Add Sum function
053910120827                SUM(
053920120827                CASE
053930120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "12" AND
053940120827                      ACCTYP.Account_Type_Rule = "4"  THEN
053950120827                        DEC(ROUND(TRANS.Gross_Amt *
053960120827                        (ACCBPP.Beneficiary_Percent / 100.00),
053970120827                          2), 9, 2)
053980120827                 ELSE 0
053990120827                END),
054000120827      *         MAX(
054010120827      *         CASE
054020120827      *          WHEN CNTRRP.Contr_Redem_Code_Rule = "28" AND
054030120827      *               ACCTYP.Account_Type_Rule = "4"  THEN
054040120827      *                 DEC(ROUND(SUM(TRANS.Gross_Amt *
054050120827      *                 (ACCBPP.Beneficiary_Percent / 100.00)),
054060120827      *                   2), 9, 2)
054070120827      *          WHEN CNTRRP.Contr_Redem_Code_Rule = "30" AND
054080120827      *               ACCTYP.Account_Type_Rule = "4"  THEN
054090120827      *                  DEC(ROUND(SUM(COALESCE(TRNEAP.EAP_IQEE, 0)),
054100120827      *                  2),9, 2)
054110120827      *          ELSE 0
054120120827      *         END),
054130120827      *RFS78268.30 Add Sum function
054140120827                SUM(
054150120827                CASE
054160120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "28" AND
054170120827                      ACCTYP.Account_Type_Rule = "4"  THEN
054180120827                        DEC(ROUND(TRANS.Gross_Amt *
054190120827                        (ACCBPP.Beneficiary_Percent / 100.00),
054200120827                          2), 9, 2)
054210120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "30" AND
054220120827                      ACCTYP.Account_Type_Rule = "4"  THEN
054230120827                         DEC(ROUND(COALESCE(TRNEAP.EAP_IQEE, 0),
054240120827                         2),9, 2)
054250120827                 ELSE 0
054260120827                END),
054270120827                MAX("N"),
054280120827                MAX("Y"),
054290120827      *RFS78268.30 Set literal since these status were
054300120827      *  exluded in prior steps
054310120827                MAX
054320120827      *         (CASE
054330120827      *           WHEN TRNQAP.Mrq_Approval_Status
054340120827      *                IN (:lncc_O, :lncc_M, :lncc_C)
054350120827      *                THEN TRNQAP.Mrq_Approval_Status
054360120827      *           ELSE " "
054370120827      *           END),
054380120827               (:lncc_M),
054390120827      *RFS78268.30 End
054400141002      *RFS132831 - Begins - undo 110763
054410141002                MAX(TRNQAP.MRQ_File_Date)
054420120827      *RFS110763 begin
054430120827      *         MAX(TRNQAP.MRQ_File_Date)
054440141002      *         MAX
054450141002      *          (CASE
054460141002      *           WHEN TRNQAP.Mrq_Approval_Status = :Lncc_E
054470141002      *           THEN 0
054480141002      *           ELSE
054490141002      *           TRNQAP.MRQ_File_Date
054500141002      *           END
054510141002      *          )
054520120827      *RFS110763 end
054530141002      *RFS132831 - Begins - undo 110763
054540120827
054550120827      * TRANS-RESP-MRQ-APPROVAL
054560120827             FROM MFATRNQAP  TRNQAP
054570120827      * Exclude accounts with account attribute code NMRQ
054580120827             EXCEPTION JOIN MFAACCATP ACCATP ON
054590120827                  ACCATP.Account_No = TRNQAP.Account_No
054600120827                  AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
054610120827      * ACCOUNT
054620120827             JOIN MFAACCNTP ACCNTP ON
054630120827                  TRNQAP.Account_No = ACCNTP.Account_No
054640120827      * ACCOUNT-TYPE
054650120827             JOIN MFAACCTYP ACCTYP ON
054660120827                  ACCNTP.Account_Type_Code = ACCTYP.Account_Type_Code
054670120827      * TRANS
054680120827             JOIN MFATRNP TRANS ON
054690120827                  TRNQAP.Account_No = TRANS.Account_No
054700120827                  AND TRNQAP.Placement_Date = TRANS.Placement_Date
054710120827                  AND TRNQAP.Trans_No = TRANS.Trans_No
054720120827      * EAPPSESUM
054730120827             JOIN EAPPSESUM SUM ON
054740120827                  TRNQAP.Account_No = SUM.ACCTNO
054750120827                  AND TRNQAP.Beneficiary_Seq_No = SUM.BENSEQNO
054760120827      *RFS78268.30 Year was removed from EAPPSESUM
054770120827      *           AND TRNQAP.Year               = SUM.YEAR
054780120827112219*           AND TRNQAP.QC_Resident_Ind    = SUM.QCRSDIND
054790120827                  AND TRANS.Trade_Date          = SUM.TRDDATE
054800120827      * CONTR-REDEM-CODE-RULES
054810120827             JOIN MFACNTRRP CNTRRP ON
054820120827                  ACCNTP.Account_Type_Code = CNTRRP.Account_Type_Code
054830120827                  AND TRANS.Contr_Redem_Code = CNTRRP.Contr_Redem_Code
054840120827      * TRANS-RESP-DETAILS
054850120827             JOIN MFATRNRFP TRNRFP ON
054860120827                  TRANS.Account_No = TRNRFP.Account_No
054870120827                  AND TRANS.Placement_Date = TRNRFP.Placement_Date
054880120827                  AND TRANS.Trans_No = TRNRFP.Trans_No
054890120827      * ACCOUNT-BENEFICIARY-SPLIT
054900120827             JOIN MFAACCBPP ACCBPP ON
054910120827                  TRNRFP.Account_No = ACCBPP.Account_No
054920120827                  AND TRNRFP.Beneficiary_Split_Code =
054930120827                       ACCBPP.Beneficiary_Split_Code
054940120827                  AND TRNRFP.HRDC_File_Date = ACCBPP.HRDC_File_Date
054950120827                  AND TRNQAP.Beneficiary_Seq_No =
054960120827                      ACCBPP.Beneficiary_Seq_No
054970120827             LEFT OUTER JOIN MFATRNEAP TRNEAP ON
054980120827                  TRNEAP.PLACEMENT_DATE =
054990120827                  TRNQAP.PLACEMENT_DATE AND
055000120827                  TRNEAP.TRANS_NO = TRNQAP.TRANS_NO AND
055010120827                  TRNEAP.BENEFICIARY_SEQ_NO =
055020120827                  TRNQAP.BENEFICIARY_SEQ_NO
055030120827             WHERE
055040120827      * note: MFATRNQAP contains only transactions that have
055050120827      * account type rule 4 and contr redem code rule 12 or 28.
055060120827      * Trxns with C/R Rule 28 are also associated with trxns
055070120827      * with C/R rule 7,6,17 and 18. Gross Amounts on Transactions
055080120827      * associated with C/R rules 28, 7, 6, 17 and 18 for field EAP
055090120827      * Amount Paid (GRSAMT3) are totalled in table EAPPSETBL2
055100120827                 CNTRRP.Contr_Redem_Code_Rule IN ("28", "30")
055110120827                 AND ACCTYP.Account_Type_Rule = "4"
055120120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
055130180925004139*          AND TRANS.Reverse <> "Y"
055140180925004139           AND (TRANS.Reverse <> "Y" OR
055150180925004139                (TRANS.Reverse = "Y" AND
055160180925004139                 TRNQAP.Mrq_Approval_Status = "C"))
055170120827
055180120827      * RFS105558 - Start
055190120827      *          AND (TRNQAP.Mrq_Approval_Status
055200120827      *              NOT IN (:lncc_Refiling, :lncc_Unfiled, :lncc_O,
055210120827      *                  :lncc_M, :lncc_C)
055220120827      *              AND SUBSTR(DEC(TRANS.Trade_Date),1,4)
055230120827      *              BETWEEN :li_Year1 AND :li_Year2)
055240120827                 AND (TRNQAP.Mrq_Approval_Status
055250120827                 NOT IN (:lncc_Refiling, :lncc_Unfiled, :lncc_O,
055260120827                         :lncc_M, :lncc_C))
055270120827      * RFS105558 - End
055280120827
055290120827             GROUP BY
055300120827                TRNQAP.Account_No,
055310120827                TRNQAP.Beneficiary_Seq_No,
055320120827      *RFS78268.30
055330120827      *         TRNQAP.Year,
055340120827                TRNQAP.QC_Resident_Ind,
055350120827                TRANS.Trade_Date,
055360120827                CNTRRP.Contr_Redem_Code_Rule,
055370120827                ACCTYP.Account_Type_Rule
055380120827             ORDER BY
055390120827                TRNQAP.Account_No,
055400120827                TRNQAP.Beneficiary_Seq_No,
055410120827      *RFS78268.30 Start
055420120827      *         TRNQAP.Year,
055430120827      *RFS78268.30 End
055440120827                TRNQAP.QC_Resident_Ind,
055450120827                TRANS.Trade_Date,
055460120827                CNTRRP.Contr_Redem_Code_Rule,
055470120827                ACCTYP.Account_Type_Rule
055480120827           END-EXEC.
055490120827      * RFS78268 - End
055500120827
055510120827           EXEC SQL
055520120827             CREATE TABLE QTEMP/EAPPSETBL2
055530120827              (ACCTNO     NUMERIC ( 9) NOT NULL WITH DEFAULT,
05554012082790545 *        BENSEQNO   NUMERIC ( 2) NOT NULL WITH DEFAULT,
05555012082790545          BENSEQNO   NUMERIC ( 3) NOT NULL WITH DEFAULT,
055560120827               YEAR       NUMERIC ( 4) NOT NULL WITH DEFAULT,
055570120827               QCRSDIND   CHAR    ( 1) NOT NULL WITH DEFAULT,
055580120827               TRDDATE    DECIMAL ( 9) NOT NULL WITH DEFAULT,
055590120827      * 84977.13 Begin
055600120827               PAYTYPE    NUMERIC ( 2) NOT NULL WITH DEFAULT,
055610120827      * 84977.13 End
055620120827               CRCRULE    CHAR    ( 2) NOT NULL WITH DEFAULT,
055630120827               GRSAMT1    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
055640120827               GRSAMT2    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
055650120827      * RFS 78268 - Start
055660120827      *        GRSAMT3    DECIMAL (9, 2) NOT NULL WITH DEFAULT
055670120827               GRSAMT3    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
055680120827               RVSL       CHAR    ( 1) NOT NULL WITH DEFAULT,
055690120827               CANCEL     CHAR    ( 1) NOT NULL WITH DEFAULT,
055700120827               MRQAPRSTAT CHAR    ( 1) NOT NULL WITH DEFAULT,
055710120827               MRQFILEDT  NUMERIC ( 8) NOT NULL WITH DEFAULT
055720120827      * RFS 78268 - End
055730120827              )
055740120827           END-EXEC.
055750120827
055760120827      *    RFS103461 - Comment:
055770120827      *                The purpose of EAPPSETBL2 is to get
055780120827      *                the total EAP value after all QESI values have
055790120827      *                been determined (EAPPSETBL1)
055800120827           EXEC SQL
055810120827             INSERT INTO QTEMP/EAPPSETBL2
055820120827              SELECT
055830120827                TBL1.ACCTNO,
055840120827                TBL1.BENSEQNO,
055850120827                MAX(TBL1.YEAR),
055860120827      * RFS112219 - START
055870120827      *         TBL1.QCRSDIND,
055880120827                MAX(TBL1.QCRSDIND),
055890120827      * RFS112219 - END
055900120827                TBL1.TRDDATE,
055910120827      * 84977.13 Begin
055920120827                TBL1.PAYTYPE,
055930120827      * 84977.13 End
055940120827                TBL1.CRCRULE,
055950120827                TBL1.GRSAMT1,
055960120827                TBL1.GRSAMT2,
055970120827      *         RFS103461 - Begins - Qualify the use of Gross
055980120827      *                              based on the reversal flag
055990120827      *         DEC(ROUND(SUM(COALESCE(TRANS.Gross_Amt,0) *
056000120827                DEC(ROUND(SUM(
056010120827                              CASE WHEN TRANS.Reverse <> "Y"
056020120827                                   THEN TRANS.Gross_Amt
056030120827                                   ELSE 0 END             *
056040120827      *         RFS103461 - Ends
056050120827      * RFS78268 - Start
056060120827      *         (ACCBPP.Beneficiary_Percent / 100.00)) ,2), 9, 2)
056070120827                (ACCBPP.Beneficiary_Percent / 100.00)) ,2), 9, 2),
056080120827                MAX(TBL1.RVSL),
056090120827                MAX(TBL1.CANCEL),
056100120827                MAX(TBL1.MRQAPRSTAT),
056110120827                MAX(TBL1.MRQFILEDT)
056120120827      * RFS78268 - End
056130120827
056140120827      * EAP PSE Table 1
056150120827             FROM EAPPSETBL1 TBL1
056160120827      * TRANS
056170120827             LEFT OUTER JOIN MFATRNP TRANS ON
056180120827                  TBL1.ACCTNO = TRANS.Account_No
056190120827                  AND TBL1.TRDDATE = TRANS.Trade_Date
056200120827      * ACCOUNT
056210120827             JOIN MFAACCNTP ACCNTP ON
056220120827                  TRANS.Account_no = ACCNTP.Account_No
056230120827      * ACCOUNT-TYPE
056240120827             JOIN MFAACCTYP ACCTYP ON
056250120827                  ACCNTP.Account_Type_Code = ACCTYP.Account_Type_Code
056260120827      * CONTR-REDEM-CODE-RULES
056270120827             JOIN MFACNTRRP CNTRRP ON
056280120827                 ACCNTP.Account_Type_Code = CNTRRP.Account_Type_Code
056290120827             AND TRANS.Contr_Redem_Code = CNTRRP.Contr_Redem_Code
056300120827      * TRANS-RESP-DETAILS
056310120827             JOIN MFATRNRFP TRNRFP ON
056320120827                 TRANS.Account_No = TRNRFP.Account_No
056330120827             AND TRANS.Placement_Date = TRNRFP.Placement_Date
056340120827             AND TRANS.Trans_No = TRNRFP.Trans_No
056350120827      * ACCOUNT-BENEFICIARY-SPLIT
056360120827             JOIN MFAACCBPP ACCBPP ON
056370120827                 TRNRFP.Account_No = ACCBPP.Account_No
056380120827             AND TRNRFP.Beneficiary_Split_Code =
056390120827                     ACCBPP.Beneficiary_Split_Code
056400120827             AND TRNRFP.HRDC_File_Date = ACCBPP.HRDC_File_Date
056410120827             AND TBL1.BENSEQNO =
056420120827                    ACCBPP.Beneficiary_Seq_No
056430120827             WHERE
056440120827      * note: MFATRNQAP contains transactions that have
056450120827      * account type rule 4 and contr redem code rule 12 or 28
056460120827      * Trxns with C/R Rule 28 are also associated with trxns with
056470120827      * C/R rule 7,6,17 and 18. Gross Amounts on Transactions
056480120827      * associated with C/R rules 28, 7, 6, 17 and 18 for field EAP
056490120827      * Amount Paid (GRSAMT3) are totalled in table EAPPSETBL2
05650012082784977 *          TBL1.CRCRULE = "28"
05651012082784977            TBL1.CRCRULE IN ("28", "30")
056520120827                 AND CNTRRP.Contr_Redem_Code_Rule
05653012082784977 *               IN ("28" , "7" , "6" , "17", "18")
05654012082784977                 IN ("28" , "7" , "6" , "17", "18", "30")
056550120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
056560120827      *          RFS103461 - Begins - Allow the reversed transactions
056570120827      *          AND TRANS.Reverse <> "Y"
056580120827      *          RFS103461 - Ends
056590120827             GROUP BY
056600120827                TBL1.ACCTNO,
056610120827                TBL1.BENSEQNO,
056620120827      * RFS103174 -  78268.30 Begin
056630120827      *         TBL1.YEAR,
056640120827      * RFS103174 -  78268.30 End
056650120827                TBL1.QCRSDIND,
056660120827                TBL1.TRDDATE,
056670120827      * 84977.13 Begin
056680120827                TBL1.PAYTYPE,
056690120827      * 84977.13 End
056700120827                TBL1.CRCRULE,
056710120827                TBL1.GRSAMT1,
056720120827                TBL1.GRSAMT2
056730120827             ORDER BY
056740120827                TBL1.ACCTNO,
056750120827                TBL1.BENSEQNO,
056760120827      *         TBL1.YEAR,
056770120827                TBL1.QCRSDIND,
056780120827                TBL1.TRDDATE,
056790120827      * 84977.13 Begin
056800120827                TBL1.PAYTYPE,
056810120827      * 84977.13 End
056820120827                TBL1.CRCRULE,
056830120827                TBL1.GRSAMT1,
056840120827                TBL1.GRSAMT2
056850120827           END-EXEC.
056860120827
056870120827      * RFS78268 - Start
056880120827      * comented out as rule#12 not valied henceforth
056890120827      *    EXEC SQL
056900120827      *      INSERT INTO QTEMP/EAPPSETBL2
056910120827      *       SELECT
056920120827      *         TBL1.ACCTNO,
056930120827      *         TBL1.BENSEQNO,
056940120827      *         TBL1.YEAR,
056950120827      *         TBL1.QCRSDIND,
056960120827      *         TBL1.TRDDATE,
056970120827      * 84977.13 Begin
056980120827      *         TBL1.PAYTYPE,
056990120827      * 84977.13 End
057000120827      *         TBL1.CRCRULE,
057010120827      *         TBL1.GRSAMT1,
057020120827      *         TBL1.GRSAMT2,
057030120827      *         0
057040120827
057050120827      * EAP PSE Table 1
057060120827      *      FROM EAPPSETBL1 TBL1
057070120827      *      WHERE TBL1.CRCRULE = "12"
057080120827      *    END-EXEC.
057090120827
057100120827      * RFS 78268 - End
057110120827
057120120827      * 84977.13 Begin - Create table to consolidate at payment type
057130120827      * RFS92917 - START
057140120827      *Moved the below commented code to Initial_Steps para
057150120827      *    EXEC SQL
057160120827      *      CREATE TABLE QTEMP/EAPPSETBL
057170120827      *       (ACCTNO     NUMERIC ( 9) NOT NULL WITH DEFAULT,
05718012082790545 *        BENSEQNO   NUMERIC ( 2) NOT NULL WITH DEFAULT,
05719012082790545 *        BENSEQNO   NUMERIC ( 3) NOT NULL WITH DEFAULT,
057200120827      *        YEAR       NUMERIC ( 4) NOT NULL WITH DEFAULT,
057210120827      *        QCRSDIND   CHAR    ( 1) NOT NULL WITH DEFAULT,
057220120827      *        TRDDATE    DECIMAL ( 9) NOT NULL WITH DEFAULT,
057230120827      *        PAYTYPE    NUMERIC ( 2) NOT NULL WITH DEFAULT,
057240120827      *        CRCRULE    CHAR    ( 2) NOT NULL WITH DEFAULT,
057250120827      *        GRSAMT1    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
057260120827      *        GRSAMT2    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
057270120827      * RFS 78268 - Start
057280120827      *        GRSAMT3    DECIMAL (9, 2) NOT NULL WITH DEFAULT
057290120827      *        GRSAMT3    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
057300120827      *        RVSL       CHAR    ( 1) NOT NULL WITH DEFAULT,
057310120827      *        CANCEL     CHAR    ( 1) NOT NULL WITH DEFAULT,
057320120827      *        MRQAPRSTAT CHAR    ( 1) NOT NULL WITH DEFAULT,
057330120827      *        MRQFILEDT  NUMERIC ( 8) NOT NULL WITH DEFAULT
057340120827      * RFS 78268 - End
057350120827      *       )
057360120827      *    END-EXEC.
057370120827      * RFS92917 - END
057380120827
057390120827           EXEC SQL
057400120827             INSERT INTO QTEMP/EAPPSETBL
057410120827              SELECT
057420120827                TBL2.ACCTNO,
057430120827                TBL2.BENSEQNO,
057440120827      * RFS103174 -  78268.30 Begin
057450120827                MAX(TBL2.YEAR),
057460120827      * RFS103174 -  78268.30 End
057470120827                TBL2.QCRSDIND,
057480120827                TBL2.TRDDATE,
057490120827                TBL2.PAYTYPE,
057500120827      *         TBL2.CRCRULE,
057510120827                TBL2.GRSAMT1,
057520120827                ROUND(SUM(TBL2.GRSAMT2),2),
057530120827                TBL2.GRSAMT3,
057540120827      * RFS 78268 - Start
057550120827                MAX(TBL2.RVSL),
057560120827                MAX(TBL2.CANCEL),
057570120827                MAX(TBL2.MRQAPRSTAT),
057580120827                MAX(TBL2.MRQFILEDT)
057590120827      * RFS 78268 - End
057600120827              FROM EAPPSETBL2 TBL2
057610120827
057620120827             GROUP BY
057630120827                TBL2.ACCTNO,
057640120827                TBL2.BENSEQNO,
057650120827      * RFS103174 -  78268.30 Begin
057660120827      *         TBL2.YEAR,
057670120827      * RFS103174 -  78268.30 End
057680120827                TBL2.QCRSDIND,
057690120827                TBL2.TRDDATE,
057700120827                TBL2.PAYTYPE,
057710120827                TBL2.GRSAMT1,
057720120827                TBL2.GRSAMT3
057730120827           END-EXEC.
057740120827      * 84977.13 End
057750120827
057760120827      *---------------------
057770120827       CreateEapPseCursor.
057780120827      *---------------------
057790120827           EXEC SQL
057800120827           DECLARE EapPse_Cursor CURSOR FOR
057810120827             SELECT DISTINCT
057820120827                :lnci_05,
057830120827                :lnci_0,
057840120827      * 84977.13 Begin
057850120827      *         CASE
05786012082784977 *          WHEN TBL2.CRCRULE = "28" THEN 1
05787012082784977 *          WHEN TBL2.CRCRULE IN ("28", "30") THEN 1
057880120827      *          WHEN TBL2.CRCRULE = "12" THEN 2
057890120827      *          ELSE 0
057900120827      *         END,
057910120827                TBL2.PAYTYPE,
057920120827      * 84977.13 End
057930120827                :lc_Header_PromoterID,
057940120827                TBL2.ACCTNO,
057950120827                Coalesce(RESPTP.Specimen_Plan_No,"0"),
057960120827                TBL2.TRDDATE,
057970120827                0,
057980120827      * ln_C5_Contr_Withdr_Amt, ln_C5_IQEE_Amt_Paid, ln_C5_EAP_Amt_Paid
057990120827                TBL2.GRSAMT1,
058000120827                TBL2.GRSAMT2,
058010120827                TBL2.GRSAMT3,
058020120827      * ln_C5_IQEE_Balance,ln_C5_Fair_Mkt_Amt, ln_C5_Tot_Contr_Paid,
058030120827      * ln_C5_OthrBen_CLB_Amt, ln_C5_Benef_CLB_Amt,
058040120827      * ln_C5_Othr_ProvPgm_Amt not required (RFS58589)
058050120827                0,
058060120827                0,
058070120827                0,
058080120827                0,
058090120827                0,
058100120827                0,
058110120827                0,
058120120827                ACCBNP.Social_Insurance_No,
058130120827                ACCBNP.Last_Name,
058140120827                ACCBNP.First_Name,
058150120827                ACCBNP.Date_Of_Birth,
058160120827                CASE
058170120827                 WHEN ACCBNP.Sex = "F" THEN 1
058180120827                 WHEN ACCBNP.Sex = "M" THEN 2
058190120827                 ELSE 0
058200120827                END,
058210120827                CASE
058220120827                 WHEN TBL2.QCRSDIND = "Y" THEN 1
058230120827                 ELSE 0
058240120827                END,
058250120827                ACBNEP.Pse_Program_Type,
058260120827                ACBNEP.Pse_Program_Length,
058270120827                ACBNEP.Pse_Program_Year,
058280120827                ACBNEP.Academic_Year_Start_Date,
058290120827      *RFS 73992 start
058300120827      *         SUBSTR(ACBNEP.Academic_Year_Length_Weeks, 2, 2),
05831012082772749 *         ACBNEP.Academic_Year_Length_Weeks,
058320120827                ZONED(ACBNEP.Academic_Year_Length_Weeks, 2),
058330120827      *RFS 73992 end
058340120827                ACBNEP.Educational_Inst_Postal_Code,
058350120827                :lncc_Spaces_Inst_Name,
058360160219145606          :lncc_Spaces_15,
058370120827      *RFS 78268 Start
058380120827                TBL2.BENSEQNO,
058390120827                RVSL,
058400120827                CANCEL,
058410120827      *         RFS103461 - Begins - Set the status for reversal only
058420120827      *         MRQAPRSTAT,
058430120927      * RFS107668 - Start
058440120927                CASE WHEN (:lc_ReportMode = :lncc_Y)
058450120927                     THEN "U"
058460120927                ELSE
058470120927      * RFS107668 - End
058480120827                CASE
058490120827                 WHEN  MRQAPRSTAT = " "
058500120827                  AND  MRQFILEDT  <> 0
058510120827                  AND  TBL2.GRSAMT2    =  0
058520120827                 THEN  :lncc_C
058530120827                 WHEN  MRQAPRSTAT = " "
058540120827                  AND  MRQFILEDT  <> 0
058550120827                  AND  TBL2.GRSAMT2    <> 0
058560120827                 THEN  :lncc_M
058570120827                 ELSE
058580120827                       MRQAPRSTAT
058590120927      * RFS107668 - Start
058600120927      *         END,
058610120927                END
058620120927                END,
058630120927      * RFS107668 - End
058640120827      *         RFS103461 - Ends
058650120827                MRQFILEDT,
058660120827      *RFS 78268 End
058670120827                :lncc_Spaces_C5
058680120827
058690120827      * EAP PSE Table 2
058700120827      * 84977.13 Begin - changed to consolidated table EAPPSETBL
058710120827      *      FROM EAPPSETBL2 TBL2
058720120827             FROM EAPPSETBL  TBL2
058730120827      * 84977.13 End
058740120827      * ACCOUNT
058750120827             JOIN MFAACCNTP ACCNTP ON
058760120827                 TBL2.ACCTNO = ACCNTP.Account_No
058770120827      * ACCOUNT-RESP
058780120827             JOIN MFAACCESP ACCESP ON
058790120827                 TBL2.ACCTNO = ACCESP.Account_No
058800120827      * RESP-TYPE-SPECIMEN-PLAN
058810120827             LEFT OUTER JOIN MFARESPTP RESPTP ON
058820120827                 ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code
058830120827             AND ACCESP.Resp_Type_Code = RESPTP.Resp_Type_Code
058840120827      * ACCOUNT-BENEFICIARY
058850120827             JOIN MFAACCBNP ACCBNP ON
058860120827                 TBL2.ACCTNO = ACCBNP.Account_No
058870120827             AND TBL2.BENSEQNO = ACCBNP.Beneficiary_Seq_No
058880120827      * ACCOUNT-BEN-EDUCATION-30
058890120827             JOIN MFAACBNEP ACBNEP ON
058900120827                 ACCBNP.Account_No = ACBNEP.Account_No
058910120827             AND ACCBNP.Beneficiary_Seq_No = ACBNEP.Beneficiary_Seq_No
058920120827
058930120827             WHERE
058940120827                   TBL2.ACCTNO = ACBNEP.Account_No
058950120827               AND TBL2.BENSEQNO = ACBNEP.Beneficiary_Seq_No
058960120827               AND ACBNEP.Academic_Year_Seq_No =
058970120827               (Select MAX(ACBNP2.Academic_Year_Seq_No)
058980120827                from MFAACBNEP ACBNP2
058990120827                WHERE ACBNP2.Account_No = TBL2.ACCTNO
059000120827                  AND ACBNP2.Beneficiary_Seq_No = TBL2.BENSEQNO
059010120827                  AND ACBNP2.Account_No = ACBNEP.Account_No
059020120827                  AND ACBNP2.Beneficiary_Seq_No =
059030120827                      ACBNEP.Beneficiary_Seq_No)
059040140609      *RFS136198 - Start
059050140616                  AND ((:lc_SpecModIQEE3 = :lncc_N AND MRQFILEDT = 0)
059060140616                  OR   (:lc_SpecModIQEE3 = :lncc_Y))
059070140609      *RFS136198 - End
059080120827
059090120827      * RFS92917 - START
059100120827           UNION ALL
059110120827           SELECT DISTINCT
059120120827                :lnci_05,
059130120827                :lnci_0,
059140120827                :lnci_1,
059150120827                :lc_Header_PromoterID,
059160120827                EXT.AccountNo,
059170120827                Coalesce(RESPTP.Specimen_Plan_No,"0"),
059180120827                EXT.TradeDate,
059190120827                :lnci_0,
059200120827      * ln_C5_Contr_Withdr_Amt, ln_C5_IQEE_Amt_Paid, ln_C5_EAP_Amt_Paid
059210120827                :lnci_0,
059220120827                EXT.EAPQESI,
059230120827                EXT.TotalEAP,
059240120827      * ln_C5_IQEE_Balance,ln_C5_Fair_Mkt_Amt, ln_C5_Tot_Contr_Paid,
059250120827      * ln_C5_OthrBen_CLB_Amt, ln_C5_Benef_CLB_Amt,
059260120827      * ln_C5_Othr_ProvPgm_Amt
059270120827                :lnci_0,
059280120827                :lnci_0,
059290120827                :lnci_0,
059300120827                :lnci_0,
059310120827                :lnci_0,
059320120827                :lnci_0,
059330120827                :lnci_0,
059340120827                ACCBNP.Social_Insurance_No,
059350120827                ACCBNP.Last_Name,
059360120827                ACCBNP.First_Name,
059370120827                ACCBNP.Date_Of_Birth,
059380120827                CASE
059390120827                 WHEN ACCBNP.Sex = "F"   THEN :lnci_1
059400120827                 WHEN ACCBNP.Sex = "M"   THEN :lnci_2
059410120827                 ELSE :lnci_0
059420120827                END,
059430120827                CASE
059440120827                 WHEN EXT.QCResInd = "Y" THEN 1
059450120827                 ELSE :lnci_0
059460120827                END,
059470120827                ACBNEP.Pse_Program_Type,
059480120827                ACBNEP.Pse_Program_Length,
059490120827                ACBNEP.Pse_Program_Year,
059500120827                ACBNEP.Academic_Year_Start_Date,
059510120827                ZONED(ACBNEP.Academic_Year_Length_Weeks, 2),
059520120827                ACBNEP.Educational_Inst_Postal_Code,
059530120827                :lncc_Spaces_Inst_Name,
059540160219145606          :lncc_Spaces_15,
059550120827                EXT.BeneficiarySeqNo,
059560120827                :Lncc_N,
059570121003      * RFS107668 - Start
059580121003                CASE WHEN (:lc_ReportMode = :lncc_Y)
059590121003                     THEN :lncc_N
059600121003                ELSE
059610121003      * RFS107668 - End
059620120827                CASE
059630120827                 WHEN EXT.EAPQESI = 0
059640120827                 AND  EXT.MRQFileDate <> 0 THEN :lncc_Y
059650120827                 ELSE :lncc_N
059660121003      * RFS107668 - Start
059670121003      *         END,
059680121003                END
059690121003                END,
059700121003                CASE WHEN (:lc_ReportMode = :lncc_Y)
059710121003                     THEN :lncc_U
059720121003                ELSE
059730121003      * RFS107668 - End
059740170302
059750170302      * RFS165204 - Start
059760170302      *         CASE
059770170302      *          WHEN EXT.MRQFileDate <> 0
059780170302      *          AND  EXT.EAPQESI  = 0     THEN :lncc_C
059790170302      *          WHEN EXT.MRQFileDate <> 0
059800170302      *          AND  EXT.EAPQESI  <> 0    THEN :lncc_M
059810170302
059820170302                CASE
059830170302                 WHEN EXT.MRQFileDate <> 0
059840170302                 AND  EXT.EAPQESI  = 0
059850170302                 AND  EXT.RefileRequest <> :Lncc_Y
059860170302                 THEN :lncc_C
059870170302
059880170302                 WHEN EXT.MRQFileDate <> 0
059890170302                 AND  EXT.EAPQESI  <> 0
059900170302                 AND  EXT.RefileRequest <> :Lncc_Y
059910170302                 THEN :lncc_M
059920170302
059930170302                 WHEN EXT.MRQFileDate <> 0
059940170302                 AND  EXT.RefileRequest = :Lncc_Y
059950170302                 THEN :lncc_R
059960170302      * RFS165204 - End
059970170302
059980120827dm               ELSE :lncc_Unfiled
059990121003      * RFS107668 - Start
060000121003      *         END,
060010121003                END
060020121003                END,
060030121003      * RFS107668 - End
060040120827                EXT.MRQFileDate,
060050120827                :lncc_Spaces_C5
060060120827           FROM QTEMP/EXTPSESUM EXT
060070120827      * ACCOUNT
060080120827           JOIN MFAACCNTP ACCNTP
060090120827           ON   EXT.AccountNo = ACCNTP.Account_No
060100120827      * Exclude accounts with account attribute code NMRQ
060110120827      *      Added 09/29/11 - Daniel
060120120827             EXCEPTION JOIN MFAACCATP ACCATP ON
060130120827                  ACCATP.Account_No = ACCNTP.Account_No
060140120827                  AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
060150120827      * ACCOUNT-RESP
060160120827           JOIN MFAACCESP ACCESP
060170120827           ON   EXT.AccountNo = ACCESP.Account_No
060180120827      * RESP-TYPE-SPECIMEN-PLAN
060190120827           LEFT OUTER JOIN MFARESPTP RESPTP
060200120827           ON   ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code
060210120827           AND  ACCESP.Resp_Type_Code    = RESPTP.Resp_Type_Code
060220120827      * ACCOUNT-BENEFICIARY
060230120827           JOIN MFAACCBNP ACCBNP
060240120827           ON   EXT.AccountNo       = ACCBNP.Account_No
060250120827           AND EXT.BeneficiarySeqNo = ACCBNP.Beneficiary_Seq_No
060260120827      * ACCOUNT-BEN-EDUCATION-30
060270120827           JOIN MFAACBNEP ACBNEP
060280120827           ON   ACCBNP.Account_No         = ACBNEP.Account_No
060290120827           AND  ACCBNP.Beneficiary_Seq_No = ACBNEP.Beneficiary_Seq_No
060300120827
060310120827           WHERE EXT.AccountNo        = ACBNEP.Account_No
060320120827           AND   EXT.BeneficiarySeqNo = ACBNEP.Beneficiary_Seq_No
060330120827           AND   NOT (EXT.EAPQESI = 0
060340121003      * RFS107668 - Start
060350121003      *    AND   EXT.MRQFileDate = 0)
060360130627      * RFS120065 - Start
060370130627      *    AND   ((:lc_ReportMode = :lncc_Y  AND
060380130627      *           EXT.MRQFileDate > :lnci_0)  OR
060390130627      *           (:lc_ReportMode <> :lncc_Y AND
060400130627      *           EXT.MRQFileDate = 0)))
060410130627           AND   EXT.MRQFileDate = 0)
060420130627           AND   (:lc_ReportMode <> :lncc_Y   OR
060430130627                  (:lc_ReportMode = :lncc_Y  AND
060440130627                  EXT.MRQFileDate > :lnci_0))
060450130627      * RFS120065 - End
060460121003      * RFS107668 - End
060470120827           AND   ACBNEP.Academic_Year_Seq_No =
060480120827                (SELECT MAX(ACBNP2.Academic_Year_Seq_No)
060490120827                 FROM   MFAACBNEP ACBNP2
060500120827                 WHERE  ACBNP2.Account_No = EXT.AccountNo
060510120827                 AND    ACBNP2.Beneficiary_Seq_No =
060520120827                        EXT.BeneficiarySeqNo
060530120827                 AND    ACBNP2.Account_No = ACBNEP.Account_No
060540120827                 AND    ACBNP2.Beneficiary_Seq_No =
060550120827                        ACBNEP.Beneficiary_Seq_No)
060560120827      * RFS92917 - END
060570120827
060580120827             FOR FETCH ONLY
060590120827             OPTIMIZE FOR ALL ROWS
060600120827           END-EXEC.
060610120827
060620120827           EXEC SQL
060630120827             OPEN EapPse_Cursor
060640120827           END-EXEC.
060650120827           MOVE SQLSTATE   TO WS-SQL-STATES.
060660120827           EXEC SQL
060670120827           WHENEVER NOT FOUND CONTINUE
060680120827           END-EXEC.
060690120827
060700120827      *-------------
060710120827       Create_EapPse.
060720120827      *-------------
060730120827
060740120827           INITIALIZE ltb_FetchC5Table.
060750120827           EXEC SQL
060760120827           WHENEVER NOT FOUND CONTINUE
060770120827           END-EXEC.
060780120827
060790120827           EXEC SQL
060800120827              FETCH NEXT FROM EapPse_Cursor
060810120827                FOR :lnci_MaxFetchRec ROWS
060820120827              INTO  :ltb_C5Cursor:ltb_Indicators
060830120827           END-EXEC.
060840120827
060850120827           MOVE SQLSTATE TO lc_sqlStates.
060860120827           EVALUATE TRUE
060870120827               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
060880120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
060890120827               WHEN lncc_sqlEnd
060900120827                    SET lb_EndOfCursorTrue TO TRUE
060910120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
060920120827               WHEN OTHER
060930120827                    SET lncc_Err_Fetch TO TRUE
060940120827      * RFS109131 - Start
060950120827      *             MOVE lncc_ErrorFetchingCursor
060960120827                    MOVE lncc_ErrorFetchingCursor_05
060970120827      * RFS109131 - End
060980120827                      TO lc_sqlErrShortDESCR
060990120827                    PERFORM SQLFailProcess
061000120827           END-EVALUATE.
061010120827
061020120827           COMPUTE li_Counter = 1.
061030120827           PERFORM GetNextType05Row   TEST BEFORE
061040120827             UNTIL li_Counter > li_NoOfRowsFetched.
061050120827
061060120827      *-----------
061070120827       GetNextType05Row.
061080120827      *-----------
061090120827
061100120827           MOVE ltb_C5Cursor(li_Counter) TO lc_Current_05_Record.
061110120827      * RFS 78268 - Start
061120120827           MOVE li_F5_MRQ_File_Date(li_Counter)
061130120827                                         TO li_F5_C_MRQ_File_Date
061140120827           MOVE li_F5_Beneficiary_seq_no(li_Counter)
061150120827                                         TO li_F5_C_Beneficiary_seq_no
061160120827           Set  lc_OriginalFound    To true
061170141001      * RFS132831 - Begins - Evaluate for 'R'efile status
061180141001           IF lc_F5_MRQ_Approval_Status(li_Counter) =  lncc_R
061190141001              PERFORM ResetRefileVariables
061200141001              COMPUTE Li_RefileAccountNo = li_C5_Account_No
061210141001              COMPUTE Li_RefileBeneSeq   = li_F5_C_Beneficiary_seq_no
061220141001              COMPUTE Li_RefileMrqFileDate = li_F5_C_MRQ_File_Date
061230141001              MOVE Lncc_05 TO Lc_RefileRecType
061240141001              COMPUTE Li_RefileEffectiveDate = li_C5_Payment_Date
061250141001              COMPUTE Li_RefilePymtType      = li_C5_Payment_Type
061260141001              SET Lb_RefileModeVersion TO TRUE
061270141001              PERFORM GetRefileInfo
061280141001              IF Li_RefileVersion = Lnci_1 OR Lnci_2
061290141001                 SET Lb_RefileModeFileDate TO TRUE
061300150128                 PERFORM GetSuccReflDate
061310141001                 IF Li_RefileSuccessfulMrqFileDate NOT = 0
061320141001                    IF Li_RefileVersion = Lnci_1
061330141001                       MOVE Lncc_C
061340141001                         TO lc_F5_MRQ_Approval_Status(li_Counter)
061350141001                    END-IF
061360141001                    IF Li_RefileVersion = Lnci_2
061370141001                       MOVE Lncc_M
061380141001                         TO lc_F5_MRQ_Approval_Status(li_Counter)
061390141001                    END-IF
061400141001                    COMPUTE li_F5_C_MRQ_File_Date =
061410141001                            Li_RefileSuccessfulMrqFileDate
061420150205                    COMPUTE li_F5_MRQ_File_Date (li_Counter)=
061430150205                            Li_RefileSuccessfulMrqFileDate
061440141001      *             or leave as is (which is "R" which means original
061450141001      *             will be filed)
061460141001                 END-IF
061470141001              END-IF
061480141001           END-IF.
061490141001      * RFS132831 - Ends
061500120827           IF lc_F5_MRQ_Approval_Status(li_Counter) =
061510120827              lncc_C OR lncc_M OR lncc_O
061520120827              PERFORM Generate05Cancellation
061530120827           END-IF.
061540120827      *    Original/aMendment Filing record
061550120827           MOVE ltb_C5Cursor(li_Counter) TO lc_Current_05_Record.
061560120827
061570120827           IF lc_OriginalFound    AND
061580120827              lc_F5_MRQ_Approval_Status(li_Counter) NOT = lncc_C
061590120827              IF lc_F5_MRQ_Approval_Status(li_Counter) =  lncc_M
061600120827                 MOVE lnci_2  TO li_C5_Trxn_VersCde
061610120827              END-IF
061620120827
061630120827      *    -----key field moving to ltr_05filingLog
061640120827              INITIALIZE MFAMRQTP OF ltr_05filingLog
061650120827              MOVE li_C5_Account_No   TO
061660120827                         ACCOUNT-NO   OF ltr_05filingLog
061670120827              MOVE li_C5_Beneficiary_Seq_No  TO
061680120827                         BENEFICIARY-SEQ-NO  OF ltr_05filingLog
061690120827              MOVE li_C5_Payment_Date TO PAYMENT-DATE-MRQ
061700120827                                      OF ltr_05filingLog
061710120827              MOVE li_C5_Payment_Type TO
061720120827                         PAYMENT-TYPE-2 OF ltr_05filingLog
061730120926      * RFS107668 - Start Updates MRQ-FILE-DATE only if Report <> 'Y'
061740121018              IF lc_ReportMode NOT = lncc_Y
061750120921                MOVE li_AsAtDate          TO
061760120921                           MRQ-FILE-DATE  OF Ltr_05FilingLog
061770120921              END-IF
061780120921      *       MOVE li_AsAtDate          TO
061790120921      *                  MRQ-FILE-DATE  OF Ltr_05FilingLog
061800120926      * RFS107668 - End
061810120827              MOVE li_C5_Trxn_VersCde   TO
061820120827                         MRQ-VERSION-CODE OF ltr_05filingLog
061830120827              MOVE lc_C5_PromoterID   TO VENDOR-BN  OF Ltr_05FilingLog
061840120827              MOVE li_C5_SpecimenPlanNo   TO SPECIMEN-ID
061850120827                                          OF Ltr_05FilingLog
061860120827              MOVE li_C5_Accum_Income_Ind TO ACCUMULATED-INCOME-IND
061870120827                                          OF Ltr_05FilingLog
061880120827              MOVE ln_C5_Contr_Withdr_Amt TO CONTRIBUTION-WITHDRAWN-AMT
061890120827                                          OF Ltr_05FilingLog
061900120827              MOVE ln_C5_IQEE_Amt_Paid    TO IQEE-AMOUNT-PAID
061910120827                                          OF Ltr_05FilingLog
061920120827              MOVE ln_C5_EAP_Amt_Paid     TO EAP-AMOUNT-PAID
061930120827                                          OF Ltr_05FilingLog
061940120827              MOVE li_C5_Benef_SIN        TO BEN-SIN
061950120827                                          OF Ltr_05FilingLog
061960120827              MOVE lc_C5_Benef_LastName   TO BEN-LAST-NAME
061970120827                                          OF Ltr_05FilingLog
061980120827              MOVE lc_C5_Benef_FirstName  TO BEN-FIRST-NAME
061990120827                                          OF Ltr_05FilingLog
062000120827              MOVE li_C5_Benef_DOB        TO BEN-DATE-OF-BIRTH
062010120827                                          OF Ltr_05FilingLog
062020120827              MOVE lc_C5_Benef_Sex        TO BEN-GENDER
062030120827                                          OF Ltr_05FilingLog
062040120827              MOVE lc_C5_Benef_QcResident TO BEN-QC-RESIDENT-IND
062050120827                                          OF Ltr_05FilingLog
062060120827              MOVE li_C5_PSE_Pgm_Type     TO PSE-PROGRAM-TYPE
062070120827                                          OF Ltr_05FilingLog
062080120827              MOVE li_C5_PSE_Pgm_Length   TO PSE-PROGRAM-LENGTH
062090120827                                          OF Ltr_05FilingLog
062100120827              MOVE li_C5_PSE_Pgm_Year     TO PSE-PROGRAM-YEAR
062110120827                                          OF Ltr_05FilingLog
062120120827              MOVE li_C5_AcadYr_Start_Date TO ACADEMIC-YEAR-START-DATE
062130120827                                           OF Ltr_05FilingLog
062140120827              MOVE li_C5_AcadYr_Lgth_Weeks      TO
062150120827                   ACADEMIC-YEAR-LENGTH-WEEKS   OF Ltr_05FilingLog
062160120827              MOVE lc_C5_Educ_Postal_Code       TO
062170120827                   EDUCATIONAL-INST-POSTAL-CODE OF Ltr_05FilingLog
062180120827              MOVE lncc_P                       TO
062190120827                   MRQ-APPROVAL-STATUS          OF Ltr_05FilingLog
062200160219      *RFS145606 - START
062210160229              PERFORM NewSeqNoGen
062220160219              MOVE lc_mrq_trans_id TO lc_C5_MRQ_Trans_Id
062230160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
062240160219                                      OF Ltr_05FilingLog
062250160219      *RFS145606 - END
062260120827
062270120827              PERFORM Write05FilingLog
062280120827              MOVE SPACES          TO  lc_C5_Filler
062290140923      *RFS139963 - Begins
062300140923              MOVE lc_Current_05_Record TO lc_Temp_0405_Record
062310140923              MOVE lc_temp_0405_acct TO Li_AccountNo_In
062320140923              PERFORM AccountEdit
062330140923              MOVE Lc_AccountNo_Out  TO lc_temp_0405_acct
062340140923              MOVE lc_Temp_0405_Record TO lc_RecordToInsert
062350140923      *       MOVE lc_Current_05_Record TO lc_RecordToInsert
062360140923      *RFS139963 - Ends
062370120827              PERFORM InsertRecord
062380120827              MOVE li_F5_Beneficiary_seq_no(li_Counter) TO
062390120827                                        li_C5_Beneficiary_Seq_No
062400120827
062410120827      *    RFS103461 - Begins - Load Current record again for data
062420120827      *                         stored in filler area
062430120827           MOVE ltb_C5Cursor(li_Counter) TO lc_Current_05_Record
062440120827      *    RFS103461 - Ends
062450120827
062460120827              PERFORM Update_EapPseSts_Type05
062470120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
062480120827      * RFS78268 - Begins - Update status if cancellation
062490120827           ELSE
062500120827              IF lc_OriginalFound
062510120827                 PERFORM Update_EapPseSts_Type05
062520120827              END-IF
062530120827           END-IF.
062540120827      * RFS78268 - Ends
062550120827              COMPUTE li_Counter = li_Counter + 1.
062560120827
062570120827      * RFS 78268 - Start
062580120827
062590120827      *---------------------
062600120827       Generate05Cancellation.
062610120827      *---------------------
062620120827
062630120827           Initialize MFAMRQTP  OF ltr_05FilingLog
062640120827           EXEC SQL
062650120827                 SELECT * INTO :MFAMRQTP
062660120827                 FROM   MFAMRQTP
062670120827                 WHERE  MFAMRQTP.ACCOUNT_NO         = :li_C5_Account_No
062680120827                   AND  MFAMRQTP.BENEFICIARY_SEQ_NO =
062690120827                                    :li_F5_C_Beneficiary_seq_no
062700120827                   AND  MFAMRQTP.PAYMENT_DATE_MRQ = :li_C5_Payment_Date
062710120827                   AND  MFAMRQTP.PAYMENT_TYPE_2   = :li_C5_Payment_Type
062720120827                   AND  MFAMRQTP.MRQ_FILE_DATE    =
062730120827                                    :li_F5_C_MRQ_File_Date
062740120827                   AND  MFAMRQTP.MRQ_VERSION_CODE  <> :lnci_1
062750120827                        FETCH FIRST ROW ONLY
062760120827            END-EXEC.
062770120827
062780120827           MOVE SQLSTATE TO lc_sqlStates.
062790120827           IF   NOT lncc_sqlSuccessful
062800120827              SET lc_OriginalNotFound  TO TRUE
062810120827              MOVE SQLSTATE     TO WS-SQLSTATE
062820120827              MOVE SQLCODE      TO WS-DSP-SQLCODE
062830120827              MOVE "MFAMRQTP " To lncc_FileName
062840120827              MOVE lncc_ErrorFetchingCancel  To
062850120827                                   Ws-Sql-Err-Short-Descr
062860120827              PERFORM DisplayError
062870120827           END-IF.
062880120827
062890120827           IF lc_OriginalFound
062900120827              MOVE  lnci_1    TO  li_C5_Trxn_VersCde
062910120827              MOVE  VENDOR-BN OF Ltr_05FilingLog
062920120827                              TO  lc_C5_PromoterID
062930120827              MOVE  SPECIMEN-ID       OF Ltr_05FilingLog
062940120827                                      TO li_C5_SpecimenPlanNo
062950120827              MOVE  PAYMENT-DATE-MRQ  OF Ltr_05FilingLog
062960120827                                      TO li_C5_Payment_Date
062970120827              MOVE  ACCUMULATED-INCOME-IND OF Ltr_05FilingLog
062980120827                                      TO li_C5_Accum_Income_Ind
062990120827              MOVE  CONTRIBUTION-WITHDRAWN-AMT OF Ltr_05FilingLog
063000120827                    TO ln_C5_Contr_Withdr_Amt
063010120827              MOVE  IQEE-AMOUNT-PAID  OF Ltr_05FilingLog
063020120827                                      TO ln_C5_IQEE_Amt_Paid
063030120827              MOVE  EAP-AMOUNT-PAID   OF Ltr_05FilingLog
063040120827                                      TO ln_C5_EAP_Amt_Paid
063050120827              MOVE  lnci_0            TO ln_C5_IQEE_Balance
063060120827                                         ln_C5_Fair_Mkt_Amt
063070120827                                         ln_C5_Tot_Contr_Paid
063080120827                                         ln_C5_OthrBen_CLB_Amt
063090120827                                         ln_C5_Benef_CLB_Amt
063100120827                                         ln_C5_Bal_Cdn_Grant
063110120827                                         ln_C5_Othr_ProvPgm_Amt
063120120827              MOVE  BEN-SIN           OF Ltr_05FilingLog
063130120827                                      TO li_C5_Benef_SIN
063140120827              MOVE  BEN-LAST-NAME     OF Ltr_05FilingLog
063150120827                                       TO lc_C5_Benef_LastName
063160120827              MOVE  BEN-FIRST-NAME    OF Ltr_05FilingLog
063170120827                                      TO lc_C5_Benef_FirstName
063180120827              MOVE  BEN-DATE-OF-BIRTH OF Ltr_05FilingLog
063190120827                                      TO li_C5_Benef_DOB
063200120827              MOVE  BEN-GENDER        OF Ltr_05FilingLog
063210120827                                      TO lc_C5_Benef_Sex
063220120827              MOVE  BEN-QC-RESIDENT-IND OF Ltr_05FilingLog
063230120827                                        TO lc_C5_Benef_QcResident
063240120827              MOVE  PSE-PROGRAM-TYPE    OF Ltr_05FilingLog
063250120827                                        TO li_C5_PSE_Pgm_Type
063260120827              MOVE  PSE-PROGRAM-LENGTH  OF Ltr_05FilingLog
063270120827                                        TO li_C5_PSE_Pgm_Length
063280120827              MOVE  PSE-PROGRAM-YEAR    OF Ltr_05FilingLog
063290120827                                        TO li_C5_PSE_Pgm_Year
063300120827              MOVE  ACADEMIC-YEAR-START-DATE OF Ltr_05FilingLog TO
063310120827                    li_C5_AcadYr_Start_Date
063320120827              MOVE  ACADEMIC-YEAR-LENGTH-WEEKS OF Ltr_05FilingLog TO
063330120827                    li_C5_AcadYr_Lgth_Weeks
063340120827              MOVE  EDUCATIONAL-INST-POSTAL-CODE OF Ltr_05FilingLog TO
063350120827                    lc_C5_Educ_Postal_Code
063360120827              MOVE  SPACES              TO lc_C5_Educ_Name
063370120827                                           lc_C5_Filler
063380160219      *RFS145606 - START
063390160229              PERFORM NewSeqNoGen
063400160219              MOVE lc_mrq_trans_id TO lc_C5_MRQ_Trans_Id
063410160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
063420160219                                      OF Ltr_05FilingLog
063430160219      *RFS145606 - END
063440140923      *RFS139963 - Begins
063450140923              MOVE lc_Current_05_Record TO lc_Temp_0405_Record
063460140923              MOVE lc_temp_0405_acct TO Li_AccountNo_In
063470140923              PERFORM AccountEdit
063480140923              MOVE Lc_AccountNo_Out  TO lc_temp_0405_acct
063490140923              MOVE lc_Temp_0405_Record TO lc_RecordToInsert
063500140923      *       MOVE lc_Current_05_Record TO lc_RecordToInsert
063510140923      *RFS139963 - Ends
063520120827              PERFORM InsertRecord
063530120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
063540120827
063550120827      *    cancellation filing record
063560120827
063570120926      * RFS107668 - Start Updates MRQ-FILE-DATE only if Report <> 'Y'
063580121018           IF lc_ReportMode NOT = lncc_Y
063590120921             MOVE li_AsAtDate   TO MRQ-FILE-DATE OF Ltr_05FilingLog
063600120921           END-IF
063610120921      *    MOVE li_AsAtDate   TO MRQ-FILE-DATE OF Ltr_05FilingLog
063620120926      * RFS107688 - End
063630120827           MOVE lnci_1        TO MRQ-VERSION-CODE OF Ltr_05FilingLog
063640120827      *    RFS78268.17 - Begins - Set the filing status
063650120827           MOVE Lncc_P        TO MRQ-APPROVAL-STATUS OF Ltr_05FilingLog
063660120827      *    RFS78268.17 - Ends
063670120827           PERFORM Write05FilingLog
063680120827
063690120827
063700120827           END-IF.
063710120827
063720120827
063730120827      *---------------------
063740120827       Write05FilingLog.
063750120827      *---------------------
063760120921      * RFS107668 - Start - Moved the existing logic into IF condition
063770121018           IF lc_ReportMode NOT = lncc_Y
063780120926      * RFS107668 - End
063790120827      *        RFS78268.25 - Begins - Set the record-type-2
063800120925               MOVE Lncc_05
063810120925                 TO RECORD-TYPE-2
063820120927      * RFS107668 - Start
063830120927      *             OF Ltr_05FilingLog.
063840120927                    OF Ltr_05FilingLog
063850120927      * RFS107668 - End
063860120827      *        RFS78268.25 - Ends
063870120827
063880120925           EXEC SQL
063890120925             INSERT INTO MFAMRQTP VALUES(:MFAMRQTP)
063900120927      * RFS107668 - Start
063910120927      *    END-EXEC.
063920120927           END-EXEC
063930120927      * RFS107668 - End
063940120827
063950120927      * RFS107668 - Start
063960120927      *    MOVE SQLSTATE TO lc_sqlStates.
063970120927           MOVE SQLSTATE TO lc_sqlStates
063980120927      * RFS107668 - End
063990120925           IF not lncc_sqlSuccessful
064000120925              SET lncc_Err_I1 TO TRUE
064010120925              MOVE "MFAMRQTP " TO lncc_InsertFileName
064020120925              MOVE lncc_ErrorInsertingFile TO lc_sqlErrShortDESCR
064030120925              PERFORM SQLFailProcess
064040120926      * RFS107668 - Start
064050120926      *    END-IF.
064060120925           END-IF
064070120921           ELSE
064080121010             INITIALIZE li_Report-Variables
064090121010             MOVE li_C5_RecordType   TO  lc_ReportFilingRectype
064100120921             MOVE li_C5_Benef_SIN    TO  li_WK-Beneficiary-SIN
064110120921             MOVE li_C5_Benef_DOB    TO  li_WK-Beneficiary-DOB
064120120921             PERFORM Record_Comparison
064130120921           END-IF.
064140120921      * RFS107668 - End
064150120827
064160120827      * RFS 78268 - End
064170120827
064180120827      *---------------------
064190120827       BuildType06Table.
064200120827      *---------------------
064210120827
064220120827           EXEC SQL
064230120827             DROP TABLE
064240120827               QTEMP/EAPPSETBL4
064250120827           END-EXEC.
064260120827
064270120827      * 92917.7 - START
064280120827      * Moved the below Commented code to initial_steps para.
064290120827      *    EXEC SQL
064300120827      *      DROP TABLE
064310120827      *        QTEMP/EAPPSETBL5
064320120827      *    END-EXEC.
064330120827      * 92917.7 - END
064340120827
064350120827      *Records are consolidated on account no, beneficiary seq no
064360120827      *reason code, and trade date. Determine reason code in first
064370120827      *table (TBL4) select, and sum amounts in the second table (TBL5)
064380120827           EXEC SQL
064390120827             CREATE TABLE QTEMP/EAPPSETBL4
064400120827              (ACCTNO     NUMERIC ( 9) NOT NULL WITH DEFAULT,
064410120827               PLCDTE     DECIMAL ( 9) NOT NULL WITH DEFAULT,
064420120827               TRNSNO     DECIMAL ( 9) NOT NULL WITH DEFAULT,
06443012082790545 *        BENSEQNO   NUMERIC ( 2) NOT NULL WITH DEFAULT,
06444012082790545          BENSEQNO   NUMERIC ( 3) NOT NULL WITH DEFAULT,
06445012082772749 *        YEAR       NUMERIC ( 4) NOT NULL WITH DEFAULT,
06446012082772749 *        TRDDATE    DECIMAL ( 9) NOT NULL WITH DEFAULT,
06447012082772749          EVTDTE     DECIMAL ( 9) NOT NULL WITH DEFAULT,
064480120827               CRCRULE    CHAR    ( 2) NOT NULL WITH DEFAULT,
06449012082790545 *        ACTTYPR    NUMERIC ( 2) NOT NULL WITH DEFAULT,
06450012082790545          ACTTYPR    CHAR    ( 1) NOT NULL WITH DEFAULT,
064510120827               TAXREAS    CHAR    ( 2) NOT NULL WITH DEFAULT,
064520120827               GRSAMT1    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
064530120827               GRSAMT2    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
064540120827               GRSAMT3    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
064550120827      * 78268 Begin
064560120827               RVSL       CHAR    ( 1) NOT NULL WITH DEFAULT,
064570120827               CANCEL     CHAR    ( 1) NOT NULL WITH DEFAULT,
064580120827               MRQAPRSTAT CHAR    ( 1) NOT NULL WITH DEFAULT,
064590120827               MRQFILEDT  NUMERIC ( 8) NOT NULL WITH DEFAULT
064600120827      * 78268 End
064610120827              )
064620120827           END-EXEC.
064630120827
064640120827           EXEC SQL
064650120827             INSERT INTO QTEMP/EAPPSETBL4
064660120827              SELECT
064670120827                TRNQAP.Account_No,
064680120827                TRNQAP.Placement_Date,
064690120827                TRNQAP.Trans_No,
064700120827                TRNQAP.Beneficiary_Seq_No,
06471012082772749 *         TRNQAP.Year,
06472012082772749 *         TRANS.Trade_Date,
064730120827      *         RFS90545 - Begins - Cast the result
064740120827               DECIMAL(
064750120827      *         RFS90545 - Ends
06476012082772749           CASE
06477012082773672 *          WHEN TRNRRP.Repayment_Reason_Code IN ("22", "23")
06478012082773672            WHEN TRNRRP.Repayment_Reason_Code = 22
06479012082772749                 AND TRNRRP.Year <> 0
06480012082772749                 THEN (TRNRRP.Year * 10000 + 1231)
06481012082773672 *          WHEN TRNRRP.Repayment_Reason_Code IN ("22", "23")
06482012082773672            WHEN TRNRRP.Repayment_Reason_Code = 22
06483012082772749                 AND TRNRRP.Year = 0
06484012082772749                 THEN
06485012082772749                  SUBSTR(DEC(TRANS.Trade_Date),1,4) * 10000 + 1231
06486012082772749            ELSE
06487012082772749             TRANS.Trade_Date
064880120827      *         RFS90545 - Begins - Cast the result
06489012082772749 *         END,
064900120827                END,9),
064910120827      *         RFS90545 - Ends
064920120827                CNTRRP.Contr_Redem_Code_Rule,
064930120827                ACCTYP.Account_Type_Rule,
064940120827      *         RFS90545 - Begins - Cast the result
064950120827                CHAR(
064960120827      *         RFS90545 - Ends
064970120827                CASE
064980120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "29"
064990120827                      AND ACCTYP.Account_Type_Rule = "4"
065000120827                      THEN
06501012082776555 *                COALESCE(TRNRRP.Repayment_Reason_Code, " ")
065020120827      *        RFS90545 - Begins fix cast in Coalesce
06503012082776555 *                CHAR(DIGITS(COALESCE
06504012082776555 *                    (TRNRRP.Repayment_Reason_Code, " ")))
06505012082790545                  CHAR(COALESCE
06506012082790545                     (digits(TRNRRP.Repayment_Reason_Code), " "))
065070120827      *        RFS90545 - Ends
065080120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "11"
065090120827                      AND ACCTYP.Account_Type_Rule = "4"
065100120827                      THEN
065110120827                      "24"
065120120827                 ELSE "  "
065130120827      *         RFS90545 - Begins - Cast the result
065140120827      *         END,
065150120827                END,2),
065160120827      *         RFS90545 - Ends
065170120827      * GRSAMT1 - Amount of Contributions Withdrawn
065180120827      * RFS 90105 - Begin: Set GRSAMT1 to 0 in this table.
065190120827      *             It'll be populated from WKIQENOT in Type06_Cursor
06520012082775878 * For Unfiled, calculate beneficiary level Repayment_Specific_Amt
06521012082775878 *   by beneficiary split percentage
065220120827      *         RFS90545 - Begins - Cast the result
06523012082790105 *         DECIMAL(
065240120827      *         RFS90545 - Ends
06525012082790105 *         CASE
06526012082790105 *          WHEN CNTRRP.Contr_Redem_Code_Rule = "29"
06527012082790105 *               AND ACCTYP.Account_Type_Rule = "4"
06528012082790105 *               AND TRNRRP.Repayment_Reason_Code =  22
06529012082775878 *90105          AND TRNQAP.MRQ_Approval_Status = :lncc_Unfiled
06530012082790105 *               THEN
06531012082790105 *               DEC(ROUND(TRNRRP.Repayment_Specific_Amt *
06532012082790105 *               (ACCBPP.Beneficiary_Percent / 100.00) ,2), 9, 2)
06533012082790105 *               AND Coalesce(IQENOT.Resultant_Reason , "")  = "22"
06534012082790105 *               THEN Coalesce(IQENOT.Capital_Amount, 0)
06535012082775878 * Begins
065360120827      * For Refiled, get Repayment_Specific_Amt from bene level directly
06537012082790105 *          WHEN CNTRRP.Contr_Redem_Code_Rule = "29"
06538012082790105 *               AND ACCTYP.Account_Type_Rule = "4"
06539012082790105 *               AND TRNRRP.Repayment_Reason_Code =  22
06540012082790105 *               AND TRNQAP.MRQ_Approval_Status = :lncc_Refiling
06541012082790105 *               THEN
06542012082790105 *               TRNQAP.Repayment_Specific_Amt
06543012082775878 * Ends
06544012082790105 *          WHEN CNTRRP.Contr_Redem_Code_Rule = "11"
06545012082790105 *               AND ACCTYP.Account_Type_Rule = "4"
06546012082790105 *               THEN
06547012082790105 *               DEC(ROUND(TRANS.Gross_Amt *
06548012082790105 *               (ACCBPP.Beneficiary_Percent / 100.00) ,2), 9, 2)
06549012082790105 *               AND Coalesce(IQENOT.Resultant_Reason , "")  = "24"
06550012082790105 *               THEN
06551012082790105 *               Coalesce(IQENOT.Capital_Amount, 0)
06552012082790105 *          ELSE 0
065530120827      *         RFS90545 - Begins - Cast the result
065540120827      *         END,
06555012082790105 *         END,9,2),
065560120827      *         RFS90545 - Ends
06557012082790105           0,
065580120827      * RFS 90105 - End
065590120827      * GRSAMT2 - Amount of IQEE Refunded
065600120827      *         RFS90545 - Begins - Cast the result
065610120827                DECIMAL(
065620120827      *         RFS90545 - Ends
065630120827                CASE
065640120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "29"
065650120827                      AND ACCTYP.Account_Type_Rule = "4"
065660120827                      THEN
065670120827106265*               DEC(ROUND(TRANS.Gross_Amt *
065680120827106265                DEC(ROUND(TRANS.Net_Amt   *
065690120827                      (ACCBPP.Beneficiary_Percent / 100.00) ,2), 9, 2)
065700120827                 ELSE 0
065710120827      *         RFS90545 - Begins - Cast the result
065720120827      *         END,
065730120827                END,9,2),
065740120827      *         RFS90545 - Ends
065750120827      * GRSAMT3 - Write Off Amount
065760120827      * For Unfiled, calculate beneficiary level Repayment_Specific_Amt
065770120827      *   by beneficiary split percentage
065780120827      *         RFS90545 - Begins - Cast the result
065790120827                DECIMAL(
065800120827      *         RFS90545 - Ends
065810120827                CASE
065820120827                 WHEN TRNRRP.Repayment_Reason_Code IN (51 , 91)
06583012082775878                 AND TRNQAP.MRQ_Approval_Status = :lncc_Unfiled
065840120827                      THEN
065850120827                      DEC(ROUND(TRNRRP.Repayment_Specific_Amt *
065860120827                      (ACCBPP.Beneficiary_Percent / 100.00) ,2), 9, 2)
06587012082775878 * Begins
065880120827      * For Refiled, get Repayment_Specific_Amt from bene level directly
065890120827                 WHEN TRNRRP.Repayment_Reason_Code IN (51 , 91)
065900120827                      AND TRNQAP.MRQ_Approval_Status = :lncc_Refiling
065910120827                      THEN
065920120827                      TRNQAP.Repayment_Specific_Amt
06593012082775878 * Ends
065940120827                 ELSE 0
065950120827      *         RFS90545 - Begins - Cast the result
065960120827      *         END,
065970120827                END,9,2),
065980120827      *         RFS90545 - Ends
065990120827
066000120827      * RFS 78268 - Start
066010120827                CHAR("N",1),
066020121001      * RFS107668 - Start
066030121001                CASE WHEN (:lc_ReportMode = :lncc_Y)
066040121001                     THEN CHAR("N",1)
066050121001                ELSE
066060121001      * RFS107668 - End
066070120827                CHAR
066080120827                (CASE
066090120827                  WHEN TRNQAP.Mrq_Approval_Status
066100120827                       IN (:lncc_O, :lncc_M, :lncc_C)
066110120827                       THEN :lncc_Y
066120120827                  ELSE :lncc_N
066130121001      * RFS107668 - Start
066140121001      *           END,1),
066150121001                  END,1)
066160121001                END,
066170121001                CASE WHEN (:lc_ReportMode = :lncc_Y)
066180121001                     THEN :lncc_U
066190121001                ELSE
066200121001      * RFS107668 - End
066210120827                CHAR
066220120827                (CASE
066230120827                  WHEN TRNQAP.Mrq_Approval_Status
066240120827                       IN (:lncc_O, :lncc_M, :lncc_C)
066250120827                       THEN TRNQAP.Mrq_Approval_Status
066260120827                   ELSE " "
066270121001      * RFS107668 - Start
066280121001      *           END,1),
066290121001                  END,1)
066300121001                END,
066310121001      * RFS107668 - End
066320120827                TRNQAP.MRQ_File_Date
066330120827
066340120827      * RFS 78268 - End
066350120827
066360120827      * TRANS-RESP-MRQ-APPROVAL
066370120827             FROM MFATRNQAP  TRNQAP
066380120827      * Exclude accounts with account attribute code NMRQ
066390120827             EXCEPTION JOIN MFAACCATP ACCATP ON
066400120827                 ACCATP.Account_No = TRNQAP.Account_No
066410120827             AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
066420120827      * ACCOUNT
066430120827             LEFT JOIN MFAACCNTP ACCNTP ON
066440120827                 TRNQAP.Account_No = ACCNTP.Account_No
066450120827      * ACCOUNT-TYPE
066460120827             JOIN MFAACCTYP ACCTYP ON
066470120827                 ACCNTP.Account_Type_Code = ACCTYP.Account_Type_Code
066480120827      * TRANS-RESP-REPAYMENT-DTL
066490120827             JOIN MFATRNRRP TRNRRP ON
066500120827                  TRNQAP.Placement_Date = TRNRRP.Placement_Date
066510120827              AND TRNQAP.Trans_No = TRNRRP.Trans_No
066520120827      * TRANS
066530120827             JOIN MFATRNP TRANS ON
066540120827                 TRNQAP.Account_No = TRANS.Account_No
066550120827             AND TRNQAP.Placement_Date = TRANS.Placement_Date
066560120827             AND TRNQAP.Trans_No = TRANS.Trans_No
066570120827      * CONTR-REDEM-CODE-RULES
066580120827             JOIN MFACNTRRP CNTRRP ON
066590120827                 ACCNTP.Account_Type_Code = CNTRRP.Account_Type_Code
066600120827             AND TRANS.Contr_Redem_Code = CNTRRP.Contr_Redem_Code
066610120827      * TRANS-RESP-DETAILS
066620120827             JOIN MFATRNRFP TRNRFP ON
066630120827                 TRANS.Account_No = TRNRFP.Account_No
066640120827             AND TRANS.Placement_Date = TRNRFP.Placement_Date
066650120827             AND TRANS.Trans_No = TRNRFP.Trans_No
066660120827      * ACCOUNT-BENEFICIARY-SPLIT
066670120827             JOIN MFAACCBPP ACCBPP ON
066680120827                 TRNRFP.Account_No = ACCBPP.Account_No
066690120827             AND TRNRFP.Beneficiary_Split_Code =
066700120827                 ACCBPP.Beneficiary_Split_Code
066710120827             AND TRNRFP.HRDC_File_Date = ACCBPP.HRDC_File_Date
066720120827             AND TRNQAP.Beneficiary_Seq_No =
066730120827                 ACCBPP.Beneficiary_Seq_No
066740120827             WHERE
06675012082778268 *          CNTRRP.Contr_Redem_Code_Rule IN ("29" , "11")
06676012082778268            CNTRRP.Contr_Redem_Code_Rule IN ("29")
066770120827                 AND ACCTYP.Account_Type_Rule = "4"
066780120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
066790180921004139*          AND TRANS.Reverse <> "Y"
066800180921004139           AND (TRANS.Reverse <> "Y" OR
066810180921004139                (TRANS.Reverse = "Y" AND
066820180921004139                 TRNQAP.Mrq_Approval_Status = "C"))
066830120827
066840120827      * RFS 105558 - Start
066850120827      *          AND (TRNQAP.Mrq_Approval_Status
066860120827      * RFS 78268 - Start
066870120827      *             IN (:lncc_Refiling, :lncc_Unfiled)
066880120827      *             IN (:lncc_Refiling, :lncc_Unfiled,
066890120827      *                 :Lncc_O, :Lncc_M, :Lncc_C)
066900120827      * RFS 78268 - End
06691012082776555 *          AND SUBSTR(DEC(TRANS.Trade_Date),1,4)
06692012082776555 *          AND ((SUBSTR(DEC(TRANS.Trade_Date),1,4)
06693012082776555 *          BETWEEN :li_Year1 AND :li_Year2)
06694012082776555 *          OR (TRNRRP.Year BETWEEN :li_Year1 AND :li_Year2)))
066950120827      *    END-EXEC.
066960120827
066970120827      * RFS 109558d - Begins - re-write
066980120827      *          AND ((TRNQAP.Mrq_Approval_Status
066990120827      *                       IN (:lncc_Refiling, :lncc_Unfiled)
067000120827      *          AND (SUBSTR(DEC(TRANS.Trade_Date),1,4)
067010120827      * RFS 109131 - Start
067020120827      *               BETWEEN :li_Year1 AND :li_Year2)
067030120827      *          OR (TRNRRP.Year BETWEEN :li_Year1 AND :li_Year2))
067040120827      *               <= :li_Year2)
067050120827      *          OR TRNRRP.Year <= :li_Year2)
067060120827      * RFS 109131 - End
067070120827      *          OR (TRNQAP.Mrq_Approval_Status
067080120827      *                     IN (:Lncc_O, :Lncc_M, :Lncc_C)))
067090121001      * RFS107668 - Start
067100121003              AND((:lc_ReportMode = :lncc_Y          AND
067110121107      * 107668.1 - Start
067120121107      *            ((TRNRRP.Year
067130121107                   ((SUBSTR(DEC(TRANS.Trade_Date),1,4)
067140121107      * 107668.1 - End
067150121003                    BETWEEN :li_ProcessFilingYear AND :li_Year2) AND
067160121001                    TRNQAP.MRQ_File_Date > :lnci_0))
067170121001              OR (:lc_ReportMode <> :lncc_Y
067180121001      * RFS107668 - End
067190120827                AND (TRNQAP.Mrq_Approval_Status
067200120827                            IN (:Lncc_O, :Lncc_M, :Lncc_C)
067210120827                               OR
067220120827                    (
067230120827                      TRNQAP.Mrq_Approval_Status
067240120827                    IN (:lncc_Refiling, :lncc_Unfiled)
067250120827                    AND ( ( SUBSTR(DEC(TRANS.Trade_Date),1,4)
067260120827                          <= :li_Year2)                      OR
067270130201      * 115288 - start
067280130201      *                (TRNRRP.Year <= :li_Year2) )
067290130201                       (TRNRRP.Year <> 0 AND
067300130201                        TRNRRP.Year <= :li_Year2) )
067310130201      * 115288 - end
067320120827                     )
067330120827                     )
067340121003107668           ))
067350120827           END-EXEC.
067360120827      * RFS 105558 - End
067370120827
067380120827
067390120827      * Populate the repayment_specific_amt on MFATRNQAP using the
067400120827      * repayment_specific_amt on the MFATRNRRP file
067410120827      * Apply the beneficiary split to this value
067420120827
067430120827      * Update for repayment reason code 22 using TBL4.GRSAMT1
067440120827      * RFS90105 -Begin: Comment out this update. Contributions Withdrawn
067450120827      *                  amount for repayment reason code 22 will be
067460120827      *                  calculated in FXIQENOT
06747012082790105 *     EXEC SQL
06748012082790105 *       UPDATE MFATRNQAP TRNQAP
06749012082790105 *       SET TRNQAP.repayment_specific_amt =
06750012082790105 *       (SELECT  TBL4.GRSAMT1 FROM QTEMP/EAPPSETBL4 TBL4
06751012082790105 *        WHERE
06752012082790105 *         TRNQAP.Account_No             = TBL4.ACCTNO
06753012082790105 *         AND TRNQAP.Placement_Date     = TBL4.PLCDTE
06754012082790105 *         AND TRNQAP.Trans_No           = TBL4.TRNSNO
06755012082790105 *         AND TRNQAP.Beneficiary_Seq_No = TBL4.BENSEQNO)
06756012082790105 *       WHERE EXISTS
067570120827      * RFS84977 - Link files using inner joins
06758012082784977 *       (SELECT 1 FROM MFATRNQAP A, EAPPSETBL4 B
06759012082790105 *       (SELECT 1 FROM MFATRNQAP A
06760012082790105 *        INNER JOIN EAPPSETBL4 B ON
06761012082790105 *            A.Account_No         = B.ACCTNO
06762012082790105 *        AND A.Placement_Date     = B.PLCDTE
06763012082790105 *        AND A.Trans_No           = B.TRNSNO
06764012082790105 *        AND A.Beneficiary_Seq_No = B.BENSEQNO
067650120827      * RFS84977 - Ends
06766012082790105 *        WHERE
06767012082790105 *         A.Account_No             = TRNQAP.Account_No
06768012082790105 *         AND A.Placement_Date     = TRNQAP.Placement_Date
06769012082790105 *         AND A.Trans_No           = TRNQAP.Trans_No
06770012082790105 *         AND A.Beneficiary_Seq_No = TRNQAP.Beneficiary_Seq_No
06771012082784977 *         AND A.Account_No         = B.ACCTNO
06772012082784977 *         AND A.Placement_Date     = B.PLCDTE
06773012082784977 *         AND A.Trans_No           = B.TRNSNO
06774012082784977 *         AND A.Beneficiary_Seq_No = B.BENSEQNO
06775012082790105 *         AND B.TAXREAS = "22")
06776012082790105 *     END-EXEC.
067770120827      * RFS90105 End
067780120827
067790120827      * Update for repayment reason code 51, 91 using TBL4.GRSAMT3
067800121001      * RFS107668 - Start-Writes only if Report mode is not set to 'Y'
067810121018107668     IF lc_ReportMode NOT = lncc_Y
067820120827            EXEC SQL
067830120827              UPDATE MFATRNQAP TRNQAP
067840120827              SET TRNQAP.repayment_specific_amt =
067850120827              (SELECT  TBL4.GRSAMT3 FROM QTEMP/EAPPSETBL4 TBL4
067860120827               WHERE
067870120827                TRNQAP.Account_No             = TBL4.ACCTNO
067880120827                AND TRNQAP.Placement_Date     = TBL4.PLCDTE
067890120827                AND TRNQAP.Trans_No           = TBL4.TRNSNO
067900120827                AND TRNQAP.Beneficiary_Seq_No = TBL4.BENSEQNO)
067910120827              WHERE EXISTS
067920120827      * RFS84977 - Link files using inner joins
06793012082784977 *       (SELECT 1 FROM MFATRNQAP A, EAPPSETBL4 B
067940120827              (SELECT 1 FROM MFATRNQAP A
067950120827               INNER JOIN EAPPSETBL4 B ON
067960120827                     A.Account_No         = B.ACCTNO
067970120827                 AND A.Placement_Date     = B.PLCDTE
067980120827                 AND A.Trans_No           = B.TRNSNO
067990120827                 AND A.Beneficiary_Seq_No = B.BENSEQNO
068000120827      * RFS84977 - Ends
068010120827               WHERE
068020120827                A.Account_No             = TRNQAP.Account_No
068030120827                AND A.Placement_Date     = TRNQAP.Placement_Date
068040120827                AND A.Trans_No           = TRNQAP.Trans_No
068050120827                AND A.Beneficiary_Seq_No = TRNQAP.Beneficiary_Seq_No
06806012082784977 *         AND A.Account_No         = B.ACCTNO
06807012082784977 *         AND A.Placement_Date     = B.PLCDTE
06808012082784977 *         AND A.Trans_No           = B.TRNSNO
06809012082784977 *         AND A.Beneficiary_Seq_No = B.BENSEQNO
068100120827                AND B.TAXREAS IN ("51", "91"))
068110121001      * RFS107668 - Start
068120121001      *     END-EXEC.
068130121001            END-EXEC
068140121001           END-IF.
068150121001      * RFS107668 - End
068160120827
06817012082772749 * Begins
068180120827      * Update for Year field on MFATRNQAP Year of Event Date
068190121001      * RFS107668 - Start-Writes only if Report mode is not set to 'Y'
068200121018107668     IF lc_ReportMode NOT = lncc_Y
068210120827            EXEC SQL
068220120827              UPDATE MFATRNQAP TRNQAP
068230120827              SET TRNQAP.Year =
068240120827              (SELECT  SUBSTR(DEC(TBL4.EVTDTE),1,4)
068250120827               FROM QTEMP/EAPPSETBL4 TBL4
068260120827               WHERE
068270120827                TRNQAP.Account_No             = TBL4.ACCTNO
068280120827                AND TRNQAP.Placement_Date     = TBL4.PLCDTE
068290120827                AND TRNQAP.Trans_No           = TBL4.TRNSNO
068300120827                AND TRNQAP.Beneficiary_Seq_No = TBL4.BENSEQNO)
068310120827              WHERE EXISTS
068320120827      * RFS84977 - Link files using inner joins
06833012082784977 *       (SELECT 1 FROM MFATRNQAP A, EAPPSETBL4 B
068340120827              (SELECT 1 FROM MFATRNQAP A
068350120827               INNER JOIN EAPPSETBL4 B ON
068360120827                    A.Account_No         = B.ACCTNO
068370120827                AND A.Placement_Date     = B.PLCDTE
068380120827                AND A.Trans_No           = B.TRNSNO
068390120827                AND A.Beneficiary_Seq_No = B.BENSEQNO
068400120827      * RFS84977 - Ends
068410120827               WHERE
068420120827                A.Account_No             = TRNQAP.Account_No
068430120827                AND A.Placement_Date     = TRNQAP.Placement_Date
068440120827                AND A.Trans_No           = TRNQAP.Trans_No
068450120827                AND A.Beneficiary_Seq_No = TRNQAP.Beneficiary_Seq_No
06846012082784977 *         AND A.Account_No         = B.ACCTNO
06847012082784977 *         AND A.Placement_Date     = B.PLCDTE
06848012082784977 *         AND A.Trans_No           = B.TRNSNO
06849012082784977 *         AND A.Beneficiary_Seq_No = B.BENSEQNO)
06850012082784977           )
068510121001      * RFS107668 - Start
068520121001      *     END-EXEC.
068530121001            END-EXEC
068540121001           END-IF.
06855012082772749 * Ends
068560121001      * RFS107668 - End
068570120827
068580120827      * RFS 78268 - Start
068590120827      * =================new insertion of EAPPSETBL4 =====
068600120827
068610120827           EXEC SQL
068620120827             INSERT INTO QTEMP/EAPPSETBL4
068630120827              SELECT
068640120827                TRNQAP.Account_No,
068650120827                TRNQAP.Placement_Date,
068660120827                TRNQAP.Trans_No,
068670120827                TRNQAP.Beneficiary_Seq_No,
068680120827               DECIMAL(
068690120827                 CASE
068700120827                 WHEN TRNRRP.Repayment_Reason_Code = 22
068710120827                      AND TRNRRP.Year <> 0
068720120827                      THEN (TRNRRP.Year * 10000 + 1231)
068730120827                 WHEN TRNRRP.Repayment_Reason_Code = 22
068740120827                      AND TRNRRP.Year = 0
068750120827                      THEN
068760120827                       SUBSTR(DEC(TRANS.Trade_Date),1,4) * 10000 + 1231
068770120827                 ELSE
068780120827                  TRANS.Trade_Date
068790120827                END,9),
068800120827                CNTRRP.Contr_Redem_Code_Rule,
068810120827                ACCTYP.Account_Type_Rule,
068820120827                CHAR(
068830120827                CASE
068840120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "29"
068850120827                      AND ACCTYP.Account_Type_Rule = "4"
068860120827                      THEN
068870120827                       CHAR(COALESCE
068880120827                          (digits(TRNRRP.Repayment_Reason_Code), " "))
068890120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "11"
068900120827                      AND ACCTYP.Account_Type_Rule = "4"
068910120827                      THEN
068920120827                      "24"
068930120827                 ELSE "  "
068940120827                END,2),
068950120827                0,
068960120827                0,
068970120827                0,
068980120827                CHAR("Y",1),
068990120827                CHAR("Y",1),
069000120827                CHAR
069010120827                (CASE
069020120827                  WHEN TRNQAP.Mrq_Approval_Status
069030120827                       IN (:lncc_O, :lncc_M, :lncc_C)
069040120827                       THEN TRNQAP.Mrq_Approval_Status
069050120827                   ELSE " "
069060120827                  END,1),
069070120827                TRNQAP.MRQ_File_Date
069080120827
069090120827      * TRANS-RESP-MRQ-APPROVAL
069100120827             FROM      MFATRNQAP  TRNQAP
069110120827      * Exclude accounts with account attribute code NMRQ
069120120827             EXCEPTION JOIN MFAACCATP ACCATP ON
069130120827                       ACCATP.Account_No = TRNQAP.Account_No
069140120827             AND       ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
069150120827      *MFATRNTGP
069160120827             JOIN      MFATRNTGP TGP ON
069170120827                       TRNQAP.Placement_Date = TGP.Placement_Date
069180120827             AND       TRNQAP.Trans_No       = TGP.Trans_No
069190120827             AND       TGP.Relationship_Type = :Lncc_RVS
069200120827      * MFATRNQAP
069210120827             LEFT JOIN MFATRNQAP QAP2 ON
069220120827                       TGP.Placement_Date    = TRNQAP.Placement_Date
069230120827                  AND  TGP.Trans_No_2        = QAP2.Trans_No
069240120827                  AND  TRNQAP.Beneficiary_Seq_No =
069250120827                       QAP2.Beneficiary_Seq_No
069260120827      * ACCOUNT
069270120827             LEFT JOIN MFAACCNTP ACCNTP ON
069280120827                       TRNQAP.Account_No = ACCNTP.Account_No
069290120827      * ACCOUNT-TYPE
069300120827                  JOIN MFAACCTYP ACCTYP ON
069310120827                       ACCNTP.Account_Type_Code =
069320120827                       ACCTYP.Account_Type_Code
069330120827      * TRANS-RESP-REPAYMENT-DTL
069340120827                  JOIN MFATRNRRP TRNRRP ON
069350120827                       TRNQAP.Placement_Date = TRNRRP.Placement_Date
069360120827                  AND  TRNQAP.Trans_No = TRNRRP.Trans_No
069370120827      * TRANS
069380120827                  JOIN MFATRNP TRANS ON
069390120827                       TRNQAP.Account_No = TRANS.Account_No
069400120827                   AND TRNQAP.Placement_Date = TRANS.Placement_Date
069410120827                   AND TRNQAP.Trans_No = TRANS.Trans_No
069420120827      * CONTR-REDEM-CODE-RULES
069430120827                  JOIN MFACNTRRP CNTRRP ON
069440120827                       ACCNTP.Account_Type_Code =
069450120827                       CNTRRP.Account_Type_Code
069460120827                   AND TRANS.Contr_Redem_Code = CNTRRP.Contr_Redem_Code
069470120827      * TRANS-RESP-DETAILS
069480120827                  JOIN MFATRNRFP TRNRFP ON
069490120827                       TRANS.Account_No = TRNRFP.Account_No
069500120827                   AND TRANS.Placement_Date = TRNRFP.Placement_Date
069510120827                   AND TRANS.Trans_No = TRNRFP.Trans_No
069520120827      * ACCOUNT-BENEFICIARY-SPLIT
069530120827             JOIN      MFAACCBPP ACCBPP ON
069540120827                       TRNRFP.Account_No = ACCBPP.Account_No
069550120827                   AND TRNRFP.Beneficiary_Split_Code =
069560120827                       ACCBPP.Beneficiary_Split_Code
069570120827                   AND TRNRFP.HRDC_File_Date = ACCBPP.HRDC_File_Date
069580120827                   AND TRNQAP.Beneficiary_Seq_No =
069590120827                       ACCBPP.Beneficiary_Seq_No
069600120827             WHERE
069610120827                 CNTRRP.Contr_Redem_Code_Rule IN ("29")
069620120827                 AND ACCTYP.Account_Type_Rule = "4"
069630120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
069640180925004139*          AND TRANS.Reverse <> "Y"
069650180925004139           AND (TRANS.Reverse <> "Y" OR
069660180925004139                (TRANS.Reverse = "Y" AND
069670180925004139                 TRNQAP.Mrq_Approval_Status = "C"))
069680120827                 AND QAP2.Placement_date is null
069690120827                 AND TRNQAP.MRQ_File_Date <> :lnci_0
069700120827
069710120827      * RFS105558 - Start
069720120827      *RFS104390 Starts
069730120827      *          AND (TRNQAP.Mrq_Approval_Status = "P"
069740120827      *          AND (TRNQAP.Mrq_Approval_Status
069750120827      *               NOT IN(:Lncc_U, :Lncc_S)
069760120827      *RFS104390 Ends
069770120827      *          AND ((SUBSTR(DEC(TRANS.Trade_Date),1,4)
069780120827      *          BETWEEN :li_Year1 AND :li_Year2)
069790120827      *          OR (TRNRRP.Year BETWEEN :li_Year1 AND :li_Year2)))
069800120827                 AND TRNQAP.Mrq_Approval_Status NOT IN ("E","S",:lncc_U)
069810120827      * RFS105558 - end
069820120827
069830120827           END-EXEC.
069840120827
069850120827
069860120827           EXEC SQL
069870120827             CREATE TABLE QTEMP/EAPPSESUM2
069880120827              (ACCTNO     NUMERIC ( 9) NOT NULL WITH DEFAULT,
069890120827               BENSEQNO   NUMERIC ( 3) NOT NULL WITH DEFAULT,
069900120827               EVTDTE     DECIMAL ( 9) NOT NULL WITH DEFAULT,
069910120827               CRCRULE    CHAR    ( 2) NOT NULL WITH DEFAULT,
069920120827               ACTTYPR    CHAR    ( 1) NOT NULL WITH DEFAULT,
069930120827               TAXREAS    CHAR    ( 2) NOT NULL WITH DEFAULT
069940120827               )
069950120827           END-EXEC
069960120827
069970120827            EXEC SQL
069980120827              INSERT   INTO QTEMP/EAPPSESUM2
069990120827              (SELECT  ACCTNO,BENSEQNO,EVTDTE,CRCRULE,ACTTYPR,TAXREAS
070000120827              FROM     EAPPSETBL4
070010120827              GROUP BY
070020120827                       ACCTNO,BENSEQNO,EVTDTE,CRCRULE,ACTTYPR,TAXREAS)
070030120827            END-EXEC
070040120827
070050120827      * ===already filed to MRQ ===new insertion to EAPPSETBL4
070060120827
070070120827           EXEC SQL
070080120827             INSERT INTO QTEMP/EAPPSETBL4
070090120827              SELECT
070100120827                TRNQAP.Account_No,
070110120827                TRNQAP.Placement_Date,
070120120827                TRNQAP.Trans_No,
070130120827                TRNQAP.Beneficiary_Seq_No,
070140120827               DECIMAL(
070150120827                CASE
070160120827                 WHEN TRNRRP.Repayment_Reason_Code = 22
070170120827                      AND TRNRRP.Year <> 0
070180120827                      THEN (TRNRRP.Year * 10000 + 1231)
070190120827                 WHEN TRNRRP.Repayment_Reason_Code = 22
070200120827                      AND TRNRRP.Year = 0
070210120827                      THEN
070220120827                       SUBSTR(DEC(TRANS.Trade_Date),1,4) * 10000 + 1231
070230120827                 ELSE
070240120827                  TRANS.Trade_Date
070250120827                END,9),
070260120827                CNTRRP.Contr_Redem_Code_Rule,
070270120827                ACCTYP.Account_Type_Rule,
070280120827                CHAR(
070290120827                CASE
070300120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "29"
070310120827                      AND ACCTYP.Account_Type_Rule = "4"
070320120827                      THEN
070330120827                       CHAR(COALESCE
070340120827                          (digits(TRNRRP.Repayment_Reason_Code), " "))
070350120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "11"
070360120827                      AND ACCTYP.Account_Type_Rule = "4"
070370120827                      THEN
070380120827                      "24"
070390120827                 ELSE "  "
070400120827                END,2),
070410120827                0,
070420120827                DECIMAL(
070430120827                CASE
070440120827                 WHEN CNTRRP.Contr_Redem_Code_Rule = "29"
070450120827                      AND ACCTYP.Account_Type_Rule = "4"
070460120827                      THEN
070470120827106265*               DEC(ROUND(TRANS.Gross_Amt *
070480120827106265                DEC(ROUND(TRANS.Net_Amt   *
070490120827                      (ACCBPP.Beneficiary_Percent / 100.00) ,2), 9, 2)
070500120827                 ELSE 0
070510120827                END,9,2),
070520120827                DECIMAL(
070530120827                CASE
070540120827                 WHEN TRNRRP.Repayment_Reason_Code IN (51 , 91)
070550120827                      AND TRNQAP.MRQ_Approval_Status = :lncc_Unfiled
070560120827                      THEN
070570120827                      DEC(ROUND(TRNRRP.Repayment_Specific_Amt *
070580120827                      (ACCBPP.Beneficiary_Percent / 100.00) ,2), 9, 2)
070590120827                 WHEN TRNRRP.Repayment_Reason_Code IN (51 , 91)
070600120827                      AND TRNQAP.MRQ_Approval_Status = :lncc_Refiling
070610120827                      THEN
070620120827                      TRNQAP.Repayment_Specific_Amt
070630120827                 ELSE 0
070640120827                END,9,2),
070650120827                CHAR("N",1),
070660121001      * RFS107668 - Start
070670121001                CASE WHEN (:lc_ReportMode = :lncc_Y)
070680121001                     THEN CHAR("N",1)
070690121001                ELSE
070700121001      *         CHAR("Y",1),
070710121001                CHAR("Y",1)
070720121001                END,
070730121001                CASE WHEN (:lc_ReportMode = :lncc_Y)
070740121001                     THEN "U"
070750121001                ELSE
070760121001      * RFS107668 - End
070770120827                CHAR
070780120827                (CASE
070790120827                  WHEN TRNQAP.Mrq_Approval_Status
070800120827                       IN (:lncc_O, :lncc_M, :lncc_C)
070810120827                       THEN TRNQAP.Mrq_Approval_Status
070820120827                   ELSE " "
070830121001      * RFS107668 - Start
070840121001      *           END,1),
070850121001                  END,1)
070860121001                END,
070870121001      * RFS107668 - End
070880120827                TRNQAP.MRQ_File_Date
070890120827
070900120827      * TRANS-RESP-MRQ-APPROVAL
070910120827             FROM MFATRNQAP  TRNQAP
070920120827      * Exclude accounts with account attribute code NMRQ
070930120827             EXCEPTION JOIN MFAACCATP ACCATP ON
070940120827                 ACCATP.Account_No = TRNQAP.Account_No
070950120827             AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
070960120827      * ACCOUNT
070970120827             LEFT JOIN MFAACCNTP ACCNTP ON
070980120827                 TRNQAP.Account_No = ACCNTP.Account_No
070990120827      * ACCOUNT-TYPE
071000120827             JOIN MFAACCTYP ACCTYP ON
071010120827                 ACCNTP.Account_Type_Code = ACCTYP.Account_Type_Code
071020120827      * TRANS-RESP-REPAYMENT-DTL
071030120827             JOIN MFATRNRRP TRNRRP ON
071040120827                  TRNQAP.Placement_Date = TRNRRP.Placement_Date
071050120827              AND TRNQAP.Trans_No = TRNRRP.Trans_No
071060120827      * TRANS
071070120827             JOIN MFATRNP TRANS ON
071080120827                 TRNQAP.Account_No = TRANS.Account_No
071090120827             AND TRNQAP.Placement_Date = TRANS.Placement_Date
071100120827             AND TRNQAP.Trans_No = TRANS.Trans_No
071110120827      * EAPPSESUM2
071120120827             JOIN EAPPSESUM2 SUM2 ON
071130120827                  TRNQAP.Account_No = SUM2.ACCTNO
071140120827              AND TRNQAP.Beneficiary_Seq_No = SUM2.BENSEQNO
071150120827              AND TRNRRP.Repayment_Reason_Code = SUM2.TAXREAS
071160120827              AND ((TRNRRP.Repayment_Reason_Code = "22"
071170120827                    AND  TRNQAP.YEAR =
071180120827                    ZONED(SUBSTR(DIGITS(EVTDTE),1,4),4,0))
071190120827                                OR
071200120827                   (TRNRRP.Repayment_Reason_Code <> "22"
071210120827                    AND  TRANS.Trade_Date = EVTDTE))
071220120827      * CONTR-REDEM-CODE-RULES
071230120827             JOIN MFACNTRRP CNTRRP ON
071240120827                 ACCNTP.Account_Type_Code = CNTRRP.Account_Type_Code
071250120827             AND TRANS.Contr_Redem_Code = CNTRRP.Contr_Redem_Code
071260120827      * TRANS-RESP-DETAILS
071270120827             JOIN MFATRNRFP TRNRFP ON
071280120827                 TRANS.Account_No = TRNRFP.Account_No
071290120827             AND TRANS.Placement_Date = TRNRFP.Placement_Date
071300120827             AND TRANS.Trans_No = TRNRFP.Trans_No
071310120827      * ACCOUNT-BENEFICIARY-SPLIT
071320120827             JOIN MFAACCBPP ACCBPP ON
071330120827                 TRNRFP.Account_No = ACCBPP.Account_No
071340120827             AND TRNRFP.Beneficiary_Split_Code =
071350120827                 ACCBPP.Beneficiary_Split_Code
071360120827             AND TRNRFP.HRDC_File_Date = ACCBPP.HRDC_File_Date
071370120827             AND TRNQAP.Beneficiary_Seq_No =
071380120827                 ACCBPP.Beneficiary_Seq_No
071390120827             WHERE
071400120827                 CNTRRP.Contr_Redem_Code_Rule IN ("29")
071410120827                 AND ACCTYP.Account_Type_Rule = "4"
071420120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
071430120827
071440120827      * RFS105558 - Start
071450120827      *          AND TRANS.Reverse <> "Y"
071460120827      *          AND (TRNQAP.Mrq_Approval_Status
071470120827      *              NOT IN (:lncc_Refiling, :lncc_Unfiled)
071480120827      *                 :Lncc_O, :Lncc_M, :Lncc_C)
071490120827      *          AND ((SUBSTR(DEC(TRANS.Trade_Date),1,4)
071500120827      *          BETWEEN :li_Year1 AND :li_Year2)
071510120827      *          OR (TRNRRP.Year BETWEEN :li_Year1 AND :li_Year2)))
071520180925004139*          AND TRANS.Reverse <> "Y"
071530180925004139           AND (TRANS.Reverse <> "Y" OR
071540180925004139                (TRANS.Reverse = "Y" AND
071550180925004139                 TRNQAP.Mrq_Approval_Status = "C"))
071560121001      * RFS107668 - Start
071570121001              AND((:lc_ReportMode = :lncc_Y          AND
071580130201      * RFS118702 - Start
071590130201      *           TRNQAP.MRQ_File_Date > lnci_0)
071600130201                  TRNQAP.MRQ_File_Date > :lnci_0)
071610130201      * RFS118702 - End
071620121001              OR (:lc_ReportMode <> :lncc_Y
071630121001      * RFS107668 - End
071640121001                 AND TRNQAP.Mrq_Approval_Status
071650120827                 NOT IN (:lncc_Refiling, :lncc_Unfiled)
071660121001107668           ))
071670120827      * RFS105558 - End
071680120827      * RFS 109558d - Begins - Do not add details that already exist
071690120827                 AND NOT EXISTS
071700120827                 (SELECT 1
071710120827                    FROM EAPPSETBL4 TBL4
071720120827                   WHERE TBL4.PLCDTE      = TRNQAP.Placement_Date
071730120827                     AND TBL4.TRNSNO      = TRNQAP.Trans_No
071740120827                     AND TBL4.BENSEQNO    = TRNQAP.Beneficiary_Seq_No
071750120827                   )
071760120827      * RFS 109558d - Ends
071770120827           END-EXEC.
071780120827
071790120827      * RFS 78268 - End
071800120827
071810120827      * RFS92917 - START
071820120827      *Moved the below commented code to Initial_Steps para
071830120827      *    EXEC SQL
071840120827      *      CREATE TABLE QTEMP/EAPPSETBL5
071850120827      *       (ACCTNO     NUMERIC ( 9) NOT NULL WITH DEFAULT,
07186012082790545 *        BENSEQNO   NUMERIC ( 2) NOT NULL WITH DEFAULT,
07187012082790545 *        BENSEQNO   NUMERIC ( 3) NOT NULL WITH DEFAULT,
07188012082772749 *        YEAR       NUMERIC ( 4) NOT NULL WITH DEFAULT,
07189012082772749 *        TRDDATE    DECIMAL ( 9) NOT NULL WITH DEFAULT,
07190012082772749 *        EVTDTE     DECIMAL ( 9) NOT NULL WITH DEFAULT,
071910120827      *        CRCRULE    CHAR    ( 2) NOT NULL WITH DEFAULT,
071920120827      *        TAXREAS    CHAR    ( 2) NOT NULL WITH DEFAULT,
071930120827      *        GRSAMT1    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
071940120827      *        GRSAMT2    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
071950120827      *        GRSAMT3    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
071960120827      * 78268 Begin
071970120827      *        RVSL       CHAR    ( 1) NOT NULL WITH DEFAULT,
071980120827      *        CANCEL     CHAR    ( 1) NOT NULL WITH DEFAULT,
071990120827      *        MRQAPRSTAT CHAR    ( 1) NOT NULL WITH DEFAULT,
072000120827      *        MRQFILEDT  NUMERIC ( 8) NOT NULL WITH DEFAULT
072010120827      * 78268 End
072020120827      *       )
072030120827      *    END-EXEC.
072040120827      * RFS92917 - END
072050120827
072060120827           EXEC SQL
072070120827             INSERT INTO QTEMP/EAPPSETBL5
072080120827              SELECT
072090120827                TBL4.ACCTNO,
072100120827                TBL4.BENSEQNO,
07211012082772749 *         TBL4.YEAR,
07212012082772749 *         TBL4.TRDDATE,
07213012082772749           TBL4.EVTDTE,
072140120827                TBL4.CRCRULE,
072150120827                TBL4.TAXREAS,
072160120827                ROUND(SUM(TBL4.GRSAMT1),2),
072170120827                ROUND(SUM(TBL4.GRSAMT2),2),
072180120827                ROUND(SUM(TBL4.GRSAMT3),2),
072190120827      * RFS 78268 - Start
072200120827                MAX(TBL4.RVSL),
072210120827                MAX(TBL4.CANCEL),
072220120827                MAX(TBL4.MRQAPRSTAT),
072230120827                MAX(TBL4.MRQFILEDT)
072240120827      * RFS 78268 - End
072250120827
072260120827      * EAP PSE Table 4
072270120827             FROM EAPPSETBL4 TBL4
072280120827
072290120827             GROUP BY
072300120827                TBL4.ACCTNO,
072310120827                TBL4.BENSEQNO,
07232012082772749 *         TBL4.YEAR,
07233012082772749 *         TBL4.TRDDATE,
07234012082772749           TBL4.EVTDTE,
072350120827                TBL4.CRCRULE,
072360120827                TBL4.TAXREAS
072370120827             ORDER BY
072380120827                TBL4.ACCTNO,
072390120827                TBL4.BENSEQNO,
07240012082772749 *         TBL4.YEAR,
07241012082772749 *         TBL4.TRDDATE,
07242012082772749           TBL4.EVTDTE,
072430120827                TBL4.CRCRULE,
072440120827                TBL4.TAXREAS
072450120827           END-EXEC.
072460120827
072470120827      *---------------------
072480120827       CreateType06Cursor.
072490120827      *---------------------
072500120827           EXEC SQL
072510120827           DECLARE Type06_Cursor CURSOR FOR
072520120827             SELECT DISTINCT
072530120827                :lnci_06,
072540120827                :lnci_0,
072550120827                :lc_Header_PromoterID,
072560120827                ACBIRP.Account_No,
072570120827                Coalesce(RESPTP.Specimen_Plan_No,"0"),
072580120827      * Event Date
072590120827                ((ACBIRP.Year * 10000) + 1231),
072600120827      * Amount of Contributions Withdrawn (must be sent > 0)
07261012082774636 *         (ACBIRP.YTD_Amount + ACBIRP.YTD_Transfer_Amount) * -1,
07262012082774636 *90105    ABSVAL(ACBIRP.YTD_Amount + ACBIRP.YTD_Transfer_Amount),
07263012082790105           ABSVAL(IQENOT.CAPITAL_Amount),
072640120827      * Amount of IQEE Refunded
072650120827      * 96990.2 - begins.
072660120827      *         0,
072670120827                IQENOT.IQEE_Repaid,
072680120827      * 96990.2 - ends.
072690120827      * Write Off Amount
072700120827                0,
072710120827      * ln_C6_IQEE_Tot_Contr_Amt, ln_C6_Fair_Mkt_Amt, ln_C6_CLB_Amt,
072720120827      * ln_C6_Cdn_Grant_Amt, ln_C6_IQEE_Balance not required (RFS58589)
072730120827                0,
072740120827                0,
072750120827                0,
072760120827                0,
072770120827                0,
072780120827                ACCBNP.Social_Insurance_No,
072790120827                ACCBNP.Last_Name,
072800120827                ACCBNP.First_Name,
072810120827                ACCBNP.Date_Of_Birth,
072820120827                CASE
072830120827                 WHEN ACCBNP.Sex = "F" THEN 1
072840120827                 WHEN ACCBNP.Sex = "M" THEN 2
072850120827                 ELSE 0
072860120827                END,
07287012082790105 *         "23",
07288012082790105           IQENOT.Resultant_Reason,
072890120827104430*         :lncc_Spaces_Postal_Code,
072900120827104430          IQENOT.EDUCATIONAL_INST_POSTAL_CODE,
072910120827                :lncc_Spaces_Inst_Name,
072920160219145606          :lncc_Spaces_49,
072930160219145606          :lncc_Spaces_15,
072940120827      * RFS 78268 - Start
072950120827                ACBIRP.Beneficiary_Seq_No,
072960120827                CHAR(:Lncc_N,1),
072970121001      *107668 - Start
072980121001                CASE WHEN (:lc_ReportMode = :lncc_Y)
072990121001                     THEN CHAR(:Lncc_N,1)
073000121001                ELSE
073010121001      *107668 - End
073020120827                CHAR(
073030120827                CASE
073040120827                WHEN ACBIRP.mrq_Approval_Status
073050120827                     IN (:lncc_O, :lncc_M, :lncc_C)
073060120827                THEN :Lncc_Y
073070120827                ELSE :Lncc_N
073080121001      *RFS107668 - Start
073090121001      *         END,1),
073100121001                END,1)
073110121001                END,
073120121001                CASE WHEN (:lc_ReportMode = :lncc_Y)
073130121001                     THEN :Lncc_U
073140121001                ELSE ACBIRP.MRQ_Approval_Status
073150121001                END,
073160121001      *         ACBIRP.MRQ_Approval_Status,
073170121001      *RFS107668 - End
073180120827                ACBIRP.MRQ_File_Date,
073190120827      * RFS 78268 - End
073200120827                :lncc_Spaces_C6
073210120827
073220120827      * ACC-BEN-IQEE-REQUEST-APP
073230120827             FROM MFAACBIRP  ACBIRP
073240120827
07325012082790105 * WKIQENOT
07326012082790105        INNER JOIN WKIQENOT IQENOT ON
07327012082790105         ACBIRP.ACCOUNT_NO = IQENOT.ACCOUNT_NO AND
07328012082790105         ACBIRP.BENEFICIARY_SEQ_NO = IQENOT.BENEFICIARY_SEQ_NO
07329012082790105         AND ACBIRP.YEAR = IQENOT.YEAR
073300120827
073310120827      * Exclude accounts with account attribute code NMRQ
073320120827             EXCEPTION JOIN MFAACCATP ACCATP ON
073330120827                 ACCATP.Account_No = ACBIRP.Account_No
073340120827             AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
073350120827      * ACCOUNT
073360120827             JOIN MFAACCNTP ACCNTP ON
073370120827                 ACBIRP.Account_No = ACCNTP.Account_No
073380120827      * ACCOUNT-RESP
073390120827             JOIN MFAACCESP ACCESP ON
073400120827                 ACBIRP.Account_No = ACCESP.Account_No
073410120827      * RESP-TYPE-SPECIMEN-PLAN
073420120827             LEFT OUTER JOIN MFARESPTP RESPTP ON
073430120827                 ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code
073440120827             AND ACCESP.Resp_Type_Code = RESPTP.Resp_Type_Code
073450120827      * ACCOUNT-BENEFICIARY
073460120827             JOIN MFAACCBNP ACCBNP ON
073470120827                 ACBIRP.Account_No = ACCBNP.Account_No
073480120827             AND ACBIRP.Beneficiary_Seq_No = ACCBNP.Beneficiary_Seq_No
073490120827             WHERE
07350012082790105 *         ACBIRP.Record_Type_2 = :lncc_06
07351012082790105 *         AND (ACBIRP.Mrq_Approval_Status
073520120827
073530120827      * RFS105558 - Start
07354012082790105 *             (ACBIRP.Mrq_Approval_Status
073550120827      * RFS 78268 - Start
073560120827      *              IN (:lncc_Refiling, :lncc_Unfiled)
073570120827      *              IN (:lncc_Refiling, :lncc_Unfiled,
073580120827      *                  :lncc_O, :lncc_M, :lncc_C)
073590120827      * RFS 78268 - End
073600120827      *          AND ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2)
073610121006      * RFS 107668 - Start
073620121006               ((:lc_ReportMode = :lncc_Y  AND
073630121006                ((ACBIRP.Year BETWEEN :li_ProcessFilingYear AND
073640121006                 :li_Year2)
073650121006                 AND
073660121006                 ACBIRP.MRQ_FILE_DATE > :lnci_0)) OR
073670121006               (:lc_ReportMode <> :lncc_Y AND
073680121006      * RFS 107668 - End
073690120827               ((ACBIRP.Mrq_Approval_Status
073700120827                 IN (:lncc_Refiling, :lncc_Unfiled)
073710120827      * RFS109131 - Start
073720120827      *          AND ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2)
073730120827                 AND ACBIRP.Year <= :li_Year2)
073740120827      * RFS109131 - End
073750120827                 OR (ACBIRP.Mrq_Approval_Status
073760120827                 IN (:lncc_O, :lncc_M, :lncc_C)))
073770120827      * RFS105558 - End
073780120827
073790121006                 AND IQENOT.Resultant_Reason IN  ("22","23","24")
07380012082790105            AND IQENOT.Rec_Type_2 = :lncc_06
073810121006107668         ))
073820120827             UNION
073830120827
073840120827             SELECT DISTINCT
073850120827                :lncc_06,
073860120827                :lnci_0,
073870120827                :lc_Header_PromoterID,
073880120827                TBL5.ACCTNO,
073890120827                Coalesce(RESPTP.Specimen_Plan_No,"0"),
073900120827      * Event Date
07391012082772749           TBL5.EVTDTE,
07392012082772749 *         CASE
07393012082772749 *          WHEN TBL5.YEAR > 0
07394012082772749 *               AND TBL5.YEAR <>
07395012082772749 *               SUBSTR(DEC(TBL5.TRDDATE),1,4)
07396012082772749 *               THEN
07397012082772749 *               ((TBL5.YEAR * 10000) + 1231)
07398012082772749 *          WHEN TBL5.TAXREAS IN ("22", "23")
07399012082772749 *               THEN
07400012082772749 *               ((SUBSTR(DEC(TBL5.TRDDATE),1,4)) * 10000 + 1231)
07401012082772749 *          ELSE
07402012082772749 *              TBL5.TRDDATE
07403012082772749 *         END,
074040120827      * Amount of Contributions Withdrawn
074050120827                TBL5.GRSAMT1,
074060120827      * Amount of IQEE Refunded
074070120827                TBL5.GRSAMT2,
074080120827      * Write Off Amount
074090120827                TBL5.GRSAMT3,
074100120827      * ln_C6_IQEE_Tot_Contr_Amt, ln_C6_Fair_Mkt_Amt, ln_C6_CLB_Amt,
074110120827      * ln_C6_Cdn_Grant_Amt, ln_C6_IQEE_Balance not required (RFS58589)
074120120827                0,
074130120827                0,
074140120827                0,
074150120827                0,
074160120827                0,
074170120827                ACCBNP.Social_Insurance_No,
074180120827                ACCBNP.Last_Name,
074190120827                ACCBNP.First_Name,
074200120827                ACCBNP.Date_Of_Birth,
074210120827                CASE
074220120827                 WHEN ACCBNP.Sex = "F" THEN 1
074230120827                 WHEN ACCBNP.Sex = "M" THEN 2
074240120827                 ELSE 0
074250120827                END,
074260120827                TBL5.TAXREAS,
074270120827                :lncc_Spaces_Postal_Code,
074280120827                :lncc_Spaces_Inst_Name,
074290160219145606          :lncc_Spaces_49,
074300160219145606          :lncc_Spaces_15,
074310120827      * RFS78268 - Start
074320120827                TBL5.BENSEQNO,
074330120827                TBL5.RVSL,
074340120827                TBL5.CANCEL,
074350120827      * RFS103461 - Starts
074360120827      *         TBL5.MRQAPRSTAT,
074370120827                CASE
074380120827                 WHEN  TBL5.MRQAPRSTAT = " "
074390120827                  AND  TBL5.MRQFILEDT  <> 0
074400120827                  AND  TBL5.GRSAMT2    =  0
074410120827                 THEN  :lncc_C
074420120827                 WHEN  TBL5.MRQAPRSTAT = " "
074430120827                  AND  TBL5.MRQFILEDT  <> 0
074440120827                  AND  TBL5.GRSAMT2    <> 0
074450120827                 THEN  :lncc_M
074460120827                 ELSE
074470120827                       TBL5.MRQAPRSTAT
074480120827                END,
074490120827      * RFS103461 - Ends
074500120827                TBL5.MRQFILEDT,
074510120827      * RFS78268 - End
074520120827
074530120827                :lncc_Spaces_C6
074540120827
074550120827      * EAP PSE Table 5
074560120827             FROM EAPPSETBL5 TBL5
074570120827      * ACCOUNT
074580120827             JOIN MFAACCNTP ACCNTP ON
074590120827                 TBL5.ACCTNO = ACCNTP.Account_No
074600120827      * ACCOUNT-RESP
074610120827             JOIN MFAACCESP ACCESP ON
074620120827                 TBL5.ACCTNO = ACCESP.Account_No
074630120827      * RESP-TYPE-SPECIMEN-PLAN
074640120827             LEFT OUTER JOIN MFARESPTP RESPTP ON
074650120827                 ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code
074660120827             AND ACCESP.Resp_Type_Code = RESPTP.Resp_Type_Code
074670120827      * ACCOUNT-BENEFICIARY
074680120827             JOIN MFAACCBNP ACCBNP ON
074690120827                 TBL5.ACCTNO = ACCBNP.Account_No
074700120827             AND TBL5.BENSEQNO = ACCBNP.Beneficiary_Seq_No
074710120827      * 96990.2 - begins.
074720120827             AND TBL5.TAXREAS <> "22"
074730120827      * 96990.2 - ends.
074740120827
074750120827      * RFS92917 - START
074760120827             UNION
074770120827
074780120827             SELECT DISTINCT
074790120827                :lncc_06,
074800120827                :lnci_0,
074810120827                :lc_Header_PromoterID,
074820120827                EXT.AccountNo,
074830120827                Coalesce(RESPTP.Specimen_Plan_No,"0"),
074840120827                EXT.TradeDate,
074850120827                :lnci_0,
074860120827                EXT.QESIAmt,
074870120827                EXT.RepaymentSpecAmt,
074880120827      * ln_C6_IQEE_Tot_Contr_Amt, ln_C6_Fair_Mkt_Amt, ln_C6_CLB_Amt,
074890120827      * ln_C6_Cdn_Grant_Amt, ln_C6_IQEE_Balance not required (RFS58589)
074900120827                0,
074910120827                0,
074920120827                0,
074930120827                0,
074940120827                0,
074950120827                ACCBNP.Social_Insurance_No,
074960120827                ACCBNP.Last_Name,
074970120827                ACCBNP.First_Name,
074980120827                ACCBNP.Date_Of_Birth,
074990120827                CASE
075000120827                 WHEN ACCBNP.Sex = "F" THEN 1
075010120827                 WHEN ACCBNP.Sex = "M" THEN 2
075020120827                 ELSE 0
075030120827                END,
075040120827                EXT.RepaymentReason,
075050120827                :lncc_Spaces_Postal_Code,
075060120827                :lncc_Spaces_Inst_Name,
075070160219145606          :lncc_Spaces_49,
075080160219145606          :lncc_Spaces_15,
075090120827                EXT.BeneficiarySeqNo,
075100120827                :Lncc_N,
075110121001      * RFS107668 - Start
075120121001                CASE WHEN (:lc_ReportMode = :lncc_Y)
075130121001                 THEN :Lncc_N
075140121001                ELSE
075150121001      * RFS107668 - End
075160120827                CASE
075170120827                 WHEN EXT.QESIAmt = 0 AND EXT.MRQFileDate <> 0
075180120827                 THEN :Lncc_Y
075190120827                 ELSE :Lncc_N
075200121001      * RFS107668 - Start
075210121001      *         END
075220121001                END
075230121001                END,
075240121001                CASE WHEN (:lc_ReportMode = :lncc_Y)
075250121001                 THEN :Lncc_U
075260121001                ELSE
075270121001      * RFS107668 - End
075280120827                CASE
075290120827                 WHEN EXT.MRQFileDate <> 0 AND EXT.QESIAmt = 0
075300120827                 THEN :Lncc_C
075310120827                 WHEN EXT.MRQFileDate <> 0 AND EXT.QESIAmt <> 0
075320120827                 THEN :Lncc_M
075330120827dm               ELSE :Lncc_Unfiled
075340121001      * RFS107668 - Start
075350121001      *         END,
075360121001                END
075370121001                END,
075380121001      * RFS107668 - End
075390120827                EXT.MRQFileDate,
075400120827                :lncc_Spaces_C6
075410120827
075420120827             FROM EXTRPYSUM EXT
075430120827      * ACCOUNT
075440120827             JOIN MFAACCNTP ACCNTP ON
075450120827               EXT.AccountNo = ACCNTP.Account_No
075460120827      * Exclude accounts with account attribute code NMRQ
075470120827      *      Added 09/29/11 - Daniel
075480120827             EXCEPTION JOIN MFAACCATP ACCATP ON
075490120827                  ACCATP.Account_No = ACCNTP.Account_No
075500120827                  AND ACCATP.ACCOUNT_ATTRIBUTE_CODE = "NMRQ"
075510120827      * ACCOUNT-RESP
075520120827             JOIN MFAACCESP ACCESP ON
075530120827               EXT.AccountNo = ACCESP.Account_No
075540120827      * RESP-TYPE-SPECIMEN-PLAN
075550120827             LEFT OUTER JOIN MFARESPTP RESPTP ON
075560120827                 ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code
075570120827             AND ACCESP.Resp_Type_Code = RESPTP.Resp_Type_Code
075580120827      * ACCOUNT-BENEFICIARY
075590120827             JOIN MFAACCBNP ACCBNP ON
075600120827               EXT.AccountNo = ACCBNP.Account_No
075610120827             AND EXT.BeneficiarySeqNo= ACCBNP.Beneficiary_Seq_No
075620120827
075630120827      * RFS92917 - END
075640120827
075650120827             FOR FETCH ONLY
075660120827             OPTIMIZE FOR ALL ROWS
075670120827           END-EXEC.
075680120827
075690120827           EXEC SQL
075700120827             OPEN Type06_Cursor
075710120827           END-EXEC.
075720120827           MOVE SQLSTATE   TO WS-SQL-STATES.
075730120827           EXEC SQL
075740120827           WHENEVER NOT FOUND CONTINUE
075750120827           END-EXEC.
075760120827
075770120827      *-------------
075780120827       Create_Type06.
075790120827      *-------------
075800120827
075810120827           INITIALIZE ltb_FetchC6Table.
075820120827           EXEC SQL
075830120827           WHENEVER NOT FOUND CONTINUE
075840120827           END-EXEC.
075850120827
075860120827           EXEC SQL
075870120827              FETCH NEXT FROM Type06_Cursor
075880120827                FOR :lnci_MaxFetchRec ROWS
075890120827              INTO  :ltb_C6Cursor:ltb_Indicators
075900120827           END-EXEC.
075910120827
075920120827           MOVE SQLSTATE TO lc_sqlStates.
075930120827           EVALUATE TRUE
075940120827               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
075950120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
075960120827               WHEN lncc_sqlEnd
075970120827                    SET lb_EndOfCursorTrue TO TRUE
075980120827                    COMPUTE li_NoOfRowsFetched = SQLERRD(3)
075990120827               WHEN OTHER
076000120827                    SET lncc_Err_Fetch TO TRUE
076010120827      * RFS109131 - Start
076020120827      *             MOVE lncc_ErrorFetchingCursor
076030120827                    MOVE lncc_ErrorFetchingCursor_06
076040120827      * RFS109131 - End
076050120827                      TO lc_sqlErrShortDESCR
076060120827                    PERFORM SQLFailProcess
076070120827           END-EVALUATE.
076080120827
076090120827           COMPUTE li_Counter = 1.
076100120827           PERFORM GetNextType06Row   TEST BEFORE
076110120827             UNTIL li_Counter > li_NoOfRowsFetched.
076120120827
076130120827
076140120827      *-----------
076150120827       GetNextType06Row.
076160120827      *-----------
076170120827
076180170308167582     SET Lb_0622CancelledNo  TO TRUE
076190170308167582     SET Lb_0623CancelledNo  TO TRUE
076200170308167582     SET Lb_0624CancelledNo  TO TRUE
076210120827108180     Set Lb_PrevFiled02No TO TRUE.
076220120827109558     SET Lb_Original06FiledNo TO TRUE.
076230120827109558     INITIALIZE    li_AmendTo0FileDate.
076240120827110964     SET Lb_NonCapitalRepaymentNo  TO TRUE.
076250160212148410     SET Lb_BeneChangeNo           TO TRUE.
076260160212148410     SET Lb_CancelFromRecType06    TO TRUE.
076270120827           MOVE ltb_C6Cursor(li_Counter) TO lc_Current_06_Record.
076280141001      * RFS132831 - Begins - Evaluate for 'R'efile status
076290141001           IF lc_F6_MRQ_Approval_Status(li_Counter) = lncc_R
076300141001              PERFORM ResetRefileVariables
076310141001              COMPUTE Li_RefileAccountNo = li_C6_Account_No
076320141001              COMPUTE Li_RefileBeneSeq   = li_C6_Beneficiary_Seq_No
076330141001              COMPUTE Li_RefileYear      = li_C6_Event_Date / 10000
076340141001              COMPUTE Li_RefileYear1231 =
076350141001                      (Li_RefileYear * 10000) + 1231
076360141001              COMPUTE Li_RefileMrqFileDate = li_C6_MRQ_File_Date
076370141001              MOVE Lncc_06 TO Lc_RefileRecType
076380141001              COMPUTE Li_RefileEffectiveDate =  li_C6_Event_Date
076390150128              MOVE lc_C6_Tax_Reason_Code TO Li_RefileReasonCode
076400141001              SET Lb_RefileModeVersion TO TRUE
076410141001              PERFORM GetRefileInfo
076420141001              IF Li_RefileVersion = Lnci_1 OR Lnci_2
076430141001                 SET Lb_RefileModeFileDate TO TRUE
076440150128                 PERFORM GetSuccReflDate
076450141001                 IF Li_RefileSuccessfulMrqFileDate NOT = 0
076460141001                    IF Li_RefileVersion = Lnci_1
076470141001                       MOVE Lncc_C
076480141001                         TO lc_F6_MRQ_Approval_Status(li_Counter)
076490141001                    END-IF
076500141001                    IF Li_RefileVersion = Lnci_2
076510141001                       MOVE Lncc_M
076520141001                         TO lc_F6_MRQ_Approval_Status(li_Counter)
076530141001                    END-IF
076540141001                    COMPUTE li_C6_MRQ_File_Date =
076550141001                            Li_RefileSuccessfulMrqFileDate
076560150205                    COMPUTE li_F6_MRQ_File_Date (li_Counter) =
076570150205                            Li_RefileSuccessfulMrqFileDate
076580141001      *             or leave as is (which is "R" which means original
076590141001      *             will be filed)
076600141001                 END-IF
076610141001              END-IF
076620141001           END-IF.
076630141001      * RFS132831 - Ends
076640120827      * RFS 104214 - Start
076650120827           IF lc_F6_CancelFlag(li_Counter) = lncc_Y AND
076660130201      * RFS116795 - Start
076670130201      *       lc_C6_Tax_Reason_Code = "22" OR "23" OR "24"
076680130201             (lc_C6_Tax_Reason_Code = "22" OR "23" OR "24")
076690130201      * RFS116795 - End
076700120827
076710120827              MOVE li_C6_Account_No         TO Li_LastFiledAccountNo
076720120827              MOVE li_C6_Beneficiary_Seq_no TO Li_LastFiledBeneSeq
076730120827              MOVE li_C6_Event_Date(1:4)    TO Li_LastFiledYear
076740120827              MOVE li_C6_Event_Date         TO Li_LastFiledYear1231
076750120827              PERFORM GetLastFiledData
076760120827           END-IF
076770120827      * RFS 104214 - End
076780120827
076790120827      * RFS 78268 - Start
076800120827           SET  lc_OriginalFound  TO TRUE
076810120827           IF lc_F6_CancelFlag(li_Counter) = lncc_Y
076820120827      *    RFS 104599 - Begins - Trigger cancellation only if last filed
076830120827      *                          was not a stand-alone cancellation
076840120827104214**      AND NOT(Li_LastFiledRecType = "06"
076850120827104214**      AND Li_LastFiledVersion = 1)
076860120827104599*       AND NOT(Li_LastFiledRecType = SPACES)
076870120827      *    RFS 104599 - Ends
076880120827
076890120827             SET  lc_OriginalNotFound  TO TRUE
076900120827             IF lc_C6_Tax_Reason_Code = "22" or "23" or "24"
076910120827      *       RFS78268.33 - Begins - Set AnyOriginal
076920120827      *                     If we find any type of original 02 or 06
076930120827      *                     for cancellation then OriginalFound should be set
076940120827              Set  Lb_AnyOriginalNotFound TO TRUE
076950120827      *       RFS78268.33 - Ends
076960120827              INITIALIZE   lc_Current_02_Record
076970120827              MOVE li_C6_Account_No         TO li_C_Account_No
076980120827              MOVE li_C6_Beneficiary_Seq_No TO li_C_Ben_seq_no
076990120827              MOVE li_C6_Event_Date(1:4)    TO li_C_FilingYear
077000120827              MOVE li_C6_MRQ_File_Date      TO li_C_Mrq_File_Date
077010120827              MOVE lncc_02                  TO li_C_RecordType
077020120827      *RFS104599 Starts
077030120827              IF Li_LastFiledRecType NOT = "06"
077040120827103463           SET  lb_AmendToZeroYes        TO TRUE
077050120827                 PERFORM Generate02Cancellation
077060120827              END-IF
077070120827      *RFS104599 Ends
077080120827103463        SET  lb_AmendToZeroNo         TO TRUE
077090120827              MOVE ltb_C6Cursor(li_Counter) TO lc_Current_06_Record
077100120827      *      RFS103461d - Begins - Move END-IF
077110120827             END-IF
077120120827      *      RFS103461d - End - Move END-IF
077130120827              PERFORM Generate06Cancellation
077140120827      *         RFS78268.33 - Begins - Set OriginalNotFound based on Any
077150120827                IF Lb_AnyOriginalNotFound
077160120827                   SET Lc_OriginalNotFound TO TRUE
077170120827                ELSE
077180120827                   SET Lc_OriginalFound TO TRUE
077190120827                END-IF
077200120827      *         RFS78268.33 - Ends
077210120827      *      RFS103461d - Begins - Move END-IF, add periods
077220120827      *      END-IF
077230120827           END-IF.
077240120827           MOVE ltb_C6Cursor(li_Counter)    TO lc_Current_06_Record.
077250120827      *      RFS103461d - End
077260120827      *106682.5 For requests after 06 Cancellation ONLY we need to pick
077270120827      *up the new amendments
077280120827           IF li_C6_MRQ_File_Date IS NUMERIC
077290120827           EXEC SQL
077300120827                 SELECT COUNT(1)
077310120827                   INTO :li_CANCELLED_ONLY
077320120827                FROM   MFAMRQTXP
077330120827                WHERE  MFAMRQTXP.ACCOUNT_NO = :li_C6_Account_No
077340120827                  AND  MFAMRQTXP.BENEFICIARY_SEQ_NO =
077350120827                                              :li_C6_Beneficiary_Seq_No
077360120827                  AND  MFAMRQTXP.MRQ_FILE_DATE = :li_C6_MRQ_File_Date
077370120827                  AND  MFAMRQTXP.EVENT_DATE = :li_C6_Event_Date
077380120827                  AND  MFAMRQTXP.MRQ_Version_Code =  1
077390120827                  AND  NOT EXISTS
077400120827                        (SELECT 1
077410120827                         FROM   MFAMRQTXP
077420120827                         WHERE  MFAMRQTXP.ACCOUNT_NO = :li_C6_Account_No
077430120827                           AND  MFAMRQTXP.BENEFICIARY_SEQ_NO =
077440120827                                              :li_C6_Beneficiary_Seq_No
077450120827                  AND  MFAMRQTXP.MRQ_FILE_DATE = :li_C6_MRQ_File_Date
077460120827                  AND  MFAMRQTXP.EVENT_DATE = :li_C6_Event_Date
077470120827                  AND  MFAMRQTXP.MRQ_Version_Code <> 1
077480120827                   )
077490120827                        FETCH FIRST ROW ONLY
077500120827           END-EXEC
077510120827
077520120827            MOVE SQLSTATE TO lc_sqlStates
077530120827            IF  lncc_sqlSuccessful
077540120827               SET   lc_OriginalFound    TO TRUE
077550120827            END-IF
077560120827           END-IF
077570120827      *RFS106682.5 end
077580181221
077590181221      *RFS 1007680 START
077600181221106682*    IF lc_OriginalFound
077610120827      *RFS110964 - BEGIN
077620160301      *    RFS143171 - Begins - Allow filing if zero unless Cancellation
077630160301      *    AND NOT (ln_F6_Contr_Withdr_Amt(li_Counter) = 0
077640160301      *    AND ln_F6_IQEE_Refund_Amt(li_Counter) = 0
077650160301      *    AND ln_F6_EAP_WriteOff_Amt (li_Counter) = 0)
077660181221      *    AND NOT (ln_F6_Contr_Withdr_Amt(li_Counter) = 0
077670181221      *    AND ln_F6_IQEE_Refund_Amt(li_Counter) = 0
077680181221      *    AND ln_F6_EAP_WriteOff_Amt (li_Counter) = 0
077690181221      *    AND lc_F6_MRQ_Approval_Status(li_Counter) = lncc_C)
077700160301      *    RFS143171 - Ends
077710120827      *RFS110964 - END
077720181221           IF lc_OriginalFound
077730181221           AND lc_F6_MRQ_Approval_Status(li_Counter) NOT = lncc_C
077740181221           AND ((NOT (ln_F6_Contr_Withdr_Amt(li_Counter) = 0
077750181221           AND ln_F6_IQEE_Refund_Amt(li_Counter) = 0
077760181221           AND ln_F6_EAP_WriteOff_Amt (li_Counter) = 0))
077770181221                OR
077780181221              (ln_F6_Contr_Withdr_Amt(li_Counter) = 0
077790181221           AND ln_F6_IQEE_Refund_Amt(li_Counter) = 0
077800181221           AND ln_F6_EAP_WriteOff_Amt (li_Counter) = 0
077810181221           AND lc_F6_MRQ_Approval_Status(li_Counter) = lncc_M))
077820181221      *RFS 1007680 END
077830181221
077840120827106682*    IF lc_OriginalFound      AND
077850120827      *       lc_F6_MRQ_Approval_Status(li_Counter)  not= lncc_C
077860120827      *RFS104599 Starts
077870120827      *       IF lc_F6_MRQ_Approval_Status(li_Counter) = lncc_M
077880120827104214*          AND NOT(Li_LastFiledRecType = "02")
077890120827109558*       IF (lc_C6_Tax_Reason_Code = lncc_22 AND
077900120827109558        IF ((lc_C6_Tax_Reason_Code = lncc_22 AND
077910120827                  Lb_0622CancelledYes)             OR
077920120827                 (lc_C6_Tax_Reason_Code = lncc_23 AND
077930120827                  Lb_0623CancelledYes)             OR
077940120827                 (lc_C6_Tax_Reason_Code = lncc_24 AND
077950120827                  Lb_0624CancelledYes)            AND
077960120827                  Li_LastFiledVersion NOT = lnci_1
077970120827112178           AND (li_LastFiledSIN = li_C6_Benef_SIN)
077980120827109558            )
077990120827109558            OR
078000120827      * RFS112178 - START
078010120827109558*           Lb_Original06FiledYes
078020120827                 (Lb_Original06FiledYes
078030120827                 AND (li_LastFiledSIN = li_C6_Benef_SIN))
078040120827      * RFS112178 - END
078050120827      *RFS104599 Ends
078060120827      * RFS 112178 - Start
078070120827110964*           OR Lb_NonCapitalRepaymentYes
078080120827                  OR (Lb_NonCapitalRepaymentYes
078090120827                  AND (li_LastFiledSIN = li_C6_Benef_SIN))
078100120827      * RFS 112178 - End
078110120827                 MOVE lnci_2  TO li_C6_Trxn_VersCde
078120120827              END-IF
07813012082792917         INITIALIZE MFAMRQTXP     OF ltr_06FilingLog
078140120827              MOVE li_C6_Account_No TO ACCOUNT-NO OF
078150120827                                       ltr_06FilingLog
078160120827              MOVE li_C6_Beneficiary_Seq_No TO BENEFICIARY-SEQ-NO
078170120827                                          OF ltr_06FilingLog
078180120827              MOVE li_C6_Event_Date       TO EVENT-DATE
078190120827                                          OF ltr_06FilingLog
078200120827              MOVE lc_C6_Tax_Reason_Code  TO SPECIAL-TAX-REASON
078210120827                                          OF ltr_06FilingLog
078220120926      * RFS107668 - Start Updates MRQ-FILE-DATE only if Report <> 'Y'
078230121018              IF lc_ReportMode NOT = lncc_Y
078240120921                MOVE li_AsAtDate            TO MRQ-FILE-DATE
078250120921                                            OF ltr_06FilingLog
078260120921              END-IF
078270120921      *       MOVE li_AsAtDate            TO MRQ-FILE-DATE
078280120921      *                                   OF ltr_06FilingLog
078290120926      * RFS107668 - End
078300120827              MOVE li_C6_Trxn_VersCde     TO MRQ-VERSION-CODE
078310120827                                          OF ltr_06FilingLog
078320120827              MOVE lc_C6_PromoterID       TO VENDOR-BN
078330120827                                          OF ltr_06FilingLog
078340120827              MOVE li_C6_SpecimenPlanNo   TO SPECIMEN-ID
078350120827                                          OF ltr_06FilingLog
078360120827              MOVE ln_C6_Contr_Withdr_Amt TO CONTRIBUTION-WITHDRAWN-AMT
078370120827                                          OF ltr_06FilingLog
078380120827              MOVE ln_C6_IQEE_Refund_Amt  TO IQEE-GRANT-REPAYMENT
078390120827                                          OF ltr_06FilingLog
078400120827              MOVE ln_C6_EAP_WriteOff_Amt TO WRITE-OFF-AMOUNT
078410120827                                          OF ltr_06FilingLog
078420120827              MOVE li_C6_Benef_SIN        TO BEN-SIN
078430120827                                          OF ltr_06FilingLog
078440120827              MOVE lc_C6_Benef_LastName   TO BEN-LAST-NAME
078450120827                                          OF ltr_06FilingLog
078460120827              MOVE lc_C6_Benef_FirstName  TO BEN-FIRST-NAME
078470120827                                          OF ltr_06FilingLog
078480120827              MOVE li_C6_Benef_DOB        TO BEN-DATE-OF-BIRTH
078490120827                                          OF ltr_06FilingLog
078500120827              MOVE li_C6_Benef_Sex        TO BEN-GENDER
078510120827                                          OF ltr_06FilingLog
078520120827              MOVE lc_C6_Tax_Reason_Code  TO SPECIAL-TAX-REASON
078530120827                                          OF ltr_06FilingLog
078540120827              MOVE lncc_P                 TO
078550120827                      MRQ-APPROVAL-STATUS OF ltr_06FilingLog
078560120827104430        MOVE lc_C6_Estb_Postal_Code TO
078570120827104430                EDUCATIONAL-INST-POSTAL-CODE OF
078580120827104430                ltr_06FilingLog
078590160219      *RFS145606 - START
078600160229              PERFORM NewSeqNoGen
078610160219              MOVE lc_mrq_trans_id TO lc_C6_MRQ_Trans_Id
078620160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID OF
078630160219                                      ltr_06FilingLog
078640160219      *RSF145606 - END
078650121005
078660120827              PERFORM  Write06FilingLog
078670120827              MOVE SPACES               TO lc_C6_Filler
078680131008
078690131008
078700160523      * RFS159637 - START
078710131008      * RFS128196 - begins.
078720160523      *       MOVE  lncc_PreScribedForm TO  lc_C6_Filler
078730131008      * RFS128196 - ends.
078740160523              MOVE  lncc_PreScribedForm TO  lc_C6_PrescribdForm
078750160523      * RFS159637 - END
078760131008
078770131008
078780120827      * RFS78268 - Ends
078790140923      *RFS139963 - Begins
078800140923              MOVE lc_Current_06_Record TO lc_Temp_0306_Record
078810140923              MOVE lc_temp_0306_acct TO Li_AccountNo_In
078820140923              PERFORM AccountEdit
078830140923              MOVE Lc_AccountNo_Out  TO lc_temp_0306_acct
078840170124164896        IF  lb_EXTQESIYes
078850170124164896        MOVE lc_Temp_0306_Record TO lc_Current_06_Record_BKP1
078860170125164896        MOVE lc_C6_Tax_Reason_Code TO lc_Tax_Reason_Code
078870170131164896        INITIALIZE li_Tax_Reason_Code
078880170131164896        EXEC SQL
078890170131164896        SET :li_Tax_Reason_Code =
078900170131164896             ZONED(TRIM(:lc_Tax_Reason_Code),2,0)
078910170131164896        END-EXEC
078920170124164896        MOVE lc_Current_06_Record_BKP1 TO lc_RecordToInsert
078930170124164896        ELSE
078940140923              MOVE lc_Temp_0306_Record TO lc_RecordToInsert
078950170124164896        END-IF
078960140923      *       MOVE lc_Current_06_Record TO lc_RecordToInsert
078970140923      *RFS139963 - Ends
078980120827              PERFORM InsertRecord
078990120827R78268        MOVE li_F6_Beneficiary_seq_no(li_Counter) TO
079000120827R78268                                  li_C6_Beneficiary_Seq_No
079010120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
079020120827R78268     END-IF.
079030120827R78268        IF lc_OriginalFound
07904012082774636           INITIALIZE li_YYYYMMDD
079050120827      *    RFS78268 - Begins - Override coding for 96990
07906012082796990 *    IF lc_C6_Tax_Reason_Code = "23"
07907012082796990 *    IF lc_C6_Tax_Reason_Code = Lncc_22 OR Lncc_23 OR Lncc_24
079080120827      *    RFS78268 - Ends
079090120827
079100120827      *    RFS103461 - Begins - Load Current record again for data
079110120827      *                         stored in filler area
079120120827           MOVE ltb_C6Cursor(li_Counter) TO lc_Current_06_Record
079130120827      *    RFS103461 - Ends
079140120827
079150120827                IF lc_C6_Tax_Reason_Code = "23" or "22" or "24"
079160120827                  MOVE li_C6_Account_No to li_C_Account_No
079170120827                  MOVE li_C6_Benef_SIN  to li_C_Benef_SIN
079180120827                  MOVE li_C6_RecordType to li_C_RecordType
07919012082773992             MOVE li_C6_Event_Date to li_YYYYMMDD
07920012082773992             MOVE li_YYYY          to li_C_FilingYear
079210120827                  PERFORM Update_ApprovalStatus
079220120827      * RFS 103461d - Begins - Also update Status for repayments
079230120827                   PERFORM Update_EapPseSts_Type06
079240120827      * RFS 103461d - Begins - Ends
079250120827                ELSE
079260120827                   PERFORM Update_EapPseSts_Type06
079270120827                END-IF
079280120827R78268        END-IF
079290120827              COMPUTE li_Counter = li_Counter + 1.
079300120827
079310120827      * RFS 78268  Start
079320120827
079330120827      *-------------
079340120827       Generate06Cancellation.
079350120827      *-------------
079360120827           MOVE SPACES    TO      lc_flag
079370120827104599     SET Lb_0622CancelledNo  TO TRUE
079380120827104599     SET Lb_0623CancelledNo  TO TRUE
079390120827104599     SET Lb_0624CancelledNo  TO TRUE
079400120827           IF lc_C6_Tax_Reason_Code  =
079410120827               " " OR lncc_22 OR lncc_23 OR lncc_24
079420120827              MOVE lc_Current_06_Record  TO lc_Current_06_Record_BKP
079430120827              MOVE lncc_22  TO lc_C6_Tax_Reason_Code
079440120827              PERFORM Process06Cancellation
079450120827              MOVE lc_Current_06_Record_BKP TO lc_Current_06_Record
079460120827              MOVE lncc_23  TO lc_C6_Tax_Reason_Code
079470120827              PERFORM Process06Cancellation
079480120827              MOVE lc_Current_06_Record_BKP TO lc_Current_06_Record
079490120827              MOVE lncc_24  TO lc_C6_Tax_Reason_Code
079500120827              PERFORM Process06Cancellation
079510120827              IF lc_Flag       =  lncc_Y
079520120827                SET   lc_OriginalFound    TO TRUE
079530120827              END-IF
079540120827           ELSE
079550120827110964        SET Lb_NonCapitalRepaymentYes  TO TRUE
079560120827              PERFORM Process06Cancellation
079570120827           END-IF.
079580120827
079590120827      *-------------
079600120827       Process06Cancellation.
079610120827      *-------------
079620120827           Initialize MFAMRQTXP OF ltr_06FilingLog
079630120827           EXEC SQL
079640120827                SELECT * INTO :MFAMRQTXP
079650120827                FROM   MFAMRQTXP
079660120827                WHERE  MFAMRQTXP.ACCOUNT_NO = :li_C6_Account_No
079670120827                  AND  MFAMRQTXP.BENEFICIARY_SEQ_NO =
079680120827                                              :li_C6_Beneficiary_Seq_No
079690120827                  AND  MFAMRQTXP.MRQ_FILE_DATE = :li_C6_MRQ_File_Date
079700120827                  AND  MFAMRQTXP.EVENT_DATE = :li_C6_Event_Date
079710120827                  AND  MFAMRQTXP.SPECIAL_TAX_REASON =
079720120827                                              :lc_C6_Tax_Reason_Code
079730120827                  AND  MFAMRQTXP.MRQ_Version_Code <> 1
079740120827                        FETCH FIRST ROW ONLY
079750120827           END-EXEC
079760120827
079770120827            MOVE SQLSTATE TO lc_sqlStates.
079780120827            IF  lncc_sqlSuccessful
079790120827               SET   lc_OriginalFound    TO TRUE
079800120827               MOVE  lncc_Y              TO lc_Flag
079810120827            ELSE
079820120827               SET    lc_OriginalNotFound   TO TRUE
079830120827              MOVE SQLSTATE     TO WS-SQLSTATE
079840120827              MOVE SQLCODE      TO WS-DSP-SQLCODE
079850120827              MOVE "MFAMRQTXP " To lncc_FileName
079860120827              MOVE lncc_ErrorFetchingCancel  To
079870120827                                   Ws-Sql-Err-Short-Descr
079880120827              PERFORM DisplayError
079890120827            END-IF.
079900120827           IF lc_OriginalFound
079910120827            MOVE ACCOUNT-NO         OF ltr_06FilingLog
079920120827                                   TO li_C6_Account_No
079930120827           MOVE BENEFICIARY-SEQ-NO OF ltr_06FilingLog
079940120827                                   TO li_C6_Beneficiary_Seq_No
079950120827           MOVE EVENT-DATE         OF ltr_06FilingLog
079960120827                                   TO li_C6_Event_Date
079970120827           MOVE MRQ-FILE-DATE      OF ltr_06FilingLog
079980120827                                   TO li_C6_MRQ_File_Date
079990120827           MOVE lnci_1             TO li_C6_Trxn_VersCde
080000120827
080010120827           MOVE VENDOR-BN          OF ltr_06FilingLog
080020120827                                   TO lc_C6_PromoterID
080030120827           MOVE SPECIMEN-ID        OF ltr_06FilingLog
080040120827                                   TO li_C6_SpecimenPlanNo
080050120827           MOVE CONTRIBUTION-WITHDRAWN-AMT OF ltr_06FilingLog
080060120827                                   TO ln_C6_Contr_Withdr_Amt
080070120827           MOVE IQEE-GRANT-REPAYMENT       OF ltr_06FilingLog
080080120827                                   TO ln_C6_IQEE_Refund_Amt
080090120827           MOVE WRITE-OFF-AMOUNT           OF ltr_06FilingLog
080100120827                                   TO ln_C6_EAP_WriteOff_Amt
080110120827           MOVE lnci_0             TO ln_C6_IQEE_Tot_Contr_Amt
080120120827                                      ln_C6_Fair_Mkt_Val_Amt
080130120827                                      ln_C6_CLB_Amt
080140120827                                      ln_C6_Cdn_Grant_Amt
080150120827                                      ln_C6_IQEE_Balance
080160120827           MOVE BEN-SIN            OF ltr_06FilingLog
080170120827                                      TO li_C6_Benef_SIN
080180120827           MOVE BEN-LAST-NAME      OF ltr_06FilingLog
080190120827                                      TO lc_C6_Benef_LastName
080200120827           MOVE BEN-FIRST-NAME     OF ltr_06FilingLog
080210120827                                      TO lc_C6_Benef_FirstName
080220120827           MOVE BEN-DATE-OF-BIRTH  OF ltr_06FilingLog
080230120827                                      TO li_C6_Benef_DOB
080240120827           MOVE BEN-GENDER         OF ltr_06FilingLog
080250120827                                       TO li_C6_Benef_Sex
080260120827           MOVE SPECIAL-TAX-REASON OF ltr_06FilingLog
080270120827                                      TO lc_C6_Tax_Reason_Code
080280120827104430     MOVE EDUCATIONAL-INST-POSTAL-CODE OF ltr_06FilingLog
080290120827104430                             TO lc_C6_Estb_Postal_Code
080300120827104430     MOVE SPACES             TO lc_C6_Estb_Name
080310120827
080320120827           INITIALIZE   li_MFAMRQTXP-COUNT
080330120827                        lc_CancelField
080340120827           MOVE  lncc_N TO   lc_CancelField
080350120827
080360120827      *Checks to see if there is cancellation done already for the day.
080370120827           EXEC SQL
080380120827                SELECT COUNT(1) INTO :li_MFAMRQTXP-COUNT
080390120827                FROM   MFAMRQTXP
080400120827                WHERE  ACCOUNT_NO         = :li_C6_Account_No
080410120827                  AND  BENEFICIARY_SEQ_NO = :li_C6_Beneficiary_seq_no
080420120827                  AND  EVENT_DATE         = :li_C6_Event_Date
080430120827                  AND  SPECIAL_TAX_REASON = :lc_C6_Tax_Reason_Code
080440120827                  AND  MRQ_FILE_DATE      = :li_AsAtDate
080450120827                  AND  MFAMRQTXP.MRQ_VERSION_CODE = :lnci_1
080460120827      *Select cancellation
080470120827106682*           AND  MFAMRQTXP.MRQ_VERSION_CODE <> :lnci_1
080480120827            END-EXEC
080490120827      *RFS104599 Starts
080500120827           EVALUATE lc_C6_Tax_Reason_Code
080510120827               WHEN lncc_22
080520120827                    Set Lb_0622CancelledYes to TRUE
080530120827               WHEN lncc_23
080540120827                    Set Lb_0623CancelledYes to TRUE
080550120827               WHEN lncc_24
080560120827                    Set Lb_0624CancelledYes to TRUE
080570120827           END-EVALUATE
080580120827      *RFS104599 End
080590120827
080600120827           IF li_MFAMRQTXP-COUNT  > 0
080610120827              MOVE lncc_Y TO   lc_CancelField
080620120827104599        SET Lb_AnyOriginalFound TO TRUE
080630120827           END-IF
080640120827
080650120827           IF lc_CancelField =  lncc_N
080660120827      *       RFS78268.33 - Begins - Set AnyOriginal
080670120827              SET Lb_AnyOriginalFound TO TRUE
080680120827      *       RFS78268.33 - Ends
080690120827              MOVE Spaces               TO lc_C6_Filler
080700131008
080710131008
080720160523      *RFS159637 - START
080730131008      *RFS128196 - begins.
080740160523      *       MOVE  lncc_PreScribedForm TO  lc_C6_Filler
080750131008      *RFS128196 - Ends.
080760160523              MOVE  lncc_PreScribedForm TO  lc_C6_PrescribdForm
080770160523      *RFS159637 - END
080780160219      *RFS145606 - START
080790160229              PERFORM NewSeqNoGen
080800160219              MOVE lc_mrq_trans_id TO lc_C6_MRQ_Trans_Id
080810160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
080820160219                                      OF ltr_06FilingLog
080830160219      *RFS145606 - END
080840131008
080850131008
080860140923      *RFS139963 - Begins
080870141007      *       139963 - dm - Begins  - Wrong record
080880141007      *       MOVE lc_Current_03_Record TO lc_Temp_0306_Record
080890141007              MOVE lc_Current_06_Record TO lc_Temp_0306_Record
080900141007      *       139963 - dm - Ends
080910140923              MOVE lc_temp_0306_acct TO Li_AccountNo_In
080920140923              PERFORM AccountEdit
080930140923              MOVE Lc_AccountNo_Out  TO lc_temp_0306_acct
080940140923              MOVE lc_Temp_0306_Record TO lc_RecordToInsert
080950140923      *       MOVE lc_Current_06_Record TO lc_RecordToInsert
080960140923      *RFS139963 - Ends
080970120827              PERFORM InsertRecord
080980120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
080990120926      * RFS107668 - Start Updates MRQ-FILE-DATE only if Report <> 'Y'
081000121018              IF lc_ReportMode NOT = lncc_Y
081010120921                MOVE  li_AsAtDate TO MRQ-FILE-DATE OF ltr_06FilingLog
081020120921              END-IF
081030120921      *       MOVE  li_AsAtDate TO MRQ-FILE-DATE OF ltr_06FilingLog
081040120926      * RFS107668 - End
081050120827              MOVE  lnci_1      TO MRQ-VERSION-CODE OF ltr_06FilingLog
081060120827      *       RFS78268.17 - Begins - Set the filing status
081070120827              MOVE Lncc_P    TO MRQ-APPROVAL-STATUS OF Ltr_06FilingLog
081080120827      *       RFS78268.17 - Ends
081090120827              PERFORM Write06FilingLog
081100120827104599     END-IF
081110120827104599     END-IF.
081120120827      *-------------
081130120827       Write06FilingLog.
081140120827      *-------------
081150120827
081160120921      * RFS107668 - Start-Writes only if Report mode is not set to 'Y'
081170121018           IF lc_ReportMode NOT = lncc_Y
081180120926      * RFS107668 - End
081190120827      *        RFS78268.25 - Begins - Set the record-type-2
081200120925               MOVE Lncc_06
081210120925                 TO RECORD-TYPE-2
081220120925                    OF Ltr_06FilingLog
081230120827      *        RFS78268.25 - Ends
081240120827
081250120925           EXEC SQL
081260120925                INSERT INTO MFAMRQTXP VALUES(:MFAMRQTXP)
081270120925           END-EXEC
081280120925           MOVE SQLSTATE TO lc_sqlStates
081290120925           IF   NOT lncc_sqlSuccessful
081300120925                SET lncc_Err_I1 TO TRUE
081310120925                MOVE "MFAMRQTXP " TO lncc_InsertFileName
081320120925                MOVE lncc_ErrorInsertingFile TO lc_sqlErrShortDESCR
081330120925                PERFORM SQLFailProcess
081340120926      * RFS107668 - START
081350120926      *    END-IF.
081360120925           END-IF
081370120926      * RFS 78268 - End
081380120921           ELSE
081390121010             INITIALIZE li_Report-Variables
081400121010             MOVE li_C6_RecordType        TO lc_ReportFilingRectype
081410120921             MOVE li_C6_Benef_SIN         TO li_WK-Beneficiary-SIN
081420120921             MOVE li_C6_Benef_DOB         TO li_WK-Beneficiary-DOB
081430120921             MOVE lc_C6_Tax_Reason_Code   TO lc_WK-SpecTaxReasonCode
081440120921             MOVE ln_C6_Contr_Withdr_Amt  TO li_WK-Annual-Request-Amt
081450120921             PERFORM Record_Comparison
081460120921           END-IF.
081470120921      * RFS107668 - End
081480120921
08149012082774636 *Start
081500120827      *-------------
081510120827       Get_PCG_Info.
081520120827      *-------------
081530120827      * Get Primary Caregiver Information from MFAACPCGP
081540120827
081550120827           INITIALIZE LB-EOF-PCG
081560120827                      li_FilingYYYY
081570120827                      li_PCGSeqNo
081580120827                      li_C_PCG_Type_Code
081590120827                      li_C_PCG_SIN
081600120827                      lc_C_PCG_BusinessNo
081610120827                      lc_C_PCG_LastName
081620120827                      lc_C_PCG_FirstName
081630120827                      lc_C_PCG_Name.
081640130110103860     INITIALIZE li_PCG-Seq-No.
081650120827
081660120827            MOVE li_C_FilingYear    TO li_FilingYYYY
08167012082776555       MOVE 1231               TO li_FilingMMDD
081680120827            MOVE li_C_Account_No    TO ACCOUNT-NO OF ACCOUNT-PCG-REC
081690120827            MOVE li_FilingYrEnd     TO START-DATE OF ACCOUNT-PCG-REC
081700130110
081710130110      * RFS 103860 - Start
081720130110            EXEC SQL
081730130110            WHENEVER NOT FOUND CONTINUE
081740130110            END-EXEC.
081750130110
081760130110            EXEC SQL
081770130110              SELECT   ABPCGXP.PCG_SEQ_NO
081780130110              INTO     :li_PCG-Seq-No
081790130110              FROM     MFAABPCGXP ABPCGXP
081800130110              INNER JOIN
081810130110                       MFAACPCGP  ACPCGP
081820130110              ON       ABPCGXP.ACCOUNT_NO = ACPCGP.ACCOUNT_NO
081830130110              AND      ABPCGXP.PCG_SEQ_NO = ACPCGP.PCG_SEQ_NO
081840130110              WHERE    ABPCGXP.Account_No = :li_C_Account_No
081850130110              AND      ABPCGXP.BENEFICIARY_SEQ_NO
081860130110                                          = :li_C_Ben_seq_no
081870130110              AND      ABPCGXP.Start_Date <=
081880130110                                            :li_FilingYrEnd
081890130110              ORDER BY ABPCGXP.START_DATE DESC
081900130206      *       RFS103860 dm 20130206 - Begins
081910130206      *                 EXT client does not provide start date
081920130206      *                 at all.  We want the last seq-no if
081930130206      *                 the dates are the same (0)
081940130206                      ,ABPCGXP.PCG_SEQ_NO DESC
081950130206      *       RFS103860 dm 20130206 - Ends
081960130110              FETCH FIRST ROW ONLY
081970130110            END-EXEC.
081980130110
081990130110            MOVE SQLSTATE TO lc_sqlStates.
082000210511      *RFS1113313 - Starts
082010210511      *     IF not lncc_sqlSuccessful
082020210511            IF not lncc_sqlSuccessful AND not lncc_sqlEnd
082030210511      *RFS1113313 - Ends
082040130110               SET lncc_Err_F1 TO TRUE
082050130110               MOVE "MFAABPCGXP" TO lncc_InsertFileName
082060130110               MOVE lncc_ErrorFetchABPCGXP TO lc_sqlErrShortDESCR
082070130110               PERFORM SQLFailProcess
082080130110            END-IF.
082090130110
082100130110           IF li_PCG-Seq-No > ZERO
082110130110             INITIALIZE MFAACPCGP OF ACCOUNT-PCG-REC
082120130110             EXEC SQL
082130130110               SELECT ACPCGP.*
082140130110
082150130110               INTO :MFAACPCGP
082160130110
082170130110               FROM MFAACPCGP ACPCGP
082180130110
082190130110               WHERE ACPCGP.Account_No  = :li_C_Account_No
082200130110               AND   (ACPCGP.PCG_Seq_No = :li_PCG-Seq-No
082210130110               AND     :li_PCG-Seq-No <> 0)
082220130110               FETCH FIRST ROW ONLY
082230130110             END-EXEC
082240130110
082250130110             MOVE SQLSTATE TO lc_sqlStates
082260130110             IF lncc_sqlEnd
082270130110               SET LB-EOF-PCG-YES TO TRUE
082280130110             ELSE IF not lncc_sqlSuccessful
082290130110               SET lncc_Err_F2 TO TRUE
082300130110               MOVE "MFAACPCGP" TO lncc_InsertFileName
082310130110               MOVE lncc_ErrorFetchACPCGP TO lc_sqlErrShortDESCR
082320130110               PERFORM SQLFailProcess
082330130110             END-IF
082340130110           END-IF.
082350130110      * Wraping the existing Start inside the IF condition
082360130110           IF li_PCG-Seq-No = ZERO
082370130110      * RFS 103860 - End
082380120827            START ACCOUNT-PRIMARY-CARE-GIVER
08239012082776555 *     KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
08240012082776555       KEY IS GREATER THAN EXTERNALLY-DESCRIBED-KEY
082410120827            INVALID KEY
08242012082776555          READ ACCOUNT-PRIMARY-CARE-GIVER LAST RECORD
08243012082776555             AT END
08244012082776555               SET LB-EOF-PCG-YES TO TRUE
08245012082776555          END-READ
082460120827            NOT INVALID KEY
08247012082776555          READ ACCOUNT-PRIMARY-CARE-GIVER
08248012082776555            PRIOR RECORD
08249012082776555             AT END
08250012082776555               SET LB-EOF-PCG-YES TO TRUE
08251012082776555          END-READ
082520130110      * RFS 103860 - Start
082530130110      *     END-START.
082540130110            END-START
082550130110            END-IF.
082560130110      * RFS 103860 - End
082570120827
082580120827      *-------------
08259012082776555 *Read_PCG_Info.
082600120827      *-------------
082610120827
08262012082776555 *     READ ACCOUNT-PRIMARY-CARE-GIVER
08263012082776555 *         PRIOR RECORD
08264012082776555 *      AT END
08265012082776555 *        SET LB-EOF-PCG-YES TO TRUE
08266012082776555 *     END-READ.
082670120827
082680120827            IF NOT LB-EOF-PCG-YES
082690120827               IF ACCOUNT-NO OF ACCOUNT-PCG-REC = li_C_Account_No
082700120827                  MOVE PCG-SEQ-NO of ACCOUNT-PCG-REC TO li_PCGSeqNo
082710120827                  IF PCG-TYPE-CODE of ACCOUNT-PCG-REC = "P"
082720120827                     MOVE 1 TO li_C_PCG_Type_Code
082730120827                  ELSE
082740120827                  IF PCG-TYPE-CODE of ACCOUNT-PCG-REC = "A" OR "E"
082750120827                     MOVE 2 TO li_C_PCG_Type_Code
082760120827                  END-IF
082770120827                  END-IF
08278012082776555             IF li_C_PCG_Type_Code = 1
082790120827                     MOVE SOCIAL-INSURANCE-NO   of ACCOUNT-PCG-REC
082800120827                                             TO li_C_PCG_SIN
082810120827                  ELSE
08282012082776555             IF li_C_PCG_Type_Code = 2
082830120827                     MOVE BUSINESS-NUMBER-REVQ  of ACCOUNT-PCG-REC
082840120827                                             TO lc_C_PCG_BusinessNo
08285012082776555             END-IF
08286012082776555             END-IF
08287012082776555 *           IF li_C_Subsc_Type = 1
08288012082776555             IF li_C_PCG_Type_Code = 1
082890120827                     MOVE LAST-NAME             of ACCOUNT-PCG-REC
082900120827                                                TO lc_C_PCG_LastName
082910120827                     MOVE FIRST-NAME            of ACCOUNT-PCG-REC
082920120827                                                TO lc_C_PCG_FirstName
082930120827                  ELSE
08294012082776555 *           IF li_C_Subsc_Type = 2
08295012082776555             IF li_C_PCG_Type_Code = 2
082960120827                     MOVE BUSINESS-NAME         of ACCOUNT-PCG-REC
082970120827                                                TO lc_C_PCG_Name
082980120827                  END-IF
082990120827                  END-IF
083000120827               END-IF
083010120827            END-IF.
08302012082774636 *Ends
083030120827
083040120827
083050120827      *-------------
083060120827       Get_SubscriberAddress.
083070120827      *-------------
083080120827      * Get Address of Subscriber from MFAIVRADP
083090120827           MOVE SPACES TO lc_C_Subsc_Address.
083100120827           EXEC SQL
08311012082752744 *    SELECT Coalesce(MAX(IVRADP.Addr_No),0),
08312012082752744      SELECT Coalesce(IVRADP.Addr_No,0),
083130120827                  CASE WHEN (IVRP.Home_Phone_No = 0 OR
08314012082752744 *                   Coalesce(MAX(IVRADP.Addr_No),0) = 0)
08315012082752744                     Coalesce(IVRADP.Addr_No,0) = 0)
083160120827                       THEN "0000000000"
083170120827      *   RFS103461d - Begins - Manage area/exchange that start with zero
083180120827      *                ELSE SUBSTR (IVRP.Home_Phone_Area,1,3)
083190120827      *                 CONCAT SUBSTR (IVRP.Home_Phone_No, 1,7)
083200120827                       ELSE SUBSTR (DIGITS(IVRP.Home_Phone_Area),1,3)
083210120827                        CONCAT SUBSTR (DIGITS(IVRP.Home_Phone_No), 1,7)
083220120827      *   RFS103461d - Ends
083230120827                  END
083240120827           INTO :li_MaxAddrNo,
083250120827                :lc_C_Subsc_Phone
083260120827           FROM MFAACCNTP  ACCNTP
083270120827           LEFT JOIN MFAIVRP IVRP ON
083280120827                ACCNTP.Investor_No = IVRP.Investor_No
083290120827           LEFT OUTER JOIN MFAIVRADP IVRADP ON
083300120827                IVRP.Investor_No = IVRADP.Investor_No AND
08331012082752744           IVRADP.Addr_Type_Code = "IVR"
083320120827           WHERE ACCNTP.Account_No  = :li_C_Account_No
083330120827           GROUP BY IVRADP.Addr_No, IVRP.Home_Phone_No, Home_Phone_Area
083340120827           END-EXEC.
083350120827           MOVE SQLSTATE TO lc_sqlStates.
083360120827           EVALUATE TRUE
083370120827             WHEN lncc_sqlSuccessful OR lncc_sqlEnd OR lncc_SqlWarning
083380120827                 CONTINUE
083390120827             WHEN OTHER
083400120827                 MOVE ZEROES TO li_MaxAddrNo
083410120827           END-EVALUATE.
083420120827
083430120827           IF li_MaxAddrNo > 0
083440120827              EXEC SQL
083450120827                 SELECT
083460120827                    ADDRS.Misc_First_Addr_Line,
083470120827                    ADDRS.Street_No,
083480120827                    SUBSTR (ADDRS.Street_Name,1,30) CONCAT
083490120827                        SUBSTR (ADDRS.Street_Type_Code,1,6) CONCAT
083500120827                            SUBSTR (ADDRS.Street_Dirct_Code,1,2),
083510120827                    ADDRS.Misc_Second_Addr_Line,
083520120827                    CASE WHEN ADDRS.Country_Code = "CAN" THEN " "
08353012082754596b***                WHEN ADDRS.Country_Code = "USA" THEN ADDRS.City
083540120827  |                      WHEN ADDRS.Country_Code = "USA"
08355012082754596e                   THEN PRVDC.Province_Code_Descr
083560120827                        ELSE CNTRY.Country_Name
083570120827                    END,
083580120827                    ADDRS.City,
083590120827                    CASE WHEN ADDRS.Country_Code = "CAN"
083600120827                         THEN ADDRS.Province_Code
083610120827                         ELSE " "
083620120827                    END,
08363012082754596b***           ADDRS.Country_Code,
083640120827   |                CASE WHEN ADDRS.Country_Code IN("CAN","USA")
083650120827   |                     THEN ADDRS.Country_Code
083660120827   |                     ELSE :lncc_AUT
08367012082754596e              END,
083680120827                    ADDRS.Postal_Code
083690120827
083700120827                 INTO :lc_C_Subsc_AptNo,
083710120827                      :lc_C_Subsc_StreetNo,
083720120827                      :lc_C_Subsc_StreetName,
083730120827                      :lc_C_Subsc_AddrLine2,
083740120827                      :lc_C_Subsc_AddrLine3,
083750120827                      :lc_C_Subsc_City,
083760120827                      :lc_C_Subsc_Prov,
083770120827                      :lc_C_Subsc_Country,
083780120827                      :lc_C_Subsc_PostalCode
083790120827
083800120827      * ADDRESS (for Subscriber)
083810120827                 FROM MFAADDP ADDRS
083820120827                 LEFT JOIN MFACOUP CNTRY ON
083830120827                     ADDRS.Country_Code = CNTRY.Country_Code
08384012082754596b* PROVINCE-CODES-DESCR
083850120827  |              LEFT JOIN MFAPRVDCP PRVDC ON
083860120827  |                   ADDRS.Country_Code  = PRVDC.Country_Code
083870120827  |               AND ADDRS.Province_Code = PRVDC.Province_Code
083880120827  |               AND PRVDC.Language_Code = :lncc_E
08389012082754596e
083900120827                 WHERE ADDRS.Addr_No = :li_MaxAddrNo
083910120827              END-EXEC
083920120827              MOVE SQLSTATE TO lc_sqlStates
083930120827      *       EVALUATE TRUE
083940120827      *          WHEN lncc_sqlSuccessful OR lncc_sqlEnd
083950120827      *               CONTINUE
083960120827      *          WHEN OTHER
083970120827      *               MOVE SPACES TO lc_C_Subsc_Address
083980120827      *       END-EVALUATE
083990120827           END-IF.
084000120827
084010120827      * RFS 57825 - start
084020120827       Get_Recipient-Type.
084030120827           INITIALIZE Lc_Recipient_Type
084040120827                      lc_C_JoinSub_Phone.
084050120827
084060120827      *Initialize joint subscriber phone number to zeroes.
084070120827           INSPECT lc_C_JoinSub_Phone
084080120827             REPLACING ALL SPACES BY "0".
084090120827
084100120827           EXEC SQL
084110120827             SELECT COALESCE(IVRTYP.RECIPIENT_TYPE, " ")
084120120827               INTO :Lc_Recipient_Type
084130120827               FROM MFAIVRTYP IVRTYP,
084140120827                    MFAIVRP IVRP,
084150120827                    MFAACCNTP ACCNTP
084160120827              WHERE ACCNTP.ACCOUNT_NO = :li_C_Account_No
084170120827                AND ACCNTP.INVESTOR_NO = IVRP.INVESTOR_NO
084180120827                AND   IVRP.INVESTOR_TYPE_CODE =
084190120827                    IVRTYP.INVESTOR_TYPE_CODE
084200120827           END-EXEC.
084210120827
084220120827           MOVE SQLSTATE TO lc_sqlStates.
084230120827           IF NOT lncc_sqlSuccessful AND NOT lncc_sqlEnd
084240120827              SET lncc_Err_S2 TO TRUE
084250120827              MOVE "Failed on Recipient-Type "
084260120827                TO lc_sqlErrShortDESCR
084270120827              MOVE Ws-Err-Code TO lc_ErrCode
084280120827              MOVE lc_sqlErrShortDESCR TO lc_ErrDesc
084290120827              PERFORM Dsp-Error
084300120827           END-IF.
084310120827
084320120827      *RFS 57825 - end
084330120827
084340120827      *RFS 52744 - start
084350120827      *----------------
084360120827       Get_Joint_Subscriber.
084370120827      *----------------
084380120827           INITIALIZE li_Investor_No
084390120827                      li_C_JoinSub_SIN
084400120827                      lc_C_JoinSub_LastName
084410120827                      lc_C_JoinSub_FirstName
084420120827                      lc_Area_Code
084430120827                      lc_Phone_No.
08444012082757825 *               lc_C_JoinSub_Phone.
084450120827
084460120827           SET Lb-EOF-IVRTEP-NO TO TRUE.
084470120827
084480120827           EXEC SQL
084490120827             SELECT INVESTOR_NO
084500120827               INTO :li_Investor_No
084510120827               FROM MFAACCNTP
084520120827              WHERE ACCOUNT_NO = :li_C_Account_No
084530120827           END-EXEC.
084540120827
084550120827           MOVE SQLSTATE TO lc_sqlStates.
084560120827           IF not lncc_sqlSuccessful
084570120827              SET lncc_Err_S1 TO TRUE
084580120827              MOVE "Failed on investor No " TO lc_sqlErrShortDESCR
084590120827              PERFORM SQLFailProcess
084600120827           END-IF.
084610120827
084620120827           INITIALIZE MFAIVRTEP OF INVESTOR-TENANTS-REC.
084630120827
084640120827           MOVE li_Investor_No
084650120827             TO INVESTOR-NO OF INVESTOR-TENANTS-REC.
084660120827
084670120827           MOVE 0
084680120827             TO TENANT-SEQ-NO OF INVESTOR-TENANTS-REC.
084690120827
084700120827           START INVESTOR-TENANTS
084710120827             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
084720120827              INVALID KEY
084730120827                 SET Lb-EOF-IVRTEP-YES TO TRUE
084740120827              NOT INVALID KEY
084750120827                 PERFORM READ-INVESTOR-TENANTS TEST BEFORE
084760120827                         UNTIL Lb-EOF-IVRTEP-YES
084770120827           END-START.
084780120827
08479012082757825 *    INSPECT lc_C_JoinSub_Phone
08480012082757825 *      REPLACING ALL SPACES BY "0".
084810120827
084820120827       READ-INVESTOR-TENANTS.
084830120827
084840120827           READ INVESTOR-TENANTS NEXT RECORD
084850120827             AT END
084860120827                SET Lb-EOF-IVRTEP-YES TO TRUE
084870120827           END-READ.
084880120827
084890120827      *Get joint subscriber info only when the SIN not equal to
084900120827      *Subscriber SIN.
084910120827
084920120827           IF INVESTOR-NO OF INVESTOR-TENANTS-REC NOT = li_Investor_No
084930120827              SET Lb-EOF-IVRTEP-YES TO TRUE
084940120827           END-IF.
084950120827
084960120827           IF Lb-EOF-IVRTEP-NO AND
084970120827              INVESTOR-NO OF INVESTOR-TENANTS-REC = li_Investor_No AND
084980120827              SOCIAL-INSURANCE-NO OF INVESTOR-TENANTS-REC NOT =
084990120827                li_C_Subsc_SIN
085000120827
085010120827              MOVE SOCIAL-INSURANCE-NO OF INVESTOR-TENANTS-REC
085020120827                TO li_C_JoinSub_SIN
085030120827              MOVE LAST-NAME OF INVESTOR-TENANTS-REC
085040120827                TO lc_C_JoinSub_LastName
085050120827              MOVE FIRST-NAME OF INVESTOR-TENANTS-REC
085060120827                TO lc_C_JoinSub_FirstName
085070120827              MOVE AREA-CODE  OF INVESTOR-TENANTS-REC
085080120827                TO lc_Area_Code
085090120827              MOVE PHONE-NO   OF INVESTOR-TENANTS-REC
085100120827                TO lc_Phone_No
085110120827
085120120827              STRING lc_Area_Code, lc_Phone_No DELIMITED BY SIZE
085130120827                INTO lc_C_JoinSub_Phone
085140120827
085150120827              SET Lb-EOF-IVRTEP-YES TO TRUE
085160120827
085170120827           END-IF.
085180120827
085190120827      *RFS 52744 - end
085200120827
085210120827      *----------------------
085220120827       Update_ApprovalStatus.
085230120827      *----------------------
085240120921      * RFS107668 - Start-Writing only if Report mode is not set to 'Y'
085250121018107668     IF lc_ReportMode NOT = lncc_Y
085260120827      * Update Approval-Status from U/R to P once request is written
08527012082758589 * Approval-Status is updated for both type02 and type06 records
085280120925            EXEC SQL
085290120925              UPDATE MFAACBIRP
085300120925              SET Mrq_Approval_Status = "P",
085310120925                  Mrq_Approval_Status_Reason = " ",
085320120925                  Mrq_File_Date = :li_AsAtDate,
085330120925                  Vendor_BN = :lc_QC_BusinessNo,
08534012092574636             PCG_Seq_No = :li_PCGSeqNo
08535012082774636 *           PCG_Seq_No = (SELECT Coalesce(MIN(B.PCG_Seq_No),0)
08536012082774636 *                         FROM MFAACBIRP A
08537012082774636 *                         LEFT OUTER JOIN MFAACPCGP B ON
08538012082774636 *                              A.Account_No = B.Account_No
08539012082774636 *                         WHERE A.Account_No = :li_C_Account_No
08540012082774636 *                        )
085410120925              WHERE
085420120925                 Account_No          = :li_C_Account_No  AND
085430120925                 Social_Insurance_No = :li_C_Benef_SIN   AND
08544012082758589 *96990     Record_Type_2       = :li_C_RecordType  AND
08545012082773992 *          Year BETWEEN :li_Year1 AND :li_Year2 AND
08546012092573992            Year = :li_C_FilingYear AND
085470120827      * RFS 78268 - Start
085480120827      *          Mrq_Approval_Status IN ("U", "R")
085490120925                 Mrq_Approval_Status IN (:lncc_Refiling,
085500120925                      :lncc_Unfiled, :lncc_M, :lncc_O, :lncc_C)
085510120827      * RFS 78268 - End
085520120926      * RFS107668 - Start
085530120926      *     END-EXEC.
085540120926            END-EXEC
085550120926           END-IF.
085560120921      * RFS107668 - End
085570120921
085580120827      *RFS58589 Begins
085590120827      *----------------------
085600120827       Update_ReplacementStatus.
085610120827      *----------------------
085620120927      * RFS107668 - Writing only if Report mode is not set to 'Y'
085630121018107668     IF lc_ReportMode NOT = lncc_Y
085640120827      * Update Approval-Status from U/R to P once request is written
085650120925            EXEC SQL
085660120925              UPDATE MFAACCBRP ACCBRP
085670120925              SET ACCBRP.Mrq_Approval_Status = "P",
085680120925                  ACCBRP.Mrq_Approval_Status_Reason = " ",
085690120925                  ACCBRP.Mrq_File_Date = :li_AsAtDate,
085700120925                  ACCBRP.Year =
085710120925                         SUBSTR(DEC(:li_C3_Replacement_Date),1,4),
085720120925                  ACCBRP.Social_Insurance_No   = :li_C3_Benef_SIN_Old
085730120925              WHERE ACCBRP.Account_No  = :li_C3_Account_No
08574012092573992             AND ACCBRP.Replacement_Date = :li_C3_Replacement_Date
085750120925                AND EXISTS
085760120925                 (SELECT *
085770120827      * RFS84977 - Using inner joins instead of implicit ones - Starts
08578012082784977 *          FROM MFAACCBRP ACCBRP2, MFAACCBNP ACCBNP
085790120925                 FROM MFAACCBRP ACCBRP2
085800120925                 INNER JOIN MFAACCBNP ACCBNP ON
085810120925                   ACCBRP2.Account_No =
085820120925                   ACCBNP.Account_No
085830120925                 AND ACCBRP2.Beneficiary_Seq_No =
085840120925                   ACCBNP.Beneficiary_Seq_No
085850120921      * RFS84977 - Ends
085860120925                 WHERE
085870120925                 ACCBRP2.Account_No = ACCBRP.Account_No
085880120925                 AND ACCBRP2.Beneficiary_Seq_No       =
085890120925                     ACCBRP.Beneficiary_Seq_No
08590012082784977 *          AND ACCBRP2.Account_No =
08591012082784977 *              ACCBRP.Account_No
08592012082784977 *          AND ACCBRP2.Beneficiary_Seq_No       =
08593012082784977 *              ACCBNP.Beneficiary_Seq_No
085940120925                 AND ACCBNP.Social_Insurance_No   =
085950120925                    :li_C3_Benef_SIN_Old
085960120925                 AND (ACCBRP2.Mrq_Approval_Status
085970120827      * RFS 78268 - Start
08598012082773992 *              IN (:lncc_Refiling, :lncc_Unfiled))
085990120925                     IN (:lncc_Refiling, :lncc_Unfiled,
086000120925                         :lncc_M, :lncc_O, :lncc_C))
086010120921      * RFS 78268 - End
08602012082773992 *          AND SUBSTR(DEC(ACCBRP2.Replacement_Date),1,4)
08603012092173992 *          BETWEEN :li_Year1 AND :li_Year2)
086040120925                 )
086050120926      *RFS107668 - START
086060120926      *     END-EXEC.
086070120925            END-EXEC
086080120921           END-IF.
086090120921      * RFS 107668 - End
086100120827      *----------------------
086110120827       Update_TransferStatus.
086120120827      *----------------------
086130120927      * RFS107668 - Writes only if Report mode is not set to 'Y'
086140121018107668     IF lc_ReportMode NOT = lncc_Y
086150120827      * Update Approval-Status from U/R to P once request is written
086160120925            EXEC SQL
086170120925              UPDATE MFAARTNDP ARTNDP
086180120925              SET ARTNDP.Mrq_Approval_Status = "P",
086190120925                  ARTNDP.Mrq_Approval_Status_Reason = " ",
086200120925                  ARTNDP.Mrq_File_Date = :li_AsAtDate,
086210120925                  ARTNDP.Year =
086220120925                        SUBSTR(DEC(:li_C4_Transfer_Date),1,4),
086230120925                  ARTNDP.Social_Insurance_No  = :li_C4_Benef_SIN
086240120925              WHERE ARTNDP.Account_No  = :li_C4_Account_No
08625012092573992            AND ARTNDP.Transfer_Seq_No     = :li_C4_TrnsfrSeq_No
08626012092573992            AND ARTNDP.Beneficiary_Seq_No  = :li_C4_BenSeq_No
086270120925                AND EXISTS
086280120925                 (SELECT *
086290120827      * RFS84977 - Use inner join instead of implicit one - Starts
08630012082784977 *          FROM MFAARTNDP ARTNDP2, MFAARTNP ARTNP,
08631012092184977 *               MFAACCBNP ACCBNP
086320120925                 FROM MFAARTNDP ARTNDP2
086330120925                 INNER JOIN MFAARTNP ARTNP ON
086340120925                   ARTNDP2.Account_No          =
086350120925                   ARTNP.Account_No
086360120925                 AND ARTNDP2.Transfer_Seq_No   =
086370120925                   ARTNP.Transfer_Seq_No
086380120925                 INNER JOIN MFAACCBNP ACCBNP ON
086390120925                   ARTNDP2.Account_No          =
086400120925                   ACCBNP.Account_no
086410120925                 AND ARTNDP2.Beneficiary_Seq_No  =
086420120925                   ACCBNP.Beneficiary_Seq_No
086430120921      * RFS84977 - Ends
086440120925                 WHERE
086450120925                 ARTNDP2.Account_No = ARTNDP.Account_No
086460120925                 AND ARTNDP2.Transfer_Seq_No     =
086470120925                     ARTNDP.Transfer_Seq_No
086480120925                 AND ARTNDP2.Beneficiary_Seq_No  =
086490120925                     ARTNDP.Beneficiary_Seq_No
08650012092573992*           AND ARTNDP2.Transfer_Seq_No     =
08651012092573992*               ARTNDP.Transfer_Seq_No
08652012092184977 *          AND ARTNDP2.Account_No          =
08653012082784977 *              ARTNP.Account_No
08654012082784977 *          AND ARTNDP2.Transfer_Seq_No     =
08655012082784977 *              ARTNP.Transfer_Seq_No
08656012082784977 *          AND ARTNDP2.Account_No          =
08657012082784977 *              ACCBNP.Account_no
08658012082784977 *          AND ARTNDP2.Beneficiary_Seq_No  =
08659012082784977 *              ACCBNP.Beneficiary_Seq_No
086600120925                 AND ACCBNP.Social_Insurance_No  =
086610120925                     :li_C4_Benef_SIN
086620120925                 AND (ARTNDP2.Mrq_Approval_Status
086630120921      * RFS 78268 - Start
08664012092173992 *              IN (:lncc_Refiling, :lncc_Unfiled))
086650120925                     IN (:lncc_Refiling, :lncc_Unfiled,
086660120925                         :lncc_M, :lncc_O, :lncc_C))
086670120921      * RFS 78268 - End
08668012092573992            AND ARTNP.Transfer_Date = :li_C4_Transfer_Date
08669012082773992 *          AND SUBSTR(DEC(ARTNP.Transfer_Date),1,4)
08670012082773992 *          BETWEEN :li_Year1 AND :li_Year2)
086710120925                 )
086720120926      *RFS107668 - START
086730120926      *     END-EXEC.
086740120926            END-EXEC
086750120926           END-IF.
086760120926      * RFS 107668 - End
086770120921
086780120827      * RFS92917 - START
086790120827       Update_EapPseSts_Type05.
086800120927      * RFS107668 - Writes only if Report mode is not set to 'Y'
086810121018107668     IF lc_ReportMode NOT = lncc_Y
086820120925           IF  lb_EXTQESIYes
086830120925               PERFORM EXTQESI_Status05_Update
086840120925           ELSE
086850120925               PERFORM OrigUpdate_EapPseSts_Type05
086860120926      *RFS107668 - START
086870120926      *    END-IF.
086880120925           END-IF
086890120921           END-IF.
086900120921      * RFS107668 - End
086910120827      * RFS92917 - END
086920120827
086930120827      *----------------------
086940120827      * RFS92917 - START
086950120827      *Update_EapPseSts_Type05.
086960120827       OrigUpdate_EapPseSts_Type05.
086970120827      * RFS92917 - END
086980120827      *----------------------
086990120827      * Update Approval-Status from U/R to P once request is written
087000120827            EXEC SQL
087010120827              UPDATE MFATRNQAP TRNQAP
087020120827              SET TRNQAP.Mrq_Approval_Status = "P",
087030120827                  TRNQAP.Mrq_Approval_Status_Reason = " ",
087040120827                  TRNQAP.Mrq_File_Date = :li_AsAtDate,
087050120827                  TRNQAP.Year =
087060120827                         SUBSTR(DEC(:li_C5_Payment_Date),1,4),
087070120827                  TRNQAP.Social_Insurance_No =
087080120827                       :li_C5_Benef_SIN
087090120827              WHERE TRNQAP.Account_No  = :li_C5_Account_No
087100120827                AND EXISTS
087110120827                 (SELECT *
087120120827      * RFS84977 - change implicit joins for V6R1 - Starts
087130120827      *          FROM MFATRNQAP TRNQAP2, MFATRNP TRANS,
087140120827      *               MFAACCNTP ACCNTP, MFACNTRRP CNTRRP,
087150120827      *               MFAACCBNP ACCBNP
087160120827                 FROM MFATRNQAP TRNQAP2
087170120827                 INNER JOIN MFATRNP TRANS ON
087180120827                       TRNQAP2.Account_No =
087190120827                       TRANS.Account_No
087200120827                 AND TRNQAP2.Placement_Date =
087210120827                     TRANS.Placement_Date
087220120827                 AND TRNQAP2.Trans_No =
087230120827                     TRANS.Trans_No
087240120827                 INNER JOIN MFAACCNTP ACCNTP ON
087250120827                     TRNQAP2.Account_No =
087260120827                     ACCNTP.Account_No
087270120827                 INNER JOIN MFACNTRRP CNTRRP ON
087280120827                     ACCNTP.Account_Type_Code =
087290120827                     CNTRRP.Account_Type_Code
087300120827                 AND TRANS.Contr_Redem_Code =
087310120827                     CNTRRP.Contr_Redem_Code
087320120827                 INNER JOIN MFAACCBNP ACCBNP ON
087330120827                     TRNQAP2.Account_No          =
087340120827                     ACCBNP.Account_no
087350120827                 AND TRNQAP2.Beneficiary_Seq_No  =
087360120827                     ACCBNP.Beneficiary_Seq_No
087370120827      * RFS84977 - Ends
087380120827                 WHERE
087390120827                 TRNQAP2.Account_No = TRNQAP.Account_No
087400120827                 AND TRNQAP2.Placement_Date =
087410120827                     TRNQAP.Placement_Date
087420120827                 AND TRNQAP2.Trans_No =
087430120827                     TRNQAP.Trans_No
087440120827                 AND TRNQAP2.Beneficiary_Seq_No  =
087450120827                     TRNQAP.Beneficiary_Seq_No
08746012082784977 *          AND TRNQAP2.Account_No =
08747012082784977 *              TRANS.Account_No
08748012082784977 *          AND TRNQAP2.Placement_Date =
08749012082784977 *              TRANS.Placement_Date
08750012082784977 *          AND TRNQAP2.Trans_No =
08751012082784977 *              TRANS.Trans_No
08752012082772749            AND TRANS.Trade_Date =
08753012082772749                :li_C5_Payment_Date
08754012082784977 *          AND TRNQAP2.Account_No =
08755012082784977 *              ACCNTP.Account_No
08756012082784977 *          AND ACCNTP.Account_Type_Code =
08757012082784977 *              CNTRRP.Account_Type_Code
08758012082784977 *          AND TRANS.Contr_Redem_Code =
08759012082784977 *              CNTRRP.Contr_Redem_Code
08760012082784977 *          AND CNTRRP.Contr_Redem_Code_Rule IN ("12" , "28")
08761012082784977            AND CNTRRP.Contr_Redem_Code_Rule IN ("12" , "28", "30")
087620120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
087630180925004139*          AND TRANS.Reverse <> "Y"
087640180925004139           AND (TRANS.Reverse <> "Y" OR
087650180925004139                (TRANS.Reverse = "Y" AND
087660180925004139                 TRNQAP.Mrq_Approval_Status = "C"))
08767012082784977 *          AND TRNQAP2.Account_No          =
08768012082784977 *              ACCBNP.Account_no
08769012082784977 *          AND TRNQAP2.Beneficiary_Seq_No  =
08770012082784977 *              ACCBNP.Beneficiary_Seq_No
087710120827                 AND ACCBNP.Social_Insurance_No  =
087720120827                     :li_C5_Benef_SIN
087730120827                 AND (TRNQAP2.Mrq_Approval_Status
087740120827      * RFS 78268 - Start
08775012082773992 *              IN (:lncc_Refiling, :lncc_Unfiled))
087760120827                     IN (:lncc_Refiling, :lncc_Unfiled,
087770120827104159                   :lncc_P, :lncc_M, :lncc_O, :lncc_C))
087780120827      * RFS 78268 - End
08779012082773992 *          AND SUBSTR(DEC(TRANS.Trade_Date),1,4)
08780012082773992 *          BETWEEN :li_Year1 AND :li_Year2)
087810120827                 )
087820120827            END-EXEC.
087830120827
087840120827      * RFS 78268 - Start
087850120827
087860120827           IF lc_F5_CancelFlag(li_Counter) = lncc_Y
087870120827              PERFORM Ins_EAPPSE05_RVS
087880120827           END-IF.
087890120827
087900120827      *----------------------
087910120827       Ins_EAPPSE05_RVS.
087920120827      *----------------------
087930120827           EXEC SQL
087940120827             INSERT INTO MFATRNQAP
087950120827                         (Placement_date,
087960120827                          Trans_No,
087970120827                          Account_No,
087980120827                          Beneficiary_Seq_No,
087990120827                          Year,
088000120827                          Social_Insurance_No,
088010120827                          QC_Resident_Ind,
088020120827                          MRQ_Approval_Status,
088030120827                          MRQ_File_Date
088040120827                          )
088050120827             (SELECT      TRNP.Placement_date,
088060120827                          TRNP.Trans_No,
088070120827                          TRNP.Account_No,
088080120827                          BPP.Beneficiary_Seq_No,
088090120827                          SUBSTR(DEC(:li_C5_Payment_Date),1,4),
088100120827                         :li_C5_Benef_SIN,
088110120827      *                  RFS103461 - Begins - Use Y/N
088120120827      *                  :lc_C5_Benef_QcResident,
088130120827                         CASE WHEN :lc_C5_Benef_QcResident = "1"
088140120827                              THEN :Lncc_Y ELSE :Lncc_N END,
088150120827      *                  RFS103461 - Ends
088160120827                         "P",
088170120827                         :li_AsAtDate
088180120827                    FROM  MFATRNP  TRNP
088190120827              INNER JOIN MFATRNRFP RFP ON
088200120827                         TRNP.Placement_Date = RFP.Placement_Date
088210120827                     AND TRNP.Trans_No       = RFP.Trans_No
088220120827              INNER JOIN MFAACCBPP BPP ON
088230120827                         RFP.Account_NO      = BPP.Account_No
088240120827                     AND RFP.Beneficiary_Split_Code =
088250120827                         BPP.Beneficiary_Split_Code
088260120827                     AND RFP.Hrdc_File_Date  = BPP.Hrdc_File_Date
088270120827              WHERE      TRNP.Account_NO = :li_C5_Account_No
088280120827                     AND TRNP.Trade_Date = :li_C5_Payment_date
088290120827                     AND TRNP.Trans_Status_code = :lncc_RVS
088300120827                     AND BPP.Beneficiary_Seq_No     =
088310120827                         :li_C5_Beneficiary_Seq_No
088320120827                    AND NOT EXISTS (
088330120827                     SELECT 1 FROM MFATRNQAP QAP
088340120827                     WHERE QAP.Placement_Date = TRNP.Placement_Date AND
088350120827                           QAP.Trans_No       = TRNP.Trans_No       AND
088360120827                   QAP.Beneficiary_Seq_no  = BPP.Beneficiary_Seq_no ))
088370120827           END-EXEC.
088380120827
088390120827      * RFS 78268 - End
088400120827
088410120827      * RFS92917 - START
088420120827        Update_EapPseSts_Type06.
088430120921      * RFS107668 - Start-Writing only if Report mode is not set to 'Y'
088440121018107668     IF lc_ReportMode NOT = lncc_Y
088450120925           IF  lb_EXTQESIYes
088460120925               PERFORM EXTQESI_Status06_Update
088470120925           ELSE
088480120925               PERFORM OrigUpdate_EapPseSts_Type06
088490120926      * RFS107668 - Start
088500120926      *    END-IF.
088510120925           END-IF
088520120921           END-IF.
088530120921      * RFS107668 - End
088540120827
088550120827        EXTQESI_Status06_Update.
088560140421130249     MOVE li_C6_Event_Date TO li_YYYYMMDD.
088570120827           EXEC SQL
088580120827             UPDATE MFATRNQAP TRNQAP
088590120827             SET TRNQAP.Mrq_Approval_Status = "P",
088600120827                 TRNQAP.Mrq_Approval_Status_Reason = " ",
088610120827                 TRNQAP.Mrq_File_Date = :li_AsAtDate
088620140421130249          ,TRNQAP.YEAR = :li_YYYY
088630120827 dm          WHERE TRNQAP.TRANSACTION_ID_2 in
088640120827              (SELECT DTL.TransactionID
088650120827               FROM   QTEMP/EXTRPYDTL DTL
088660120827               WHERE DTL.AccountNo        = :li_C6_Account_No
088670120827               AND   DTL.BeneficiarySeqNo = :li_C6_Beneficiary_Seq_No
088680120827               AND   DTL.TradeDate        = :li_C6_Event_Date
088690120827               AND   DTL.RepaymentReason  = :lc_C6_Tax_Reason_Code)
088700120827             END-EXEC.
088710120827      * RFS92917 - END
088720120827
088730120827      *----------------------
088740120827      * RFS92917 - START
088750120827      *Update_EapPseSts_Type06.
088760120827       OrigUpdate_EapPseSts_Type06.
088770120827      * RFS92917 - END
088780120827      *----------------------
088790120827      * Update Approval-Status from U/R to P once request is written
088800120827            EXEC SQL
088810120827              UPDATE MFATRNQAP TRNQAP
088820120827              SET TRNQAP.Mrq_Approval_Status = "P",
088830120827                  TRNQAP.Mrq_Approval_Status_Reason = " ",
088840120827                  TRNQAP.Mrq_File_Date = :li_AsAtDate,
08885012082772749 * Update Year field in BuildType06Table using EAPPSETBLE4
08886012082772749 * for a solid link using placement date and trans no
08887012082772749 *           TRNQAP.Year =
08888012082772749 *             CASE WHEN TRNQAP.Year = 0
08889012082772749 *              THEN SUBSTR(DEC(:li_C6_Event_Date),1,4)
08890012082772749 *              ELSE TRNQAP.Year
08891012082772749 *             END,
088920120827                  TRNQAP.Social_Insurance_No =
088930120827                         :li_C6_Benef_SIN
088940120827              WHERE TRNQAP.Account_No  = :li_C6_Account_No
08895012082773992           AND TRNQAP.Year = SUBSTR(DEC(:li_C6_Event_Date),1,4)
088960120827                AND EXISTS
088970120827                 (SELECT *
088980120827      * RFS84977 - Use inner join instead of implicit one - Starts
088990120827      *          FROM MFATRNQAP TRNQAP2, MFATRNP TRANS,
089000120827      *               MFAACCNTP ACCNTP, MFACNTRRP CNTRRP,
089010120827      *               MFAACCBNP ACCBNP
089020120827                 FROM MFATRNQAP TRNQAP2
089030120827                 INNER JOIN MFATRNP TRANS ON
089040120827                     TRNQAP2.Account_No =
089050120827                     TRANS.Account_No
089060120827                 AND TRNQAP2.Placement_Date =
089070120827                     TRANS.Placement_Date
089080120827                 AND TRNQAP2.Trans_No =
089090120827                     TRANS.Trans_No
089100120827                 INNER JOIN MFAACCNTP ACCNTP ON
089110120827                     TRNQAP2.Account_No =
089120120827                     ACCNTP.Account_No
089130120827                 INNER JOIN MFACNTRRP CNTRRP ON
089140120827                     ACCNTP.Account_Type_Code =
089150120827                     CNTRRP.Account_Type_Code
089160120827                 AND TRANS.Contr_Redem_Code =
089170120827                     CNTRRP.Contr_Redem_Code
089180120827                 INNER JOIN MFAACCBNP ACCBNP ON
089190120827                     TRNQAP2.Account_No          =
089200120827                     ACCBNP.Account_no
089210120827                 AND TRNQAP2.Beneficiary_Seq_No  =
089220120827                     ACCBNP.Beneficiary_Seq_No
089230120827      * RFS84977 - Ends
089240120827      * RFS 103461d - Begins - Add repayment reason
089250120827                 LEFT JOIN MFATRNRRP TRNRRP ON
089260120827                     TRNQAP2.Placement_Date =
089270120827                     TRNRRP.Placement_Date
089280120827                 AND TRNQAP2.Trans_No =
089290120827                     TRNRRP.Trans_No
089300120827      * RFS 103461d - Ends
089310120827                 WHERE
089320120827                 TRNQAP2.Account_No = TRNQAP.Account_No
089330120827                 AND TRNQAP2.Placement_Date =
089340120827                     TRNQAP.Placement_Date
089350120827                 AND TRNQAP2.Trans_No =
089360120827                     TRNQAP.Trans_No
089370120827                 AND TRNQAP2.Beneficiary_Seq_No  =
089380120827                     TRNQAP.Beneficiary_Seq_No
08939012082784977 *          AND TRNQAP2.Account_No =
08940012082784977 *              TRANS.Account_No
08941012082784977 *          AND TRNQAP2.Placement_Date =
08942012082784977 *              TRANS.Placement_Date
08943012082784977 *          AND TRNQAP2.Trans_No =
08944012082784977 *              TRANS.Trans_No
08945012082784977 *          AND TRNQAP2.Account_No =
08946012082784977 *              ACCNTP.Account_No
08947012082784977 *          AND ACCNTP.Account_Type_Code =
08948012082784977 *              CNTRRP.Account_Type_Code
08949012082784977 *          AND TRANS.Contr_Redem_Code =
08950012082784977 *              CNTRRP.Contr_Redem_Code
089510120827                 AND CNTRRP.Contr_Redem_Code_Rule IN ("11" , "29")
089520120827                 AND TRANS.Trans_Status_Code IN ("HST", "HSC")
089530120827      * RFS 103461d - Begins - Qualify for event date and allow for
089540120827      *                        reversals
089550180925004139*          AND TRANS.Reverse <> "Y"
089560180925004139           AND (TRANS.Reverse <> "Y" OR
089570180925004139                (TRANS.Reverse = "Y" AND
089580180925004139                 TRNQAP.Mrq_Approval_Status = "C"))
089590120827                 AND (TRANS.Trade_date = :li_C6_Event_Date
089600120827                 OR (:lc_C6_Tax_Reason_Code
089610120827                 IN(:Lncc_22,:Lncc_23,:Lncc_24)
089620120827                    AND DIGITS(ZONED(
089630120827                        IFNULL(TRNRRP.Repayment_reason_code,0)
089640120827                                     ,2,0))
089650120827                      = :lc_C6_Tax_Reason_Code )
089660120827                      )
089670120827      * RFS 103461d - Ends
08968012082784977 *          AND TRNQAP2.Account_No          =
08969012082784977 *              ACCBNP.Account_no
08970012082784977 *          AND TRNQAP2.Beneficiary_Seq_No  =
08971012082784977 *              ACCBNP.Beneficiary_Seq_No
089720120827                 AND ACCBNP.Social_Insurance_No  =
089730120827                     :li_C6_Benef_SIN
089740120827                 AND (TRNQAP2.Mrq_Approval_Status
089750120827
089760120827      * RFS 78268 - Start
08977012082773992 *              IN (:lncc_Refiling, :lncc_Unfiled))
089780120827                     IN (:lncc_Refiling, :lncc_Unfiled,
089790120827      * RFS 103461d - Begins - Add status P, to update file date for already
089800120827      *                       filed records - D.Mielke
089810120827                         :Lncc_P,
089820120827      * RFS 103461d - Ends
089830120827                         :lncc_M, :lncc_O, :lncc_C))
089840120827      * RFS 78268 - End
08985012082773992 *          AND SUBSTR(DEC(TRANS.Trade_Date),1,4)
08986012082773992 *          BETWEEN :li_Year1 AND :li_Year2)
089870120827                 )
089880120827            END-EXEC.
089890120827      *RFS58589 Ends
089900120827      * RFS 78268 - Start
089910120827
089920120827           IF lc_C6_ReversalFlag  = lncc_Y
089930120827              PERFORM Ins_EAPPSE06_RVS
089940120827           END-IF.
089950120827
089960120827      * RFS110780 Begin
089970120827           PERFORM TRANS-RESP-DETAILS-UPDATE.
089980120827
089990120827      *----------------
090000120827       TRANS-RESP-DETAILS-UPDATE.
090010120827      *----------------
090020120827
090030120827           MOVE li_F6_Account_No(li_Counter)    TO
090040120827                      ACCOUNT-NO OF ACCOUNT-REC.
090050120827           READ  ACCOUNT
090060120827             INVALID KEY
090070120827               INITIALIZE  MFAACCNTP
090080120827                                 OF ACCOUNT-REC
090090120827               PERFORM Repayment_Exit
090100120827             NOT INVALID KEY
090110120827               MOVE ACCOUNT-NO OF ACCOUNT-REC TO
090120120827                    ACCOUNT-NO OF TRANS-REC
090130120827           END-READ.
090140120827           START  TRANS
090150120827             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
090160120827               INVALID KEY
090170120827                 PERFORM Repayment_Exit
090180120827               NOT INVALID KEY
090190120827                 PERFORM GetTransaction UNTIL lb_EndOfTransYes
090200120827           END-START.
090210120827
090220120827      *----------------
090230120827       GetTransaction.
090240120827      *----------------
090250120827           READ TRANS NEXT RECORD
090260120827              AT END
090270120827                 SET lb_EndOfTransYes TO TRUE
090280120827              NOT AT END
090290120827              IF li_F6_Account_No(li_Counter) =
090300120827                 ACCOUNT-NO OF TRANS-REC
090310120827                 PERFORM GetRESPRepaymentDtl
090320120827              ELSE
090330120827                 SET lb_EndOfTransYes TO TRUE
090340120827              END-IF
090350120827           END-READ.
090360120827
090370120827      *----------------
090380120827       GetRESPRepaymentDtl.
090390120827      *----------------
090400120827           MOVE PLACEMENT-DATE OF TRANS-REC TO
090410120827                PLACEMENT-DATE OF TRANS-RESP-REPAYMENT-DTL-REC
090420120827           MOVE TRANS-NO       OF TRANS-REC TO
090430120827                TRANS-NO       OF TRANS-RESP-REPAYMENT-DTL-REC
090440120827           READ TRANS-RESP-REPAYMENT-DTL
090450120827             INVALID KEY
090460120827               CONTINUE
090470120827             NOT INVALID KEY
090480120827               INITIALIZE lc_Contr_Redem-Code
090490120827               MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC  TO
090500120827                    ACCOUNT-TYPE-CODE OF CONTR-REDEM-CODE-RULES-REC
090510120827               MOVE CONTR-REDEM-CODE  OF TRANS-REC TO
090520120827                    CONTR-REDEM-CODE  OF CONTR-REDEM-CODE-RULES-REC
090530120827               MOVE CONTR-REDEM-CODE  OF CONTR-REDEM-CODE-RULES-REC TO
090540120827                    lc_Contr_Redem-Code
090550120827               READ CONTR-REDEM-CODE-RULES
090560120827                 INVALID KEY
090570120827                   CONTINUE
090580120827                 NOT INVALID KEY
090590120827                   IF CONTR-REDEM-CODE-RULE OF
090600120827                      CONTR-REDEM-CODE-RULES-REC = lnc_29
090610120827                     PERFORM GetTRANSRESPDetails
090620120827                   END-IF
090630120827               END-READ
090640120827           END-READ.
090650120827
090660120827      *----------------
090670120827       GetTRANSRESPDetails.
090680120827      *----------------
090690120827           MOVE PLACEMENT-DATE OF TRANS-REC TO
090700120827                PLACEMENT-DATE OF TRANS-RESP-DETAILS-REC.
090710120827           MOVE TRANS-NO       OF TRANS-REC TO
090720120827                TRANS-NO       OF TRANS-RESP-DETAILS-REC.
090730120827           READ TRANS-RESP-DETAILS
090740120827             INVALID KEY
090750120827               CONTINUE
090760120827             NOT INVALID KEY
090770120827               IF HRDC-FILE-DATE OF TRANS-RESP-DETAILS-REC = ZERO
090780120827                 PERFORM UpdateTRANSRESPDetails
090790120827                 PERFORM InsertAcctBeneSplit
090800120827               END-IF
090810120827           END-READ.
090820120827
090830120827      *----------------
090840120827       UpdateTRANSRESPDetails.
090850120827      *----------------
090860120827           INITIALIZE li_TransNo
090870120827                      li_PlacementDate
090880120827                      lc_BeneSplitcode.
090890120827           MOVE TRANS-NO       OF TRANS-RESP-DETAILS-REC TO
090900120827                li_TransNo.
090910120827           MOVE PLACEMENT-DATE OF TRANS-RESP-DETAILS-REC TO
090920120827                li_PlacementDate.
090930120827           MOVE BENEFICIARY-SPLIT-CODE
090940120827                               OF TRANS-RESP-DETAILS-REC TO
090950120827                lc_BeneSplitcode.
090960120827           EXEC SQL
090970120827             UPDATE MFATRNRFP
090980120827             SET    HRDC_FILE_DATE = :li_AsAtDate,
090990120827                    REPORTED       = :lncc_Y
091000120827             WHERE  PLACEMENT_DATE = :li_PlacementDate
091010120827             AND    TRANS_NO       = :li_TransNo
091020120827           END-EXEC.
091030120827
091040120827           MOVE SQLSTATE               TO Ws-Sql-States.
091050120827      *----------------
091060120827       InsertAcctBeneSplit.
091070120827      *----------------
091080120827
091090120827           EXEC SQL
091100120827             DROP TABLE QTEMP/ACCBPP
091110120827           END-EXEC.
091120120827
091130120827           MOVE SQLSTATE               TO Ws-Sql-States.
091140120827
091150120827           EXEC SQL
091160120827             CREATE TABLE QTEMP/ACCBPP
091170120827             (ACCOUNT_NO                FOR COLUMN F0000 NUMERIC (09)
091180120827                                        NOT NULL DEFAULT 0,
091190120827              BENEFICIARY_SPLIT_CODE    FOR COLUMN F0001 CHAR    (05)
091200120827                                        NOT NULL DEFAULT " ",
091210120827              BENEFICIARY_SPLIT_DEFAULT FOR COLUMN F0002 CHAR    (01)
091220120827                                        NOT NULL DEFAULT " ",
091230120827              BENEFICIARY_SPLIT_STATUS  FOR COLUMN F0003 CHAR    (01)
091240120827                                        NOT NULL DEFAULT " ",
091250120827              BENEFICIARY_SEQ_NO        FOR COLUMN F0004 DECIMAL (03,0)
091260120827                                        NOT NULL DEFAULT 0,
091270120827              BENEFICIARY_PERCENT       FOR COLUMN F0005 DECIMAL (07,2)
091280120827                                        NOT NULL DEFAULT 0,
091290120827              BENEFICIARY_TYPE_CODE     FOR COLUMN F0006 CHAR    (01)
091300120827                                        NOT NULL DEFAULT " ",
091310120827              HRDC_FILE_DATE            FOR COLUMN F0007 NUMERIC (09,0)
091320120827                                        NOT NULL DEFAULT 0
091330120827            )
091340120827           END-EXEC.
091350120827           MOVE SQLSTATE               TO Ws-Sql-States.
091360120827           EXEC SQL
091370120827             INSERT INTO QTEMP/ACCBPP
091380120827             SELECT *
091390120827             FROM   MFAACCBPP
091400120827             WHERE  ACCOUNT_NO             = :li_C6_Account_No
091410120827             AND    BENEFICIARY_SPLIT_CODE = :lc_BeneSplitcode
091420120827             AND    HRDC_FILE_DATE         = :lnci_0
091430120827           END-EXEC.
091440120827           MOVE SQLSTATE               TO Ws-Sql-States.
091450120827           IF lncc_sqlSuccessful
091460120827              EXEC SQL
091470120827                 UPDATE QTEMP/ACCBPP
091480120827                 SET    HRDC_FILE_DATE     = :li_AsAtDate
091490120827              END-EXEC
091500120827              MOVE SQLSTATE               TO Ws-Sql-States
091510120827              EXEC SQL
091520120827                 INSERT INTO MFAACCBPP
091530120827                 SELECT *
091540120827                 FROM   QTEMP/ACCBPP
091550120827              END-EXEC
091560120827           END-IF.
091570120827           MOVE SQLSTATE               TO Ws-Sql-States.
091580120827
091590120827      *----------------
091600120827       Repayment_Exit.
091610120827      *----------------
091620120827           EXIT.
091630120827
091640120827      * RFS110780 End
091650120827
091660120827      *----------------
091670120827       Ins_EAPPSE06_RVS.
091680120827      *----------------
091690120827           EXEC SQL
091700120827             INSERT INTO MFATRNQAP
091710120827                         (Placement_date,
091720120827                          Trans_No,
091730120827                          Account_No,
091740120827                          Beneficiary_Seq_No,
091750120827                          Year,
091760120827                          Social_Insurance_No,
091770120827                          QC_Resident_Ind,
091780120827                          MRQ_Approval_Status,
091790120827                          MRQ_File_Date
091800120827                          )
091810120827             (SELECT      TRNP.Placement_date,
091820120827                          TRNP.Trans_No,
091830120827                          TRNP.Account_No,
091840120827                          BPP.Beneficiary_Seq_No,
091850120827                          SUBSTR(DEC(:li_C6_Event_Date),1,4),
091860120827                         :li_C6_Benef_SIN,
091870120827                          QAP.QC_Resident_Ind,
091880120827                          "P",
091890120827                         :li_AsAtDate
091900120827                    FROM  MFATRNP  TRNP
091910120827              INNER JOIN MFATRNTGP TGP ON
091920120827      *       RFS103461d - Begins - Create proper link
091930120827      *                  TGP.Placement_Date = TRNP.Placement_Date
091940120827                         TGP.Placement_Date_2 = TRNP.Placement_Date
091950120827      *       RFS103461d - Begins - Create proper link
091960120827                    AND  TGP.Trans_No_2    = TRNP.Trans_No
091970120827                    AND  TGP.Relationship_Type = :lncc_RVS
091980120827                    JOIN MFATRNRRP RRP ON
091990120827                         TGP.Placement_Date  = RRP.Placement_Date
092000120827                    AND  TGP.Trans_No        = RRP.Trans_No
092010120827              INNER JOIN MFATRNRFP  RFP ON
092020120827                         TRNP.Placement_Date = RFP.Placement_Date
092030120827                    AND  TRNP.Trans_No       = RFP.Trans_No
092040120827              INNER JOIN MFAACCBPP  BPP ON
092050120827                         RFP.Account_No      = BPP.Account_No
092060120827                    AND  RFP.Beneficiary_Split_Code  =
092070120827                         BPP.Beneficiary_Split_Code
092080120827                    AND  RFP.HRDC_File_Date  = BPP.HRDC_File_Date
092090120827              INNER JOIN MFATRNQAP  QAP ON
092100120827                         TGP.Placement_Date  = QAP.Placement_Date
092110120827                    AND  TGP.Trans_No        = QAP.Trans_No
092120120827                    AND  BPP.Beneficiary_Seq_no      =
092130120827                         QAP.Beneficiary_Seq_no
092140120827              WHERE      TRNP.Account_No        = :li_C6_Account_No
092150120827                    AND  TRNP.Trade_Date        = :li_C6_Event_Date
092160120827                    AND  TRNP.Trans_Status_Code = :lncc_RVS
092170120827                    AND  Bpp.Beneficiary_Seq_No =
092180120827                         :li_C6_Beneficiary_seq_no
092190120827                    and RRP.Repayment_reason_Code =
092200120827                         :lc_C6_Tax_Reason_Code
092210120827                    AND NOT EXISTS (
092220120827                     SELECT 1 FROM MFATRNQAP
092230120827                     WHERE QAP.Placement_Date = TRNP.Placement_Date AND
092240120827                           QAP.Trans_No       = TRNP.Trans_No       AND
092250120827                   QAP.Beneficiary_Seq_no  = bpp.Beneficiary_Seq_no ))
092260120827            END-EXEC.
092270120827
092280120827      * RFS 78268 - End
092290120827
092300120827      *---------------
092310120827       Create_Trailer.
092320120827      *---------------
09233012082752744      COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 2.
092340120827           MOVE lc_QC_BusinessNo TO lc_Trailer_PromoterID.
092350120827           MOVE lc_NoOfRecordsProcX TO lc_Trailer_NoOfRecords.
092360120827           MOVE lc_Iqee_Trailer  TO lc_RecordToInsert.
092370120827           PERFORM InsertRecord.
092380120827
092390120827      *--------------
092400120827       Initial_Steps.
092410120827      *--------------
09242012082752744      OPEN  INPUT         INVESTOR-TENANTS
09243012082774636                          ACCOUNT-PRIMARY-CARE-GIVER.
092440120827
092450120827      * RFS110780 Begin
092460120827           OPEN  INPUT         ACCOUNT
092470120827                               TRANS
092480120827                               TRANS-RESP-REPAYMENT-DTL
092490120827                               TRANS-RESP-DETAILS
092500120827                               CONTR-REDEM-CODE-RULES.
092510120827      * RFS110780 End
092520120827
092530120827           INITIALIZE  lc_Working_Variables.
092540120827           ACCEPT lc_ProcessDateDataArea FROM DATAARA-MFAPRCDTP
092550120827                                         FOR "MFAPRCDTP".
092560120827           PERFORM GetAndUpdate_RespSystParms.
092570120827           COMPUTE li_Year2 = li_FilingYear
092580120827           IF li_FilingYear > 2009
092590120827              COMPUTE li_Year1 = li_FilingYear - 2
092600120827           ELSE
092610120827              COMPUTE li_Year1 = lncc_StartingYear
092620120827           END-IF.
092630160229
092640160229145606     PERFORM GetMRQTransID.
092650140609
092660140609      *RFS136198 - Start
092670140616      * Check if Special Module IQEE3 exists
092680140616           INITIALIZE lc_ModuleID
092690140616                      lc_SpecModIQEE3.
092700140616           MOVE lncc_IQEE3              TO lc_ModuleID.
092710140616           CALL "JOBCHKAUT" USING lc_ModuleID
092720140609                                  lc_SpecModIQEE3.
092730140609
092740140609      *RFS136198 - End
092750120827
092760120827      * RFS92917 - START
092770120827      * Check if Special Module EXTQESI exists
092780120827           INITIALIZE WS-MODULE-ID.
092790120827           SET  lb_EXTQESIYes           TO TRUE.
092800120827           MOVE lncc_EXTQESI            TO WS-MODULE-ID.
092810120827           CALL "JOBCHKAUT" USING WS-MODULE-ID
092820120827                                  lc_SpecModEXTQESI.
092830120827
092840120827           IF  lc_SpecModEXTQESI = "Y"
092850120827               SET lb_EXTQESIYes     TO TRUE
092860120827           ELSE
092870120827               SET lb_EXTQESINo         TO TRUE
092880120827           END-IF.
092890120827
092900120827           EXEC SQL
092910120827             DROP TABLE EXTPSETRG
092920120827           END-EXEC.
092930120827
092940120827           EXEC SQL
092950120827             DROP TABLE EXTPSEDTL
092960120827           END-EXEC.
092970120827
092980120827           EXEC SQL
092990120827             DROP TABLE EXTPSESUM
093000120827           END-EXEC.
093010120827
093020120827           EXEC SQL
093030120827             CREATE TABLE QTEMP/EXTPSETRG (
093040120827               AccountNo         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093050120827               BeneficiarySeqNo  NUMERIC ( 3,0) NOT NULL WITH DEFAULT,
093060120827               TradeDate         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093070170302165204*        MRQFileDate       NUMERIC ( 8,0) NOT NULL WITH DEFAULT
093080170302165204         MRQFileDate       NUMERIC ( 8,0) NOT NULL WITH DEFAULT,
093090170302165204         RefileRequest     CHAR    ( 1)   NOT NULL WITH DEFAULT
093100120827               )
093110120827           END-EXEC.
093120120827
093130120827           EXEC SQL
093140120827             CREATE TABLE QTEMP/EXTPSEDTL (
093150120827               AccountNo         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093160120827               BeneficiarySeqNo  NUMERIC ( 3,0) NOT NULL WITH DEFAULT,
093170120827               TradeDate         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093180120827               TransactionID     NUMERIC (10,0) NOT NULL WITH DEFAULT,
093190120827               EAPQESI           NUMERIC (11,2) NOT NULL WITH DEFAULT,
093200120827               TotalEAP          NUMERIC (11,2) NOT NULL WITH DEFAULT,
093210120827               MRQFileDate       NUMERIC ( 8,0) NOT NULL WITH DEFAULT,
093220170302165204*        QCResInd          CHAR    ( 1)   NOT NULL WITH DEFAULT
093230170302165204         QCResInd          CHAR    ( 1)   NOT NULL WITH DEFAULT,
093240170302165204         RefileRequest     CHAR    ( 1)   NOT NULL WITH DEFAULT
093250120827               )
093260120827           END-EXEC.
093270120827
093280120827           EXEC SQL
093290120827             CREATE TABLE QTEMP/EXTPSESUM (
093300120827               AccountNo         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093310120827               BeneficiarySeqNo  NUMERIC ( 3,0) NOT NULL WITH DEFAULT,
093320120827               TradeDate         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093330120827               EAPQESI           NUMERIC (11,2) NOT NULL WITH DEFAULT,
093340120827               TotalEAP          NUMERIC (11,2) NOT NULL WITH DEFAULT,
093350120827               MRQFileDate       NUMERIC ( 8,0) NOT NULL WITH DEFAULT,
093360170302165204*        QCResInd          CHAR    ( 1)   NOT NULL WITH DEFAULT
093370170302165204         QCResInd          CHAR    ( 1)   NOT NULL WITH DEFAULT,
093380170302165204         RefileRequest     CHAR    ( 1)   NOT NULL WITH DEFAULT
093390120827               )
093400120827           END-EXEC.
093410120827
093420120827           EXEC SQL
093430120827             DROP TABLE EXTRPYTRG
093440120827           END-EXEC.
093450120827
093460120827           EXEC SQL
093470120827             DROP TABLE EXTRPYDTL
093480120827           END-EXEC.
093490120827
093500120827           EXEC SQL
093510120827             DROP TABLE EXTRPYSUM
093520120827           END-EXEC.
093530120827
093540120827           EXEC SQL
093550120827             CREATE TABLE QTEMP/EXTRPYTRG (
093560120827               AccountNo         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093570120827               BeneficiarySeqNo  NUMERIC ( 3,0) NOT NULL WITH DEFAULT,
093580120827               TradeDate         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093590120827               MRQFileDate       NUMERIC ( 8,0) NOT NULL WITH DEFAULT,
093600120827               RepaymentReason   CHAR    ( 2)   NOT NULL WITH DEFAULT
093610120827               )
093620120827           END-EXEC.
093630120827
093640120827           EXEC SQL
093650120827             CREATE TABLE QTEMP/EXTRPYDTL (
093660120827               AccountNo         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093670120827               BeneficiarySeqNo  NUMERIC ( 3,0) NOT NULL WITH DEFAULT,
093680120827               TradeDate         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093690120827               TransactionID     NUMERIC (10,0) NOT NULL WITH DEFAULT,
093700120827               QESIAmt           NUMERIC (11,2) NOT NULL WITH DEFAULT,
093710120827               RepaymentSpecAmt  NUMERIC (11,2) NOT NULL WITH DEFAULT,
093720120827               MRQFileDate       NUMERIC ( 8,0) NOT NULL WITH DEFAULT,
093730120827               RepaymentReason   CHAR    ( 2)   NOT NULL WITH DEFAULT,
093740120827               QCResInd          CHAR    ( 1)   NOT NULL WITH DEFAULT
093750120827               )
093760120827           END-EXEC.
093770120827
093780120827           EXEC SQL
093790120827             CREATE TABLE QTEMP/EXTRPYSUM (
093800120827               AccountNo         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093810120827               BeneficiarySeqNo  NUMERIC ( 3,0) NOT NULL WITH DEFAULT,
093820120827               TradeDate         NUMERIC ( 9,0) NOT NULL WITH DEFAULT,
093830120827               QESIAmt           NUMERIC (11,2) NOT NULL WITH DEFAULT,
093840120827               RepaymentSpecAmt  NUMERIC (11,2) NOT NULL WITH DEFAULT,
093850120827               RepaymentReason   CHAR    ( 2)   NOT NULL WITH DEFAULT,
093860120827               MRQFileDate       NUMERIC ( 8,0) NOT NULL WITH DEFAULT,
093870120827               QCResInd          CHAR    ( 1)   NOT NULL WITH DEFAULT
093880120827               )
093890120827           END-EXEC.
093900120827
093910120827      *Moved the DROP and CREATE of EAPPSETBL table from
093920120827      *BuildEapPseTables para to Initial_Steps para
093930120827           EXEC SQL
093940120827             DROP TABLE QTEMP/EAPPSETBL
093950120827           END-EXEC.
093960120827
093970120827           EXEC SQL
093980120827             CREATE TABLE QTEMP/EAPPSETBL (
093990120827               ACCTNO     NUMERIC ( 9)   NOT NULL WITH DEFAULT,
094000120827               BENSEQNO   NUMERIC ( 3)   NOT NULL WITH DEFAULT,
094010120827               YEAR       NUMERIC ( 4)   NOT NULL WITH DEFAULT,
094020120827               QCRSDIND   CHAR    ( 1)   NOT NULL WITH DEFAULT,
094030120827               TRDDATE    DECIMAL ( 9)   NOT NULL WITH DEFAULT,
094040120827               PAYTYPE    NUMERIC ( 2)   NOT NULL WITH DEFAULT,
094050120827               GRSAMT1    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
094060120827               GRSAMT2    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
094070120827               GRSAMT3    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
094080120827               RVSL       CHAR    ( 1)   NOT NULL WITH DEFAULT,
094090120827               CANCEL     CHAR    ( 1)   NOT NULL WITH DEFAULT,
094100120827               MRQAPRSTAT CHAR    ( 1)   NOT NULL WITH DEFAULT,
094110120827               MRQFILEDT  NUMERIC ( 8)   NOT NULL WITH DEFAULT
094120120827               )
094130120827           END-EXEC.
094140120827
094150120827      *Moved the DROP and CREATE of EAPPSETBL5 table from
094160120827      *BuildType06Table para to Initial_Steps para
094170120827           EXEC SQL
094180120827             DROP TABLE QTEMP/EAPPSETBL5
094190120827           END-EXEC.
094200120827
094210120827           EXEC SQL
094220120827             CREATE TABLE QTEMP/EAPPSETBL5 (
094230120827               ACCTNO     NUMERIC ( 9)   NOT NULL WITH DEFAULT,
094240120827               BENSEQNO   NUMERIC ( 3)   NOT NULL WITH DEFAULT,
094250120827               EVTDTE     DECIMAL ( 9)   NOT NULL WITH DEFAULT,
094260120827               CRCRULE    CHAR    ( 2)   NOT NULL WITH DEFAULT,
094270120827               TAXREAS    CHAR    ( 2)   NOT NULL WITH DEFAULT,
094280120827               GRSAMT1    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
094290120827               GRSAMT2    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
094300120827               GRSAMT3    DECIMAL (9, 2) NOT NULL WITH DEFAULT,
094310120827               RVSL       CHAR    ( 1)   NOT NULL WITH DEFAULT,
094320120827               CANCEL     CHAR    ( 1)   NOT NULL WITH DEFAULT,
094330120827               MRQAPRSTAT CHAR    ( 1)   NOT NULL WITH DEFAULT,
094340120827               MRQFILEDT  NUMERIC ( 8)   NOT NULL WITH DEFAULT
094350120827               )
094360120827           END-EXEC.
094370120827      * RFS92917 - END
094380120917
094390120917      * RFS107668 - Start
094400120917           EXEC SQL
094410120917             DROP TABLE QTEMP/WKRSPQESIV
094420120917           END-EXEC.
094430120917
094440120917           EXEC SQL
094450120917             CREATE TABLE QTEMP/WKRSPQESIV (
094460120921               FILING_YEAR    NUMERIC ( 4)   NOT NULL WITH DEFAULT,
094470120921               ACCOUNT_NO     NUMERIC ( 9)   NOT NULL WITH DEFAULT,
094480120921               BENEFICIARY_SEQ_NO
094490120917                              NUMERIC ( 3)   NOT NULL WITH DEFAULT,
094500120921               BENEFICIARY_NAME
094510120917                              CHAR    (41)   NOT NULL WITH DEFAULT,
094520120921               CURRENT_EVENT_TYPE
094530120917                              CHAR    ( 2)   NOT NULL WITH DEFAULT,
094540120917               VARIANCE       CHAR    (30)   NOT NULL WITH DEFAULT
094550120917               )
094560120917           END-EXEC.
094570121018           IF lc_ReportMode = lncc_Y
094580120925             PERFORM Call_FXIQENOT
094590120925           END-IF.
094600120926
094610120925      *---------------------------
094620120925       Call_FXIQENOT.
094630120925      *---------------------------
094640120925           MOVE ZERO           TO IQENOT-AccountNo
094650120925           MOVE ZERO           TO IQENOT-BeneficiarySeqNo
094660120925           MOVE ZERO           TO IQENOT-Year.
094670120925
094680120925           CALL "FXIQENOT" USING IQENOT-AccountNo ,
094690120925                                 IQENOT-BeneficiarySeqNo,
094700120925                                 IQENOT-Year,
094710120925                                 IQENOT-YTDAmount,
094720120925                                 IQENOT-YTDXFR,
094730120925                                 IQENOT-LTDAmount,
094740120925                                 IQENOT-LTDUnassisted,
094750120925                                 IQENOT-LTDAssisted,
094760120925                                 IQENOT-YTDEducation,
094770120925                                 IQENOT-YTDPrematureWD,
094780120925                                 IQENOT-YTDExcessContWD,
094790120925                                 IQENOT-RecordType2,
094800120925                                 IQENOT_ErrorMessageType,
094810120925                                 IQENOT_ErrorMessage,
094820120925                                 IQENOT_StatusCode.
094830120917      * RFS107668 - End
094840120827
094850120827      *---------------------------
094860120827       GetAndUpdate_RespSystParms.
094870120827      *---------------------------
094880120827      ** Note that Filing Year of RSPParm will now be updated by JOBUPQ
094890120827           EXEC SQL
094900120827             SELECT Resp_System_Parameters
094910120827             INTO :lc_Resp_Parms
094920120827             FROM MFARESPPP
094930120827             WHERE COUNTRY_CODE = "CAN" AND
094940120827                   PROVINCE_CODE = "QC"
094950120827           END-EXEC.
094960120827           MOVE SQLSTATE TO lc_sqlStates.
094970120827           IF lncc_sqlSuccessful
094980120827      *        IF lc_LastYearEnd NOT = lc_FilingYear
094990120827      *            MOVE lc_LastYearEnd TO  lc_FilingYear
095000120827      *        END-IF
095010120827               MOVE lc_AsAtDate TO lc_Last_FillingDate
095020121018107668       IF lc_ReportMode NOT = lncc_Y
095030120827               EXEC SQL
095040120827                 UPDATE MFARESPPP
095050120827                 SET Resp_System_Parameters = :lc_Resp_Parms
095060120827                 WHERE COUNTRY_CODE = "CAN" AND
095070120827                       PROVINCE_CODE = "QC"
095080120827               END-EXEC
095090120827               MOVE SQLSTATE TO lc_sqlStates
095100120827               EVALUATE TRUE
095110120827                   WHEN lncc_sqlSuccessful OR lncc_sqlEnd
095120120827                     CONTINUE
095130120827                   WHEN OTHER
095140120827                     SET lncc_Err_U1  TO TRUE
095150120827                     MOVE "MFARESPPP" TO lncc_UpdateFileName
095160120827                     MOVE lncc_ErrorUpdatingFile TO lc_sqlErrShortDESCR
095170120827                     PERFORM SQLFailProcess
095180120827               END-EVALUATE
095190121001107668       END-IF
095200120827           END-IF.
095210120827      *--------------
095220120827       InitialUpdate.
095230120827      *--------------
095240120827      * Always populate SIN in MFAACBIRP from MFAACCBNP prior to filing
095250120827      *        populate at the same time the PCGSeqNo if any
09526012082774636 * populate the PCGSeqNo in a different paragraph
095270121018      * RFS107668 - Start Writes only if Report mode is not set to 'Y'
095280121018107668     IF lc_ReportMode NOT = lncc_Y
095290120827            EXEC SQL
095300120827              UPDATE MFAACBIRP ACBIRP
095310120827              SET ACBIRP.Social_Insurance_No =
095320120827              (SELECT ACCBNP.Social_Insurance_No
095330120827               FROM MFAACCBNP ACCBNP
095340120827               WHERE
095350120827                 ACBIRP.Account_No = ACCBNP.Account_No AND
095360120827                 ACBIRP.Beneficiary_Seq_No = ACCBNP.Beneficiary_Seq_No
09537012082774636          )
09538012082774636 *        ),
09539012082774636 *           ACBIRP.PCG_Seq_No =
09540012082774636 *             CASE WHEN ACBIRP.MRQ_Approval_Status IN ("U", "R")
09541012082774636 *              THEN (SELECT Coalesce(MIN(B.PCG_Seq_No),0)
09542012082774636 *                    FROM MFAACBIRP A
09543012082774636 *                    LEFT OUTER JOIN MFAACPCGP B ON
09544012082774636 *                         A.Account_No = B.Account_No
09545012082774636 *                     WHERE A.Account_No = ACBIRP.Account_No
09546012082774636 *                   )
09547012082774636 *              ELSE ACBIRP.PCG_Seq_No
09548012082774636 *             END
095490121018107668*     END-EXEC.
095500121018107668      END-EXEC
095510120827      * Updating MFAACBIRP with status "S" for records not meeting
095520120827      * seletion criteria for Filing (5 cases)
095530120827      * R52744 added 3 more criterias for not filing when missing
095540120827      * mandatory fields PromoterID/Specimen Plan#/Plan Setup date
095550120827           EXEC SQL
095560120827             UPDATE MFAACBIRP ACBIRP
095570120827             SET ( Mrq_Approval_Status,
095580120827                   Mrq_Approval_Status_Reason
095590120827                 ) =
095600120827             (SELECT
095610120827               "S",
095620120827               CASE WHEN :lc_QC_BusinessNo  = " "          THEN "I012"
09563012082774636 *             WHEN ACCBNP.Beneficiary_Status <> "A"  THEN "I001"
09564012082774636 *             WHEN ADDRB.Province_Code <> "QC"       THEN "I002"
095650120827      *RFS103453 - Begin - Below validations are in MRQVAL, Commented.
095660120827      *             WHEN ACCBNP.Date_Of_Birth <= 0         THEN "I003"
09567012082776555 *             WHEN DIGITS(ZONED(ACBIRP.Year + 1 -
09568012082776555 *                  (ACCBNP.Date_Of_Birth / 10000),4,0)) > 18
09569012082776555 *             WHEN (ZONED(ACBIRP.Year,4,0) -
09570012082776555 *                 ZONED((ACCBNP.Date_Of_Birth / 10000),4,0)) > 17
095710120827      *                                                    THEN "I004"
095720120827      *RFS103453 - End
09573012082774636 *             WHEN ACBIRP.YTD_Amount <= 0            THEN "I005"
09574012082752744               WHEN Coalesce(RESPTP.Specimen_Plan_No," ") = " "
095750120827  ¦                                                        THEN "I013"
09576012082751744               WHEN ACCESP.Plan_Setup_Date <= 0       THEN "I014"
095770120827                    ELSE " "
095780120827               END
095790120827      * RFS84977 - Use inner join instead of implicit one - Starts
09580012082784977 *        FROM MFAACCBNP ACCBNP, MFAACCESP ACCESP,MFAACCNTP ACCNTP
095810120827               FROM MFAACCBNP ACCBNP
095820120827               INNER JOIN MFAACCESP ACCESP ON
095830120827                   ACCESP.Account_No = ACCBNP.Account_No
095840120827               INNER JOIN MFAACCNTP ACCNTP ON
095850120827                   ACCNTP.Account_No = ACCBNP.Account_No
095860120827      * RFS84977 - Ends
09587012082774636 *        LEFT JOIN MFAADDP ADDRB ON
09588012082774636 *            ACCBNP.Addr_No = ADDRB.Addr_No
09589012082752744          LEFT OUTER JOIN MFARESPTP RESPTP ON
095900120827  ¦             ACCNTP.Account_Type_Code = RESPTP.Account_Type_Code AND
095910120827  ¦             ACCESP.Resp_Type_Code = RESPTP.Resp_Type_Code
095920120827               WHERE
09593012082784977 *          ACBIRP.Account_No = ACCESP.Account_No AND
09594012082784977 *          ACBIRP.Account_No = ACCNTP.Account_No AND
095950120827                 ACBIRP.Account_No = ACCBNP.Account_No AND
095960120827      * RFS109131 - Start
09597012082776915 *          ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2       AND
095980120827                 ((ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2     AND
095990120827                   ACBIRP.MRQ_APPROVAL_STATUS = "U")               OR
096000120827                  (ACBIRP.Year <= :li_Year2                        AND
096010120827                   ACBIRP.MRQ_APPROVAL_STATUS = "R"))              AND
096020120827      * RFS109131 - End
096030120827                 ACBIRP.Beneficiary_Seq_No = ACCBNP.Beneficiary_Seq_No
096040120827               )
096050120827               WHERE EXISTS
09606012082774636 *         (SELECT * FROM MFAACCBNP, MFAADDP, MFAACCESP, MFAACCNTP
096070120827      * RFS84977 - Use inner join instead of implicit one - Starts
09608012082784977 *         (SELECT * FROM MFAACCBNP, MFAACCESP, MFAACCNTP
096090120827                (SELECT * FROM MFAACCBNP
096100120827                  INNER JOIN MFAACCESP ON
096110120827                       MFAACCBNP.Account_No = MFAACCESP.Account_No
096120120827                  INNER JOIN MFAACCNTP ON
096130120827                       MFAACCBNP.Account_No = MFAACCNTP.Account_No
096140120827      * RFS84977 - Ends
09615012082752744             LEFT OUTER JOIN MFARESPTP R ON
096160120827  ¦               MFAACCNTP.Account_Type_Code = R.Account_Type_Code AND
096170120827  ¦               MFAACCESP.Resp_Type_Code = R.Resp_Type_Code
09618012082784977 *          WHERE  ACBIRP.Account_No = MFAACCESP.Account_No  AND
09619012082784977            WHERE
09620012082784977 *                 ACBIRP.Account_No = MFAACCNTP.Account_No  AND
096210120827                        ACBIRP.Account_No = MFAACCBNP.Account_No  AND
096220120827      * RFS109131 - Start
09623012082776915 *                 ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2 AND
096240120827                      ((ACBIRP.Year BETWEEN :li_Year1 AND :li_Year2 AND
096250120827                        ACBIRP.MRQ_APPROVAL_STATUS = "U") OR
096260120827                        (ACBIRP.Year <= :li_Year2       AND
096270120827                        ACBIRP.MRQ_APPROVAL_STATUS = "R")) AND
096280120827      * RFS109131 - End
096290120827                        ACBIRP.Beneficiary_Seq_No =
096300120827                                    MFAACCBNP.Beneficiary_Seq_No  AND
09631012082774636 *                 MFAACCBNP.Addr_No = MFAADDP.Addr_No       AND
096320120827109131*                 ACBIRP.Mrq_Approval_Status IN  ("U", "R") AND
09633012082774636                   ACBIRP.Record_Type_2 = "02"               AND
09634012082774636                   (
09635012082774636 *                 (MFAACCBNP.Beneficiary_Status <> "A" OR
09636012082774636 *                  MFAADDP.Province_Code <> "QC"       OR
096370120827103453*                  MFAACCBNP.Date_Of_Birth <= 0        OR
09638012082774636 *                  ACBIRP.YTD_Amount <= 0              OR
09639012082752744                    Coalesce(R.Specimen_Plan_No," ") = " " OR
096400120827                         MFAACCESP.Plan_Setup_Date <= 0         OR
096410120827      *RFS103453 - Begin
09642012082752744 *                  :lc_QC_BusinessNo  = " "               OR
09643012082752744                    :lc_QC_BusinessNo  = " "
09644012082776555 *                  DIGITS(ZONED(ACBIRP.Year + 1 -
09645012082776555 *                   (MFAACCBNP.Date_Of_Birth / 10000),4,0)) > 18
09646012082776555 *                 (ZONED(ACBIRP.Year,4,0) -
09647012082776555 *                 ZONED((MFAACCBNP.Date_Of_Birth /
09648012082776555 *                        10000),4,0)) > 17
096490120827      *RFS103453 - End
096500120827                        )
096510120827                )
096520121018107668*    END-EXEC.
096530121018107668     END-EXEC
096540121018107668*    MOVE SQLSTATE TO lc_sqlStates.
096550121018107668     MOVE SQLSTATE TO lc_sqlStates
096560120827           EVALUATE TRUE
096570120827             WHEN lncc_sqlSuccessful OR lncc_sqlEnd OR lncc_SqlWarning
096580120827                 CONTINUE
096590120827             WHEN OTHER
096600120827                 SET lncc_Err_U2 TO TRUE
096610120827                 MOVE "MFAACBIRP" TO lncc_UpdateFileName
096620120827                 MOVE lncc_ErrorUpdatingFile TO lc_sqlErrShortDESCR
096630120827                 PERFORM SQLFailProcess
096640121018107668*    END-EVALUATE.
096650121018107668     END-EVALUATE
096660121018107668     END-IF.
096670120827
096680120827      *--------------
096690120827       InsertRecord.
096700120827      *--------------
096710121018      * RFS107668 - Start Writes only if Report mode is not set to 'Y'
096720121018107668     IF lc_ReportMode NOT = lncc_Y
096730120925           EXEC SQL
096740120925             INSERT INTO MRQP VALUES(:lc_RecordToInsert)
096750120925           END-EXEC
096760120925           MOVE SQLSTATE TO lc_sqlStates
096770120925           IF not lncc_sqlSuccessful
096780120925              SET lncc_Err_I1 TO TRUE
096790120925              MOVE "MRQP      " TO lncc_InsertFileName
096800120925              MOVE lncc_ErrorInsertingFile TO lc_sqlErrShortDESCR
096810120925              PERFORM SQLFailProcess
096820121018      * RFS107668 - Start
096830121018      *    END-IF.
096840121018           END-IF
096850121018           END-IF.
096860120921      * RFS107668 - End
096870120827
096880120827      *RFS 78268 - Start
096890120827      *--------------
096900120827       Generate02Cancellation.
096910120827      *--------------
096920120827           Initialize MFAMRQRQP OF ltr_02FilingLog
096930120827104599     Initialize li_MFAMRQTXP-COUNT.
096940120827           EXEC SQL
096950120827                SELECT * INTO :MFAMRQRQP
096960120827                FROM   MFAMRQRQP
096970120827                WHERE  ACCOUNT_NO         = :li_C_Account_No
096980120827                  AND  BENEFICIARY_SEQ_NO = :li_C_Ben_Seq_No
096990120827                  AND  YEAR               = :li_C_FilingYear
097000120827                  AND  MRQ_FILE_DATE      = :li_C_MRQ_File_Date
097010120827                  AND  MRQ_VERSION_CODE  <> :lnci_1
097020120827                        FETCH FIRST ROW ONLY
097030120827           END-EXEC
097040120827
097050120827           MOVE SQLSTATE TO lc_sqlStates.
097060120827           IF   lncc_sqlSuccessful
097070120827                SET  lc_OriginalFound TO TRUE
097080120827           Else
097090120827                SET  lc_OriginalNotFound TO TRUE
097100120827              MOVE SQLSTATE     TO WS-SQLSTATE
097110120827              MOVE SQLCODE      TO WS-DSP-SQLCODE
097120120827              MOVE "MFAMRQRQP " To lncc_FileName
097130120827              MOVE lncc_ErrorFetchingCancel  To
097140120827                                   Ws-Sql-Err-Short-Descr
097150120827              PERFORM DisplayError
097160120827           END-IF.
097170120827
097180120827      * RFS104599  - Starts
097190120827           EXEC SQL
097200120827                SELECT COUNT(1) INTO :li_MFAMRQTXP-COUNT
097210120827                FROM   MFAMRQTXP
097220120827                WHERE  ACCOUNT_NO         = :li_C_Account_No
097230120827                  AND  BENEFICIARY_SEQ_NO = :li_C_Ben_Seq_No
097240120827                  AND  EVENT_DATE         = :li_C6_Event_Date
097250120827                  AND  MRQ_FILE_DATE      = :li_C_MRQ_File_Date
097260120827                  AND  MRQ_VERSION_CODE  <> :lnci_1
097270120827                        FETCH FIRST ROW ONLY
097280120827           END-EXEC
097290120827
097300120827           MOVE SQLSTATE TO lc_sqlStates.
097310120827           IF   lncc_sqlSuccessful
097320120827                CONTINUE
097330120827           Else
097340120827                SET  lc_OriginalNotFound TO TRUE
097350120827              MOVE SQLSTATE     TO WS-SQLSTATE
097360120827              MOVE SQLCODE      TO WS-DSP-SQLCODE
097370120827              MOVE "MFAMRQRQP " To lncc_FileName
097380120827              MOVE lncc_ErrorFetchingCancel  To
097390120827                                   Ws-Sql-Err-Short-Descr
097400120827              PERFORM DisplayError
097410120827           END-IF.
097420120827      *    IF lc_OriginalFound
097430120827      *    RFS109558 - Begins - If li_HoldFileDate is set, process cancellation
097440120827      *    IF lc_OriginalFound AND li_MFAMRQTXP-COUNT = 0
097450120827           IF (lc_OriginalFound AND li_MFAMRQTXP-COUNT = 0)
097460120827              OR li_HoldFileDate NOT = 0
097470120827      *    RFS109558 - Ends
097480120827      * RFS104599  - Ends
097490160212      * RFS148410 - Begins
097500160212            IF Lb_CancelFromRecType02
097510160212              MOVE Ben-Addr-No      OF Ltr_02FilingLog
097520160212                                    TO Li_Fetch-AddrNo
097530160212              PERFORM Fetch_Address
097540160212              PERFORM CheckBeneChanges
097550160212            END-IF
097560160212      * RFS148410 - Ends
097570120827              MOVE lnci_1           TO        li_C_Trxn_VersCde
097580120827              MOVE YEAR             OF Ltr_02FilingLog
097590120827                                    TO li_C_FilingYear
097600120827              MOVE VENDOR-BN        OF Ltr_02FilingLog
097610120827                                    TO        lc_C_PromoterID
097620120827              MOVE SPECIMEN-ID      OF Ltr_02FilingLog
097630120827                                    TO        li_C_SpecimenPlanNo
097640120827              MOVE PLAN-SETUP-DATE  OF Ltr_02FilingLog
097650120827                                    TO        li_C_Plan_Setup_Date
097660120827              MOVE IND-SIBLING-ONLY OF Ltr_02FilingLog
097670120827                                    TO        li_C_Resp_Type_Code
097680120827              MOVE NO-OF-YEARS-QC-RESIDENT
097690120827                                    TO        li_C_No_Years_QcResident
097700120827              MOVE YTD-AMOUNT       OF Ltr_02FilingLog
097710120827                                    TO        ln_C_YTD_Amount
097720120827              MOVE YTD-TRANSFER-AMOUNT OF Ltr_02FilingLog
097730120827                                    TO        ln_C_YTD_Transfer_Amount
097740120827              COMPUTE ln_C_YTD_Deposit_Amount =
097750120827                          (YTD-AMOUNT OF Ltr_02FilingLog
097760120827                           + YTD-TRANSFER-AMOUNT OF Ltr_02FilingLog)
097770120827              MOVE LTD-AMOUNT       OF Ltr_02FilingLog
097780120827                                    TO        ln_C_LTD_Amount
097790120827              MOVE BEN-SIN          OF Ltr_02FilingLog
097800120827                                    TO        li_C_Benef_SIN
097810120827              MOVE BEN-LAST-NAME    OF Ltr_02FilingLog
097820120827                                    TO        lc_C_Benef_LastName
097830120827              MOVE BEN-FIRST-NAME   OF Ltr_02FilingLog
097840120827                                    TO        lc_C_Benef_FirstName
097850120827              MOVE BEN-DATE-OF-BIRTH OF Ltr_02FilingLog
097860120827                                    TO        li_C_Benef_DOB
097870120827              MOVE BEN-GENDER       OF Ltr_02FilingLog
097880120827                                    TO        lc_C_Benef_Sex
097890160212      * RFS148410 - Begins
097900160212      *       MOVE Ben-Addr-No      OF Ltr_02FilingLog
097910160212      *                             TO        Li_Fetch-AddrNo
097920160212      *       PERFORM Fetch_Address
097930160212      * RFS148410 - Ends
097940120827              MOVE Lc_Fetch-AptNo    TO  lc_C_Benef_AptNo
097950120827              MOVE Lc_Fetch-CivicNo  TO  lc_C_Benef_StreetNo
097960120827              MOVE Lc_Fetch-Street   TO  lc_C_Benef_StreetName
097970120827              MOVE Lc_Fetch-Addr2    TO  lc_C_Benef_AddLine2
097980120827              MOVE Lc_Fetch-Addr3    TO  lc_C_Benef_AddLine3
097990120827              MOVE Lc_Fetch-City     TO  lc_C_Benef_City
098000120827              MOVE Lc_Fetch-Prov     TO  lc_C_Benef_Prov
098010120827              MOVE Lc_Fetch-Country  TO  lc_C_Benef_Country
098020120827              MOVE Lc_Fetch-Postal   TO     lc_C_Benef_PostalCode
098030120827              MOVE BEN-QC-RESIDENT-IND OF Ltr_02FilingLog
098040120827                                     TO     li_C_Benef_QcResident
098050120827              MOVE SUBSCRIBER-TYPE   OF Ltr_02FilingLog
098060120827                                     TO     li_C_Subsc_Type
098070120827              MOVE IVR-SIN           OF Ltr_02FilingLog
098080120827                                     TO     li_C_Subsc_SIN
098090120827              MOVE IVR-BUSINESS-NUMBER-REVQ OF Ltr_02FilingLog
098100120827                                     TO    lc_C_Subsc_BusNumber
098110120827              MOVE IVR-NAME          OF Ltr_02FilingLog
098120120827                                     TO     lc_C_Subsc_Name
098130120827              MOVE IVR-BEN-RELATION  OF Ltr_02FilingLog
098140120827                                     TO     lc_C_Subsc_BenRelation
098150120827              MOVE Sub-Addr-No OF Ltr_02FilingLog
098160120827                                     TO     Li_Fetch-AddrNo
098170120827              PERFORM Fetch_Address
098180120827              MOVE Lc_Fetch-AptNo    TO     lc_C_Subsc_AptNo
098190120827              MOVE Lc_Fetch-CivicNo  TO     lc_C_Subsc_StreetNo
098200120827              MOVE Lc_Fetch-Street   TO     lc_C_Subsc_StreetName
098210120827              MOVE Lc_Fetch-Addr2    TO     lc_C_Subsc_AddrLine2
098220120827              MOVE Lc_Fetch-Addr3    TO     lc_C_Subsc_AddrLine3
098230120827              MOVE Lc_Fetch-City     TO     lc_C_Subsc_City
098240120827              MOVE Lc_Fetch-Prov     TO     lc_C_Subsc_Prov
098250120827              MOVE Lc_Fetch-Country  TO     lc_C_Subsc_Country
098260120827              MOVE Lc_Fetch-Postal   TO     lc_C_Subsc_PostalCode
098270120827              MOVE IVR-PHONE-NUMBER  OF Ltr_02FilingLog
098280120827                                     TO     lc_C_Subsc_Phone
098290120827              MOVE JNT-SIN           OF Ltr_02FilingLog
098300120827                                     TO     li_C_JoinSub_SIN
098310120827              MOVE JNT-LAST-NAME     OF Ltr_02FilingLog
098320120827                                     TO     lc_C_JoinSub_LastName
098330120827              MOVE JNT-FIRST-NAME    OF Ltr_02FilingLog
098340120827                                     TO     lc_C_JoinSub_FirstName
098350120827              MOVE JNT-BEN-RELATION  OF Ltr_02FilingLog
098360120827                                     TO     lc_C_JoinSub_BenRelation
098370120827              MOVE JNT-PHONE-NUMBER  OF Ltr_02FilingLog
098380120827                                     TO     lc_C_JoinSub_Phone
098390120827              MOVE PCG-TYPE          OF Ltr_02FilingLog
098400120827                                     TO     li_C_PCG_Type_Code
098410120827              MOVE PCG-SIN           OF Ltr_02FilingLog
098420120827                                     TO     li_C_PCG_SIN
098430120827              MOVE PCG-BUSINESS-NUMBER-REVQ OF Ltr_02FilingLog
098440120827                                     TO     lc_C_PCG_BusinessNo
098450120827              MOVE PCG-NAME          OF Ltr_02FilingLog
098460120827                                     TO     lc_C_PCG_Name
098470120827              MOVE PCG-BEN-RELATION  OF Ltr_02FilingLog
098480120827                                     TO     lc_C_PCG_BenRelation
098490120827              MOVE Spaces            TO     lc_C_PCG_Address
098500120827              MOVE PCG-PHONE-NUMBER  OF Ltr_02FilingLog
098510120827                                     TO     lc_C_PCG_PhoneNumber
098520120827              MOVE QESI-ASSIGNMENT-IND OF Ltr_02FilingLog
098530120827                                     TO     lc_C_IQEE_Trnsfr_Ind
098540120827
098550120827              MOVE BENEFICIARY-SEQ-NO  OF Ltr_02FilingLog
098560120827                                     TO     li_C_Ben_seq_no
098570120827
098580120827           INITIALIZE   li_MFAMRQRQP-COUNT
098590120827           MOVE  lncc_N TO   lc_CancelField
098600120827
098610120827           EXEC SQL
098620120827                SELECT COUNT(1) INTO :li_MFAMRQRQP-COUNT
098630120827                FROM   MFAMRQRQP
098640120827                WHERE  MFAMRQRQP.ACCOUNT_NO         = :li_C_Account_No
098650120827                  AND  MFAMRQRQP.BENEFICIARY_SEQ_NO = :li_C_Ben_Seq_No
098660120827                  AND  MFAMRQRQP.YEAR               = :li_C_FilingYear
098670120827                  AND  MFAMRQRQP.BEN_SIN            = :li_C_Benef_SIN
098680120827                  AND  MFAMRQRQP.MRQ_FILE_DATE      = :li_AsAtDate
098690120827                  AND  MFAMRQRQP.MRQ_VERSION_CODE   <> :lnci_1
098700120827            END-EXEC
098710120827
098720120827           IF   li_MFAMRQRQP-COUNT > 0
098730120827                MOVE lncc_Y  TO lc_CancelField
098740120827           END-IF
098750120827
098760120827           IF lc_CancelField  = lncc_N
098770120827      *    RFS109558 - Begins - If li_HoldFileDate is set, process cancellation
098780120827              OR li_HoldFileDate NOT = 0
098790120827      *    RFS109558 - Ends
098800120827              MOVE SPACES               TO lc_C_PCG_AndAll_Filler
098810121018
098820160523      * RFS159637 - START
098830121018      * RFS 107542 - begins.
098840160523      *       MOVE  lncc_PreScribedForm TO lc_C_PCG_AndAll_Filler
098850121018      * RFS 107542 - ends.
098860160523              MOVE  lncc_PreScribedForm TO lc_C_PrescribedForm
098870160523      * RFS159637 - END
098880160219      * RFS145606 - START
098890160229              PERFORM NewSeqNoGen
098900160219              MOVE lc_mrq_trans_id TO lc_C_MRQ_Trans_Id
098910160219              MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
098920160219                                      OF Ltr_02FilingLog
098930160219      * RFS145606 - END
098940121018
098950140923      *RFS139963 - Begins
098960140923              MOVE lc_Current_02_Record TO lc_Temp_02_Record
098970140923              MOVE lc_temp_02_acct TO Li_AccountNo_In
098980140923              PERFORM AccountEdit
098990140923              MOVE Lc_AccountNo_Out  TO lc_temp_02_acct
099000140923              MOVE lc_Temp_02_Record TO lc_RecordToInsert
099010140923      *       MOVE lc_Current_02_Record TO lc_RecordToInsert
099020140923      *RFS139963 - Ends
099030120827              PERFORM InsertRecord
099040120827              COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
099050120827           END-IF
099060120921      * RFS - 107668 Start Updates MRQ-FILE-DATE only if Report <> 'Y'
099070121018           IF lc_ReportMode NOT = lncc_Y
099080120921             MOVE  li_AsAtDate   TO
099090120921                              MRQ-FILE-DATE    OF Ltr_02FilingLog
099100120921           END-IF
099110120921      *    MOVE  li_AsAtDate   TO  MRQ-FILE-DATE    OF Ltr_02FilingLog
099120120921      * RFS - 107668 End
099130120827           MOVE  lnci_1        TO  MRQ-VERSION-CODE OF Ltr_02FilingLog
099140120827      *    RFS78268.33 - Begins - Set AnyOriginal
099150120827           SET Lb_AnyOriginalFound TO TRUE
099160120827      *    RFS78268.33 - Ends
099170120827      *    RFS78268.17 - Begins - Set the filing status
099180120827           MOVE Lncc_P         TO MRQ-APPROVAL-STATUS OF Ltr_02FilingLog
099190120827      *    RFS78268.17 - Ends
099200160425      * RFS158868 - START
099210160219      * RFS145606 - START
099220160425      *       PERFORM NewSeqNoGen
099230160425      *       MOVE lc_mrq_trans_id TO lc_C_MRQ_Trans_Id
099240160425      *       MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
099250160425      *                               OF Ltr_02FilingLog
099260160219      * RFS145606 - END
099270160425      * RFS158868 - END
099280120827           PERFORM  Write02FilingLog
099290120827      * RFS 103463 - Start
099300120827104599*    IF  lb_AmendToZeroYes AND li_MFAMRQTXP-COUNT = 0
099310120827      * RFS 109558 - Start
099320120827104599*    IF  lb_AmendToZeroYes AND li_MFAMRQTXP-COUNT = 0
099330160212
099340160212      * RFS148410 - Begins
099350160212      *    IF  lb_AmendToZeroYes AND li_MFAMRQRQP-COUNT = 0
099360160212           IF  (lb_AmendToZeroYes AND li_MFAMRQRQP-COUNT = 0)
099370160212               OR Lb_BeneChangeYes
099380160212      * RFS148410 - Ends
099390160212
099400120827      * RFS 109558 - End
099410120827               MOVE Lnci_2 TO li_C_Trxn_VersCde
099420120827               MOVE ZEROS  TO ln_C_YTD_Amount
099430120827                              ln_C_YTD_Transfer_Amount
099440120827                              ln_C_YTD_Deposit_Amount
099450160425      * RFS158868 - START
099460160425               PERFORM NewSeqNoGen
099470160425               MOVE lc_mrq_trans_id TO lc_C_MRQ_Trans_Id
099480160425               MOVE lc_mrq_trans_id TO MRQ-TRANS-ID
099490160425                                       OF Ltr_02FilingLog
099500160425      * RFS158868 - END
099510140923      *RFS139963 - Begins
099520140923               MOVE lc_Current_02_Record TO lc_Temp_02_Record
099530140923               MOVE lc_temp_02_acct TO Li_AccountNo_In
099540140923               PERFORM AccountEdit
099550140923               MOVE Lc_AccountNo_Out  TO lc_temp_02_acct
099560140923               MOVE lc_Temp_02_Record TO lc_RecordToInsert
099570140923      *        MOVE lc_Current_02_Record TO lc_RecordToInsert
099580140923      *RFS139963 - Ends
099590120827               PERFORM InsertRecord
099600120827               COMPUTE li_NoOfRecordsProc = li_NoOfRecordsProc + 1
099610120827               MOVE  lnci_2   TO  MRQ-VERSION-CODE OF Ltr_02Filinglog
099620120827      * RFS 103463d - Start - Clear the contents of the filing log as well
099630120827               MOVE ZEROS
099640120827                 TO YTD-AMOUNT          OF Ltr_02FilingLog
099650120827                    YTD-TRANSFER-AMOUNT OF Ltr_02FilingLog
099660120827                    NET-CONTRIBUTION    OF Ltr_02FilingLog
099670120827      * RFS 103463d - Ends
099680120827               PERFORM  Write02FilingLog
099690120827               SET lb_AmendToZeroNo TO TRUE
099700120827           END-IF
099710120827      * RFS 103463 - End
099720120827           END-IF.
099730160212
099740160212      * RFS148410 - Begins
099750160212
099760160212      *-----------------*
099770160212       CheckBeneChanges.
099780160212      *-----------------*
099790160212           MOVE BEN-DATE-OF-BIRTH OF Ltr_02FilingLog TO
099800160212                                       Li_YYYYMMDD.
099810160212           MOVE Li_MMDD        TO Li_BeneMMDDBefore.
099820160212           MOVE Li_C_Benef_DOB TO Li_YYYYMMDD.
099830160212           MOVE Li_MMDD        TO Li_BeneMMDDAfter.
099840160212
099850160212           IF (Li_BeneMMDDBefore      Not = Li_BeneMMDDAfter)       OR
099860160212              (Lc_Fetch-AptNo         Not = lc_C_Benef_AptNo)       OR
099870160212              (Lc_Fetch-CivicNo       Not = lc_C_Benef_StreetNo)    OR
099880160212              (Lc_Fetch-Street        Not = lc_C_Benef_StreetName)  OR
099890160212              (Lc_Fetch-Addr2         Not = lc_C_Benef_AddLine2)    OR
099900160212              (Lc_Fetch-Addr3         Not = lc_C_Benef_AddLine3)    OR
099910160212              (Lc_Fetch-City          Not = lc_C_Benef_City)        OR
099920160212              (Lc_Fetch-Prov          Not = lc_C_Benef_Prov)        OR
099930160212              (Lc_Fetch-Country       Not = lc_C_Benef_Country)     OR
099940160212              (Lc_Fetch-Postal        Not = lc_C_Benef_PostalCode)  OR
099950160212              (BEN-GENDER OF Ltr_02FilingLog     NOT =
099960160212                                               lc_C_Benef_Sex)      OR
099970160212              (BEN-SIN OF Ltr_02FilingLog        NOT =
099980160212                                               li_C_Benef_Sin)      OR
099990160212              (BEN-LAST-NAME OF Ltr_02FilingLog  NOT =
100000160212                                               lc_C_Benef_LastName) OR
100010160212              (BEN-FIRST-NAME OF Ltr_02FilingLog NOT =
100020160212                                               lc_C_Benef_FirstName)
100030160212            Set Lb_BeneChangeYes     TO TRUE
100040160212
100050160212           END-IF.
100060160212
100070160212      * RFS148410 - Ends
100080120827
100090120827      *---------------
100100120827       Request_Address.
100110120827      *---------------
100120120827      * RFS78268.25 - Begins - Initialize fields
100130120827           INITIALIZE Li_Fetch-Ben-AddrNo
100140120827                      Li_Fetch-Sub-AddrNo.
100150120827      * RFS78268.25 - Ends
100160120827
100170120827           EXEC SQL
100180120827                SELECT   COALESCE(RQP.Ben_Addr_No,0),
100190120827                         COALESCE(RQP.Sub_Addr_No,0)
100200120827                  INTO   :Li_Fetch-Ben-AddrNo,
100210120827                         :Li_Fetch-Sub-AddrNo
100220120827
100230120827                  FROM   MFAACCNTP ACCNTP
100240120827
100250120827             LEFT JOIN   MFAMRQRQP RQP ON
100260120827                         ACCNTP.Account_no = RQP.Account_no
100270120827                   AND   RQP.Beneficiary_Seq_No  =
100280120827                         :li_C_ben_seq_no
100290120827                  WHERE  ACCNTP.Account_no =  :li_C_Account_No
100300120827                    AND  RQP.MRQ_Version_Code <> 1
100310120827               ORDER BY  RQP.MRQ_File_Date Desc,
100320120827                         RQP.MRQ_Version_Code
100330120827                  FETCH FIRST ROW ONLY
100340120827
100350120827           END-EXEC.
100360120827
100370120827           MOVE Li_Fetch-Ben-AddrNo   TO Li_Validate-AddrNo.
100380120827
100390120827           MOVE lc_C_Benef_AptNo      TO   Lc_Validate-AptNo
100400120827           MOVE lc_C_Benef_StreetNo   TO   Lc_Validate-CivicNo
100410120827           MOVE lc_C_Benef_StreetName TO   Lc_Validate-Street
100420120827           MOVE lc_C_Benef_AddLine2   TO   Lc_Validate-Addr2
100430120827           MOVE lc_C_Benef_AddLine3   TO   Lc_Validate-Addr3
100440120827           MOVE lc_C_Benef_City       TO   Lc_Validate-City
100450120827           MOVE lc_C_Benef_Prov       TO   Lc_Validate-Prov
100460120827           MOVE lc_C_Benef_Country    TO   Lc_Validate-Country
100470120827           MOVE lc_C_Benef_PostalCode TO   Lc_Validate-Postal.
100480120827
100490120827           PERFORM Validate_Address.
100500120827
100510120827           IF Li_Validate-AddrNo = lnci_0
100520120827              PERFORM Create_Address
100530120827              MOVE Li_Validate-AddrNo TO Li_Fetch-Ben-AddrNo
100540120827           END-IF.
100550120827
100560120827           IF  li_Fetch-Sub-AddrNo = lnci_0
100570120827             MOVE  Li_Fetch-Ben-AddrNo TO li_Fetch-Sub-AddrNo
100580120827           END-IF.
100590120827           MOVE Li_Fetch-Sub-AddrNo      TO Li_Validate-AddrNo.
100600120827           MOVE lc_C_Subsc_AptNo         TO   Lc_Validate-AptNo
100610120827           MOVE lc_C_Subsc_StreetNo      TO   Lc_Validate-CivicNo
100620120827           MOVE lc_C_Subsc_StreetName    TO   Lc_Validate-Street
100630120827           MOVE lc_C_Subsc_AddrLine2     TO   Lc_Validate-Addr2
100640120827           MOVE lc_C_Subsc_AddrLine3     TO   Lc_Validate-Addr3
100650120827           MOVE lc_C_Subsc_City          TO   Lc_Validate-City
100660120827           MOVE lc_C_Subsc_Prov          TO   Lc_Validate-Prov
100670120827           MOVE lc_C_Subsc_Country       TO   Lc_Validate-Country
100680120827           MOVE lc_C_Subsc_PostalCode    TO   Lc_Validate-Postal.
100690120827
100700120827           PERFORM Validate_Address.
100710120827
100720120827           IF Li_Validate-AddrNo = lnci_0
100730120827              IF  Li_Fetch-Sub-AddrNo = Li_Fetch-Ben-AddrNo
100740120827                PERFORM Create_Address
100750120827      *         RFS92917.29 - Begins - Assign to Sub-AddrNo
100760120827      *         MOVE Li_Validate-AddrNo TO Li_Fetch-Ben-AddrNo
100770120827                MOVE Li_Validate-AddrNo TO Li_Fetch-Sub-AddrNo
100780120827      *         RFS92917.29 - Ends
100790120827              ELSE
100800120827                MOVE Li_Fetch-Ben-AddrNo  TO  Li_Fetch-Sub-AddrNo
100810120827                PERFORM Validate_Address
100820120827                IF Li_Validate-AddrNo = lnci_0
100830120827                  PERFORM Create_Address
100840120827      *           RFS92917.29 - Begins - Assign to Sub-AddrNo
100850120827      *           MOVE Li_Validate-AddrNo TO Li_Fetch-Ben-AddrNo
100860120827                  MOVE Li_Validate-AddrNo TO Li_Fetch-Sub-AddrNo
100870120827      *           RFS92917.29 - Ends
100880120827                END-IF
100890120827              END-IF
100900120827           END-IF.
100910120827
100920120827
100930120827      *--------------
100940120827       Validate_Address.
100950120827      *--------------
100960120827           MOVE  Li_Validate-AddrNo TO Li_Fetch-AddrNo.
100970120827
100980120827           PERFORM Fetch_Address.
100990120827
101000120827           IF lc_Validate-AptNo   NOT = lc_Fetch-AptNo    OR
101010120827              lc_Validate-CivicNo NOT = lc_Fetch-CivicNo  OR
101020120827              lc_Validate-Street  NOT = lc_Fetch-Street   OR
101030120827              lc_Validate-Addr2   NOT = lc_Fetch-Addr2    OR
101040120827              lc_Validate-Addr3   NOT = lc_Fetch-Addr3    OR
101050120827              lc_Validate-City    NOT = lc_Fetch-City     OR
101060120827              lc_Validate-Prov    NOT = lc_Fetch-Prov     OR
101070120827              lc_Validate-Country NOT = lc_Fetch-Country  OR
101080120827              lc_Validate-Postal  NOT = lc_Fetch-Postal
101090120827              MOVE lnci_0         TO    li_Validate-AddrNo
101100120827           END-IF.
101110120827
101120120827      *--------------
101130120827       Create_Address.
101140120827      *--------------
101150120827
101160120827           MOVE lncc_AddressNo       To COMM-CONTROL-CODE
101170120827
101180120827           CALL "GETCTLNUM" Using COMM-CONTROL-CODE
101190120827                                  COMM-NEXT-NUMBER
101200120827                                  COMM-RETURN-CODE
101210120827
101220120827           If COMM-RETURN-CODE   = lc_Normal
101230120827              Move COMM-NEXT-NUMBER    TO Li_Validate-AddrNo
101240120827             Else
101250120827                STRING lncc_GetAddNum           DELIMITED BY "  "
101260120827                       " "                      DELIMITED BY SIZE
101270120827                       COMM-RETURN-CODE         DELIMITED BY SIZE
101280120827                INTO Ws-Sql-Err-Short-Descr
101290120827                PERFORM SQLFailProcess
101300120827           END-IF
101310120827
101320120827      *    RFS78268.17 - Begins - Only do this if the Country is USA!
101330120827           IF Lc_Validate-Country = "USA"
101340120827              EXEC SQL
101350120827                SELECT  substr(Province_Code,2)
101360120827                  INTO  :Lc_Validate-Prov
101370120827                  FROM  MFAPRVDCP PRVDC
101380120827                  WHERE PRVDC.PROVINCE_CODE_DESCR = :Lc_Validate-Addr3
101390120827                  FETCH FIRST ROW ONLY
101400120827      *       END-EXEC.
101410120827              END-EXEC
101420120827      *    RFS78268.25 - Begins - move this to within the conditional statement
101430120827              MOVE SQLSTATE TO lc_sqlStates
101440120827              IF NOT lncc_sqlSuccessful
101450120827                 MOVE SPACES TO Lc_Validate-Prov
101460120827              END-IF
101470120827      *    RFS78268.25 - Ends
101480120827           END-IF.
101490120827      *    RFS78268.17 - Ends
101500120827
101510120827      *    RFS78268.25 - Begins - move this to within the conditional statement
101520120827      *    MOVE SQLSTATE TO lc_sqlStates.
101530120827      *    IF NOT lncc_sqlSuccessful
101540120827      *       MOVE SPACES TO Lc_Validate-Prov
101550120827      *    END-IF.
101560120827      *    RFS78268.25 - Ends
101570120827
101580120927      * RFS107668 - Writes only if Report mode is not set to 'Y'
101590121018107668     IF lc_ReportMode NOT = lncc_Y
101600120827           EXEC SQL
101610120827                INSERT INTO MFAADDP
101620120827                       VALUES (:Li_Validate-AddrNo,
101630120827                               SUBSTR(:Lc_Validate-CivicNo,1,6),
101640120827                               SUBSTR(:Lc_Validate-Street,1,30),
101650120827                               SUBSTR(:Lc_Validate-Street,31,6),
101660120827                               SUBSTR(:Lc_Validate-Street,37,2),
101670120827                               :Lc_Validate-City,
101680120827                               :Lc_Validate-Postal,
101690120827                               :Lc_Validate-Country,
101700120827                               :Lc_Validate-Prov,
101710120827                               " ",
101720120827                               :Lc_Validate-AptNo,
101730120827                               :Lc_Validate-Addr2,
101740120827                               " ",
101750120827                               " ",
101760120827                                0,
101770120827                               :lC_CURRENT_PROGRAM,
101780120827                                0,
101790120827                                0,
101800120827                               " ",
101810120827                               " "
101820120827                               )
101830120927      * RFS107668 - Start
101840120927      *    END-EXEC.
101850120927           END-EXEC
101860120827
101870120927      *    MOVE SQLSTATE TO lc_sqlStates.
101880120927           MOVE SQLSTATE TO lc_sqlStates
101890120927      * RFS107668 - End
101900120827           IF   NOT lncc_sqlSuccessful
101910120827                SET lncc_Err_I1 TO TRUE
101920120827                MOVE "MFAADDP   " TO lncc_InsertFileName
101930120827                MOVE lncc_ErrorInsertingFile TO lc_sqlErrShortDESCR
101940120827                PERFORM SQLFailProcess
101950120927      * RFS107668 - Start
101960120927      *    END-IF.
101970120927           END-IF
101980120927           END-IF.
101990120927      * RFS107668 - End
102000120827
102010120827      *  retrive and position the address data from MFAADDP
102020120827      *-------------
102030120827       Fetch_Address.
102040120827      *--------------
102050120827
102060120827           EXEC SQL
102070120827             SELECT ADDP.Misc_First_Addr_Line,
102080120827                    ADDP.Street_No,
102090120827                    SUBSTR (ADDP.Street_Name,1,30) CONCAT
102100120827                    SUBSTR (ADDP.Street_Type_Code,1,6) CONCAT
102110120827                    SUBSTR (ADDP.Street_Dirct_Code,1,2),
102120120827                    ADDP.Misc_Second_Addr_Line,
102130120827                    CASE
102140120827                    WHEN ADDP.Country_Code = "CAN"
102150120827                    THEN " "
102160120827                    WHEN ADDP.Country_Code = "USA"
102170130201      * RFS118702 - Start
102180130201      *             THEN PRVDC.Province_Code_Descr
102190130201                    THEN Coalesce (PRVDC.Province_Code_Descr, " ")
102200130201      * RFS118702 - End
102210120827                    ELSE CNTRY.Country_Name
102220120827                    END,
102230120827                    ADDP.City,
102240120827                    CASE
102250120827                    WHEN ADDP.Country_Code = "CAN"
102260120827                    THEN ADDP.Province_Code
102270120827                    ELSE " "
102280120827                    END,
102290120827                    CASE
102300120827                    WHEN ADDP.Country_Code IN("CAN","USA")
102310120827                    THEN ADDP.Country_Code
102320120827                    ELSE :lncc_AUT
102330120827                    END,
102340120827                    ADDP.Postal_Code
102350120827             INTO   :Lc_Fetch-AptNo,
102360120827                    :Lc_Fetch-CivicNo,
102370120827                    :Lc_Fetch-Street,
102380120827                    :Lc_Fetch-Addr2,
102390120827                    :Lc_Fetch-Addr3,
102400120827                    :Lc_Fetch-City,
102410120827                    :Lc_Fetch-Prov,
102420120827                    :Lc_Fetch-Country,
102430120827                    :Lc_Fetch-Postal
102440120827             FROM   MFAADDP ADDP
102450120827        LEFT JOIN   MFAPRVDCP PRVDC  ON
102460120827                    ADDP.Country_Code  = PRVDC.Country_Code
102470120827             AND    ADDP.Province_Code = PRVDC.Province_Code
102480120827        LEFT JOIN   MFACOUP CNTRY ON
102490120827                    ADDP.Country_Code = CNTRY.Country_Code
102500120827             WHERE  ADDP.Addr_no  = :Li_Fetch-AddrNo
102510120827             FETCH FIRST ROW ONLY
102520120827               END-EXEC.
102530120921
102540120827      *--------------
102550120827       Write02FilingLog.
102560120827      *--------------
102570120921      * RFS107668 - Start - Moved the existing logic into IF condition
102580121018           IF lc_ReportMode NOT = lncc_Y
102590120827      *        RFS78268.25 - Begins - Set the record-type-2
102600120925               MOVE Lncc_02
102610120925                 TO RECORD-TYPE-2
102620120925                    OF Ltr_02FilingLog
102630120827      *        RFS78268.25 - Ends
102640120925               EXEC SQL
102650120925                 INSERT INTO MFAMRQRQP VALUES(:MFAMRQRQP)
102660120925               END-EXEC
102670120827
102680120925               MOVE SQLSTATE TO lc_sqlStates
102690120925               IF not lncc_sqlSuccessful
102700120925                  SET lncc_Err_I1 TO TRUE
102710120925                  MOVE "MFAMRQRQP " TO lncc_InsertFileName
102720120925                  MOVE lncc_ErrorInsertingFile TO lc_sqlErrShortDESCR
102730120925                  PERFORM SQLFailProcess
102740120925               END-IF
102750120921           ELSE
102760121010               INITIALIZE li_Report-Variables
102770121010               MOVE li_C_RecordType       TO lc_ReportFilingRectype
102780120921               MOVE li_C_Plan_Setup_Date  TO li_WK-Contract-Start-Date
102790120921               MOVE li_C_Benef_SIN        TO li_WK-Beneficiary-SIN
102800120921               MOVE li_C_Benef_DOB        TO li_WK-Beneficiary-DOB
102810120921               MOVE li_C_Resp_Type_Code   TO li_WK-RESP-Plan-Type
102820120921               MOVE li_C_Benef_QcResident TO li_WK-QC-Resident-Ind
102830120926               MOVE NET-CONTRIBUTION      OF ltr_02FilingLog
102840120926                                          TO li_WK-Annual-Request-Amt
102850120921               PERFORM Record_Comparison
102860120921           END-IF.
102870120921
102880120924      *-------------
102890120924       Record_Comparison.
102900120924      *-------------
102910121019           SET  lncc_Rec_ExitNO to TRUE.
102920121009
102930121019           IF   lc_ReportFilingRectype = lncc_02
102940121019                PERFORM Check-Record-02 UNTIL lncc_Rec_ExitYes
102950121019           ELSE
102960121019             IF  lc_ReportFilingRectype = lncc_06
102970121019                 AND lc_C6_Tax_Reason_Code = "22" OR "23" OR "24"
102980121019                 PERFORM Check-Record-06 UNTIL lncc_Rec_ExitYes
102990121019             END-IF
103000121019           END-IF.
103010120924
103020121019           IF  lc_ReportFilingRectype = lncc_03
103030121019               PERFORM Check-Record-03 UNTIL lncc_Rec_ExitYes
103040120926           END-IF.
103050120924
103060121019           IF  lc_ReportFilingRectype = lncc_04
103070121019               PERFORM Check-Record-04 UNTIL lncc_Rec_ExitYes
103080121002           END-IF.
103090120924
103100121018           IF lc_ReportFilingRectype = lncc_05
103110121019              PERFORM Check-Record-05 UNTIL lncc_Rec_ExitYes
103120120926           END-IF.
103130120924
103140121019           IF  lc_ReportFilingRectype = lncc_06
103150121019               AND  lc_C6_Tax_Reason_Code NOT =  "22"
103160121019               AND  lc_C6_Tax_Reason_Code NOT =  "23"
103170121019               AND  lc_C6_Tax_Reason_Code NOT =  "24"
103180121019               PERFORM Check-Record-06 UNTIL lncc_Rec_ExitYes
103190121001           END-IF.
103200120924
103210120924      *----------------
103220120924       Check-Record-02.
103230120924      *----------------
103240120924           EXEC SQL
103250121008             SELECT ACCOUNT_NO,
103260121008                    MRQ_FILE_DATE,
103270121008                    BENEFICIARY_SEQ_NO,
103280121008                    PLAN_SETUP_DATE,
103290121008                    BEN_SIN,
103300121008                    BEN_DATE_OF_BIRTH,
103310121008                    IND_SIBLING_ONLY,
103320121008                    BEN_QC_RESIDENT_IND,
103330121008                    NET_CONTRIBUTION,
103340121010                    YEAR,
103350121010                    TRIM(BEN_FIRST_NAME) CONCAT " " CONCAT    +
103360121010                    TRIM(BEN_LAST_NAME)
103370121008               INTO :li_02-Account-No,
103380121008                    :li_02-MRQ-File-Date,
103390121008                    :li_02-Ben-Seq-No,
103400121008                    :li_02-Plan-Setup-Date,
103410121008                    :li_02-Ben-SIN,
103420121008                    :li_02-Ben-DOB,
103430121008                    :li_02-IND-SIB-Only,
103440121008                    :li_02-Ben-QC-Resi-IND,
103450121008                    :li_02-Net-contribution,
103460121010                    :li_02-Year,
103470121010                    :lc_02-Ben-Name
103480121008               FROM MFAMRQRQP
103490121008              WHERE ACCOUNT_NO         = :li_C_Account_No
103500121008                AND BENEFICIARY_SEQ_NO = :li_C_Ben_seq_no
103510121008                AND MRQ_FILE_DATE      = :li_C_Mrq_File_Date
103520121008                AND MRQ_VERSION_CODE  <> 1
103530130201118181          AND YEAR               = :li_C_FilingYear
103540121008           GROUP BY ACCOUNT_NO,
103550121008                    BENEFICIARY_SEQ_NO,
103560121008                    MRQ_FILE_DATE,
103570121008                    PLAN_SETUP_DATE,
103580121008                    BEN_SIN,
103590121008                    BEN_DATE_OF_BIRTH,
103600121008                    IND_SIBLING_ONLY,
103610121008                    BEN_QC_RESIDENT_IND,
103620121008                    NET_CONTRIBUTION,
103630121008                    BEN_FIRST_NAME,
103640121008                    BEN_LAST_NAME,
103650121008                    YEAR,
103660121008                    MRQ_VERSION_CODE
103670130201118181*    ORDER BY YEAR DESC,
103680130201118181     ORDER BY
103690121008                    MRQ_VERSION_CODE DESC
103700121008           FETCH FIRST ROW ONLY
103710120924           END-EXEC.
103720120924           MOVE SQLSTATE TO lc_sqlStates.
103730120924           EVALUATE TRUE
103740120924               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
103750121008                    PERFORM ComparRecord-02
103760121008                    SET lncc_Rec_ExitYes TO TRUE
103770120924               WHEN lncc_sqlEnd
103780121008                    SET lncc_Rec_ExitYes TO TRUE
103790120924               WHEN OTHER
103800120924                    SET lncc_Err_Fetch TO TRUE
103810120924                    MOVE lncc_ErrorFetchMRQRQP
103820120924                      TO lc_sqlErrShortDESCR
103830120924                    PERFORM SQLFailProcess
103840121002                    SET lncc_Rec_ExitYes TO TRUE
103850120924           END-EVALUATE.
103860120929
103870121001      *----------------
103880120930       ComparRecord-02.
103890121001      *----------------
103900121018           IF li_02-Plan-Setup-Date NOT =
103910121018                               li_WK-Contract-Start-Date
103920120924             EXEC SQL
103930120924               INSERT INTO QTEMP/WKRSPQESIV
103940120924                    VALUES (:li_02-Year,
103950120924                            :li_02-Account-No,
103960120924                            :li_02-Ben-Seq-No,
103970121010                            :lc_02-Ben-Name,
103980120927                            "02",
103990120924                            :lnc_Cont-Start-Dte)
104000120924             END-EXEC
104010120924           END-IF.
104020121018           IF li_02-Ben-SIN         NOT =
104030121018                               li_WK-Beneficiary-SIN
104040120924             EXEC SQL
104050120924               INSERT INTO QTEMP/WKRSPQESIV
104060120924                    VALUES (:li_02-Year,
104070120924                            :li_02-Account-No,
104080120924                            :li_02-Ben-Seq-No,
104090121010                            :lc_02-Ben-Name,
104100120927                            "02",
104110120924                            :lnc_Ben-SIN)
104120120924             END-EXEC
104130120924           END-IF.
104140120924
104150121018           IF li_02-Ben-DOB         NOT =
104160121018                               li_WK-Beneficiary-DOB
104170120924             EXEC SQL
104180120924               INSERT INTO QTEMP/WKRSPQESIV
104190120924                    VALUES (:li_02-Year,
104200120924                            :li_02-Account-No,
104210120924                            :li_02-Ben-Seq-No,
104220121010                            :lc_02-Ben-Name,
104230120927                            "02",
104240120924                            :lnc_Ben-DOB)
104250120924             END-EXEC
104260120924           END-IF.
104270120924
104280121018           IF li_02-IND-SIB-Only    NOT =
104290121018                               li_WK-RESP-Plan-Type
104300120924             EXEC SQL
104310120924               INSERT INTO QTEMP/WKRSPQESIV
104320120924                    VALUES (:li_02-Year,
104330120924                            :li_02-Account-No,
104340120924                            :li_02-Ben-Seq-No,
104350121010                            :lc_02-Ben-Name,
104360120927                            "02",
104370120924                            :lnc_RESP-Pln-Type)
104380120924             END-EXEC
104390120924           END-IF.
104400120924
104410121018           IF li_02-Ben-QC-Resi-IND NOT =
104420121018                               li_WK-QC-Resident-Ind
104430120924             EXEC SQL
104440120924               INSERT INTO QTEMP/WKRSPQESIV
104450120924                    VALUES (:li_02-Year,
104460120924                            :li_02-Account-No,
104470120924                            :li_02-Ben-Seq-No,
104480121010                            :lc_02-Ben-Name,
104490120927                            "02",
104500120924                            :lnc_QC-Resi-Ind)
104510120924             END-EXEC
104520120924           END-IF.
104530120924
104540121018           IF li_02-Net-contribution NOT =
104550121018                               li_WK-Annual-Request-Amt
104560120924             EXEC SQL
104570120924               INSERT INTO QTEMP/WKRSPQESIV
104580120924                    VALUES (:li_02-Year,
104590120924                            :li_02-Account-No,
104600120924                            :li_02-Ben-Seq-No,
104610121010                            :lc_02-Ben-Name,
104620120927                            "02",
104630120924                            :lnc_Annual-Req-Amt)
104640120924             END-EXEC
104650120924           END-IF.
104660120926
104670120926      *----------------
104680120926       Check-Record-03.
104690120926      *----------------
104700120926           EXEC SQL
104710121008            SELECT ACCOUNT_NO,
104720121008                   TO_BENEFICIARY_SEQ_NO,
104730121008                   TO_SOCIAL_INSURANCE_NO,
104740121008                   TO_BEN_DATE_OF_BIRTH,
104750121008                   SUBSTR(DEC(:li_C3_REPLACEMENT_DATE),1,4),
104760121010                   TRIM(TO_BEN_FIRST_NAME) CONCAT " " CONCAT   +
104770121010                   TRIM(TO_BEN_LAST_NAME)
104780120926               INTO :li_03-Account-No,
104790120926                    :li_03-To-Ben-Seq-No,
104800121008                    :li_03-TO-SIN,
104810121008                    :li_03-TO-DOB,
104820121008                    :li_03-Year,
104830121010                    :lc_03-Ben-Name
104840120926               FROM MFAMRQBRP
104850120926              WHERE ACCOUNT_NO          = :li_C3_Account_No
104860120926                AND BENEFICIARY_SEQ_NO  = :li_C3_Beneficiary_seq_no
104870120926                AND TO_BENEFICIARY_SEQ_NO
104880120926                                        = :li_C3_To_Beneficiary_seq_no
104890120926                AND REPLACEMENT_DATE    = :li_C3_Replacement_Date
104900120926                AND MRQ_FILE_DATE       = :li_C3_MRQ_File_Date
104910121008                AND MRQ_VERSION_CODE   <> :lnci_1
104920121008           ORDER BY MRQ_VERSION_CODE  DESC
104930121008           FETCH FIRST ROW ONLY
104940120926           END-EXEC.
104950120929
104960120926           MOVE SQLSTATE TO lc_sqlStates.
104970120926           EVALUATE TRUE
104980120926               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
104990121004                    PERFORM ComparRecord-03
105000121004                    SET lncc_Rec_ExitYes TO TRUE
105010120926               WHEN lncc_sqlEnd
105020121004                    SET lncc_Rec_ExitYes TO TRUE
105030120926               WHEN OTHER
105040120926                    SET lncc_Err_Fetch TO TRUE
105050120926                    MOVE lncc_ErrorFetchMRQBRP
105060120926                      TO lc_sqlErrShortDESCR
105070120926                    PERFORM SQLFailProcess
105080121002                    SET lncc_Rec_ExitYes TO TRUE
105090120926           END-EVALUATE.
105100120929
105110121001       ComparRecord-03.
105120120926
105130121018           IF li_03-TO-SIN          NOT =
105140121018                               li_WK-Beneficiary-SIN
105150120926             EXEC SQL
105160120926               INSERT INTO QTEMP/WKRSPQESIV
105170120926                    VALUES (:li_03-Year,
105180120926                            :li_03-Account-No,
105190121018                            :li_03-To-Ben-Seq-No,
105200121010                            :lc_03-Ben-Name,
105210120929                            :lncc_03,
105220120926                            :lnc_Ben-SIN)
105230120926             END-EXEC
105240120926           END-IF.
105250121018           IF li_03-TO-DOB          NOT =
105260121018                               li_WK-Beneficiary-DOB
105270120926             EXEC SQL
105280120926               INSERT INTO QTEMP/WKRSPQESIV
105290120926                    VALUES (:li_03-Year,
105300120926                            :li_03-Account-No,
105310121018                            :li_03-To-Ben-Seq-No,
105320121010                            :lc_03-Ben-Name,
105330120929                            :lncc_03,
105340120926                            :lnc_Ben-DOB)
105350120926             END-EXEC
105360120926           END-IF.
105370120926
105380121002      *----------------
105390121002       Check-Record-04.
105400121002      *----------------
105410121002           EXEC SQL
105420121008             SELECT ACCOUNT_NO,
105430121008                    BENEFICIARY_SEQ_NO,
105440121008                    TRANSFER_SEQ_NO,
105450121008                    TRANSFER_DATE,
105460121008                    MRQ_FILE_DATE,
105470121008                    PLAN_SETUP_DATE,
105480121008                    BEN_SIN,
105490121010                    TRIM(BEN_FIRST_NAME) CONCAT " " CONCAT     +
105500121010                    TRIM(BEN_LAST_NAME),
105510121008                    QUEBEC_ENTERPRISE_NO,
105520121008                    AUTHORIZED_TRANSFER_1,
105530121008                    TOTAL_TRANSFER_IND_1,
105540121008                    TOTAL_TRANSFER_VALUE,
105550121008                    MRQ_ASSISTED_CAPITAL,
105560121008                    MRQ_UNASSISTED_CAPITAL,
105570121008                    IQEE_RECEIVED_AMT,
105580121008                    SUBSTR(DEC(:li_C4_Transfer_Date),1,4),
105590121008                    BEN_DATE_OF_BIRTH
105600121008               INTO :li_04-Account-No,
105610121008                    :li_04-Ben-Seq-No,
105620121008                    :li_04-Transfer-Seq-No,
105630121008                    :li_04-Transfer-Date,
105640121008                    :li_04-MRQ-File-Date,
105650121008                    :li_04-Pln-Setup-Date,
105660121008                    :li_04-Ben-SIN,
105670121008                    :lc_04-Ben-Name,
105680121008                    :lc_04-Quebec-Enterprise-No,
105690121008                    :li_04-Authorized-Transf-1,
105700121008                    :li_04-Transf-Ind-1,
105710121008                    :li_04-Tot-Transf-Value,
105720121008                    :li_04-MRQ-Assis-capital,
105730121008                    :li_04-MRQ-Unassis-Capital,
105740121008                    :li_04-IQEE-Recei-Amt,
105750121008                    :li_04-Year,
105760121008                    :li_04-Ben-DOB
105770121008               FROM MFAMRQXFP
105780121008              WHERE ACCOUNT_NO          = :li_C4_Account_No
105790121008                AND BENEFICIARY_SEQ_NO  = :li_C4_BenSeq_No
105800121008                AND TRANSFER_SEQ_NO     = :li_C4_TrnsfrSeq_No
105810121008                AND TRANSFER_DATE       = :li_C4_Transfer_Date
105820121008                AND MRQ_FILE_DATE       = :li_C4_MRQ_File_Date
105830121008                AND MRQ_VERSION_CODE   <> :lnci_1
105840121008           ORDER BY MRQ_VERSION_CODE  DESC
105850121008           FETCH FIRST ROW ONLY
105860121002           END-EXEC.
105870121002           MOVE SQLSTATE TO lc_sqlStates.
105880121002           EVALUATE TRUE
105890121002               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
105900121002                    PERFORM ComparRecord-04
105910121002                    SET lncc_Rec_ExitYes TO TRUE
105920121002               WHEN lncc_sqlEnd
105930121002                    SET lncc_Rec_ExitYes TO TRUE
105940121002               WHEN OTHER
105950121002                    SET lncc_Err_Fetch TO TRUE
105960121002                    MOVE lncc_ErrorFetchMRQXFP
105970121002                      TO lc_sqlErrShortDESCR
105980121002                    PERFORM SQLFailProcess
105990121002                    SET lncc_Rec_ExitYes TO TRUE
106000121002           END-EVALUATE.
106010121002      *----------------
106020121002       ComparRecord-04.
106030121002      *----------------
106040121008
106050121018           IF li_04-Pln-Setup-Date  NOT =
106060121018                               li_WK-Contract-Start-Date
106070121002             EXEC SQL
106080121002               INSERT INTO QTEMP/WKRSPQESIV
106090121002                    VALUES (:li_04-Year,
106100121002                            :li_04-Account-No,
106110121002                            :li_04-Ben-Seq-No,
106120121002                            :lc_04-Ben-Name,
106130121002                            :lncc_04,
106140121002                            :lnc_Cont-Start-Dte)
106150121002             END-EXEC
106160121002           END-IF.
106170121018           IF li_04-Ben-SIN         NOT =
106180121018                               li_WK-Beneficiary-SIN
106190121002             EXEC SQL
106200121002               INSERT INTO QTEMP/WKRSPQESIV
106210121002                    VALUES (:li_04-Year,
106220121002                            :li_04-Account-No,
106230121002                            :li_04-Ben-Seq-No,
106240121002                            :lc_04-Ben-Name,
106250121002                            :lncc_04,
106260121002                            :lnc_Ben-SIN)
106270121002             END-EXEC
106280121002           END-IF.
106290121018           IF li_04-Ben-DOB         NOT =
106300121018                               li_WK-Beneficiary-DOB
106310121002             EXEC SQL
106320121002               INSERT INTO QTEMP/WKRSPQESIV
106330121002                    VALUES (:li_04-Year,
106340121002                            :li_04-Account-No,
106350121002                            :li_04-Ben-Seq-No,
106360121002                            :lc_04-Ben-Name,
106370121002                            :lncc_04,
106380121002                            :lnc_Ben-DOB)
106390121002             END-EXEC
106400121002           END-IF.
106410121018           IF lc_04-Quebec-Enterprise-No NOT =
106420121018                               lc_WK-NEQ-of-Other-Agent
106430121002             EXEC SQL
106440121002               INSERT INTO QTEMP/WKRSPQESIV
106450121002                    VALUES (:li_04-Year,
106460121002                            :li_04-Account-No,
106470121002                            :li_04-Ben-Seq-No,
106480121002                            :lc_04-Ben-Name,
106490121002                            :lncc_04,
106500121002                            :lnc_NEQ-of-other-agent)
106510121002             END-EXEC
106520121002           END-IF.
106530121018           IF li_04-Authorized-Transf-1  NOT =
106540121018                               li_WK-Authorized-Trans-Ind
106550121002             EXEC SQL
106560121002               INSERT INTO QTEMP/WKRSPQESIV
106570121002                    VALUES (:li_04-Year,
106580121002                            :li_04-Account-No,
106590121002                            :li_04-Ben-Seq-No,
106600121002                            :lc_04-Ben-Name,
106610121002                            :lncc_04,
106620121002                            :lnc_Aut-Transf-Ind)
106630121002             END-EXEC
106640121002           END-IF.
106650121018           IF li_04-Transf-Ind-1         NOT =
106660121018                               li_WK-Total-Transfer-Ind
106670121002             EXEC SQL
106680121002               INSERT INTO QTEMP/WKRSPQESIV
106690121002                    VALUES (:li_04-Year,
106700121002                            :li_04-Account-No,
106710121002                            :li_04-Ben-Seq-No,
106720121002                            :lc_04-Ben-Name,
106730121002                            :lncc_04,
106740121002                            :lnc_Tot-Transf-Ind)
106750121002             END-EXEC
106760121002           END-IF.
106770121018           IF li_04-Tot-Transf-Value     NOT =
106780121018                               li_WK-Total-Transfer-Amt
106790121002             EXEC SQL
106800121002               INSERT INTO QTEMP/WKRSPQESIV
106810121002                    VALUES (:li_04-Year,
106820121002                            :li_04-Account-No,
106830121002                            :li_04-Ben-Seq-No,
106840121002                            :lc_04-Ben-Name,
106850121002                            :lncc_04,
106860121002                            :lnc_Tot-Transf-Amt)
106870121002             END-EXEC
106880121002           END-IF.
106890121018           IF li_04-MRQ-Assis-capital    NOT =
106900121018                               li_WK-Total-Assisted-Amt
106910121002             EXEC SQL
106920121002               INSERT INTO QTEMP/WKRSPQESIV
106930121002                    VALUES (:li_04-Year,
106940121002                            :li_04-Account-No,
106950121002                            :li_04-Ben-Seq-No,
106960121002                            :lc_04-Ben-Name,
106970121002                            :lncc_04,
106980121002                            :lnc_Tot-Assis-Amt)
106990121002             END-EXEC
107000121002           END-IF.
107010121018           IF li_04-MRQ-Unassis-Capital  NOT =
107020121018                               li_WK-Total-Unassisted-Amt
107030121002             EXEC SQL
107040121002               INSERT INTO QTEMP/WKRSPQESIV
107050121002                    VALUES (:li_04-Year,
107060121002                            :li_04-Account-No,
107070121002                            :li_04-Ben-Seq-No,
107080121002                            :lc_04-Ben-Name,
107090121002                            :lncc_04,
107100121002                            :lnc_Tot-Unassis-Amt)
107110121002             END-EXEC
107120121002           END-IF.
107130121018           IF li_04-IQEE-Recei-Amt       NOT =
107140121018                               li_WK-QESI-Amt-Received
107150121002             EXEC SQL
107160121002               INSERT INTO QTEMP/WKRSPQESIV
107170121002                    VALUES (:li_04-Year,
107180121002                            :li_04-Account-No,
107190121002                            :li_04-Ben-Seq-No,
107200121002                            :lc_04-Ben-Name,
107210121002                            :lncc_04,
107220121002                            :lnc_QESI-Amt-Received)
107230121002             END-EXEC
107240121002           END-IF.
107250121002           EXEC SQL
107260121002                 SELECT TRANSFER_STATUS
107270121002                   INTO :lc_04-Transf-Status
107280121002                   FROM MFAARTNP ARTNP
107290121002             INNER JOIN MFAMRQXFP MRQXFP
107300121002                     ON MRQXFP.ACCOUNT_NO      = :li_04-Account-No
107310121002                    AND MRQXFP.TRANSFER_SEQ_NO =
107320121002                                                 :li_04-Transfer-Seq-No
107330121002                    AND MRQXFP.BENEFICIARY_SEQ_NO
107340121002                                               = :li_04-Ben-Seq-No
107350121002                    AND MRQXFP.TRANSFER_DATE   = :li_04-Transfer-Date
107360121002                    AND MRQXFP.MRQ_FILE_DATE   = :li_04-MRQ-File-Date
107370121002                  WHERE ARTNP.ACCOUNT_NO       = :li_04-Account-No
107380121002                    AND ARTNP.TRANSFER_SEQ_NO  = :li_04-Transfer-Seq-No
107390121002                    AND MRQXFP.MRQ_VERSION_CODE
107400121002                                               = :li_04-Txn-Vers-Code
107410121003           END-EXEC.
107420121003           MOVE SQLSTATE TO lc_sqlStates.
107430121003           EVALUATE TRUE
107440121003              WHEN lncc_sqlSuccessful OR lncc_SqlWarning
107450121003                   PERFORM Compare-Transf-Status
107460121003                   SET lncc_Rec_ExitYes TO TRUE
107470121003              WHEN lncc_sqlEnd
107480121003                   SET lncc_Rec_ExitYes TO TRUE
107490121003              WHEN OTHER
107500121003                   SET lncc_Err_Fetch TO TRUE
107510121003                   MOVE lncc_ErrorFetchTransfStatus
107520121003                     TO lc_sqlErrShortDESCR
107530121003                   PERFORM SQLFailProcess
107540121003                   SET lncc_Rec_ExitYes TO TRUE
107550121003           END-EVALUATE.
107560121003
107570121003       Compare-Transf-Status.
107580121018           IF lc_04-Transf-Status = lncc_R
107590121018             IF li_04-Txn-Vers-Code NOT = lnci_1
107600121002                 EXEC SQL
107610121002                   INSERT INTO QTEMP/WKRSPQESIV
107620121002                     VALUES (:li_04-Year,
107630121002                             :li_04-Account-No,
107640121002                             :li_04-Ben-Seq-No,
107650121002                             :lc_04-Ben-Name,
107660121002                             :lncc_04,
107670121002                             :lnc_Transf-Status)
107680121002                 END-EXEC
107690121002             END-IF
107700121002           END-IF.
107710121002
107720120926      *----------------
107730120926       Check-Record-05.
107740120926      *----------------
107750120926           EXEC SQL
107760121008             SELECT ACCOUNT_NO,
107770121008                    BENEFICIARY_SEQ_NO,
107780121008                    BEN_SIN,
107790121008                    BEN_DATE_OF_BIRTH,
107800121008                    SUBSTR(DEC(:li_C5_Payment_Date),1,4),
107810121010                    TRIM(BEN_FIRST_NAME) CONCAT " " CONCAT   +
107820121010                    TRIM(BEN_LAST_NAME)
107830121008               INTO :li_05-Account-No,
107840121010                    :li_05-Ben-Seq-No,
107850121008                    :li_05-Ben-SIN,
107860121008                    :li_05-Ben-DOB,
107870121008                    :li_05-Year,
107880121010                    :lc_05-Ben-Name
107890121008               FROM MFAMRQTP
107900121008              WHERE ACCOUNT_NO         = :li_C5_Account_No
107910121008                AND BENEFICIARY_SEQ_NO = :li_C5_Beneficiary_Seq_No
107920121008                AND PAYMENT_DATE_MRQ   = :li_C5_Payment_Date
107930121008                AND PAYMENT_TYPE_2     = :li_C5_Payment_Type
107940121008                AND MRQ_FILE_DATE      = :li_C5_MRQ_File_Date
107950121008                AND MRQ_VERSION_CODE   <> :lnci_1
107960121008           ORDER BY MRQ_VERSION_CODE  DESC
107970121008           FETCH FIRST ROW ONLY
107980120926           END-EXEC.
107990120927           MOVE SQLSTATE TO lc_sqlStates.
108000120927           EVALUATE TRUE
108010120927               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
108020121001                    PERFORM ComparRecord-05
108030121001                    SET lncc_Rec_ExitYes TO TRUE
108040120927               WHEN lncc_sqlEnd
108050121001                    SET lncc_Rec_ExitYes TO TRUE
108060120927               WHEN OTHER
108070120927                    SET lncc_Err_Fetch TO TRUE
108080120927                    MOVE lncc_ErrorFetchMRQTP
108090120927                      TO lc_sqlErrShortDESCR
108100120927                    PERFORM SQLFailProcess
108110121001                    SET lncc_Rec_ExitYes TO TRUE
108120120927           END-EVALUATE.
108130121001
108140121001      *----------------
108150121001       ComparRecord-05.
108160121001      *----------------
108170121008
108180121018           IF li_05-Ben-SIN         NOT =
108190121018                               li_WK-Beneficiary-SIN
108200120927             EXEC SQL
108210120927               INSERT INTO QTEMP/WKRSPQESIV
108220120927                    VALUES (:li_05-Year,
108230120927                            :li_05-Account-No,
108240120927                            :li_05-Ben-Seq-No,
108250121010                            :lc_05-Ben-Name,
108260121001                            :lncc_05,
108270120927                            :lnc_Ben-SIN)
108280120927             END-EXEC
108290120927           END-IF.
108300121018           IF li_05-Ben-DOB         NOT =
108310121018                               li_WK-Beneficiary-DOB
108320120927             EXEC SQL
108330120927               INSERT INTO QTEMP/WKRSPQESIV
108340120927                    VALUES (:li_05-Year,
108350120927                            :li_05-Account-No,
108360120927                            :li_05-Ben-Seq-No,
108370121010                            :lc_05-Ben-Name,
108380121001                            :lncc_05,
108390120927                            :lnc_Ben-DOB)
108400120927             END-EXEC
108410120927           END-IF.
108420121001      *---------------
108430121001       Check-Record-06.
108440121001      *---------------
108450121001           EXEC SQL
108460121008             SELECT ACCOUNT_NO,
108470121008                    BENEFICIARY_SEQ_NO,
108480121008                    SPECIAL_TAX_REASON,
108490121008                    BEN_SIN,
108500121008                    BEN_DATE_OF_BIRTH,
108510121008                    SUBSTR(DEC(:li_C6_Event_Date),1,4),
108520121010                    TRIM(BEN_FIRST_NAME) CONCAT " " CONCAT    +
108530121010                    TRIM(BEN_LAST_NAME),
108540121008                    CONTRIBUTION_WITHDRAWN_AMT
108550121001                    INTO :li_06-Account-No,
108560121001                         :li_06-Ben-Seq-No,
108570121001                         :lc_06-Spec-Tax-Reason,
108580121008                         :li_06-Ben-SIN,
108590121008                         :li_06-Ben-DOB,
108600121008                         :li_06-Year,
108610121010                         :lc_06-Ben-Name,
108620121008                         :li_06-Contr-Withdrawal-Amt
108630121001                    FROM MFAMRQTXP
108640121006                   WHERE ACCOUNT_NO         = :li_C6_Account_No
108650121001                     AND BENEFICIARY_SEQ_NO = :li_C6_Beneficiary_Seq_No
108660121001                     AND EVENT_DATE         = :li_C6_Event_Date
108670121001                     AND MRQ_FILE_DATE      = :li_C6_MRQ_File_Date
108680121008                     AND MRQ_VERSION_CODE   <> :lnci_1
108690130201118181               AND SPECIAL_TAX_REASON = :lc_C6_Tax_Reason_Code
108700121008                ORDER BY MRQ_VERSION_CODE  DESC
108710121008                FETCH FIRST ROW ONLY
108720121001           END-EXEC.
108730121001           MOVE SQLSTATE TO lc_sqlStates.
108740121001           EVALUATE TRUE
108750121001               WHEN lncc_sqlSuccessful OR lncc_SqlWarning
108760121001                    PERFORM ComparRecord-06
108770121001                    SET lncc_Rec_ExitYes TO TRUE
108780121001               WHEN lncc_sqlEnd
108790121001                    SET lncc_Rec_ExitYes TO TRUE
108800121001               WHEN OTHER
108810121001                    SET lncc_Err_Fetch TO TRUE
108820121001                    MOVE lncc_ErrorFetchMRQTXP
108830121001                      TO lc_sqlErrShortDESCR
108840121001                    PERFORM SQLFailProcess
108850121001                    SET lncc_Rec_ExitYes TO TRUE
108860121001           END-EVALUATE.
108870121001      *----------------
108880121001       ComparRecord-06.
108890121001      *----------------
108900121008
108910121018           IF li_06-Ben-SIN         NOT =
108920121018                               li_WK-Beneficiary-SIN
108930121001             EXEC SQL
108940121001               INSERT INTO QTEMP/WKRSPQESIV
108950121001                    VALUES (:li_06-Year,
108960121001                            :li_06-Account-No,
108970121001                            :li_06-Ben-Seq-No,
108980121010                            :lc_06-Ben-Name,
108990121001                            :lncc_06,
109000121001                            :lnc_Ben-SIN)
109010121001             END-EXEC
109020121001           END-IF.
109030121018           IF li_06-Ben-DOB         NOT =
109040121018                               li_WK-Beneficiary-DOB
109050121001             EXEC SQL
109060121001               INSERT INTO QTEMP/WKRSPQESIV
109070121001                    VALUES (:li_06-Year,
109080121001                            :li_06-Account-No,
109090121001                            :li_06-Ben-Seq-No,
109100121010                            :lc_06-Ben-Name,
109110121001                            :lncc_06,
109120121001                            :lnc_Ben-DOB)
109130121001             END-EXEC
109140121001           END-IF.
109150121018           IF lc_06-Spec-Tax-Reason NOT =
109160121018                                lc_WK-SpecTaxReasonCode
109170121001             EXEC SQL
109180121001               INSERT INTO QTEMP/WKRSPQESIV
109190121001                    VALUES (:li_06-Year,
109200121001                            :li_06-Account-No,
109210121001                            :li_06-Ben-Seq-No,
109220121001                            :lc_06-Ben-Name,
109230121001                            :lncc_06,
109240121001                            :lnc_Special-Tax-Reason-Code)
109250121001             END-EXEC
109260121001           END-IF.
109270121018           IF li_06-Contr-Withdrawal-Amt NOT =
109280121018                                li_WK-Annual-Request-Amt
109290121001             EXEC SQL
109300121001               INSERT INTO QTEMP/WKRSPQESIV
109310121001                    VALUES (:li_06-Year,
109320121001                            :li_06-Account-No,
109330121001                            :li_06-Ben-Seq-No,
109340121001                            :lc_06-Ben-Name,
109350121001                            :lncc_06,
109360121001                            :lnc_Annual-Req-Amt)
109370121001             END-EXEC
109380121001           END-IF.
109390121001
109400120924      * RFS107668 - End
109410120924
109420120827      * RFS92917 - START
109430120827      *-------------
109440120827       EXTQESI_Type05.
109450120827      *-------------
109460120827           EXEC SQL
109470120827             INSERT INTO QTEMP/EXTPSETRG
109480120827             SELECT TRNQAP.Account_No,
109490120827                    TRNQAP.Beneficiary_Seq_No,
109500120827                    MRQTSP.Trade_Date,
109510170302      *RFS165204 - Start
109520170302      *             :lnci_0
109530170302                    :lnci_0,
109540170302                    MAX(CASE
109550170302                     WHEN TRNQAP.MRQ_Approval_Status = :lncc_Refiling
109560170302                     THEN :Lncc_Y
109570170302                     ELSE :Lncc_N
109580170302                    END)
109590170302      *RFS165204 - End
109600170302
109610120827             FROM   MFATRNQAP TRNQAP
109620120827             JOIN   MFAMRQTSP MRQTSP
109630120827             ON     TRNQAP.TRANSACTION_ID_2  = MRQTSP.Transaction_ID_2
109640120827
109650120827      *RFS105558 - Start
109660120827      *      WHERE  TRNQAP.MRQ_Approval_Status = :lncc_Unfiled
109670120827      *      AND    MRQTSP.transaction_type_2  = :lncc_13
109680120827104129*      AND    ZONED(MRQTSP.Trade_Date / 10000,4,0)
109690120827104129*             BETWEEN  :li_Year1 AND :li_Year2
109700121001      * RFS107668 - Start
109710121001      *      WHERE  ((TRNQAP.MRQ_Approval_Status
109720121001             WHERE  (:lc_ReportMode <> :lncc_Y AND
109730121001                    ((TRNQAP.MRQ_Approval_Status
109740121001      * RFS107668 - End
109750120827                         IN (:lncc_Refiling, :lncc_Unfiled)
109760120827                      AND ZONED(MRQTSP.Trade_Date / 10000,4,0)
109770120827      * RFS109131 - Start
109780120827      *               BETWEEN  :li_Year1 AND :li_Year2 )
109790120827                      <= :li_Year2 )
109800120827      * RFS109131 - End
109810120827                      OR  (TRNQAP.MRQ_Approval_Status
109820120827                         IN (:lncc_O, :lncc_M, :lncc_C)))
109830120827             AND    MRQTSP.transaction_type_2  = :lncc_13
109840121001      * RFS107668 - Start
109850121001             )
109860121001             OR (:lc_ReportMode = :lncc_Y AND
109870130201      * RFS118702 - Start
109880130201      *      (TRNQAP.MRQ_FILE_DATE > lnci_0 AND
109890130201             (TRNQAP.MRQ_FILE_DATE > :lnci_0 AND
109900130201      * RFS118702 - End
109910121003              (ZONED(MRQTSP.Trade_Date / 10000,4,0)
109920121003              BETWEEN :li_ProcessFilingYear AND :li_Year2) AND
109930121001              MRQTSP.transaction_type_2  = :lncc_13))
109940120827      *RFS105558 - End
109950121001      * RFS107668 - End
109960120827
109970120827             GROUP BY TRNQAP.Account_No,
109980120827                      TRNQAP.Beneficiary_Seq_No,
109990120827                      MRQTSP.Trade_Date
110000120827           END-EXEC.
110010120827
110020120827           EXEC SQL
110030120827             UPDATE QTEMP/EXTPSETRG TRG
110040120827             SET    MRQFileDate = IFNULL((
110050120827               SELECT MAX(MRQT.Mrq_File_Date)
110060120827               FROM   MFAMRQTP MRQT
110070120827               WHERE  TRG.AccountNo         = MRQT.Account_No
110080120827               AND    TRG.BeneficiarySeqNo  = MRQT.Beneficiary_Seq_no
110090120827               AND    TRG.TradeDate         = MRQT.Payment_Date_Mrq
110100120827               AND    MRQT.MRQ_Version_Code <> 1),0)
110110120827           END-EXEC.
110120120827
110130120827           EXEC SQL
110140120827             INSERT INTO QTEMP/EXTPSEDTL
110150120827             SELECT MRQTSP.ACCOUNT_NO,
110160120827                    MRQTSP.BENEFICIARY_SEQ_NO,
110170120827                    MRQTSP.Trade_Date,
110180120827                    MRQTSP.TRANSACTION_ID_2,
110190120827                    CASE
110200120827                     WHEN MRQTSP.REVERSAL_FLAG = :Lncc_Y
110210120827                     THEN :Lnci_0
110220120827                     ELSE MRQTSP.EAP_IQEE
110230120827                    END,
110240120827                    CASE
110250120827                     WHEN MRQTSP.REVERSAL_FLAG = :Lncc_Y
110260120827                     THEN :Lnci_0
110270120827                     ELSE MRQTSP.GROSS_AMT
110280120827                    END,
110290120827                    PSETRG.MRQFileDate,
110300170302165204*             IFNULL(TRNQAP.QC_RESIDENT_IND,:Lncc_N)
110310170302165204              IFNULL(TRNQAP.QC_RESIDENT_IND,:Lncc_N),
110320170302165204              PSETRG.RefileRequest
110330120827             FROM  MFAMRQTSP MRQTSP
110340120827             JOIN  QTEMP/EXTPSETRG PSETRG
110350120827             ON    PSETRG.AccountNo        = MRQTSP.Account_No
110360120827             AND   PSETRG.BeneficiarySeqNo = MRQTSP.Beneficiary_Seq_no
110370120827             AND   PSETRG.TradeDate        = MRQTSP.TRADE_DATE
110380120827             AND   MRQTSP.transaction_type_2 = :lncc_13
110390120827             LEFT  JOIN MFATRNQAP TRNQAP
110400120827             ON    MRQTSP.TRANSACTION_ID_2 = TRNQAP.TRANSACTION_ID_2
110410121029      *RFS114764 - Start
110420121029             AND MRQTSP.Beneficiary_Seq_No = TRNQAP.Beneficiary_Seq_No
110430121029      *RFS114764 - End
110440120827           END-EXEC.
110450120827
110460120827           EXEC SQL
110470120827             INSERT INTO QTEMP/EXTPSESUM
110480120827             SELECT PSEDTL.AccountNo,
110490120827                    PSEDTL.BeneficiarySeqNo,
110500120827                    PSEDTL.TradeDate,
110510120827                    SUM(PSEDTL.EAPQESI),
110520120827                    SUM(PSEDTL.TotalEAP),
110530120827                    MAX(PSEDTL.MRQFileDate),
110540170302165204*             MAX(PSEDTL.QCResInd)
110550170302165204              MAX(PSEDTL.QCResInd),
110560170302165204              MAX(PSEDTL.RefileRequest)
110570120827             FROM   QTEMP/EXTPSEDTL PSEDTL
110580120827             GROUP  BY PSEDTL.AccountNo,
110590120827                       PSEDTL.BeneficiarySeqNo,
110600120827                       PSEDTL.TradeDate
110610120827           END-EXEC.
110620120827
110630120827           Perform CreateEapPseCursor.
110640120827           SET lb_EndOfCursorFalse TO TRUE.
110650120827           PERFORM Create_EapPse UNTIL lb_EndOfCursorTrue.
110660120827
110670120827       EXTQESI_Status05_Update.
110680140421130249     MOVE Li_C5_Payment_Date TO li_YYYYMMDD.
110690120827           EXEC SQL
110700120827             UPDATE MFATRNQAP TRNQAP
110710120827             SET TRNQAP.Mrq_Approval_Status = "P",
110720120827                 TRNQAP.Mrq_Approval_Status_Reason = " ",
110730120827                 TRNQAP.Mrq_File_Date = :li_AsAtDate
110740140421130249          ,TRNQAP.YEAR = :li_YYYY
110750120827             WHERE TRNQAP.TRANSACTION_ID_2 =
110760120827             (SELECT PSEDTL.TransactionID
110770120827              FROM   QTEMP/EXTPSEDTL PSEDTL
110780120827              WHERE  TRNQAP.TRANSACTION_ID_2 = PSEDTL.TransactionID
110790120827                AND PSEDTL.AccountNo = :Li_C5_Account_No
110800120827                AND PSEDTL.BeneficiarySeqNo = :Li_C5_Beneficiary_Seq_No
110810120827                AND PSEDTL.Tradedate = :Li_C5_Payment_Date)
110820120827           END-EXEC.
110830120827
110840120827       EXTQESI_Type06.
110850120827           EXEC SQL
110860120827             INSERT INTO QTEMP/EXTRPYTRG
110870120827             SELECT MRQTSP.ACCOUNT_NO,
110880120827                    MRQTSP.BENEFICIARY_SEQ_NO,
110890120827                    MRQTSP.TRADE_DATE,
110900120827                    :lnci_0,
110910170118164896*             MRQTSP.REPAYMENT_REASON_CODE
110920170118164896              DIGITS(MRQTSP.REPAYMENT_REASON_CODE)
110930120827             FROM   MFAMRQTSP MRQTSP
110940120827             JOIN   MFATRNQAP TRNQAP
110950120827             ON     MRQTSP.TRANSACTION_ID_2 = TRNQAP.TRANSACTION_ID_2
110960120827
110970120827      *RFS105558 - Start
110980120827      *      WHERE  TRNQAP.MRQ_Approval_Status   = :lncc_Unfiled
110990120827      *      AND    MRQTSP.TRANSACTION_TYPE_2    = :lncc_21
111000120827      *      AND    MRQTSP.Repayment_Reason_Code <> :lncc_22
111010120827104129*      AND    ZONED(MRQTSP.Trade_Date / 10000,4,0)
111020120827104129*             BETWEEN  :li_Year1 AND :li_Year2
111030121001      * RFS107668 - Start
111040121001      *      WHERE  ((TRNQAP.MRQ_Approval_Status
111050160830      *  RFS161999 - Begins - Comment original WHERE clause
111060160830      *       WHERE  (:lc_ReportMode <> :lncc_Y AND
111070160830      ** RFS107668 - End
111080160830      *              ((TRNQAP.MRQ_Approval_Status
111090160830      *                       IN (:lncc_Refiling, :lncc_Unfiled)
111100160830      *              AND    ZONED(MRQTSP.Trade_Date / 10000,4,0)
111110160830      ** RFS109131 - Start
111120160830      **             BETWEEN  :li_Year1 AND :li_Year2 )
111130160830      *               <= :li_Year2 )
111140160830      ** RFS109131 - End
111150160830      *              OR  (TRNQAP.MRQ_Approval_Status
111160160830      *              IN  (:lncc_O, :lncc_M, :lncc_C)))
111170160830      ** RFS107668 - Start
111180160830      *              )
111190160830      *              OR (:lc_ReportMode = :lncc_Y AND
111200160830      ** RFS118702 - Start
111210160830      **             (TRNQAP.MRQ_FILE_DATE > lnci_0 AND
111220160830      *              (TRNQAP.MRQ_FILE_DATE > :lnci_0 AND
111230160830      ** RFS118702 - End
111240160830      *             (ZONED(MRQTSP.Trade_Date / 10000,4,0)
111250160830      *              BETWEEN :li_ProcessFilingYear AND :li_Year2)))
111260160830      * RFS 161999 - Add brackets
111270160830             WHERE  ( (:lc_ReportMode <> :lncc_Y AND
111280160830                    ((TRNQAP.MRQ_Approval_Status
111290160830                             IN (:lncc_Refiling, :lncc_Unfiled)
111300160830                    AND    ZONED(MRQTSP.Trade_Date / 10000,4,0)
111310160830                     <= :li_Year2 )
111320160830                    OR  (TRNQAP.MRQ_Approval_Status
111330160830                    IN  (:lncc_O, :lncc_M, :lncc_C)))
111340160830                    )
111350160830                    OR (:lc_ReportMode = :lncc_Y AND
111360160830                    (TRNQAP.MRQ_FILE_DATE > :lnci_0 AND
111370160830                   (ZONED(MRQTSP.Trade_Date / 10000,4,0)
111380160830                    BETWEEN :li_ProcessFilingYear AND :li_Year2))) )
111390160830      * RFS 161999 - Ends
111400120827                    AND MRQTSP.TRANSACTION_TYPE_2    = :lncc_21
111410120827                    AND MRQTSP.Repayment_Reason_Code <> :lncc_22
111420120827      *RFS105558 - End
111430120827
111440120827             GROUP BY MRQTSP.ACCOUNT_NO,
111450120827                      MRQTSP.BENEFICIARY_SEQ_NO,
111460120827                      MRQTSP.TRADE_DATE,
111470120827                      MRQTSP.REPAYMENT_REASON_CODE
111480120827           END-EXEC.
111490120827
111500120827           EXEC SQL
111510120827             UPDATE QTEMP/EXTRPYTRG TRG
111520120827             SET    MRQFileDate = IFNULL((
111530120827               SELECT MAX(MRQTX.Mrq_File_Date)
111540120827               FROM   MFAMRQTXP MRQTX
111550120827               WHERE  TRG.AccountNo          = MRQTX.Account_No
111560120827               AND    TRG.BeneficiarySeqNo   = MRQTX.Beneficiary_Seq_no
111570120827               AND    TRG.TradeDate          = MRQTX.Event_Date
111580120827               AND    TRG.RepaymentReason    = MRQTX.Special_Tax_Reason
111590120827               AND    MRQTX.MRQ_Version_Code <>  1),0)
111600120827           END-EXEC.
111610120827
111620120827           EXEC SQL
111630120827             INSERT INTO QTEMP/EXTRPYDTL
111640120827             SELECT MRQTSP.ACCOUNT_NO,
111650120827                    MRQTSP.BENEFICIARY_SEQ_NO,
111660120827                    MRQTSP.TRADE_DATE,
111670120827                    MRQTSP.TRANSACTION_ID_2,
111680120827                    CASE
111690120827                     WHEN MRQTSP.REVERSAL_FLAG = :Lncc_Y
111700120827                     OR   MRQTSP.Repayment_Reason_code = :lncc_22
111710120827                     THEN :Lnci_0
111720120827                     ELSE MRQTSP.GROSS_AMT
111730120827                    END,
111740120827                    CASE
111750120827                     WHEN MRQTSP.REVERSAL_FLAG = :Lncc_Y
111760120827                     OR   MRQTSP.Repayment_Reason_code = :lncc_22
111770120827                     THEN :Lnci_0
111780120827                     ELSE MRQTSP.REPAYMENT_SPECIFIC_AMT
111790120827                    END,
111800120827                    TRG.MRQFileDate,
111810120827                    CASE
111820120827                     WHEN MRQTSP.REVERSAL_FLAG = :Lncc_Y
111830120827                     OR   MRQTSP.Repayment_Reason_code = :lncc_22
111840120827                     THEN :Lnci_0
111850120827                     ELSE MRQTSP.REPAYMENT_REASON_CODE
111860120827                    END,
111870120827                    IFNULL(TRNQAP.QC_RESIDENT_IND,:Lncc_N)
111880120827             FROM   MFAMRQTSP MRQTSP
111890120827             JOIN   QTEMP/EXTRPYTRG TRG
111900120827             ON     TRG.AccountNo = MRQTSP.Account_No
111910120827             AND    TRG.BeneficiarySeqNo = MRQTSP.Beneficiary_Seq_no
111920120827             AND    TRG.TradeDate = MRQTSP.TRADE_DATE
111930120827             AND    TRG.RepaymentReason = MRQTSP.REPAYMENT_REASON_CODE
111940120827             AND    MRQTSP.transaction_type_2 = :lncc_21
111950120827             LEFT JOIN MFATRNQAP TRNQAP
111960120827             ON     MRQTSP.TRANSACTION_ID_2 = TRNQAP.TRANSACTION_ID_2
111970121029      *RFS114764 - Start
111980121029             AND MRQTSP.Beneficiary_Seq_No = TRNQAP.Beneficiary_Seq_No
111990121029      *RFS114764 - End
112000120827           END-EXEC.
112010120827
112020120827
112030120827           EXEC SQL
112040120827             INSERT INTO QTEMP/EXTRPYSUM
112050120827             SELECT DTL.AccountNo,
112060120827                    DTL.BeneficiarySeqNo,
112070120827                    DTL.TradeDate,
112080120827                    SUM(DTL.QESIAmt),
112090120827                    SUM(DTL.RepaymentSpecAmt),
112100120827                    DTL.RepaymentReason,
112110120827                    MAX(DTL.MRQFileDate),
112120120827                    MAX(DTL.QCResInd )
112130120827             FROM   QTEMP/EXTRPYDTL DTL
112140120827             GROUP BY DTL.AccountNo,
112150120827                      DTL.BeneficiarySeqNo,
112160120827                      DTL.TradeDate,
112170120827                      DTL.RepaymentReason
112180120827           END-EXEC.
112190120827
112200120827           Perform CreateType06Cursor.
112210120827           SET lb_EndOfCursorFalse TO TRUE.
112220120827           PERFORM Create_Type06 UNTIL lb_EndOfCursorTrue.
112230120827
112240120827      * RFS92917 - END
112250120827
112260120827      *----------------
112270120827       DisplayError.
112280120827      *
112290120827              DISPLAY
112300120827              " *** Error in " lc_CURRENT_PROGRAM
112310120827              " SQLSTATE = "   WS-SQLSTATE
112320120827              " SQLCODE = "    WS-DSP-SQLCODE
112330120827              DISPLAY " *** " Ws-Sql-Err-Short-Descr.
112340120827      *RFS 78268 - End
112350120827      *
112360120827      *----------------
112370120827       SQLFailProcess.
112380120827      *
112390120827           MOVE Ws-Err-Code TO lc_ErrCode.
112400120827           MOVE lc_sqlErrShortDESCR TO lc_ErrDesc.
112410120827           PERFORM Dsp-Error.
112420120827R78268*    PERFORM Force-Msgw.
112430120827
112440120827      *----------------
112450120827       EndOfProgram.
112460120827      *----------------
112470120925      * RFS107668 - Start
112480121009           MOVE li_ProcessFilingYear   TO   li_WKQESI-Year.
112490121009           SET  lncc_EndOfYearNo       TO   TRUE.
112500120925           PERFORM Check_Process_Filing_Year
112510120925             UNTIL lncc_EndOfYearYes.
112520120925      * RFS107668 - End
112530120827      * Close the cursor
112540120827           EXEC SQL
112550120827             CLOSE Main_Cursor
112560120827           END-EXEC.
112570120827
112580120827      * RFS92917 - START
112590120827           IF  lb_EXTQESINO
112600120827               EXEC SQL
112610120827                 CLOSE Replacement_Cursor
112620120827               END-EXEC
112630120827           END-IF.
112640120827      * RFS92917 - END
112650120827
112660120827           EXEC SQL
112670120827             CLOSE Transfer_Cursor
112680120827           END-EXEC.
112690120827
112700120827           EXEC SQL
112710120827             CLOSE EapPse_Cursor
112720120827           END-EXEC.
112730120827
112740120827           EXEC SQL
112750120827             CLOSE Type06_Cursor
112760120827           END-EXEC.
112770120827
11278012082752744      CLOSE INVESTOR-TENANTS
11279012082774636            ACCOUNT-PRIMARY-CARE-GIVER.
112800120827
112810120827      * RFS110780 Begin
112820120827           CLOSE ACCOUNT
112830120827                 TRANS
112840120827                 TRANS-RESP-REPAYMENT-DTL
112850120827                 TRANS-RESP-DETAILS
112860120827                 CONTR-REDEM-CODE-RULES.
112870120827      * RFS110780 End
112880120827
112890120827      *RFS58589 Begins
112900120827           EXEC SQL
112910120827           WHENEVER SQLERROR CONTINUE
112920120827           END-EXEC.
112930120827
112940120925      * RFS107668 - Start Moving all SQL statements till GOBACK under
112950120925      *             the IF Condition. Perform only if Report Mode <> Y
112960121018107668     IF lc_ReportMode NOT = lncc_Y
112970120827           EXEC SQL
112980120827           DROP TABLE QTEMP/MRQPTMP
112990120925           END-EXEC
113000120827
113010120827           EXEC SQL
113020120827           CREATE TABLE QTEMP/MRQPTMP
113030120827             (MRQP_TMP CHAR(1000) NOT NULL WITH DEFAULT)
113040120925           END-EXEC
113050120827
113060120827           EXEC SQL
113070120827             INSERT INTO QTEMP/MRQPTMP
113080120827             SELECT * FROM MRQP
113090120827             ORDER BY
113100120827             CHAR(
113110120827             CASE
113120120827             WHEN SUBSTR(MRQP,1,2) IN ("01","99")
113130120827             THEN SUBSTR(MRQP,1,2)
113140120827             ELSE "50"
113150120827             END  ,2),
113160120827             CHAR(
113170120827             CASE
113180120827             WHEN SUBSTR(MRQP,1,2) = "02"
113190120827             THEN SUBSTR(MRQP,18,15)
113200120827             WHEN SUBSTR(MRQP,1,2) IN("03","06")
113210120827             THEN SUBSTR(MRQP,14,15)
113220120827             WHEN SUBSTR(MRQP,1,2) IN("04","05")
113230120827             THEN SUBSTR(MRQP,16,15)
113240120827             ELSE " "
113250120827             END ,15),
113260120827             CHAR(
113270120827             CASE
113280120827             WHEN SUBSTR(MRQP,1,2) = "02"
11329012082776890 *      THEN SUBSTR(MRQP,4,4) || "1231"
11330012082776890        THEN SUBSTR(MRQP,4,4) || "9999"
113310120827             WHEN SUBSTR(MRQP,1,2) IN ("03", "06")
113320120827             THEN SUBSTR(MRQP,39,8)
113330120827             WHEN SUBSTR(MRQP,1,2) = ("04")
113340120827             THEN SUBSTR(MRQP,49,8)
113350120827             WHEN SUBSTR(MRQP,1,2) = ("05")
113360120827             THEN SUBSTR(MRQP,41,8)
113370120827             ELSE " "
113380120827      * RFS 78268 - Start
113390120827      *      END ,8)
113400120827             END ,8),
113410120827              CHAR(
113420120827              CASE
113430120827              WHEN SUBSTR(MRQP,1,2) IN ("01","99")
113440120827              THEN "0"
113450120827              ELSE SUBSTR(MRQP,3,1)
113460120827              END  ,1)
113470120827      * RFS 78268 - End
113480120925           END-EXEC
113490120827      *RFS58589 Ends
113500120827
113510120827      * RFS 78268 - Start
113520120925           INITIALIZE li_YYYYMMDD
113530120925           MOVE li_AsAtDate  TO li_YYYYMMDD
113540120827
113550120827           EXEC SQL
113560120827                DROP TABLE QTEMP/MRQPTMP2
113570120925           END-EXEC
113580120827
113590120827           EXEC SQL
113600120827           CREATE TABLE QTEMP/MRQPTMP2
113610120827             (MRQP_TMP CHAR(1000) NOT NULL WITH DEFAULT)
113620120925           END-EXEC
113630120827
113640120827
113650120827      *    RFS78268.17 - Begins - Add validation, fix spelling
113660120827           IF li_FilingCutOffMMDD IS NOT NUMERIC
113670120827              MOVE ZEROS TO li_FilingCutOffMMDD
113680120925           END-IF
113690120827
113700120827      *    IF li_FilingCuttOffMMDD >= li_MMDD
113710120827           IF li_FilingCutOffMMDD >= li_MMDD
113720120827      *    RFS78268.17 - Ends
113730120827              PERFORM SplitFile
113740120925           END-IF
113750120927           END-IF.
113760120927      * RFS107668 - End
113770121009           GOBACK.
113780120827
113790120925      * RFS107668 - Start
113800121009       Check_Process_Filing_Year.
113810121018           IF li_WKQESI-Year <= li_Year2
113820120925             EXEC SQL
113830120925               SELECT 1
113840120925                 INTO :li_Rec-Cnt
113850120925                 FROM QTEMP/WKRSPQESIV
113860120925                WHERE FILING_YEAR = :li_WKQESI-Year
113870120927                GROUP BY FILING_YEAR
113880120925             END-EXEC
113890120925             MOVE SQLSTATE TO lc_sqlStates
113900120925             EVALUATE TRUE
113910120925                 WHEN lncc_sqlSuccessful OR lncc_SqlWarning
113920120925                      COMPUTE li_WKQESI-Year = li_WKQESI-Year + lnci_1
113930120925                 WHEN lncc_sqlEnd
113940120925                      EXEC SQL
113950120925                        INSERT INTO QTEMP/WKRSPQESIV
113960120925                        VALUES (:li_WKQESI-Year,0,0," "," "," ")
113970120925                      END-EXEC
113980120925                      COMPUTE li_WKQESI-Year = li_WKQESI-Year + lnci_1
113990120925                 WHEN OTHER
114000120925                      SET lncc_Err_Fetch TO TRUE
114010120925                      MOVE lncc_ErrorFetchWKQESI
114020120925                        TO lc_sqlErrShortDESCR
114030120925                      PERFORM SQLFailProcess
114040120925             END-EVALUATE
114050120925           ELSE
114060120925             SET lncc_EndOfYearYes   TO  TRUE
114070120925           END-IF.
114080120925      * RFS107668 - End
114090120925
114100120827       SplitFile.
114110120827           EXEC SQL
114120120827             INSERT INTO QTEMP/MRQPTMP2
114130120827             SELECT * FROM MRQP
114140120827             WHERE  SUBSTR(MRQP,1,2) IN("01","99") OR
114150120827                   (SUBSTR(MRQP,1,2) = "02"
114160120827               AND  SUBSTR(MRQP,4,4)  < :lc_FilingYear ) OR
114170120827                   (SUBSTR(MRQP,1,2) = "03"
114180120827               AND  SUBSTR(MRQP,39,4) < :lc_FilingYear ) OR
114190120827                   (SUBSTR(MRQP,1,2) = "04"
114200120827               AND  SUBSTR(MRQP,49,4) < :lc_FilingYear ) OR
114210120827                   (SUBSTR(MRQP,1,2) = "05"
114220120827               AND  SUBSTR(MRQP,41,4) < :lc_FilingYear ) OR
114230120827                   (SUBSTR(MRQP,1,2) = "06"
114240120827               AND SUBSTR(MRQP,39,4)  <  :lc_FilingYear )
114250120827             ORDER BY
114260120827               CHAR(
114270120827               CASE
114280120827                    WHEN SUBSTR(MRQP,1,2) IN ("01","99")
114290120827                    THEN SUBSTR(MRQP,1,2)
114300120827                    ELSE "50"
114310120827                    END  ,2),
114320120827               CHAR(
114330120827               CASE
114340120827                    WHEN SUBSTR(MRQP,1,2) = "02"
114350120827                    THEN SUBSTR(MRQP,18,15)
114360120827                    WHEN SUBSTR(MRQP,1,2) IN("03","06")
114370120827                    THEN SUBSTR(MRQP,14,15)
114380120827                    WHEN SUBSTR(MRQP,1,2) IN("04","05")
114390120827                    THEN SUBSTR(MRQP,16,15)
114400120827                    ELSE " "
114410120827                    END ,15),
114420120827               CHAR(
114430120827               CASE
114440120827                    WHEN SUBSTR(MRQP,1,2) = "02"
114450120827                    THEN SUBSTR(MRQP,4,4) || "9999"
114460120827                    WHEN SUBSTR(MRQP,1,2) IN ("03", "06")
114470120827                    THEN SUBSTR(MRQP,39,8)
114480120827                    WHEN SUBSTR(MRQP,1,2) = ("04")
114490120827                    THEN SUBSTR(MRQP,49,8)
114500120827                    WHEN SUBSTR(MRQP,1,2) = ("05")
114510120827                    THEN SUBSTR(MRQP,41,8)
114520120827                    ELSE " "
114530120827                    END ,8),
114540120827              CHAR(
114550120827              CASE
114560120827                     WHEN SUBSTR(MRQP,1,2) IN ("01","99")
114570120827                     THEN "0"
114580120827                     ELSE SUBSTR(MRQP,3,1)
114590120827                     END  ,1)
114600120827           END-EXEC.
114610120827
114620120827           EXEC SQL
114630120827             DELETE FROM QTEMP/MRQPTMP
114640120827             WHERE
114650120827                   (SUBSTR(MRQP_TMP,1,2) = "02"
114660120827               AND  SUBSTR(MRQP_TMP,4,4)  < :lc_FilingYear ) OR
114670120827                   (SUBSTR(MRQP_TMP,1,2) = "03"
114680120827               AND  SUBSTR(MRQP_TMP,39,4) < :lc_FilingYear ) OR
114690120827                   (SUBSTR(MRQP_TMP,1,2) = "04"
114700120827               AND  SUBSTR(MRQP_TMP,49,4) < :lc_FilingYear ) OR
114710120827                   (SUBSTR(MRQP_TMP,1,2) = "05"
114720120827               AND  SUBSTR(MRQP_TMP,41,4) < :lc_FilingYear ) OR
114730120827                   (SUBSTR(MRQP_TMP,1,2) = "06"
114740120827               AND SUBSTR(MRQP_TMP,39,4)  <  :lc_FilingYear )
114750120827           END-EXEC.
114760120827
114770120827      *    COUNTING THE TOTAL NO OF RECORDS TO UPDATE IN TRAILER
114780120827      *    RECORDS OF MRQPTMP, MRQPTMP2
114790120827
114800120827           EXEC SQL
114810120827             SELECT COUNT(*) INTO :Li_TMPCount
114820120827             FROM   QTEMP/MRQPTMP
114830120827           END-EXEC.
114840120827
114850120827           EXEC SQL
114860120827             SELECT COUNT(*) INTO :Li_TMPCount2
114870120827             FROM   QTEMP/MRQPTMP2
114880120827           END-EXEC.
114890120827
114900120827           EXEC SQL
114910120827             UPDATE QTEMP/MRQPTMP
114920120827             SET    MRQP_TMP  = SUBSTR(MRQP_TMP,1,12) ||
114930120827                    DIGITS(:Li_TMPCount) ||
114940120827                    SUBSTR(MRQP_TMP,22,979)
114950120827             WHERE  SUBSTR(MRQP_TMP,1,2) = "99"
114960120827           END-EXEC.
114970120827
114980120827           EXEC SQL
114990120827             UPDATE QTEMP/MRQPTMP2
115000120827             SET    MRQP_TMP  = SUBSTR(MRQP_TMP,1,12) ||
115010120827                    DIGITS(:Li_TMPCount2) ||
115020120827                    SUBSTR(MRQP_TMP,22,979)
115030120827             WHERE  SUBSTR(MRQP_TMP,1,2) = "99"
115040120827           END-EXEC.
115050120827      * RFS 78268 - End
115060140923      *RFS139963 - Begins
115070140923      * ---------------------------------
115080140923        AccountEdit.
115090140923      * ---------------------------------
115100140923           INITIALIZE Lc_AccountNo_Out
115110140923           Exec SQL
115120140923             SET :Lc_AccountNo_Out  =
115130140923               CHAR(TRIM(LEADING "0" FROM :Li_AccountNo_In))
115140140923           End-Exec.
115150140923      *RFS139963 - Ends
115160141001
115170141001      *RFS132831 - Begins - New procedures
115180141001      * ---------------------------------
115190141001        ResetRefileVariables.
115200141001      * ---------------------------------
115210141001           INITIALIZE Li_RefileAccountNo
115220141001                      Li_RefileBeneSeq
115230141001                      Li_RefileToBeneSeq
115240141001                      Li_RefileTsfSeq
115250141001                      Li_RefileYear
115260141001                      Li_RefileYear1231
115270141001                      Li_RefileMrqFileDate
115280141001                      Li_RefileSuccessfulMrqFileDate
115290141001                      Lc_RefileRecType
115300141001                      Li_RefileEffectiveDate
115310141001                      Li_RefilePymtType
115320141001                      Li_RefileReasonCode
115330141001                      Li_RefileVersion
115340141001                      Lc_RefileStatus
115350141001                      Lc_RefileMode
115360141001                      .
115370141001
115380141001      * ---------------------------------
115390141001        GetRefileInfo.
115400141001      * ---------------------------------
115410141001           EXEC SQL
115420150128             SELECT IFNULL(MRQ_Version_Code,:Lnci_9)
115430150128               INTO :Li_RefileVersion
115440141001               FROM
115450141001             (
115460150128             SELECT MRQ_Version_Code
115470141001               FROM MFAMRQRQP mrqrqp
115480141001              WHERE mrqrqp.Account_No = :Li_RefileAccountNo
115490141001                AND mrqrqp.Beneficiary_seq_no = :Li_RefileBeneSeq
115500141001                AND mrqrqp.Year       = :Li_RefileYear
115510141001                AND ((mrqrqp.Record_Type_2 = :Lc_RefileRecType) OR
115520141001                     (:Lc_RefileRecType    = :Lncc_06 AND
115530141001                      :Li_RefileReasonCode
115540141001                       IN(:Lncc_22,:Lncc_23,:Lncc_24)))
115550141001                AND ((:Lc_RefileMode = :Lncc_V AND
115560141001                      mrqrqp.MRQ_File_date = :Li_RefileMrqFileDate AND
115570150128                      mrqrqp.MRQ_Approval_Status = :Lncc_E))
115580141001             UNION ALL
115590150128             SELECT MRQ_Version_Code
115600141001               FROM MFAMRQBRP mrqbrp
115610141001              WHERE mrqbrp.Account_No = :Li_RefileAccountNo
115620141001                AND mrqbrp.Beneficiary_seq_no = :Li_RefileBeneSeq
115630141001                AND mrqbrp.To_Beneficiary_seq_no = : Li_RefileToBeneSeq
115640141001                AND mrqbrp.Replacement_Date = :Li_RefileEffectiveDate
115650141001                AND mrqbrp.Record_Type_2 = :Lc_RefileRecType
115660141001                AND ((:Lc_RefileMode = :Lncc_V AND
115670141001                      mrqbrp.MRQ_File_date = :Li_RefileMrqFileDate AND
115680150128                      mrqbrp.MRQ_Approval_Status = :Lncc_E))
115690141001             UNION ALL
115700150128             SELECT MRQ_Version_Code
115710141001               FROM MFAMRQXFP mrqxfp
115720141001              WHERE mrqxfp.Account_No = :Li_RefileAccountNo
115730141001                AND mrqxfp.Beneficiary_seq_no = :Li_RefileBeneSeq
115740141001                AND mrqxfp.Transfer_Seq_No = :Li_RefileTsfSeq
115750141001                AND mrqxfp.Record_Type_2 = :Lc_RefileRecType
115760141001                AND ((:Lc_RefileMode = :Lncc_V AND
115770141001                      mrqxfp.MRQ_File_date = :Li_RefileMrqFileDate AND
115780150128                      mrqxfp.MRQ_Approval_Status = :Lncc_E))
115790141001             UNION ALL
115800150128             SELECT MRQ_Version_Code
115810141001               FROM MFAMRQTP mrqtp
115820141001              WHERE mrqtp.Account_No = :Li_RefileAccountNo
115830141001                AND mrqtp.Beneficiary_seq_no = :Li_RefileBeneSeq
115840141001                AND mrqtp.Payment_Date_MRQ = :Li_RefileEffectiveDate
115850141001                AND mrqtp.payment_type_2 = :Li_RefilePymtType
115860141001                AND mrqtp.Record_Type_2 = :Lc_RefileRecType
115870141001                AND ((:Lc_RefileMode = :Lncc_V AND
115880141001                      mrqtp.MRQ_File_date = :Li_RefileMrqFileDate AND
115890150128                      mrqtp.MRQ_Approval_Status = :Lncc_E))
115900141001             UNION ALL
115910150128             SELECT MRQ_Version_Code
115920141001               FROM MFAMRQTXP mrqtxp
115930141001              WHERE mrqtxp.Account_No = :Li_RefileAccountNo
115940141001                AND mrqtxp.Beneficiary_seq_no = :Li_RefileBeneSeq
115950141001                AND mrqtxp.Event_Date = :Li_RefileEffectiveDate
115960141001                AND mrqtxp.Special_Tax_Reason = :Li_RefileReasonCode
115970141001                AND ((mrqtxp.Record_Type_2 = :Lc_RefileRecType) OR
115980141001                     (:Lc_RefileRecType = :Lncc_02 AND
115990141001                      mrqtxp.Special_Tax_Reason
116000141001                        IN(:Lncc_22,:Lncc_23,:Lncc_24)))
116010141001                AND ((:Lc_RefileMode = :Lncc_V AND
116020141001                      mrqtxp.MRQ_File_date = :Li_RefileMrqFileDate AND
116030150128                      mrqtxp.MRQ_Approval_Status = :Lncc_E))
116040141001             ) AS Data
116050150205             ORDER BY 1 DESC
116060141001             FETCH FIRST ROW ONLY
116070141001           END-EXEC.
116080150128      * ---------------------------------
116090150128        GetSuccReflDate.
116100150128      * ---------------------------------
116110150128
116120150128           EXEC SQL
116130150128             SELECT IFNULL(MRQ_File_date,0)
116140150128               INTO :Li_RefileSuccessfulMrqFileDate
116150150128               FROM
116160150128             (
116170150128             SELECT MRQ_File_date
116180150128               FROM MFAMRQRQP mrqrqp
116190150128              WHERE mrqrqp.Account_No = :Li_RefileAccountNo
116200150128                AND mrqrqp.Beneficiary_seq_no = :Li_RefileBeneSeq
116210150128                AND mrqrqp.Year       = :Li_RefileYear
116220150128                AND ((mrqrqp.Record_Type_2 = :Lc_RefileRecType) OR
116230150128                     (:Lc_RefileRecType    = :Lncc_06 AND
116240150128                      :Li_RefileReasonCode
116250150128                       IN(:Lncc_22,:Lncc_23,:Lncc_24)))
116260150128                AND ((:Lc_RefileMode = :Lncc_F AND
116270150128                      mrqrqp.MRQ_File_date < :Li_RefileMrqFileDate AND
116280150128                      mrqrqp.MRQ_Approval_Status <> :Lncc_E))
116290150128           UNION ALL
116300150128             SELECT MRQ_File_date
116310150128               FROM MFAMRQBRP mrqbrp
116320150128              WHERE mrqbrp.Account_No = :Li_RefileAccountNo
116330150128                AND mrqbrp.Beneficiary_seq_no = :Li_RefileBeneSeq
116340150128                AND mrqbrp.To_Beneficiary_seq_no = : Li_RefileToBeneSeq
116350150128                AND mrqbrp.Replacement_Date = :Li_RefileEffectiveDate
116360150128                AND mrqbrp.Record_Type_2 = :Lc_RefileRecType
116370150128                AND ((:Lc_RefileMode = :Lncc_F AND
116380150128                      mrqbrp.MRQ_File_date < :Li_RefileMrqFileDate AND
116390150128                      mrqbrp.MRQ_Approval_Status <> :Lncc_E))
116400150128           UNION ALL
116410150128           SELECT MRQ_File_date
116420150128               FROM MFAMRQXFP mrqxfp
116430150128              WHERE mrqxfp.Account_No = :Li_RefileAccountNo
116440150128                AND mrqxfp.Beneficiary_seq_no = :Li_RefileBeneSeq
116450150128                AND mrqxfp.Transfer_Seq_No = :Li_RefileTsfSeq
116460150128                AND mrqxfp.Record_Type_2 = :Lc_RefileRecType
116470150128                AND ((:Lc_RefileMode = :Lncc_F AND
116480150128                      mrqxfp.MRQ_File_date < :Li_RefileMrqFileDate AND
116490150128                      mrqxfp.MRQ_Approval_Status <> :Lncc_E))
116500150128
116510150128           UNION ALL
116520150128             SELECT MRQ_File_date
116530150128               FROM MFAMRQTP mrqtp
116540150128              WHERE mrqtp.Account_No = :Li_RefileAccountNo
116550150128                AND mrqtp.Beneficiary_seq_no = :Li_RefileBeneSeq
116560150128                AND mrqtp.Payment_Date_MRQ = :Li_RefileEffectiveDate
116570150128                AND mrqtp.payment_type_2 = :Li_RefilePymtType
116580150128                AND mrqtp.Record_Type_2 = :Lc_RefileRecType
116590150128                AND ((:Lc_RefileMode = :Lncc_F AND
116600150128                      mrqtp.MRQ_File_date < :Li_RefileMrqFileDate AND
116610150128                      mrqtp.MRQ_Approval_Status <> :Lncc_E))
116620150128
116630150128             UNION ALL
116640150128             SELECT MRQ_File_date
116650150128               FROM MFAMRQTXP mrqtxp
116660150128              WHERE mrqtxp.Account_No = :Li_RefileAccountNo
116670150128                AND mrqtxp.Beneficiary_seq_no = :Li_RefileBeneSeq
116680150128                AND mrqtxp.Event_Date = :Li_RefileEffectiveDate
116690150128                AND mrqtxp.Special_Tax_Reason = :Li_RefileReasonCode
116700150128                AND ((mrqtxp.Record_Type_2 = :Lc_RefileRecType) OR
116710150128                     (:Lc_RefileRecType = :Lncc_02 AND
116720150128                      mrqtxp.Special_Tax_Reason
116730150128                        IN(:Lncc_22,:Lncc_23,:Lncc_24)))
116740150128                AND ((:Lc_RefileMode = :Lncc_F AND
116750150128                      mrqtxp.MRQ_File_date < :Li_RefileMrqFileDate AND
116760150128                      mrqtxp.MRQ_Approval_Status <> :Lncc_E))
116770150128
116780150128             ) AS Data
116790150205             ORDER BY 1 DESC
116800150128             FETCH FIRST ROW ONLY
116810150128           END-EXEC.
116820150128
116830150128
116840150128
116850141001      *RFS132831 - Ends
116860150505
116870150505      *RFS143887- BEGINS
116880150505      * ---------------------------------
116890150505        FormatTransferCapital.
116900150505      * ---------------------------------
116910150505              IF ln_C4_MRQ_Unassisted_Amt < 0
116920150505                 MOVE "-" TO ln_C4_MRQ_Unassisted_Amt_Sign
116930150505                 COMPUTE ln_C4_MRQ_Unassisted_Amt_R =
116940150505                         (ln_C4_MRQ_Unassisted_Amt_R * -1)
116950150505              ELSE
116960150505                 MOVE "0" TO ln_C4_MRQ_Unassisted_Amt_Sign
116970150505              END-IF.
116980150505
116990150505              IF ln_C4_MRQ_Assisted_Amt < 0
117000150505                 MOVE "-" TO ln_C4_MRQ_Assisted_Amt_Sign
117010150505                 COMPUTE ln_C4_MRQ_Assisted_Amt_R =
117020150505                         (ln_C4_MRQ_Assisted_Amt_R * -1)
117030150505              ELSE
117040150505                 MOVE "0" TO ln_C4_MRQ_Assisted_Amt_Sign
117050150505              END-IF.
117060150505      *RFS143887- ENDS
117070150826      *RFS150565 - BEGINS
117080150826      *-----------------------------*
117090150826        FormatPrePost2007Transfer.
117100150826      *-----------------------------*
117110150826
117120150826           IF ln_C4Pre2007UnassCap < 0
117130150826            MOVE "-" TO ln_C4Pre2007UnassCap_Sign
117140150826            COMPUTE ln_C4Pre2007UnassCap_R =
117150150826                    (ln_C4Pre2007UnassCap_R * -1)
117160150826           ELSE
117170150826            MOVE "0" TO ln_C4Pre2007UnassCap_Sign
117180150826           END-IF.
117190150826           IF ln_C4Post2007UnassCap < 0
117200150826            MOVE "-" TO ln_C4Post2007UnassCap_Sign
117210150826            COMPUTE ln_C4Post2007UnassCap_R =
117220150826                    (ln_C4Post2007UnassCap_R * -1)
117230150826           ELSE
117240150826             MOVE "0" TO ln_C4Post2007UnassCap_Sign
117250150826           END-IF.
117260150826      *RFS150565 - ENDS
117270150826
117280120827      * ---------------------------------
117290120827      * DSP-ERROR and FORCE-MSGW Routines
117300120827      * ---------------------------------
117310120827          COPY CPYSQLRTN.
117320120827      *
