000100990716     /* Darena G.   1999/05/27 RFS:4470 Extract file for RYT  project*/
000200990604     /****************************************************************/
000300990830     A          R RYTGLEXTR
000400990716     A            F0000        320A         ALIAS(DETAIL_RECORD)
