000100210609      * %ATTR DBGVIEW(*SOURCE) CLOSQLCSR(*ENDMOD)
000200210609       IDENTIFICATION DIVISION.
000300030411       PROGRAM-ID.    RYTUNTGL.
000400210222       AUTHOR.        UNISEN JSI.
000500030411       INSTALLATION.  UNISEN JSI.
000600030411       DATE-WRITTEN.  APR 08, 2003.
000700030411       DATE-COMPILED.
000800030411      **************************************************************
000900030411      * PROGRAMMER  *  YY/MM/DD   *  DESCRIPTION                   *
001000030411      **************************************************************
001100030508      * RMIGUEL     * 2003/05/08  * RFS 17373 - GL MODS FOR        *
001200030508      *             *             * UNITHOLDER EXTRACT.            *
001300030527      * R MIGUEL    * 2003/05/27  * RFS 17583 - UNITHOLDER EXTRACT *
001400030527      *             *             * CHANGES FOR MFR TRANSACTIONS.  *
001500030613      * R MIGUEL    * 2003/06/13  * RFS 17751 - REPORT PRICE       *
001600030613      *             *             * DIVIDEND RATE FOR INT TRANS    *
001700030613      *             *             * FOR MFT FUNDS.                 *
001800031015      * R MIGUEL    * 2003/09/15  * RFS 16502 - RECOMPILE.         *
001900031003      * R MIGUEL    * 2003/10/03  * RFS 18813 - RECOMPILE.
002000040601      * PING FAN    * 2004/06/01  * RFS 20368 - REPORT PRICE       *
002100040601      *             *             * DIVIDEND RATE OF RE-INVESTED   *
002200040601      *             *             * INC TRANS FOR POOLED FUNDS.    *
002300040601      *             *             * EXCLUDE NOTIONAL DISTRIBUTION  *
002400040601      *             *             * FROM G/L.                      *
002500041014      * Geeta S.    * 2004/10/14  * RFS 23534: Modifications to PEP*
002600041014      *             *             * interface to clear unitholder  *
002700041014      *             *             * reinvested distributions.      *
002800060907      * Marek T    * 2006/09/07   * RFS 34816 - Recompile.
002900070226      * Fatema Haji* 2007/02/15   * RFS 38029 - When Alt Account no*
003000070226      *            *              * is not numeric then move zeroes*
003100070226      *            *              * the PEP extract file.          *
003200080331      * DAISY LY   * 2008/03/30   * RFS 50067 - Recompile.
003300110902      * SAI KIRAN I* 2011/09/02   * RFS 92499 - RECOMPILE
003400121016      * Bhanu D    * 2012/10/15   * RFS 107567 - Recompilation for the
003500121016      *            *              * file MFADISDCP.
003600131023      * Dharmendra * 2013/04/04   * RFS 125459 : Adding exceptions *
003700130404      *             *             * to PEP extract.                *
003800131023      *             *             * Andy Chan - replace code mark  *
003900131023      *             *             * from 118840 to 125459          *
004000131210      * Andy Chan  * 2013/12/09   * RFS 131766 : Create Workfile   *
004100131210      *             *             *              before start file *
004200140304      * Saravanan R *2014/03/04   * RFS132751 - PERFORMANCE        *
004300140304      *             *             *          ENHANCEMENT.          *
004400150518      * SANGEETHA V *2015/05/11   * RFS136715 - INT DISTRIBUTIONS  *
004500150518      *             *             * ARE NOT REPORTED WHEN NOTIONAL *
004600150518      *             *             * DISTRIBUTION FLAG IS SET TO "N"*
004700210222      * Jebastin S  *2021/01/18   * RFS 186131 : CROSS Currency    *
004800210614      * Jebastin S  *2021/06/14   * RFS1115914 : Fix for GL Extract*
004900030411      **************************************************************
005000030411
005100030411       ENVIRONMENT DIVISION.
005200030411       CONFIGURATION SECTION.
005300030411       SOURCE-COMPUTER. IBM-AS400.
005400030411       OBJECT-COMPUTER. IBM-AS400.
005500030411       SPECIAL-NAMES.
005600030411           LOCAL-DATA IS WS-LOCAL.
005700030411      /
005800030411       INPUT-OUTPUT SECTION.
005900030411       FILE-CONTROL.
006000030411
006100030411           SELECT  INVESTMENT
006200030411                   ASSIGN TO DATABASE-MFAINVP
006300030411                   ORGANIZATION IS INDEXED
006400030411                   ACCESS IS DYNAMIC
006500030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
006600030411
006700030411           SELECT  INVESTMENT-NAME
006800030411                   ASSIGN TO DATABASE-MFAINVNMP
006900030411                   ORGANIZATION IS INDEXED
007000030411                   ACCESS IS DYNAMIC
007100030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
007200030411
007300030411           SELECT  TRANS
007400030411                   ASSIGN TO DATABASE-MFATRNLF
007500030411                   ORGANIZATION IS INDEXED
007600030411                   ACCESS IS DYNAMIC
007700030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
007800030411                   DUPLICATES.
007900030411
008000030411           SELECT  TRANS-CHARGES
008100030411                   ASSIGN TO DATABASE-MFATRNCHP
008200030411                   ORGANIZATION IS INDEXED
008300030411                   ACCESS IS DYNAMIC
008400030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
008500030411
008600030411           SELECT  TRANS-DISTR-DETAILS
008700030411                   ASSIGN TO DATABASE-MFATRNDDP
008800030411                   ORGANIZATION IS INDEXED
008900030411                   ACCESS IS DYNAMIC
009000030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009100030411
009200030411           SELECT  TRANS-INTEREST-DETAILS
009300030411                   ASSIGN TO DATABASE-MFATRNIDP
009400030411                   ORGANIZATION IS INDEXED
009500030411                   ACCESS IS DYNAMIC
009600030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009700030411
009800030411           SELECT  TRUST-ACCOUNT
009900030411                   ASSIGN TO DATABASE-MFATRSACP
010000030411                   ORGANIZATION IS INDEXED
010100030411                   ACCESS IS DYNAMIC
010200030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010300030411
010400030411           SELECT  TRUST-ACCT-BANK-ACCT
010500030411                   ASSIGN TO DATABASE-MFATRBNKP
010600030411                   ORGANIZATION IS INDEXED
010700030411                   ACCESS IS DYNAMIC
010800030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010900030411
011000030411           SELECT  ACCOUNT-XREF
011100030411                   ASSIGN TO DATABASE-CNVACTXRLA
011200030411                   ORGANIZATION IS INDEXED
011300030411                   ACCESS IS DYNAMIC
011400030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
011500030411
011600030411           SELECT  PRODUCT-TYPE-CODES
011700030411                   ASSIGN TO DATABASE-MFAPRTCDP
011800030411                   ORGANIZATION IS INDEXED
011900030411                   ACCESS IS DYNAMIC
012000030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012100030411
012200030411           SELECT  INVESTMENT-GROUP
012300030411                   ASSIGN TO DATABASE-MFAINVGRP
012400030411                   ORGANIZATION IS INDEXED
012500030411                   ACCESS IS DYNAMIC
012600030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012700030411
012800030411           SELECT  INVESTMENT-TRUST-ACCOUNT
012900030411                   ASSIGN TO DATABASE-MFASUSTRP
013000030411                   ORGANIZATION IS INDEXED
013100030411                   ACCESS IS DYNAMIC
013200030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013300030411
013400030411           SELECT  DISTRIBUTION-DECLARATION
013500030411                   ASSIGN TO DATABASE-MFADISDCP
013600030411                   ORGANIZATION IS INDEXED
013700030411                   ACCESS IS DYNAMIC
013800030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013900040601R20368*
014000040601  ¦        SELECT  INVESTMENT-NOTIONAL-DIST-DTLS
014100040601  ¦                ASSIGN TO DATABASE-MFAINVNDP
014200040601  ¦                ORGANIZATION IS INDEXED
014300040601  ¦                ACCESS IS DYNAMIC
014400040601  ¦                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
014500040601R20368*
014600030411
014700030411           SELECT  RYTMAPPING
014800030411                   ASSIGN TO DATABASE-MFARTUMALA
014900030411                   ORGANIZATION IS INDEXED
015000030411                   ACCESS IS DYNAMIC
015100030411                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
015200030411                   DUPLICATES.
015300030411
015400030411       DATA DIVISION.
015500030411       FILE SECTION.
015600030411
015700030411      /
015800030411       FD  INVESTMENT
015900030411           LABEL RECORDS ARE STANDARD.
016000030411       01  INVESTMENT-REC.
016100030411                            COPY DD-ALL-FORMATS OF MFAINVP.
016200030411      /
016300030411       FD  INVESTMENT-NAME
016400030411           LABEL RECORDS ARE STANDARD.
016500030411       01  INVESTMENT-NAME-REC.
016600030411                            COPY DD-ALL-FORMATS OF MFAINVNMP.
016700030411      /
016800030411       FD  TRANS
016900030411           LABEL RECORDS ARE STANDARD.
017000030411       01  TRANS-REC.
017100030411                            COPY DD-ALL-FORMATS OF MFATRNLF.
017200030411      /
017300030411       FD  TRANS-CHARGES
017400030411           LABEL RECORDS ARE STANDARD.
017500030411       01  TRANS-CHARGES-REC.
017600030411                            COPY DD-ALL-FORMATS OF MFATRNCHP.
017700030411      /
017800030411       FD  TRANS-DISTR-DETAILS
017900030411           LABEL RECORDS ARE STANDARD.
018000030411       01  TRANS-DISTR-DETAILS-REC.
018100030411                            COPY DD-ALL-FORMATS OF MFATRNDDP.
018200030411      /
018300030411       FD  TRANS-INTEREST-DETAILS
018400030411           LABEL RECORDS ARE STANDARD.
018500030411       01  TRANS-INTEREST-DETAILS-REC.
018600030411                            COPY DD-ALL-FORMATS OF MFATRNIDP.
018700030411      /
018800030411       FD  TRUST-ACCOUNT
018900030411           LABEL RECORDS ARE STANDARD.
019000030411       01  TRUST-ACCOUNT-REC.
019100030411                            COPY DD-ALL-FORMATS OF MFATRSACP.
019200030411      /
019300030411       FD  TRUST-ACCT-BANK-ACCT
019400030411           LABEL RECORDS ARE STANDARD.
019500030411       01  TRUST-ACCT-BANK-ACCT-REC.
019600030411                            COPY DD-ALL-FORMATS OF MFATRBNKP.
019700030411      /
019800030411       FD  ACCOUNT-XREF
019900030411           LABEL RECORDS ARE STANDARD.
020000030411       01  ACCOUNT-XREF-REC.
020100030411                            COPY DD-ALL-FORMATS OF CNVACTXRLA.
020200030411      /
020300030411       FD  PRODUCT-TYPE-CODES
020400030411           LABEL RECORDS ARE STANDARD.
020500030411       01  PRODUCT-TYPE-CODES-REC.
020600030411                            COPY DD-ALL-FORMATS OF MFAPRTCDP.
020700030411      /
020800030411       FD  INVESTMENT-GROUP
020900030411           LABEL RECORDS ARE STANDARD.
021000030411       01  INVESTMENT-GROUP-REC.
021100030411                            COPY DD-ALL-FORMATS OF MFAINVGRP.
021200030411      /
021300030411       FD  INVESTMENT-TRUST-ACCOUNT
021400030411           LABEL RECORDS ARE STANDARD.
021500030411       01  INVESTMENT-TRUST-ACCOUNT-REC.
021600030411                            COPY DD-ALL-FORMATS OF MFASUSTRP.
021700030411      /
021800030411       FD  DISTRIBUTION-DECLARATION
021900030411           LABEL RECORDS ARE STANDARD.
022000030411       01  DISTRIBUTION-DECLARATION-REC.
022100030411                            COPY DD-ALL-FORMATS OF MFADISDCP.
022200040601R20368/
022300040601  ¦    FD  INVESTMENT-NOTIONAL-DIST-DTLS
022400040601  ¦        LABEL RECORDS ARE STANDARD.
022500040601  ¦    01  INVESTMENT-NOTIONAL-DIST-REC.
022600040601R20368                      COPY DD-ALL-FORMATS OF MFAINVNDP.
022700030411      /
022800030411       FD  RYTMAPPING
022900030411           LABEL RECORDS ARE STANDARD.
023000030411       01  RYTMAPPING-REC.
023100030411                            COPY DD-ALL-FORMATS OF MFARTUMALA.
023200030411      /
023300030411       WORKING-STORAGE SECTION.
023400030411
023500030411       01  CURR-CONTROLS.
023600030411           03 CURR-LEVEL                   PIC X.
023700030411
023800030411       01  PREV-CONTROLS.
023900030411           03 PREV-LEVEL                   PIC X.
024000030411
024100030411       01  WS-WORK-FIELDS.
024200030411         03 WS-INVESTMENT-NAME             PIC X(35) VALUE SPACES.
024300030411         03 WS-MAP-TEXT                    PIC X(40) VALUE SPACES.
024400030411         03 WS-NR-AMOUNT.
024500030411           05 WS-NR-AMOUNT-NO9             PIC S9(9)V9(3) VALUE ZEROES.
024600030411           05 WS-NR-AMOUNTX REDEFINES WS-NR-AMOUNT-NO9.
024700030411              10 WS-NR-AMOUNT-X9           PIC X(09).
024800030411              10 WS-NR-AMOUNT-X3           PIC X(03).
024900030411         03 WS-BROKER-TRUST-ACCT           PIC X(12) VALUE SPACES.
025000030411         03 WS-ACCOUNT-NUM1                PIC X(12) VALUE SPACES.
025100030411         03 WS-ACCOUNT-NUM2                PIC X(12) VALUE SPACES.
025200030411         03 WS-ACCOUNT-NUMBER              PIC X(12) JUSTIFIED RIGHT.
025300070226      *RFS 38029 Begins
025400070226         03 li-AccountNo REDEFINES WS-ACCOUNT-NUMBER
025500070226                                           PIC S9(12).
025600070226      *RFS 38029 Ends
025700030411         03 WS-ALT-ACCT-NO                 PIC S9(9) VALUE ZEROES.
025800030411         03 WS-PPTY-NUM1                   PIC X(12) VALUE SPACES.
025900030411         03 WS-PPTY-NUM2                   PIC X(12) VALUE SPACES.
026000030411         03 WS-PPTY-NUMBER                 PIC X(12) JUSTIFIED RIGHT.
026100030411         03 WS-UNIT-AMT                    PIC S9(11)V9(6) VALUE ZEROES.
026200030411         03 WS-REVERSED-DATE               PIC X(8)  VALUE SPACES.
026300030411         03 WS-ORIG-BOOK-VALUE             PIC X(13) VALUE SPACES.
026400030411
026500030411       01  WS-HASH-TOTALS                  PIC S9(13)V99 VALUE ZEROES.
026600030411       01  WS-REC-COUNT                    PIC S9(7) VALUE ZEROES.
026700130404
026800131023      *RFS125459-Start
026900130404       01  lnPlacementDate                 PIC S9(9) VALUE ZEROES.
027000130404       01  lnTransNo                       PIC S9(9) VALUE ZEROES.
027100130404       01  lcException                     PIC X(01) VALUE SPACES.
027200130404       01  lncNo                           PIC X(01) VALUE "N".
027300130404       01  lncYes                          PIC X(01) VALUE "Y".
027400131023      *RFS125459-End
027500030411
027600210222      * RFS 186131 -starts
027700210222       01  li-Placement-Date               PIC S9(9) VALUE ZEROES.
027800210222       01  li-Trans-No                     PIC S9(9) VALUE ZEROES.
027900210222       01  lc-Currency-In                  PIC X(03) VALUE SPACES.
028000210222       01  lc-Currency-Out                 PIC X(03) VALUE SPACES.
028100210222      * RFS 186131 -Ends
028200210222
028300030411       01  WS-LEVEL-88.
028400030411         05 WS-TRANS-TYPES                 PIC X(03) VALUE SPACES.
028500030411             88 PURCHASE                   VALUE "BUY".
028600030411             88 REDEMPTION                 VALUE "SEL".
028700030411             88 SWITCH-OUT                 VALUE "SWO".
028800030411             88 SWITCH-IN                  VALUE "SWI".
028900030411             88 TRANSFER-OUT               VALUE "TRO".
029000030411             88 TRANSFER-IN                VALUE "TRI".
029100030411             88 FEE                        VALUE "FEE".
029200030411             88 MFR                        VALUE "MFR".
029300030411             88 INT                        VALUE "INT".
029400030411             88 DISTRIBUTION               VALUE "INT" "INC" "CPG".
029500030411             88 SUBS                       VALUE "BUY" "SWI" "TRI".
029600030411             88 REDS                       VALUE "SEL" "SWO" "TRO".
029700030411         05 WS-DISTR-OPTION-CODE           PIC X(01) VALUE SPACES.
029800030411             88 REINVEST-DIST              VALUE "R".
029900030411             88 CASH-DIST                  VALUE "C".
030000030411         05 WS-INVESTMENT-TYPE             PIC X(03) VALUE SPACES.
030100030411             88 MFT-TYPE                   VALUE "MFT".
030200030411             88 POL-TYPE                   VALUE "POL".
030300210222186131       88 INV-TYPE-1                 VALUE "MFT", "LPS" .
030400210222186131       88 INV-TYPE-2                 VALUE
030500210222186131          "POL" "SEG" "OFF" "DII" "LBS" "MFC" "NWT" "LNT".
030600030411         05 WS-DETAIL-RECORDS              PIC X(1) VALUE SPACES.
030700030411             88 NO-RECORDS                 VALUE "N".
030800040601R20368   05 WS-NOTIONAL-DIST               PIC X(1) VALUE SPACES.
030900040601  ¦          88 NOTIONALS                  VALUES "N".
031000040601  ¦          88 NOT-NOTIONAL               VALUES "S".
031100040601R20368       88 BOTH-STAND-NOTION          VALUES "B".
031200030411
031300030411       01 WS-FIELD-ITEMS.
031400030411         05 WS-COMP-CENTRE.
031500070226            10 WS-COMP-U                   PIC X(1) VALUE "U".
031600030411            10 WS-COMP-MGMT                PIC X(3) VALUE SPACES.
031700030411            10 WS-COMP-VER                 PIC X(1) VALUE SPACES.
031800030411         05 WS-INT-FIXED-RT                PIC S9(5)V9(6)
031900030411                                            VALUE 0001.000000.
032000030411         03 WS-CURRENT-DATE                PIC  9(8) VALUE ZEROES.
032100030411
032200030411       01  WS-HEADER-RECORD.
032300030411           05 WS-RECORD-TPH      PIC X           VALUE "0".
032400030411           05 WS-FILE-TYPE       PIC X           VALUE "T".
032500030411           05 WS-COMP-CTR        PIC X(5)        VALUE SPACES.
032600030411           05 WS-UNITRAX-DT      PIC S9(8)       VALUE ZEROES.
032700030411           05 WS-PROCESS-DT      PIC S9(8)       VALUE ZEROES.
032800030411           05 FILLER-HDR         PIC X(297)      VALUE SPACES.
032900030411
033000030411       01  WS-DETAIL-RECORD.
033100030411           05 WS-RECORD-TPD      PIC X           VALUE ZEROES.
033200030411           05 WS-ACCT-NUM        PIC S9(9)       VALUE ZEROES.
033300030411           05 WS-TRANS-CD        PIC S9(4)       VALUE ZEROES.
033400030411           05 WS-SIGN-1          PIC X           VALUE SPACES.
033500030411           05 WS-SETL-AMT        PIC S9(11)V99   VALUE ZEROES.
033600030411           05 WS-SETL-CRCY-CD    PIC X(3)        VALUE SPACES.
033700030411           05 WS-SETL-DT         PIC S9(8)       VALUE ZEROES.
033800030411           05 WS-PPTY-MJR-TP     PIC S99         VALUE ZEROES.
033900030411           05 WS-PPTY-NUM        PIC S9(8)       VALUE ZEROES.
034000030411           05 WS-SIGN-2          PIC X           VALUE SPACES.
034100030411           05 WS-PAR-SHS-UNIT    PIC S9(11)V9(6) VALUE ZEROES.
034200030411           05 WS-PRICE-DIVND-RT  PIC S9(5)V9(6)  VALUE ZEROES.
034300030411           05 WS-ADD-TEXT1       PIC X(40)       VALUE SPACES.
034400030411           05 WS-ADD-TEXT2       PIC X(40)       VALUE SPACES.
034500030411           05 WS-CNCL-REVRS-IND  PIC X           VALUE SPACES.
034600030414           05 WS-CNCL-REVRS-DT   PIC S9(8)       VALUE ZEROES.
034700030414           05 WS-BK-VAL-ACCT     PIC S9(13)      VALUE ZEROES.
034800030411           05 WS-NR-TAX-RT       PIC S9(3)V9(6)  VALUE ZEROES.
034900030411           05 WS-NR-TAX-AMT      PIC S9(9)V99    VALUE ZEROES.
035000030411           05 WS-INT-TERM-CD     PIC S9(3)       VALUE ZEROES.
035100030411           05 WS-CO-TERM-CD      PIC S9(3)       VALUE ZEROES.
035200030411           05 WS-INT-DAYS        PIC S9(3)       VALUE ZEROES.
035300030411           05 WS-INT-RATE        PIC S9(3)V9(6)  VALUE ZEROES.
035400030411           05 WS-MAT-DT          PIC S9(8)       VALUE ZEROES.
035500030411           05 WS-ORIG-ISS-DT     PIC S9(8)       VALUE ZEROES.
035600030411           05 WS-PROD-FD-CD      PIC S9(5)       VALUE ZEROES.
035700030411           05 WS-IRIS-FD-NO      PIC S9(5)       VALUE ZEROES.
035800030411           05 WS-IRIS-ACCT       PIC S9(11)      VALUE ZEROES.
035900030411           05 WS-IRIS-SEQ-NO     PIC S9(5)       VALUE ZEROES.
036000030411           05 WS-TRADE-CRCY-CD   PIC X(3)        VALUE SPACES.
036100030411           05 WS-TRADE-EFFECT-DT PIC S9(8)       VALUE ZEROES.
036200030411           05 WS-SETL-EXCH-RT    PIC S9(5)V9(6)  VALUE ZEROES.
036300030411           05 WS-SETL-EXCH-AMT   PIC S9(11)V99   VALUE ZEROES.
036400030411           05 WS-REV-CD          PIC S9          VALUE ZEROES.
036500030411           05 WS-LOC-CD          PIC S9(3)       VALUE ZEROES.
036600030411           05 WS-REG-CD          PIC S9(2)       VALUE ZEROES.
036700030411           05 WS-FILLER          PIC X(19)       VALUE SPACES.
036800030411
036900030411       01  WS-TRAILER-RECORD.
037000030411           05 WS-RECORD-TPT      PIC X           VALUE "9".
037100030411           05 WS-NUMBER          PIC S9(7)       VALUE ZEROES.
037200030411           05 WS-TOTAL-AMT       PIC S9(13)V99   VALUE ZEROES.
037300030411           05 FILLER-TRL         PIC X(297)      VALUE SPACES.
037400030411
037500140304      *RFS132751 - Begins *
037600140304            COPY CPYSQLFLD.
037700140304      *RFS132751 - Ends   *
037800030411
037900030411            EXEC SQL
038000030411              INCLUDE SQLCA
038100030411            END-EXEC.
038200030411
038300140310      *RFS132751 - Begings *
038400140310      * Error Codes, Uniquely Identify where the error happened
038500140310        01  Ws-Err-Code                        PIC X(02) VALUE SPACES.
038600140310          88  lncc_Err_Ok                                VALUE SPACES.
038700140310          88  lncc_Err_10                                VALUE "10".
038800140310      *RFS132751 - Ends *
038900140310
039000030411        01 WS-CALLING-PROGRAM       PIC X(10)     VALUE "RYTUNTGL".
039100030411        01 WS-SQLERR-STATEMENT      PIC X(25)     VALUE " ".
039200030411        01 WS-SQLERR-DATA           PIC X(1780)   VALUE " ".
039300030411        01 WS-SQL-STATS             PIC X(1966)   VALUE " ".
039400030411        01 WS-SQLERR-REPLY          PIC X(1)      VALUE " ".
039500140304
039600140304      *RFS132751 - Begins *
039700140304        01  lnProcessdate               PIC S9(8) VALUE ZEROES.
039800140304        01  lc_PlacementDate            PIC S9(9) VALUE ZEROES.
039900140304        01  lc_Transno                  PIC S9(9) COMP-3 VALUE ZEROES.
040000140304        01  li_Exception                PIC X(01) VALUE SPACES.
040100140304      *RFS132751 - Ends *
040200210614      *RFS 1115914 - BEgins
040300210614        01  ln_Lastprocessdate          PIC S9(8) VALUE ZEROES.
040400210614      *RFS 1115914 - Ends
040500140304
040600030411
040700030411       LINKAGE SECTION.
040800030411
040900030411       01 COMMUNICATION-AREA.
041000030411          05 COMM-PARM-DATE              PIC 9(08).
041100030411          05 COMM-PARM-MGMT-CODE         PIC X(03).
041200030411          05 COMM-PARM-VERSION           PIC X(01).
041300210222      *186131 - Starts
041400210222          05 COMM-LAST-PROCESS-DATE      PIC 9(08).
041500210222      *186131 - Ends
041600030411
041700030411
041800030411       PROCEDURE DIVISION USING COMMUNICATION-AREA.
041900030411      ********************************************************************
042000030411      *                                                                  *
042100030411      *             P R O C E D U R E     D I V I S I O N                *
042200030411      *                                                                  *
042300030411      ********************************************************************
042400030411
042500030411       MAINLINE.
042600030411           PERFORM INITIAL-LOGIC-RTN THRU INL-EXIT.
042700030411           IF CURR-CONTROLS IS EQUAL  TO  HIGH-VALUES
042800030411              GO TO ML-0030.
042900030411
043000030411       ML-0010.
043100030411           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
043200030411           IF CURR-CONTROLS IS EQUAL  TO  HIGH-VALUES
043300030411              GO TO ML-0030.
043400030411
043500030411       ML-0020.
043600030411           PERFORM DETAIL-PROCESS-RTN THRU DPR-EXIT.
043700030411           IF CURR-CONTROLS IS NOT EQUAL TO  HIGH-VALUES
043800030411              GO TO ML-0010.
043900030411
044000030411       ML-0030.
044100030411           PERFORM WRITE-HEADER-RTN THRU WHR-EXIT.
044200030411           PERFORM WRITE-TRAILER-RTN THRU WTR-EXIT.
044300030411
044400030411           IF CURR-CONTROLS IS EQUAL  TO  HIGH-VALUES
044500030411              GO TO ML-0040.
044600030411
044700030411       ML-0040.
044800030411           PERFORM END-JOB-RTN        THRU EJR-EXIT.
044900030411           STOP RUN.
045000030411      /
045100030411       GET-CURRENT-RECORD.
045200030411      ********************************************************************
045300030411      *                                                                  *
045400030411      *      G E T   C U R R E N T   R E C O R D   R O U T I N E         *
045500030411      *                                                                  *
045600030411      ********************************************************************
045700030411       GCR-0010.
045800030411
045900030411           READ TRANS NEXT
046000030411             AT END
046100030411               MOVE HIGH-VALUES TO CURR-CONTROLS
046200030411             GO TO GCR-EXIT.
046300030411
046400210222      *  RFS 186131 - starts
046500210222      *    IF PROCESS-DATE
046600210222      *       OF TRANS-REC IS NOT EQUAL TO COMM-PARM-DATE
046700210222      *       GO TO GCR-0010.
046800210222           IF COMM-Last-Process-Date = 0
046900210222              IF PROCESS-DATE
047000210222                 OF TRANS-REC IS NOT EQUAL TO COMM-PARM-DATE
047100210222                 GO TO GCR-0010
047200210222              END-IF
047300210222           END-IF
047400210222      *  RFS 186131 - Ends
047500210222
047600210222      *  RFS 186131 - starts
047700210222           IF COMM-Last-Process-Date not equal to zeroes
047800210222
047900210222           INITIALIZE MFAINVP OF INVESTMENT-REC
048000210222
048100210222           MOVE INVESTMENT-CODE OF TRANS-REC
048200210222             TO INVESTMENT-CODE OF INVESTMENT
048300210222
048400210222           READ INVESTMENT
048500210222            INVALID KEY
048600210222              GO TO GCR-0010
048700210222           END-READ
048800210222
048900210222           INITIALIZE MFAINVGRP
049000210222                      OF INVESTMENT-GROUP-REC
049100210222
049200210222           MOVE INVESTMENT-GROUP-CODE
049300210222                OF INVESTMENT-REC      TO  INVESTMENT-GROUP-CODE
049400210222                                           OF INVESTMENT-GROUP
049500210222
049600210222           READ INVESTMENT-GROUP
049700210222             INVALID KEY
049800210222                GO TO GCR-0010
049900210222           END-READ
050000210222           IF (TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "BUY" OR "SEL")
050100210222              AND  TRANS-ORIGIN-CODE OF TRANS-REC = "WOR"
050200210222              AND  FIXED-OR-VARIABLE OF INVESTMENT-GROUP = "V"
050300210222              AND  PLACEMENT-DATE OF TRANS-REC <= TRADE-DATE OF
050400210222                   TRANS-REC
050500210615      *RFS 1115914 - BEgins
050600210615      *       AND  PROCESS-DATE OF TRANS-REC NOT = COMM-PARM-DATE
050700210615      *        GO TO GCR-0010
050800210615              IF  PROCESS-DATE OF TRANS-REC NOT = COMM-PARM-DATE
050900210615               GO TO GCR-0010
051000210615              ELSE
051100210615               GO TO GCR-0020
051200210615              END-IF
051300210615      *    END-IF
051400210616           ELSE
051500210616      *RFS 1115914 - Ends
051600210616           IF Process-Date of Trans-Rec NOT = COMM-Last-Process-Date
051700210222               GO TO GCR-0010
051800210616           END-IF
051900210222           END-IF.
052000210222      *  RFS 186131 - Ends
052100140304
052200140304      *RFS132751 - Begins *
052300140304       GCR-0020.
052400140304           INITIALIZE CNVACTXREF OF ACCOUNT-XREF-REC.
052500140304
052600140304           MOVE ACCOUNT-NO OF TRANS-REC
052700140304             TO ACCOUNT-NO OF ACCOUNT-XREF.
052800140304
052900140304           READ ACCOUNT-XREF
053000140304            INVALID KEY
053100140304             GO TO GCR-0010
053200140304           END-READ.
053300140304
053400140304           IF ACCNORIG OF ACCOUNT-XREF-REC IS EQUAL SPACES
053500140304              GO TO GCR-0010.
053600140304
053700131029      *RFS125459-Start
053800140304      *    IF TRANS-STATUS-CODE OF TRANS-REC
053900140304      *       IS EQUAL TO "HST" OR "RVS"
054000131029
054100140304      *     INITIALIZE lnPlacementDate
054200140304      *                lnTransNo
054300140304      *                lcException
054400131029
054500140304      *     MOVE PLACEMENT-DATE OF TRANS-REC  TO lnPlacementDate
054600140304      *     MOVE TRANS-NO       OF TRANS-REC  TO lnTransNo
054700140304      *     MOVE lncNo                        TO lcException
054800131029
054900140304      *     CALL "RYTUTHEEXT" USING  lnPlacementDate,
055000140304      *                              lnTransNo,
055100140304      *                              lcException
055200140304      *     END-IF.
055300131029
055400140304      *     IF lcException = lncYes
055500140304      *        GO TO GCR-0010
055600140304      *     END-IF.
055700140304
055800140304            MOVE TRANS-NO       OF TRANS-REC  TO lc_Transno
055900140304            MOVE PLACEMENT-DATE OF TRANS-REC  TO lc_PlacementDate.
056000140304
056100140304            EXEC SQL
056200140304              SELECT EXCEPTION_RULE
056300140304                INTO :li_Exception
056400140304                FROM MFAWRKFLE
056500140304               WHERE TRANS_NO = :lc_Transno
056600140304                 AND PLACEMENT_DATE = :lc_PlacementDate
056700140304            END-EXEC.
056800140304
056900140304            IF SQLCODE = 0
057000140304               CONTINUE
057100140304            ELSE
057200140304               IF SQLCODE = 100
057300140304                  GO TO GCR-0010
057400140304               END-IF
057500140304            END-IF.
057600140304
057700140304            IF li_Exception = lncYes
057800140304               GO TO GCR-0010
057900140304            ELSE
058000140304               CONTINUE
058100140304            END-IF.
058200131029
058300131029      *RFS125459-End
058400140304      *RFS132751 - Ends *
058500131029
058600030411           IF TRANS-STATUS-CODE OF TRANS-REC
058700030411              IS NOT  EQUAL TO "HST"
058800030411              GO TO GCR-0010.
058900030411
059000030411           IF REVERSE OF TRANS-REC
059100030411              IS  EQUAL TO "Y"
059200030411              GO TO GCR-0010.
059300030411
059400030411           MOVE TRANS-TYPE-CODE OF TRANS-REC
059500030411             TO WS-TRANS-TYPES.
059600030411
059700040601R20368 GCR-0015.
059800040601  ¦        INITIALIZE MFAINVP OF INVESTMENT-REC.
059900040601  ¦
060000040601  ¦        MOVE INVESTMENT-CODE OF TRANS-REC
060100040601  ¦          TO INVESTMENT-CODE OF INVESTMENT.
060200040601  ¦
060300040601  ¦        READ INVESTMENT
060400040601  ¦         INVALID KEY
060500040601  ¦           GO TO GCR-0010
060600040601  ¦        END-READ.
060700210222      *RFS 186131 - BEGINS
060800210222           MOVE PLACEMENT-DATE OF TRANS-REC TO LI-PLACEMENT-DATE
060900210222           MOVE TRANS-NO       OF TRANS-REC TO LI-TRANS-NO
061000210222           IF SWITCH-OUT
061100210222              PERFORM GET-CURRENCY-ON-SWI
061200210222              IF LC-CURRENCY-IN NOT = CURRENCY-DDS OF INVESTMENT-REC
061300210222                 MOVE "SEL" TO WS-TRANS-TYPES
061400210222              END-IF
061500210222           END-IF
061600210222           IF SWITCH-IN
061700210222              PERFORM GET-CURRENCY-ON-SWO
061800210222              IF LC-CURRENCY-OUT NOT = CURRENCY-DDS OF INVESTMENT-REC
061900210222                 MOVE "BUY" TO WS-TRANS-TYPES
062000210222              END-IF
062100210222           END-IF
062200210222      *RFS 186131 - ENDS
062300040601  ¦
062400040601  ¦        INITIALIZE MFAINVNDP OF INVESTMENT-NOTIONAL-DIST-REC.
062500040601  ¦
062600040601  ¦        MOVE INVESTMENT-CODE OF INVESTMENT
062700040601  ¦          TO INVESTMENT-CODE OF INVESTMENT-NOTIONAL-DIST-DTLS.
062800040601  ¦
062900040601  ¦        READ INVESTMENT-NOTIONAL-DIST-DTLS
063000040601  ¦         INVALID KEY
063100040601  ¦           MOVE "S"       TO WS-NOTIONAL-DIST
063200040601  ¦         NOT INVALID KEY
063300040601  ¦           MOVE NOTIONAL-DISTRIBUTION OF
063400040601  ¦                          INVESTMENT-NOTIONAL-DIST-DTLS
063500040601  ¦                          TO WS-NOTIONAL-DIST.
063600150518  ¦   *RFS 136715 - BEGINS.
063700150518  ¦   *    IF NOTIONALS AND DISTRIBUTION
063800150518           IF NOTIONALS AND DISTRIBUTION AND UNIT-AMT OF TRANS-REC = 0
063900150518      *RFS 136715 - ENDS.
064000040601R20368        GO TO GCR-0010.
064100040601
064200210222186131*    IF (TRANS-TYPE-CODE
064300210222186131*       OF TRANS-REC IS EQUAL TO "INC" OR "CPG" OR
064400210222186131     IF (WS-TRANS-TYPES
064500210222186131                     IS EQUAL TO "INC" OR "CPG" OR
064600030411                                       "FEE" OR "MFR" OR
064700030411                                       "SEL" OR "BUY" OR "SWI" OR
064800030411                                       "SWO" OR "TRI" OR "TRO")
064900210222186131*    OR (TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "INT"  AND
065000210222186131     OR (WS-TRANS-TYPES               IS EQUAL TO "INT"  AND
065100030411              (GROSS-AMT      OF TRANS-REC NOT EQUAL TO ZEROES OR
065200030411               UNIT-AMT       OF TRANS-REC NOT EQUAL TO ZEROES))
065300030411
065400030411               CONTINUE
065500030411           ELSE
065600030411              GO TO GCR-0010
065700030411           END-IF.
065800130404
065900140304      *RFS132751 - Begins *
066000140304      *GCR-0020.
066100140304      *    INITIALIZE CNVACTXREF OF ACCOUNT-XREF-REC.
066200030411
066300140304      *    MOVE ACCOUNT-NO OF TRANS-REC
066400140304      *      TO ACCOUNT-NO OF ACCOUNT-XREF.
066500030411
066600140304      *    READ ACCOUNT-XREF
066700140304      *     INVALID KEY
066800140304      *      GO TO GCR-0010
066900140304      *    END-READ.
067000030411
067100140304      *    IF ACCNORIG OF ACCOUNT-XREF-REC IS EQUAL SPACES
067200140304      *       GO TO GCR-0010.
067300140304      *RFS132751 - Ends *
067400030411
067500030411       GCR-0030.
067600030411           IF MFR OR FEE
067700030411              GO TO GCR-EXIT
067800030411           END-IF.
067900030411
068000030411       GCR-0040.
068100030411           INITIALIZE MFASUSTRP OF INVESTMENT-TRUST-ACCOUNT-REC.
068200030411
068300030411           MOVE INVESTMENT-CODE OF TRANS-REC
068400030411             TO INVESTMENT-CODE OF INVESTMENT-TRUST-ACCOUNT.
068500030411
068600030411           READ INVESTMENT-TRUST-ACCOUNT
068700030411            INVALID KEY
068800030411             GO TO GCR-0010
068900030411           END-READ.
069000030411
069100030411       GCR-EXIT.
069200030411           EXIT.
069300030411      /
069400030411       DETAIL-PROCESS-RTN.
069500030411
069600030411      ********************************************************************
069700030411      *                                                                  *
069800030411      *       D E T A I L     P R O C E S S I N G    R O U T I N E       *
069900030411      *                                                                  *
070000030411      ********************************************************************
070100030411
070200030411           INITIALIZE MFARTUMAP
070300030411                     OF RYTMAPPING-REC.
070400030411
070500210222186131*    MOVE TRANS-TYPE-CODE
070600210222186131*         OF TRANS-REC  TO  TRANS-TYPE-CODE
070700210222186131     MOVE WS-TRANS-TYPES
070800210222186131                        TO  TRANS-TYPE-CODE
070900030411                                  OF RYTMAPPING-REC.
071000030411
071100030411           MOVE ZEROES        TO  GL-TRANS-TYPE
071200030411                                  OF RYTMAPPING-REC.
071300030411
071400030411           START RYTMAPPING
071500030411               KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
071600030411               INVALID KEY
071700030411               GO TO DPR-EXIT
071800030411           END-START.
071900030411
072000030411       DPR-0010.
072100030411
072200030411           READ RYTMAPPING  NEXT
072300030411             AT END
072400030411                GO TO DPR-EXIT.
072500030411
072600030411           IF TRANS-TYPE-CODE OF RYTMAPPING-REC  IS NOT EQUAL TO
072700210222186131*       TRANS-TYPE-CODE OF TRANS-REC
072800210222186131        WS-TRANS-TYPES
072900030411              GO TO DPR-0010.
073000030411
073100030411           INITIALIZE WS-DETAIL-RECORD.
073200030411           INITIALIZE WS-WORK-FIELDS.
073300030411
073400210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "BUY"
073500210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "BUY"
073600030411
073700030411             IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I"
073800030411                COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
073900030411                MOVE UNIT-AMT
074000030411                     OF TRANS-REC TO WS-PAR-SHS-UNIT
074100030411             ELSE
074200030411             IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F"
074300030411                MOVE NET-AMT
074400030411                     OF TRANS-REC TO WS-SETL-AMT
074500030411             END-IF
074600030411           END-IF.
074700030411
074800210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "SEL"
074900210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "SEL"
075000030411
075100030411             IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F"
075200030411                COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
075300030411             ELSE
075400030411             IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I"
075500030411                MOVE NET-AMT
075600030411                     OF TRANS-REC TO WS-SETL-AMT
075700030411                COMPUTE WS-PAR-SHS-UNIT = (-1) * UNIT-AMT OF TRANS-REC
075800030411             END-IF
075900030411           END-IF.
076000030411
076100030411           MOVE GL-TRANS-TYPE
076200030411                OF RYTMAPPING-REC TO WS-TRANS-CD.
076300030411
076400030411           MOVE CURRENCY-DDS
076500030411                OF INVESTMENT-REC   TO WS-SETL-CRCY-CD
076600030411                                       WS-TRADE-CRCY-CD.
076700030527      *  RFS 17583 begin
076800030527
076900030527           INITIALIZE MFAINVGRP
077000030527                      OF INVESTMENT-GROUP-REC.
077100030527
077200030527           MOVE INVESTMENT-GROUP-CODE
077300030527                OF INVESTMENT-REC      TO  INVESTMENT-GROUP-CODE
077400030528                                           OF INVESTMENT-GROUP.
077500030527
077600030527           READ INVESTMENT-GROUP
077700030527             INVALID KEY
077800030527                GO TO DPR-EXIT.
077900030527
078000030527      *  RFS 17583 end
078100030411
078200030411           INITIALIZE MFAINVNMP OF INVESTMENT-NAME-REC.
078300030411
078400030411           MOVE INVESTMENT-CODE OF INVESTMENT-REC
078500030411             TO INVESTMENT-CODE OF INVESTMENT-NAME.
078600030411
078700030411           MOVE "E" TO LANGUAGE-CODE OF INVESTMENT-NAME.
078800030411
078900030411           READ INVESTMENT-NAME
079000030411            INVALID KEY
079100030411              MOVE SPACES TO WS-INVESTMENT-NAME.
079200030411
079300030411           MOVE INVESTMENT-NAME-LONG OF INVESTMENT-NAME-REC
079400030411             TO WS-INVESTMENT-NAME.
079500030411
079600030414           IF PURCHASE OR REDEMPTION
079700030411              GO TO DPR-0060.
079800030411
079900030414           IF TRANSFER-OUT OR SWITCH-OUT OR
080000030414              TRANSFER-IN OR SWITCH-IN
080100030411              GO TO DPR-0050.
080200030411
080300210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "INC"
080400210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "INC"
080500030411              CONTINUE
080600030411           ELSE
080700030411              GO TO DPR-0011.
080800030411
080900030411           INITIALIZE MFATRNDDP
081000030411                      OF TRANS-DISTR-DETAILS-REC.
081100030411
081200030411           MOVE PLACEMENT-DATE
081300030411                OF TRANS-REC  TO  PLACEMENT-DATE
081400030411                                     OF TRANS-DISTR-DETAILS-REC.
081500030411           MOVE TRANS-NO
081600030411                OF TRANS-REC  TO  TRANS-NO
081700030411                                  OF TRANS-DISTR-DETAILS-REC.
081800030411
081900030411           READ TRANS-DISTR-DETAILS
082000030411             INVALID KEY
082100030411                GO TO DPR-EXIT.
082200030411
082300030411           IF DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS-REC
082400030411              IS NOT EQUAL TO DISTR-OPTION OF RYTMAPPING-REC
082500030411
082600030411              GO TO DPR-0010.
082700030415
082800030415           MOVE DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS-REC
082900030415             TO WS-DISTR-OPTION-CODE.
083000030411
083100030411           INITIALIZE MFADISDCP
083200030411                      OF DISTRIBUTION-DECLARATION-REC.
083300030411
083400030411           MOVE DATE-OF-RECORD
083500030411             OF TRANS-DISTR-DETAILS TO DATE-OF-RECORD
083600030411                                       OF DISTRIBUTION-DECLARATION-REC.
083700030411           MOVE INVESTMENT-CODE
083800030411             OF TRANS-DISTR-DETAILS TO INVESTMENT-CODE
083900030411                                       OF DISTRIBUTION-DECLARATION-REC.
084000030411
084100030411           READ DISTRIBUTION-DECLARATION
084200030411             INVALID KEY
084300030411                GO TO DPR-EXIT.
084400030411
084500030411           GO TO DPR-0012.
084600030411
084700030411       DPR-0011.
084800030411
084900210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "INT"
085000210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "INT"
085100030411
085200030411              CONTINUE
085300030411           ELSE
085400030411              GO TO DPR-0012.
085500030411
085600030411           INITIALIZE MFATRNIDP
085700030411                      OF TRANS-INTEREST-DETAILS-REC.
085800030411
085900030411           MOVE PLACEMENT-DATE
086000030411                OF TRANS-REC  TO  PLACEMENT-DATE
086100030411                                  OF TRANS-INTEREST-DETAILS-REC.
086200030411
086300030411           MOVE TRANS-NO
086400030411                OF TRANS-REC  TO  TRANS-NO
086500030411                                  OF TRANS-INTEREST-DETAILS-REC.
086600030411
086700030411           READ TRANS-INTEREST-DETAILS
086800030411             INVALID KEY
086900030411                GO TO DPR-EXIT.
087000030411
087100030411           IF DISTR-OPTION-CODE OF TRANS-INTEREST-DETAILS-REC
087200030411              IS NOT EQUAL TO DISTR-OPTION OF RYTMAPPING-REC
087300030411              GO TO DPR-0010.
087400030415
087500030415           MOVE DISTR-OPTION-CODE OF TRANS-INTEREST-DETAILS-REC
087600030415             TO WS-DISTR-OPTION-CODE.
087700030411
087800030411       DPR-0012.
087900030411
088000210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "CPG"
088100210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "CPG"
088200030411              GO TO DPR-0015
088300030411           ELSE
088400210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS NOT EQUAL TO "INC" AND
088500210222186131*       TRANS-TYPE-CODE OF TRANS-REC IS NOT EQUAL TO "INT"
088600210222186131     IF WS-TRANS-TYPES  IS NOT EQUAL TO "INC" AND
088700210222186131        WS-TRANS-TYPES  IS NOT EQUAL TO "INT"
088800030411              GO TO DPR-0015
088900030411           END-IF.
089000030411
089100030411           INITIALIZE MFAPRTCDP
089200030411                      OF PRODUCT-TYPE-CODES-REC.
089300030411
089400030411           MOVE PRODUCT-TYPE-CODE
089500030411                OF INVESTMENT-REC TO PRODUCT-TYPE-CODE
089600030411                                  OF PRODUCT-TYPE-CODES-REC.
089700030411
089800030411           READ PRODUCT-TYPE-CODES
089900030411             INVALID KEY
090000030411                GO TO DPR-EXIT.
090100030411
090200030411           IF PRODUCT-TYPE-CODE OF PRODUCT-TYPE-CODES-REC
090300030411              IS NOT EQUAL TO "STF"
090400030411
090500030411              GO TO DPR-EXIT.
090600030411
090700030527      * RFS 17583 begin
090800030527      *    INITIALIZE MFAINVGRP
090900030527      *               OF INVESTMENT-GROUP-REC.
091000030527      *
091100030527      *    MOVE INVESTMENT-GROUP-CODE
091200030527      *         OF INVESTMENT-REC      TO  INVESTMENT-GROUP-CODE
091300030527      *                                    OF INVESTMENT-GROUP-REC.
091400030527      *    READ INVESTMENT-GROUP
091500030527      *      INVALID KEY
091600030527      *         GO TO DPR-EXIT.
091700030527      * RFS 17583 end
091800030527
091900030411           IF INVESTMENT-TYPE
092000030411               OF INVESTMENT-GROUP-REC IS NOT EQUAL TO
092100030411                                       INVESTMENT-TYPE
092200030411                                       OF RYTMAPPING-REC
092300030411               GO TO DPR-0010.
092400210222      * RFS 186131 - Starts
092500210222           MOVE INVESTMENT-TYPE OF INVESTMENT-GROUP-REC
092600210222                                TO WS-INVESTMENT-TYPE
092700210222      * RFS 186131 - Ends
092800030411
092900030411      **************************I N T**********************************
093000210222186131*    IF TRANS-TYPE-CODE
093100210222186131*       OF TRANS-REC IS EQUAL TO  "INT"
093200210222186131     IF WS-TRANS-TYPES
093300210222186131        IS EQUAL TO  "INT"
093400030411
093500030411      ********************INT REINVEST (MFT & POL)*********************
093600030411           MOVE ZEROES TO WS-UNIT-AMT
093700030411           COMPUTE WS-UNIT-AMT = ( NET-AMT    OF TRANS-REC ) /
093800030411                                 ( UNIT-PRICE OF TRANS-REC )
093900030411
094000030411              IF DISTR-OPTION-CODE OF TRANS-INTEREST-DETAILS-REC
094100030411                 IS EQUAL TO "R"
094200030411
094300210222      * RFS 186131 - starts
094400210222      *          IF INVESTMENT-TYPE
094500210222      *             OF INVESTMENT-GROUP-REC IS EQUAL TO "MFT"
094600210222                 IF INV-TYPE-1
094700210222      * RFS 186131 - Ends
094800030411
094900030411                    IF (GL-TRANS-TYPE
095000030411                       OF RYTMAPPING-REC IS EQUAL TO 1070 OR 2495) AND
095100030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
095200030411                        "F")
095300030411                       MOVE WS-UNIT-AMT            TO  WS-PAR-SHS-UNIT
095400030411
095500030411                       MOVE NET-AMT
095600030411                            OF TRANS-REC TO WS-SETL-AMT
095700030411
095800030411                       MOVE WS-INT-FIXED-RT TO WS-PRICE-DIVND-RT
095900030411                    END-IF
096000030411
096100030411                    IF (GL-TRANS-TYPE
096200030411                       OF RYTMAPPING-REC IS EQUAL TO 3011 OR 5495) AND
096300030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
096400030411                        "F")
096500030411                       MOVE WS-UNIT-AMT            TO  WS-PAR-SHS-UNIT
096600030411
096700030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
096800030411                                                    OF TRANS-REC
096900030613      * RFS 17751 begin
097000030613                       IF GL-TRANS-TYPE
097100030613                             OF RYTMAPPING-REC IS EQUAL TO 3011
097200030613                          MOVE UNIT-PRICE
097300030613                            OF TRANS-REC TO WS-PRICE-DIVND-RT
097400030613                       END-IF
097500030613      * RFS 17751 end
097600030411                    END-IF
097700030411                    GO TO DPR-0060
097800030411                 END-IF
097900030411
098000210222      * RFS 186131 - starts
098100210222      *          IF INVESTMENT-TYPE
098200210222      *             OF INVESTMENT-GROUP-REC IS EQUAL TO "POL"
098300210222                 IF INV-TYPE-2
098400210222      * RFS 186131 - Ends
098500030411
098600030411                    IF (GL-TRANS-TYPE
098700030411                       OF RYTMAPPING-REC IS EQUAL TO 1071 OR 2495) AND
098800030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
098900030411                        "F")
099000030411                       MOVE WS-UNIT-AMT            TO  WS-PAR-SHS-UNIT
099100030411
099200030411                       MOVE NET-AMT
099300030411                            OF TRANS-REC TO WS-SETL-AMT
099400030411
099500030411                       MOVE WS-INT-FIXED-RT TO WS-PRICE-DIVND-RT
099600030411                    END-IF
099700030411
099800030411                    IF (GL-TRANS-TYPE
099900030411                       OF RYTMAPPING-REC IS EQUAL TO 3011 OR 5495) AND
100000030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
100100030411                        "F")
100200030411                       MOVE WS-UNIT-AMT            TO  WS-PAR-SHS-UNIT
100300030411
100400030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
100500030411                                                    OF TRANS-REC
100600030411                       IF GL-TRANS-TYPE
100700030411                             OF RYTMAPPING-REC IS EQUAL TO 3011
100800030411                          MOVE UNIT-PRICE
100900030411                            OF TRANS-REC TO WS-PRICE-DIVND-RT
101000030411                       END-IF
101100030411                    END-IF
101200030411                    GO TO DPR-0060
101300030411                 END-IF
101400030411              END-IF
101500030411
101600030411      *********************** INT CASH (MFT & POL)*********************
101700030411
101800030411              IF DISTR-OPTION-CODE OF TRANS-INTEREST-DETAILS-REC
101900030411                 IS EQUAL TO "C"
102000030411
102100210222      * RFS 186131 - starts
102200210222      *          IF INVESTMENT-TYPE
102300210222      *             OF INVESTMENT-GROUP-REC IS EQUAL TO "MFT"
102400210222                 IF INV-TYPE-1
102500210222      * RFS 186131 - Ends
102600030411
102700030411                    IF TRUST-TYPE
102800030411                       OF RYTMAPPING-REC IS EQUAL TO "I"
102900030411                       MOVE WS-INT-FIXED-RT TO WS-PRICE-DIVND-RT
103000030411
103100030411                       MOVE NET-AMT
103200030411                            OF TRANS-REC TO WS-SETL-AMT
103300030411
103400030411                       MOVE WS-UNIT-AMT            TO  WS-PAR-SHS-UNIT
103500030411                    END-IF
103600030411
103700030411                    IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F"
103800030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
103900030411                                                    OF TRANS-REC
104000030411
104100030411                       MOVE WS-UNIT-AMT            TO  WS-PAR-SHS-UNIT
104200030411                    END-IF
104300030411
104400030411                    IF (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "S" OR
104500030411                       "R") AND GL-TRANS-TYPE OF RYTMAPPING-REC
104600030411                       IS EQUAL TO 2495
104700030411                         MOVE NET-AMT
104800030411                              OF TRANS-REC TO WS-SETL-AMT
104900030411                    END-IF
105000030411
105100030411                    IF (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "S" OR
105200030411                       "R") AND GL-TRANS-TYPE OF RYTMAPPING-REC
105300030411                       IS EQUAL TO 5495
105400030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
105500030411                                                    OF TRANS-REC
105600030411                    END-IF
105700030411
105800030411                    GO TO DPR-0060
105900030411                 END-IF
106000030411
106100210222      * RFS 186131 - starts
106200210222      *          IF INVESTMENT-TYPE
106300210222      *             OF INVESTMENT-GROUP-REC IS EQUAL TO "POL"
106400210222                 IF INV-TYPE-2
106500210222      * RFS 186131 - starts
106600030411
106700030411                    IF TRUST-TYPE
106800030411                       OF RYTMAPPING-REC IS EQUAL TO "I"
106900030411                       MOVE WS-INT-FIXED-RT TO WS-PRICE-DIVND-RT
107000030411
107100030411                       MOVE NET-AMT
107200030411                            OF TRANS-REC TO WS-SETL-AMT
107300030411
107400030411                       MOVE WS-UNIT-AMT            TO  WS-PAR-SHS-UNIT
107500030411                    END-IF
107600030411
107700030411                    IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F"
107800030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
107900030411                                                    OF TRANS-REC
108000030411
108100030411                       MOVE WS-UNIT-AMT            TO  WS-PAR-SHS-UNIT
108200030411                    END-IF
108300030411                    GO TO DPR-0060
108400030411                 END-IF
108500030411              END-IF
108600030411           END-IF.
108700030411
108800030411      **************************I N C**********************************
108900210222186131*    IF TRANS-TYPE-CODE
109000210222186131*       OF TRANS-REC IS EQUAL TO "INC"
109100210222186131     IF WS-TRANS-TYPES
109200210222186131        IS EQUAL TO "INC"
109300030411
109400030411      ********************INC REINVEST (MFT & POL)*********************
109500030411              IF DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS-REC
109600030411                 IS EQUAL TO "R"
109700030411
109800210222      * RFS 186131 - starts
109900210222      *          IF INVESTMENT-TYPE
110000210222      *             OF INVESTMENT-GROUP-REC IS EQUAL TO "MFT"
110100210222                 IF INV-TYPE-1
110200210222      * RFS 186131 - Ends
110300030411
110400030411                    IF (GL-TRANS-TYPE
110500030411                       OF RYTMAPPING-REC IS EQUAL TO 1070 OR 2495) AND
110600030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
110700030411                        "F")
110800030411                      MOVE NET-AMT
110900030411                           OF TRANS-REC TO WS-SETL-AMT
111000030411
111100030411                      MOVE RECORD-DATE-BAL
111200030411                           OF TRANS-DISTR-DETAILS-REC TO WS-PAR-SHS-UNIT
111300030411
111400030411                      MOVE INCOME-DISTR-RATE
111500030411                           OF DISTRIBUTION-DECLARATION-REC TO
111600030411                           WS-PRICE-DIVND-RT
111700030411                    END-IF
111800030411
111900030411                    IF (GL-TRANS-TYPE
112000030411                       OF RYTMAPPING-REC IS EQUAL TO 3011 OR 5495) AND
112100030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
112200030411                        "F")
112300030411                       MOVE UNIT-AMT
112400030411                            OF TRANS-REC TO WS-PAR-SHS-UNIT
112500030411
112600030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
112700030411                                                    OF TRANS-REC
112800030411                       IF GL-TRANS-TYPE
112900030411                             OF RYTMAPPING-REC IS EQUAL TO 3011
113000030411                          MOVE UNIT-PRICE
113100030411                            OF TRANS-REC TO WS-PRICE-DIVND-RT
113200030411                       END-IF
113300030411                    END-IF
113400030411                    GO TO DPR-0060
113500030411                 END-IF
113600030411
113700210222      * RFS 186131 - starts
113800210222      *          IF INVESTMENT-TYPE
113900210222      *             OF INVESTMENT-GROUP-REC IS EQUAL TO "POL"
114000210222                 IF INV-TYPE-2
114100210222      * RFS 186131 - Ends
114200030411
114300030411                    IF (GL-TRANS-TYPE
114400030411                       OF RYTMAPPING-REC IS EQUAL TO 1071 OR 2495) AND
114500030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
114600030411                        "F")
114700030411                      MOVE NET-AMT
114800030411                           OF TRANS-REC TO WS-SETL-AMT
114900030411
115000030411                      MOVE RECORD-DATE-BAL
115100030411                         OF TRANS-DISTR-DETAILS-REC  TO WS-PAR-SHS-UNIT
115200030411
115300030411                      MOVE INCOME-DISTR-RATE
115400030411                           OF DISTRIBUTION-DECLARATION-REC TO
115500030411                           WS-PRICE-DIVND-RT
115600030411                    END-IF
115700030411
115800030411                    IF (GL-TRANS-TYPE
115900030411                       OF RYTMAPPING-REC IS EQUAL TO 3011 OR 5495) AND
116000030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
116100030411                        "F")
116200030411                       MOVE UNIT-AMT
116300030411                            OF TRANS-REC TO WS-PAR-SHS-UNIT
116400030411
116500030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
116600030411                                                    OF TRANS-REC
116700040601
116800040601      * RFS 20368 BEGIN
116900040601                       IF GL-TRANS-TYPE
117000040601                             OF RYTMAPPING-REC IS EQUAL TO 3011
117100040601                          MOVE UNIT-PRICE
117200040601                            OF TRANS-REC TO WS-PRICE-DIVND-RT
117300040601                       END-IF
117400040601      * RFS 20368 END
117500030411                    END-IF
117600030411                    GO TO DPR-0060
117700030411                 END-IF
117800030411              END-IF
117900030411
118000030411      *********************** INC CASH (MFT & POL)*********************
118100030411              IF DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS-REC
118200030411                 IS EQUAL TO "C"
118300030411
118400210222      * RFS 186131 - starts
118500210222      *          IF INVESTMENT-TYPE
118600210222      *             OF INVESTMENT-GROUP-REC IS EQUAL TO "MFT"
118700210222                 IF INV-TYPE-1
118800210222      * RFS 186131 - Ends
118900030411
119000030411                    IF TRUST-TYPE
119100030411                       OF RYTMAPPING-REC IS EQUAL TO "I"
119200030411                      MOVE NET-AMT
119300030411                           OF TRANS-REC TO WS-SETL-AMT
119400030411
119500030411                      MOVE RECORD-DATE-BAL
119600030411                        OF TRANS-DISTR-DETAILS-REC  TO WS-PAR-SHS-UNIT
119700030411
119800030411                      MOVE INCOME-DISTR-RATE
119900030411                           OF DISTRIBUTION-DECLARATION-REC TO
120000030411                           WS-PRICE-DIVND-RT
120100030411                    END-IF
120200030411
120300030411                    IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" OR
120400030411                       GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5495
120500030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
120600030411                                                    OF TRANS-REC
120700030411                    END-IF
120800030411
120900030411                    IF GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495
121000030411                       MOVE NET-AMT
121100030411                            OF TRANS-REC TO WS-SETL-AMT
121200030411                    END-IF
121300030411
121400030411                  GO TO DPR-0060
121500030411                 END-IF
121600030411
121700210222      * RFS 186131 - starts
121800210223      *          IF INVESTMENT-TYPE
121900210223      *             OF INVESTMENT-GROUP-REC IS EQUAL TO "POL"
122000210222                 IF INV-TYPE-2
122100210222      * RFS 186131 - Ends
122200030411
122300030411                    IF TRUST-TYPE
122400030411                       OF RYTMAPPING-REC IS EQUAL TO "I"
122500030411                      MOVE NET-AMT
122600030411                            OF TRANS-REC TO WS-SETL-AMT
122700030411
122800030411                      MOVE RECORD-DATE-BAL
122900030411                         OF TRANS-DISTR-DETAILS-REC  TO WS-PAR-SHS-UNIT
123000030411
123100030411                      MOVE INCOME-DISTR-RATE
123200030411                           OF DISTRIBUTION-DECLARATION-REC TO
123300030411                           WS-PRICE-DIVND-RT
123400030411                    END-IF
123500030411
123600030411                    IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" OR
123700030411                       GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5495
123800030411                       COMPUTE WS-SETL-AMT = (-1) * NET-AMT
123900030411                                                    OF TRANS-REC
124000030411                    END-IF
124100030411
124200030411                    IF GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495
124300030411                       MOVE NET-AMT
124400030411                            OF TRANS-REC TO WS-SETL-AMT
124500030411                    END-IF
124600030411
124700030411                  GO TO DPR-0060
124800030411                 END-IF
124900030411              END-IF
125000030411           END-IF.
125100030411
125200030411       DPR-0015.
125300030411
125400030411      **************************C P G**********************************
125500210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO  "CPG"
125600210222186131     IF WS-TRANS-TYPES  IS EQUAL TO  "CPG"
125700030411
125800030411              CONTINUE
125900030411           ELSE
126000030411              GO TO DPR-0016.
126100030411
126200030411           INITIALIZE MFATRNDDP
126300030411                     OF TRANS-DISTR-DETAILS-REC.
126400030411
126500030411           MOVE PLACEMENT-DATE
126600030411                OF TRANS-REC  TO  PLACEMENT-DATE
126700030411                                  OF TRANS-DISTR-DETAILS-REC.
126800030411
126900030411           MOVE TRANS-NO
127000030411                OF TRANS-REC  TO  TRANS-NO
127100030411                                  OF TRANS-DISTR-DETAILS-REC.
127200030411
127300030411           READ TRANS-DISTR-DETAILS
127400030411             INVALID KEY
127500030411                GO TO DPR-EXIT.
127600030411
127700030411           IF DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS-REC
127800030411              IS NOT EQUAL TO DISTR-OPTION OF RYTMAPPING-REC
127900030411
128000030411              GO TO DPR-0010.
128100030415
128200030415           MOVE DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS-REC
128300030415             TO WS-DISTR-OPTION-CODE.
128400030411
128500030411           INITIALIZE MFADISDCP
128600030411                      OF DISTRIBUTION-DECLARATION-REC.
128700030411
128800030411           MOVE DATE-OF-RECORD
128900030411             OF TRANS-DISTR-DETAILS TO DATE-OF-RECORD
129000030411                                       OF DISTRIBUTION-DECLARATION-REC.
129100030411           MOVE INVESTMENT-CODE
129200030411             OF TRANS-DISTR-DETAILS TO INVESTMENT-CODE
129300030411                                       OF DISTRIBUTION-DECLARATION-REC.
129400030411
129500030411           READ DISTRIBUTION-DECLARATION
129600030411             INVALID KEY
129700030411                GO TO DPR-EXIT.
129800030411
129900030411      ************************ CPG REINVEST ***************************
130000030411              IF DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS-REC
130100030411                 IS EQUAL TO "R"
130200030411
130300030411                 IF (GL-TRANS-TYPE
130400030411                    OF RYTMAPPING-REC IS EQUAL TO 1001 OR 2495) AND
130500030411                       (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
130600030411                        "F")
130700030411                   MOVE NET-AMT
130800030411                        OF TRANS-REC TO WS-SETL-AMT
130900030411
131000030411                   MOVE RECORD-DATE-BAL
131100030411                        OF TRANS-DISTR-DETAILS-REC  TO WS-PAR-SHS-UNIT
131200030411
131300030411                   MOVE CAPITAL-GAIN-DISTR-RATE
131400030411                        OF DISTRIBUTION-DECLARATION-REC TO
131500030411                        WS-PRICE-DIVND-RT
131600030411                 END-IF
131700030411
131800030411                 IF (GL-TRANS-TYPE
131900030411                     OF RYTMAPPING-REC IS EQUAL TO 3013 OR 5495) AND
132000030411                     (TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" OR
132100030411                      "F")
132200030411                   MOVE UNIT-AMT
132300030411                        OF TRANS-REC TO WS-PAR-SHS-UNIT
132400030411
132500030411                   COMPUTE WS-SETL-AMT = (-1) * NET-AMT
132600030411                                                OF TRANS-REC
132700030411                 END-IF
132800030411
132900030411              END-IF
133000030411
133100030411      ************************ CPG CASH *******************************
133200030411              IF DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS-REC
133300030411                 IS EQUAL TO "C"
133400030411
133500030411                 IF TRUST-TYPE
133600030411                    OF RYTMAPPING-REC IS EQUAL TO "I"
133700030411                   MOVE NET-AMT
133800030411                        OF TRANS-REC TO WS-SETL-AMT
133900030411
134000030411                   MOVE RECORD-DATE-BAL
134100030411                        OF TRANS-DISTR-DETAILS-REC  TO WS-PAR-SHS-UNIT
134200030411
134300030411                   MOVE CAPITAL-GAIN-DISTR-RATE
134400030411                        OF DISTRIBUTION-DECLARATION-REC TO
134500030411                        WS-PRICE-DIVND-RT
134600030411                 END-IF
134700030411
134800030411                 IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" OR
134900030411                    GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5495
135000030411                   COMPUTE WS-SETL-AMT = (-1) * NET-AMT
135100030411                                                OF TRANS-REC
135200030411                 END-IF
135300030411
135400030411                 IF GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495
135500030411                       MOVE NET-AMT
135600030411                            OF TRANS-REC TO WS-SETL-AMT
135700030411                 END-IF
135800030411           END-IF.
135900030411
136000030411       DPR-0016.
136100210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "FEE"
136200210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "FEE"
136300030411              CONTINUE
136400030411           ELSE
136500030411              GO TO DPR-0018.
136600030411
136700030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
136800030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 4035
136900030411              MOVE GROSS-AMT
137000030411                   OF TRANS-REC TO WS-SETL-AMT
137100030411              COMPUTE WS-PAR-SHS-UNIT = (-1) * UNIT-AMT OF TRANS-REC
137200030411           ELSE
137300030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
137400030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5754
137500030411              COMPUTE WS-SETL-AMT = (-1) * GROSS-AMT
137600030411                   OF TRANS-REC
137700030411              MOVE WS-INVESTMENT-NAME TO WS-MAP-TEXT
137800030411           END-IF.
137900030411
138000030411       DPR-0018.
138100210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "MFR"
138200210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "MFR"
138300030411              CONTINUE
138400030411           ELSE
138500030411              GO TO DPR-0050.
138600030527
138700030528      * RFS 17583 begin
138800030527           IF INVESTMENT-TYPE
138900030527               OF INVESTMENT-GROUP-REC IS NOT EQUAL TO
139000030527                                       INVESTMENT-TYPE
139100030527                                       OF RYTMAPPING-REC
139200030528                AND
139300030528              GL-TRANS-TYPE OF RYTMAPPING-REC IS NOT EQUAL 3011
139400030528              GO TO DPR-0010.
139500030528      * RFS 17583 end
139600030411
139700030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
139800030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 3011
139900030411              COMPUTE WS-SETL-AMT = (-1) * NET-AMT
140000030411                   OF TRANS-REC
140100030411              MOVE UNIT-AMT
140200030411                   OF TRANS-REC TO WS-PAR-SHS-UNIT
140300030528      * RFS 17583 begin
140400030527              MOVE UNIT-PRICE
140500030527                   OF TRANS-REC TO WS-PRICE-DIVND-RT
140600030527      *       MOVE WS-INT-FIXED-RT TO WS-PRICE-DIVND-RT
140700030528           ELSE
140800030527           IF INVESTMENT-TYPE
140900030527              OF INVESTMENT-GROUP-REC IS EQUAL TO "MFT" AND
141000030527              TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
141100030527              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 1070
141200030527              MOVE NET-AMT
141300030527                   OF TRANS-REC TO WS-SETL-AMT
141400030527              MOVE UNIT-AMT
141500030527                   OF TRANS-REC TO WS-PAR-SHS-UNIT
141600030527              MOVE WS-INT-FIXED-RT TO WS-PRICE-DIVND-RT
141700030527           ELSE
141800030527           IF INVESTMENT-TYPE
141900030527              OF INVESTMENT-GROUP-REC IS EQUAL TO "POL" AND
142000030527              TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
142100030527              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 1071
142200030527              MOVE NET-AMT
142300030527                   OF TRANS-REC TO WS-SETL-AMT
142400030527              MOVE UNIT-AMT
142500030527                   OF TRANS-REC TO WS-PAR-SHS-UNIT
142600030527              MOVE WS-INT-FIXED-RT TO WS-PRICE-DIVND-RT
142700030527           END-IF.
142800030527
142900030527      *    IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
143000030527      *       GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 1071
143100030527      *       MOVE NET-AMT
143200030527      *            OF TRANS-REC TO WS-SETL-AMT
143300030527      *    END-IF.
143400030527      * RFS 17583 end
143500030411           GO TO DPR-0060.
143600030411
143700030411       DPR-0050.
143800210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "SWO"
143900210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "SWO"
144000030411               CONTINUE
144100030411           ELSE
144200030411               GO TO DPR-0052
144300030411           END-IF.
144400030411
144500030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
144600030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5495
144700030411              COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
144800030411           ELSE
144900030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
145000030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 4035
145100030411              MOVE NET-AMT
145200030411                   OF TRANS-REC TO WS-SETL-AMT
145300030411              COMPUTE WS-PAR-SHS-UNIT = (-1) * UNIT-AMT OF TRANS-REC
145400030411           ELSE
145500030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
145600030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495
145700030411              MOVE NET-AMT
145800030411                   OF TRANS-REC TO WS-SETL-AMT
145900030411           END-IF.
146000030411
146100030411           GO TO DPR-0060.
146200030411
146300030411       DPR-0052.
146400210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "SWI"
146500210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "SWI"
146600030411               CONTINUE
146700030411           ELSE
146800030411               GO TO DPR-0054
146900030411           END-IF.
147000030411
147100030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
147200030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 3010
147300030411              COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
147400030411              MOVE UNIT-AMT
147500030411                OF TRANS-REC TO WS-PAR-SHS-UNIT
147600030411           ELSE
147700030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
147800030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495
147900030411              MOVE NET-AMT
148000030411                OF TRANS-REC TO WS-SETL-AMT
148100030411           ELSE
148200030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
148300030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5495
148400030411              COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
148500030411           END-IF.
148600030411
148700030411           GO TO DPR-0060.
148800030411
148900030411       DPR-0054.
149000210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "TRO"
149100210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "TRO"
149200030411               CONTINUE
149300030411           ELSE
149400030411               GO TO DPR-0056
149500030411           END-IF.
149600030411
149700030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
149800030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 4035
149900030411              MOVE NET-AMT
150000030411                   OF TRANS-REC TO WS-SETL-AMT
150100030411              COMPUTE WS-PAR-SHS-UNIT = (-1) * UNIT-AMT OF TRANS-REC
150200030411           ELSE
150300030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
150400030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5495
150500030411              COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
150600030411           ELSE
150700030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
150800030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5495
150900030411              COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
151000030411           ELSE
151100030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
151200030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495
151300030411              MOVE NET-AMT
151400030411                   OF TRANS-REC TO WS-SETL-AMT
151500030411           END-IF.
151600030411
151700030411           GO TO DPR-0060.
151800030411
151900030411       DPR-0056.
152000210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "TRI"
152100210222186131     IF WS-TRANS-TYPES  IS EQUAL TO "TRI"
152200030411               CONTINUE
152300030411           ELSE
152400030411               GO TO DPR-0060
152500030411           END-IF.
152600030411
152700030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
152800030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 3010
152900030411              COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
153000030411              MOVE UNIT-AMT
153100030411                OF TRANS-REC TO WS-PAR-SHS-UNIT
153200030411           ELSE
153300030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
153400030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495 AND
153500030411              RECORD-NO OF RYTMAPPING-REC IS EQUAL TO 2
153600030411              MOVE NET-AMT
153700030411                OF TRANS-REC TO WS-SETL-AMT
153800030411           ELSE
153900030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
154000030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495 AND
154100030411              RECORD-NO OF RYTMAPPING-REC IS EQUAL TO 3
154200030411              MOVE NET-AMT
154300030411                OF TRANS-REC TO WS-SETL-AMT
154400030411           ELSE
154500030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
154600030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 5495
154700030411              COMPUTE WS-SETL-AMT = (-1) * NET-AMT OF TRANS-REC
154800030411           END-IF.
154900030411
155000030411       DPR-0060.
155100030411
155200210222186131*    IF TRANS-TYPE-CODE OF TRANS-REC IS EQUAL TO "BUY" OR "SEL"
155300210222186131     IF WS-TRANS-TYPES               IS EQUAL TO "BUY" OR "SEL"
155400030411                                                    OR "SWO" OR "SWI"
155500030411                                                    OR "TRO" OR "TRI"
155600030411                                                    OR "FEE" OR "MFR"
155700030411              MOVE ZEROES TO WS-NR-TAX-RT
155800030411              MOVE ZEROES TO WS-NR-TAX-AMT
155900030411              GO TO DPR-0070.
156000030411
156100030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I" AND
156200030411             (GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 1001 OR
156300030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 1070 OR
156400030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 1071)
156500030411              CONTINUE
156600030411           ELSE
156700030411              MOVE ZEROES TO WS-NR-TAX-RT
156800030411              MOVE ZEROES TO WS-NR-TAX-AMT
156900030411              GO TO DPR-0070.
157000030411
157100030411           INITIALIZE MFATRNCHP
157200030411                     OF TRANS-CHARGES-REC.
157300030411
157400030411           MOVE PLACEMENT-DATE
157500030411                OF TRANS-REC  TO  PLACEMENT-DATE
157600030411                                  OF TRANS-CHARGES-REC.
157700030411
157800030411           MOVE TRANS-NO
157900030411                OF TRANS-REC  TO  TRANS-NO
158000030411                                  OF TRANS-CHARGES-REC.
158100030411
158200030411           MOVE "NONT"        TO  DEDUCTION-CODE
158300030411                                  OF TRANS-CHARGES-REC.
158400030411
158500030411           READ TRANS-CHARGES
158600030411             INVALID KEY
158700030411              MOVE ZEROES TO WS-NR-TAX-RT
158800030411              MOVE ZEROES TO WS-NR-TAX-AMT
158900030411              GO TO DPR-0070.
159000030411
159100030411           MOVE RATE
159200030411                OF TRANS-CHARGES-REC TO WS-NR-TAX-RT.
159300030411
159400030411           MOVE CHARGE
159500030411                OF TRANS-CHARGES-REC TO WS-NR-TAX-AMT
159600030411                                        WS-NR-AMOUNT-NO9.
159700030411
159800030411           STRING
159900030411              "NR TAX-AMOUNT WITHHELD $" DELIMITED BY SIZE
160000030411              WS-NR-AMOUNT-X9 DELIMITED BY SIZE
160100030411              "." DELIMITED BY SIZE
160200030411              WS-NR-AMOUNT-X3 DELIMITED BY SIZE
160300030411              INTO WS-MAP-TEXT.
160400030411
160500030411       DPR-0070.
160600030411
160700030411           MOVE PROCESS-DATE
160800030411                OF TRANS-REC TO WS-SETL-DT.
160900030411
161000030411           IF GL-TRANS-TYPE
161100030411              OF RYTMAPPING-REC IS EQUAL TO 2495 OR 5495
161200030411
161300030411              MOVE ZEROES TO WS-SETL-DT
161400030411              MOVE ZEROES TO WS-PRICE-DIVND-RT.
161500030411
161600030411           IF GL-TRANS-TYPE
161700030411              OF RYTMAPPING-REC IS EQUAL TO 3010 OR 3013 OR 4035
161800030411              MOVE UNIT-PRICE
161900030411                   OF TRANS-REC TO WS-PRICE-DIVND-RT.
162000030411
162100030411           MOVE TRADE-DATE
162200030411                OF TRANS-REC TO WS-TRADE-EFFECT-DT.
162300030411
162400030411           INSPECT ACCNORIG OF ACCOUNT-XREF-REC REPLACING ALL " "
162500030411                               BY "*".
162600030411
162700030411           UNSTRING ACCNORIG OF ACCOUNT-XREF-REC
162800030411                    DELIMITED BY ALL "*"
162900030411                    INTO WS-ACCOUNT-NUM1 WS-ACCOUNT-NUM2.
163000030411
163100030411           IF WS-ACCOUNT-NUM2 EQUAL TO SPACES
163200030411              UNSTRING WS-ACCOUNT-NUM1 DELIMITED BY " "
163300030411                       INTO WS-ACCOUNT-NUMBER
163400030411           ELSE
163500030411              UNSTRING WS-ACCOUNT-NUM2 DELIMITED BY " "
163600030411                       INTO WS-ACCOUNT-NUMBER
163700030411           END-IF.
163800030411
163900030411           INSPECT WS-ACCOUNT-NUMBER REPLACING ALL " " BY "0".
164000030411
164100070226      *RFS 38029 Begins
164200070226           IF li-AccountNo IS NOT NUMERIC
164300070226              MOVE ZEROES TO WS-ACCT-NUM
164400070226                             WS-ALT-ACCT-NO
164500070226           ELSE
164600070226      *RFS 38029 Ends
164700070226              MOVE WS-ACCOUNT-NUMBER TO WS-ACCT-NUM
164800030411                                     WS-ALT-ACCT-NO.
164900030411
165000030411           IF WS-ACCT-NUM IS EQUAL TO ZEROES
165100030411              GO TO DPR-0010
165200030411           END-IF.
165300030411
165400030411           IF TRANSFER-IN AND
165500030411              TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F" AND
165600030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS EQUAL TO 2495 AND
165700030411              RECORD-NO OF RYTMAPPING-REC IS EQUAL TO 3
165800030411              GO TO DPR-0090
165900030411           END-IF.
166000030411
166100030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "F"
166200030411              GO TO DPR-0080
166300030411           ELSE
166400030411              GO TO DPR-0090.
166500030411
166600030411       DPR-0080.
166700030411
166800030411           IF SUBS
166900030411              MOVE PURCHASE-SUSPENSE-ACCOUNT OF
167000030411                   INVESTMENT-TRUST-ACCOUNT-REC
167100030411                TO TRUST-ACCOUNT-CODE OF
167200030411                   TRUST-ACCOUNT
167300030411           ELSE
167400030411           IF REDS
167500030411              MOVE REDEMPTION-SUSPENSE-ACCOUNT OF
167600030411                   INVESTMENT-TRUST-ACCOUNT-REC
167700030411                TO TRUST-ACCOUNT-CODE OF TRUST-ACCOUNT
167800030411           ELSE
167900030411           IF DISTRIBUTION AND REINVEST-DIST AND
168000030411              RECORD-NO OF RYTMAPPING-REC IS EQUAL 2
168100041014      **** RFS 23534 START ****
168200041014              OR RECORD-NO OF RYTMAPPING-REC IS EQUAL 5
168300041014      **** RFS 23534 END ****
168400030411              MOVE REDEMPTION-SUSPENSE-ACCOUNT OF
168500030411                   INVESTMENT-TRUST-ACCOUNT-REC
168600030411                TO TRUST-ACCOUNT-CODE OF TRUST-ACCOUNT
168700030411           ELSE
168800030411           IF DISTRIBUTION AND REINVEST-DIST AND
168900030411              RECORD-NO OF RYTMAPPING-REC IS EQUAL 4
169000041013      **** RFS 23534 START ****
169100041013              OR RECORD-NO OF RYTMAPPING-REC IS EQUAL 6
169200041013      **** RFS 23534 END ****
169300030411              MOVE PURCHASE-SUSPENSE-ACCOUNT OF
169400030411                   INVESTMENT-TRUST-ACCOUNT-REC
169500030411                TO TRUST-ACCOUNT-CODE OF TRUST-ACCOUNT
169600030502           ELSE
169700030502           IF DISTRIBUTION AND CASH-DIST
169800030502              MOVE REDEMPTION-SUSPENSE-ACCOUNT OF
169900030502                   INVESTMENT-TRUST-ACCOUNT-REC
170000030502                TO TRUST-ACCOUNT-CODE OF TRUST-ACCOUNT
170100030411           END-IF.
170200030411
170300030411       DPR-0082.
170400030411
170500030411           READ TRUST-ACCOUNT
170600030411             INVALID KEY
170700030411             GO TO DPR-0084
170800030411           END-READ.
170900030411
171000030411           INITIALIZE MFATRBNKP OF TRUST-ACCT-BANK-ACCT-REC.
171100030411
171200030411           MOVE BANK-SEQ-NO OF TRUST-ACCOUNT-REC
171300030411             TO BANK-SEQ-NO OF TRUST-ACCT-BANK-ACCT.
171400030411
171500030411           READ TRUST-ACCT-BANK-ACCT
171600030411            INVALID KEY
171700030411             GO TO DPR-0084
171800030411           END-READ.
171900030411
172000030411           MOVE BANK-ACCOUNT-NO OF TRUST-ACCT-BANK-ACCT-REC
172100030411             TO WS-BROKER-TRUST-ACCT.
172200030411
172300030411           INSPECT WS-BROKER-TRUST-ACCT
172400030411                   REPLACING ALL " "  BY "*".
172500030411
172600030411           UNSTRING WS-BROKER-TRUST-ACCT
172700030411                    DELIMITED BY ALL "*"
172800030411                    INTO WS-ACCOUNT-NUM1 WS-ACCOUNT-NUM2.
172900030411
173000030411           IF WS-ACCOUNT-NUM2 EQUAL TO SPACES
173100030411              UNSTRING WS-ACCOUNT-NUM1 DELIMITED BY " "
173200030411                       INTO WS-ACCOUNT-NUMBER
173300030411           ELSE
173400030411              UNSTRING WS-ACCOUNT-NUM2 DELIMITED BY " "
173500030411                       INTO WS-ACCOUNT-NUMBER
173600030411           END-IF.
173700030411
173800030411       DPR-0084.
173900030411           INSPECT WS-ACCOUNT-NUMBER REPLACING ALL " " BY "0".
174000030411
174100030411           MOVE WS-ACCOUNT-NUMBER TO WS-ACCT-NUM.
174200030411
174300030411       DPR-0090.
174400030411
174500030411           MOVE SPACES   TO WS-ADD-TEXT1.
174600030411
174700030411           IF ADDITIONAL-TEXT OF RYTMAPPING-REC IS NOT EQUAL SPACES
174800030411              MOVE ADDITIONAL-TEXT OF RYTMAPPING-REC TO WS-MAP-TEXT
174900030411              STRING
175000030411                 WS-MAP-TEXT DELIMITED BY "  "
175100030411                 SPACE DELIMITED BY SIZE
175200030411                 COMM-PARM-DATE DELIMITED BY SIZE
175300030411                 SPACE DELIMITED BY SIZE
175400030411                 WS-ALT-ACCT-NO DELIMITED BY SIZE
175500030411                 INTO WS-ADD-TEXT1
175600030411           ELSE
175700030411              STRING
175800030411                 WS-MAP-TEXT DELIMITED BY "  "
175900030411                 INTO WS-ADD-TEXT1.
176000030411
176100030411           INSPECT CUSIP-CODE OF INVESTMENT-REC REPLACING ALL " "
176200030411                               BY "*".
176300030411
176400030411           UNSTRING CUSIP-CODE OF INVESTMENT-REC
176500030411                    DELIMITED BY ALL "*"
176600030411                    INTO WS-PPTY-NUM1 WS-PPTY-NUM2.
176700030411
176800030411           IF WS-PPTY-NUM2 EQUAL TO SPACES
176900030411              UNSTRING WS-PPTY-NUM1 DELIMITED BY " "
177000030411                       INTO WS-PPTY-NUMBER
177100030411           ELSE
177200030411              UNSTRING WS-PPTY-NUM2 DELIMITED BY " "
177300030411                       INTO WS-PPTY-NUMBER
177400030411           END-IF.
177500030411
177600030411           INSPECT WS-PPTY-NUMBER REPLACING ALL " " BY "0".
177700030411
177800030411           IF TRUST-TYPE OF RYTMAPPING-REC IS EQUAL TO "I"
177900030411              MOVE 75 TO WS-PPTY-MJR-TP
178000030411              MOVE WS-PPTY-NUMBER TO WS-PPTY-NUM.
178100030411
178200030411           IF GL-TRANS-TYPE OF RYTMAPPING-REC IS NOT EQUAL 1001 AND
178300030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS NOT EQUAL 1070 AND
178400030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS NOT EQUAL 1071 AND
178500030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS NOT EQUAL 2495 AND
178600030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS NOT EQUAL 5495 AND
178700030411              GL-TRANS-TYPE OF RYTMAPPING-REC IS NOT EQUAL 5754
178800030411              MOVE 1  TO WS-REV-CD
178900030411           END-IF.
179000030411
179100030411           IF WS-SETL-AMT IS LESS THAN ZEROES
179200030411              MOVE "-" TO WS-SIGN-1
179300030411              COMPUTE WS-HASH-TOTALS = WS-HASH-TOTALS + WS-SETL-AMT
179400030411              COMPUTE WS-SETL-AMT = WS-SETL-AMT * (-1)
179500030411           ELSE
179600030411              MOVE "+" TO WS-SIGN-1
179700030411              COMPUTE WS-HASH-TOTALS = WS-HASH-TOTALS + WS-SETL-AMT
179800030411           END-IF.
179900030411
180000030508           IF WS-TRANS-CD IS EQUAL TO 2495 OR 5495 OR 5754
180100030411              MOVE ZEROES TO WS-PAR-SHS-UNIT
180200030411              MOVE ZEROES TO WS-NR-TAX-RT
180300030411              MOVE ZEROES TO WS-TRADE-EFFECT-DT
180400030507              MOVE ZEROES TO WS-PPTY-MJR-TP
180500030507              MOVE ZEROES TO WS-TRADE-EFFECT-DT
180600030507              MOVE ZEROES TO WS-PPTY-NUM
180700030411           END-IF.
180800030411
180900030411           IF WS-PAR-SHS-UNIT IS LESS THAN ZEROES
181000030411              MOVE "-" TO WS-SIGN-2
181100030411              COMPUTE WS-PAR-SHS-UNIT = WS-PAR-SHS-UNIT * (-1)
181200030411           ELSE
181300030411              MOVE "+" TO WS-SIGN-2
181400030411           END-IF.
181500030411
181600030411           ADD 1 TO WS-REC-COUNT.
181700030411           MOVE 1 TO WS-RECORD-TPD.
181800030411           MOVE "Y" TO WS-DETAIL-RECORDS.
181900030411
182000030411           MOVE "INSERT INTO MFARTUNDTL RECORDS"
182100030411             TO WS-SQLERR-STATEMENT.
182200030411
182300030411           EXEC SQL
182400030411                INSERT INTO MFARTUNDTL VALUES(:WS-RECORD-TPD,
182500030411                 :WS-ACCT-NUM,        :WS-TRANS-CD, :WS-SIGN-1,
182600030411                 :WS-SETL-AMT,        :WS-SETL-CRCY-CD,
182700030411                 :WS-SETL-DT,         :WS-PPTY-MJR-TP,
182800030411                 :WS-PPTY-NUM,        :WS-SIGN-2,
182900030411                 :WS-PAR-SHS-UNIT,    :WS-PRICE-DIVND-RT,
183000030411                 :WS-ADD-TEXT1,       :WS-ADD-TEXT2,
183100030411                 :WS-CNCL-REVRS-IND,  :WS-CNCL-REVRS-DT,
183200030411                 :WS-BK-VAL-ACCT,     :WS-NR-TAX-RT,
183300030411                 :WS-NR-TAX-AMT,      :WS-INT-TERM-CD,
183400030411                 :WS-CO-TERM-CD,      :WS-INT-DAYS,
183500030411                 :WS-INT-RATE,        :WS-MAT-DT,
183600030411                 :WS-ORIG-ISS-DT,     :WS-PROD-FD-CD,
183700030411                 :WS-IRIS-FD-NO,      :WS-IRIS-ACCT,
183800030411                 :WS-IRIS-SEQ-NO,     :WS-TRADE-CRCY-CD,
183900030411                 :WS-TRADE-EFFECT-DT, :WS-SETL-EXCH-RT,
184000030411                 :WS-SETL-EXCH-AMT,   :WS-REV-CD,
184100030411                 :WS-LOC-CD,          :WS-REG-CD,
184200030411                 :WS-FILLER)
184300030411           END-EXEC.
184400030411
184500030411           GO TO DPR-0010.
184600030411
184700030411       DPR-EXIT.
184800030411           EXIT.
184900030411      /
185000210222      * RFS 186131 - Begins
185100210222       GET-CURRENCY-ON-SWI.
185200210222            INITIALIZE LC-CURRENCY-IN
185300210222      *
185400210222            EXEC SQL
185500210222              SELECT INVP.CURRENCY INTO :LC-CURRENCY-IN
185600210222              FROM
185700210222              MFATRNTGP TRNTGP
185800210222              INNER JOIN MFATRNP TRNP ON
185900210222                  TRNTGP.PLACEMENT_DATE_2 = TRNP.PLACEMENT_DATE
186000210222              AND TRNTGP.TRANS_NO_2       = TRNP.TRANS_NO
186100210222              INNER JOIN MFAINVP INVP ON
186200210222                  TRNP.INVESTMENT_CODE    = INVP.INVESTMENT_CODE
186300210222              WHERE
186400210222                   TRNTGP.PLACEMENT_DATE = :LI-PLACEMENT-DATE
186500210222               AND TRNTGP.TRANS_NO        = :LI-TRANS-NO
186600210222               AND TRNTGP.RELATIONSHIP_TYPE IN ("DCA", "DSB", "WSB")
186700210222               AND TRNP.TRANS_TYPE_CODE = "SWI"
186800210222            END-EXEC
186900210222            MOVE SQLSTATE TO lc_sqlStates
187000210222            IF NOT lncc_sqlSuccessful
187100210222               MOVE SPACES                    TO LC-CURRENCY-IN
187200210222            END-IF
187300210222       .
187400210222
187500210222       GET-CURRENCY-ON-SWO.
187600210222            INITIALIZE LC-CURRENCY-OUT
187700210222      *
187800210222            EXEC SQL
187900210222              SELECT INVP.CURRENCY INTO :LC-CURRENCY-OUT
188000210222              FROM
188100210222              MFATRNTGP TRNTGP
188200210222              INNER JOIN MFATRNP TRNP ON
188300210222                  TRNTGP.PLACEMENT_DATE   = TRNP.PLACEMENT_DATE
188400210222              AND TRNTGP.TRANS_NO         = TRNP.TRANS_NO
188500210222              INNER JOIN MFAINVP INVP ON
188600210222                  TRNP.INVESTMENT_CODE    = INVP.INVESTMENT_CODE
188700210222              WHERE
188800210222                   TRNTGP.PLACEMENT_DATE_2 = :LI-PLACEMENT-DATE
188900210222               AND TRNTGP.TRANS_NO_2       = :LI-TRANS-NO
189000210222               AND TRNTGP.RELATIONSHIP_TYPE IN ("DCA", "DSB", "WSB")
189100210222               AND TRNP.TRANS_TYPE_CODE = "SWO"
189200210222            END-EXEC
189300210222            MOVE SQLSTATE TO lc_sqlStates
189400210222            IF NOT lncc_sqlSuccessful
189500210222               MOVE SPACES                    TO LC-CURRENCY-OUT
189600210222            END-IF
189700210222       .
189800210222      * RFS 186131 - Ends
189900030411       INITIAL-LOGIC-RTN.
190000030411      ********************************************************************
190100030411      *                                                                  *
190200030411      *           I N I T I A L   L O G I C   R O U T I N E              *
190300030411      *                                                                  *
190400030411      ********************************************************************
190500030411
190600030411      ****
190700030411      **** Open file
190800030411      ****
190900030411
191000030411           OPEN    INPUT   INVESTMENT
191100030411                           INVESTMENT-NAME
191200030411                           TRANS-CHARGES
191300030411                           RYTMAPPING
191400030411                           TRANS
191500030411                           TRUST-ACCOUNT
191600030411                           TRUST-ACCT-BANK-ACCT
191700030411                           ACCOUNT-XREF
191800030411                           PRODUCT-TYPE-CODES
191900030411                           INVESTMENT-GROUP
192000030411                           INVESTMENT-TRUST-ACCOUNT
192100040601R20368                     INVESTMENT-NOTIONAL-DIST-DTLS
192200030411                           TRANS-DISTR-DETAILS
192300030411                           DISTRIBUTION-DECLARATION
192400030411                           TRANS-INTEREST-DETAILS.
192500030411
192600030411           EXEC SQL
192700131023125459*       WHENEVER SQLERROR GOTO SQLLOG
192800131023125459        WHENEVER SQLERROR CONTINUE
192900030411           END-EXEC.
193000030411
193100131210131766     EXEC SQL
193200131210131766       DROP TABLE MFAPEPEXP
193300131210131766     END-EXEC.
193400131210
193500131210131766     MOVE "CREATE OF TABLE  MFAPEPEXP"
193600131210131766       TO WS-SQLERR-STATEMENT.
193700131210
193800131210131766     EXEC SQL
193900131210131766       CREATE TABLE MFAPEPEXP (
194000131210131766       ACCOUNT_NO          NUMERIC   (09) NOT NULL WITH DEFAULT,
194100131210131766       TRANS_TYPE_CODE     CHAR      (03) NOT NULL WITH DEFAULT,
194200131210131766       INVESTMENT_NAME     CHAR      (35) NOT NULL WITH DEFAULT,
194300131210131766       INVESTMENT_CODE     CHAR      (05) NOT NULL WITH DEFAULT,
194400131210131766       UNIT_AMT            DECIMAL (13,3) NOT NULL WITH DEFAULT,
194500131210131766       UNIT_PRICE          DECIMAL (09,4) NOT NULL WITH DEFAULT,
194600131210131766       MANAGEMENT_FEE_AMT  DECIMAL (13,2) NOT NULL WITH DEFAULT,
194700131210131766       CURR_UNITS_CHRG     DECIMAL (13,3) NOT NULL WITH DEFAULT,
194800131210131766       CHARGE              DECIMAL (13,2) NOT NULL WITH DEFAULT,
194900131210131766       GROSS_OR_NET        CHAR      (01) NOT NULL WITH DEFAULT,
195000131210131766       NET_AMT             DECIMAL (13,2) NOT NULL WITH DEFAULT,
195100131210131766       GROSS_AMT           DECIMAL (13,2) NOT NULL WITH DEFAULT,
195200131210131766       PLACEMENT_DATE      DECIMAL (09,0) NOT NULL WITH DEFAULT,
195300131210131766       TRANS_NO            DECIMAL (09,0) NOT NULL WITH DEFAULT,
195400131210131766       REJECTION_CODE      CHAR      (40) NOT NULL WITH DEFAULT)
195500131210131766     END-EXEC.
195600131210
195700140304      *RFS132751 - BEGINS *
195800140304
195900140304           EXEC SQL
196000140304             DROP TABLE MFAWRKFLE
196100140304           END-EXEC.
196200140304
196300140310           MOVE SQLSTATE  TO lc_sqlstates
196400140310           IF SQLSTATE = WS-SQL-TBL-NOT-EXIST OR WS-SQL-SUCCESSFUL
196500140310              CONTINUE
196600140310           ELSE
196700140310              SET lncc_Err_10  TO TRUE
196800140310              PERFORM DSP-ERROR
196900140310           END-IF.
197000140310
197100140304           MOVE "CREATE OF TABLE  MFAWRKFLE"
197200140304             TO WS-SQLERR-STATEMENT.
197300140304
197400140304           EXEC SQL
197500140304             CREATE TABLE MFAWRKFLE (
197600140304              ACCOUNT_NO          NUMERIC   (09) NOT NULL WITH DEFAULT,
197700140304              TRANS_TYPE_CODE     CHAR      (03) NOT NULL WITH DEFAULT,
197800140304              PLACEMENT_DATE      DECIMAL (09,0) NOT NULL WITH DEFAULT,
197900140304              TRANS_NO            DECIMAL (09,0) NOT NULL WITH DEFAULT,
198000140304              EXCEPTION_RULE      CHAR      (01) NOT NULL WITH DEFAULT)
198100140304           END-EXEC.
198200140304      *RFS132751 - Ends *
198300140304
198400030411           MOVE "N" TO WS-DETAIL-RECORDS.
198500030411           INITIALIZE    WS-HASH-TOTALS
198600030411                         WS-REC-COUNT.
198700030411           INITIALIZE    MFATRNP
198800030411                         OF TRANS-REC.
198900030411
199000030527      * RFS 17583 begin
199100030527      *    CALL "GETDAT" USING WS-CURRENT-DATE.
199200030527      * RFS 17583 end
199300030411
199400030411           MOVE COMM-PARM-MGMT-CODE TO WS-COMP-MGMT.
199500030411           MOVE COMM-PARM-VERSION TO WS-COMP-VER.
199600030411
199700030411           MOVE LOW-VALUES       TO CURR-CONTROLS
199800030411                                    PREV-CONTROLS.
199900030411
200000140304      *RFS132751 - BEGINS *
200100140304           MOVE COMM-PARM-DATE TO lnProcessdate.
200200210614      *RFS1115914- BEGINS *
200300210304      *RFS186131 - starts
200400210614      *    IF COMM-Last-Process-Date is not equal to zeroes
200500210614      *       MOVE COMM-Last-Process-Date    TO lnProcessdate
200600210614      *    END-IF
200700210304      *RFS186131 - Ends
200800140304
200900210614      *    CALL "RYTUTHEEXT" USING lnProcessdate.
201000210614           MOVE COMM-Last-Process-Date
201100210614                               TO ln_Lastprocessdate
201200210614           CALL "RYTUTHEEXT" USING lnProcessdate,
201300210614                                   ln_Lastprocessdate.
201400210614      *RFS1115914- Ends   *
201500140304      *RFS132751 - ENDS   *
201600140304
201700210222      *RFS186131 - starts
201800210222           IF COMM-Last-Process-Date = 0
201900210222      *RFS186131 - Ends
202000030411           MOVE COMM-PARM-DATE   TO  PROCESS-DATE
202100030411                                 OF  TRANS
202200030527      * RFS 17583 begin
202300030527                                     WS-PROCESS-DT
202400030527      * RFS 17583 end
202500030411                                     WS-UNITRAX-DT.
202600210222      *RFS186131 - starts
202700210222           IF COMM-Last-Process-Date not equal to zeroes
202800210223              MOVE COMM-LAST-PROCESS-DATE
202900210222                                 TO  PROCESS-DATE
203000210222                                 OF  TRANS
203100210223              MOVE COMM-PARM-DATE
203200210223                                 TO  WS-PROCESS-DT
203300210223                                     WS-UNITRAX-DT
203400210223           END-IF
203500210222      *RFS186131 - Ends
203600030411
203700030411           MOVE LOW-VALUES       TO  INVESTMENT-CODE
203800070226                                 OF  TRANS.
203900070226           MOVE ZEROES           TO  ACCOUNT-NO
204000030411                                 OF  TRANS.
204100030411
204200030411           START TRANS
204300030411               KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
204400030411               INVALID KEY
204500030411               MOVE HIGH-VALUES TO CURR-CONTROLS
204600030411               GO TO INL-EXIT
204700030411           END-START.
204800030411
204900131023      *RFS125459 - START
205000130405
205100131210131766*    EXEC SQL
205200131210131766*      DROP TABLE MFAPEPEXP
205300131210131766*    END-EXEC.
205400130405
205500131210131766*    MOVE "CREATE OF TABLE  MFAPEPEXP"
205600131210131766*      TO WS-SQLERR-STATEMENT.
205700130405
205800131210131766*    EXEC SQL
205900131210131766*      CREATE TABLE MFAPEPEXP (
206000131210131766*      ACCOUNT_NO          NUMERIC   (09) NOT NULL WITH DEFAULT,
206100131210131766*      TRANS_TYPE_CODE     CHAR      (03) NOT NULL WITH DEFAULT,
206200131210131766*      INVESTMENT_NAME     CHAR      (35) NOT NULL WITH DEFAULT,
206300131210131766*      INVESTMENT_CODE     CHAR      (05) NOT NULL WITH DEFAULT,
206400131210131766*      UNIT_AMT            DECIMAL (13,3) NOT NULL WITH DEFAULT,
206500131210131766*      UNIT_PRICE          DECIMAL (09,4) NOT NULL WITH DEFAULT,
206600131210131766*      MANAGEMENT_FEE_AMT  DECIMAL (13,2) NOT NULL WITH DEFAULT,
206700131210131766*      CURR_UNITS_CHRG     DECIMAL (13,3) NOT NULL WITH DEFAULT,
206800131210131766*      CHARGE              DECIMAL (13,2) NOT NULL WITH DEFAULT,
206900131210131766*      GROSS_OR_NET        CHAR      (01) NOT NULL WITH DEFAULT,
207000131210131766*      NET_AMT             DECIMAL (13,2) NOT NULL WITH DEFAULT,
207100131210131766*      GROSS_AMT           DECIMAL (13,2) NOT NULL WITH DEFAULT,
207200131210131766*      PLACEMENT_DATE      DECIMAL (09,0) NOT NULL WITH DEFAULT,
207300131210131766*      TRANS_NO            DECIMAL (09,0) NOT NULL WITH DEFAULT,
207400131210131766*      REJECTION_CODE      CHAR      (40) NOT NULL WITH DEFAULT)
207500131210131766*    END-EXEC.
207600130405
207700131023      *RFS125459 - END
207800130405
207900030411       INL-EXIT.
208000030411           EXIT.
208100030411      /
208200030411       WRITE-HEADER-RTN.
208300030411      ********************************************************************
208400030411      *                                                                  *
208500030411      *                W R I T E   H E A D E R    R T N                  *
208600030411      *                                                                  *
208700030411      ********************************************************************
208800030411
208900030411           IF NO-RECORDS
209000030411              GO TO WHR-EXIT
209100030411           END-IF.
209200030411
209300030411           MOVE "INSERT INTO MFARTUNHDR RECORDS"
209400030411             TO WS-SQLERR-STATEMENT.
209500030411
209600030411           ADD 1 TO WS-REC-COUNT.
209700030411           MOVE WS-COMP-CENTRE TO WS-COMP-CTR.
209800030528      * RFS 17583 begin
209900030528      *    MOVE WS-CURRENT-DATE TO WS-PROCESS-DT.
210000030528      * RFS 17583 end
210100030411
210200030411           EXEC SQL
210300030411                INSERT INTO MFARTUNHDR VALUES(:WS-RECORD-TPH,
210400030411                  :WS-FILE-TYPE, :WS-COMP-CTR,
210500030411                  :WS-UNITRAX-DT, :WS-PROCESS-DT,
210600030411                  :FILLER-HDR)
210700030411           END-EXEC.
210800030411
210900030411
211000030411       WHR-EXIT.
211100030411           EXIT.
211200030411      /
211300030411       WRITE-TRAILER-RTN.
211400030411      ********************************************************************
211500030411      *                                                                  *
211600030411      *                W R I T E   T R A I L E R   R T N                 *
211700030411      *                                                                  *
211800030411      ********************************************************************
211900030411           IF NO-RECORDS
212000030411              GO TO WTR-EXIT
212100030411           END-IF.
212200030411
212300030411           MOVE "INSERT INTO MFARTUNTRL RECORDS"
212400030411             TO WS-SQLERR-STATEMENT.
212500030411
212600030411           ADD 1 TO WS-REC-COUNT.
212700030411           MOVE WS-REC-COUNT TO WS-NUMBER.
212800030411           MOVE WS-HASH-TOTALS TO WS-TOTAL-AMT.
212900030411
213000030411           EXEC SQL
213100030411                INSERT INTO MFARTUNTRL VALUES(:WS-RECORD-TPT,
213200030411                  :WS-NUMBER,  :WS-TOTAL-AMT,
213300030411                  :FILLER-TRL)
213400030411           END-EXEC.
213500030411
213600030411       WTR-EXIT.
213700030411           EXIT.
213800030411      /
213900030411       END-JOB-RTN.
214000030411      ********************************************************************
214100030411      *                                                                  *
214200030411      *                E N D    J O B    R O U T I N E                   *
214300030411      *                                                                  *
214400030411      ********************************************************************
214500030411
214600030411      ****
214700030411      **** Close files.
214800030411      ****
214900030411
215000030411           CLOSE           INVESTMENT
215100030411                           INVESTMENT-NAME
215200030411                           TRANS-CHARGES
215300030411                           RYTMAPPING
215400030411                           ACCOUNT-XREF
215500030411                           PRODUCT-TYPE-CODES
215600030411                           INVESTMENT-GROUP
215700030411                           INVESTMENT-TRUST-ACCOUNT
215800030411                           TRANS-DISTR-DETAILS
215900030411                           TRANS-INTEREST-DETAILS
216000030411                           TRUST-ACCOUNT
216100030411                           TRUST-ACCT-BANK-ACCT
216200030411                           DISTRIBUTION-DECLARATION
216300040601R20368                     INVESTMENT-NOTIONAL-DIST-DTLS
216400030411                           TRANS.
216500030411       EJR-EXIT.
216600030411           EXIT.
216700030411      /
216800030411       SQLLOG.
216900030411      ********************************************************************
217000030411      *                                                                  *
217100030411      *                S Q L L O G    R O U T I N E                      *
217200030411      *                                                                  *
217300030411      ********************************************************************
217400030411
217500030411           CALL "SQLLOG"     USING WS-CALLING-PROGRAM
217600030411                                   WS-SQLERR-STATEMENT
217700030411                                   SQLCODE
217800030411                                   SQLERRD(1)
217900030411                                   SQLERRD(2)
218000030411                                   SQLERRD(3)
218100030411                                   SQLERRD(4)
218200030411                                   SQLERRD(5)
218300030411                                   SQLERRD(6)
218400030411                                   SQLSTATE
218500030411                                   WS-SQLERR-DATA
218600030411                                   WS-SQL-STATS
218700030411                                   WS-SQLERR-REPLY.
218800030411           CANCEL "SQLLOG".
218900030411
219000030411           PERFORM END-JOB-RTN THRU EJR-EXIT.
219100030411
219200030411           STOP RUN.
219300140310
219400140310      *RFS132751 - Begins *
219500140310      * DSP-ERROR and FORCE-MSGW Routines
219600140310           COPY CPYSQLRTN.
219700140310      *RFS132751 - Ends *
