000100181220       IDENTIFICATION DIVISION.
000200181220       PROGRAM-ID.    SEGGDVRST.
000300181220       AUTHOR.        DAISY LY.
000400181220       INSTALLATION.  UNISEN INC.
000500210105       DATE-WRITTEN.  JANURARY 2004.
000600210807       DATE-COMPILED.
000700181220      *******************************************************************
000800210408      * RFS#       * 17973                                              *
000900181220      * PURPOSE    * The program is to process Guaranteed Death Reset
001000210614      *            * (similar to the SEGRESET)
001100181220      *******************************************************************
001200181220      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
001300181220      *******************************************************************
001400181220      * Daisy Ly   *  2004/01/26  * RFS 17973 -create the program
001500181220      *            *  2004/04/14  * -if not trade day use next price
001600181220      * Esin A.    *  2007/03/09  * RFS 40576 - Recompile only.
001700181220      * Raymond Mui*  2007/11/23  * RFS 45845 - Recompile only.
001800181220      * Ade Adeyemi*  2008/01/22  * RFS42749 Exclude DISTR-FLAG =  S
001900181220      * Bojana J.  *  2008/05/06  * RFS 51776 - Recompile.
002000181220      * Sanjeev P  *  2008/12/11  * RFS49898 - New DMD Maturity Option
002100181220      * Gary Xia   *  2009/06/02  * RFS 57388 - 1. Select records by reset
002200181220      *            *              * type instead of reset category.
002300181220      *            *              * 2. Log auto resets.
002400181220      * Gary Xia   *  2009/07/23  * RFS 57388 - Legacy defects.
002500181220      *            *              * 1. NDV not populated correctly.
002600181220      *            *              * 2. Last reset date not populated.
002700181220      * Waldi R.   *  2010/01/05  * RFS 75247 - Do not populate Last
002800181220      *            *              * Reset Date.
002900181220      * Naga       *  2010/01/05  * RFS91599 - Recompile for 80605
003000181220      *            *              * Replaced Implicit Join by Inner
003100181220      *            *              * join
003200181220      * NAGA       * 2011/03/07   * RFS 80605 - RESETS OF GWB AND
003300181220      *            *              * GBB VALUES.
003400181220      * NAGA       * 2011/04/12   * RFS 63488 - GLWB AND GDV RESETS.
003500181220      * Venkatesh C* 2011/05/26   * RFS 96705 - FIX for AWD carried over
003600181220      * Nasra F    * 2011/07/29   * RFS 98889 - GDV amount is incorrect
003700181220      * Emmanuel Y * 2011/09/08   * RFS 98304 - Incorrect previous GDV
003800181220      *            *              * when backdating resets
003900181220      * Thilaga K  * 2012/07/23   * RFS106211 - Development for Handling
004000181220      *            *              *  Age 80 resets
004100181220      * Venkatesh C* 2012/10/19   * RFS117298 - Recompile for MFAACCONP
004200181220      * Abhisek M. * 2013/04/01   * RFS120002 - Recompile for MFATRACXP
004300181220      * Premil K   * 2013/07/12   * RFS110904 - Preform GDV reset and
004400181220      *                           * Reverse reset.
004500181220      * Andy Chan  * 2013/08/29   * RFS127401 - Get SETPOL Inv Structure
004600181220      * Ashmitha K * 2013/10/13   * RFS126677 - Reset will occur on an
004700181220      *            *              * open contract even though the
004800181220      *            *              * account is closed
004900181220      * Thilaga    * 2014/05/15   * RFS133150 - Recompile
005000181220      * Vinsfy J   * 2014/06/13 * RFS136634 - Recompile for MFAACCATP
005100181220      * Tamilselvi * 2014/05/23   * RFS134848 - Include the Product Re-
005200181220      *            *              * set commarea in Linkage section.
005300181220      * Abhisek M  * 2014/06/18   * RFS138028 - Recompile for MFAACCONP
005400181220      * Abhisek M  * 2014/06/20   * RFS139654 - When GDV tracking rule
005500181220      *            *              * is set to 'B' do not apply GDV %
005600181220      *            *              * while calculating new GDV
005700181220      * Thilaga K  * 2015/05/12 * RFS145136 - Recompile for MFAACCNNP
005800181220      * Joel Dsouza* 2018/12/20 *RFS1005904-Skip price check for inactive fund
005900200206      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
006000200706      * Ashwini B  * 2020/06/25   * RFS184676 - Recompile for MFAGDTHVP*
006100200706      * CHAYA SP   * 2020/07/06   * RFS185172 - Recompile for MFAACCONP*
006200200724      * VIGNESH    * 2020/07/15   * RFS185171 -Recompile for MFAEXTRNP
006300200720      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFAGDTHVP
006400200720      *                           * and MFATRCODP
006500200721      * Ashwini B   * 2020/07/21 * RFS185176 - Recompile for MFAACCCRP
006600201221      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
006700210217      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
006800210217      * Kavin      * 2021/01/05   * RFS180708 - passing Trans sub type
006900210407      *                           * key value to MFAEXTRNP table
007000210707      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
007001211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
007002211007      *            *              * Array from 100 to 1000
007003211007      *            *              * Tagged as 111744     
007004211007      * Kavin K    * 2021/08/09   * RFS187471 - Recompile for MFAGDTHVP
007200181220      *******************************************************************
007300181220       ENVIRONMENT DIVISION.
007400200327       CONFIGURATION SECTION.
007500181220       SOURCE-COMPUTER. IBM-AS400.
007600181220       OBJECT-COMPUTER. IBM-AS400.
007700181220       SPECIAL-NAMES.
007800181220           DATA-AREA  IS WS-DATA-AREA-1.
007900181220      /
008000200327       INPUT-OUTPUT SECTION.
008100181220       FILE-CONTROL.
008200181220
008300181220           SELECT  ACCOUNT-CONTRACT-INVESTMENT
008400181220                   ASSIGN TO DATABASE-MFAACCCIP
008500181220                   ORGANIZATION IS INDEXED
008600181220                   ACCESS IS DYNAMIC
008700181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
008800181220
008900181220           SELECT  ACCOUNT-CONTRACT-RESET
009000181220                   ASSIGN TO DATABASE-MFAACCCRP
009100181220                   ORGANIZATION IS INDEXED
009200181220                   ACCESS IS DYNAMIC
009300181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009400181220
009500181220           SELECT  ACCOUNT-CONTRACT-INV-RESET
009600181220                   ASSIGN TO DATABASE-MFAACCCIRP
009700181220                   ORGANIZATION IS INDEXED
009800181220                   ACCESS IS DYNAMIC
009900181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010000181220
010100181220           SELECT  TRANS-CON-DTL
010200181220                   ASSIGN TO DATABASE-MFATRCODP
010300181220                   ORGANIZATION IS INDEXED
010400181220                   ACCESS IS DYNAMIC
010500181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010600181220
010700181220           SELECT  TRANS-GBV-TRANSFER
010800181220                   ASSIGN TO DATABASE-MFATRACXP
010900181220                   ORGANIZATION IS INDEXED
011000181220                   ACCESS IS DYNAMIC
011100181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
011200181220
011300181220           SELECT  EXCLUDE-TRANS
011400181220                   ASSIGN TO DATABASE-MFAEXTRNP
011500181220                   ORGANIZATION IS INDEXED
011600181220                   ACCESS IS DYNAMIC
011700181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
011800181220                   FILE STATUS IS WS-FILE-STATUS.
011900181220
012000181220           SELECT  TRANS-EXCHANGE-RATE
012100181220                   ASSIGN TO DATABASE-MFATREXRP
012200181220                   ORGANIZATION IS INDEXED
012300181220                   ACCESS IS DYNAMIC
012400181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012500181220
012600181220           SELECT  ACCOUNT
012700181220                   ASSIGN TO DATABASE-MFAACCNTP
012800181220                   ORGANIZATION IS INDEXED
012900181220                   ACCESS IS DYNAMIC
013000181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013100181220
013200181220           SELECT  ACCOUNT-NOMINEE
013300181220                   ASSIGN TO DATABASE-MFAACCNMP
013400181220                   ORGANIZATION IS INDEXED
013500181220                   ACCESS IS DYNAMIC
013600181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013700181220
013800181220           SELECT  ACCOUNT-ATTRIBUTES
013900181220                   ASSIGN TO DATABASE-MFAACCATP
014000181220                   ORGANIZATION IS INDEXED
014100181220                   ACCESS IS DYNAMIC
014200181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
014300181220
014400181220           SELECT  INVESTMENT
014500181220                   ASSIGN TO DATABASE-MFAINVP
014600181220                   ORGANIZATION IS INDEXED
014700181220                   ACCESS IS DYNAMIC
014800181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
014900181220
015000181220           SELECT  INVESTMENT-SEG
015100181220                   ASSIGN TO DATABASE-MFAINVSGP
015200181220                   ORGANIZATION IS INDEXED
015300181220                   ACCESS IS DYNAMIC
015400181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015500181220
015600181220           SELECT  EXCHANGE-RATE-M
015700181220                   ASSIGN TO DATABASE-MFAEXRHMP
015800181220                   ORGANIZATION IS INDEXED
015900181220                   ACCESS IS DYNAMIC
016000181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016100181220
016200181220           SELECT  CONTRACT-ERROR-LOG
016300181220                   ASSIGN TO DATABASE-MFACTERRP
016400181220                   ORGANIZATION IS INDEXED
016500181220                   ACCESS IS DYNAMIC
016600181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
016700181220                   WITH DUPLICATES.
016800181220
016900181220           SELECT  CONTRACT-CHANGE-LOG
017000181220                   ASSIGN TO DATABASE-MFACTCLP
017100181220                   ORGANIZATION IS INDEXED
017200181220                   ACCESS IS DYNAMIC
017300181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
017400181220                   WITH DUPLICATES.
017500181220      *RFS80605.11 - START
017600181220           SELECT  INVESTOR-CHANGE-LOG
017700181220                   ASSIGN TO DATABASE-MFAIVRCLP
017800181220                   ORGANIZATION IS INDEXED
017900181220                   ACCESS IS DYNAMIC
018000181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
018100181220                   WITH DUPLICATES.
018200181220      *RFS80605.11 - END
018300181220
018400181220      *RFS110904 - START
018500181220           SELECT  INVESTMENT-STRUCTURE-XREF
018600181220                   ASSIGN TO DATABASE-MFAINVSXP
018700181220                   ORGANIZATION IS INDEXED
018800181220                   ACCESS IS DYNAMIC
018900181220                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019000181220      *RFS110904 - END
019100181220
019200210105      *RFS180708 - Start
019300210105           SELECT  TRANS-MISC-DETAILS
019400210105                   ASSIGN TO DATABASE-MFATRNMSCP
019500210105                   ORGANIZATION IS INDEXED
019600210105                   ACCESS IS DYNAMIC
019700210105                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019800210329
019900210329           SELECT  TRANS-REDEM-DETAILS
020000210329                   ASSIGN TO DATABASE-MFATRNREP
020100210329                   ORGANIZATION IS INDEXED
020200210329                   ACCESS IS DYNAMIC
020300210329                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020400210105      *RFS180708 - End
020500210105
020600181220       DATA DIVISION.
020700181220       FILE SECTION.
020800181220       FD  ACCOUNT-CONTRACT-INVESTMENT
020900181220           LABEL RECORDS ARE STANDARD.
021000181220       01  ACC-CON-INV-REC.       COPY DD-ALL-FORMATS OF MFAACCCIP.
021100181220
021200181220       FD  ACCOUNT-CONTRACT-RESET
021300181220           LABEL RECORDS ARE STANDARD.
021400181220       01  ACC-CON-RESET-REC.     COPY DD-ALL-FORMATS OF MFAACCCRP.
021500181220
021600181220       FD  ACCOUNT-CONTRACT-INV-RESET
021700181220           LABEL RECORDS ARE STANDARD.
021800181220       01  ACC-CON-INV-RESET-REC. COPY DD-ALL-FORMATS OF MFAACCCIRP.
021900181220
022000181220       FD  TRANS-CON-DTL
022100181220           LABEL RECORDS ARE STANDARD.
022200181220       01  TRANS-CON-DTL-REC.        COPY DD-ALL-FORMATS OF MFATRCODP.
022300181220
022400181220       FD  TRANS-GBV-TRANSFER
022500181220           LABEL RECORDS ARE STANDARD.
022600181220       01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
022700181220
022800181220       FD  EXCLUDE-TRANS
022900181220           LABEL RECORDS ARE STANDARD.
023000181220       01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
023100181220
023200181220       FD  TRANS-EXCHANGE-RATE
023300181220           LABEL RECORDS ARE STANDARD.
023400181220       01  TRANS-EXCHANGE-RATE-REC. COPY DD-ALL-FORMATS OF MFATREXRP.
023500181220
023600181220       FD  ACCOUNT
023700181220           LABEL RECORDS ARE STANDARD.
023800181220       01  ACCOUNT-REC.           COPY DD-ALL-FORMATS OF MFAACCNTP.
023900181220
024000181220       FD  ACCOUNT-NOMINEE
024100181220           LABEL RECORDS ARE STANDARD.
024200181220       01  ACCOUNT-NOMINEE-REC.       COPY DD-ALL-FORMATS OF MFAACCNMP.
024300181220
024400181220       FD  ACCOUNT-ATTRIBUTES
024500181220           LABEL RECORDS ARE STANDARD.
024600181220       01  ACCOUNT-ATTRIBUTES-REC.    COPY DD-ALL-FORMATS OF MFAACCATP.
024700181220
024800181220       FD  INVESTMENT
024900181220           LABEL RECORDS ARE STANDARD.
025000181220       01  INVESTMENT-REC.        COPY DD-ALL-FORMATS OF MFAINVP.
025100181220
025200181220       FD  INVESTMENT-SEG
025300181220           LABEL RECORDS ARE STANDARD.
025400181220       01  INVESTMENT-SEG-REC.        COPY DD-ALL-FORMATS OF MFAINVSGP.
025500181220
025600181220       FD  EXCHANGE-RATE-M
025700181220           LABEL RECORDS ARE STANDARD.
025800181220       01  EXCHANGE-RATE-M-REC.   COPY DD-ALL-FORMATS OF MFAEXRHMP.
025900181220
026000181220       FD  CONTRACT-ERROR-LOG
026100181220           LABEL RECORDS ARE STANDARD.
026200181220       01  CONT-ERR-LOG-REC.      COPY DD-ALL-FORMATS OF MFACTERRP.
026300181220
026400181220       FD  CONTRACT-CHANGE-LOG
026500181220           LABEL RECORDS ARE STANDARD.
026600181220       01  CONTRACT-CHANGE-LOG-REC. COPY DD-ALL-FORMATS OF MFACTCLP.
026700181220
026800181220      *RFS80605.11 - START
026900181220       FD INVESTOR-CHANGE-LOG
027000181220           LABEL RECORDS ARE STANDARD.
027100181220       01 INVESTOR-CHANGE-LOG-REC. COPY DD-ALL-FORMATS OF MFAIVRCLP.
027200181220      *RFS80605.11 - END
027300181220
027400181220      *RFS110904 - START
027500181220       FD  INVESTMENT-STRUCTURE-XREF
027600181220           LABEL RECORDS ARE STANDARD.
027700181220       01  INV-STRU-XREF-REC. COPY DD-ALL-FORMATS OF MFAINVSXP.
027800181220      *RFS110904 - END
027900181220
028000210105      *RFS180708 - Start
028100210329       FD  TRANS-MISC-DETAILS
028200210105           LABEL RECORDS ARE STANDARD.
028300210105       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
028400210329
028500210329       FD  TRANS-REDEM-DETAILS
028600210329           LABEL RECORDS ARE STANDARD.
028700210329       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
028800210105      *RFS180708 - End
028900210105
029000181220       WORKING-STORAGE SECTION.
029100181220      *******************************************************************
029200181220      **  SQL variables
029300181220      **
029400181220       01  WS-SQLLOG-VARIABLES.
029500181220           05 WS-ROUTINE-NAME               PIC  X(25).
029600181220           05 WS-SQLERR-STATEMENT           PIC X(25)   VALUE " ".
029700181220           05 WS-SQLERR-DATA                PIC X(1780) VALUE " ".
029800181220           05 WS-SQL-STATS                  PIC X(1966) VALUE " ".
029900181220           05 WS-SQLERR-REPLY               PIC X(01)  VALUE " ".
030000181220
030100181220           EXEC SQL
030200181220                INCLUDE SQLCA
030300181220           END-EXEC.
030400181220
030500181220       01  WS-FILE-STATUS               PIC X(2).                       RFS8712
030600181220
030700181220      * RFS80605 - START
030800181220         COPY CPYSQLFLD
030900181220              REPLACING == "CURRENT_PROGRAM" == BY == "SEGGDVRST" ==.
031000181220      * RFS80605 - END
031100181220
031200181220       01  CURR-CONTROLS.
031300181220           03 CURR-LEVEL1               PIC X(1).
031400181220
031500181220       01  PREV-CONTROLS.
031600181220           03 PREV-LEVEL1               PIC X(1).
031700181220
031800181220       01  PROG-NAME                    PIC X(10) VALUE "SEGGDVRST".
031900181220       01  PROG-ID-CODE                 PIC X(10) VALUE "SEGRESET".
032000181220       01  OPEN-FILES-ONCE              PIC X(1)  VALUE "Y".
032100181220       01  UNITRAX-BASE-CURRENCY        PIC X(3)  VALUE " ".
032200181220       01  PROG-EXCHANGE-RATE-TYPE      PIC X     VALUE " ".
032300181220       01  WS-ARRAY-100                 PIC 9(3)  VALUE 100.
032301211007111744 01  WS-ARRAY-1000                PIC 9(4)  VALUE 1000.
032400181220
032500181220       01  WS-MFAPRCDTP.
032600181220           05  WS-AS-AT-DATE            PIC 9(08).
032700181220           05  WS-FILLER                PIC X(45).
032800181220           05  WS-LAST-PROCESS-DATE     PIC 9(08).
032900181220           05  WS-FILLER                PIC X(108).
033000181220
033100181220       01  WS-MISC-FIELDS.
033200181220           05 WS-REJECTION-CODE         PIC X(3).
033300181220
033400181220           05 WS-NEW-GUAR-BASE-VALUE   PIC S9(11)V99 COMP-3 VALUE 0.
033500181220           05 WS-NEW-GUAR-BASE-VAL-CUR PIC S9(11)V99 COMP-3 VALUE 0.
033600181220           05 WS-OLD-GUAR-BASE-VALUE   PIC S9(11)V99 COMP-3.
033700181220           05 WS-OLD-GUAR-BASE-VALUE-CUR PIC S9(11)V99 COMP-3.
033800181220           05 WS-NEW-GBV-TOTAL         PIC S9(11)V99 COMP-3 VALUE 0.
033900181220           05 WS-OLD-GBV-TOTAL         PIC S9(11)V99 COMP-3 VALUE 0.
034000181220           05 WS-OLD-NET-DEP-VALUE     PIC S9(11)V99 COMP-3.
034100181220           05 WS-OLD-NET-DEP-VALUE-CUR PIC S9(11)V99 COMP-3.
034200181220           05 WS-NEW-GBV-TOTAL         PIC S9(11)V99 COMP-3 VALUE 0.
034300181220           05 WS-CONT-GBV-TOTAL        PIC S9(11)V9(2) COMP-3.
034400181220           05 WS-INV-GBV-PERCENT-TOTAL PIC S9(2)V9(3) COMP-3.
034500181220           05 WS-INV-GBV-PERCENT       PIC S9(2)V9(3) COMP-3.
034600181220           05 WS-NEW-CONTRACT-GBV      PIC S9(11)V9(2) COMP-3.
034700181220           05 WS-GBV-CHANGE            PIC S9(11)V9(2) COMP-3.
034800181220           05 WS-INV-GBV-AFT           PIC S9(11)V9(2) COMP-3.
034900181220           05 WS-INV-GBV-AFT-CUR       PIC S9(11)V9(2) COMP-3.
035000181220
035100181220           05 WS-NEW-GUAR-DEATH-VALUE   PIC S9(11)V99 COMP-3 VALUE 0.
035200181220           05 WS-NEW-GUAR-DEATH-VAL-CUR PIC S9(11)V99 COMP-3 VALUE 0.
035300181220           05 WS-OLD-GUAR-DEATH-VALUE   PIC S9(11)V99 COMP-3.
035400181220           05 WS-OLD-GUAR-DEATH-VALUE-CUR PIC S9(11)V99 COMP-3.
035500181220           05 WS-NEW-GDV-TOTAL          PIC S9(11)V99 COMP-3 VALUE 0.
035600181220           05 WS-OLD-GDV-TOTAL          PIC S9(11)V99 COMP-3 VALUE 0.
035700181220           05 WS-CONT-MV-BEF-TOTAL      PIC S9(11)V9(4) COMP-3.
035800181220           05 WS-CONT-MV-AFT-TOTAL      PIC S9(11)V9(2) COMP-3.
035900181220
036000181220           05 WS-ACC-CON-INV-UNIT-BAL   PIC S9(10)V999 COMP-3 VALUE 0.
036100181220           05 WS-INV-GDV-AFT            PIC S9(11)V9(2) COMP-3.
036200181220           05 WS-INV-GDV-AFT-CUR        PIC S9(11)V9(2) COMP-3.
036300181220
036400181220           05 WS-ARRAY-MAX-REC          PIC S9(03) COMP-3.
036500181220
036600181220           05 WS-CURR-UNIT-BAL          PIC S9(10)V999 COMP-3 VALUE 0.
036700181220           05 WS-CONT-GDV-TOTAL         PIC S9(11)V9(2) COMP-3.
036800181220           05 WS-DUMMY-PERCENT          PIC S9(2)V9(3) COMP-3.
036900181220           05 WS-INV-GDV-PERCENT        PIC S9(2)V9(3) COMP-3.
037000181220           05 WS-INV-GDV-PERCENT-TOTAL  PIC S9(2)V9(3) COMP-3.
037100181220           05 WS-NEW-CONTRACT-GDV       PIC S9(11)V9(2) COMP-3.
037200181220           05 WS-GDV-CHANGE             PIC S9(11)V9(2) COMP-3.
037300181220
037400181220           05 WS-DEATH-PERCENTAGE       PIC S9(3)V9(2).
037500181220           05 WS-PRC-INVEST             PIC X(5).
037600181220           05 WS-PRC-ACTUAL-DATE        PIC S9(8).
037700181220           05 WS-PRC-TRADE-DATE         PIC S9(8)       COMP-3.
037800181220           05 WS-PRC-UNIT-PRICE         PIC S9(05)V9(4) COMP-3.
037900181220           05 WS-PRC-DST-FLAG           PIC X.
038000181220           05 WS-INV-UNITS              PIC S9(10)V999  COMP-3.
038100181220           05 WS-DEATH-SCHED            PIC X(5).
038200181220           05 WS-ANNUITANT-SEQ          PIC S9(3)       COMP-3.
038300181220           05 WS-ANNUITANT-DOB          PIC S9(9)       COMP-3.
038400181220           05 WS-ANNUITANT-AGE          PIC S9(2)       COMP-4.
038500181220           05 WS-AGE-THRESHOLD          PIC S9(2)       COMP-4.
038600181220110904     05 lc_GuarBenefitEligible    PIC X(1).
038700181220127401     05 li_count                  PIC S9(10).
038800181220100590     05 lc_InvStatus              PIC X(1).
038900181220
039000181220       01  WS-LOG-INFO.
039100181220           05 WS-RESET-NUMBER-C         PIC X(5).
039200181220           05 WS-INSPECT-CNT            PIC 9(1).
039300181220           05 WS-SYSDATE.
039400181220              10 WS-SYSDATE-CC          PIC 99.
039500181220              10 WS-SYSDATE-YMD.
039600181220                 15 WS-SYSDATE-YY       PIC 99.
039700181220                 15 WS-SYSDATE-MM       PIC 99.
039800181220                 15 WS-SYSDATE-DD       PIC 99.
039900181220           05 WS-SYSDATE-N REDEFINES WS-SYSDATE
040000181220                                        PIC 9(8).
040100181220           05 WS-SYSTIME-LONG.
040200181220              10 WS-SYSTIME.
040300181220                 15 WS-SYSTIME-HH       PIC 99.
040400181220                 15 WS-SYSTIME-MI       PIC 99.
040500181220                 15 WS-SYSTIME-SS       PIC 99.
040600181220              10 WS-SYSTIME-N REDEFINES WS-SYSTIME
040700181220                                        PIC 9(6).
040800181220              10 WS-SYSTIME-2 REDEFINES WS-SYSTIME
040900181220                                        PIC 9(4).
041000181220              10 WS-SYSTIME-HS          PIC 99.
041100181220
041200181220            05 WS-SYSTIME-LONG-N REDEFINES WS-SYSTIME-LONG
041300181220                                        PIC 9(8).
041400181220
041500181220            05 WS-MISC-INFO-AREA        PIC X(40).
041600181220
041700181220            05 WS-MISC-INFO-1 REDEFINES WS-MISC-INFO-AREA.
041800181220              10 WS-MISC-INFO-1-NAME    PIC X(12).
041900181220              10 WS-MISC-INFO-1-DATE    PIC Z9(8).
042000181220              10 FILLER                 PIC X(2).
042100181220              10 WS-MISC-INFO-1-NOTE    PIC X(15).
042200181220
042300181220       01  WS-EXCLUDE-VARIABLES.
042400181220           05 WS-EX-ACCOUNT-NO              PIC 9(9).
042500181220           05 WS-EX-ACCOUNT-TYPE            PIC X(5).
042600181220           05 WS-EX-NOM-ACCOUNT-TYPE        PIC X(5).
042700181220           05 WS-EX-TRANS-TYPE              PIC X(3).
042800181220           05 WS-EX-TRANS-ORIGIN            PIC X(3).
042900181220           05 WS-EX-REVERSAL-CODE           PIC X(4).
043000181220           05 WS-EXCLUDE-TRANS              PIC X(1).
043100181220
043200181220       01  TRANSACTION-CATEGORIES.
043300181220           05 TRANS-TYPE-CATEGORY         PIC X(3).
043400181220             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI".
043500181220             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
043600181220             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO".
043700181220             88 VALID-TRANSACTION        VALUES "BUY" "SEL" "SWI"
043800181220                                                "SWO" "TRI" "TRO".
043900181220             88 SWITCH-IN                VALUE "SWI".
044000181220             88 BUY-TRANSACTION          VALUE "BUY".
044100181220
044200181220       01 CURRENT-RECORD-VARS.
044300181220          05 CURR-ACCOUNT-NO             PIC S9(9)       COMP-3.
044400181220          05 CURR-CONTRACT-NO            PIC S9(9)       COMP-3.
044500181220          05 CURR-CONTRACT-DATE          PIC S9(8)       COMP-3.
044600181220          05 CURR-INVESTMENT-CODE        PIC X(5).
044700181220          05 CURR-EFFECT-DATE            PIC S9(8).
044800181220          05 CURR-INV-CURRENCY           PIC X(3).
044900181220          05 CURR-INV-PRICE-DATE         PIC S9(8).
045000181220          05 CURR-INV-PRICE              PIC S9(05)V9(4) COMP-3.
045100181220          05 CURR-INV-EXCH-RATE          PIC S9(2)V9(7) COMP-3.
045200181220          05 WS-EFFECT-TRADE-DATE        PIC S9(8).
045300181220          05 WS-EXCH-PLACEMENT-DATE      PIC S9(10) COMP-3.
045400181220          05 WS-EXCH-TRANS-NO            PIC S9(10) COMP-3.
045500181220          05 WS-EXCH-CURRENCY            PIC X(3).
045600181220          05 WS-EXCH-TRADE-DATE          PIC 9(8).
045700181220          05 WS-EXCH-RATE                PIC S9(2)V9(7) COMP-3.
045800181220          05 WS-TRN-INV-CURRENCY         PIC X(03).
045900181220          05 WS-INVESTMENT-CODE          PIC X(05).
046000181220          05 WS-INVEST-CURRENCY          PIC X(03).
046100181220          05 WS-TRANS-TRADE-AMT-GDV      PIC S9(11)V9(2) COMP-3.
046200181220          05 WS-TRANS-TRADE-AMT          PIC S9(11)V9(2) COMP-3.
046300181220          05 WS-TRANS-TRADE-AMT-BASE     PIC S9(11)V9(2) COMP-3.
046400181220          05 WS-INV-GDV-CUR              PIC S9(11)V9(2) COMP-3.
046500181220          05 WS-INV-GDV                  PIC S9(11)V9(2) COMP-3.
046600181220          05 WS-INV-GBV-CUR              PIC S9(11)V9(2) COMP-3.
046700181220          05 WS-INV-GBV                  PIC S9(11)V9(2) COMP-3.
046800181220
046900181220       01 WS-VARS-4ROUNDING.
047000181220          05 WS-CONT-GDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
047100181220          05 WS-GDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
047200181220          05 WS-CONT-GBV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
047300181220          05 WS-GBV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
047400181220
047500181220      * RFS 110904 - START
047600181220       01 lc_InvStructureCode           PIC X(5).
047700181220      * RFS 110904 - END
047800181220
047900181220       01 WS-LEVEL-88.
048000181220          05 WS-LOAD-STRUCTURE             PIC X.
048100181220             88 FRONT-END                  VALUE "F".
048200181220          05 WS-INV-SEG-FIRST-PASS         PIC X.
048300181220             88 INV-SEG-FIRST-PASS         VALUE "Y".
048400181220          05 WS-GDV-DIFF-FLAG              PIC X(01).
048500181220             88 GDV-DIFFERENCE-FOUND       VALUE "Y".
048600181220          05 WS-GDV-UPDATE-FLAG            PIC X(01).
048700181220             88 GDV-NOT-UPDATED            VALUE "Y".
048800181220          05 WS-XFER-AMT-EXISTS-FLAG       PIC X(01).
048900181220             88 TRANSFER-AMT-EXISTS        VALUE "Y".
049000181220          05 WS-EXACT-TRADE-DATE           PIC X.
049100181220             88 EXACT-TRADE-DATE           VALUE "Y".
049200181220          05 WS-NDV-DIFF-FLAG              PIC X(01).
049300181220             88 NDV-DIFFERENCE-FOUND       VALUE "Y".
049400181220          05 WS-GBV-DIFF-FLAG              PIC X(01).
049500181220             88 GBV-DIFFERENCE-FOUND       VALUE "Y".
049600181220          05 WS-NDV-UPDATE-FLAG            PIC X(01).
049700181220             88 NDV-NOT-UPDATED            VALUE "Y".
049800181220          05 WS-GBV-UPDATE-FLAG            PIC X(01).
049900181220             88 GBV-NOT-UPDATED            VALUE "Y".
050000181220
050100181220       01 WS-SQL-VARIABLES.
050200181220          05 WS-SQL-PROCESS-DATE           PIC S9(9) COMP-3.
050300181220          05 WS-SQL-PROC-SEQ-NO            PIC S9(9) COMP-3.
050400181220          05 WS-SQL-PLACEMENT-DATE         PIC S9(9) COMP-3.
050500181220          05 WS-SQL-TRANS-NO               PIC S9(9) COMP-3.
050600181220          05 WS-SQL-INVEST                 PIC X(5).
050700181220          05 WS-SQL-TRADE-DATE             PIC S9(9) COMP-3.
050800181220          05 WS-SQL-GROSS-AMT              PIC S9(11)V9(2) COMP-3.
050900181220          05 WS-SQL-NET-AMT                PIC S9(11)V9(2) COMP-3.
051000181220          05 WS-SQL-UNIT-PRICE             PIC S9(05)V9(4) COMP-3.
051100181220          05 WS-SQL-REVERSAL-CODE          PIC X(4).
051200181220
051300181220
051400181220       01 WS-ACC-CON-INV-ARRAYX.
051401211007111744    05 WS-ACC-CON-INV-ARRAY OCCURS 1000 TIMES
051600181220                             ASCENDING KEY IS WS-ARRAY-INVESTMENT-CODE
051700181220                                          INDEXED BY CONTIDX.
051800181220             10 WS-ARRAY-INVESTMENT-CODE   PIC X(05).
051900181220             10 WS-ARRAY-CUR-UNITBAL       PIC S9(10)V9(3) COMP-3.
052000181220             10 WS-ARRAY-GDV               PIC S9(11)V9(2) COMP-3.
052100181220             10 WS-ARRAY-GDV-CUR           PIC S9(11)V9(2) COMP-3.
052200181220             10 WS-ARRAY-GBV               PIC S9(11)V9(2) COMP-3.
052300181220             10 WS-ARRAY-GBV-CUR           PIC S9(11)V9(2) COMP-3.
052400181220             10 WS-ARRAY-OPEN-UNITBAL      PIC S9(10)V9(3) COMP-3.
052500181220             10 WS-ARRAY-INV-MV-BEF        PIC S9(11)V9(4) COMP-3.
052600181220             10 WS-ARRAY-INV-MV-AFT        PIC S9(11)V9(2) COMP-3.
052700181220             10 WS-ARRAY-INV-CUR-CODE      PIC X(03).
052800181220             10 WS-ARRAY-EXCH-RATE         PIC S9(02)V9(7) COMP-3.
052900181220      * ---------------------------------------------------------------
053000181220      *RFS80605 - START
053100181220        01 WS-GDV-AWD-CARRIED-OVER         PIC S9(13)V9(2) COMP-3
053200181220                                                    VALUE ZEROS.
053300181220
053400181220        01 WS-ERR-CODE                     PIC X(2) VALUE SPACES.
053500181220           88 WS-ERR-OK                             VALUE SPACES.
053600181220           88 WS-ERR-10                             VALUE "10".
053700181220           88 WS-ERR-11                             VALUE "11".
053800181220           88 WS-ERR-12                             VALUE "12".
053900181220        01 lb_GDVAWDchangedFlag        PIC X(01) VALUE SPACES.
054000181220           88 lb_GDVAWDchanged_Yes     VALUE "Y".
054100181220           88 lb_GDVAWDchanged_No      VALUE "N".
054200181220      *RFS80605 - END
054300181220
054400181220      *rfs42749 begins
054500181220       01  lc_Constants.
054600181220           05  lc_distrS                    PIC X(01) Value "S".
054700181220      *rfs42749 ends
054800181220134848     05  lnc_N                       PIC X(01) Value "N".
054900181220134848     05  lnc_Y                       PIC X(01) Value "Y".
055000181220139654     05  lnc_Primary                 PIC X(01) Value "P".
055100181220139654     05  lnc_Active                  PIC X(01) Value "A".
055200181220139654     05  lnc_Spaces                  PIC X(01) Value " ".
055300181220139654     05  lnc_B                       PIC X(01) Value "B".
055400181220      * RFS63488 - START
055500181220        01 li_Account_no                 PIC S9(9)    VALUE ZEROES.
055600181220        01 li_Trade_Date                 PIC S9(8)    VALUE ZEROES.
055700181220        01 li_FMV_Amt                    PIC S9(09)V99
055800181220                                                      VALUE ZEROES.
055900181220        01 lc_Mode                       PIC X(1)     VALUE SPACES.
056000181220        01 li_Contract_no                PIC S9(9)    VALUE ZEROES.
056100181220        01 lc_Investment_code            PIC X(5)     VALUE SPACES.
056200181220        01 li_Unit_amount                PIC S9(09)V9999
056300181220                                                      VALUE ZEROES.
056400181220      * RFS63488 - END
056500181220      * RFS139654 - Start
056600181220        01  li_StartDate                  PIC S9(08).
056700181220        01  lc_AccountTypeCode            PIC X(05).
056800181220        01  li_AnnuitantDateOfBirth       PIC S9(08).
056900181220        01  li_dod                        PIC S9(09) COMP-3 VALUE 0.
057000181220        01  li_deathAge                   PIC S9(03)        VALUE 0.
057100181220        01  lc_GuarDthSchedCode           PIC X(05).
057200181220        01  li_SysDate                    PIC S9(08) COMP-3.
057300181220        01  li_AnnuitantAge               PIC S9(03).
057400181220        01  lc_GdvTrackRule               PIC X(01) VALUE SPACES.
057500181220
057600181220        COPY CPACCANUIT.
057700181220
057800181220      * RFS139654 - End
057900181220
058000181220      * ---------------------------------------------------------------
058100181220       LINKAGE SECTION.
058200181220        01 COMM-AREA                     PIC X(200).
058300181220        01 COMM-AREA-BUFFER REDEFINES COMM-AREA.
058400181220           03 COMM-REJECTION-CODE        PIC X(3).
058500181220           03 COMM-USER                  PIC X(10).
058600181220           03 COMM-CALLER-ID-CODE        PIC X(10).
058700181220           03 COMM-ACTION                PIC X(10).
058800181220           03 COMM-OPEN-FILES            PIC X(1).
058900181220      * 'Y' = open files, otherwise skip open files
059000181220           03 COMM-SPMODULE              PIC X(1).
059100181220           03 COMM-PROCESS-DATE          PIC S9(8).
059200181220           03 COMM-ACCOUNT-NO            PIC 9(9).
059300181220           03 COMM-CONTRACT-NO           PIC 9(9).
059400181220           03 COMM-RESET-NUMBER          PIC 9(5).
059500181220           03 COMM-RESET-REQ-FUND        PIC X(5).
059600181220      * The following data fields for ONE FUND only:
059700181220           03 COMM-CURR-UNIT-BAL         PIC S9(10)V9(3) COMP-3.
059800181220           03 COMM-OLD-GUAR-DEATH-VALUE   PIC S9(11)V9(2) COMP-3.
059900181220           03 COMM-NEW-GUAR-DEATH-VALUE   PIC S9(11)V9(2) COMP-3.
060000181220           03 COMM-OLD-GUAR-DEATH-VAL-CUR PIC S9(11)V9(2) COMP-3.
060100181220           03 COMM-NEW-GUAR-DEATH-VAL-CUR PIC S9(11)V9(2) COMP-3.
060200181220134848     03 FILLER                      PIC S9(11)V9(2) COMP-3.
060300181220134848     03 FILLER                      PIC S9(11)V9(2) COMP-3.
060400181220134848     03 FILLER                      PIC S9(11)V9(2) COMP-3.
060500181220134848     03 FILLER                      PIC S9(11)V9(2) COMP-3.
060600181220134848     03 COMM-NDRST-EDIT             PIC X(1).
060700181220134848     03 COMM-PRODUCT-RESET          PIC X(1).
060800181220      *RFS134848 - End
060900181220
061000181220       PROCEDURE DIVISION USING COMM-AREA.
061100181220       MAINLINE.
061200181220           PERFORM INITIAL-LOGIC       THRU INL-EXIT.
061300181220           IF CURR-CONTROLS IS EQUAL   TO HIGH-VALUES
061400181220              GO TO ML-1300.
061500181220
061600181220       ML-0010.
061700181220           PERFORM GET-CONTRACT-INFO   THRU GCI-EXIT.
061800181220           IF CURR-CONTROLS IS EQUAL   TO HIGH-VALUES
061900181220              GO TO ML-1300.
062000181220
062100181220       ML-0020.
062200181220           IF CURR-EFFECT-DATE  <= WS-LAST-PROCESS-DATE
062300181220              PERFORM GET-ACC-CON-INV-GDV THRU GACIG-EXIT
062400181220           END-IF.
062500181220
062600181220           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
062700181220              GO TO ML-1300.
062800181220       ML-0030.
062900181220           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
063000181220
063100181220       ML-1200.
063200181220           PERFORM UPDATE-CONTRACT-RESET THRU UCR-EXIT.
063300181220
063400181220       ML-1300.
063500181220           GOBACK.
063600181220
063700181220      /
063800181220       SQL-DECLARE-RTN.
063900181220           MOVE "SQL-DECLARE-RTN" TO WS-ROUTINE-NAME.
064000181220
064100181220           EXEC SQL
064200181220              WHENEVER SQLERROR GOTO SDR-EXIT
064300181220           END-EXEC.
064400181220
064500181220           MOVE "ACICUR" TO WS-SQLERR-STATEMENT.
064600181220***********************************************************************
064700181220******* CURSOR: ACICUR - select all the investments for a contract
064800181220*******                - use in LOAD-ACC-CON-INV-ARRAY RTN
064900181220***********************************************************************
065000181220******* ALIAS        FILENAME                     OPENNAME
065100181220***********************************************************************
065200181220******* ACCCIP       ACCOUNT-CONTRACT-INVESTMENT  MFAACCCIP
065300181220***********************************************************************
065400181220
065500181220           EXEC SQL
065600181220             DECLARE ACICUR CURSOR FOR
065700181220              SELECT INVESTMENT_CODE,
065800181220                     CURR_UNIT_BAL,
065900181220                     GUAR_DEATH_VALUE,
066000181220                     GUAR_DEATH_VALUE_CUR,
066100181220                     GUAR_BASE_VALUE,
066200181220                     GUAR_BASE_VALUE_CUR,
066300181220                     OPENING_UNIT_BALANCE,
066400181220                     0,0,
066500181220                     " ", 0
066600181220                FROM MFAACCCIP
066700181220               WHERE ACCOUNT_NO  = :CURR-ACCOUNT-NO
066800181220                 AND CONTRACT_NO = :CURR-CONTRACT-NO
066900181220              FOR READ ONLY
067000181220           END-EXEC.
067100181220
067200181220***********************************************************************
067300181220******* CURSOR: SEGEXTSQ  - select trans after the effective date
067400181220*******                   - use in RECALC-TRADES-IN-REVERSE RTN
067500181220***********************************************************************
067600181220******* ALIAS        FILENAME                         OPENNAME
067700181220***********************************************************************
067800181220******* TRDPSP       TRANS-DAILY-PROC-SEQ             MFATRDPSP
067900181220******* TRNP         TRANS                            MFATRNP
068000181220***********************************************************************
068100181220           MOVE "DECLARE SEGEXTSQ" TO WS-SQLERR-STATEMENT.
068200181220      *RFS91599 Replaced 'Implicit Join' by 'Inner Join'
068300181220           EXEC SQL
068400181220              DECLARE SEGEXTSQ CURSOR FOR
068500181220               SELECT TRDPSP.PROCESS_DATE,
068600181220                      TRDPSP.PROC_SEQ_NO,
068700181220                      TRDPSP.PLACEMENT_DATE,
068800181220                      TRDPSP.TRANS_NO,
068900181220                        TRNP.TRADE_DATE,
069000181220                        TRNP.TRANS_TYPE_CODE,
069100181220                        TRNP.TRANS_ORIGIN_CODE,
069200181220                        TRNP.INVESTMENT_CODE,
069300181220                        TRNP.GROSS_AMT,
069400181220                        TRNP.NET_AMT,
069500181220                        TRNP.UNIT_PRICE,
069600181220                        TRNP.REVERSAL_CODE
069700181220      * RFS91599 - Start
069800181220      *          FROM MFATRDPSP TRDPSP,
069900181220      *               MFATRNP   TRNP
070000181220                 FROM MFATRDPSP TRDPSP
070100181220                INNER JOIN MFATRNP   TRNP ON
070200181220                      TRDPSP.PLACEMENT_DATE = TRNP.PLACEMENT_DATE
070300181220                  AND TRDPSP.TRANS_NO       = TRNP.TRANS_NO
070400181220      *         WHERE TRDPSP.PLACEMENT_DATE = TRNP.PLACEMENT_DATE
070500181220      *           AND TRDPSP.TRANS_NO       = TRNP.TRANS_NO
070600181220      *           AND TRDPSP.PROCESS_DATE   > :CURR-EFFECT-DATE
070700181220                WHERE TRDPSP.PROCESS_DATE   > :CURR-EFFECT-DATE
070800181220      * RFS91599 - End
07090018122063488 *           AND TRDPSP.PROCESS_DATE  <= :COMM-PROCESS-DATE
07100018122063488 * R98889    AND   TRNP.TRADE_DATE    <= :CURR-EFFECT-DATE
07110018122098889             AND   TRNP.TRADE_DATE    >  :CURR-EFFECT-DATE
071200181220                  AND   TRNP.REVERSE       <> "Y"
071300181220                  AND   TRNP.ACCOUNT_NO     = :CURR-ACCOUNT-NO
071400181220                  AND   TRNP.TRANS_STATUS_CODE IN ("HST", "HSC")
071500181220                  AND   TRNP.TRANS_TYPE_CODE   IN ("BUY", "SWI", "TRI",
071600181220                                                   "SEL", "SWO", "TRO")
071700181220                ORDER BY TRDPSP.PROCESS_DATE DESC,
071800181220                         TRDPSP.PROC_SEQ_NO DESC
071900181220                FOR READ ONLY
072000181220           END-EXEC.
072100181220
072200181220***********************************************************************
072300181220******* CURSOR: TRNBCUR   - sum all the buy units
072400181220*******                   - use in GET-UNIT-BALANCE RTN
072500181220***********************************************************************
072600181220******* ALIAS        FILENAME                         OPENNAME
072700181220***********************************************************************
072800181220******* TRNP         TRANS                            MFATRNP
072900181220******* TRCODP       TRANS-CONTRACT-DETAILS           MFATRCODP
073000181220***********************************************************************
073100181220           MOVE "DECLARE TRNBCUR" TO WS-SQLERR-STATEMENT.
073200181220      *RFS91599 Replaced 'Implicit Join' by 'Inner Join'
073300181220           EXEC SQL
073400181220             DECLARE TRNBCUR CURSOR FOR
073500181220              SELECT COALESCE(SUM(TRCODP.ORIG_UNIT_BAL), 0)
073600181220      * RFS91599 - Start
073700181220      *         FROM MFATRNP    TRNP,
073800181220      *              MFATRCODP  TRCODP
073900181220                FROM MFATRNP    TRNP
074000181220               INNER JOIN MFATRCODP  TRCODP ON
074100181220                     TRCODP.PLACEMENT_DATE = TRNP.PLACEMENT_DATE
074200181220                 AND TRCODP.TRANS_NO       = TRNP.TRANS_NO
074300181220      * RFS91599 - End
074400181220               WHERE TRNP.ACCOUNT_NO = :CURR-ACCOUNT-NO
074500181220                 AND TRNP.INVESTMENT_CODE = :CURR-INVESTMENT-CODE
074600181220                 AND TRNP.PROCESS_DATE   >  :CURR-EFFECT-DATE
074700181220                 AND TRNP.PROCESS_DATE   <  :COMM-PROCESS-DATE
074800181220                 AND TRNP.TRANS_TYPE_CODE IN
074900181220                                          ("BUY", "SWI", "TRI")
075000181220                 AND TRNP.REVERSE       <> "Y"
075100181220                 AND TRNP.TRANS_STATUS_CODE IN ("HST", "HSC")
075200181220      * RFS91599 - Start
075300181220      *          AND TRCODP.PLACEMENT_DATE = TRNP.PLACEMENT_DATE
075400181220      *          AND TRCODP.TRANS_NO       = TRNP.TRANS_NO
075500181220      * RFS91599 - End
075600181220                 AND TRCODP.CONTRACT_NO    = :CURR-CONTRACT-NO
075700181220                 AND TRCODP.REVERSED      <> "Y"
075800181220              FOR READ ONLY
075900181220           END-EXEC.
076000181220
076100181220***********************************************************************
076200181220******* CURSOR: TRNSCUR   - sum all the sell units
076300181220*******                   - use in GET-UNIT-BALANCE RTN
076400181220***********************************************************************
076500181220******* ALIAS        FILENAME                         OPENNAME
076600181220***********************************************************************
076700181220******* TRNP         TRANS                            MFATRNP
076800181220******* TRCODP       TRANS-CONTRACT-DETAILS           MFATRCODP
076900181220***********************************************************************
077000181220      * RFS98889 Begins
077100181220      *    MOVE "DECLARE TRNSCUR" TO WS-SQLERR-STATEMENT.
077200181220      *    EXEC SQL
077300181220      *      DECLARE TRNSCUR CURSOR FOR
077400181220      *       SELECT COALESCE(SUM(TRCODP.ORIG_UNIT_BAL), 0)
077500181220      *         FROM MFATRNP    TRNP,
077600181220      *              MFATRCODP  TRCODP
077700181220      *        WHERE TRNP.ACCOUNT_NO = :CURR-ACCOUNT-NO
077800181220      *          AND TRNP.INVESTMENT_CODE = :CURR-INVESTMENT-CODE
077900181220      *          AND TRNP.PROCESS_DATE   >  :CURR-EFFECT-DATE
078000181220      *          AND TRNP.PROCESS_DATE   <  :COMM-PROCESS-DATE
078100181220      *          AND TRNP.TRANS_TYPE_CODE IN
078200181220      *                                   ("SEL", "SWO", "TRO")
078300181220      *          AND TRNP.REVERSE       <> "Y"
078400181220      *          AND TRNP.TRANS_STATUS_CODE IN ("HST", "HSC")
078500181220      *          AND TRCODP.PLACEMENT_DATE = TRNP.PLACEMENT_DATE
078600181220      *          AND TRCODP.TRANS_NO       = TRNP.TRANS_NO
078700181220      *          AND TRCODP.CONTRACT_NO    = :CURR-CONTRACT-NO
078800181220      *          AND TRCODP.REVERSED      <> "Y"
078900181220      *       FOR READ ONLY
079000181220      *    END-EXEC.
079100181220      * RFS98889 Ends
079200181220
079300181220***********************************************************************
079400181220******* CURSOR: INVPRCA   - get investment unit price
079500181220*******                   - use in GET-INVESTMENT-UNIT-PRICE RTN
079600181220***********************************************************************
079700181220******* ALIAS        FILENAME                         OPENNAME
079800181220***********************************************************************
079900181220******* INVUPP       INVESTMENT-UNIT-PRICE            MFAINVUPP
080000181220***********************************************************************
080100181220           MOVE "DECLARE INVPRCA" TO WS-SQLERR-STATEMENT.
080200181220           EXEC SQL
080300181220             DECLARE INVPRCA CURSOR FOR
080400181220             SELECT TRADE_DATE,
080500181220                    UNIT_PRICE,
080600181220                    DISTRIBUTION_FLAG
080700181220               FROM MFAINVUPP
080800181220              WHERE INVESTMENT_CODE  =  :WS-PRC-INVEST
080900181220                AND TRADE_DATE       >= :WS-PRC-TRADE-DATE
08100018122042749           AND DISTRIBUTION_FLAG <> :lc_distrS
081100181220              ORDER BY TRADE_DATE ASC,
081200181220                       DISTRIBUTION_FLAG DESC
081300181220              FOR READ ONLY
081400181220           END-EXEC.
081500181220***********************************************************************
081600181220******* CURSOR: INVPRCB   - get investment unit price for a trade date
081700181220*******                   - use in GET-INVESTMENT-UNIT-PRICE RTN
081800181220***********************************************************************
081900181220******* ALIAS        FILENAME                         OPENNAME
082000181220***********************************************************************
082100181220******* INVUPP       INVESTMENT-UNIT-PRICE            MFAINVUPP
082200181220***********************************************************************
082300181220           MOVE "DECLARE INVPRCB" TO WS-SQLERR-STATEMENT.
082400181220           EXEC SQL
082500181220             DECLARE INVPRCB CURSOR FOR
082600181220             SELECT TRADE_DATE,
082700181220                    UNIT_PRICE,
082800181220                    DISTRIBUTION_FLAG
082900181220               FROM MFAINVUPP
083000181220              WHERE INVESTMENT_CODE = :WS-PRC-INVEST
083100181220                AND TRADE_DATE      = :WS-PRC-TRADE-DATE
08320018122042749           AND DISTRIBUTION_FLAG <> :lc_distrS
083300181220              ORDER BY DISTRIBUTION_FLAG DESC
083400181220              FOR READ ONLY
083500181220           END-EXEC.
083600181220       SDR-EXIT.
083700181220           EXIT.
083800181220      /
083900181220       GET-CONTRACT-INFO.
084000181220
084100181220           MOVE COMM-ACCOUNT-NO
084200181220                             TO CURR-ACCOUNT-NO
084300181220                                ACCOUNT-NO OF ACCOUNT-CONTRACT-RESET.
084400181220           MOVE COMM-CONTRACT-NO
084500181220                             TO CURR-CONTRACT-NO
084600181220                                CONTRACT-NO OF ACCOUNT-CONTRACT-RESET.
084700181220           MOVE COMM-RESET-NUMBER
084800181220                             TO RESET-NUMBER OF ACCOUNT-CONTRACT-RESET.
084900181220
085000181220110904     INITIALIZE  lc_GuarBenefitEligible.
085100181220110904     EXEC SQL
085200181220110904       SELECT GUAR_BENEFIT_ELIGIBLE
085300181220110904         INTO :lc_GuarBenefitEligible
085400181220110904         FROM MFAACCONP
085500181220110904         WHERE ACCOUNT_NO  = :CURR-ACCOUNT-NO AND
085600181220110904               CONTRACT_NO = :CURR-CONTRACT-NO
085700181220110904     END-EXEC.
085800181220
085900181220
086000181220           READ ACCOUNT-CONTRACT-RESET
086100181220             INVALID KEY
086200181220                MOVE HIGH-VALUES TO CURR-CONTROLS
086300181220                GO TO GCI-EXIT
086400181220           END-READ.
086500181220
08660018122057388 *    IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET NOT = "A"
08670018122057388      IF RESET-TYPE     OF ACCOUNT-CONTRACT-RESET NOT = "GDV"
086800181220                MOVE HIGH-VALUES TO CURR-CONTROLS
086900181220                GO TO GCI-EXIT
087000181220           END-IF.
087100181220
087200181220           MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET
087300181220                TO CURR-EFFECT-DATE.
087400181220
087500181220           MOVE COMM-ACCOUNT-NO TO ACCOUNT-NO OF ACCOUNT.
087600181220           READ ACCOUNT
087700181220             INVALID KEY
087800181220                MOVE HIGH-VALUES TO CURR-CONTROLS
087900181220                GO TO GCI-EXIT
088000181220           END-READ.
088100181220
088200181220126677     IF ACCOUNT-STATUS OF ACCOUNT = "C"
088300181220126677       MOVE HIGH-VALUES TO CURR-CONTROLS
088400181220126677       GO TO GCI-EXIT
088500181220126677     END-IF.
088600181220           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT TO WS-EX-ACCOUNT-TYPE.
088700181220           MOVE ACCOUNT-NO        OF ACCOUNT TO WS-EX-ACCOUNT-NO.
088800181220
088900181220           INITIALIZE MFAACCNMP OF ACCOUNT-NOMINEE-REC.
089000181220           MOVE ACCOUNT-NO OF ACCOUNT
089100181220                TO ACCOUNT-NO OF ACCOUNT-NOMINEE
089200181220           READ ACCOUNT-NOMINEE
089300181220             INVALID KEY
089400181220                MOVE " " TO WS-EX-NOM-ACCOUNT-TYPE
089500181220             NOT INVALID KEY
089600181220                MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE
089700181220                     TO WS-EX-NOM-ACCOUNT-TYPE
089800181220           END-READ.
089900181220
090000181220           INITIALIZE MFAACCCIRP  OF ACCOUNT-CONTRACT-INV-RESET.
090100181220
090200181220           MOVE COMM-ACCOUNT-NO
090300181220                TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET.
090400181220           MOVE COMM-CONTRACT-NO
090500181220                TO CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET.
090600181220           MOVE COMM-RESET-NUMBER
090700181220                TO RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET.
090800181220
090900181220           START ACCOUNT-CONTRACT-INV-RESET
091000181220             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
091100181220             INVALID KEY
091200181220               MOVE HIGH-VALUES  TO CURR-CONTROLS
091300181220           END-START.
091400181220       GCI-EXIT.
091500181220           EXIT.
091600181220      /
091700181220       DETAIL-PROCESSING.
091800181220           MOVE "DETAIL-PROCESSING"       TO WS-ROUTINE-NAME.
091900181220           MOVE "Y" TO WS-INV-SEG-FIRST-PASS.
092000181220
092100181220       DPR-0010.
092200181220           READ ACCOUNT-CONTRACT-INV-RESET NEXT RECORD
092300181220              AT END
092400181220                GO TO DPR-EXIT
092500181220           END-READ.
092600181220
092700181220           IF ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
092800181220                            COMM-ACCOUNT-NO
092900181220           OR CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
093000181220                             COMM-CONTRACT-NO
093100181220           OR RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET NOT =
093200181220                              COMM-RESET-NUMBER
093300181220             GO TO DPR-EXIT
093400181220           END-IF.
093500181220
093600181220      * Skip process if it has already been reset
093700181220           IF RESET-PROCESSED OF ACCOUNT-CONTRACT-INV-RESET = "Y"
093800181220             GO TO DPR-0010
093900181220           END-IF.
094000181220
094100181220           INITIALIZE CURRENT-RECORD-VARS.
094200181220           MOVE ACCOUNT-NO   OF ACCOUNT-CONTRACT-INV-RESET
094300181220                             TO ACCOUNT-NO
094400181220                             OF ACCOUNT-CONTRACT-INVESTMENT
094500181220                             CURR-ACCOUNT-NO.
094600181220           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-INV-RESET
094700181220                             TO CONTRACT-NO
094800181220                             OF ACCOUNT-CONTRACT-INVESTMENT
094900181220                             CURR-CONTRACT-NO.
095000181220           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
095100181220                             TO INVESTMENT-CODE
095200181220                             OF ACCOUNT-CONTRACT-INVESTMENT
095300181220                             CURR-INVESTMENT-CODE.
095400181220           MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET
095500181220                             TO CURR-EFFECT-DATE.
095600181220
095700181220           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK.
095800181220
095900181220           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
096000181220                TO WS-INVESTMENT-CODE.
096100181220           PERFORM GET-INVESTMENT-INFO   THRU GII-EXIT.
096200181220           MOVE WS-INVEST-CURRENCY TO CURR-INV-CURRENCY.
096300181220
096400181220           IF INV-SEG-FIRST-PASS
096500181220              CALL "SEGDTHPER" USING COMM-ACCOUNT-NO
096600181220                                     COMM-CONTRACT-NO
096700181220                                     CURR-INVESTMENT-CODE
096800181220                                     WS-DEATH-PERCENTAGE
096900181220           END-IF.
097000181220
097100181220           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
097200181220                TO WS-CURR-UNIT-BAL
097300181220                   WS-ACC-CON-INV-UNIT-BAL.
097400181220
097500181220      * Get the total number of units as of the Effective date
097600181220      * of the contract, if less than the last process-date
097700181220      * Also, calculate the GDV prior to this reset
097800181220           IF CURR-EFFECT-DATE <= WS-LAST-PROCESS-DATE
097900181220              PERFORM GET-UNIT-BALANCE THRU GUB-EXIT
098000181220              MOVE WS-ACC-CON-INV-UNIT-BAL TO WS-CURR-UNIT-BAL
098100181220           END-IF.
098200181220
098300181220           IF WS-CURR-UNIT-BAL = 0
098400181220              MOVE COMM-PROCESS-DATE TO CURR-INV-PRICE-DATE
098500181220              MOVE 0                 TO CURR-INV-PRICE
098600181220              MOVE 1.0               TO CURR-INV-EXCH-RATE
098700181220              GO TO DPR-0035
098800181220           END-IF.
098900181220
099000181220      ** for reset effect date that fall on the weekend, it will
099100181220      ** use the next price trade and apply to all the investments
099200181220APR14 *    MOVE "N" TO WS-EXACT-TRADE-DATE.
099300181220           MOVE CURR-EFFECT-DATE      TO WS-PRC-TRADE-DATE.
099400181220           MOVE CURR-INVESTMENT-CODE TO WS-PRC-INVEST.
099500181220      *RFS1005904 START
099600181221           MOVE 0 TO WS-PRC-UNIT-PRICE.
099700181220           IF lc_InvStatus = lnc_Active
099800181220      *    PERFORM GET-INVESTMENT-UNIT-PRICE THRU GIUP-EXIT.
099900181220              PERFORM GET-INVESTMENT-UNIT-PRICE THRU GIUP-EXIT
100000181220           END-IF.
100100181220      *RFS1005904 END
100200181220           IF COMM-REJECTION-CODE NOT = " " AND "00"
100300181220             GO TO DPR-0040
100400181220           END-IF.
100500181220
100600181220           MOVE WS-PRC-UNIT-PRICE     TO CURR-INV-PRICE.
100700181220APR14      MOVE WS-PRC-TRADE-DATE     TO CURR-INV-PRICE-DATE.
100800181220
100900181220           IF CURR-INV-CURRENCY         NOT = UNITRAX-BASE-CURRENCY
101000181220              MOVE CURR-INV-CURRENCY    TO WS-EXCH-CURRENCY
101100181220              MOVE CURR-INV-PRICE-DATE  TO WS-EXCH-TRADE-DATE
101200181220              PERFORM GET-EXCHANGE-RATE THRU GER-EXIT
101300181220              IF COMM-REJECTION-CODE NOT = " " AND "00"
101400181220                 GO TO DPR-0040
101500181220              END-IF
101600181220              MOVE WS-EXCH-RATE         TO CURR-INV-EXCH-RATE
101700181220           ELSE
101800181220             MOVE 1.0                   TO CURR-INV-EXCH-RATE
101900181220           END-IF.
102000181220
102100181220
102200181220       DPR-0035.
102300181220      * Get the last GDV of the trade of the account/contract/investment
102400181220      ** prior to this reset.
102500181220           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
102600181220             TO WS-OLD-GUAR-DEATH-VALUE.
102700181220           MOVE GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
102800181220             TO WS-OLD-GUAR-DEATH-VALUE-CUR.
102900181220
103000181220           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
103100181220             TO WS-OLD-GUAR-BASE-VALUE.
103200181220           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
103300181220             TO WS-OLD-GUAR-BASE-VALUE-CUR.
103400181220           MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
103500181220             TO WS-OLD-NET-DEP-VALUE.
103600181220           MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
103700181220             TO WS-OLD-NET-DEP-VALUE-CUR.
103800181220
103900181220      * RFS98889 Begins
104000181220      * RFS98304: Undo the comment out done by 98889
10410018122098304      IF CURR-EFFECT-DATE <= WS-LAST-PROCESS-DATE
10420018122098304         PERFORM GET-INV-PREVIOUS-GDV THRU GIPG-EXIT
10430018122098304      END-IF.
104400181220      * RFS98889 Ends
104500181220
104600181220           PERFORM CALC-NEW-GUAR-DEATH-VALUE  THRU CNGD-EXIT.
104700181220
104800181220      * Set Account-Contract-Inv-Reset record
104900181220
105000181220           MOVE "Y"          TO RESET-PROCESSED
105100181220                             OF ACCOUNT-CONTRACT-INV-RESET.
105200181220           MOVE CURR-INV-PRICE-DATE
105300181220                             TO TRADE-DATE
105400181220                             OF ACCOUNT-CONTRACT-INV-RESET.
105500181220           MOVE CURR-INV-PRICE
105600181220                             TO UNIT-PRICE
105700181220                             OF ACCOUNT-CONTRACT-INV-RESET.
105800181220
105900181220           MOVE CURR-INV-EXCH-RATE
106000181220                             TO EXCHANGE-RATE
106100181220                             OF ACCOUNT-CONTRACT-INV-RESET.
106200181220           MOVE WS-CURR-UNIT-BAL
106300181220                             TO CURR-UNIT-BAL
106400181220                             OF ACCOUNT-CONTRACT-INV-RESET.
106500181220
106600181220      ***** guar base fields are used to store GDV amount
106700181220           MOVE WS-OLD-GUAR-DEATH-VALUE
106800181220                             TO OLD-GUAR-BASE-VALUE
106900181220                             OF ACCOUNT-CONTRACT-INV-RESET.
107000181220
107100181220           MOVE WS-OLD-GUAR-DEATH-VALUE-CUR
107200181220                             TO OLD-GUAR-BASE-VALUE-CUR
107300181220                             OF ACCOUNT-CONTRACT-INV-RESET.
107400181220
107500181220           MOVE WS-NEW-GUAR-DEATH-VALUE
107600181220                             TO NEW-GUAR-BASE-VALUE
107700181220                             OF ACCOUNT-CONTRACT-INV-RESET.
107800181220           MOVE WS-NEW-GUAR-DEATH-VAL-CUR
107900181220                             TO NEW-GUAR-BASE-VALUE-CUR
108000181220                             OF ACCOUNT-CONTRACT-INV-RESET.
108100181220
108200181220      ***** OLD  net deposit fields are to save the NEW NET DEPOSIT
108300181220           MOVE WS-OLD-GUAR-BASE-VALUE
108400181220                             TO OLD-NET-DEPOSIT-VALUE
108500181220                             OF ACCOUNT-CONTRACT-INV-RESET.
108600181220           MOVE WS-OLD-GUAR-BASE-VALUE-CUR
108700181220                             TO OLD-NET-DEPOSIT-VALUE-CUR
108800181220                             OF ACCOUNT-CONTRACT-INV-RESET.
108900181220
109000181220      ***** NEW  net deposit fields are to save the NEW GUAR BASE
10910018122057388 *    MOVE WS-OLD-GUAR-BASE-VALUE
10920018122057388      MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
109300181220                             TO NEW-NET-DEPOSIT-VALUE
109400181220                             OF ACCOUNT-CONTRACT-INV-RESET.
10950018122057388 *    MOVE WS-OLD-GUAR-BASE-VALUE-CUR
10960018122057388      MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
109700181220                             TO NEW-NET-DEPOSIT-VALUE-CUR
109800181220                             OF ACCOUNT-CONTRACT-INV-RESET.
109900181220
110000181220
110100181220      *    Calculate the total old and new GDV
110200181220
110300181220           IF COMM-SPMODULE = 'Y'
110400181220             COMPUTE WS-OLD-GDV-TOTAL = WS-OLD-GDV-TOTAL +
110500181220                                        WS-OLD-GUAR-DEATH-VALUE
110600181220
110700181220             COMPUTE WS-NEW-GDV-TOTAL = WS-NEW-GDV-TOTAL +
110800181220                                        WS-NEW-GUAR-DEATH-VALUE
110900181220           END-IF.
111000181220
111100181220           MOVE LAST-RESET-DATE OF ACCOUNT-CONTRACT-INVESTMENT
111200181220                             TO LAST-RESET-DATE
111300181220                             OF ACCOUNT-CONTRACT-INV-RESET.
111400181220
111500181220           MOVE LAST-RESET-NUMBER OF ACCOUNT-CONTRACT-INVESTMENT
111600181220                             TO LAST-RESET-NUMBER
111700181220                             OF ACCOUNT-CONTRACT-INV-RESET.
111800181220
111900181220      * Set Account-Contract-Investment record
112000181220
112100181220           MOVE EFFECT-DATE  OF ACCOUNT-CONTRACT-INV-RESET
112200181220                             TO LAST-RESET-DATE
112300181220                             OF ACCOUNT-CONTRACT-INVESTMENT.
112400181220           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
112500181220                             TO LAST-RESET-NUMBER
112600181220                             OF ACCOUNT-CONTRACT-INVESTMENT.
112700181220
112800181220           MOVE WS-NEW-GUAR-DEATH-VALUE
112900181220                             TO GUAR-DEATH-VALUE
113000181220                             OF ACCOUNT-CONTRACT-INVESTMENT.
113100181220           MOVE WS-NEW-GUAR-DEATH-VAL-CUR
113200181220                             TO GUAR-DEATH-VALUE-CUR
113300181220                             OF ACCOUNT-CONTRACT-INVESTMENT.
113400181220
113500181220       DPR-0040.
113600181220           REWRITE ACC-CON-INV-REC.
113700181220           REWRITE ACC-CON-INV-RESET-REC.
113800181220           MOVE "N" TO WS-INV-SEG-FIRST-PASS.
113900181220           GO TO DPR-0010.
114000181220       DPR-EXIT.
114100181220           EXIT.
114200181220      /
114300181220      * RFS98889 Begins
114400181220      * RFS98304: Undo the comment out done by 98889
11450018122098304  GET-INV-PREVIOUS-GDV.
114600181220  |        SEARCH ALL WS-ACC-CON-INV-ARRAY
114700181220  |          AT END
114800181220  |             GO TO GIPG-EXIT
114900181220  |          WHEN WS-ARRAY-INVESTMENT-CODE(CONTIDX) =
115000181220  |                  INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
115100181220  |              MOVE WS-ARRAY-GDV(CONTIDX) TO WS-OLD-GUAR-DEATH-VALUE
115200181220  |              MOVE WS-ARRAY-GDV-CUR(CONTIDX)
115300181220  |                   TO WS-OLD-GUAR-DEATH-VALUE-CUR
115400181220  |              MOVE WS-ARRAY-GBV(CONTIDX) TO WS-OLD-GUAR-BASE-VALUE
115500181220  |              MOVE WS-ARRAY-GBV-CUR(CONTIDX)
115600181220  |                   TO WS-OLD-GUAR-BASE-VALUE-CUR
115700181220  |        END-SEARCH.
115800181220  |    GIPG-EXIT.
11590018122098304      EXIT.
116000181220      * RFS98889 Ends
116100181220      /
116200181220       CALC-NEW-GUAR-DEATH-VALUE.
116300181220
116400181220      * RFS139654 - Start
116500181220           PERFORM GetGDVTrackingRule.
116600181220           IF lc_GdvTrackRule  = lnc_B
116700181220              COMPUTE WS-DEATH-PERCENTAGE = 100
116800181220           END-IF.
116900181220      * RFS139654 - End
117000181220           COMPUTE WS-NEW-GUAR-DEATH-VAL-CUR ROUNDED =
117100181220                   WS-CURR-UNIT-BAL * CURR-INV-PRICE *
117200181220                   WS-DEATH-PERCENTAGE / 100.
117300181220
117400181220      *    COMPUTE WS-NEW-GUAR-BASE-VAL-CUR ROUNDED =
117500181220      *            WS-CURR-UNIT-BAL * CURR-INV-PRICE
117600181220
117700181220           IF CURR-INV-CURRENCY    = UNITRAX-BASE-CURRENCY
117800181220             MOVE WS-NEW-GUAR-DEATH-VAL-CUR
117900181220                  TO WS-NEW-GUAR-DEATH-VALUE
118000181220      *      MOVE WS-NEW-GUAR-BASE-VAL-CUR
118100181220      *           TO WS-NEW-GUAR-BASE-VALUE
118200181220           ELSE
118300181220             COMPUTE WS-NEW-GUAR-DEATH-VALUE ROUNDED =
118400181220                     WS-CURR-UNIT-BAL * CURR-INV-PRICE /
118500181220                     CURR-INV-EXCH-RATE * (WS-DEATH-PERCENTAGE / 100)
118600181220
118700181220      *      COMPUTE WS-NEW-GUAR-BASE-VALUE ROUNDED =
118800181220      *              WS-CURR-UNIT-BAL * CURR-INV-PRICE /
118900181220      *              CURR-INV-EXCH-RATE
119000181220           END-IF.
119100181220       CNGD-EXIT.
119200181220           EXIT.
119300181220      /
119400181220       GET-ACC-CON-INV-GDV.
119500181220           PERFORM LOAD-ACC-CON-INV-ARRAY   THRU LACIA-EXIT.
119600181220           PERFORM RECALC-TRADES-IN-REVERSE THRU RTIR-EXIT.
119700181220       GACIG-EXIT.
119800181220           EXIT.
119900181220      /
120000181220
120100181220       LOAD-ACC-CON-INV-ARRAY.
120200181220           MOVE "OPEN ACICUR" TO WS-SQLERR-STATEMENT.
120300181220           MOVE 0 TO WS-ARRAY-MAX-REC.
120400181220           PERFORM VARYING CONTIDX   FROM 1 BY 1
120401211007111744             UNTIL CONTIDX   > WS-ARRAY-1000
120402211007111744*            UNTIL CONTIDX   > WS-ARRAY-100
120600181220             INITIALIZE          WS-ACC-CON-INV-ARRAY(CONTIDX)
120700181220             MOVE HIGH-VALUE TO  WS-ARRAY-INVESTMENT-CODE(CONTIDX)
120800181220           END-PERFORM.
120900181220
121000181220           EXEC SQL
121100181220             OPEN ACICUR
121200181220           END-EXEC.
121300181220
121400181220           IF SQLCODE = 0
121500181220              CONTINUE
121600181220           ELSE
121700181220              PERFORM DISPLAY-ERROR-INFO  THRU DRI-EXIT
121800181220              GO TO LACIA-EXIT
121900181220           END-IF.
122000181220
122100181220           MOVE "FETCH ACICUR" TO WS-SQLERR-STATEMENT.
122200181220           EXEC SQL
122300181220             FETCH NEXT FROM ACICUR
122301211007111744         FOR 1000 ROWS
122302211007111744*        FOR 100 ROWS
122500181220              INTO :WS-ACC-CON-INV-ARRAY
122600181220           END-EXEC.
122700181220
122800181220           IF SQLCODE = 100
122900181220              MOVE 0 TO WS-ARRAY-MAX-REC
123000181220           ELSE
123100181220              COMPUTE   WS-ARRAY-MAX-REC = SQLERRD(3)
123200181220           END-IF.
123300181220
123400181220           MOVE "CLOSE ACICUR" TO WS-SQLERR-STATEMENT.
123500181220           EXEC SQL
123600181220             CLOSE ACICUR
123700181220           END-EXEC.
123800181220       LACIA-EXIT.
123900181220           EXIT.
124000181220      /
124100181220       RECALC-TRADES-IN-REVERSE.
124200181220
124300181220           MOVE "OPEN SEGEXTSQ" TO WS-SQLERR-STATEMENT.
124400181220           EXEC SQL
124500181220                OPEN SEGEXTSQ
124600181220           END-EXEC.
124700181220
124800181220           IF SQLCODE = 0
124900181220              CONTINUE
125000181220           ELSE
125100181220              PERFORM DISPLAY-ERROR-INFO THRU DRI-EXIT
125200181220              GO TO RTIR-EXIT
125300181220           END-IF.
125400181220
125500181220       RTIR-0010.
125600181220           MOVE "FETCH SEGEXTSQ" TO WS-SQLERR-STATEMENT.
125700181220           EXEC SQL
125800181220              FETCH NEXT FROM SEGEXTSQ
125900181220               INTO :WS-SQL-PROCESS-DATE,   :WS-SQL-PROC-SEQ-NO,
126000181220                    :WS-SQL-PLACEMENT-DATE, :WS-SQL-TRANS-NO,
126100181220                    :WS-SQL-TRADE-DATE,     :TRANS-TYPE-CATEGORY,
126200181220                    :TRANS-ORIGIN-CODE,     :WS-SQL-INVEST,
126300181220                    :WS-SQL-GROSS-AMT ,     :WS-SQL-NET-AMT,
126400181220                    :WS-SQL-UNIT-PRICE,
126500181220                    :WS-SQL-REVERSAL-CODE
126600181220           END-EXEC.
126700181220
126800181220           IF SQLCODE = 0
126900181220              CONTINUE
127000181220           ELSE
127100181220              GO TO RTIR-CLOSE
127200181220           END-IF.
127300181220
127400181220      * Get the trans-contract-details
127500181220           INITIALIZE MFATRCODP OF TRANS-CON-DTL-REC.
127600181220           MOVE WS-SQL-PLACEMENT-DATE
127700181220             TO PLACEMENT-DATE OF TRANS-CON-DTL.
127800181220           MOVE WS-SQL-TRANS-NO
127900181220             TO TRANS-NO OF TRANS-CON-DTL.
128000181220           MOVE COMM-CONTRACT-NO TO CONTRACT-NO OF TRANS-CON-DTL.
128100181220
128200181220           READ TRANS-CON-DTL
128300181220             INVALID KEY
128400181220                GO TO RTIR-0010
128500181220           END-READ.
128600181220
128700181220           IF REVERSED-DDS OF TRANS-CON-DTL = "Y"
128800181220              GO TO RTIR-0010
128900181220           END-IF.
129000181220
129100181220      * This routine will determine if txn is excluded or not
129200181220      * for GDV recalculation.
129300181220           MOVE "N"                     TO WS-EXCLUDE-TRANS.
129400181220           MOVE TRANS-ORIGIN-CODE       TO WS-EX-TRANS-ORIGIN.
129500181220           MOVE TRANS-TYPE-CATEGORY     TO WS-EX-TRANS-TYPE.
129600181220           MOVE WS-SQL-REVERSAL-CODE    TO WS-EX-REVERSAL-CODE.
129700181220           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
129800181220           IF WS-EXCLUDE-TRANS = "Y"
129900181220              GO TO RTIR-0010
130000181220           END-IF.
130100181220
130200181220      * Get the GBV from Trans-GBV-Transfer if it exists
130300181220           MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
130400181220           INITIALIZE MFATRACXP OF TRANS-GBV-TRANSFER-REC.
130500181220           IF BUY-TRANSACTION
130600181220R49898        OR SWITCH-IN-TRANSACTION
130700181220              MOVE WS-SQL-PLACEMENT-DATE
130800181220                TO PLACEMENT-DATE OF TRANS-GBV-TRANSFER
130900181220              MOVE WS-SQL-TRANS-NO
131000181220                TO TRANS-NO OF TRANS-GBV-TRANSFER
131100181220
131200181220              READ TRANS-GBV-TRANSFER
131300181220                   INVALID KEY
131400181220                   GO TO RTIR-0020
131500181220              END-READ
131600181220
131700181220              MOVE "Y" TO WS-XFER-AMT-EXISTS-FLAG
131800181220           END-IF.
131900181220       RTIR-0020.
132000181220           MOVE WS-SQL-INVEST           TO WS-INVESTMENT-CODE.
132100181220           PERFORM GET-INVESTMENT-INFO  THRU GII-EXIT.
132200181220           MOVE WS-INVEST-CURRENCY      TO WS-TRN-INV-CURRENCY.
132300181220
132400181220           IF FRONT-END AND BUY-TRANSACTION
132500181220              MOVE WS-SQL-NET-AMT     TO WS-TRANS-TRADE-AMT
132600181220           ELSE
132700181220              MOVE WS-SQL-GROSS-AMT   TO WS-TRANS-TRADE-AMT
132800181220           END-IF.
132900181220
133000181220           IF SWITCH-IN-TRANSACTION
133100181220              MOVE GBV-CHANGE OF TRANS-CON-DTL TO WS-TRANS-TRADE-AMT
133200181220           END-IF.
133300181220
133400181220           IF BUY-TRANSACTION AND TRANSFER-AMT-EXISTS
133500181220              MOVE GUAR-BASE-VALUE OF TRANS-GBV-TRANSFER
133600181220                TO WS-TRANS-TRADE-AMT
133700181220           END-IF.
133800181220
133900181220           MOVE GDV-CHANGE OF TRANS-CON-DTL TO WS-TRANS-TRADE-AMT-GDV.
134000181220
134100181220           IF PURCHASE-TRANSACTION
134200181220              PERFORM SEARCH-ACC-CON-INV-ARRAY THRU SACIA-EXIT
134300181220              IF WS-REJECTION-CODE NOT = " " AND "00"
134400181220                 GO TO RTIR-CLOSE
134500181220              END-IF
134600181220              GO TO RTIR-0010
134700181220           END-IF.
134800181220
134900181220           PERFORM GET-CON-INV-MARKET-VALUE THRU GCIMV-EXIT.
135000181220           IF WS-REJECTION-CODE NOT = " " AND "00"
135100181220              GO TO RTIR-CLOSE
135200181220           END-IF.
135300181220
135400181220           MOVE GDV-CHANGE OF TRANS-CON-DTL TO WS-GDV-CHANGE.
135500181220           MOVE GBV-CHANGE OF TRANS-CON-DTL TO WS-GBV-CHANGE.
135600181220      *    calc-new-gdv-change  -begin
135700181220           IF REDEMPTION-TRANSACTION
135800181220              ADD WS-GDV-CHANGE TO WS-CONT-GDV-TOTAL
135900181220                  GIVING WS-NEW-CONTRACT-GDV
136000181220              ADD WS-GBV-CHANGE TO WS-CONT-GBV-TOTAL
136100181220                  GIVING WS-NEW-CONTRACT-GBV
136200181220           ELSE
136300181220              SUBTRACT WS-GDV-CHANGE FROM WS-CONT-GDV-TOTAL
136400181220                  GIVING WS-NEW-CONTRACT-GDV
136500181220              SUBTRACT WS-GBV-CHANGE FROM WS-CONT-GBV-TOTAL
136600181220                  GIVING WS-NEW-CONTRACT-GBV
136700181220           END-IF.
136800181220      *    calc-new-gdv-change  -end
136900181220
137000181220           PERFORM RECALC-CONTRACT-INV-GDV THRU RCIG-EXIT.
137100181220           PERFORM CHECK-GDV-ROUNDING THRU CGDR-EXIT.
137200181220
137300181220           GO TO RTIR-0010.
137400181220
137500181220       RTIR-CLOSE.
137600181220           MOVE "CLOSE SEGEXTSQ" TO WS-SQLERR-STATEMENT.
137700181220           EXEC SQL
137800181220             CLOSE SEGEXTSQ
137900181220           END-EXEC.
138000181220       RTIR-EXIT.
138100181220           EXIT.
138200181220      /
138300181220       SEARCH-ACC-CON-INV-ARRAY.
138400181220           MOVE "SEARCH-ACC-CON-INV-ARRAY" TO WS-ROUTINE-NAME.
138500181220           SEARCH ALL WS-ACC-CON-INV-ARRAY
138600181220             AT END
138700181220                GO TO SACIA-EXIT
138800181220             WHEN WS-ARRAY-INVESTMENT-CODE(CONTIDX) = WS-SQL-INVEST
138900181220                CONTINUE
139000181220           END-SEARCH.
139100181220
139200181220       SACIA-0010.
139300181220           SUBTRACT ORIG-UNIT-BAL OF TRANS-CON-DTL
139400181220               FROM WS-ARRAY-CUR-UNITBAL(CONTIDX).
139500181220           SUBTRACT ORIG-UNIT-BAL OF TRANS-CON-DTL
139600181220               FROM WS-ARRAY-OPEN-UNITBAL(CONTIDX).
139700181220
139800181220           IF WS-TRN-INV-CURRENCY       NOT = UNITRAX-BASE-CURRENCY
139900181220              MOVE WS-SQL-PLACEMENT-DATE   TO WS-EXCH-PLACEMENT-DATE
140000181220              MOVE WS-SQL-TRANS-NO         TO WS-EXCH-TRANS-NO
140100181220              MOVE WS-SQL-TRADE-DATE       TO WS-EXCH-TRADE-DATE
140200181220              MOVE WS-TRN-INV-CURRENCY     TO WS-EXCH-CURRENCY
140300181220              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
140400181220              IF WS-REJECTION-CODE NOT = " " AND "00"
140500181220                 GO TO SACIA-EXIT
140600181220              END-IF
140700181220              COMPUTE WS-INV-GDV-CUR ROUNDED =
140800181220                      WS-TRANS-TRADE-AMT-GDV / WS-EXCH-RATE
140900181220              MOVE WS-INV-GDV-CUR TO WS-INV-GDV
141000181220
141100181220              COMPUTE WS-INV-GBV-CUR ROUNDED =
141200181220                      WS-TRANS-TRADE-AMT / WS-EXCH-RATE
141300181220              MOVE WS-INV-GBV-CUR TO WS-INV-GDV
141400181220           ELSE
141500181220              MOVE WS-TRANS-TRADE-AMT-GDV TO WS-INV-GDV-CUR
141600181220                                             WS-INV-GDV
141700181220              MOVE WS-TRANS-TRADE-AMT     TO WS-INV-GBV-CUR
141800181220                                             WS-INV-GBV
141900181220           END-IF.
142000181220           SUBTRACT WS-INV-GDV FROM WS-ARRAY-GDV(CONTIDX).
142100181220           SUBTRACT WS-INV-GBV FROM WS-ARRAY-GBV(CONTIDX).
142200181220           IF WS-ARRAY-GDV(CONTIDX) < 0
142300181220              MOVE 0 TO WS-ARRAY-GDV(CONTIDX)
142400181220           END-IF.
142500181220           IF WS-ARRAY-GBV(CONTIDX) < 0
142600181220              MOVE 0 TO WS-ARRAY-GBV(CONTIDX)
142700181220           END-IF.
142800181220           SUBTRACT WS-INV-GDV-CUR FROM WS-ARRAY-GDV-CUR(CONTIDX).
142900181220           SUBTRACT WS-INV-GBV-CUR FROM WS-ARRAY-GBV-CUR(CONTIDX).
143000181220           IF WS-ARRAY-GDV-CUR(CONTIDX) < 0
143100181220              MOVE 0 TO WS-ARRAY-GDV-CUR(CONTIDX)
143200181220           END-IF.
143300181220           IF WS-ARRAY-GBV-CUR(CONTIDX) < 0
143400181220              MOVE 0 TO WS-ARRAY-GBV-CUR(CONTIDX)
143500181220           END-IF.
143600181220       SACIA-EXIT.
143700181220           EXIT.
143800181220      /
143900181220       GET-CON-INV-MARKET-VALUE.
144000181220           MOVE "GET-CON-INV-MARKET-VALUE" TO WS-ROUTINE-NAME.
144100181220           IF WS-REJECTION-CODE NOT = " " AND "00"
144200181220              GO TO GCIMV-EXIT
144300181220           END-IF.
144400181220
144500181220           INITIALIZE WS-CONT-GDV-TOTAL
144600181220                      WS-CONT-GBV-TOTAL
144700181220                      WS-CONT-MV-BEF-TOTAL
144800181220                      WS-CONT-MV-AFT-TOTAL.
144900181220           SET CONTIDX TO 1.
145000181220           SET CONTIDX DOWN BY 1.
145100181220
145200181220       GCIMV-NEXT.
145300181220           SET CONTIDX UP BY 1.
145400181220           IF CONTIDX > WS-ARRAY-MAX-REC
145500181220              GO TO GCIMV-EXIT
145600181220           END-IF.
145700181220
145800181220           IF WS-ARRAY-INVESTMENT-CODE(CONTIDX) = WS-SQL-INVEST
145900181220              MOVE WS-SQL-UNIT-PRICE       TO WS-PRC-UNIT-PRICE
146000181220              MOVE WS-TRN-INV-CURRENCY     TO WS-INVEST-CURRENCY
146100181220              GO TO GCIMV-0010
146200181220           END-IF.
146300181220
146400181220           MOVE WS-ARRAY-INVESTMENT-CODE(CONTIDX) TO WS-INVESTMENT-CODE.
146500181220           PERFORM GET-INVESTMENT-INFO THRU GII-EXIT.
146600181220
146700181220APR14 *    MOVE "Y" TO WS-EXACT-TRADE-DATE.
146800181220           MOVE WS-ARRAY-INVESTMENT-CODE(CONTIDX) TO WS-PRC-INVEST.
146900181220           MOVE WS-SQL-TRADE-DATE                 TO WS-PRC-TRADE-DATE.
147000181221      *RFS1005904 START
147100181221           MOVE 0 TO WS-PRC-UNIT-PRICE.
147200181221           IF lc_InvStatus = lnc_Active
147300181221      *    PERFORM GET-INVESTMENT-UNIT-PRICE THRU GIUP-EXIT.
147400181221              PERFORM GET-INVESTMENT-UNIT-PRICE THRU GIUP-EXIT
147500181221           END-IF.
147600181221      *RFS1005904 END
147700181220           IF COMM-REJECTION-CODE NOT = " " AND "00"
147800181220              GO TO GCIMV-EXIT
147900181220           END-IF.
148000181220
148100181220       GCIMV-0010.
148200181220           IF WS-INVEST-CURRENCY         NOT = UNITRAX-BASE-CURRENCY
148300181220              MOVE WS-SQL-PLACEMENT-DATE    TO WS-EXCH-PLACEMENT-DATE
148400181220              MOVE WS-SQL-TRANS-NO          TO WS-EXCH-TRANS-NO
148500181220              MOVE WS-SQL-TRADE-DATE        TO WS-EXCH-TRADE-DATE
148600181220              MOVE WS-INVEST-CURRENCY       TO WS-EXCH-CURRENCY
148700181220              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
148800181220              IF WS-REJECTION-CODE NOT = " " AND "00"
148900181220                 GO TO GCIMV-EXIT
149000181220              END-IF
149100181220           ELSE
149200181220              MOVE 1.0 TO WS-EXCH-RATE
149300181220           END-IF.
149400181220
149500181220           IF WS-INVEST-CURRENCY       = UNITRAX-BASE-CURRENCY
149600181220              COMPUTE WS-ARRAY-INV-MV-BEF(CONTIDX) ROUNDED =
149700181220                   WS-ARRAY-CUR-UNITBAL(CONTIDX) * WS-PRC-UNIT-PRICE
149800181220           ELSE
149900181220              COMPUTE WS-ARRAY-INV-MV-BEF(CONTIDX) ROUNDED =
150000181220                   WS-ARRAY-CUR-UNITBAL(CONTIDX) *
150100181220                   WS-PRC-UNIT-PRICE / WS-EXCH-RATE
150200181220           END-IF.
150300181220
150400181220           IF WS-ARRAY-INVESTMENT-CODE(CONTIDX) = WS-SQL-INVEST
150500181220              IF REDEMPTION-TRANSACTION
150600181220                 ADD ORIG-UNIT-BAL OF TRANS-CON-DTL
150700181220                  TO WS-ARRAY-CUR-UNITBAL(CONTIDX)
150800181220              ELSE
150900181220                 SUBTRACT ORIG-UNIT-BAL OF TRANS-CON-DTL
151000181220                     FROM WS-ARRAY-CUR-UNITBAL(CONTIDX)
151100181220                 IF WS-ARRAY-CUR-UNITBAL(CONTIDX) IS NEGATIVE
151200181220                    MOVE 0 TO WS-ARRAY-CUR-UNITBAL(CONTIDX)
151300181220                 END-IF
151400181220              END-IF
151500181220           END-IF.
151600181220
151700181220           IF WS-INVEST-CURRENCY       = UNITRAX-BASE-CURRENCY
151800181220              COMPUTE WS-ARRAY-INV-MV-AFT(CONTIDX) ROUNDED =
151900181220                   WS-ARRAY-CUR-UNITBAL(CONTIDX) * WS-PRC-UNIT-PRICE
152000181220           ELSE
152100181220              COMPUTE WS-ARRAY-INV-MV-AFT(CONTIDX) ROUNDED =
152200181220                   WS-ARRAY-CUR-UNITBAL(CONTIDX) *
152300181220                   WS-PRC-UNIT-PRICE / WS-EXCH-RATE
152400181220           END-IF.
152500181220
152600181220           ADD WS-ARRAY-INV-MV-BEF(CONTIDX) TO WS-CONT-MV-BEF-TOTAL.
152700181220           ADD WS-ARRAY-INV-MV-AFT(CONTIDX) TO WS-CONT-MV-AFT-TOTAL.
152800181220           ADD WS-ARRAY-GDV(CONTIDX) TO WS-CONT-GDV-TOTAL.
152900181220           ADD WS-ARRAY-GBV(CONTIDX) TO WS-CONT-GBV-TOTAL.
153000181220
153100181220           MOVE WS-INVEST-CURRENCY
153200181220             TO WS-ARRAY-INV-CUR-CODE(CONTIDX).
153300181220           MOVE WS-EXCH-RATE       TO WS-ARRAY-EXCH-RATE(CONTIDX).
153400181220
153500181220           GO TO GCIMV-NEXT.
153600181220
153700181220       GCIMV-EXIT.
153800181220           EXIT.
153900181220      /
154000181220       RECALC-CONTRACT-INV-GDV.
154100181220           MOVE "RECALC-CONTRACT-INV-GDV" TO WS-ROUTINE-NAME.
154200181220           SET CONTIDX TO 1.
154300181220           SET CONTIDX DOWN BY 1.
154400181220
154500181220           INITIALIZE WS-INV-GDV-PERCENT-TOTAL
154600181220                      WS-CONT-GDV-AFT-TOTAL.
154700181220
154800181220           INITIALIZE WS-INV-GBV-PERCENT-TOTAL
154900181220                      WS-CONT-GBV-AFT-TOTAL.
155000181220
155100181220       RCIG-NEXT.
155200181220           SET CONTIDX UP BY 1.
155300181220           IF CONTIDX > WS-ARRAY-MAX-REC
155400181220              GO TO RCIG-EXIT
155500181220           END-IF.
155600181220
155700181220           IF SWITCH-IN
155800181220              IF WS-ARRAY-INVESTMENT-CODE(CONTIDX) = WS-SQL-INVEST
155900181220                 SUBTRACT WS-GDV-CHANGE FROM WS-ARRAY-GDV(CONTIDX)
156000181220                   GIVING WS-INV-GDV-AFT
156100181220                 SUBTRACT WS-GBV-CHANGE FROM WS-ARRAY-GBV(CONTIDX)
156200181220                   GIVING WS-INV-GBV-AFT
156300181220                 GO TO RCIG-0010
156400181220              ELSE
156500181220                 GO TO RCIG-NEXT
156600181220              END-IF
156700181220           END-IF.
156800181220
156900181220           IF WS-CONT-MV-AFT-TOTAL NOT = 0
157000181220            COMPUTE WS-INV-GDV-PERCENT ROUNDED =
157100181220                   WS-ARRAY-INV-MV-AFT(CONTIDX) / WS-CONT-MV-AFT-TOTAL
157200181220            COMPUTE WS-INV-GBV-PERCENT ROUNDED =
157300181220                   WS-ARRAY-INV-MV-AFT(CONTIDX) / WS-CONT-MV-AFT-TOTAL
157400181220           ELSE
157500181220              MOVE 0 TO WS-INV-GDV-PERCENT
157600181220              MOVE 0 TO WS-INV-GBV-PERCENT
157700181220           END-IF.
157800181220
157900181220           ADD WS-INV-GDV-PERCENT TO WS-INV-GDV-PERCENT-TOTAL.
158000181220           ADD WS-INV-GBV-PERCENT TO WS-INV-GBV-PERCENT-TOTAL.
158100181220
158200181220           IF WS-ARRAY-MAX-REC = CONTIDX           AND
158300181220              WS-INV-GDV-PERCENT-TOTAL NOT = 1.000 AND 0
158400181220              SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
158500181220                       GIVING WS-DUMMY-PERCENT
158600181220              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
158700181220              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
158800181220           ELSE
158900181220              IF WS-ARRAY-MAX-REC NOT = CONTIDX    AND
159000181220                (WS-INV-GDV-PERCENT-TOTAL = 0.999 OR
159100181220                 WS-INV-GDV-PERCENT-TOTAL > 1.000)
159200181220                 SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
159300181220                          GIVING WS-DUMMY-PERCENT
159400181220                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
159500181220                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
159600181220              END-IF
159700181220           END-IF.
159800181220
159900181220           IF WS-ARRAY-MAX-REC = CONTIDX           AND
160000181220              WS-INV-GBV-PERCENT-TOTAL NOT = 1.000 AND 0
160100181220              SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
160200181220                       GIVING WS-DUMMY-PERCENT
160300181220              ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
160400181220              ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
160500181220           ELSE
160600181220              IF WS-ARRAY-MAX-REC NOT = CONTIDX    AND
160700181220                (WS-INV-GBV-PERCENT-TOTAL = 0.999 OR
160800181220                 WS-INV-GBV-PERCENT-TOTAL > 1.000)
160900181220                 SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
161000181220                          GIVING WS-DUMMY-PERCENT
161100181220                 ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
161200181220                 ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
161300181220              END-IF
161400181220           END-IF.
161500181220
161600181220           COMPUTE WS-INV-GDV-AFT ROUNDED =
161700181220                   WS-NEW-CONTRACT-GDV * WS-INV-GDV-PERCENT.
161800181220
161900181220           COMPUTE WS-INV-GBV-AFT ROUNDED =
162000181220                   WS-NEW-CONTRACT-GBV * WS-INV-GBV-PERCENT.
162100181220
162200181220       RCIG-0010.
162300181220
162400181220           IF WS-ARRAY-INV-CUR-CODE(CONTIDX) = UNITRAX-BASE-CURRENCY
162500181220              MOVE WS-INV-GDV-AFT TO WS-INV-GDV-AFT-CUR
162600181220              MOVE WS-INV-GBV-AFT TO WS-INV-GBV-AFT-CUR
162700181220           ELSE
162800181220              COMPUTE WS-INV-GDV-AFT-CUR ROUNDED =
162900181220                      WS-INV-GDV-AFT * WS-ARRAY-EXCH-RATE(CONTIDX)
163000181220              COMPUTE WS-INV-GBV-AFT-CUR ROUNDED =
163100181220                      WS-INV-GBV-AFT * WS-ARRAY-EXCH-RATE(CONTIDX)
163200181220           END-IF.
163300181220
163400181220           IF WS-INV-GDV-AFT IS NEGATIVE OR
163500181220              WS-ARRAY-CUR-UNITBAL(CONTIDX) = 0
163600181220              MOVE ZEROES TO WS-INV-GDV-AFT
163700181220                             WS-INV-GDV-AFT-CUR
163800181220           END-IF.
163900181220           IF WS-INV-GBV-AFT IS NEGATIVE OR
164000181220              WS-ARRAY-CUR-UNITBAL(CONTIDX) = 0
164100181220              MOVE ZEROES TO WS-INV-GBV-AFT
164200181220                             WS-INV-GBV-AFT-CUR
164300181220           END-IF.
164400181220
164500181220           IF REDEMPTION-TRANSACTION
164600181220              ADD WS-INV-GDV-AFT TO WS-CONT-GDV-AFT-TOTAL
164700181220              ADD WS-INV-GBV-AFT TO WS-CONT-GBV-AFT-TOTAL
164800181220           END-IF.
164900181220
165000181220           MOVE WS-INV-GDV-AFT TO WS-ARRAY-GDV(CONTIDX).
165100181220           MOVE WS-INV-GDV-AFT-CUR TO WS-ARRAY-GDV-CUR(CONTIDX).
165200181220
165300181220           MOVE WS-INV-GBV-AFT TO WS-ARRAY-GBV(CONTIDX).
165400181220           MOVE WS-INV-GBV-AFT-CUR TO WS-ARRAY-GBV-CUR(CONTIDX).
165500181220           GO TO RCIG-NEXT.
165600181220
165700181220       RCIG-EXIT.
165800181220           EXIT.
165900181220      /
166000181220       CHECK-GDV-ROUNDING.
166100181220           MOVE "CHECK-GDV-ROUNDING" TO WS-ROUTINE-NAME.
166200181220           IF PURCHASE-TRANSACTION
166300181220              GO TO CGDR-EXIT
166400181220           END-IF.
166500181220
166600181220           MOVE "N" TO WS-GDV-DIFF-FLAG
166700181220                       WS-GBV-DIFF-FLAG.
166800181220           MOVE 0   TO WS-GDV-DIFF-AMOUNT
166900181220                       WS-GBV-DIFF-AMOUNT.
167000181220           MOVE "Y" TO WS-GDV-UPDATE-FLAG
167100181220                       WS-GBV-UPDATE-FLAG.
167200181220
167300181220           IF WS-NEW-CONTRACT-GDV NOT = WS-CONT-GDV-AFT-TOTAL
167400181220              MOVE "Y" TO WS-GDV-DIFF-FLAG
167500181220              COMPUTE WS-GDV-DIFF-AMOUNT =
167600181220                      WS-NEW-CONTRACT-GDV - WS-CONT-GDV-AFT-TOTAL
167700181220           END-IF.
167800181220
167900181220           IF WS-NEW-CONTRACT-GBV NOT = WS-CONT-GBV-AFT-TOTAL
168000181220              MOVE "Y" TO WS-GDV-DIFF-FLAG
168100181220              COMPUTE WS-GBV-DIFF-AMOUNT =
168200181220                      WS-NEW-CONTRACT-GBV - WS-CONT-GBV-AFT-TOTAL
168300181220           END-IF.
168400181220
168500181220           IF GDV-DIFFERENCE-FOUND  OR GBV-DIFFERENCE-FOUND
168600181220              GO TO CGDR-0010
168700181220           END-IF.
168800181220
168900181220           GO TO CGDR-EXIT.
169000181220
169100181220       CGDR-0010.
169200181220           SET CONTIDX TO 1.
169300181220           SEARCH WS-ACC-CON-INV-ARRAY VARYING CONTIDX
169400181220             WHEN WS-ARRAY-CUR-UNITBAL(CONTIDX) NOT = 0
169500181220                  GO TO CGDR-0020
169600181220             WHEN WS-ARRAY-INVESTMENT-CODE(CONTIDX) = HIGH-VALUE
169700181220                  GO TO CGDR-EXIT
169800181220           END-SEARCH.
169900181220
170000181220       CGDR-0020.
170100181220           ADD WS-GDV-DIFF-AMOUNT TO WS-ARRAY-GDV(CONTIDX)
170200181220                                     WS-ARRAY-GDV-CUR(CONTIDX).
170300181220           ADD WS-GBV-DIFF-AMOUNT TO WS-ARRAY-GBV(CONTIDX)
170400181220                                     WS-ARRAY-GBV-CUR(CONTIDX).
170500181220
170600181220       CGDR-EXIT.
170700181220           EXIT.
170800181220      /
170900181220       GET-UNIT-BALANCE.
171000181220      *  63488 Begin
171100181220      *    MOVE "OPEN TRNBCUR" TO WS-SQLERR-STATEMENT.
171200181220      *    EXEC SQL
171300181220      *      OPEN TRNBCUR
171400181220      *    END-EXEC.
171500181220      *
171600181220      *    IF SQLCODE = 0
171700181220      *       CONTINUE
171800181220      *    ELSE
171900181220      *       GO TO GUB-SEL
172000181220      *    END-IF.
172100181220      *
172200181220      *    MOVE "FETCH TRNBCUR" TO WS-SQLERR-STATEMENT.
172300181220      *    EXEC SQL
172400181220      *      FETCH NEXT FROM TRNBCUR
172500181220      *       INTO :WS-INV-UNITS
172600181220      *    END-EXEC.
172700181220      *
172800181220      *    IF SQLCODE = 0
172900181220      *       CONTINUE
173000181220      *    ELSE
173100181220      *       MOVE 0 TO WS-INV-UNITS
173200181220      *    END-IF.
173300181220      *
173400181220      *    MOVE "CLOSE TRNBCUR" TO WS-SQLERR-STATEMENT.
173500181220      *    EXEC SQL
173600181220      *       CLOSE TRNBCUR
173700181220      *    END-EXEC.
173800181220      *  63488 End
173900181220      * RFS63488 - START
174000181220           INITIALIZE li_Account_no
174100181220                      li_Trade_Date
174200181220                      li_FMV_Amt
174300181220                      lc_Mode
174400181220                      li_Contract_no
174500181220                      lc_Investment_code
174600181220                      li_Unit_amount.
174700181220
174800181220           MOVE CURR-ACCOUNT-NO       TO  li_Account_no
174900181220           MOVE CURR-CONTRACT-NO      TO  li_Contract_no
175000181220           MOVE CURR-INVESTMENT-CODE  TO  lc_Investment_code
175100181220           MOVE "R"                   TO  lc_Mode
175200181220           MOVE CURR-EFFECT-DATE      TO  li_Trade_Date
175300181220
175400181220           CALL "FXGETFMV" USING li_Account_no
175500181220                                 li_Trade_Date
175600181220                                 li_FMV_Amt
175700181220                                 lc_Mode
175800181220                                 li_Contract_no
175900181220                                 lc_Investment_code
176000181220                                 li_Unit_amount.
176100181220
176200181220           MOVE li_Unit_amount        TO  WS-ACC-CON-INV-UNIT-BAL.
176300181220
176400181220      *    SUBTRACT WS-INV-UNITS FROM WS-ACC-CON-INV-UNIT-BAL.
176500181220      *
176600181220      *GUB-SEL.
176700181220      *    MOVE "OPEN TRNSCUR" TO WS-SQLERR-STATEMENT.
176800181220      *    EXEC SQL
176900181220      *      OPEN TRNSCUR
177000181220      *    END-EXEC.
177100181220      *
177200181220      *    IF SQLCODE = 0
177300181220      *       CONTINUE
177400181220      *    ELSE
177500181220      *       GO TO GUB-EXIT
177600181220      *    END-IF.
177700181220      *
177800181220      *    MOVE "FETCH TRNSCUR" TO WS-SQLERR-STATEMENT.
177900181220      *    EXEC SQL
178000181220      *      FETCH NEXT FROM TRNSCUR
178100181220      *       INTO :WS-INV-UNITS
178200181220      *    END-EXEC.
178300181220      *
178400181220      *    IF SQLCODE = 0
178500181220      *       CONTINUE
178600181220      *    ELSE
178700181220      *       MOVE 0 TO WS-INV-UNITS
178800181220      *    END-IF.
178900181220      *
179000181220      *    MOVE "CLOSE TRNSCUR" TO WS-SQLERR-STATEMENT.
179100181220      *    EXEC SQL
179200181220      *       CLOSE TRNSCUR
179300181220      *    END-EXEC.
179400181220      *
179500181220      *    ADD WS-INV-UNITS TO   WS-ACC-CON-INV-UNIT-BAL.
179600181220      * RFS63488 - END
179700181220       GUB-EXIT.
179800181220           EXIT.
179900181220      /
180000181220      * ---------------------------------
180100181220       CHECK-IF-EXCLUDE-TRANSACTION.
180200181220      * ---------------------------------
180300181220           INITIALIZE MFAEXTRNP OF EXCLUDE-TRANS-REC.
180400181220           MOVE WS-EX-ACCOUNT-TYPE
180500181220             TO ACCOUNT-TYPE-CODE OF EXCLUDE-TRANS.
180600181220           MOVE WS-EX-NOM-ACCOUNT-TYPE
180700181220             TO NOMINEE-ACCOUNT-TYPE OF EXCLUDE-TRANS.
180800181220           MOVE WS-EX-TRANS-TYPE
180900181220             TO TRANS-TYPE-CODE OF EXCLUDE-TRANS.
181000181220           MOVE WS-EX-TRANS-ORIGIN
181100181220             TO TRANS-ORIGIN-CODE OF EXCLUDE-TRANS.
181200181220           MOVE WS-EX-REVERSAL-CODE
181300181220             TO REVERSAL-CODE OF EXCLUDE-TRANS.
181400181220110904     MOVE SPACES
181500181220110904       TO INVESTMENT-STRUCTURE-CODE OF EXCLUDE-TRANS.
181600210105180708     PERFORM READ-TRANSMISC.
181700181220
181800181220           READ EXCLUDE-TRANS
181900181220             INVALID KEY
182000181220      * RFS 110904 - START
182100181220            IF lc_GuarBenefitEligible = "Y"
182200181220            PERFORM GET-INVESTMENT-STRUCTURE-CODE
182300181220                   THRU GIS-EXIT
182400181220             IF lc_InvStructureCode = SPACE
182500181220                GO TO CIET-EXIT
182600181220             ELSE
182700181220                MOVE lc_InvStructureCode TO
182800181220                     INVESTMENT-STRUCTURE-CODE OF
182900181220                     EXCLUDE-TRANS-REC
183000181220              READ EXCLUDE-TRANS
183100181220                   INVALID KEY
183200181220                     GO TO CIET-EXIT
183300181220              END-READ
183400181220             END-IF
183500181220             ELSE
183600181220             GO TO CIET-EXIT
183700181220             END-IF
183800181220      * RFS 110904 - END
183900181220           END-READ.
184000181220
184100181220           IF ACCOUNT-ATTRIBUTE-CODE OF EXCLUDE-TRANS = " "
184200181220              MOVE "Y" TO WS-EXCLUDE-TRANS
184300181220              GO TO CIET-EXIT
184400181220           END-IF.
184500181220
184600181220           INITIALIZE MFAACCATP OF ACCOUNT-ATTRIBUTES-REC.
184700181220           MOVE WS-EX-ACCOUNT-NO
184800181220             TO ACCOUNT-NO OF ACCOUNT-ATTRIBUTES.
184900181220           MOVE ACCOUNT-ATTRIBUTE-CODE OF EXCLUDE-TRANS
185000181220             TO ACCOUNT-ATTRIBUTE-CODE OF ACCOUNT-ATTRIBUTES.
185100181220
185200181220           READ ACCOUNT-ATTRIBUTES
185300181220             INVALID KEY
185400181220                MOVE "Y" TO WS-EXCLUDE-TRANS
185500181220                GO TO CIET-EXIT
185600181220           END-READ.
185700181220       CIET-EXIT.
185800181220           EXIT.
185900181220      /
186000181220      *    RFS 110904 - START
186100181220       GET-INVESTMENT-STRUCTURE-CODE.
186200181220
186300181220            MOVE SPACES TO lc_InvStructureCode
186400181220           INITIALIZE MFAINVSXP OF INV-STRU-XREF-REC.
186500181220            MOVE WS-SQL-INVEST TO
186600181220                 INVESTMENT-CODE OF INV-STRU-XREF-REC.
186700181220            MOVE LOW-VALUES TO INVESTMENT-STRUCTURE-CODE OF
186800181220                 INV-STRU-XREF-REC.
186900181220            START INVESTMENT-STRUCTURE-XREF
187000181220            KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
187100181220               INVALID KEY
187200181220127401****  MOVE SPACES TO WS-SQL-INVEST
187300181220127401      MOVE SPACES TO LC_INVSTRUCTURECODE
187400181220            NOT INVALID
187500181220127401       PERFORM GET-SETPOL-INV-STRUCTURE
187600181220127401         UNTIL LC_INVSTRUCTURECODE NOT = SPACES
187700181220127401       If lc_InvStructureCode = HIGH-VALUES
187800181220127401          MOVE Spaces to lc_InvStructureCode
187900181220127401       End-If.
188000181220127401**    READ INVESTMENT-STRUCTURE-XREF NEXT RECORD
188100181220127401**    AT END
188200181220127401**    MOVE SPACES TO lc_InvStructureCode
188300181220127401**    NOT AT END
188400181220127401**    IF (CURR-INVESTMENT-CODE NOT =
188500181220127401**        INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF)
188600181220127401**        MOVE SPACES TO lc_InvStructureCode
188700181220127401**    ELSE
188800181220127401**        MOVE INVESTMENT-STRUCTURE-CODE OF
188900181220127401**             INV-STRU-XREF-REC TO
189000181220127401**             lc_InvStructureCode
189100181220127401**    END-IF
189200181220127401**    END-READ.
189300181220
189400181220       GIS-EXIT.
189500181220           EXIT.
189600181220
189700181220127401  GET-SETPOL-INV-STRUCTURE.
189800181220127401     READ INVESTMENT-STRUCTURE-XREF NEXT RECORD
189900181220127401     AT END
190000181220127401     MOVE HIGH-VALUES to lc_InvStructureCode
190100181220127401     NOT AT END
190200181220127401     IF (CURR-INVESTMENT-CODE NOT =
190300181220127401         INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF)
190400181220127401         MOVE HIGH-VALUES to lc_InvStructureCode
190500181220127401     ELSE
190600181220127401         MOVE INVESTMENT-STRUCTURE-CODE OF
190700181220127401              INV-STRU-XREF-REC TO
190800181220127401              LC_INVSTRUCTURECODE
190900181220127401         Move 0 to li_Count
191000181220127401         EXEC SQL
191100181220127401          Select coun(1)
191200181220127401            into :li_count
191300181220127401          From MFAFNCTP
191400181220127401          where Investment_Structure_Code = :LC_INVSTRUCTURECODE
191500181220127401            and FUNCTION_CODE          = "SETPOL"
191600181220127401         END-EXEC
191700181220127401         If li_Count = 0
191800181220127401            Move Spaces to LC_INVSTRUCTURECODE
191900181220127401         End-If
192000181220127401     END-IF
192100181220127401     END-READ.
192200181220
192300181220      * RFS 110904 - END
192400181220      /
192500181220       GET-INVESTMENT-INFO.
192600181220           MOVE SPACES TO WS-LOAD-STRUCTURE.
192700181220           MOVE WS-INVESTMENT-CODE
192800181220             TO INVESTMENT-CODE OF INVESTMENT.
192900181220
193000181220           READ INVESTMENT
193100181220                INVALID KEY
193200181220                MOVE "CAD" TO WS-INVEST-CURRENCY
193300181220                GO TO GII-EXIT
193400181220           END-READ.
193500181220
193600181220           MOVE CURRENCY-DDS   OF INVESTMENT   TO WS-INVEST-CURRENCY.
193700181220           MOVE LOAD-STRUCTURE OF INVESTMENT   TO WS-LOAD-STRUCTURE.
193800181221100590     MOVE INVESTMENT-STATUS-CODE OF INVESTMENT TO lc_InvStatus.
193900181220
194000181220       GII-EXIT.
194100181220           EXIT.
194200181220      * ---------------------------------
194300181220       GET-INVESTMENT-UNIT-PRICE.
194400181220      * ---------------------------------
194500181220APR14      EXEC SQL
194600181220APR14        SELECT COALESCE(ALLOW_TRADING, "Y")
194700181220APR14          INTO :WS-EXACT-TRADE-DATE
194800181220APR14          FROM MFABUSDAP
194900181220APR14         WHERE BUSINESS_DAY = :WS-PRC-TRADE-DATE
195000181220APR14      END-EXEC.
195100181220
195200181220           IF WS-EXACT-TRADE-DATE = "Y"
195300181220              GO TO GIUP-EXACT
195400181220           END-IF.
195500181220
195600181220           MOVE "OPEN INVPRCA" TO WS-SQLERR-STATEMENT.
195700181220           EXEC SQL
195800181220             OPEN INVPRCA
195900181220           END-EXEC.
196000181220
196100181220           IF SQLCODE = 0
196200181220              CONTINUE
196300181220           ELSE
196400181220              MOVE 0 TO WS-PRC-TRADE-DATE
196500181220                        WS-PRC-UNIT-PRICE
196600181220              GO TO GIUP-VALIDATION
196700181220           END-IF.
196800181220
196900181220           MOVE "FETCH INVPRCA" TO WS-SQLERR-STATEMENT.
197000181220           EXEC SQL
197100181220             FETCH NEXT FROM INVPRCA
197200181220              INTO :WS-PRC-TRADE-DATE,
197300181220                   :WS-PRC-UNIT-PRICE,
197400181220                   :WS-PRC-DST-FLAG
197500181220           END-EXEC.
197600181220
197700181220           IF SQLCODE = 0
197800181220              CONTINUE
197900181220           ELSE
198000181220              MOVE 0 TO WS-PRC-TRADE-DATE
198100181220                        WS-PRC-UNIT-PRICE
198200181220           END-IF.
198300181220
198400181220           MOVE "CLOSE INVPRCA" TO WS-SQLERR-STATEMENT.
198500181220           EXEC SQL
198600181220             CLOSE INVPRCA
198700181220           END-EXEC.
198800181220
198900181220           GO TO GIUP-VALIDATION.
199000181220
199100181220       GIUP-EXACT.
199200181220           MOVE "OPEN INVPRCB" TO WS-SQLERR-STATEMENT.
199300181220           EXEC SQL
199400181220             OPEN INVPRCB
199500181220           END-EXEC.
199600181220
199700181220           IF SQLCODE = 0
199800181220              CONTINUE
199900181220           ELSE
200000181220              MOVE 0 TO WS-PRC-TRADE-DATE
200100181220                        WS-PRC-UNIT-PRICE
200200181220              GO TO GIUP-VALIDATION
200300181220           END-IF.
200400181220
200500181220           MOVE "FETCH INVPRCB" TO WS-SQLERR-STATEMENT.
200600181220           EXEC SQL
200700181220             FETCH NEXT FROM INVPRCB
200800181220              INTO :WS-PRC-TRADE-DATE,
200900181220                   :WS-PRC-UNIT-PRICE,
201000181220                   :WS-PRC-DST-FLAG
201100181220           END-EXEC.
201200181220
201300181220           IF SQLCODE = 0
201400181220              CONTINUE
201500181220           ELSE
201600181220              MOVE 0 TO WS-PRC-TRADE-DATE
201700181220                        WS-PRC-UNIT-PRICE
201800181220           END-IF.
201900181220
202000181220           MOVE "CLOSE INVPRCB" TO WS-SQLERR-STATEMENT.
202100181220           EXEC SQL
202200181220             CLOSE INVPRCB
202300181220           END-EXEC.
202400181220
202500181220       GIUP-VALIDATION.
202600181220           IF WS-PRC-TRADE-DATE = 0
202700181220              MOVE "05"     TO WS-REJECTION-CODE
202800181220              MOVE "TRADE DATE:"
202900181220                            TO WS-MISC-INFO-1-NAME
203000181220              MOVE WS-PRC-TRADE-DATE
203100181220                            TO WS-MISC-INFO-1-DATE
203200181220              MOVE "NOT FOUND"
203300181220                            TO WS-MISC-INFO-1-NOTE
203400181220              PERFORM LOG-ERROR THRU LER-EXIT
203500181220              GO TO GIUP-EXIT
203600181220           END-IF.
203700181220
203800181220           IF WS-PRC-UNIT-PRICE = 0
203900181220              MOVE "05"       TO WS-REJECTION-CODE
204000181220              MOVE "TRADE DATE:"
204100181220                              TO WS-MISC-INFO-1-NAME
204200181220              MOVE WS-PRC-TRADE-DATE
204300181220                              TO WS-MISC-INFO-1-DATE
204400181220              MOVE "ZERO VALUE"
204500181220                              TO WS-MISC-INFO-1-NOTE
204600181220              PERFORM LOG-ERROR THRU LER-EXIT
204700181220              GO TO GIUP-EXIT
204800181220           END-IF.
204900181220       GIUP-EXIT.
205000181220           EXIT.
205100181220      /
205200181220       GET-EXCHANGE-RATE.
205300181220           MOVE WS-EXCH-TRADE-DATE
205400181220                             TO TRADE-DATE OF EXCHANGE-RATE-M.
205500181220           MOVE WS-EXCH-CURRENCY
205600181220                             TO CURRENCY-DDS OF EXCHANGE-RATE-M.
205700181220           MOVE PROG-EXCHANGE-RATE-TYPE
205800181220                             TO EXCHANGE-RATE-TYPE
205900181220                             OF EXCHANGE-RATE-M.
206000181220
206100181220           READ EXCHANGE-RATE-M
206200181220             INVALID KEY
206300181220               CONTINUE
206400181220             NOT INVALID
206500181220               GO TO GER-0100
206600181220           END-READ.
206700181220
206800181220           MOVE "06"       TO WS-REJECTION-CODE.
206900181220           MOVE "TRADE DATE:"
207000181220                           TO WS-MISC-INFO-1-NAME.
207100181220           MOVE WS-EXCH-TRADE-DATE
207200181220                           TO WS-MISC-INFO-1-DATE.
207300181220           MOVE "NOT FOUND"
207400181220                           TO WS-MISC-INFO-1-NOTE.
207500181220           PERFORM LOG-ERROR THRU LER-EXIT.
207600181220           GO TO GER-EXIT.
207700181220
207800181220       GER-0100.
207900181220           IF EXCHANGE-RATE OF EXCHANGE-RATE-M = ZEROS
208000181220             MOVE "06"       TO WS-REJECTION-CODE
208100181220             MOVE "TRADE DATE:"
208200181220                             TO WS-MISC-INFO-1-NAME
208300181220             MOVE WS-EXCH-TRADE-DATE
208400181220                             TO WS-MISC-INFO-1-DATE
208500181220             MOVE "ZERO VALUE"
208600181220                             TO WS-MISC-INFO-1-NOTE
208700181220             PERFORM LOG-ERROR THRU LER-EXIT
208800181220             GO TO GER-EXIT
208900181220           END-IF.
209000181220           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M TO WS-EXCH-RATE.
209100181220
209200181220       GER-EXIT.
209300181220           EXIT.
209400181220      /
209500181220       GET-EXCHANGE-RATE-2.
209600181220           INITIALIZE MFATREXRP OF TRANS-EXCHANGE-RATE-REC.
209700181220           MOVE WS-EXCH-PLACEMENT-DATE
209800181220                             TO PLACEMENT-DATE
209900181220                             OF TRANS-EXCHANGE-RATE.
210000181220           MOVE WS-EXCH-TRANS-NO
210100181220                             TO TRANS-NO
210200181220                             OF TRANS-EXCHANGE-RATE.
210300181220
210400181220           READ TRANS-EXCHANGE-RATE
210500181220             INVALID KEY
210600181220                PERFORM GET-EXCHANGE-RATE THRU GER-EXIT
210700181220             NOT INVALID KEY
210800181220                MOVE EXCHANGE-RATE OF TRANS-EXCHANGE-RATE
210900181220                     TO WS-EXCH-RATE
211000181220                GO TO GER2-EXIT
211100181220           END-READ.
211200181220       GER2-EXIT.
211300181220           EXIT.
211400181220      /
211500181220      * ---------------------------------
211600181220       DISPLAY-ERROR-INFO.
211700181220      * ---------------------------------
211800181220           DISPLAY "ROUTINE-NAME =  " WS-ROUTINE-NAME.
211900181220           DISPLAY "SQL STATEMENT = " WS-SQLERR-STATEMENT.
212000181220           DISPLAY "COMM-ACCOUNT-NO..." COMM-ACCOUNT-NO.
212100181220           DISPLAY "COMM-CONTRACT-NO.." COMM-CONTRACT-NO.
212200181220           DISPLAY "COMM-RESET-NUMBER..." COMM-RESET-NUMBER.
212300181220       DRI-EXIT.
212400181220           EXIT.
212500181220
212600181220      * ---------------------------------
212700181220       LOG-ERROR.
212800181220      * ---------------------------------
212900181220           INITIALIZE MFACTERRP OF CONTRACT-ERROR-LOG.
213000181220
213100181220           IF COMM-REJECTION-CODE = SPACES OR "00"
213200181220             MOVE WS-REJECTION-CODE TO COMM-REJECTION-CODE
213300181220           END-IF.
213400181220
213500181220           ACCEPT WS-SYSTIME-LONG FROM TIME.
213600181220           CALL "GETDAT" USING WS-SYSDATE-N.
213700181220
213800181220           MOVE WS-REJECTION-CODE
213900181220                             TO REJECTION-CODE OF CONTRACT-ERROR-LOG.
214000181220           MOVE INVESTOR-NO  OF ACCOUNT
214100181220                             TO INVESTOR-NO OF CONTRACT-ERROR-LOG.
214200181220           MOVE ACCOUNT-NO   OF ACCOUNT-CONTRACT-INV-RESET
214300181220                             TO ACCOUNT-NO OF CONTRACT-ERROR-LOG.
214400181220
214500181220           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-INV-RESET
214600181220                             TO CONTRACT-NO OF CONTRACT-ERROR-LOG.
214700181220           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
214800181220                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG.
214900181220           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
215000181220                             TO INVESTMENT-CODE
215100181220                             OF CONTRACT-ERROR-LOG.
215200181220
215300181220           MOVE COMM-CALLER-ID-CODE TO CALLER-ID-CODE
215400181220                             OF CONTRACT-ERROR-LOG.
215500181220           MOVE PROG-NAME    TO PROGRAM-ID-CODE
215600181220                             OF CONTRACT-ERROR-LOG.
215700181220           MOVE COMM-USER    TO AUDIT-USER OF CONTRACT-ERROR-LOG.
215800181220
215900181220           MOVE WS-MISC-INFO-AREA
216000181220                             TO MISC-INFO OF CONTRACT-ERROR-LOG.
216100181220           MOVE WS-SYSDATE-N TO AUDIT-DATE OF CONTRACT-ERROR-LOG.
216200181220           MOVE WS-SYSTIME-LONG-N
216300181220                             TO LOG-TIME OF CONTRACT-ERROR-LOG.
216400181220
216500181220           WRITE CONT-ERR-LOG-REC.
216600181220
216700181220           MOVE SPACES         TO WS-MISC-INFO-AREA.
216800181220
216900181220       LER-EXIT.
217000181220           EXIT.
217100181220      /
217200181220      * ---------------------------------
217300181220       INITIAL-LOGIC.
217400181220      * ---------------------------------
217500181220           MOVE SPACES       TO COMM-REJECTION-CODE.
217600181220           MOVE LOW-VALUES   TO CURR-CONTROLS
217700181220                                PREV-CONTROLS.
217800181220           INITIALIZE           WS-MISC-FIELDS
217900181220                                WS-MISC-INFO-AREA
218000181220                                WS-EXCLUDE-VARIABLES
218100181220                                WS-VARS-4ROUNDING
218200181220                                WS-LEVEL-88.
218300181220
218400181220           IF COMM-OPEN-FILES NOT = "Y" AND
218500181220              OPEN-FILES-ONCE NOT = "Y"
218600181220             GO TO INL-0010
218700181220           END-IF.
218800181220
218900181220           OPEN INPUT  ACCOUNT
219000181220                       EXCHANGE-RATE-M
219100181220                       TRANS-EXCHANGE-RATE
219200181220                       TRANS-CON-DTL
219300181220                       ACCOUNT-NOMINEE
219400181220                       ACCOUNT-ATTRIBUTES
219500181220                       EXCLUDE-TRANS
219600181220                       TRANS-GBV-TRANSFER
219700181220                       INVESTMENT
219800181220110904                 INVESTMENT-STRUCTURE-XREF
219900210108180708                 TRANS-MISC-DETAILS
220000210329180708                 TRANS-REDEM-DETAILS
220100181220                I-O    ACCOUNT-CONTRACT-INVESTMENT
220200181220                       ACCOUNT-CONTRACT-RESET
220300181220                       ACCOUNT-CONTRACT-INV-RESET
220400181220                       CONTRACT-ERROR-LOG
220500181220 80605                 INVESTOR-CHANGE-LOG
220600181220                       CONTRACT-CHANGE-LOG.
220700181220
220800181220           INITIALIZE  WS-MFAPRCDTP.
220900181220           MOVE "N"    TO OPEN-FILES-ONCE.
221000181220           PERFORM     SQL-DECLARE-RTN  THRU SDR-EXIT.
221100181220
221200181220       INL-0010.
221300181220           EXEC SQL
221400181220              WHENEVER SQLERROR CONTINUE
221500181220           END-EXEC.
221600181220
221700181220           EXEC SQL
221800181220              WHENEVER NOT FOUND CONTINUE
221900181220           END-EXEC.
222000181220
222100181220           IF UNITRAX-BASE-CURRENCY   NOT = SPACES AND
222200181220              PROG-EXCHANGE-RATE-TYPE NOT = SPACES
222300181220             GO TO INL-EXIT
222400181220           END-IF.
222500181220
222600181220           EXEC SQL
222700181220             SELECT COALESCE(CURRENCY, "CAD")
222800181220               INTO :UNITRAX-BASE-CURRENCY
222900181220               FROM MFACURP
223000181220              WHERE BASE_CURRENCY = "Y"
223100181220           END-EXEC.
223200181220
223300181220           IF SQLCODE = 100
223400181220              MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
223500181220           END-IF.
223600181220
223700181220           EXEC SQL
223800181220             SELECT COALESCE(EXCHANGE_RATE_TYPE, " ")
223900181220               INTO :PROG-EXCHANGE-RATE-TYPE
224000181220               FROM MFAPRGERP
224100181220              WHERE PROGRAM_CODE = :PROG-ID-CODE
224200181220                AND PROGRAM_ACTION = "DEFAULT"
224300181220           END-EXEC.
224400181220
224500181220           IF SQLCODE = 100 OR PROG-EXCHANGE-RATE-TYPE = " "
224600181220              MOVE "06"       TO COMM-REJECTION-CODE
224700181220              MOVE HIGH-VALUES TO CURR-CONTROLS
224800181220           END-IF.
224900181220           IF WS-LAST-PROCESS-DATE = 0
225000181220              ACCEPT WS-MFAPRCDTP FROM WS-DATA-AREA-1 FOR "MFAPRCDTP"
225100181220           END-IF.
225200181220
225300181220           ACCEPT WS-SYSTIME-LONG FROM TIME.
225400181220           CALL "GETDAT" USING WS-SYSDATE-N.
225500181220139654     ACCEPT li_SysDate FROM DATE YYYYMMDD.
225600181220       INL-EXIT.
225700181220           EXIT.
225800181220      /
225900181220      * ---------------------------------
226000181220       UPDATE-CONTRACT-RESET.
226100181220      * ---------------------------------
226200181220      * Skip update data if error
226300181220           IF COMM-REJECTION-CODE NOT = " " AND "00"
226400181220             GO TO UCR-0100
226500181220           END-IF.
226600181220
226700181220      * Skip update if it has already been reset
226800181220           IF RESET-PROCESSED OF ACCOUNT-CONTRACT-RESET = "Y"
226900181220             GO TO UCR-0100
227000181220           END-IF.
227100181220
22720018122080605  UCR-0050-WriteChgLog.
227300181220      * Set contract-change-log    record
227400181220           MOVE 0 TO WS-INSPECT-CNT.
227500181220           MOVE SPACES TO WS-RESET-NUMBER-C.
227600181220           MOVE COMM-RESET-NUMBER
227700181220             TO WS-RESET-NUMBER-C.
227800181220           INSPECT WS-RESET-NUMBER-C
227900181220                   TALLYING WS-INSPECT-CNT  FOR LEADING "0".
228000181220           MOVE WS-RESET-NUMBER-C(WS-INSPECT-CNT + 1:)
228100181220             TO WS-RESET-NUMBER-C.
228200181220           INITIALIZE MFACTCLP OF CONTRACT-CHANGE-LOG.
228300181220           MOVE INVESTOR-NO  OF ACCOUNT
228400181220             TO INVESTOR-NO  OF CONTRACT-CHANGE-LOG.
228500181220           MOVE ACCOUNT-NO   OF ACCOUNT
228600181220             TO ACCOUNT-NO   OF CONTRACT-CHANGE-LOG.
228700181220           MOVE WS-SYSDATE-N
228800181220             TO AUDIT-DATE   OF CONTRACT-CHANGE-LOG.
228900181220           MOVE WS-SYSTIME-LONG-N
229000181220             TO LOG-TIME     OF CONTRACT-CHANGE-LOG.
229100181220           MOVE "SEGGDVRST"
229200181220             TO AUDIT-USER   OF CONTRACT-CHANGE-LOG.
229300181220           MOVE "ACCCDRST"
229400181220             TO SCREEN-CODE  OF CONTRACT-CHANGE-LOG.
229500181220           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-RESET
229600181220             TO CONTRACT-NO  OF CONTRACT-CHANGE-LOG.
229700181220           STRING "GDV RESET # " DELIMITED BY SIZE
229800181220                  WS-RESET-NUMBER-C  DELIMITED BY SIZE
229900181220             INTO CHANGE-CATEGORY OF CONTRACT-CHANGE-LOG
230000181220      *    57388 begin
230100181220      * RFS106211- Start
230200181220      *    IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "A"
230300181220           IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "A"  OR "T"
230400181220      * RFS106211- End
230500181220             MOVE "SEGAUTORST"
230600181220               TO AUDIT-USER   OF CONTRACT-CHANGE-LOG
230700181220             STRING "AUTO RESET # " DELIMITED BY SIZE
230800181220                    WS-RESET-NUMBER-C  DELIMITED BY SIZE
230900181220               INTO CHANGE-CATEGORY OF CONTRACT-CHANGE-LOG
231000181220           END-IF.
23110018122080605      IF lb_GDVAWDchanged_Yes
231200181220  |           MOVE "ACCCGB" TO SCREEN-CODE OF CONTRACT-CHANGE-LOG
231300181220  |          MOVE "GDV AWD Carr.Over"
231400181220  |             TO CHANGE-CATEGORY OF CONTRACT-CHANGE-LOG
23150018122080605      END-IF.
231600181220      *    57388 end
231700181220           WRITE CONTRACT-CHANGE-LOG-REC.
231800181220
231900181220      * Set Account-Contract-Reset record
23200018122080605  UCR-0060.
232100181220
23220018122080605      PERFORM GET-GDV-CARRIER-OVER.
232300181220
232400181220           MOVE "Y"          TO RESET-PROCESSED
232500181220                             OF ACCOUNT-CONTRACT-RESET.
232600181220           MOVE COMM-PROCESS-DATE                                       RFS8712
232700181220                             TO RESET-PROCESSED-DATE
232800181220                             OF ACCOUNT-CONTRACT-RESET.
232900181220      * 57388 begins
23300018122075247 *    MOVE COMM-PROCESS-DATE
23310018122075247 *                      TO LAST-RESET-DATE
23320018122075247 *                      OF ACCOUNT-CONTRACT-RESET.
233300181220      * 57388 ends
233400181220
233500181220       UCR-0100.
233600181220           REWRITE ACC-CON-RESET-REC.
233700181220           MOVE HIGH-VALUES  TO CURR-CONTROLS.
233800181220
233900181220      * 96705 changed the opeartor from >= to >
234000181220
23410018122080605      IF WS-NEW-GDV-TOTAL > WS-OLD-GDV-TOTAL
23420018122080605         PERFORM UPDATE-ACCOUNT-CONTRACT
23430018122080605      END-IF.
234400181220
234500181220           IF COMM-SPMODULE = 'Y'
234600181220134848*      IF COMM-PRODUCT-RESET  = lnc_Y OR
234700181220134848       IF COMM-PRODUCT-RESET  = SPACES
234800181220                IF WS-NEW-GDV-TOTAL < WS-OLD-GDV-TOTAL
234900181220                   PERFORM MOVE-OLD-TO-NEW THRU MOTN-EXIT
235000181220                 END-IF
235100181220134848       END-IF
235200181220      *RFS134848- START
235300181220           IF COMM-PRODUCT-RESET  = lnc_N
235400181220                 PERFORM MOVE-OLD-TO-NEW THRU MOTN-EXIT
235500181220           END-IF
235600181220      *RFS134848- END
235700181220           END-IF.
235800181220       UCR-EXIT.
235900181220           EXIT.
236000181220
236100181220      *RFS80605 - START
236200181220       GET-GDV-CARRIER-OVER.
236300181220           INITIALIZE WS-GDV-AWD-CARRIED-OVER.
236400181220           EXEC SQL
236500181220             SELECT GDV_AWD_CARRIED_OVER
236600181220               INTO :WS-GDV-AWD-CARRIED-OVER
236700181220               FROM MFAACCONP
236800181220               WHERE ACCOUNT_NO  = :CURR-ACCOUNT-NO AND
236900181220                     CONTRACT_NO = :CURR-CONTRACT-NO
237000181220           END-EXEC.
237100181220
237200181220           IF SQLCODE = 0
237300181220              CONTINUE
237400181220           ELSE
237500181220              SET WS-ERR-10  TO TRUE
237600181220              PERFORM DSP-ERROR
237700181220           END-IF.
237800181220
237900181220           MOVE WS-GDV-AWD-CARRIED-OVER TO AWD-CARRIED-OVER OF
238000181220                                           ACCOUNT-CONTRACT-RESET.
238100181220
238200181220      *-------------------------
238300181220       Create_GDVAWDChg_AuditLog.
238400181220      *----*
238500181220           SET lb_GDVAWDchanged_Yes TO TRUE.
238600181220           PERFORM UCR-0050-WriteChgLog.
238700181220 80605     PERFORM Write_investorchglog.
238800181220           SET lb_GDVAWDchanged_No TO TRUE.
238900181220
239000181220       UPDATE-ACCOUNT-CONTRACT.
239100181220           EXEC SQL
239200181220              UPDATE MFAACCONP
239300181220              SET GDV_AWD_CARRIED_OVER  = 0,
239400181220              OLD_GDV_AWD_CARRIED_OVER  = :WS-GDV-AWD-CARRIED-OVER
239500181220              WHERE
239600181220              ACCOUNT_NO   = :CURR-ACCOUNT-NO AND
239700181220              CONTRACT_NO  = :CURR-CONTRACT-NO
239800181220           END-EXEC
239900181220
240000181220           IF SQLCODE = 0
240100181220              If Ws-gdv-awd-carried-over Not = 0
240200181220                 PERFORM Create_GDVAWDChg_AuditLog
240300181220              End-if
240400181220           ELSE
240500181220              SET WS-ERR-11  TO TRUE
240600181220              PERFORM DSP-ERROR
240700181220           END-IF.
240800181220
240900181220      * Error handling para (DSP-ERROR).
241000181220           COPY CPYSQLRTN.
241100181220      *RFS80605 - END
241200181220
241300181220      * RFS80605.11 - START
241400181220      *-------------------------
241500181220       Write_investorchglog.
241600181220      *----*
241700181220      * Set investor-change-log    record
241800181220           MOVE 0 TO WS-INSPECT-CNT.
241900181220           MOVE SPACES TO WS-RESET-NUMBER-C.
242000181220           MOVE COMM-RESET-NUMBER
242100181220             TO WS-RESET-NUMBER-C.
242200181220           INSPECT WS-RESET-NUMBER-C
242300181220                   TALLYING WS-INSPECT-CNT  FOR LEADING "0".
242400181220           MOVE WS-RESET-NUMBER-C(WS-INSPECT-CNT + 1:)
242500181220             TO WS-RESET-NUMBER-C.
242600181220           INITIALIZE MFAIVRCLP OF INVESTOR-CHANGE-LOG.
242700181220           MOVE INVESTOR-NO  OF ACCOUNT
242800181220             TO INVESTOR-NO  OF INVESTOR-CHANGE-LOG-REC
242900181220           MOVE ACCOUNT-NO   OF ACCOUNT
243000181220             TO ACCOUNT-NO   OF INVESTOR-CHANGE-LOG-REC
243100181220           MOVE SPACES TO INVESTMENT-CODE
243200181220                             OF INVESTOR-CHANGE-LOG-REC
243300181220           MOVE WS-SYSDATE-N
243400181220             TO AUDIT-DATE   OF INVESTOR-CHANGE-LOG-REC
243500181220           MOVE WS-SYSTIME-LONG-N
243600181220             TO LOG-TIME     OF INVESTOR-CHANGE-LOG-REC
243700181220           MOVE "SEGGDVRST"
243800181220             TO AUDIT-USER   OF INVESTOR-CHANGE-LOG-REC
243900181220           MOVE "ACCCDRST"
244000181220             TO SCREEN-CODE  OF INVESTOR-CHANGE-LOG-REC
244100181220           STRING "GDV RESET # " DELIMITED BY SIZE
244200181220                  WS-RESET-NUMBER-C  DELIMITED BY SIZE
244300181220             INTO CHANGE-CATEGORY OF INVESTOR-CHANGE-LOG-REC
244400181220      *RFS106211- Start
244500181220      *    IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "A"
244600181220           IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "A" OR "T"
244700181220      *RFS106211- End
244800181220             MOVE "SEGAUTORST"
244900181220               TO AUDIT-USER OF INVESTOR-CHANGE-LOG-REC
245000181220             STRING "AUTO RESET # " DELIMITED BY SIZE
245100181220                    WS-RESET-NUMBER-C  DELIMITED BY SIZE
245200181220               INTO CHANGE-CATEGORY OF INVESTOR-CHANGE-LOG-REC
245300181220           END-IF.
245400181220           IF lb_GDVAWDchanged_Yes
245500181220             MOVE "ACCCGB" TO SCREEN-CODE OF INVESTOR-CHANGE-LOG
245600181220             MOVE "GDV AWD Carr.Over"
245700181220                TO CHANGE-CATEGORY OF INVESTOR-CHANGE-LOG-REC
245800181220           END-IF.
245900181220           WRITE INVESTOR-CHANGE-LOG-REC.
246000181220      * RFS80605.11 - END
246100181220
246200181220      * ---------------------------------
246300181220       MOVE-OLD-TO-NEW.
246400181220      * ---------------------------------
246500181220           MOVE COMM-ACCOUNT-NO
246600181220                             TO ACCOUNT-NO
246700181220                             OF ACCOUNT-CONTRACT-INV-RESET.
246800181220           MOVE COMM-CONTRACT-NO
246900181220                             TO CONTRACT-NO
247000181220                             OF ACCOUNT-CONTRACT-INV-RESET.
247100181220           MOVE COMM-RESET-NUMBER
247200181220                             TO RESET-NUMBER
247300181220                             OF ACCOUNT-CONTRACT-INV-RESET.
247400181220           MOVE SPACES TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
247500181220
247600181220           START ACCOUNT-CONTRACT-INV-RESET WITH NO LOCK
247700181220             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
247800181220             INVALID KEY
247900181220               GO TO MOTN-EXIT
248000181220           END-START.
248100181220
248200181220       MOTN-0010.
248300181220
248400181220           READ ACCOUNT-CONTRACT-INV-RESET NEXT RECORD WITH NO LOCK
248500181220           AT END
248600181220           GO TO MOTN-EXIT.
248700181220
248800181220           IF ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
248900181220                            COMM-ACCOUNT-NO
249000181220           OR CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
249100181220                             COMM-CONTRACT-NO
249200181220           OR RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET NOT =
249300181220                              COMM-RESET-NUMBER
249400181220             GO TO MOTN-EXIT
249500181220           END-IF.
249600181220
249700181220           MOVE OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
249800181220             TO NEW-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET.
249900181220
250000181220           MOVE OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INV-RESET
250100181220             TO NEW-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INV-RESET.
250200181220
250300181220           REWRITE ACC-CON-INV-RESET-REC.
250400181220
250500181220           MOVE COMM-ACCOUNT-NO
250600181220                  TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
250700181220           MOVE COMM-CONTRACT-NO
250800181220                  TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
250900181220           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
251000181220             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
251100181220
251200181220           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK.
251300181220
251400181220           MOVE OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
251500181220                             TO GUAR-DEATH-VALUE
251600181220                             OF ACCOUNT-CONTRACT-INVESTMENT.
251700181220           MOVE OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INV-RESET
251800181220                             TO GUAR-DEATH-VALUE-CUR
251900181220                             OF ACCOUNT-CONTRACT-INVESTMENT.
252000181220
252100181220           REWRITE ACC-CON-INV-REC.
252200181220
252300181220           GO TO MOTN-0010.
252400181220
252500181220       MOTN-EXIT.
252600181220           EXIT.
252700181220      * RFS139654 - Start
252800181220
252900181220        GetGDVTrackingRule.
253000181220
253100181220           MOVE CURR-ACCOUNT-NO  TO  li_Account_No.
253200181220           MOVE CURR-CONTRACT-NO TO  li_Contract_No.
253300181220
253400181220           INITIALIZE lc_GdvTrackRule.
253500181220
253600181220           PERFORM GetAccountAttributes.
253700181220           PERFORM GetGuarSchedCode.
253800181220
253900181220           EXEC SQL
254000181220             SELECT COALESCE(Gdv_Tracking_Rule, " ")
254100181220               INTO :lc_GdvTrackRule
254200181220             FROM Mfagdthvp
254300181220             WHERE Guar_Death_Sched_Code = :lc_GuarDthSchedCode    AND
254400181220                   Start_Date <= :li_StartDate                     AND
254500181220                   End_Date   >= :li_StartDate                     AND
254600181220                   Account_Type_Code = :lc_AccountTypeCode         AND
254700181220                   Age_Threshold     > :li_deathAge
254800181220              ORDER BY Age_Threshold
254900181220              FETCH FIRST ROW ONLY
255000181220           END-EXEC.
255100181220
255200181220      * ---------------------------------
255300181220       GetAccountAttributes.
255400181220      * ---------------------------------
255500181220           EXEC SQL
255600181220             SELECT COALESCE(Acconp.Start_Date, 0),
255700181220                    COALESCE(Accntp.Account_Type_Code, :lnc_Spaces),
255800181220                    COALESCE(Accnnp.Date_Of_Birth, 0),
255900181220                    COALESCE(Accnnp.Date_Of_Death, 0)
256000181220               INTO :li_StartDate,
256100181220                    :lc_AccountTypeCode,
256200181220                    :li_AnnuitantDateOfBirth,
256300181220                    :li_dod
256400181220               FROM Mfaacconp Acconp
256500181220                    INNER JOIN Mfaaccntp Accntp ON
256600181220                    Acconp.Account_No = Accntp.Account_No
256700181220                    INNER JOIN Mfaacctyp Acctyp ON
256800181220                    Accntp.Account_Type_Code = Acctyp.Account_Type_Code
256900181220                    LEFT OUTER JOIN Mfaaccanp Accanp ON
257000181220                    Accanp.Account_No  = :li_Account_No            AND
257100181220                    Accanp.Contract_No = :li_Contract_No           AND
257200181220                    Accanp.Annuitant_Type_Code = :lnc_Primary
257300181220                    LEFT OUTER JOIN Mfaaccnnp Accnnp ON
257400181220                    Accnnp.Account_No = Accanp.Account_No          AND
257500181220                    Accnnp.Annuitant_Status = :lnc_Active          AND
257600181220                    Accnnp.Annuitant_Seq_No = Accanp.Annuitant_Seq_No
257700181220              WHERE Acconp.Account_No  = :li_Account_No   AND
257800181220                    Acconp.Contract_No = :li_Contract_No
257900181220              FETCH FIRST ROW ONLY
258000181220           END-EXEC.
258100181220
258200181220           PERFORM Get-YoungerAnnuitant-DOB.
258300181220           IF pb_RetriveYes
258400181220              COMPUTE li_AnnuitantDateOfBirth = pi_DateOfBirth
258500181220           END-IF.
258600181220
258700181220           INITIALIZE li_AnnuitantAge.
258800181220
258900181220           INITIALIZE li_deathAge.
259000181220
259100181220           IF li_AnnuitantDateOfBirth NOT = 0
259200181220
259300181220             COMPUTE li_AnnuitantAge =
259400181220                  (li_SysDate - li_AnnuitantDateOfBirth) / 10000
259500181220             IF li_dod = 0
259600181220                MOVE li_AnnuitantAge    TO li_deathAge
259700181220             ELSE
259800181220                COMPUTE li_deathAge     =
259900181220                  (li_dod     - li_AnnuitantDateOfBirth) / 10000
260000181220             END-IF
260100181220           END-IF.
260200181220
260300181220      *-------------------------
260400181220       Get-YoungerAnnuitant-DOB.
260500181220      *-------------------------
260600181220           INITIALIZE pc_AnnuitFlag,       pi_AnnuitAccountNo,
260700181220                      pi_AnnuitContractNo, pi_AnnSequenceNo,
260800181220                      pc_AnnuitantStatus,  pi_DateOfBirth
260900181220                      pc_FirstName,        pc_LastName,
261000181220                      pc_AnnuitReturnCode.
261100181220
261200181220           SET pb_YoungerAnnuit TO TRUE.
261300181220           COMPUTE pi_AnnuitAccountNo  = li_Account_No.
261400181220           CALL "FXACCANUIT" USING pc_AnnuitFlag,
261500181220                                   pi_AnnuitAccountNo,
261600181220                                   pi_AnnuitContractNo,
261700181220                                   pi_AnnSequenceNo,
261800181220                                   pc_AnnuitantStatus,
261900181220                                   pi_DateOfBirth,
262000181220                                   pc_FirstName,
262100181220                                   pc_LastName,
262200181220                                   pi_socialInsuranceNo,
262300181220                                   pc_sex,
262400181220                                   pc_AnnuitReturnCode.
262500181220
262600181220      * ---------------------------------
262700181220       GetGuarSchedCode.
262800181220      * ---------------------------------
262900181220           EXEC SQL
263000181220             SELECT COALESCE(Invsgp.Guar_Death_Sched_Code, :lnc_Spaces)
263100181220             INTO :lc_GuarDthSchedCode
263200181220             FROM Mfaacccip Acccip
263300181220             INNER JOIN Mfainvsgp Invsgp
263400181220             ON   Invsgp.Investment_Code = Acccip.Investment_Code
263500181220             WHERE Acccip.Account_No  = :li_Account_No            AND
263600181220                   Acccip.Contract_No = :li_Contract_No
263700181220             FETCH FIRST ROW ONLY
263800181220           END-EXEC.
263900181220
264000181220      * RFS139654 - End
264100210105
264200210105      * RFS180708 - Starts
264300210105
264400210105       READ-TRANSMISC.
264500210105           MOVE SPACES            TO TRANS-SUB-TYPE OF EXCLUDE-TRANS.
264600210105           INITIALIZE MFATRNMSCP  OF TRANS-MISC-DETAILS-REC.
264700210105           MOVE PLACEMENT-DATE    OF TRANS-CON-DTL TO
264800210105                PLACEMENT-DATE    OF TRANS-MISC-DETAILS.
264900210105           MOVE TRANS-NO OF TRANS-CON-DTL  TO
265000210105                TRANS-NO OF TRANS-MISC-DETAILS.
265100210105           READ TRANS-MISC-DETAILS
265200210105               INVALID KEY
265300210105                 MOVE SPACES      TO TRANS-SUB-TYPE OF EXCLUDE-TRANS
265400210105               NOT INVALID KEY
265500210105                 MOVE TRANS-SUB-TYPE OF TRANS-MISC-DETAILS TO
265600210105                      TRANS-SUB-TYPE OF EXCLUDE-TRANS
265700210105           END-READ.
265800210105       READ-TRANSMISC-EXIT.
265900210105           EXIT.
266000210105
266100210105      * RFS180708 - End
