000100180816      * %ATTR TGTRLS(*CURRENT) DBGVIEW(*SOURCE)
000200121217       IDENTIFICATION DIVISION.
000300180816       PROGRAM-ID.    SEGMSTEXT.
000400121217       AUTHOR.        DEEPIKA A.
000500121217       INSTALLATION.  L & T FINANCIAL SERVICES TECHNOLOGY INC.
000600121217       DATE-WRITTEN.  OCTOBER 2012.
000700170912       DATE-COMPILED.
000800121217      *****************************************************************
000900121217      *    DESCRIPTION    : THIS PROGRAM CREATES THE RESERVE EXTRACT  *
001000201019      *                     FILE.                                     *
001100121217      *    RFS-NUMBER     : RFS 110949                                *
001200121217      *    CALLED BY      : JOBSEGCMT and JOBSEGCAH                   *
001300121217      *    PARAMETERS     : NONE                                      *
001400121217      *    LINKED MODULES : FXSEGMATVA                                *
001500121217      *                     FXSUMAWDT                                 *
001600121217      *    CALLED OBJECTS : LINKED MODULES.                           *
001700200316      *****************************************************************
001800201019      *    C H A N G E   H I S T O R Y                                *
001900121217      *****************************************************************
002000200219      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE             *
002100121217      *****************************************************************
002200121217      * DEEPIKA A  *  2012/10/21  * RFS110949 - PROGRAM TO CREATE     *
002300121217      *            *              * RESERVE EXTRACT FILE              *
002400130220      * Ganbold L  *  2013/02/20  * RFS119993 - Recompile MFAACCNNP   *
002500130503      * L Martin   *  2013/05/03  * RFS122636 - Define Account No as  *
002600130503      *            *              * numeric so not stored as quotes   *
002700130624      * Nagamani S * 2013/04/22   * RFS122007- Recompile for MFAGDTHCSP*
002800130624      * Callista N * 2013/05/10   * RFS108944 - Recompile.             *
002900130603      * L Martin   *  2013/05/31  * RFS123699 - Define Contract No as *
003000130603      *            *              * numeric so not stored as quotes   *
003100130605      * Michael Fan*  2013/06/05  * RFS124000 - Populate Dealer, Rep  *
003200130605      *            *              * and branch code which currently.  *
003300130605      *            *              * For dealer and Rep, populate the  *
003400130605      *            *              * first active dealer/rep from      *
003500130605      *            *              * account dealer rep split file     *
003600130605      *            *              * based on current processing date. *
003700130605      *            *              * If no active dealer rep found from*
003800130605      *            *              * dealer rep split file, use the    *
003900130605      *            *              * dealer rep from the account that  *
004000130605      *            *              * is the service agent.  Branch code*
004100130605      *            *              * will be populated based on the    *
004200130605      *            *              * dealer code selected.             *
004300130715      * TamilSelvi * 2013/07/15   * RFS110904 - Recompile for MFAACCONP
004400130830      * Andy Chan  * 2013/08/30   * RFS127401 - Recompile for CPFXSGMTVA
004500131016      * Sairam     * 2013/09/13   * RFS127038 - Re-compile
004600131016      * Deepika    * 2013/09/18   * RFS121426 - Recompile.
004700140122      * Thilaga K   * 2014/01/21 * RFS133150 - Recompile for MFATRCODP
004800140312      * Abhisek M   * 2014/03/12 * RFS132733 - Recompile
004900140313      * Thilaga K  * 2014/02/18   * RFS132733 - Recompile for MFAGDTHVP
005000140403      * Arthy K    * 2014/04/03   * RFS134936 - Recompile for MFAACCONP
005100140507      * Thilaga K  * 2014/05/07   * RFS134936 - Recompile for MFAACCNNP
005200140623      * Manjusha V * 2014/04/01   * RFS129902 - Recompile for CPGLWBRULE
005300140605      * TamilSelvi * 2014/06/03   * RFS137220 - Recompile for MFAGDTHCS
005400140826      * Nagamnai S * 2014/08/13   * RFS139007 - Recompile for CPGLWBRULE
005500150512      * Thilaga K  * 2015/05/12   * RFS145136 - Recompile for MFAACCNNP
005600160615      * Richard S. * 2016/03/09   * RFS157138 - performance tuning     *
005700180709      * Digvijay S * 2018/07/09   * RFS179061 - SEGCONS EXTRACT -
005800180709      *            *              * Additon of new fields
005900200219      * Kirthigaa S* 2020/02/20   * RFS185473 -Addition of new Fields  *
006000200219      *                           *   -SEGCONS  Extract                *
006100200330      * Chaya SP   *  2020/03/25  * RFS185170 - Recompile for MFAGDTHCSP *
006200200619      * Mayilsamy D*  2020/04/21  * RFS185774 - Recompile for MFAIVRHDP*
006300200615      * Thilaga K  * 2020/06/15   * RFS1101532- New fields extracted at*
006400200615      *            *              * incorrect positions                *
006500200706      * Ashwini B  * 2020/06/25   * RFS184676 - Recompile for MFAGDTHVP*
006600200706      * CHAYA SP   * 2020/07/06   * RFS185172 - Recompile for MFAACCONP*
006700200712      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFAGDTHCSP
006800200720      *                           * MFAGDTHVP and MFATRCODP
006900200721      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
007000201019      * RAJA N     * 2020/10/14   * RFS1104082- 3rd Annuitant's Gender
007100201222      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
007200210217      * Kavin      * 2021/02/17   * RFS186290 - Recompile only
007300210415      * Rajesh     * 2021/02/05   * RFS187018 - Recompile for MFAIVRHDP*
007400210416      * Kavin      * 2021/04/16   * RFS186584 - Adding new fields
007500210416      *            *              * into SEGCONS report
007600210823      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
007700210823      * M K SINDHU * 2021/07/13   * RFS186771 - RECOMPILE MFAACRIFP
007800210823      *                           * AND MFAACLIF
007900210815      * Kavin K    * 2021/08/16   * RFS1118798 - Adding join clause
008000210815      *            *              * to fetch House hold details
008100210823      * Niranjan   * 2021/08/17   * RFS1118460 - Retrieve info from    *
008200210823      *            *              * Account level GLWB if the Account  *
008300210823      *            *              * Guarantees Tracking is set to "Y"  *
008301211013      * Mayilsamy D* 2021/08/28   * RFS187441 - Recompile for MFAIVRHHP*
008302211013      * Kavin K    * 2021/08/09   * RFS187471 - Recompile for MFAGDTHVP
008400211013      * Rajesh R   * 2021/09/17   * RFS187775 - Recompile for MFAIVRHDP*
008500210914      * Sasikumar B* 2021/09/14   * RFS187570 - Adding additional fields
008600210914      *            *              * into SEGCONS report
008700200615      ******************************************************************
008800121217
008900200306       ENVIRONMENT DIVISION.
009000121217       CONFIGURATION SECTION.
009100121217       SOURCE-COMPUTER. IBM-AS400.
009200121217       OBJECT-COMPUTER. IBM-AS400.
009300121217       SPECIAL-NAMES. DATA-AREA IS WS-DTAARA
009400210823      *RFS1118460 Starts
009500210823                      DATA-AREA IS WS-DTAARA-MFASEGPARM
009600210823      *RFS1118460 Ends
009700210914187570                DATA-AREA IS WS-DTAARA-MFAMGFEEPM
009800210419186584                DATA-AREA IS WS-DTAARA-MFASYSPARM.
009900160615157138*    LINKAGE TYPE IS PROCEDURE FOR "FXSEGMATVA"
010000160615157138*    LINKAGE TYPE IS PROCEDURE FOR "FXSUMAWDT".
010100210524186584     LINKAGE TYPE IS PROCEDURE FOR "GETTOTFEE"
010200210524186584     LINKAGE TYPE IS PROCEDURE FOR "FXCHKBELG".
010300121217
010400121217       INPUT-OUTPUT SECTION.
010500121217       FILE-CONTROL.
010600121217
010700121217       DATA DIVISION.
010800121217       FILE SECTION.
010900121217
011000121217      * ---------------------------------
011100121217       WORKING-STORAGE SECTION.
011200121217      * ---------------------------------
011300121217
011400121217          COPY CPYSQLFLD
011500121217               REPLACING == "CURRENT_PROGRAM" == BY == "SEGMSVEXT" ==.
011600121217
011700121217           EXEC SQL
011800121217             INCLUDE SQLCA
011900121217           END-EXEC.
012000121217
012100121217           EXEC SQL
012200121217             INCLUDE SQLDA
012300121217           END-EXEC.
012400121217
012500121217      * Copybooks - Begin
012600121217
012700121217      * Copybook for Performance and Statistics program (FxPfSts)
012800121217       COPY CPPFSTS.
012900121217      * Copybooks for the variables for the common modules
013000121217       COPY CPDROPTB.
013100121217      * Copybook TO get data from Process-Date Data Area
013200121217       COPY CPPRCDTP.
013300121217      * For FXSEGMATVA
013400121217       COPY CPFXSGMTVA.
013500121217      * For FXGLWVBVLD
013600121217       COPY CPYGLWBVLD.
013700200304      * RFS185473  - Starts
013800200219      * For FXSCEDTAL1
013900200219       COPY  CPSCEDTAL1.
014000200304      * RFS185473  - Ends
014100210914      * RFS187570 Starts
014200210914      * For MGFEEP-MGMT-FEE-PARM
014300210914       COPY CPMGFEEP.
014400210914      * RFS187570 Ends
014500121217      * Copybooks - End
014600121217
014700121217      * Error Codes, Uniquely Identify where the error happened
014800121217       01  WS-ERR-CODE                  PIC  X(02)  VALUE SPACES.
014900121217         88  lncc_Err10                             VALUE "10".
015000121217         88  lncc_Err11                             VALUE "11".
015100121217         88  lncc_Err12                             VALUE "12".
015200121217         88  lncc_Err14                             VALUE "14".
015300180719      *RFS179061 - Starts
015400180719         88  lncc_Err15                             VALUE "15".
015500180719         88  lncc_Err16                             VALUE "16".
015600180719         88  lncc_Err17                             VALUE "17".
015700180719         88  lncc_Err18                             VALUE "18".
015800180719      *RFS179061 - Ends
015900200302      *RFS185473 - Start
016000200302         88  lncc_Err19                             VALUE "19".
016100200302         88  lncc_Err20                             VALUE "20".
016200200310         88  lncc_Err21                             VALUE "21".
016300200302      *RFS185473 - Ends
016400210419      *RFS186584 - Starts
016500210419         88  lncc_Err22                             VALUE "22".
016600210506         88  lncc_Err23                             VALUE "23".
016700210506         88  lncc_Err24                             VALUE "24".
016800210506         88  lncc_Err25                             VALUE "25".
016900210506         88  lncc_Err26                             VALUE "26".
017000210506         88  lncc_Err27                             VALUE "27".
017100210506         88  lncc_Err28                             VALUE "28".
017200210524         88  lncc_Err29                             VALUE "29".
017300210524         88  lncc_Err30                             VALUE "30".
017400210526         88  lncc_Err31                             VALUE "31".
017500210526         88  lncc_Err32                             VALUE "32".
017600210601         88  lncc_Err33                             VALUE "33".
017700210419      *RFS186584 - End
017800210914187570   88  lncc_Err34                             VALUE "34".
017900211007187570   88  lncc_Err35                             VALUE "35".
018000200302
018100121217       01  lc_WorkFields.
018200121217         03  li_AcctNo                  PIC  S9(09) VALUE 0.
018300121217         03  li_ContrNo                 PIC  S9(09) VALUE 0.
018400121217         03  li_Sysdate                 PIC S9(8).
018500121217         03  li_ResetDate               PIC S9(08).
018600121217         03  li_ActNo                   PIC S9(9).
018700121217         03  lc_InvClass                PIC X(5).
018800180709      *RFS179061 - Starts
018900180712         03  li_MfrMaxDate              PIC S9(08).
019000180712         03  lc_HHName                  PIC X(35)       VALUE SPACES.
019100180719         03  ln_TotAssetAmt             PIC S9(11)V9(2) VALUE ZEROES.
019200180709         03  lc_MFRSchdCode             PIC X(03)       VALUE SPACES.
019300180719         03  ln_MFRRate                 PIC S9(03)V9(6) VALUE ZEROES.
019400180717         03  li_PrevActNo               PIC S9(9)       VALUE ZEROES.
019500180709      *RFS179061 - Ends
019600121217
019700180724      *RFS179061 - Starts
019800180724       01  lb_HHLDIVR                   PIC  X(1).
019900180724         88  lb_HHLDIVR_Yes                        VALUE "Y".
020000180724         88  lb_HHLDIVR_No                         VALUE "N".
020100180724      *RFS179061 - Ends
020200180724
020300121217       01  lb_CommSplit                 PIC  X(1).
020400121217         88  lb_CommSplit_Exists                    VALUE "Y".
020500121217         88  lb_CommSplit_NotExistS                 VALUE "N".
020600121217
020700121217      * Error Code literal values
020800121217
020900121217       01  lc_Constants.
021000121217         03  lnc_OpenCursorError        PIC X(45)
021100121217             VALUE "Error while Opening Cursor".
021200121217         03  lnc_FetchCursorError       PIC X(45)
021300121217             VALUE "Error while Fetching the Cursor".
021400121217         03  lnc_InsertMaster           PIC X(45)
021500121217             VALUE "Error while Inserting inTO Master".
021600121217         03  lnc_ErrorGetAnnDtl         PIC X(80)
021700121217             VALUE "Error in Get-Annuitant-Details".
021800180720      *RFS179061 - Starts
021900180720         03  lnc_GetMfrMaxDate          PIC X(45)
022000180720             VALUE "Error while getting MFR Max Date".
022100180720         03  lnc_GetHHName              PIC X(45)
022200180720             VALUE "Error while getting Household Name".
022300180720         03  lnc_GetMFRDtl              PIC X(45)
022400180720             VALUE "Error while getting MFR details".
022500180720         03  lnc_GetMFRRate             PIC X(45)
022600180720             VALUE "Error while getting MFR Rate".
022700180720      *RFS179061 - Ends
022800200302      *RFS185473 - Starts
022900200302         03  lnc_GetDOBError           PIC X(45)
023000200302              VALUE "Error while getting the DOB Details".
023100200310         03  lnc_GetSpousalDOB        PIC X(45)
023200200310              VALUE "Error while getting the SpousalDOB Dtl".
023300200302         03  lnc_AltAcct               PIC x(45)
023400200302             VALUE "Error while getting the Alt Acct Dtls".
023500200302      *RFS185473 - Ends
023600210419      *RFS186584 - Starts
023700210419         03  lnc_GetpaymentoptRIFPerr  PIC X(45)
023800210419             VALUE "Error while getting payment opt RIFP Dtls".
023900210419         03  lnc_GetpaymentoptLIFPerr  PIC X(45)
024000210419             VALUE "Error while getting payment opt LIFP Dtls".
024100210419         03  lnc_GetGMWBRiderinderr    PIC X(45)
024200210419             VALUE "Error while getting GMWBRiderInd Dtls".
024300210419         03  lnc_GetGuarResetopterr    PIC X(45)
024400210419             VALUE "Error while getting GuarResetopt Dtls".
024500210419         03  lnc_GetinvesetmentCodeerr PIC X(45)
024600210419             VALUE "Error while getting Invstmt Code Dtls".
024700210419         03  lnc_GetHHnameerr          PIC X(45)
024800210419             VALUE "Error while getting HHName Dtls".
024900210506         03  lnc_GetMFRFundfee         PIC X(45)
025000210506             VALUE "Error while getting MFR Fund Mange Dtls".
025100210524         03  lnc_GetAppliedyear        PIC X(45)
025200210524             VALUE "Error while getting Appliedyear".
025300210524         03  lnc_Getbonusflag          PIC X(45)
025400210524             VALUE "Error while getting bonus flag".
025500210525         03  lnc_GetMFAACLBENP         PIC X(45)
025600210525             VALUE "Error while getting count from MFAACLBENP".
025700210526         03  lnc_GetTotAssetvalues     PIC X(45)
025800210526             VALUE "Error while getting MFEtotassetvalue".
025900210526         03  lnc_GetMFEvalues          PIC X(45)
026000210526             VALUE "Error while getting MFEValues".
026100210601         03  lnc_GetAdvisorfeerate     PIC X(45)
026200210601             VALUE "Error while getting Advisor fee rate".
026300210419      *RFS186584 - End
026400211007187570   03  lnc_GetHHLDnameerr        PIC X(45)
026500211007187570       VALUE "Error while getting HHLDName Dtls".
026600211007
026700121217         03  lnc_TableNotJournaled      PIC X(05)   VALUE "01567".
026800121217         03  lnc_GBV                    PIC X(3)    VALUE "GBV".
026900121217         03  lnc_GDV                    PIC X(3)    VALUE "GDV".
027000121217         03  lnc_0                      PIC  9(1)   VALUE 0.
027100121217         03  lnc_1                      PIC  9(1)   VALUE 1.
027200121217         03  lnc_2                      PIC  9(1)   VALUE 2.
027300121217         03  lnc_3                      PIC  9(1)   VALUE 3.
027400121217         03  lnc_5                      PIC  9(1)   VALUE 5.
027500121217         03  lnc_100                    PIC  9(3)   VALUE 100.
027600121217         03  lnc_J                      PIC  X(1)   VALUE "J".
027700121217         03  lnc_A                      PIC  X(1)   VALUE "A".
027800121217         03  lnc_Y                      PIC  X(1)   VALUE "Y".
027900121217         03  lnc_Mst                    PIC  X(3)   VALUE "MST".
028000121217         03  lnc_End                    PIC  X(35)
028100121217             VALUE "End OF File  Level1 was reached".
028200121217         03  lnc_End1                   PIC  X(35)
028300121217             VALUE "End OF File  was reached".
028400121217
028500121217       01  WS-Process-Data.
028600121217         03  li_CurrProcessDate         PIC S9(08).
028700121217         03  FILLER                     PIC X(45).
028800121217         03  li_LastProcessDate         PIC 9(08).
028900121217         03  FILLER                     PIC X(451).
029000200219
029100200219      * RFS185473 Starts
029200200219       01  lc_ScreenEditCodeSEGEXTA.
029300200226         03  lc_ScreenCodeSEGEXTA       PIC X(08) VALUE "SEGCONS".
029400200226         03  lc_EditCodeSEGEXTA         PIC X(06) VALUE "SGEXTA".
029500200226         03  lc_LevelCodeSEGEXTA        PIC X(01) VALUE "E".
029600200226         03  lc_SEGEXTAALllowed         PIC X(01) VALUE " ".
029700200219           88   Lb_SEGEXTAAllowedYes    VALUE "Y".
029800200219           88   Lb_SEGEXTAAllowedNo     VALUE "N".
029900200219      *RFS185473 Ends
030000200219
030100121217      * Record Structure for the main cursor select
030200121217
030300121217       01  lc_Master.
030400121217         03  lc_RecType                 PIC XXX.
030500121217         03  li_AccountNo               PIC S9(9).
030600121217         03  li_ContractNo              PIC S9(9).
030700121217         03  lc_ActTypCd                PIC X(5).
030800121217         03  lc_NomActTypCd             PIC X(5).
030900121217         03  lc_DlrCd                   PIC X(4).
031000121217         03  lc_RepCd                   PIC X(6).
031100121217         03  lc_Brncd                   PIC X(5).
031200121217         03  lc_ProvCd                  PIC X(3).
031300121217         03  lc_ActTypeRule             PIC X.
031400121217         03  ln_ArrAWDCarriedOver       PIC S9(11)V9(2).
031500121217         03  ln_GuaWthAmt1              PIC S9(11)V9(2).
031600121217         03  ln_OrgGwa                  PIC S9(11)V9(2).
031700121217         03  ln_ConRrifMin              PIC S9(11)V9(2).
031800121217         03  ln_YtdGuaWthAmt            PIC S9(11)V9(2).
031900121217         03  ln_AWdAmt                  PIC S9(11)V9(2).
032000121217         03  lc_AwdSpliTOption          PIC X(1).
032100121217         03  li_AwdSeqNo                PIC S9(3).
032200121217         03  lc_PayFrequency            PIC X(02).
032300210510186584   03  lc_AccGrpinvseries         PIC X(05).
032400210510186584   03  ln_Resetstopdte            PIC S9(08).
032500210510186584   03  ln_GMWBEffdate             PIC S9(08).
032600210510186584   03  ln_CurrentLIWB             PIC S9(11)V9(2).
032700210510186584   03  ln_NextLIWB                PIC S9(11)V9(2).
032800210510186584   03  ln_CurrentBIB              PIC S9(11)V9(2).
032900210510186584   03  ln_NextBIB                 PIC S9(11)V9(2).
033000210510186584   03  ln_CurrentLIA              PIC S9(11)V9(2).
033100210510186584   03  ln_NextLIA                 PIC S9(11)V9(2).
033200210416186584   03  lc_DPI                     PIC X(01).
033300210510186584   03  ln_YTDGWA                  PIC S9(11)V9(2).
033400210416186584   03  lc_Ridertype               PIC X(01).
033500210510186584   03  ln_YTDExcesswith           PIC S9(11)V9(2).
033600210419186584   03  lc_LIBEra                  PIC X(05).
033601211013118605   03  ln_Rider_Exp_date          PIC S9(08).
033602211013118605   03  li_ACLBENP_AccNo           PIC S9(9).
033700121217
033800121217       01  lc_Master1.
033900121217         03  lc_DlrCd1                  PIC X(4).
034000121217         03  lc_RepCd1                  PIC X(6).
034100130606124000   03  lc_Brncd1                  PIC X(5).
034200121217         03  ln_GuaWthBal               PIC S9(11)V9(2).
034300121217         03  ln_GuaWthAmt               PIC S9(11)V9(2).
034400121217         03  ln_GuaBonBase              PIC S9(11)V9(2).
034500121217         03  ln_RemGuaWthAmt            PIC S9(11)V9(2).
034600121217         03  li_LastResetDateGDV        PIC S9(08).
034700121217         03  li_LastResetDateGBV        PIC S9(08).
034800121217
034900121217       01  lc_CalculatedValues.
035000121217         03  lc_FxSegMatVaCalcs.
035100121217           05  ln_SegMatVaGuarMatVal    PIC S9(11)V9(2).
035200121217         03  lc_FxSegsAWDCalcs.
035300121217           05  ln_GBVsAWDGuarValAwdSum  PIC S9(11)V9(2).
035400121217
035500121217       01  li_SegsAwdAccountNo          PIC S9(09)  COMP-3.
035600121217       01  li_SegsAwdContractNo         PIC S9(09)  COMP-3.
035700121217       01  lc_SegsAwdResetType          PIC X(3).
035800121217       01  li_SegsAwdDate               PIC S9(09)  COMP-3.
035900121217       01  ln_SegsAwdAmount             PIC S9(11)V9(02) COMP-3.
036000121217       01  lc_IndependentGDV            PIC X(1).
036100211007
036200121217       01  lc_ProcessDate.
036300121217         03  lc_AsAtDate                PIC X(8).
036400121217         03  lc_AsAtDateN    REDEFINES  lc_AsAtDate
036500121217                                        PIC S9(8).
036600121217
036700121217       01  lc_AnnuitantDtl_Arr.
036800121217         03  ltb_AnnuitantDtl  OCCURS 3 TIMES INDEXED BY li_IxAnn.
036900121217           05  lc_AnnSeqno              PIC  X(3).
037000121217           05  lc_AnnLastName           PIC  X(20).
037100121217           05  lc_AnnInitial            PIC  X(3).
037200121217           05  lc_AnnFirstName          PIC  X(20).
037300121217           05  lc_AnnType               PIC  X(01).
037400121217           05  lc_AnnGender             PIC  X(01).
037500121217           05  lc_AnnDob                PIC  X(09).
037600121217           05  lc_AnnStatus             PIC  X(01).
037700200225185473     05  lc_DOD                   PIC  X(09).
037800200225185473     05  lc_DODNotification       PIC  X(09).
037900121217
038000121217       01  lc_MasterOut.
038100121217         03  lc_Key                     PIC X(19).
038200121217         03  lc_RecType                 PIC XXX.
038300121217         03  li_AccountNo               PIC S9(9).
038400121217         03  li_ContractNo              PIC S9(9).
038500121217         03  lc_ActTypCd                PIC X(5).
038600121217         03  lc_NomActTypCd             PIC X(5).
038700121217         03  lc_CalDlrCd                PIC X(4).
038800121217         03  lc_CalRepCd                PIC X(6).
038900121217         03  lc_Brncd                   PIC X(5).
039000121217         03  lc_ProvCd                  PIC X(3).
039100121217         03  lc_AnnuitantSeqNo1         PIC X(3).
039200121217         03  lc_AnnuitantLastName1      PIC X(20).
039300121217         03  lc_AnnuitantInitial1       PIC X(3).
039400121217         03  lc_AnnuitantFirstName1     PIC X(20).
039500121217         03  lc_AnnuitantType1          PIC X(1).
039600121217         03  lc_AnnuitantGender1        PIC X(1).
039700121217         03  lc_AnnuitantDob1           PIC X(9).
039800121217         03  lc_AnnuitantStatus1        PIC X(1).
039900121217         03  lc_AnnuitantSeqNo2         PIC X(3).
040000121217         03  lc_AnnuitantLastName2      PIC X(20).
040100121217         03  lc_AnnuitantInitial2       PIC X(3).
040200121217         03  lc_AnnuitantFirstName2     PIC X(20).
040300121217         03  lc_AnnuitantType2          PIC X(1).
040400121217         03  lc_AnnuitantGender2        PIC X(1).
040500121217         03  lc_AnnuitantDob2           PIC X(9).
040600121217         03  lc_AnnuitantStatus2        PIC X(1).
040700121217         03  lc_AnnuitantSeqNo3         PIC X(3).
040800121217         03  lc_AnnuitantLastName3      PIC X(20).
040900121217         03  lc_AnnuitantInitial3       PIC X(3).
041000121217         03  lc_AnnuitantFirstName3     PIC X(20).
041100121217         03  lc_AnnuitantType3          PIC X(1).
041200121217         03  lc_AnnuitantGender3        PIC X(1).
041300121217         03  lc_AnnuitantDob3           PIC X(9).
041400121217         03  lc_AnnuitantStatus3        PIC X(1).
041500121217         03  ln_CalGuaWthBal            PIC S9(11)V9(2).
041600121217         03  ln_CalGuaWthAmt            PIC S9(11)V9(2).
041700121217         03  ln_CalGuaBonBase           PIC S9(11)V9(2).
041800121217         03  ln_ConRrifMin              PIC S9(11)V9(2).
041900121217         03  ln_CalRemGuaWthAmt         PIC S9(11)V9(2).
042000121217         03  li_CalLastResetDateGDV     PIC S9(8).
042100121217         03  li_CalLastResetDateGBV     PIC S9(8).
042200121217         03  ln_OrgGwa                  PIC S9(11)V9(2).
042300121217         03  ln_AWdAmt                  PIC S9(11)V9(2).
042400121217         03  lc_AwdSpliTOption          PIC X(1).
042500121217         03  lc_PayFrequency            PIC X(02).
042600180719      *RFS179061 - Starts
042700180719         03  lc_Mst-HHName              PIC X(35).
042800180719         03  ln_Mst-MFRRate             PIC S9(01)V9(6).
042900180719         03  ln_Mst-TotAssetAmt         PIC S9(11)V9(2).
043000180719      *RFS179061 - Ends
043100200219
043200200219      *RFS185473 -  Starts
043300200219       01  lc_MasterAlt.
043400200303         03  lc_Key                     PIC X(19).
043500200303         03  lc_RecType                 PIC XXX.
043600200303         03  li_AccountNo               PIC S9(9).
043700200303         03  li_ContractNo              PIC S9(9).
043800200303         03  lc_ActTypCd                PIC X(5).
043900200303         03  lc_NomActTypCd             PIC X(5).
044000200303         03  lc_CalDlrCd                PIC X(4).
044100200303         03  lc_CalRepCd                PIC X(6).
044200200303         03  lc_Brncd                   PIC X(5).
044300200303         03  lc_ProvCd                  PIC X(3).
044400200303         03  lc_AnnuitantSeqNo1         PIC X(3).
044500200303         03  lc_AnnuitantLastName1      PIC X(20).
044600200303         03  lc_AnnuitantInitial1       PIC X(3).
044700200303         03  lc_AnnuitantFirstName1     PIC X(20).
044800200303         03  lc_AnnuitantType1          PIC X(1).
044900200303         03  lc_AnnuitantGender1        PIC X(1).
045000200303         03  lc_AnnuitantDob1           PIC X(9).
045100200303         03  lc_AnnuitantStatus1        PIC X(1).
045200200303         03  lc_AnnuitantSeqNo2         PIC X(3).
045300200303         03  lc_AnnuitantLastName2      PIC X(20).
045400200303         03  lc_AnnuitantInitial2       PIC X(3).
045500200303         03  lc_AnnuitantFirstName2     PIC X(20).
045600200303         03  lc_AnnuitantType2          PIC X(1).
045700200303         03  lc_AnnuitantGender2        PIC X(1).
045800200303         03  lc_AnnuitantDob2           PIC X(9).
045900200303         03  lc_AnnuitantStatus2        PIC X(1).
046000200303         03  lc_AnnuitantSeqNo3         PIC X(3).
046100200303         03  lc_AnnuitantLastName3      PIC X(20).
046200200303         03  lc_AnnuitantInitial3       PIC X(3).
046300200303         03  lc_AnnuitantFirstName3     PIC X(20).
046400200303         03  lc_AnnuitantType3          PIC X(1).
046500201019      *RFS1104082 Starts
046600201019      *  03  lc_-AnnuitantGender3        PIC X(1).
046700201019         03  lc_AnnuitantGender3        PIC X(1).
046800201019      *RFS1104082 Ends
046900200303         03  lc_AnnuitantDob3           PIC X(9).
047000200303         03  lc_AnnuitantStatus3        PIC X(1).
047100200303         03  ln_CalGuaWthBal            PIC S9(11)V9(2).
047200200303         03  ln_CalGuaWthAmt            PIC S9(11)V9(2).
047300200303         03  ln_CalGuaBonBase           PIC S9(11)V9(2).
047400200303         03  ln_ConRrifMin              PIC S9(11)V9(2).
047500200303         03  ln_CalRemGuaWthAmt         PIC S9(11)V9(2).
047600200303         03  li_CalLastResetDateGDV     PIC S9(8).
047700200303         03  li_CalLastResetDateGBV     PIC S9(8).
047800200303         03  ln_OrgGwa                  PIC S9(11)V9(2).
047900200303         03  ln_AWdAmt                  PIC S9(11)V9(2).
048000200303         03  lc_AwdSpliTOption          PIC X(1).
048100200303         03  lc_PayFrequency            PIC X(02).
048200200303         03  lc_Mst-HHName              PIC X(35).
048300200303         03  ln_Mst-MFRRate             PIC S9(01)V9(6).
048400200303         03  ln_Mst-TotAssetAmt         PIC S9(11)V9(2).
048500200615      *RFS1101532 - Start
048600200615         03  lc_SpousalIncInd               PIC X(01).
048700200615           88  lc_SpousalIncIndYES          VALUE "Y".
048800200615           88  lc_SpousalIncIndNO           VALUE "N".
048900200615      *RFS1101532 - End
049000200224         03  lc_ActualDOD                   PIC X(9).
049100200224         03  lc_DateOfDthNotif              PIC X(9).
049200200224         03  lc_ActualDOD2                  PIC X(9).
049300200224         03  lc_DateOfDthNotif2             PIC X(9).
049400200224         03  lc_AlternateAcct               PIC X(12).
049500200615      *RFS1101532 - Start
049600200615      *  03  lc_SpousalIncInd               PIC X(01).
049700200615      *    88  lc_SpousalIncIndYES          VALUE "Y".
049800200615      *    88  lc_SpousalIncIndNO           VALUE "N".
049900200615      *RFS1101532 - End
050000210416      *RFS186584 - Starts
050100210510         03  lc_AccGrpinvseriescd       PIC X(05).
050200210510         03  ln_Resetstopdate           PIC S9(08).
050300210510         03  lc_HLIHHname               PIC X(35).
050400210510         03  lc_HLDHHname               PIC X(35).
050500210510         03  lc_GuarResetoption         PIC X(01).
050600210510         03  lc_Paymentoption           PIC X(01).
050700210510         03  lc_MatResetfeefund         PIC X(05).
050800210510         03  lc_DthResetfeefund         PIC X(05).
050900210510         03  lc_GMWBRiderind            PIC X(01).
051000210510         03  ln_GMWBEffetivedate        PIC S9(08).
051100210510         03  ln_CurrentLIWBA            PIC S9(11)V9(2).
051200210510         03  ln_NextLIWBA               PIC S9(11)V9(2).
051300210510         03  ln_CurrentBIBA             PIC S9(11)V9(2).
051400210510         03  ln_NextBIBA                PIC S9(11)V9(2).
051500210510         03  ln_CurrentLIAA             PIC S9(11)V9(2).
051600210510         03  ln_NextLIAA                PIC S9(11)V9(2).
051700210510         03  lc_DPIndicator             PIC X(01).
051800210510         03  ln_YTDGWAmount             PIC S9(11)V9(2).
051900210510         03  lc_GMWBFee                 PIC X(05).
052000210420         03  ln_GMWBTotfeefactor        PIC S9(17)V9(06).
052100210421         03  ln_YTDGMWB                 PIC S9(11)V9(02).
052200210416         03  ln_NextMVResetdate         PIC S9(08).
052300210510         03  lc_Ridertypeind            PIC X(01).
052400211007      * RFS187570 Starts
052500211007      *  03  ln_Advfeerate              PIC S9(05)V9(02).
052600211007         03  ln_Advfeerate              PIC S9(03)V9(03).
052700210510         03  lc_LIBInvstseries          PIC X(05).
052800210914      *  03  ln_MFERate                 PIC S9(05)V9(02).
052900210914      *  03  lc_MFEtier                 PIC X(21).
053000210914      *  03  ln_MFRRate1                PIC S9(03)V9(06).
053100210914      *  03  lc_MFRRebatetier           PIC X(19).
053200210914      * RFS187570 Ends
053300210914      * RFS186584 - End
053400210416
053500210823      *RFS1118460 Starts
053600210823       01 lc_Mfasegparm.
053700210823         03 FILLER                      PIC X(50).
053800210823         03 lc_AccountLevelGLWB         PIC X(1) VALUE SPACES.
053900210823            88  lb_AccountLevelGlwbYes VALUE "Y".
054000210823            88  lb_AccountLevelGlwbNo  VALUE "N".
054100210823      *RFS1118460 Ends
054200200219
054300200219       01  li_MinDateOfBirth            PIC S9(08).
054400200219       01  li_SpousalDateOfBirth        PIC S9(08).
054500200219      *RFS185473 - Ends
054600200219
054700210419      *RFS186584 - Starts
054800210419       01 lc_MBRST                       PIC X(01) VALUE " ".
054900210419       01 lc_DBRST                       PIC X(01) VALUE " ".
055000210419       01 lncc_Yes                       PIC X(01) VALUE "Y".
055100210421       01 lncc_No                        PIC X(01) VALUE "N".
055200210419       01 lncc_MBRST                     PIC X(05) VALUE "MBRST".
055300210419       01 lncc_DBRST                     PIC X(05) VALUE "DBRST".
055400210506       01 lc_GuarReset                   PIC X(01) VALUE " ".
055500210506       01 lc_Attributecode               PIC X(05) VALUE " ".
055600210524       01 li_Applyear                    PIC S9(04).
055700210524       01 ln_Applyear                    PIC S9(04).
055800210526       01 ln_Bonusdate                   PIC S9(09).
055900210526       01 ln_MFEFundRate                 PIC S9(05)V9(02).
056000210526       01 lc_MFESchedcode                PIC X(05).
056100210518       01 ln_Minwithamt                  PIC S9(11)V9(02)
056200210518                                         VALUE ZEROES.
056300210419       01 lncc_spaces                    PIC X(05) VALUE " ".
056400210419       01 lncc_1                         PIC X(01) VALUE "1".
056500210419       01 lncc_2                         PIC X(01) VALUE "2".
056600210419       01 lncc_3                         PIC X(01) VALUE "3".
056700210419       01 lncc_4                         PIC X(01) VALUE "4".
056800210428       01 lncc_5                         PIC X(01) VALUE "5".
056900210419       01 lncc_MBG                       PIC X(05) VALUE "MBG".
057000210518       01 lc_Acttypeflag                 PIC X(01) VALUE " ".
057100210524       01 lc_BonusFlag                   PIC X(01) VALUE " ".
057200210430       01 lncc_HLI                       PIC X(03) VALUE "HLI".
057300210430       01 lncc_HLD                       PIC X(03) VALUE "HLD".
057400210505       01 lnci_1                         PIC 9(01) VALUE  1.
057500210505       01 lnci_2                         PIC 9(01) VALUE  2.
057600210505       01 lnci_3                         PIC 9(01) VALUE  3.
057700210505       01 lnci_4                         PIC 9(01) VALUE  4.
057800210505       01 lnci_5                         PIC 9(01) VALUE  5.
057900210510       01 lc_HHCode                      PIC X(03) VALUE " ".
058000210513       01 lc_HHflag                      PIC X(01) VALUE " ".
058100210513       01 lc_HHrflag                     PIC X(01) VALUE " ".
058200210510       01 lc_Householdname               PIC X(35) VALUE " ".
058300210510       01 lc_Subtypecode                 PIC X(05) VALUE " ".
058400210510       01 lc_Resetfeefund                PIC X(05) VALUE " ".
058500210419       01 lncc_DBG                       PIC X(05) VALUE "DBG".
058600210419       01 lncc_GWFEE                     PIC X(05) VALUE "GWFEE".
058700210419       01 lnci_0                         PIC S9(1) VALUE 0.
058800210422       01 lnci_00                        PIC X(02) VALUE "00".
058900210419       01 li_PrevActNo1                  PIC S9(9) VALUE ZEROES.
059000210419       01 lncc_RRIF                      PIC X(05) VALUE "RRIF".
059100210419       01 lncc_RLIF                      PIC X(05) VALUE "RLIF".
059200210510       01 lc_Account-Attr                PIC X(05) VALUE SPACES.
059300210510       01 ld_ExpiryDate                  PIC S9(08) VALUE 0.
059400210510       01 ld_EffectivDate                PIC S9(08) VALUE 0.
059500210420       01 lncc_E                         PIC X(01) VALUE "E".
059600210518       01 lncc_L                         PIC X(01) VALUE "L".
059700210421       01 lncc_S                         PIC X(01) VALUE "S".
059800210421       01 lncc_J                         PIC X(01) VALUE "J".
059900210525       01 li_Count                       PIC S9(01) VALUE 0.
060000210524       01 lncc_SEGMSTEXT                 PIC X(10) VALUE "SEGMSTEXT".
060100210524       01 lncc_Scrncode                  PIC X(08) VALUE "JOBDAILY".
060200210524       01 lncc_GBONUS                    PIC X(06) VALUE "GBONUS".
060300210524       01 lncc_SEVERE                    PIC X(01) VALUE "E".
060400210524       01 lncc_lvlcode                   PIC X(01) VALUE "C".
060500210524       01 lncc_SCRNMSG                   PIC X(30) value " ".
060600210524       01 lncc_sqllog                    PIC X(01) VALUE "N".
060700210524       01 lncc_edtscp                    PIC X(46) value " ".
060800210524       01 lncc_returncode                PIC X(02).
060900210524       01 lc_GbonusExists                PIC X(01) VALUE " ".
061000210512       01 lc_MFRateSchdCode              PIC X(03) VALUE " ".
061100210513       01 ln_TotAssetAmount              PIC S9(11)V9(2) VALUE ZEROES.
061200210512       01 ln_MFRRebateRate               PIC S9(03)V9(06)
061300210512                                          VALUE ZEROES.
061400210526       01 ln_MFETotAssetAmount           PIC S9(11)V9(2) VALUE ZEROES.
061500210602       01 ln_limit                       PIC S9(11)V9(2) VALUE ZEROES.
061600210526       01 ln_Lowerlimit                  PIC S9(11)V9(02)
061700210526                                          VALUE ZEROES.
061800210512       01 ln_Upperlimit                  PIC S9(11)V9(02)
061900210505                                          VALUE ZEROES.
062000210519       01 ln_tier                        PIC 9(03) VALUE ZEROES.
062100210505       01 li_limit1                      PIC S9(11)V9(04)
062200210505                                         VALUE 499999.9999.
062300210505       01 li_limit2                      PIC S9(11)V9(04)
062400210505                                         VALUE 999999.9999.
062500210505       01 li_limit3                      PIC S9(11)V9(04)
062600210505                                         VALUE 2499999.9999.
062700210505       01 li_limit4                      PIC S9(11)V9(04)
062800210505                                         VALUE 4999999.9999.
062900210505       01 li_limit5                      PIC S9(11)V9(04)
063000210505                                         VALUE 50000000.0000.
063100210419      *RFS186584 - End
063200210914      * RFS187570 Starts
063300211007       01 ln_HH_AMS_Rate                 PIC S9(03)V9(03) VALUE ZEROES.
063400210914       01 lc_MGFEEP-HH-Linkage-Code      PIC X(03) VALUE SPACES.
063500210914      * RFS187570 Ends
063600200219
063700210524186584 01 SCREEN-EDITS-ALLOWED-REC.
063800210524186584                       COPY DD-ALL-FORMATS OF MFAEDTSCP.
063900210420186584 COPY CPFXRESETD.
064000210524186584 COPY CPCHKBELG.
064100210420
064200121217      * Control level variables for control break logic
064300121217
064400121217       01  CURR-CONTROLS.
064500121217         03  CURR-LEVEL1.
064600180716           05  CURR-ACCOUNT             PIC 9(9).
064700121217           05  CURR-CONTRACT            PIC 9(9).
064800121217
064900121217       01  PREV-CONTROLS.
065000121217         03  PREV-LEVEL1.
065100121217           05  PREV-ACCOUNT             PIC 9(9).
065200121217           05  PREV-CONTRACT            PIC 9(9).
065300121217
065400121217       LINKAGE SECTION.
065500121217
065600121217       PROCEDURE DIVISION.
065700121217
065800121217      *-------------
065900121217       Main-Process.
066000121217      *-------------
066100121217
066200121217           PERFORM Initial-Logic.
066300121217
066400121217           PERFORM Process-Level-logic TEST BEFORE
066500121217                   UNTIL CURR-CONTROLS  =  HIGH-VALUES
066600121217
066700121217           PERFORM End-Job.
066800121217           GOBACK.
066900121217
067000121217      * Initial logic
067100121217       Initial-Logic.
067200121217
067300121217      * Get system date
067400121217           ACCEPT li_Sysdate         FROM DATE YYYYMMDD.
067500121217
067600121217      * Get the process date
067700121217           ACCEPT lc_ProcessDate      FROM WS-DTAARA
067800121217                                       FOR "MFAPRCDTP".
067900211007
068000210823      * RFS1118460 Starts
068100210823      * Get the Account Guarantees Tracking
068200210823           INITIALIZE lc_AccountLevelGLWB.
068300210823           ACCEPT lc_MFASEGPARM       FROM WS-DTAARA-MFASEGPARM
068400210823                                       FOR "MFASEGPARM".
068500210823      * RFS1118460 Ends
068600210914
068700210914      * RFS187570 Starts
068800210914           ACCEPT MGFEEP-MGMT-FEE-PARM
068900210914                             FROM WS-DTAARA-MFAMGFEEPM FOR "MFAMGFEEP".
069000210914           MOVE MGFEEP-HH-Linkage-Code TO lc_MGFEEP-HH-Linkage-Code.
069100210914      * RFS187570 Ends
069200210914
069300121217      * setup level break logic
069400121217           MOVE   LOW-VALUES           TO  CURR-CONTROLS
069500121217                                           Prev-Controls.
069600121217
069700210419
069800200227      * RFS185473 - Starts
069900200227           SET  Lb_SEGEXTAAllowedNo    TO TRUE.
070000200227           MOVE lc_ScreenCodeSEGEXTA   TO Pass-Screen-Code.
070100200227           MOVE lc_EditcodeSEGEXTA     TO Pass-Edit-Code.
070200200227           MOVE lc_LevelCodeSEGEXTA    TO Pass-Level-Code.
070300200227
070400200227           CALL "FXSCEDTAL1" USING   Pass-Screen-Code
070500200227                                     Pass-Edit-Code
070600200227                                     Pass-Level-Code
070700200227                                     Retn-Edit-Allowed-Flag.
070800200302           IF Retn-Edit-Allowed
070900200227              SET Lb_SEGEXTAAllowedYes TO TRUE
071000200227           END-IF.
071100200227           CANCEL "FXSCEDTAL1".
071200200227      * RFS185473 - Ends
071300210524
071400210524      * RFS186584 - Starts
071500210524           INITIALIZE SCREEN-EDITS-ALLOWED-REC.
071600210524
071700210524           MOVE lncc_Scrncode
071800210524                TO SCREEN-CODE OF SCREEN-EDITS-ALLOWED-REC.
071900210524           MOVE lncc_GBONUS
072000210524                TO EDIT-CODE OF SCREEN-EDITS-ALLOWED-REC.
072100210524           MOVE lncc_lvlcode
072200210524                TO LEVEL-CODE OF SCREEN-EDITS-ALLOWED-REC.
072300210524           MOVE lncc_No to lncc_sqllog.
072400210524           MOVE lnci_00 to lncc_returncode.
072500210524           MOVE lncc_No to lc_GbonusExists.
072600210524
072700210524           CALL "FXSCEDTALW" USING SCREEN-EDITS-ALLOWED-REC,
072800210524                                   lncc_sqllog,
072900210524                                   lncc_returncode.
073000210524
073100210524           IF lncc_returncode = lnci_00
073200210524              MOVE lncc_Yes TO lc_GbonusExists
073300210524           END-IF.
073400210524      * RFS186584 - End
073500210524
073600200226      * Display info.that program Start
073700121217           PERFORM DSP-PROGRAM-START.
073800121217
073900121217      * Declare & Open files and Cursors .....
074000121217
074100121217           PERFORM SQL-Declare-Driver-file.
074200121217           PERFORM SQL-Open-Driver-file.
074300200227
074400121217      * Drop the table and create the output work file.
074500121217
074600121217
074700121217           EXEC SQL
074800121217             DROP TABLE QTEMP/MASTEROUT
074900121217           END-EXEC.
075000121217
075100121217           EXEC SQL
075200121217             CREATE TABLE QTEMP/MASTEROUT (
075300121217             REC_KEY                CHAR (19) NOT NULL WITH DEFAULT
075400121217             ,REC_TYPE               CHAR (3) NOT NULL WITH DEFAULT
075500130503122636*      ,ACCOUNT_NO             CHAR (9) NOT NULL WITH DEFAULT
075600130506122636       ,ACCOUNT_NO      NUMERIC (9, 0)  NOT NULL WITH DEFAULT
075700130603123699*      ,CONTRACT_NO            CHAR (9) NOT NULL WITH DEFAULT
075800130603123699       ,CONTRACT_NO     NUMERIC (9, 0)  NOT NULL WITH DEFAULT
075900121217             ,ACCOUNT_TYPE_CODE      CHAR (5) NOT NULL WITH DEFAULT
076000121217             ,NOMINEE_ACCOUNT_TYPE   CHAR (5) NOT NULL WITH DEFAULT
076100121217             ,DEALER_CODE            CHAR (4) NOT NULL WITH DEFAULT
076200121217             ,DEALER_REP_CODE        CHAR (6) NOT NULL WITH DEFAULT
076300121217             ,BRANCH_CODE            CHAR (6) NOT NULL WITH DEFAULT
076400121217             ,CONTRACT_PROV          CHAR (3) NOT NULL WITH DEFAULT
076500121217             ,ANNUITANT_SEQ_NO_1     CHAR (3) NOT NULL WITH DEFAULT
076600121217             ,ANNUITANT_LAST_NAME_1  CHAR (20) NOT NULL WITH DEFAULT
076700121217             ,ANNUITANT_INITIAL_1    CHAR (3) NOT NULL WITH DEFAULT
076800121217             ,ANNUITANT_FIRST_NAME_1 CHAR (20) NOT NULL WITH DEFAULT
076900121217             ,ANNUITANT_TYPE_1       CHAR (1) NOT NULL WITH DEFAULT
077000121217             ,ANNUITANT_GENDER_1     CHAR (1) NOT NULL WITH DEFAULT
077100121217             ,ANNUITANT_DOB_1        CHAR (9) NOT NULL WITH DEFAULT
077200121217             ,ANNUITANT_STATUS_1     CHAR (1) NOT NULL WITH DEFAULT
077300121217             ,ANNUITANT_SEQ_NO_2     CHAR (3) NOT NULL WITH DEFAULT
077400121217             ,ANNUITANT_LAST_NAME_2  CHAR (20) NOT NULL WITH DEFAULT
077500121217             ,ANNUITANT_INITIAL_2    CHAR (3) NOT NULL WITH DEFAULT
077600121217             ,ANNUITANT_FIRST_NAME_2 CHAR (20) NOT NULL WITH DEFAULT
077700121217             ,ANNUITANT_TYPE_2       CHAR (1) NOT NULL WITH DEFAULT
077800121217             ,ANNUITANT_GENDER_2     CHAR (1) NOT NULL WITH DEFAULT
077900121217             ,ANNUITANT_DOB_2        CHAR (9) NOT NULL WITH DEFAULT
078000121217             ,ANNUITANT_STATUS_2     CHAR (1) NOT NULL WITH DEFAULT
078100121217             ,ANNUITANT_SEQ_NO_3     CHAR (3) NOT NULL WITH DEFAULT
078200121217             ,ANNUITANT_LAST_NAME_3  CHAR (20) NOT NULL WITH DEFAULT
078300121217             ,ANNUITANT_INITIAL_3    CHAR (3) NOT NULL WITH DEFAULT
078400121217             ,ANNUITANT_FIRST_NAME_3 CHAR (20) NOT NULL WITH DEFAULT
078500121217             ,ANNUITANT_TYPE_3       CHAR (1) NOT NULL WITH DEFAULT
078600121217             ,ANNUITANT_GENDER_3     CHAR (1) NOT NULL WITH DEFAULT
078700121217             ,ANNUITANT_DOB_3        CHAR (9) NOT NULL WITH DEFAULT
078800121217             ,ANNUITANT_STATUS_3     CHAR (1) NOT NULL WITH DEFAULT
078900121217             ,GuaWthBal       NUMERIC (13, 2)  NOT NULL WITH DEFAULT
079000121217             ,GuaWthAmt       NUMERIC (13, 2)  NOT NULL WITH DEFAULT
079100121217             ,GuaBonBase      NUMERIC (13, 2)  NOT NULL WITH DEFAULT
079200121217             ,ConRrifMinmt    NUMERIC (13, 2)  NOT NULL WITH DEFAULT
079300121217             ,RemGuaWthAmte   NUMERIC (13, 2)  NOT NULL WITH DEFAULT
079400121217             ,LastResetDateGDV  NUMERIC (8, 0)  NOT NULL WITH DEFAULT
079500121217             ,LastResetDateGBV  NUMERIC (8, 0)  NOT NULL WITH DEFAULT
079600121217             ,OrgGwa            NUMERIC (13, 2)  NOT NULL WITH DEFAULT
079700121217             ,AWdAmt            NUMERIC (13, 2)  NOT NULL WITH DEFAULT
079800121217             ,AwdSpliTOption    CHAR (1) NOT NULL WITH DEFAULT
079900121217             ,PayFrequency      CHAR (2) NOT NULL WITH DEFAULT
080000180719      *RFS179061 - Starts
080100180719             ,HHLD_NAME         CHAR (35)       NOT NULL WITH DEFAULT
080200180719             ,MFR_RATE          NUMERIC (07, 6) NOT NULL WITH DEFAULT
080300180719             ,TOT_ASSET_AMT     NUMERIC (13, 2) NOT NULL WITH DEFAULT
080400180719      *RFS179061 - Ends
080500121217             )
080600121217           END-EXEC.
080700180712
080800200219      *RF185473 - Starts
080900200219           IF Lb_SEGEXTAAllowedYes
081000200219              PERFORM CreateAlternateMASTEROUT
081100200219           ELSE
081200200219              CONTINUE
081300200219           END-IF.
081400200219
081500180712      *RFS179061 - Starts
081600180712           INITIALIZE li_MfrMaxDate.
081700180712
081800180712           EXEC SQL
081900180712           SELECT COALESCE(MAX(TRADE_DATE), 0)
082000180718           INTO :li_MfrMaxDate
082100180712           FROM WRKHHLDIVR
082200180712           END-EXEC.
082300180712
082400180712           MOVE SQLSTATE TO Sw-Sql-States.
082500180712           EVALUATE TRUE
082600180720           WHEN Sw-Sql-Successful
082700180720             OR Sw-Sql-Warning
082800180720             OR Sw-Sql-End
082900180712              CONTINUE
083000180712           WHEN OTHER
083100180720              SET lncc_Err17               TO TRUE
083200180720              STRING lnc_GetMfrMaxDate     DELIMITED BY SPACES
083300180720                 SPACES                    DELIMITED BY SIZE
083400180720                 SQLSTATE                  DELIMITED BY SIZE
083500180720              INTO Ws-Sql-Err-Short-Descr
083600180720              PERFORM SQLFailProcess
083700180719           END-EVALUATE.
083800180712      *RFS179061 - Ends
083900121217
084000121217       SQL-Declare-Driver-file.
084100121217
084200121217      * SQL Driver
084300121217
084400121217           EXEC SQL
084500121217             DECLARE lcu_MstCursor CURSOR FOR
084600121217
084700121217             SELECT
084800121217             DISTINCT
084900121217               :lnc_Mst,
085000121217               ACCNTP.ACCOUNT_NO,
085100121217               ACCONP.CONTRACT_NO,
085200121217               COALESCE(ACCNTP.ACCOUNT_TYPE_CODE, " "),
085300121217               COALESCE(
085400121217               CASE WHEN ACCNTP.NOMINEE = "Y"
085500121217                  THEN ACCNMP.ACCOUNT_TYPE_CODE ELSE " " END,  " ")
085600121217               AS NOMINEE_ACCOUNT_TYPE,
085700121217               COALESCE(ACCNTP.DEALER_CODE, " "),
085800121217               COALESCE(ACCNTP.DEALER_REP_CODE, " "),
085900121217               COALESCE(ACCNMP.BRANCH_CODE, " "),
086000121217               COALESCE(IVRP.PROVINCE_CODE, " "),
086100121217               COALESCE(ACCTYP.ACCOUNT_TYPE_RULE, " "),
086200121217               COALESCE(ACCONP.AWD_CARRIED_OVER, 0),
086300210823      *RFS1118460 Starts
086400210823      *        COALESCE(ACCONP.GUAR_WITHDRAWAL_AMOUNT, 0),
086500210823      *        COALESCE(ACCONP.ORIGINAL_GWA, 0),
086600210823      *        COALESCE(ACCONP.GWA_RIF_MINIMUM, 0),
086700210823      *        COALESCE(ACCONP.YTD_GUAR_WITHDRAWAL_AMOUNT, 0),
086800210823      *        COALESCE(ACCONP.AWD_AMOUNT, 0),
086900210823      *        COALESCE(ACCONP.AWD_SPLIT_OPTION, " "),
087000210823               CASE WHEN :lc_AccountLevelGLWB = :lnc_Y
087100210823               THEN COALESCE(ACLBENP.GUAR_WITHDRAWAL_AMOUNT,0)
087200210823               ELSE COALESCE(ACCONP.GUAR_WITHDRAWAL_AMOUNT,0)
087300210823               END,
087400210823               CASE WHEN :lc_AccountLevelGLWB = :lnc_Y
087500210823               THEN COALESCE(ACLBENP.ORIGINAL_GWA,0)
087600210823               ELSE COALESCE(ACCONP.ORIGINAL_GWA,0)
087700210823               END,
087800210823               CASE WHEN :lc_AccountLevelGLWB = :lnc_Y
087900210823               THEN COALESCE(ACLBENP.GWA_RIF_MINIMUM,0)
088000210823               ELSE COALESCE(ACCONP.GWA_RIF_MINIMUM,0)
088100210823               END,
088200210823               CASE WHEN :lc_AccountLevelGLWB = :lnc_Y
088300210823               THEN COALESCE(ACLBENP.YTD_GUAR_WITHDRAWAL_AMOUNT,0)
088400210823               ELSE COALESCE(ACCONP.YTD_GUAR_WITHDRAWAL_AMOUNT,0)
088500210823               END,
088600210823               CASE WHEN :lc_AccountLevelGLWB = :lnc_Y
088700210823               THEN COALESCE(ACLBENP.AWD_AMOUNT,0)
088800210823               ELSE COALESCE(ACCONP.AWD_AMOUNT,0)
088900210823               END,
089000210823               CASE WHEN :lc_AccountLevelGLWB = :lnc_Y
089100210823               THEN COALESCE(ACLBENP.AWD_SPLIT_OPTION," ")
089200210823               ELSE COALESCE(ACCONP.AWD_SPLIT_OPTION," ")
089300210823               END,
089400210823      * RFS1118460 Ends
089500121217               COALESCE(ACCAWP.AWD_SEQ_NO, 0),
089600121217               COALESCE(ACCAWP.FREQUENCY_CODE, " ")
089700210510186584         ,COALESCE(ACMDP.ACCOUNT_INVESTMENT_GROUP, " "),
089800210416186584         COALESCE(
089900210428186584         CASE WHEN (
090000210428186584         COALESCE (ACGINFP.MATURITY_FINAL_RESET_DATE ,0))= 0
090100210416186584            THEN ACMDP.ACCOUNT_MATURITY_DATE ELSE
090200210416186584            ACGINFP.MATURITY_FINAL_RESET_DATE END, 0),
090300210416186584         COALESCE(ACLBENP.ELECTION_DATE, 0),
090400210416186584         COALESCE(ACLBENP.GUAR_WITHDRAWAL_BASE_VALUE, 0),
090500210416186584         COALESCE(ACLBENP.NEXT_YEAR_GWB, 0),
090600210416186584         COALESCE(ACLBENP.GUAR_WITHDRAWAL_BONUS_BASE, 0),
090700210416186584         COALESCE(ACLBENP.NEXT_YEAR_GBB, 0),
090800210416186584         COALESCE(ACLBENP.GUAR_WITHDRAWAL_AMOUNT, 0),
090900210416186584         COALESCE(ACLBENP.NEXT_YEAR_GWA, 0),
091000210416186584         COALESCE(ACLBENP.FIE_BONUS_FLAG, " ") ,
091100210416186584         COALESCE(ACLBENP.YTD_GUAR_WITHDRAWAL_AMOUNT, 0),
091200210416186584         COALESCE(ACLBENP.RIDER_TYPE, " "),
091300210419186584         COALESCE(ACLBENP.YTD_EXCESS_WITHDRAWAL, 0),
091400210419186584         COALESCE(ACLBENP.INVESTMENT_SERIES, " ")
091401211013118605         , COALESCE(ACLBENP.EXPIRY_DATE , 0  )
091402211013118605         , COALESCE(ACLBENP.ACCOUNT_NO, 0)
091500200224             FROM MFAACCNTP ACCNTP
091600121217             INNER JOIN MFAACCONP ACCONP ON
091700121217               ACCNTP.ACCOUNT_NO =ACCONP.ACCOUNT_NO
091800121217             LEFT OUTER JOIN MFAACCNMP ACCNMP ON
091900121217               ACCNTP.ACCOUNT_NO =ACCNMP.ACCOUNT_NO
092000121217             LEFT OUTER JOIN MFAACCTYP ACCTYP ON
092100121217               ACCNTP.ACCOUNT_TYPE_CODE =ACCTYP.ACCOUNT_TYPE_CODE
092200121217             LEFT OUTER JOIN MFAACCAWP ACCAWP ON
092300121217               ACCNTP.ACCOUNT_NO = ACCAWP.ACCOUNT_NO
092400121217             LEFT OUTER JOIN MFAIVRP IVRP ON
092500121217               ACCNTP.INVESTOR_NO = IVRP.INVESTOR_NO
092600210416186584       LEFT OUTER JOIN MFAACLBENP ACLBENP ON
092700210416186584         ACCNTP.ACCOUNT_NO = ACLBENP.ACCOUNT_NO
092800210416186584       LEFT OUTER JOIN MFAACMDP ACMDP
092900210416186584        ON ACCNTP.ACCOUNT_NO = ACMDP.ACCOUNT_NO
093000210416186584       LEFT OUTER JOIN MFAACGINFP ACGINFP
093100210416186584       ON ACCNTP.ACCOUNT_NO = ACGINFP.ACCOUNT_NO
093200121217             WHERE
093300121217             EXISTS (
093400121217             SELECT *
093500121217             FROM MFAACCCIP ACCCIP
093600121217             WHERE   ACCCIP.ACCOUNT_NO = ACCNTP.ACCOUNT_NO
093700121217             AND     ACCCIP.CONTRACT_NO = ACCONP.CONTRACT_NO)
093800121217             AND ACCNTP.ACCOUNT_STATUS = "A"
093900121217             AND ACCONP.CONTRACT_STATUS <> "C"
094000121217             ORDER BY
094100121217               ACCNTP.ACCOUNT_NO
094200121217             FOR
094300121217             FETCH ONLY
094400121217             OPTIMIZE FOR ALL ROWS
094500121217           END-EXEC.
094600121217
094700121217      * open cursor
094800121217       SQL-Open-Driver-file.
094900121217
095000121217           EXEC SQL
095100121217             OPEN lcu_MstCursor
095200121217           END-EXEC.
095300121217
095400121217      * SQL error Checking
095500121217
095600200302           MOVE SQLSTATE TO Sw-Sql-States.
095700121217           EVALUATE TRUE
095800121217           WHEN Sw-Sql-Successful
095900121217           WHEN Sw-Sql-States = lnc_TableNotJournaled
096000121217              CONTINUE
096100121217           WHEN OTHER
096200200302              SET lncc_Err10                TO TRUE
096300121217              STRING lnc_OpenCursorError   DELIMITED BY SPACES
096400121217                 SPACES                     DELIMITED BY SIZE
096500121217                 SQLSTATE                   DELIMITED BY SIZE
096600121217              INTO Ws-Sql-Err-Short-Descr
096700121217              PERFORM SQLFailProcess
096800121217           END-EVALUATE.
096900121217
097000121217      * process level logic
097100121217       Process-Level-logic.
097200121217
097300121217           PERFORM Get-Current-Record.
097400121217
097500121217           IF CURR-CONTROLS NOT =  HIGH-VALUES
097600121217              IF CURR-LEVEL1 NOT = PREV-LEVEL1
097700121217                 MOVE li_AccountNo    OF lc_Master
097800121217                                   TO li_ActNo
097900121217                 MOVE li_ContractNo   OF lc_Master
098000121217                                   TO li_ContrNo
098100121217                 PERFORM Get-Investment-Funds-Sums
098200121217                 PERFORM Get-Dealer-Rep-code
098300160615157138* Commented the following routines as the calculated values
098400160615157138* are not being included in the extract
098500160615157138*          PERFORM Get-Maturity-Death-Values
098600160615157138*          PERFORM Get-GBV-AWD-Sums
098700121217                 PERFORM Get-Annuitant-Detail
098800121217              END-IF
098900180717
099000180717      *RFS179061 - Starts
099100180719              IF li_ActNo NOT = li_PrevActNo AND
099200180719                 li_ActNo NOT = 0
099300180719                 PERFORM Get-MFR-Details
099400180719              END-IF
099500180719              MOVE li_ActNo       TO li_PrevActNo
099600180719      *RFS179061 - End
099700180717
099800121217              MOVE CURR-CONTROLS          TO Prev-Controls
099900121217              PERFORM Detail-Processing
100000121217           END-IF.
100100121217
100200121217      * detail processing
100300121217
100400121217       Detail-Processing.
100500121217
100600121217
100700121217           INITIALIZE lc_MasterOut.
100800121217      * ------------------------------------------------
100900121217      *  Maturity-Benefit
101000121217      *      =    Guarantee-MATURITY-Value  {FROM FXSEGMATVA}
101100121217      *        - (Sum OF AWDs)              {FROM FXSEGSAWD}
101200121217      *        - (AWD-Carried-Over)         {FROM ACCONP}
101300121217      * ------------------------------------------------
101400121217           IF lc_ActTypeRule OF lc_Master   = lnc_3 OR
101500121217              lc_ActTypeRule OF lc_Master   = lnc_5
101600121217              MOVE ln_OrgGwa     OF lc_Master TO ln_GuaWthAmt
101700121217           ELSE
101800121217              MOVE ln_GuaWthAmt1 OF lc_Master TO ln_GuaWthAmt
101900121217           END-IF.
102000200219
102100200219      *RFS185473 - Starts
102200200225
102300200312           SET lc_SpousalIncIndNO   TO TRUE.
102400200225
102500200219           IF Lb_SEGEXTAAllowedYes
102600200219              PERFORM Get-LIF-RIF-DOB
102700200219           ELSE
102800200219              CONTINUE
102900200219           END-IF.
103000200310      *RFS185473 - Ends
103100121217              COMPUTE ln_RemGuaWthAmt =
103200121217              ln_GuaWthAmt1 OF lc_Master - ln_YtdGuaWthAmt OF lc_Master
103300121217
103400121217           MOVE lnc_0 TO li_ResetDate.
103500121217
103600121217           EXEC SQL
103700121217             SELECT coalesce(Max(Effect_Date), 0)
103800121217             INTO :li_ResetDate
103900121217             FROM MFAACCCRP
104000121217             WHERE Account_no  = :li_AcctNo
104100121217             AND Contract_no = :li_ContrNo
104200121217             AND Reversed <> :lnc_Y
104300121217             AND Reset_Type = :lnc_GDV
104400121217           END-EXEC.
104500121217
104600121217           MOVE li_ResetDate TO li_LastResetDateGDV
104700121217
104800121217           MOVE lnc_0 TO li_ResetDate.
104900121217
105000121217           EXEC SQL
105100121217             SELECT coalesce(Max(Effect_Date), 0)
105200121217             INTO :li_ResetDate
105300121217             FROM MFAACCCRP
105400121217             WHERE Account_no  = :li_AcctNo
105500121217             AND Contract_no = :li_ContrNo
105600121217             AND Reversed <> :lnc_Y
105700121217             AND Reset_Type = :lnc_GBV
105800121217           End-EXEC.
105900121217
106000121217           MOVE li_ResetDate TO li_LastResetDateGBV.
106100121217           MOVE CORR lc_Master         TO lc_MasterOut.
106200121217           SET li_IxAnn    TO 1.
106300121217           PERFORM VARYING li_IxAnn FROM 1 BY 1 UNTIL
106400121217                   li_IxAnn > lnc_3
106500121217           EVALUATE TRUE
106600121219           WHEN li_IxAnn      = lnc_1
106700121217              MOVE lc_AnnSeqno(li_IxAnn)     TO lc_AnnuitantSeqNo1
106800200304185473                                          OF lc_MasterOut
106900121217              MOVE lc_AnnLastName(li_IxAnn)  TO lc_AnnuitantLastName1
107000200304185473                                          OF lc_MasterOut
107100121217              MOVE lc_AnnInitial(li_IxAnn)   TO lc_AnnuitantInitial1
107200200304185473                                          OF lc_MasterOut
107300121217              MOVE lc_AnnFirstName(li_IxAnn) TO lc_AnnuitantFirstName1
107400200304185473                                          OF lc_MasterOut
107500121217              MOVE lc_AnnType(li_IxAnn)      TO lc_AnnuitantType1
107600200304185473                                          OF lc_MasterOut
107700121217              MOVE lc_AnnGender(li_IxAnn)    TO lc_AnnuitantGender1
107800200304185473                                          OF lc_MasterOut
107900121217              MOVE lc_AnnDob(li_IxAnn)       TO lc_AnnuitantDob1
108000200304185473                                          OF lc_MasterOut
108100121217              MOVE lc_AnnStatus(li_IxAnn)    TO lc_AnnuitantStatus1
108200200304185473                                          OF lc_MasterOut
108300200313185473        MOVE lc_DOD(li_IxAnn)          TO lc_ActualDOD
108400200313185473        MOVE lc_DODNotification(li_IxAnn)
108500200313                                             TO lc_DateOfDthNotif
108600121219           WHEN li_IxAnn      = lnc_2
108700121217              MOVE lc_AnnSeqno(li_IxAnn)     TO lc_AnnuitantSeqNo2
108800200304185473                                          OF lc_MasterOut
108900121217              MOVE lc_AnnLastName(li_IxAnn)  TO lc_AnnuitantLastName2
109000200304185473                                          OF lc_MasterOut
109100121217              MOVE lc_AnnInitial(li_IxAnn)   TO lc_AnnuitantInitial2
109200200304185473                                          OF lc_MasterOut
109300121217              MOVE lc_AnnFirstName(li_IxAnn) TO lc_AnnuitantFirstName2
109400200304185473                                          OF lc_MasterOut
109500121217              MOVE lc_AnnType(li_IxAnn)      TO lc_AnnuitantType2
109600200304185473                                          OF lc_MasterOut
109700121217              MOVE lc_AnnGender(li_IxAnn)    TO lc_AnnuitantGender2
109800200304185473                                          OF lc_MasterOut
109900121217              MOVE lc_AnnDob(li_IxAnn)       TO lc_AnnuitantDob2
110000200304185473                                          OF lc_MasterOut
110100121217              MOVE lc_AnnStatus(li_IxAnn)    TO lc_AnnuitantStatus2
110200200304185473                                          OF lc_MasterOut
110300200313185473        MOVE lc_DOD(li_IxAnn)          TO lc_ActualDOD2
110400200313185473        MOVE lc_DODNotification(li_IxAnn)
110500200313                                             TO lc_DateOfDthNotif2
110600121219           WHEN li_IxAnn      = lnc_3
110700121217              MOVE lc_AnnSeqno(li_IxAnn)     TO lc_AnnuitantSeqNo3
110800200304185473                                          OF lc_MasterOut
110900121217              MOVE lc_AnnLastName(li_IxAnn)  TO lc_AnnuitantLastName3
111000200304185473                                          OF lc_MasterOut
111100121217              MOVE lc_AnnInitial(li_IxAnn)   TO lc_AnnuitantInitial3
111200200304185473                                          OF lc_MasterOut
111300121217              MOVE lc_AnnFirstName(li_IxAnn) TO lc_AnnuitantFirstName3
111400200304185473                                          OF lc_MasterOut
111500121217              MOVE lc_AnnType(li_IxAnn)      TO lc_AnnuitantType3
111600200304185473                                          OF lc_MasterOut
111700121217              MOVE lc_AnnGender(li_IxAnn)    TO lc_AnnuitantGender3
111800200304185473                                          OF lc_MasterOut
111900121217              MOVE lc_AnnDob(li_IxAnn)       TO lc_AnnuitantDob3
112000200304185473                                          OF lc_MasterOut
112100121217              MOVE lc_AnnStatus(li_IxAnn)    TO lc_AnnuitantStatus3
112200200304185473                                          OF lc_MasterOut
112300121217           END-EVALUATE
112400121217           END-PERFORM.
112500121217
112600121217           MOVE CURR-CONTROLS          TO lc_Key OF lc_MasterOut.
112700121217           MOVE lnc_A                  TO
112800121217                          lc_Key OF lc_MasterOut (19:1).
112900121217
113000121217           MOVE ln_GuaWthBal        OF  lc_Master1
113100121217                TO ln_CalGuaWthBal  OF lc_MasterOut.
113200121217           MOVE ln_GuaWthAmt        OF  lc_Master1
113300121217                TO ln_CalGuaWthAmt  OF lc_MasterOut.
113400121217           MOVE ln_GuaBonBase       OF  lc_Master1
113500121217                TO ln_CalGuaBonBase OF lc_MasterOut.
113600121217           MOVE ln_RemGuaWthAmt     OF  lc_Master1
113700121217                TO ln_CalRemGuaWthAmt OF lc_MasterOut.
113800121217           MOVE li_LastResetDateGDV OF  lc_Master1
113900121217                TO li_CalLastResetDateGDV OF lc_MasterOut.
114000121217           MOVE li_LastResetDateGBV OF  lc_Master1
114100121217                TO li_CalLastResetDateGBV OF lc_MasterOut.
114200130606124000*    MOVE SPACES         TO lc_Brncd OF lc_MasterOut.
114300130606124000     MOVE lc_DlrCd1      TO lc_CalDlrCd OF lc_MasterOut.
114400130606124000     MOVE lc_RepCd1      TO lc_CalRepCd OF lc_MasterOut.
114500130606124000     MOVE lc_Brncd1      TO lc_Brncd    OF lc_MasterOut.
114600180719      *RFS179061 - Starts
114700180719           MOVE lc_HHName      TO lc_Mst-HHNAme OF lc_MasterOut.
114800180719           MOVE ln_MFRRate     TO ln_Mst-MFRRate OF lc_MasterOut.
114900180719           MOVE ln_TotAssetAmt TO ln_Mst-TotAssetAmt OF lc_MasterOut.
115000180719      *RFS179061 - End
115100200219
115200200219      *RFS185473 -Starts
115300200219           IF Lb_SEGEXTAAllowedYes
115400200224              PERFORM Additional-Details
115500200219           ELSE
115600200219              PERFORM WriteMasterOut
115700200219           END-IF.
115800200219
115900200219      *-------------------
116000200225        WriteMasterOut.
116100200219      *-------------------
116200200225            EXEC SQL
116300121217             INSERT INTO QTEMP/MASTEROUT
116400121217             VALUES
116500121217             :lc_MasterOut
116600200225            END-EXEC.
116700200219
116800200219
116900121217      * SQL error Checking
117000121217
117100121217           MOVE SQLSTATE TO Sw-Sql-States.
117200121217           EVALUATE TRUE
117300121217               WHEN Sw-Sql-Successful
117400121217               WHEN Sw-Sql-States = lnc_TableNotJournaled
117500121217                    CONTINUE
117600121217               WHEN OTHER
117700121217                    SET lncc_Err12         TO TRUE
117800121217                    STRING lnc_InsertMaster      DELIMITED BY SPACES
117900121217                       SPACES                 DELIMITED BY SIZE
118000121217                       SQLSTATE               DELIMITED BY SIZE
118100121217                       INTO Ws-Sql-Err-Short-Descr
118200121217                    PERFORM SQLFailProcess
118300121217           END-EVALUATE.
118400121217
118500121217       Get-Current-Record.
118600121217
118700121217      *       Fetch Cursor
118800121217           EXEC SQL
118900121217             FETCH
119000200219             NEXT
119100121217             FROM lcu_MstCursor
119200121217             INTO :lc_Master
119300121217           END-EXEC.
119400121217
119500121217      *            Check status after every IO.
119600121217      * If error encountered then write error information TO
119700121217      *            error table or display error info
119800121217
119900121217           MOVE SQLSTATE                   TO SW-SQL-STATES
120000121217
120100121217           EVALUATE TRUE
120200121217
120300121217              WHEN SW-SQL-SUCCESSFUL OR SW-SQL-WARNING
120400121217                 MOVE li_AccountNo  OF  lc_Master
120500121217                                       TO CURR-ACCOUNT
120600121217                 MOVE li_ContractNo OF  lc_Master
120700121217                                       TO CURR-CONTRACT
120800121217              WHEN SW-SQL-END
120900121217                 MOVE HIGH-VALUES          TO CURR-CONTROLS
121000121217                 MOVE SQLERRD(3)           TO PASS-NUM-RECORDS
121100121217                               OF COMM-CPPFSTS-PARAMETERS
121200121217                 MOVE lnc_End  TO PASS-DESCRIPTION-35
121300121217                               OF COMM-CPPFSTS-PARAMETERS
121400121217                 PERFORM STD-WRITE-INFO-DATA
121500121217
121600121217              WHEN OTHER
121700121217                 SET lncc_Err11            TO TRUE
121800121217                     STRING lnc_FetchCursorError  DELIMITED BY SPACES
121900121217                        SPACES                 DELIMITED BY SIZE
122000121217                        SQLSTATE               DELIMITED BY SIZE
122100121217                        INTO Ws-Sql-Err-Short-Descr
122200121217
122300121217                 PERFORM SQLFailProcess
122400121217
122500121217           END-EVALUATE.
122600180711
122700180711      *RFS179061 - Start
122800180711
122900180711      *-------------------------------
123000180711       Get-MFR-Details.
123100180711      *-------------------------------
123200180712           INITIALIZE lc_HHName.
123300180712
123400180724           SET lb_HHLDIVR_Yes  TO TRUE.
123500180711           EXEC SQL
123600180719             SELECT COALESCE(IVRHHP.LEGAL_LAST_NAME, " ")
123700180719               INTO :lc_HHName
123800180719             FROM MFAACCNTP ACCNTP
123900180719
124000180719             INNER JOIN MFAIVRHDP IVRHDP ON
124100180719             IVRHDP.INVESTOR_NO_2          = ACCNTP.INVESTOR_NO AND
124101211013      * RFS1118798 Starts
124102211013186584*      IVRHDP.ACCOUNT_NO             = ACCNTP.ACCOUNT_NO AND
124103211013      *      IVRHDP.HOUSEHOLD_LINKAGE_CODE = "MFB"
124104211013             IVRHDP.ACCOUNT_NO             = ACCNTP.ACCOUNT_NO
124105211013      * RFS1118798 End
124400180719
124500180719             INNER JOIN MFAIVRHHP IVRHHP ON
124800210823      * RFS1118798 Starts
124801211013      *      IVRHHP.INVESTOR_NO            = IVRHDP.INVESTOR_NO AND
124802211013      *      IVRHHP.HOUSEHOLD_LINKAGE_CODE = "MFB"
124803211013             IVRHHP.INVESTOR_NO            = IVRHDP.INVESTOR_NO
124900210823             AND
125000210823             IVRHHP.HOUSEHOLD_ID           = IVRHDP.HOUSEHOLD_ID
125100210823      * RFS1118798 End
125200180719
125300180719             WHERE ACCNTP.ACCOUNT_NO       = :li_ActNo
125301211013      * RFS1118798 Starts
125302211013             AND IVRHDP.HOUSEHOLD_LINKAGE_CODE = "MFB"
125303211013             AND IVRHHP.HOUSEHOLD_LINKAGE_CODE = "MFB"
125304211013             FETCH FIRST ROW ONLY
125305211013      * RFS1118798 End
125400180712           END-EXEC.
125500180712
125600180717           MOVE SQLSTATE TO Sw-Sql-States.
125700180717           EVALUATE TRUE
125800180717           WHEN Sw-Sql-Successful
125900180720             OR Sw-Sql-Warning
126000180724              CONTINUE
126100180724           WHEN Sw-Sql-End
126200180724              SET lb_HHLDIVR_No  TO TRUE
126300180717           WHEN OTHER
126400180720              SET lncc_Err18               TO TRUE
126500180720              STRING lnc_GetHHName         DELIMITED BY SPACES
126600180720                 SPACES                    DELIMITED BY SIZE
126700180720                 SQLSTATE                  DELIMITED BY SIZE
126800180720              INTO Ws-Sql-Err-Short-Descr
126900180720              PERFORM SQLFailProcess
127000180717           END-EVALUATE.
127100180717
127200180712           INITIALIZE ln_TotAssetAmt,
127300180724                      lc_MFRSchdCode,
127400180724                      ln_MFRRate.
127500180724
127600180724           IF lb_HHLDIVR_Yes
127700180712           EXEC SQL
127800180719             SELECT COALESCE(HHLDIVR.TOT_IVR_ASSETS_AMT, 0),
127900180719                    COALESCE(CASE WHEN
128000180719                                  HHLDIVR.OVR_MFR_SCHEDULE_CODE <> " "
128100180719                                  THEN HHLDIVR.OVR_MFR_SCHEDULE_CODE
128200180719                             ELSE HHLDIVR.MFR_SCHEDULE_CODE  END , " ")
128300180719              INTO :ln_TotAssetAmt,
128400180719                   :lc_MFRSchdCode
128500180719             FROM WRKHHLDIVR HHLDIVR
128600180719             WHERE HHLDIVR.ACCOUNT_NO        = :li_ActNo
128700180719               AND HHLDIVR.TRADE_DATE        = :li_MfrMaxDate
128800180719               AND HHLDIVR.ASSETS_BY_RULE    = "3"
128900180719             FETCH FIRST ROW ONLY
129000180724           END-EXEC
129100180711
129200180724           MOVE SQLSTATE TO Sw-Sql-States
129300180717           EVALUATE TRUE
129400200312              WHEN Sw-Sql-Successful
129500180720                OR Sw-Sql-Warning
129600180724                   CONTINUE
129700180724              WHEN Sw-Sql-End
129800180724                   SET lb_HHLDIVR_No  TO TRUE
129900180719              WHEN OTHER
130000180720                   SET lncc_Err15          TO TRUE
130100180720              STRING lnc_GetMFRDtl         DELIMITED BY SPACES
130200180720                 SPACES                    DELIMITED BY SIZE
130300180720                 SQLSTATE                  DELIMITED BY SIZE
130400180720              INTO Ws-Sql-Err-Short-Descr
130500180720              PERFORM SQLFailProcess
130600180724           END-EVALUATE
130700180724           END-IF.
130800180711
130900180724           IF lb_HHLDIVR_Yes
131000180712
131100180719           EXEC SQL
131200180719             SELECT COALESCE(MFR_RATE,0)
131300180719              INTO :ln_MFRRate
131400180719             FROM MFAMFRSCP
131500180719             WHERE MFR_SCHEDULE_CODE  = :lc_MFRSchdCode  AND
131600180719                   UPPER_LIMIT       >= :ln_TotAssetAmt
131700180719             ORDER BY UPPER_LIMIT ASC
131800180719             FETCH FIRST ROW ONLY
131900180724           END-EXEC
132000180711
132100180724           MOVE SQLSTATE TO Sw-Sql-States
132200180719           EVALUATE TRUE
132300180720              WHEN Sw-Sql-Successful
132400180720                OR Sw-Sql-Warning
132500180720                OR Sw-Sql-End
132600180719                   CONTINUE
132700180719              WHEN OTHER
132800180720                   SET lncc_Err16          TO TRUE
132900180720              STRING lnc_GetMFRRate        DELIMITED BY SPACES
133000180720                 SPACES                    DELIMITED BY SIZE
133100180720                 SQLSTATE                  DELIMITED BY SIZE
133200180720              INTO Ws-Sql-Err-Short-Descr
133300180720              PERFORM SQLFailProcess
133400180724           END-EVALUATE
133500180724           END-IF.
133600180711      *RFS179061 - Ends
133700121217
133800121217       Get-Investment-Funds-Sums.
133900121217      * --------------------------------------------
134000121217           MOVE li_AccountNo       OF lc_Master   TO li_AcctNo
134100121217           MOVE li_ContractNo      OF lc_Master   TO li_ContrNo
134200121217           EXEC SQL
134300121217             SELECT
134400121217               COALESCE(Sum(GUAR_WITHDRAWAL_BASE_VALUE),0),
134500121217               COALESCE(Sum(GUAR_WITHDRAWAL_BALANCE),0)
134600121217             INTO
134700121217               :ln_GuaWthBal,
134800121217               :ln_GuaBonBase
134900121217             FROM
135000121217               MFAACCCIP
135100121217             WHERE
135200121217               ACCOUNT_NO =  :li_AcctNo  AND
135300121217               CONTRACT_NO = :li_ContrNo
135400121217           END-EXEC.
135500200306
135600121217       Get-Dealer-Rep-Code.
135700121217           SET lb_CommSplit_NotExistS TO TRUE
135800121217
135900121217******* Note: Since file MFAACDRSP with field ACCT_SPLIT_EFFECTIVE_DATE
136000121217******* will be promoted in release 13.2, it has been commented out
136100121217******* for release 13.1 and will be reinstated in release 13.2
136200121217
136300121217      * TO get the commissionable split percent OF each account
136400121217
136500121217      *    EXEC SQL
136600121217      *      SELECT B.DEALER_CODE,B.DEALER_REP_CODE
136700121217      *      INTO : lc_DlrCd1,:lc_RepCd1
136800121217      *      FROM     MFAACDRSP B
136900121217      *      WHERE B.ACCT_SPLIT_EFFECTIVE_DATE <=
137000121217      *     (SELECT MAX(ACCT_SPLIT_EFFECTIVE_DATE)
137100121217      *      FROM
137200121217      *      MFAACDRSP
137300121217      *      WHERE
137400121217      *          ACCOUNT_NO       = :li_AcctNo
137500121217      *      AND   DEALER_CODE      = :lc_DlrCd
137600121217      *      AND   DEALER_REP_CODE  = :lc_RepCd)
137700121217      *      AND   B.ACCOUNT_NO     = :li_AcctNo
137800121217      *      AND   B.DEALER_CODE    = :lc_DlrCd
137900121217      *      AND   B.DEALER_REP_CODE = :lc_RepCd
138000121217      *    END-EXEC.
138100121217
138200121217      *    IF SQLCODE = lnc_0
138300121217      *       SET lb_CommSplit_Exists TO TRUE
138400121217      *    END-IF.
138500121217      *
138600121217      *    IF SQLCODE = lnc_100
138700121217      *       SET lb_CommSplit_NotExistS TO TRUE
138800121217      *       CONTINUE
138900121217      *    END-IF.
139000130606
139100130606124000* Start - Get Commission Agent
139200130606  ||       MOVE SPACES TO lc_DlrCd1, lc_RepCd1, lc_Brncd1.
139300130606  ||       EXEC SQL
139400130606  ||         SELECT DEALER_CODE, DEALER_REP_CODE
139500130606  ||         INTO   :lc_DlrCd1,:lc_RepCd1
139600130606  ||         FROM   MFAACDRSP
139700130606  ||         WHERE
139800130606  ||                ACCOUNT_NO = :li_AcctNo AND
139900130606  ||                ACCT_SPLIT_EFFECTIVE_DATE <= :lc_AsAtDateN
140000130606  ||         FETCH FIRST ROW ONLY
140100130606  ||       END-EXEC.
140200130606  ||
140300130606  ||       IF SQLCODE = lnc_0
140400130606  ||          SET lb_CommSplit_Exists TO TRUE
140500130606  ||       END-IF.
140600130606  ||
140700130606  ||       IF lb_CommSplit_NotExistS
140800130606  ||          MOVE lc_DlrCd  TO lc_DlrCd1
140900130606  ||          MOVE lc_RepCd  TO lc_RepCd1
141000130606  ||       END-IF.
141100130606124000* End
141200121217
141300130606124000*    IF lb_CommSplit_Exists
141400130606124000*       MOVE lc_DlrCd1  TO lc_CalDlrCd
141500130606124000*       MOVE lc_RepCd1  TO lc_CalRepCd
141600130606124000*      ELSE
141700130606124000*         MOVE lc_DlrCd   TO lc_CalDlrCd
141800130606124000*         MOVE lc_RepCd   TO lc_CalRepCd
141900130606124000*    END-IF.
142000130606
142100130606124000* Start - Get Dealer Branch Code
142200130606  ||       EXEC SQL
142300130606  ||         SELECT BRANCH_CODE
142400130606  ||         INTO   :lc_BrnCd1
142500130606  ||         FROM   MFADEAP
142600130606  ||         WHERE
142700130606  ||                DEALER_CODE = :lc_DlrCd1
142800130606  ||         FETCH FIRST ROW ONLY
142900130606  ||       END-EXEC.
143000130606124000* End
143100160615157138* Begin commented the logic
143200160615      *Get-Maturity-Death-Values.
143300121217
143400121217      * --------------------------------------------
143500121217      *  FXSEGMATVA  Obtain
143600121217      *             - Guaranteed Maturity Value
143700121217      *             - Guaranteed Death Value
143800121217      * --------------------------------------------
143900160615      *    INITIALIZE           pi_SegMatValAccountNo
144000160615      *                          pi_SegMatValContractNo
144100160615      *                          pc_SegMatValMode
144200160615      *                          pi_SegMatValGMV
144300160615      *                          pi_SegMatValGDV
144400160615      *                          pi_GMPercent
144500160615      *                          pi_GDPercent
144600160615      *                          pi_CurrMarketValue
144700160615      *                          pi_TradeDate
144800160615      *                          pc_SegMatValReturn.
144900160615      *
145000160615      *    SET pb_GuarDthAndCurrMarketCS TO TRUE.
145100160615      *    MOVE li_AccountNo OF lc_Master
145200160615      *                                TO pi_SegMatValAccountNo.
145300160615      *    MOVE li_ContractNo OF lc_Master
145400160615      *                                TO pi_SegMatValContractNo.
145500160615121426*    MOVE  SPACES      TO    pc_SegMatValInvCode
145600160615      *    CALL "FXSEGMATVA" USING pi_SegMatValAccountNo
145700160615      *                             pi_SegMatValContractNo
145800160615      *                             pc_SegMatValMode
145900160615121426*                             pc_SegMatValInvCode
146000160615      *                             pi_SegMatValGMV
146100160615      *                             pi_SegMatValGDV
146200160615      *                             pi_GMPercent
146300160615      *                             pi_GDPercent
146400160615      *                             pi_CurrMarketValue
146500160615      *                             pi_TradeDate
146600160615      *                             pc_SegMatValReturn.
146700160615      *
146800160615      *    COMPUTE ln_SegMatVaGuarMatVal    = pi_SegMatValGMV.
146900160615      *Get-GBV-AWD-Sums.
147000121217
147100121217      *  FXSUMAWDT : Obtain
147200121217      *             - sum OF all AWDs for GBV
147300121217      * --------------------------------------------
147400160615      *    INITIALIZE    li_SegsAwdAccountNo,
147500160615      *                  li_SegsAwdContractNo,
147600160615      *                  lc_SegsAwdResetType,
147700160615      *                  li_SegsAwdDate,
147800160615      *                  ln_SegsAwdAmount,
147900160615      *                  lc_IndependentGDV.
148000160615      *
148100160615      *    MOVE li_AccountNo OF lc_Master
148200160615      *                                TO  li_SegsAwdAccountNo.
148300160615      *    MOVE li_AccountNo OF lc_Master
148400160615      *                                TO  li_SegsAwdContractNo.
148500160615      *    MOVE lnc_GBV                 TO lc_SegsAwdResetType.
148600160615      *    MOVE lc_AsAtDateN        TO li_SegsAwdDate.
148700160615      *
148800160615      *    CALL "FXSUMAWDT" USING li_SegsAwdAccountNo,
148900160615      *                           li_SegsAwdContractNo,
149000160615      *                           lc_SegsAwdResetType,
149100160615      *                           li_SegsAwdDate,
149200160615      *                           ln_SegsAwdAmount,
149300160615      *                           lc_IndependentGDV.
149400160615      *
149500160615      *    COMPUTE ln_GBVsAWDGuarValAwdSum = ln_SegsAwdAmount.
149600160615157138* End commenting
149700121217
149800121217       Get-Annuitant-Detail.
149900121217
150000121217      * Decalre the cursor
150100121217
150200121217           EXEC SQL
150300121217             DECLARE lcu_AnnDtl CURSOR FOR
150400121217             SELECT COALESCE(A1.ANNUITANT_SEQ_NO,0),
150500121217                  COALESCE(A1.LAST_NAME," "),
150600121217                  COALESCE(A1.INITIALS," "),
150700121217                  COALESCE(A1.FIRST_NAME," "),
150800121217                  COALESCE(A1.DEFAULT_FLAG," "),
150900121217                  COALESCE(A1.SEX," "),
151000121217                  COALESCE(A1.DATE_OF_BIRTH,0),
151100200310                  COALESCE(A1.ANNUITANT_STATUS," ")
151200200313185473            ,COALESCE(A1.DATE_OF_DEATH,0),
151300200313185473            COALESCE(A1.DEATH_NOTIFICATION_DATE,0)
151400121217             FROM MFAACCNNP A1
151500121217             INNER JOIN  MFAACCNTP ACCNTP  ON
151600121217                  A1.ACCOUNT_NO = ACCNTP.ACCOUNT_NO
151700121217             INNER JOIN  MFAACCANP ACCANP  ON
151800121217                  A1.ACCOUNT_NO  = ACCANP.ACCOUNT_NO AND
151900121217                  A1.ANNUITANT_SEQ_NO = ACCANP.ANNUITANT_SEQ_NO
152000121217             WHERE ACCANP.ACCOUNT_NO = :li_ActNo       AND
152100121219                 ACCANP.CONTRACT_NO = :li_ContrNo
152200121219             ORDER BY
152300121219                 A1.ANNUITANT_SEQ_NO  ASC
152400121217           END-EXEC.
152500121217
152600121217
152700121217
152800121217      * Opening the cursor
152900121217
153000121217           EXEC SQL
153100121217             OPEN lcu_AnnDtl
153200121217           END-EXEC.
153300121217
153400121217      * SQL error Checking
153500121217
153600121217           MOVE SQLSTATE TO Sw-Sql-States.
153700121217           EVALUATE TRUE
153800121217              WHEN Sw-Sql-Successful
153900121217              WHEN Sw-Sql-States = lnc_TableNotJournaled
154000121217                 CONTINUE
154100121217              WHEN OTHER
154200121217                 SET lncc_Err10                TO TRUE
154300121217                 STRING lnc_OpenCursorError   DELIMITED BY SPACES
154400121217                    SPACES              DELIMITED BY SIZE
154500121217                    SQLSTATE            DELIMITED BY SIZE
154600121217                    INTO Ws-Sql-Err-Short-Descr
154700121217                 PERFORM SQLFailProcess
154800121217           END-EVALUATE.
154900121217
155000121217           INITIALIZE lc_AnnuitantDtl_Arr.
155100121217           EXEC SQL
155200121217             FETCH  NEXT FROM lcu_AnnDtl FOR 3 ROWS
155300121217             INTO   :ltb_AnnuitantDtl
155400121217           END-EXEC
155500121217
155600121217           MOVE SQLSTATE TO lc_SqlStates
155700121217           EVALUATE TRUE
155800121217               WHEN SW-SQL-SUCCESSFUL OR SW-SQL-WARNING
155900121217                  EXEC SQL
156000121217                    CLOSE lcu_AnnDtl
156100121217                  END-EXEC
156200121217               WHEN SW-SQL-END
156300121217                  EXEC SQL
156400121217                    CLOSE lcu_AnnDtl
156500121217                  END-EXEC
156600121217                  MOVE lnc_End1
156700121217                               TO PASS-DESCRIPTION-35
156800121217                               OF COMM-CPPFSTS-PARAMETERS
156900121217                  PERFORM STD-WRITE-INFO-DATA
157000121217               WHEN OTHER
157100121217                  SET Lncc_Err14  TO TRUE
157200121217                  STRING lnc_ErrorGetAnnDtl DELIMITED BY SPACES,
157300121217                     SPACES DELIMITED BY SIZE,
157400121217                     SQLSTATE DELIMITED BY SIZE
157500121217                     INTO Ws-Sql-Err-Short-Descr
157600121217                  PERFORM SQLFailProcess
157700121217
157800121217           END-EVALUATE.
157900200306
158000200312      *RFS185473 - Starts
158100200312      * -----------------------------
158200200312        CreateAlternateMASTEROUT.
158300200312      * -----------------------------
158400200312
158500200312      * Drop the table and create the output work file.
158600200312
158700200312           EXEC SQL
158800200312                DROP TABLE QTEMP/MASTEROUT
158900200312           END-EXEC
159000200312
159100200312           EXEC SQL
159200200312             CREATE TABLE QTEMP/MASTEROUT (
159300200312             REC_KEY                CHAR (19) NOT NULL WITH DEFAULT
159400200312             ,REC_TYPE               CHAR (3) NOT NULL WITH DEFAULT
159500200312             ,ACCOUNT_NO      NUMERIC (9, 0)  NOT NULL WITH DEFAULT
159600200312             ,CONTRACT_NO     NUMERIC (9, 0)  NOT NULL WITH DEFAULT
159700200312             ,ACCOUNT_TYPE_CODE      CHAR (5) NOT NULL WITH DEFAULT
159800200312             ,NOMINEE_ACCOUNT_TYPE   CHAR (5) NOT NULL WITH DEFAULT
159900200312             ,DEALER_CODE            CHAR (4) NOT NULL WITH DEFAULT
160000200312             ,DEALER_REP_CODE        CHAR (6) NOT NULL WITH DEFAULT
160100200312             ,BRANCH_CODE            CHAR (6) NOT NULL WITH DEFAULT
160200200312             ,CONTRACT_PROV          CHAR (3) NOT NULL WITH DEFAULT
160300200312             ,ANNUITANT_SEQ_NO_1     CHAR (3) NOT NULL WITH DEFAULT
160400200312             ,ANNUITANT_LAST_NAME_1  CHAR (20) NOT NULL WITH DEFAULT
160500200312             ,ANNUITANT_INITIAL_1    CHAR (3) NOT NULL WITH DEFAULT
160600200312             ,ANNUITANT_FIRST_NAME_1 CHAR (20) NOT NULL WITH DEFAULT
160700200312             ,ANNUITANT_TYPE_1       CHAR (1) NOT NULL WITH DEFAULT
160800200312             ,ANNUITANT_GENDER_1     CHAR (1) NOT NULL WITH DEFAULT
160900200312             ,ANNUITANT_DOB_1        CHAR (9) NOT NULL WITH DEFAULT
161000200312             ,ANNUITANT_STATUS_1     CHAR (1) NOT NULL WITH DEFAULT
161100200312             ,ANNUITANT_SEQ_NO_2     CHAR (3) NOT NULL WITH DEFAULT
161200200312             ,ANNUITANT_LAST_NAME_2  CHAR (20) NOT NULL WITH DEFAULT
161300200312             ,ANNUITANT_INITIAL_2    CHAR (3) NOT NULL WITH DEFAULT
161400200312             ,ANNUITANT_FIRST_NAME_2 CHAR (20) NOT NULL WITH DEFAULT
161500200312             ,ANNUITANT_TYPE_2       CHAR (1) NOT NULL WITH DEFAULT
161600200312             ,ANNUITANT_GENDER_2     CHAR (1) NOT NULL WITH DEFAULT
161700200312             ,ANNUITANT_DOB_2        CHAR (9) NOT NULL WITH DEFAULT
161800200312             ,ANNUITANT_STATUS_2     CHAR (1) NOT NULL WITH DEFAULT
161900200312             ,ANNUITANT_SEQ_NO_3     CHAR (3) NOT NULL WITH DEFAULT
162000200312             ,ANNUITANT_LAST_NAME_3  CHAR (20) NOT NULL WITH DEFAULT
162100200312             ,ANNUITANT_INITIAL_3    CHAR (3) NOT NULL WITH DEFAULT
162200200312             ,ANNUITANT_FIRST_NAME_3 CHAR (20) NOT NULL WITH DEFAULT
162300200312             ,ANNUITANT_TYPE_3       CHAR (1) NOT NULL WITH DEFAULT
162400200312             ,ANNUITANT_GENDER_3     CHAR (1) NOT NULL WITH DEFAULT
162500200312             ,ANNUITANT_DOB_3        CHAR (9) NOT NULL WITH DEFAULT
162600200312             ,ANNUITANT_STATUS_3     CHAR (1) NOT NULL WITH DEFAULT
162700200312             ,GuaWthBal       NUMERIC (13, 2)  NOT NULL WITH DEFAULT
162800200312             ,GuaWthAmt       NUMERIC (13, 2)  NOT NULL WITH DEFAULT
162900200312             ,GuaBonBase      NUMERIC (13, 2)  NOT NULL WITH DEFAULT
163000200312             ,ConRrifMinmt    NUMERIC (13, 2)  NOT NULL WITH DEFAULT
163100200312             ,RemGuaWthAmte   NUMERIC (13, 2)  NOT NULL WITH DEFAULT
163200200312             ,LastResetDateGDV  NUMERIC (8, 0)  NOT NULL WITH DEFAULT
163300200312             ,LastResetDateGBV  NUMERIC (8, 0)  NOT NULL WITH DEFAULT
163400200312             ,OrgGwa            NUMERIC (13, 2)  NOT NULL WITH DEFAULT
163500200312             ,AWdAmt            NUMERIC (13, 2)  NOT NULL WITH DEFAULT
163600200312             ,AwdSpliTOption    CHAR (1) NOT NULL WITH DEFAULT
163700200312             ,PayFrequency      CHAR (2) NOT NULL WITH DEFAULT
163800200312             ,HHLD_NAME         CHAR (35)       NOT NULL WITH DEFAULT
163900200312             ,MFR_RATE          NUMERIC (07, 6) NOT NULL WITH DEFAULT
164000200312             ,TOT_ASSET_AMT     NUMERIC (13, 2) NOT NULL WITH DEFAULT
164100200615101532       ,SpousalIncInd     CHAR (1) NOT NULL WITH DEFAULT
164200200312             ,ActualDOD         CHAR (9) NOT NULL WITH DEFAULT
164300200312             ,DateofDthNotif    CHAR (9) NOT NULL WITH DEFAULT
164400200312             ,ActualDOD2        CHAR (9) NOT NULL WITH DEFAULT
164500200312             ,DateofDthNotif2   CHAR (9) NOT NULL WITH DEFAULT
164600200312             ,AlternateAcc      CHAR(12) NOT NULL WITH DEFAULT
164700200615101532*      ,SpousalIncInd     CHAR (1) NOT NULL WITH DEFAULT
164800210416      *RFS186584 - Starts
164900210416             ,InvStrcode        CHAR (5) NOT NULL WITH DEFAULT
165000210416             ,Resetstopdate     NUMERIC (8, 0) NOT NULL WITH DEFAULT
165100210430             ,HLIHHname         CHAR (35) NOT NULL WITH DEFAULT
165200210430             ,HLDHHname         CHAR (35) NOT NULL WITH DEFAULT
165300210416             ,GuarResetoption   CHAR (1) NOT NULL WITH DEFAULT
165400210416             ,Paymentoption     CHAR (1) NOT NULL WITH DEFAULT
165500210416             ,MatResetfeefund   CHAR (5) NOT NULL WITH DEFAULT
165600210416             ,DthResetfeefund   CHAR (5) NOT NULL WITH DEFAULT
165700210421             ,GMWBRiderind      CHAR (1) NOT NULL WITH DEFAULT
165800210416             ,GMWBEffdate       NUMERIC (8, 0)  NOT NULL WITH DEFAULT
165900210416             ,CurrentLIWB       NUMERIC (13, 2) NOT NULL WITH DEFAULT
166000210416             ,NextLIWB          NUMERIC (13, 2) NOT NULL WITH DEFAULT
166100210416             ,CurrentBIB        NUMERIC (13, 2) NOT NULL WITH DEFAULT
166200210416             ,NextBIB           NUMERIC (13, 2) NOT NULL WITH DEFAULT
166300210416             ,CurrentLIA        NUMERIC (13, 2) NOT NULL WITH DEFAULT
166400210416             ,NextLIA           NUMERIC (13, 2) NOT NULL WITH DEFAULT
166500210416             ,DPI               CHAR (1) NOT NULL WITH DEFAULT
166600210416             ,YTDGWA            NUMERIC (13, 2) NOT NULL WITH DEFAULT
166700210416             ,GMWBFee           CHAR (5) NOT NULL WITH DEFAULT
166800210423             ,GMWBTotfeefactor  NUMERIC (23, 6) NOT NULL WITH DEFAULT
166900210416             ,YTDGMWB           NUMERIC (13, 2) NOT NULL WITH DEFAULT
167000210416             ,NextMVResetdate   NUMERIC (8, 0)  NOT NULL WITH DEFAULT
167100210416             ,Ridertype         CHAR (1) NOT NULL WITH DEFAULT
167200211007      * RFS187570 Starts
167300211007      *      ,Advfeerate        NUMERIC (07, 2) NOT NULL WITH DEFAULT
167400211007             ,Advfeerate        NUMERIC (06, 3) NOT NULL WITH DEFAULT
167500210416             ,LIBEra            CHAR (5) NOT NULL WITH DEFAULT
167600210914      * RFS187570 Starts
167700210914      *      ,MFERate           NUMERIC (07, 2) NOT NULL WITH DEFAULT
167800210914      *      ,MFETier           CHAR (21) NOT NULL WITH DEFAULT
167900210914      *      ,MFRRate           NUMERIC (09, 6) NOT NULL WITH DEFAULT
168000210914      *      ,MFRRebatetier     CHAR (19) NOT NULL WITH DEFAULT
168100210914      * RFS187570 Ends
168200210416      *RFS186584 - End
168300200312             )
168400200312           END-EXEC.
168500200312
168600200310      *-------------------
168700200310        Get-LIF-RIF-DOB.
168800200310      *-------------------
168900200312           INITIALIZE li_MinDateOfBirth.
169000200312
169100200310           EXEC SQL
169200200313              SELECT
169300200316                 COALESCE(MIN(
169400200316                    CASE WHEN ACCTYP.ACCOUNT_TYPE_RULE IN ("3")
169500200313                    THEN IFNULL(ACRIFP.CALC_DATE_OF_BIRTH, 0)
169600200313                    WHEN ACCTYP.ACCOUNT_TYPE_RULE IN ("5")
169700200313                    THEN IFNULL(ACLIFP.CALC_DATE_OF_BIRTH, 0)
169800200316                    ELSE 0 END),0)
169900200313            INTO :li_MinDateOfBirth
170000200313            FROM MFAACCNTP ACCNTP
170100200313            INNER JOIN MFAIVRP   IVRP   ON
170200200313            IVRP.INVESTOR_NO            = ACCNTP.INVESTOR_NO
170300200313            INNER JOIN MFAACCTYP ACCTYP ON
170400200313            ACCTYP.ACCOUNT_TYPE_CODE    = ACCNTP.ACCOUNT_TYPE_CODE
170500200313            LEFT OUTER JOIN MFAACRIFP ACRIFP ON
170600200313            ACRIFP.ACCOUNT_NO           = ACCNTP.ACCOUNT_NO
170700200313            LEFT OUTER JOIN MFAACLIFP ACLIFP ON
170800200313            ACLIFP.ACCOUNT_NO           = ACCNTP.ACCOUNT_NO
170900200313            WHERE ACCNTP.ACCOUNT_NO     = :li_AcctNo
171000200313            END-EXEC.
171100200313
171200200310      *   SQL error Checking
171300200310               MOVE SQLSTATE TO Sw-Sql-States.
171400200310               EVALUATE TRUE
171500200310                 WHEN Sw-Sql-Successful
171600200310                  OR Sw-Sql-Warning
171700200310                  OR Sw-Sql-End
171800200310                 WHEN Sw-Sql-States = lnc_TableNotJournaled
171900200310                    CONTINUE
172000200310                 WHEN OTHER
172100200310                   SET    lncc_Err19             TO TRUE
172200200310                   STRING lnc_GetDOBError        DELIMITED BY SPACES
172300200310                   SPACES                        DELIMITED BY SIZE
172400200310                   SQLSTATE                      DELIMITED BY SIZE
172500200310                   INTO Ws-Sql-Err-Short-Descr
172600200310                   PERFORM SQLFailProcess
172700200310               END-EVALUATE.
172800200312
172900200312           INITIALIZE li_SpousalDateOfBirth.
173000200312
173100200310           EXEC SQL
173200200310               SELECT COALESCE(MIN(A.DATE_OF_BIRTH),0)
173300200310               INTO :li_SpousalDateOfBirth
173400200310               FROM MFAIVRSPP A
173500200310               JOIN MFAACCNTP B ON A.INVESTOR_NO = B.INVESTOR_NO
173600200310               WHERE ACCOUNT_NO = :li_AcctNo
173700200310           END-EXEC.
173800200310
173900200310           EVALUATE TRUE
174000200310                WHEN li_MinDateOfBirth EQUAL li_SpousalDateOfBirth
174100200310                AND  li_MinDateOfBirth       NOT EQUAL 0
174200200310                AND  li_SpousalDateOfBirth   NOT EQUAL 0
174300200310                SET  Lc_SpousalIncIndYES     TO  TRUE
174400200310           END-EVALUATE.
174500200310
174600200310      *    SQL error Checking
174700200310               MOVE SQLSTATE TO Sw-Sql-States.
174800200310               EVALUATE TRUE
174900200310                 WHEN Sw-Sql-Successful
175000200310                 WHEN Sw-Sql-States = lnc_TableNotJournaled
175100200310                    CONTINUE
175200200310                 WHEN OTHER
175300200310                   SET    lncc_Err20             TO TRUE
175400200310                   STRING lnc_GetSpousalDOB      DELIMITED BY SPACES
175500200310                   SPACES                        DELIMITED BY SIZE
175600200310                   SQLSTATE                      DELIMITED BY SIZE
175700200310                   INTO Ws-Sql-Err-Short-Descr
175800200310                   PERFORM SQLFailProcess
175900200310               END-EVALUATE.
176000200306      *----------------------
176100200306          Additional-Details.
176200200306      *---------------------
176300200306
176400200306            MOVE CORR lc_MasterOut  TO  lc_MasterAlt.
176500200306            PERFORM Get-Alternate-Account.
176600210416      *RFS186584 - Starts
176700210419            IF li_ActNo NOT = li_PrevActNo1 AND
176800210416               li_ActNo NOT = 0
176900210416               PERFORM Get-Accountrelatedvalues
177000210416            END-IF
177100210416            MOVE li_ActNo       TO li_PrevActNo1
177200210416      *RFS186584 - End
177300200306            PERFORM WriteMasterOut2.
177400200306
177500200306      *--------------------------
177600200306        Get-Alternate-Account.
177700200306      *--------------------------
177800200312           INITIALIZE  lc_AlternateAcct.
177900200312
178000200306           EXEC SQL
178100200312             SELECT COALESCE(actxref.ACCNORIG, " ")
178200200306              INTO :lc_AlternateAcct
178300200306                 FROM CNVACTXREF actxref
178400200306                  WHERE actxref.Account_no = :li_ActNo
178500200306           END-EXEC.
178600200306
178700200306      * SQL error Checking
178800200306
178900200306            MOVE SQLSTATE TO Sw-Sql-States.
179000200306            EVALUATE TRUE
179100200306                WHEN Sw-Sql-Successful
179200200310                OR Sw-Sql-Warning
179300200310                OR Sw-Sql-End
179400200306                WHEN Sw-Sql-States = lnc_TableNotJournaled
179500200306                     CONTINUE
179600200306                WHEN OTHER
179700200310                     SET lncc_Err21         TO TRUE
179800200306                     STRING lnc_AltAcct        DELIMITED BY SPACES
179900200306                        SPACES                 DELIMITED BY SIZE
180000200306                        SQLSTATE               DELIMITED BY SIZE
180100200306                        INTO Ws-Sql-Err-Short-Descr
180200200306                     PERFORM SQLFailProcess
180300200306            END-EVALUATE.
180400200306      *-------------------------
180500200306         WriteMasterOut2.
180600200306      *-------------------------
180700200306
180800200306            EXEC SQL
180900200306             INSERT INTO QTEMP/MASTEROUT
181000200306             VALUES
181100200306             :lc_MasterAlt
181200200310            END-EXEC.
181300200306      *RFS185473 - Ends
181400210416
181500210416      *RFS186584 - Starts
181600210506      *--------------------------
181700210416       Get-Accountrelatedvalues.
181800210914      *--------------------------
181900210506
182000210610           Initialize ln_Advfeerate
182100210914      * RFS187570 Starts
182200210914      *               ln_MFERate
182300210914      *               lc_MFEtier
182400210914      *               ln_MFRRate1
182500210914      *               lc_MFRRebatetier.
182600210914      * RFS187570 Ends
182700210510           MOVE lc_AccGrpinvseries to lc_AccGrpinvseriescd.
182800210510           MOVE ln_Resetstopdte  to ln_Resetstopdate.
182900210510           MOVE ln_GMWBEffdate   to ln_GMWBEffetivedate.
183000210510           MOVE ln_CurrentLIWB   to ln_CurrentLIWBA.
183100210510           MOVE ln_NextLIWB      to ln_NextLIWBA.
183200210510           MOVE ln_CurrentBIB    to ln_CurrentBIBA.
183300210610           MOVE ln_NextBIB       to ln_NextBIBA.
183400210510           MOVE ln_CurrentLIA    to ln_CurrentLIAA.
183500210525           MOVE ln_NextLIA       to ln_NextLIAA.
183501211013      *RFS1118605 - Start
183502211013      *    PERFORM CheckMFAACLBENP.
183503211013           IF li_ACLBENP_AccNo NOT = ZEROES
183504211013      *    IF li_Count > 0
183505211013      *RFS1118605 - End
183800210525              PERFORM GetMFASGGWBRP
183900210525           ELSE
184000210525              MOVE Spaces        to lc_DPIndicator
184100210525           END-IF.
184200210510           MOVE ln_YTDGWA        to ln_YTDGWAmount.
184300210510           MOVE lc_Ridertype     to lc_Ridertypeind.
184400210421           IF lc_Ridertype = lncc_S
184500210510              MOVE lncc_3        to lc_Ridertypeind
184600210421           Else
184700210421              IF lc_Ridertype = lncc_J
184800210510                 MOVE lncc_4     to lc_Ridertypeind
184900210421              End-if
185000210421           End-if.
185100210510           MOVE lc_LIBEra        to lc_LIBInvstseries.
185200200306
185300210518      *Get GMWBRiderindicator
185400210518
185500210518           MOVE lncc_No to lc_GMWBRiderind.
185501211013      *RFS1118605 - Start
185502211013      *    Perform GetMFAACLBENP
185503211013           IF ln_GMWBEffdate > 0
185504211013           AND ln_GMWBEffdate <= lc_AsAtDateN
185505211013           AND (ln_Rider_Exp_date  = 0   OR
185506211013               ln_Rider_Exp_date   >  lc_AsAtDateN)
185507211013               MOVE lncc_Yes TO  lc_GMWBRiderind
185508211013           END-IF.
185509211013      *RFS1118605 - END.
185700210518           IF  lc_GMWBRiderind  = lncc_No
185800210518               Move zeroes to ln_GMWBEffetivedate
185900210518           END-IF.
186000210518
186100210416      *Get Paymenttypecode
186200210506
186300210518           Initialize lc_Paymentoption
186400210518                      ln_Minwithamt
186500210518                      lc_Acttypeflag.
186600210429           IF lc_ActTypeRule of lc_master    = lncc_3
186700210416              Perform GetMFAACRIFP
186800210518              Move lncc_Yes to lc_Acttypeflag
186900210416           Else
187000210429              IF lc_ActTypeRule of lc_master = lncc_5
187100210416              Perform GetMFAACLIFP
187200210518              Move lncc_Yes to lc_Acttypeflag
187300210416              End-if
187400210416           End-if.
187500210518           IF  lc_GMWBRiderind = lncc_Yes
187600210518           AND lc_Acttypeflag  = lncc_Yes
187700210518              IF ln_CurrentLIWB > ln_Minwithamt
187800210518                 Move lncc_L to lc_paymentoption
187900210518              End-if
188000210518           End-if.
188100210416
188200210416      *Get Guarntee Reset option
188300210506
188400210510           Initialize lc_GuarResetoption
188500210416                      lc_MBRST
188600210416                      lc_DBRST.
188700210506
188800210416           MOVE lncc_MBRST to lc_Attributecode.
188900210416           Perform GetMFAACCATP
189000210416           IF lc_GuarReset = lncc_Yes
189100210416              MOVE lncc_Yes to lc_MBRST
189200210416           END-IF.
189300210506
189400210416           MOVE lncc_DBRST to lc_Attributecode
189500210416           Perform GetMFAACCATP
189600210416           IF lc_GuarReset = lncc_Yes
189700210416              MOVE lncc_Yes to lc_DBRST
189800210416           END-IF.
189900210506
190000210416           IF  lc_MBRST = lncc_spaces
190100210416           AND lc_DBRST = lncc_spaces
190200210510               MOVE lncc_1 to lc_GuarResetoption
190300210416           END-IF.
190400210416           IF lc_DBRST = lncc_Yes
190500210510               MOVE lncc_2 to lc_GuarResetoption
190600210416           END-IF.
190700210416           IF lc_MBRST = lncc_Yes
190800210510               MOVE lncc_3 to lc_GuarResetoption
190900210416           END-IF.
191000210416           IF  lc_MBRST = lncc_Yes
191100210416           AND lc_DBRST = lncc_Yes
191200210510                MOVE lncc_4 to lc_GuarResetoption
191300210416           END-IF.
191400210416
191500210416      *Get Maturity Reset fee fund
191600210506
191700210510           Initialize lc_MatResetfeefund.
191800210510           MOVE lncc_MBG to lc_Subtypecode.
191900210416           Perform GetMFAACHDTP.
192000210510           MOVE lc_Resetfeefund to lc_MatResetfeefund.
192100210416
192200210416      *Get Death Reset fee fund
192300210506
192400210510           Initialize lc_DthResetfeefund.
192500210510           MOVE lncc_DBG to lc_Subtypecode.
192600210416           Perform GetMFAACHDTP.
192700210510           MOVE lc_Resetfeefund to lc_DthResetfeefund.
192800210416
192900210416      *Get GMWB Fee fund
193000210506
193100210510           Initialize lc_GMWBFee.
193200210510           MOVE lncc_GWFEE to lc_Subtypecode.
193300210510           Perform GetMFAACHDTP.
193400210510           MOVE lc_Resetfeefund to lc_GMWBFee.
193500210416
193600210416      *Get YTDGMWB
193700210506
193800210510           Initialize ln_YTDGMWB.
193900210510           COMPUTE ln_YTDGMWB = ln_YTDGWA + ln_YTDExcesswith.
194000210416
194100210416      *Get GMWBTotalfeefactor
194200210506
194300210416           Initialize ln_GMWBTotfeefactor.
194400210531           IF  lc_GMWBRiderind = lncc_Yes
194500210506           CALL LINKAGE TYPE IS PROCEDURE
194600210506                "GETTOTFEE" using li_Actno,
194700210531                                  ln_GMWBTotfeefactor
194800210531           END-IF.
194900210419
195000210420      *Get NextMVResetdate
195100210506
195200210420           Initialize  pi_FXRESETDTE_AccountNo
195300210420                       pc_FXRESETDTE_Mode
195400210420                       Pc_FXRESETDTE_RiderTypeAdded
195500210420                       pc_FXRESETDTE_Calledfrom
195600210420                       pi_FXRESETDTE_DBGNextResetDte
195700210420                       pi_FXRESETDTE_DBGFinalResetDte
195800210420                       pi_FXRESETDTE_MBGNextResetDte
195900210420                       pi_FXRESETDTE_MBGFinalResetDte
196000210420                       pc_FXRESETDTE_ReturnCode
196100210420                       ln_NextMVResetdate.
196200210420
196300210420           MOVE li_Actno       TO pi_FXRESETDTE_AccountNo.
196400210420           MOVE lncc_E         TO pc_FXRESETDTE_Mode.
196500210531           MOVE lncc_SEGMSTEXT TO pc_FXRESETDTE_Calledfrom.
196600210420
196700210531           IF  lc_GMWBRiderind = lncc_Yes
196800210420           CALL "FXRESETDTE" using pi_FXRESETDTE_AccountNo,
196900210420                                   pc_FXRESETDTE_Mode,
197000210420                                   pc_FXRESETDTE_RiderTypeAdded,
197100210420                                   pc_FXRESETDTE_CalledFrom,
197200210420                                   pi_FXRESETDTE_DBGNextResetDte,
197300210420                                   pi_FXRESETDTE_DBGFinalResetDte,
197400210420                                   pi_FXRESETDTE_MBGNextResetDte,
197500210420                                   pi_FXRESETDTE_MBGFinalResetDte,
197600210531                                   pc_FXRESETDTE_ReturnCode
197700210531
197800210420
197900210422           IF pc_FXRESETDTE_ReturnCode  = lnci_00
198000210421              MOVE pi_FXRESETDTE_MBGNextResetDte to
198100210420                                  ln_NextMVResetdate
198200210531           END-IF
198300210531           END-IF.
198400210420
198500210419      *Get Agreement no & house holding name
198600210506
198700210510           Initialize lc_HLIHHname
198800210510                      lc_HLDHHname
198900210512                      lc_HHCode
199000210512                      lc_HHflag.
199100210510           MOVE lncc_HLI to lc_HHcode.
199200210430           Perform GetMFAIVRHHP.
199300210510           MOVE lc_Householdname to lc_HLIHHname.
199400210510           MOVE lncc_HLD to lc_HHcode.
199500211007187570*    Perform GetMFAIVRHHP.
199600211007187570     Perform GetMFAIVRHHPHLD.
199700211007           MOVE lc_Householdname to lc_HLDHHname.
199800210914
199900210924      * RFS187570 Starts
200000210914      * Get Advisor Fee Rate.
200100210914           PERFORM GetAdvisorFeeRate.
200200210914           MOVE ln_HH_AMS_Rate TO ln_Advfeerate
200300210924      * RFS187570 Ends
200301211021      
200302211013      * RFS1118605 - Start
200303211013      * Comment below lines to check the count of MFAACLBENP
200304211013      *instead validate the account no retrived in the cursor.
200500211013      *CheckMFAACLBENP.
200501211013      *   Initialize li_count.
200700210525
200701211013      *    EXEC SQL
200702211013      *         SELECT count(1)
200703211013      *           INTO :li_count
200704211013      *          FROM MFAACLBENP
200705211013      *          WHERE Account_no     = :li_ActNo
200706211013      *    END-EXEC.
201400210525
201401211013      *    MOVE SQLSTATE TO Sw-Sql-States.
201600210525
201601211013      *    EVALUATE TRUE
201602211013      *       WHEN Sw-Sql-Successful  OR Sw-Sql-End
201603211013      *            Continue
201604211013      *       WHEN OTHER
201605211013      *            SET lncc_Err30  TO TRUE
201606211013      *            STRING lnc_getmfaaclbenp        DELIMITED BY SPACES
201607211013      *               SPACES                       DELIMITED BY SIZE
201608211013      *               SQLSTATE                     DELIMITED BY SIZE
201609211013      *            INTO Ws-Sql-Err-Short-Descr
201610211013      *            PERFORM SQLFailProcess
201611211013      *    END-EVALUATE.
201612211013      * RFS1118605 - End
202800210601
202900210524       GetMFASGGWBRP.
203000210524
203100210524           Initialize li_Applyear.
203200210524           MOVE lc_AsatdateN(1:4) to ln_applyear.
203300210524           EXEC SQL
203400210524             SELECT  COALESCE(Applicable_year,0)
203500210524               INTO :li_Applyear
203600210524               FROM  MFASGGWBRP
203700210524              WHERE  INVESTMENT_SERIES = :lc_LIBEra
203800210524                AND (APPLICABLE_YEAR   = :ln_applyear
203900210524                 OR  APPLICABLE_YEAR   = 0)
204000210524           ORDER BY  APPLICABLE_YEAR DESC
204100210524              FETCH  FIRST ROW ONLY
204200210524           END-EXEC
204300210524
204400210524           MOVE SQLSTATE TO Sw-Sql-States.
204500210524
204600210524           EVALUATE TRUE
204700210524              WHEN Sw-Sql-Successful
204800210524                   Continue
204900210524              WHEN Sw-Sql-End
205000210524                   Continue
205100210524              WHEN OTHER
205200210524                   SET lncc_Err28  TO TRUE
205300210524                   STRING lnc_GetAppliedyear   DELIMITED BY SPACES
205400210524                      SPACES                   DELIMITED BY SIZE
205500210524                      SQLSTATE                 DELIMITED BY SIZE
205600210524                   INTO Ws-Sql-Err-Short-Descr
205700210524                   PERFORM SQLFailProcess
205800210524           END-EVALUATE.
205900210524
206000210524           IF li_Applyear  > 0
206100210524              IF lc_Gbonusexists = lncc_Yes
206200210524                 Perform GetMFAACCFBP
206300210526                 IF ln_bonusdate(2:4) = ln_applyear
206400210525                    Move lc_bonusflag to lc_DPIndicator
206500210525                 ELSE
206600210525                    Move lncc_No      to lc_DPIndicator
206700210525                 END-IF
206800210524              ELSE
206900210524                 Move lncc_No to lc_DPIndicator
207000210524              END-IF
207100210524           ELSE
207200210524              IF lc_Gbonusexists = lncc_Yes
207300210524                 Perform GetFXCHKBELG
207400210524              ELSE
207500210524                 Move lncc_No to lc_DPIndicator
207600210524              END-IF
207700210524           END-IF.
207800210524
207900210524       GetMFAACCFBP.
208000210524
208100210525           Initialize lc_bonusflag
208200210525                      ln_bonusdate.
208300210524           EXEC SQL
208400210524             SELECT COALESCE(Bonus_Eligibility_Flag, " ")
208500210525                   ,COALESCE(FIE_BONUS_DATE,0)
208600210524               INTO :lc_Bonusflag
208700210525                   ,:ln_Bonusdate
208800210524               FROM MFAACCFBP
208900210524              WHERE ACCOUNT_NO  = :li_ActNo
209000210524                AND CONTRACT_NO = :lnci_0
209100210524              ORDER BY FIE_BONUS_DATE DESC
209200210524              FETCH FIRST ROW ONLY
209300210524           END-EXEC.
209400210524
209500210524           MOVE SQLSTATE TO Sw-Sql-States.
209600210524
209700210524           EVALUATE TRUE
209800210524              WHEN Sw-Sql-Successful
209900210524                   Continue
210000210524              WHEN Sw-Sql-End
210100210524                   Continue
210200210524              WHEN OTHER
210300210524                   SET lncc_Err29  TO TRUE
210400210524                   STRING lnc_Getbonusflag         DELIMITED BY SPACES
210500210524                      SPACES                       DELIMITED BY SIZE
210600210524                      SQLSTATE                     DELIMITED BY SIZE
210700210524                   INTO Ws-Sql-Err-Short-Descr
210800210524                   PERFORM SQLFailProcess
210900210524           END-EVALUATE.
211000210524
211100210524       GetFXCHKBELG.
211200210524
211300210524           INITIALIZE pi_AccountNo, pi_ContractNo,
211400210524                      pc_BonusFlag, pi_FIEBaseAmt,
211500210524                      pi_BonusAmount, pi_BonusRate.
211600210524
211700210524           COMPUTE pi_AccountNo  = li_Actno.
211800210525           COMPUTE pi_ContractNo = lnci_0.
211900210525           MOVE lncc_S to pc_Bonusflag.
212000210524
212100210524           CALL LINKAGE TYPE IS PROCEDURE
212200210524                "FXCHKBELG" USING pi_AccountNo,
212300210524                                  pi_ContractNo,
212400210524                                  pc_BonusFlag,
212500210524                                  pi_FIEBaseAmt,
212600210524                                  pi_BonusAmount,
212700210524                                  pi_BonusRate.
212800210524
212900210524           MOVE pc_BonusFlag     TO lc_DPIndicator.
213000210524
213100210416       GetMFAACRIFP.
213200210416
213300210416           EXEC SQL
213400210518                SELECT PAYMENT_TYPE_CODE
213500210518                      ,MIN_WITHDRAWAL_AMT
213600210510                INTO : lc_Paymentoption
213700210518                    ,: ln_Minwithamt
213800210416                FROM MFAACRIFP
213900210419                WHERE ACCOUNT_NO = :li_ActNo
214000210416           END-EXEC.
214100210416
214200210419           MOVE SQLSTATE TO Sw-Sql-States.
214300210416
214400210416           EVALUATE TRUE
214500210518              WHEN Sw-Sql-Successful
214600210518                   Continue
214700210518              WHEN Sw-Sql-End
214800210518                   Continue
214900210416              WHEN OTHER
215000210416                   SET lncc_Err22  TO TRUE
215100210419                   STRING lnc_GetpaymentoptRIFPerr DELIMITED BY SPACES
215200210416                      SPACES                       DELIMITED BY SIZE
215300210416                      SQLSTATE                     DELIMITED BY SIZE
215400210416                   INTO Ws-Sql-Err-Short-Descr
215500210416                   PERFORM SQLFailProcess
215600210416           END-EVALUATE.
215700210416
215800210416       GetMFAACLIFP.
215900210416
216000210416           EXEC SQL
216100210416                SELECT PAYMENT_TYPE_CODE
216200210518                      ,MIN_WITHDRAWAL_AMT
216300210510                INTO : lc_Paymentoption
216400210518                    ,: ln_Minwithamt
216500210416                FROM MFAACLIFP
216600210419                WHERE ACCOUNT_NO = :li_ActNo
216700210416           END-EXEC.
216800210416
216900210419           MOVE SQLSTATE TO Sw-Sql-States.
217000210416
217100210416           EVALUATE TRUE
217200210518              WHEN Sw-Sql-Successful
217300210518                   Continue
217400210518              WHEN Sw-Sql-End
217500210518                   Continue
217600210416              WHEN OTHER
217700210416                   SET lncc_Err23  TO TRUE
217800210419                   STRING lnc_GetpaymentoptLIFPerr DELIMITED BY SPACES
217900210416                      SPACES                       DELIMITED BY SIZE
218000210416                      SQLSTATE                     DELIMITED BY SIZE
218100210416                   INTO Ws-Sql-Err-Short-Descr
218200210416                   PERFORM SQLFailProcess
218300210416           END-EVALUATE.
218400210416
218401211013      *RFS1118605 - Start
218402211013      *GetMFAACLBENP.
218600210416
218601211013      *    EXEC SQL
218602211013      *         SELECT :lncc_Yes
218603211013      *           INTO : lc_GMWBRiderind
218604211013      *          FROM MFAACLBENP
218605211013      *          WHERE Account_no     = :li_ActNo
218606211013      *          AND   Election_date  > :lnci_0
218607211013      *          AND   Election_date <= :lc_AsAtDateN
218608211013      *          AND   (Expiry_date   = :lnci_0
218609211013      *          OR     Expiry_date   > :lc_AsAtDateN)
218610211013      *    END-EXEC.
219700210416
219701211013      *    MOVE SQLSTATE TO Sw-Sql-States.
219900210416
219901211013      *    EVALUATE TRUE
219902211013      *       WHEN Sw-Sql-Successful  OR Sw-Sql-End
219903211013      *            Continue
219904211013      *       WHEN OTHER
219905211013      *            SET lncc_Err24  TO TRUE
219906211013      *            STRING lnc_getGMWBRiderinderr   DELIMITED BY SPACES
219907211013      *               SPACES                       DELIMITED BY SIZE
219908211013      *               SQLSTATE                     DELIMITED BY SIZE
219909211013      *            INTO Ws-Sql-Err-Short-Descr
219910211013      *            PERFORM SQLFailProcess
219911211013      *    END-EVALUATE.
219912211013      * RFS1118605 - End
221100210416
221200210416       GetMFAACCATP.
221300210416
221400210419           Move Spaces  to lc_GuarReset.
221500210510           INITIALIZE lc_Account-Attr
221600210510                      ld_ExpiryDate
221700210510                      ld_EffectivDate.
221800210416           EXEC SQL
221900210510               SELECT ACCOUNT_ATTRIBUTE_CODE,
222000210510                      EXPIRY_DATE,
222100210510                      EFFECTIV_DATE
222200210510             INTO  :lc_Account-Attr ,
222300210510                   :ld_ExpiryDate   ,
222400210510                   :ld_EffectivDate
222500210510               FROM   MFAACCATP
222600210419               WHERE  ACCOUNT_NO =:li_ActNo
222700210416               AND ACCOUNT_ATTRIBUTE_CODE = :lc_Attributecode
222800210416           END-EXEC.
222900210416
223000210419           MOVE SQLSTATE TO Sw-Sql-States.
223100210416           EVALUATE TRUE
223200210510              WHEN Sw-Sql-Successful
223300210510                  IF lc_Account-Attr NOT = SPACES
223400210510                    IF (ld_ExpiryDate = 0 AND
223500210510                        ld_EffectivDate <= lc_AsAtDateN)
223600210510                        Move lncc_Yes to lc_GuarReset
223700210510                    ELSE
223800210510                      IF ((ld_ExpiryDate <= lc_AsAtDateN) OR
223900210510                          (ld_EffectivDate > lc_AsAtDateN))
224000210510                            Move lncc_No  to lc_GuarReset
224100210510                         ELSE
224200210510                            Move lncc_Yes to lc_GuarReset
224300210510                      END-IF
224400210510                    END-IF
224500210510                  END-IF
224600210510              WHEN Sw-Sql-End
224700210416                   Continue
224800210416              WHEN OTHER
224900210416                   SET lncc_Err25  TO TRUE
225000210416                   STRING lnc_getGuarResetopterr   DELIMITED BY SPACES
225100210416                      SPACES                       DELIMITED BY SIZE
225200210416                      SQLSTATE                     DELIMITED BY SIZE
225300210416                   INTO Ws-Sql-Err-Short-Descr
225400210416                   PERFORM SQLFailProcess
225500210416           END-EVALUATE.
225600210416
225700210416       GetMFAACHDTP.
225800210416
225900210510           Initialize lc_Resetfeefund.
226000210416           EXEC SQL
226100210416                 SELECT INVESTMENT_CODE
226200210510                   INTO : lc_Resetfeefund
226300210416                   FROM MFAACHDTP
226400210510                  WHERE  TRANS_SUB_TYPE  = :lc_Subtypecode
226500210422                  AND    ACCOUNT_NO = :li_ActNo
226600210416           END-EXEC.
226700210416
226800210419           MOVE SQLSTATE TO Sw-Sql-States.
226900210416           EVALUATE TRUE
227000210419              WHEN Sw-Sql-Successful OR Sw-Sql-End
227100210416                   Continue
227200210416              WHEN OTHER
227300210416                   SET lncc_Err26  TO TRUE
227400210419                   STRING lnc_GetinvesetmentCodeerr DELIMITED BY SPACES
227500210419                      SPACES                        DELIMITED BY SIZE
227600210419                      SQLSTATE                      DELIMITED BY SIZE
227700210416                   INTO Ws-Sql-Err-Short-Descr
227800210416                   PERFORM SQLFailProcess
227900210416           END-EVALUATE.
228000210416
228100210430       GETMFAIVRHHP.
228200210510           Initialize lc_Householdname.
228300210419
228400210419           EXEC SQL
228500210430                 SELECT COALESCE(IVRHHP.LEGAL_LAST_NAME, " ")
228600210510                   INTO :lc_householdname
228700210430                   FROM MFAACCNTP ACCNTP
228800210430                 INNER JOIN MFAIVRHDP IVRHDP ON
228900210527                 IVRHDP.INVESTOR_NO_2          = ACCNTP.INVESTOR_NO AND
228901211013      * RFS1118798 Starts
228902211013      *          IVRHDP.ACCOUNT_NO             = ACCNTP.ACCOUNT_NO  AND
228903211013                 IVRHDP.ACCOUNT_NO             = ACCNTP.ACCOUNT_NO
228904211013      *          IVRHDP.HOUSEHOLD_LINKAGE_CODE = :lc_HHCode
228905211013      * RFS1118798 End
229200210430                 INNER JOIN MFAIVRHHP IVRHHP ON
229500210815      * RFS1118798 Starts
229501211013      *          IVRHHP.INVESTOR_NO            = IVRHDP.INVESTOR_NO AND
229502211013                 IVRHHP.INVESTOR_NO            = IVRHDP.INVESTOR_NO
229503211013      *          IVRHHP.HOUSEHOLD_LINKAGE_CODE = :lc_HHCode
229600210815                 AND
229700210815                 IVRHHP.HOUSEHOLD_ID           = IVRHDP.HOUSEHOLD_ID
229800210815      * RFS1118798 End
229900210430                 WHERE  ACCNTP.ACCOUNT_NO = :li_ActNo
229901211013      * RFS1118798 Starts
229902211013                 AND
229903211013                 IVRHDP.HOUSEHOLD_LINKAGE_CODE = :lc_HHCode
229904211013                 AND
229905211013                 IVRHHP.HOUSEHOLD_LINKAGE_CODE = :lc_HHCode
229906211013                 FETCH FIRST ROW ONLY
229907211013      * RFS1118798 End
230000210419           END-EXEC.
230100210419
230200210419           MOVE SQLSTATE TO Sw-Sql-States.
230300210419           EVALUATE TRUE
230400210512              WHEN Sw-Sql-Successful
230500210518                   Continue
230600210518              WHEN Sw-Sql-End
230700210512                   Continue
230800210419              WHEN OTHER
230900210419                   SET lncc_Err27  TO TRUE
231000210419                   STRING lnc_getHHnameerr         DELIMITED BY SPACES
231100210419                      SPACES                       DELIMITED BY SIZE
231200210419                      SQLSTATE                     DELIMITED BY SIZE
231300210419                   INTO Ws-Sql-Err-Short-Descr
231400210419                   PERFORM SQLFailProcess
231500210419           END-EVALUATE.
231600210512
231700210914      *RFS186584 - End
231800210914
231900210914      * RFS187570 Starts
232000210914       GetAdvisorFeeRate.
232100210914           Initialize ln_HH_AMS_Rate.
232200210914
232300210914           EXEC SQL
232400210914               SELECT COALESCE(IVRHHP.AMS_RATE,0)
232500210914                 INTO :ln_HH_AMS_Rate
232600210914               FROM MFAACCNTP ACCNTP
232700210914               INNER JOIN MFAIVRHDP IVRHDP ON
232800210914                IVRHDP.INVESTOR_NO_2          = ACCNTP.INVESTOR_NO AND
232900211021                IVRHDP.ACCOUNT_NO             = ACCNTP.ACCOUNT_NO
233100210914               INNER JOIN MFAIVRHHP IVRHHP ON
233200210914                IVRHHP.INVESTOR_NO            = IVRHDP.INVESTOR_NO AND
233300211021                IVRHHP.HOUSEHOLD_ID           = IVRHDP.HOUSEHOLD_ID
233400211021               WHERE ACCNTP.ACCOUNT_NO        = :li_ActNo       AND
233402211021              IVRHDP.HOUSEHOLD_LINKAGE_CODE = :lc_MGFEEP-HH-Linkage-Code
233403211021              AND
233404211021              IVRHHP.HOUSEHOLD_LINKAGE_CODE = :lc_MGFEEP-HH-Linkage-Code
233405211021               FETCH FIRST ROW ONLY
233500210914           END-EXEC.
233600210914
233700210914           MOVE SQLSTATE TO Sw-Sql-States.
233800210914           EVALUATE TRUE
233900210914              WHEN Sw-Sql-Successful
234000210914                   Continue
234100210914              WHEN Sw-Sql-End
234200210914                   Continue
234300210914              WHEN OTHER
234400210914                   SET lncc_Err34  TO TRUE
234500210914                   STRING lnc_GetAdvisorfeerate    DELIMITED BY SPACES
234600210914                      SPACES                       DELIMITED BY SIZE
234700210914                      SQLSTATE                     DELIMITED BY SIZE
234800210914                   INTO Ws-Sql-Err-Short-Descr
234900210914                   PERFORM SQLFailProcess
235000210914           END-EVALUATE.
235100211007
235200211007       GETMFAIVRHHPHLD.
235300211007           Initialize lc_Householdname.
235400211007
235500211007           EXEC SQL
235600211007                 SELECT COALESCE(IVRHHP.LEGAL_LAST_NAME, " ")
235700211007                   INTO :lc_householdname
235800211007                 FROM MFAACCNTP ACCNTP
235900211007                 INNER JOIN MFAIVRHDP IVRHDP ON
236000211007                  IVRHDP.INVESTOR_NO_2 = ACCNTP.INVESTOR_NO AND
236100211007                  IVRHDP.ACCOUNT_NO    = ACCNTP.ACCOUNT_NO
236200211007                 INNER JOIN MFAIVRHHP IVRHHP ON
236300211007                  IVRHHP.INVESTOR_NO   = IVRHDP.INVESTOR_NO AND
236400211007                  IVRHHP.HOUSEHOLD_ID  = IVRHDP.HOUSEHOLD_ID
236500211007                 WHERE ACCNTP.ACCOUNT_NO = :li_ActNo AND
236600211007                       IVRHDP.HOUSEHOLD_LINKAGE_CODE = :lc_HHCode AND
236700211007                       IVRHHP.HOUSEHOLD_LINKAGE_CODE = :lc_HHCode AND
236800211007                      :lc_AsAtDateN BETWEEN
236900211007                       DECIMAL(REPLACE(CHAR(IVRHDP.HOUSEHOLD_START_DATE
237000211007                                            ,ISO),"-",""))        AND
237100211007                       DECIMAL(REPLACE(CHAR(IVRHDP.HOUSEHOLD_STOP_DATE
237200211007                                            ,ISO),"-",""))
237300211007                 FETCH FIRST ROW ONLY
237400211007           END-EXEC.
237500211007
237600211007           MOVE SQLSTATE TO Sw-Sql-States.
237700211007           EVALUATE TRUE
237800211007              WHEN Sw-Sql-Successful
237900211007                   Continue
238000211007              WHEN Sw-Sql-End
238100211007                   Continue
238200211007              WHEN OTHER
238300211007                   SET lncc_Err35  TO TRUE
238400211007                   STRING lnc_getHHLDnameerr       DELIMITED BY SPACES
238500211007                      SPACES                       DELIMITED BY SIZE
238600211007                      SQLSTATE                     DELIMITED BY SIZE
238700211007                   INTO Ws-Sql-Err-Short-Descr
238800211007                   PERFORM SQLFailProcess
238900211007           END-EVALUATE.
239000210914      * RFS187570 Ends
239100210914
239200121217      * Copybook TO Write Performance/Statistics Info
239300121217           COPY CPPFCAL.
239400121217
239500121217      * Dsp-Error and Force-Msgw Routines
239600121217           COPY CPYSQLRTN.
239700121217
239800121217      * end job
239900121217       END-JOB.
240000121217
240100121217           EXEC SQL
240200121217             CLOSE lcu_MstCursor
240300121217           END-EXEC
240400121217
240500121217           PERFORM STD-WRITE-END-DATA
240600121217
240700121217      * - Display info, that program End
240800121217
240900121217           PERFORM DSP-PROGRAM-END.
241000121217
241100121217       SQLFailProcess.
241200121217           PERFORM Dsp-Error.
241300121217           GOBACK.
241400121217
