000100210928      * %ATTR OPTION(*XREF *GEN) CLOSQLCSR(*ENDACTGRP) DBGVIEW(*SOURCE)+
000200210928      * %ATTR COMPILEOPT('ACTGRP(*CALLER)')
000300210928       IDENTIFICATION DIVISION.
000400210928       PROGRAM-ID.    SEGRVSCLGD.
000500210928       AUTHOR.        FATEMA HAJI.
000600210928       INSTALLATION.  UNISEN INC.
000700210928       DATE-WRITTEN.  JANUARY 2004.
000800210928       DATE-COMPILED.
000900210928      *******************************************************************
001000210928      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
001100210928      *******************************************************************
001200210928      * Fatema Haji* 2004/01/29   * RFS 17973 - create the program
001300210928      * Daisy Ly   * 2004/07/08   * RFS 23118 - recompile for copy
001400210928      *            *              * book change CPYSEGRTNC
001500210928      * Fatema Haji* 2004/09/09   * RFS 23824 - recompile
001600210928      * Esin A.    * 2006/03/23   * RFS 31514 - Recompile only.
001700210928      * Esin A.    * 2007/03/09   * RFS 40576 - Recompile only.
001800210928      * Raymond Mui* 2007/11/23   * RFS 45845 - Recompile only.
001900210928      * Emman. Yala* 2008/01/10   * RFS47227 - Recompile.
002000210928      * Ade Adeyemi*  2008/01/22  * RFS42749 Exclude DISTR-FLAG =  S
002100210928      * Bojana J.  * 2008/05/06   * RFS 51776 - recompile.
002200210928      * Bojana J.  *  2008/05/14  * RFS 47405 - Include CPGLWBRULE copy book.
002300210928      * Daniel M.  *  2008/05/14  * RFS 47405 - Include CPGLWBCKTT copy book.
002400210928      * Daniel M.  *  2008/06/19  * RFS 46707 - Recompile changes to CPGLWBRULE.
002500210928      * Sanjeev P. *  2008/06/25  * RFS 48640 - Recompile only.
002600210928      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
002700210928      * Fatema Haji*  2008/08/18  * RFS 55960 - recompile.
002800210928      * Sanjeev P  *  2008/12/11  * RFS49898 - New DMD Maturity Option.
002900210928      * Bojana J.  *  2009/05/27  * RFS 57388 - Recompile (MFAACCCRP).
003000210928      * Pawel A    *  2010/07/30  * RFS84063 - Recompile (CPEXCLTRN)
003100210928      * Emman. Yala*  2011/02/23  * RFS91599 - Recompile (MFAACCCRP)80605
003200210928      *             *            * Replaced Implicit Join by Inner Join
003300210928      * Thilaga K  * 2012/08/13   * RFS107585-added var lc-transfeGDV
003400210928      * Venkatesh C* 2012/10/19   * RFS117298 - Recompile for MFAACCONP
003500210928      * Ambikapathy* 2012/12/14   * RFS112135 - Recompile for MFASGSTOP
003600210928      * Abhisek M  * 2013/04/01   * RFS120002 - Recompile for MFATRACXP
003700210928      * TamilSelvi * 2013/07/15   * RFS110904 - Recompile for MFAEXTRNP
003800210928      * Andy Chan  * 2013/08/29   * RFS127401 - CPYEXCLTRN
003900210928      * Thilaga K   * 2014/01/21 * RFS133150 - Recompile for MFATRCODP
004000210928      * Arthy K     * 2014/04/03 * RFS134936 - Recompile for MFAACCONP
004100210928      * Kamal T    * 2014/06/17   * RFS118472 - Recompile
004200210928      * Vinsfy J   * 2014/06/17   * RFS136634 - Recompile
004300210928      * Nagamnai S * 2014/08/13   * RFS139007 - Recompile for CPGLWBRULE
004400210928      * Digvijay   *  2016/12/28  * RFS 165027 - Optimization of
004500210928      *            *              * runtime - changing compiler option
004600210928      *            *              * and commenting CANCEL
004700210928      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
004800210928      * CHAYA SP   * 2020/06/30   * RFS185172 - Recompile for MFAACCONP
004900210928      * Vignesh    *  2020/06/25  * RFS183812 - Recompile for MFASGSTOP
005000210928      * VIGNESH    * 2020/07/15   * RFS185171 -Recompile for MFAEXTRNP
005100210928      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
005200210928      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
005300210928      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
005400210928      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
005500210928      * Kavin      * 2021/01/05   * RFS180708 - Added MFATRNMSCP file
005600210928      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
005601211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
005602211007      *            *              * Array from 100 to 1000
005603211007      *            *              * Tagged as 111744
005700210928      ********************************************************************
005800210928      *===============================================================*
005900210928      * Important: IMPORTANT TO ALL PROGRAMMERS
006000210928      *
006100210928      * If any programmer creates, changes or deletes an array in this
006200210928      * programs please add the logic to support the array logging process!
006300210928      *
006400210928      * View the WS-ARRAY-LOG-MISC variables and the code associated with
006500210928      * RFS49699.
006600210928      *
006700210928      * This change is for audit purposes, it logs the
006800210928      * name of the array, max size, size used. At the end of
006900210928      * this program the array information is passed to FXLOGUA pgm,
007000210928      * which write this information to the MFALOGAUP array audit file!
007100210928      *
007200210928      *===============================================================*
007300210928       ENVIRONMENT DIVISION.
007400210928       CONFIGURATION SECTION.
007500210928       SOURCE-COMPUTER. IBM-AS400.
007600210928       OBJECT-COMPUTER. IBM-AS400.
007700210928       SPECIAL-NAMES.
007800210928           LOCAL-DATA IS WS-LOCAL.
007900210928      /
008000210928       INPUT-OUTPUT SECTION.
008100210928       FILE-CONTROL.
008200210928
008300210928           SELECT  ACCOUNT-CONTRACT
008400210928                   ASSIGN TO DATABASE-MFAACCONP
008500210928                   ORGANIZATION IS INDEXED
008600210928                   ACCESS IS DYNAMIC
008700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
008800210928      /
008900210928           SELECT  ACCOUNT-CONTRACT-INVESTMENT
009000210928                   ASSIGN TO DATABASE-MFAACCCIP
009100210928                   ORGANIZATION IS INDEXED
009200210928                   ACCESS IS DYNAMIC
009300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009400210928      /
009500210928           SELECT  ACCOUNT-CONTRACT-INVEST-SWI
009600210928                   ASSIGN TO DATABASE-MFAACCCIP
009700210928                   ORGANIZATION IS INDEXED
009800210928                   ACCESS IS DYNAMIC
009900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010000210928      /
010100210928           SELECT  ACCOUNT-CONTRACT-INVEST-R
010200210928                   ASSIGN TO DATABASE-MFAACCCIP
010300210928                   ORGANIZATION IS INDEXED
010400210928                   ACCESS IS DYNAMIC
010500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010600210928      /
010700210928           SELECT  ACCOUNT-CONTRACT-RESET
010800210928                   ASSIGN TO DATABASE-MFAACCCRP
010900210928                   ORGANIZATION IS INDEXED
011000210928                   ACCESS IS DYNAMIC
011100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
011200210928      /
011300210928           SELECT  ACCOUNT-CONTRACT-INV-RESET
011400210928                   ASSIGN TO DATABASE-MFAACCCIRP
011500210928                   ORGANIZATION IS INDEXED
011600210928                   ACCESS IS DYNAMIC
011700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
011800210928      /
011900210928           SELECT  ACCOUNT
012000210928                   ASSIGN TO DATABASE-MFAACCNTP
012100210928                   ORGANIZATION IS INDEXED
012200210928                   ACCESS IS DYNAMIC
012300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012400210928      /
012500210928           SELECT  INVESTMENT
012600210928                   ASSIGN TO DATABASE-MFAINVP
012700210928                   ORGANIZATION IS INDEXED
012800210928                   ACCESS IS DYNAMIC
012900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013000210928      /
013100210928           SELECT  CONTRACT-ERROR-LOG
013200210928                   ASSIGN TO DATABASE-MFACTERRP
013300210928                   ORGANIZATION IS INDEXED
013400210928                   ACCESS IS DYNAMIC
013500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
013600210928                   WITH DUPLICATES.
013700210928      /
013800210928           SELECT  TRANS-R
013900210928                   ASSIGN TO DATABASE-MFATRNLN
014000210928                   ORGANIZATION IS INDEXED
014100210928                   ACCESS IS DYNAMIC
014200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
014300210928                   WITH DUPLICATES.
014400210928      /
014500210928           SELECT  TRANS-GBV
014600210928                   ASSIGN TO DATABASE-MFATRNLN
014700210928                   ORGANIZATION IS INDEXED
014800210928                   ACCESS IS DYNAMIC
014900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
015000210928                   WITH DUPLICATES.
015100210928      /
015200210928           SELECT  TRANS
015300210928                   ASSIGN TO DATABASE-MFATRNP
015400210928                   ORGANIZATION IS INDEXED
015500210928                   ACCESS IS DYNAMIC
015600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015700210928      /
015800210928           SELECT  TRANS-CONTRACT-DTL-R
015900210928                   ASSIGN TO DATABASE-MFATRCODP
016000210928                   ORGANIZATION IS INDEXED
016100210928                   ACCESS IS DYNAMIC
016200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016300210928      /
016400210928           SELECT  TRANS-CONTRACT-DTL-R2
016500210928                   ASSIGN TO DATABASE-MFATRCODP
016600210928                   ORGANIZATION IS INDEXED
016700210928                   ACCESS IS DYNAMIC
016800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016900210928      /
017000210928           SELECT  BUSINESS-DAYS
017100210928                   ASSIGN TO DATABASE-MFABUSDAP
017200210928                   ORGANIZATION IS INDEXED
017300210928                   ACCESS IS DYNAMIC
017400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017500210928      /
017600210928           SELECT  ACCOUNT-NOMINEE
017700210928                   ASSIGN TO DATABASE-MFAACCNMP
017800210928                   ORGANIZATION IS INDEXED
017900210928                   ACCESS IS DYNAMIC
018000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018100210928      /
018200210928           SELECT  EXCLUDE-TRANS
018300210928                   ASSIGN TO DATABASE-MFAEXTRNP
018400210928                   ORGANIZATION IS INDEXED
018500210928                   ACCESS IS DYNAMIC
018600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018700210928      /
018800210928           SELECT  ACCOUNT-ATTRIBUTES
018900210928                   ASSIGN TO DATABASE-MFAACCATP
019000210928                   ORGANIZATION IS INDEXED
019100210928                   ACCESS IS DYNAMIC
019200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019300210928      /
019400210928           SELECT  TRANS-TARGET
019500210928                   ASSIGN TO DATABASE-MFATRNTGP
019600210928                   ORGANIZATION IS INDEXED
019700210928                   ACCESS IS DYNAMIC
019800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019900210928      /
020000210928           SELECT  TRANS-OFFSET
020100210928                   ASSIGN TO DATABASE-MFATRNP
020200210928                   ORGANIZATION IS INDEXED
020300210928                   ACCESS IS DYNAMIC
020400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020500210928
020600210928           SELECT  TRANS-CONTRACT-DETAILS
020700210928                   ASSIGN TO DATABASE-MFATRCODP
020800210928                   ORGANIZATION IS INDEXED
020900210928                   ACCESS IS DYNAMIC
021000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021100210928      /
021200210928           SELECT  ACCOUNT-CONTRACT-INVEST
021300210928                   ASSIGN TO DATABASE-MFAACCCIP
021400210928                   ORGANIZATION IS INDEXED
021500210928                   ACCESS IS DYNAMIC
021600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021700210928      /
021800210928           SELECT  TRANS-GBV-TRANSFER
021900210928                   ASSIGN TO DATABASE-MFATRACXP
022000210928                   ORGANIZATION IS INDEXED
022100210928                   ACCESS IS DYNAMIC
022200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022300210928
022400210928           SELECT  SEG-SWITCH-TRF-OPT
022500210928                   ASSIGN TO DATABASE-MFASGSTOP
022600210928                   ORGANIZATION IS INDEXED
022700210928                   ACCESS IS DYNAMIC
022800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022900210928
023000210928           SELECT  TRANS-CONTRACT-TARGET2
023100210928                   ASSIGN TO DATABASE-MFATRCTGLA
023200210928                   ORGANIZATION IS INDEXED
023300210928                   ACCESS IS DYNAMIC
023400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023500210928
023600210928           SELECT  TRANS-CHARGES
023700210928                   ASSIGN TO DATABASE-MFATRNCHP
023800210928                   ORGANIZATION IS INDEXED
023900210928                   ACCESS IS DYNAMIC
024000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024100210928
024200210928           SELECT  TRANS-SEG-DEDUCTION-CODES
024300210928                   ASSIGN TO DATABASE-MFATRNSDCP
024400210928                   ORGANIZATION IS INDEXED
024500210928                   ACCESS IS DYNAMIC
024600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024700210928
024800210928      *RFS127401 - START
024900210928           SELECT  INVESTMENT-STRUCTURE-XREF
025000210928                   ASSIGN TO DATABASE-MFAINVSXP
025100210928                   ORGANIZATION IS INDEXED
025200210928                   ACCESS IS DYNAMIC
025300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025400210928      *RFS127401 - END
025500210928
025600210928      *RFS180708 - Start
025700210928           SELECT  TRANS-MISC-DETAILS
025800210928                   ASSIGN TO DATABASE-MFATRNMSCP
025900210928                   ORGANIZATION IS INDEXED
026000210928                   ACCESS IS DYNAMIC
026100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
026200210928
026300210928           SELECT  TRANS-REDEM-DETAILS
026400210928                   ASSIGN TO DATABASE-MFATRNREP
026500210928                   ORGANIZATION IS INDEXED
026600210928                   ACCESS IS DYNAMIC
026700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
026800210928      *RFS180708 - End
026900210928
027000210928       DATA DIVISION.
027100210928       FILE SECTION.
027200210928       FD  ACCOUNT-CONTRACT
027300210928           LABEL RECORDS ARE STANDARD.
027400210928       01  ACC-CON-REC.           COPY DD-ALL-FORMATS OF MFAACCONP.
027500210928      /
027600210928       FD  ACCOUNT-CONTRACT-INVESTMENT
027700210928           LABEL RECORDS ARE STANDARD.
027800210928       01  ACC-CON-INV-REC.       COPY DD-ALL-FORMATS OF MFAACCCIP.
027900210928      /
028000210928       FD  ACCOUNT-CONTRACT-INVEST-SWI
028100210928           LABEL RECORDS ARE STANDARD.
028200210928       01  ACC-CON-INV-SWI-REC.   COPY DD-ALL-FORMATS OF MFAACCCIP.
028300210928
028400210928       FD  ACCOUNT-CONTRACT-INVEST-R
028500210928           LABEL RECORDS ARE STANDARD.
028600210928       01  ACC-CON-INV-R-REC.     COPY DD-ALL-FORMATS OF MFAACCCIP.
028700210928      /
028800210928       FD  ACCOUNT-CONTRACT-RESET
028900210928           LABEL RECORDS ARE STANDARD.
029000210928       01  ACC-CON-RESET-REC.     COPY DD-ALL-FORMATS OF MFAACCCRP.
029100210928      /
029200210928       FD  ACCOUNT-CONTRACT-INV-RESET
029300210928           LABEL RECORDS ARE STANDARD.
029400210928       01  ACC-CON-INV-RESET-REC. COPY DD-ALL-FORMATS OF MFAACCCIRP.
029500210928      /
029600210928       FD  ACCOUNT
029700210928           LABEL RECORDS ARE STANDARD.
029800210928       01  ACCOUNT-REC.           COPY DD-ALL-FORMATS OF MFAACCNTP.
029900210928      /
030000210928       FD  INVESTMENT
030100210928           LABEL RECORDS ARE STANDARD.
030200210928       01  INVESTMENT-REC.        COPY DD-ALL-FORMATS OF MFAINVP.
030300210928      /
030400210928       FD  CONTRACT-ERROR-LOG
030500210928           LABEL RECORDS ARE STANDARD.
030600210928       01  CONT-ERR-LOG-REC.      COPY DD-ALL-FORMATS OF MFACTERRP.
030700210928      /
030800210928       FD  TRANS-R
030900210928           LABEL RECORDS ARE STANDARD.
031000210928       01  TRANS-R-REC.           COPY DD-ALL-FORMATS OF MFATRNLN.
031100210928      /
031200210928       FD  TRANS-GBV
031300210928           LABEL RECORDS ARE STANDARD.
031400210928       01  TRANS-GBV-REC.         COPY DD-ALL-FORMATS OF MFATRNLN.
031500210928      /
031600210928       FD  TRANS
031700210928           LABEL RECORDS ARE STANDARD.
031800210928       01  TRANS-REC.          COPY DD-ALL-FORMATS OF MFATRNP.
031900210928      /
032000210928       FD  TRANS-CONTRACT-DTL-R
032100210928           LABEL RECORDS ARE STANDARD.
032200210928       01  TRANS-CONT-DTL-R-REC.      COPY DD-ALL-FORMATS OF MFATRCODP.
032300210928      /
032400210928       FD  TRANS-CONTRACT-DTL-R2
032500210928           LABEL RECORDS ARE STANDARD.
032600210928       01  TRANS-CONT-DTL-R2-REC.      COPY DD-ALL-FORMATS OF MFATRCODP.
032700210928      /
032800210928       FD  BUSINESS-DAYS
032900210928           LABEL RECORDS ARE STANDARD.
033000210928       01  BUSINESS-DAYS-REC.         COPY DD-ALL-FORMATS OF MFABUSDAP.
033100210928      /
033200210928       FD  ACCOUNT-NOMINEE
033300210928           LABEL RECORDS ARE STANDARD.
033400210928       01  ACCOUNT-NOMINEE-REC.       COPY DD-ALL-FORMATS OF MFAACCNMP.
033500210928      /
033600210928       FD  EXCLUDE-TRANS
033700210928           LABEL RECORDS ARE STANDARD.
033800210928       01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
033900210928      /
034000210928       FD  ACCOUNT-ATTRIBUTES
034100210928           LABEL RECORDS ARE STANDARD.
034200210928       01  ACCOUNT-ATTRIBUTES-REC.    COPY DD-ALL-FORMATS OF MFAACCATP.
034300210928      /
034400210928       FD  TRANS-TARGET
034500210928           LABEL RECORDS ARE STANDARD.
034600210928       01  TRANS-TARGET-REC.
034700210928                                  COPY DD-ALL-FORMATS OF MFATRNTGP.
034800210928      /
034900210928       FD  TRANS-OFFSET
035000210928           LABEL RECORDS ARE STANDARD.
035100210928       01  TRANS-2-REC.           COPY DD-ALL-FORMATS OF MFATRNP.
035200210928      /
035300210928       FD  TRANS-CONTRACT-DETAILS
035400210928           LABEL RECORDS ARE STANDARD.
035500210928       01  TRANS-CON-DTL-REC.       COPY DD-ALL-FORMATS OF MFATRCODP.
035600210928      /
035700210928       FD  ACCOUNT-CONTRACT-INVEST
035800210928           LABEL RECORDS ARE STANDARD.
035900210928       01  ACCT-CONT-INVEST-REC.  COPY DD-ALL-FORMATS OF MFAACCCIP.
036000210928      /
036100210928       FD  TRANS-GBV-TRANSFER
036200210928           LABEL RECORDS ARE STANDARD.
036300210928       01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
036400210928
036500210928       FD  SEG-SWITCH-TRF-OPT
036600210928           LABEL RECORDS ARE STANDARD.
036700210928       01  SEG-SWITCH-TRF-OPT-REC.    COPY DD-ALL-FORMATS OF MFASGSTOP.
036800210928
036900210928       FD  TRANS-CONTRACT-TARGET2
037000210928           LABEL RECORDS ARE STANDARD.
037100210928       01  TRANS-CONTRACT-TGT-REC.   COPY DD-ALL-FORMATS OF MFATRCTGLA.
037200210928
037300210928       FD  TRANS-CHARGES
037400210928           LABEL RECORDS ARE STANDARD.
037500210928       01  TRANS-CHARGES-REC.        COPY DD-ALL-FORMATS OF MFATRNCHP.
037600210928
037700210928       FD  TRANS-SEG-DEDUCTION-CODES
037800210928           LABEL RECORDS ARE STANDARD.
037900210928       01  TRANS-SEG-DEDUCTION-CODES-REC.
038000210928                         COPY DD-ALL-FORMATS OF MFATRNSDCP.
038100210928
038200210928      *RFS127401 - START
038300210928       FD  INVESTMENT-STRUCTURE-XREF
038400210928           LABEL RECORDS ARE STANDARD.
038500210928       01  INV-STRU-XREF-REC. COPY DD-ALL-FORMATS OF MFAINVSXP.
038600210928      *RFS127401 - END
038700210928
038800210928      *RFS180708 - Start
038900210928       FD  TRANS-MISC-DETAILS
039000210928           LABEL RECORDS ARE STANDARD.
039100210928       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
039200210928
039300210928       FD  TRANS-REDEM-DETAILS
039400210928           LABEL RECORDS ARE STANDARD.
039500210928       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
039600210928      *RFS180708 - End
039700210928
039800210928       WORKING-STORAGE SECTION.
039900210928
040000210928      * RFS 127401 - START
040100210928       01 LC-INVSTRUCTURECODE       PIC X(5).
040200210928127401 01 lc-GuarBenefitEligible       PIC X(5).
040300210928      * RFS 127401 - END
040400210928
040500210928      * Copybooks
040600210928
040700210928      * RFS49699 - Begin
040800210928
040900210928      *  screen edits allowed
041000210928           copy CPSCEDTAL1.
041100210928
041200210928      *  log array info
041300210928           copy CPFXLOGAU.
041400210928
041500210928      *  log array table name
041600210928           copy CPFXLOGAT.
041700210928
041800210928      * RFS49699 - End
041900210928
042000210928           EXEC SQL
042100210928                INCLUDE SQLCA
042200210928           END-EXEC.
042300210928
042400210928       01  CURR-CONTROLS.
042500210928          03 CURR-LEVEL1             PIC X(1).
042600210928
042700210928       01  PREV-CONTROLS.
042800210928          03 PREV-LEVEL1             PIC X(1).
042900210928
043000210928       01  PROG-ID-CODE              PIC X(10) VALUE "SEGRECALCP".
043100210928
043200210928       01  OPEN-FILES-ONCE           PIC X(1)  VALUE "Y".
043300210928
043400210928       01  EXCLUDE-TRANS-FLAG        PIC X(1).
043500210928
043600210928       01  UNITRAX-BASE-CURRENCY     PIC X(3)  VALUE " ".
043700210928
043800210928       01  PROG-EXCHANGE-RATE-TYPE   PIC X     VALUE " ".
043900210928
044000210928       01 SW01-SWITCHES.                                                RFS8712
044100210928          05 SW01-STS-FLAG                       PIC X(01).             RFS8712
044200210928             88 SW01-STS-OK                      VALUE " ".             RFS8712
044300210928             88 SW01-STS-OPEN                    VALUE "1".             RFS8712
044400210928             88 SW01-STS-START                   VALUE "2".             RFS8712
044500210928             88 SW01-STS-READ                    VALUE "3".             RFS8712
044600210928             88 SW01-STS-REWRITE                 VALUE "4".             RFS8712
044700210928             88 SW01-STS-WRITE                   VALUE "5".             RFS8712
044800210928             88 SW01-STS-DELETE                  VALUE "6".             RFS8712
044900210928             88 SW01-STS-END                     VALUE "7".             RFS8712
045000210928             88 SW01-STS-CLOSE                   VALUE "8".             RFS8712
045100210928             88 SW01-STS-RANGE                   VALUE "9".             RFS8712
045200210928             88 SW01-STS-FOUND                   VALUE "A".             RFS8712
045300210928             88 SW01-STS-FAIL                    VALUE "*".             RFS8712
045400210928
045500210928       01  WS-MISC-FIELDS.
045600210928           05 WS-NEW-GUAR-DEATH-VALUE   PIC S9(11)V99 COMP-3 VALUE 0.
045700210928           05 WS-NEW-GUAR-DEATH-VAL-CUR PIC S9(11)V99 COMP-3 VALUE 0.
045800210928           05 WS-CURR-UNIT-BAL         PIC S9(10)V999 COMP-3 VALUE 0.
045900210928           05 WS-REJECTION-CODE        PIC X(3).
046000210928           05 WS-EXCHANGE-FOUND        PIC X(1).
046100210928      * Exchange variables
046200210928           05 WS-EXCH-PLACEMENT-DATE   PIC S9(10)      COMP-3.
046300210928           05 WS-EXCH-TRANS-NO         PIC S9(10)      COMP-3.
046400210928           05 WS-EXCH-CURRENCY         PIC X(3).
046500210928           05 WS-EXCH-TRADE-DATE       PIC S9(8) COMP-3.
046600210928           05 WS-EXCH-RATE             PIC S9(2)V9(7)  COMP-3.
046700210928           05 WS-EXCH-RATE-VALUE       PIC S9(2)V9(7)  COMP-3.
046800210928           05 WS-CURR-TRANS-UNIT-AMT   PIC S9(10)V9(3) COMP-3.
046900210928           05 WS-CURR-TRANS-UNIT-PRICE PIC S9(5)V9(4) COMP-3.
047000210928           05 WS-CURR-TRANS-TRADE-DATE PIC S9(8) COMP-3.
047100210928           05 WS-CURR-TRANS-GROSS-AMT  PIC S9(11)V9(2) COMP-3.
047200210928           05 WS-CURR-TRANS-AMT        PIC S9(11)V9(2) COMP-3.
047300210928           05 WS-CURR-TRANS-AMT-CUR    PIC S9(11)V9(2) COMP-3.
047400210928           05 WS-CURR-TRANS-PLACEMENT-DATE PIC 9(8).
047500210928           05 WS-CURR-TRANS-TRANS-NO   PIC S9(10)      COMP-3.
047600210928           05 WS-CURR-ORIG-UNIT-BAL    PIC S9(10)V9(3) COMP-3.
047700210928           05 WS-BYPASS-DEDUCTION      PIC X.
047800210928           05 WS-CONTRACT-GROSS-AMT    PIC S9(11)V9(2) COMP-3.
047900210928           05 WS-DEDUCTION-AMT         PIC S9(11)V9(2) COMP-3.
048000210928           05 WS-TRN-PLACEMENT-DATE    PIC 9(8).
048100210928           05 WS-TRN-TRANS-NO          PIC S9(10)      COMP-3.
048200210928           05 WS-TRN-PROCESS-DATE      PIC 9(8).
048300210928           05 WS-DEDUCTION-PROP          PIC S9(10)V9(8) COMP-3.
048400210928           05 WS-DEDUCTION-GDV-CHANGE    PIC S9(10)V9(8) COMP-3.
048500210928           05 WS-DEDUCTION-NDV-CHANGE    PIC S9(10)V9(8) COMP-3.
048600210928           05 WS-IN-DEDUCTION-AMT        PIC S9(11)V9(2) COMP-3.
048700210928           05 WS-OUT-TRANS-GROSS         PIC S9(11)V9(2) COMP-3.
048800210928           05 WS-IN-TRANS-GROSS          PIC S9(11)V9(2) COMP-3.
048900210928           05 WS-FROM-GROSS-AMT          PIC S9(11)V9(2) COMP-3.
049000210928
049100210928           05 WS-SYSDATE.
049200210928              10 WS-SYSDATE-CC         PIC 99.
049300210928              10 WS-SYSDATE-YMD.
049400210928                 15 WS-SYSDATE-YY      PIC 99.
049500210928                 15 WS-SYSDATE-MM      PIC 99.
049600210928                 15 WS-SYSDATE-DD      PIC 99.
049700210928           05 WS-SYSDATE-N REDEFINES WS-SYSDATE
049800210928                                       PIC 9(8).
049900210928
050000210928           05 WS-SYSTIME-LONG.
050100210928              10 WS-SYSTIME.
050200210928                 15 WS-SYSTIME-HH      PIC 99.
050300210928                 15 WS-SYSTIME-MI      PIC 99.
050400210928                 15 WS-SYSTIME-SS      PIC 99.
050500210928              10 WS-SYSTIME-N REDEFINES WS-SYSTIME
050600210928                                       PIC 9(6).
050700210928              10 WS-SYSTIME-2 REDEFINES WS-SYSTIME
050800210928                                       PIC 9(4).
050900210928              10 WS-SYSTIME-HS         PIC 99.
051000210928
051100210928            05 WS-SYSTIME-LONG-N REDEFINES WS-SYSTIME-LONG
051200210928                                       PIC 9(8).
051300210928
051400210928            05 WS-MISC-INFO-AREA       PIC X(40).
051500210928
051600210928            05 WS-MISC-INFO-1 REDEFINES WS-MISC-INFO-AREA.
051700210928              10 WS-MISC-INFO-1-NAME   PIC X(20).
051800210928              10 WS-MISC-INFO-1-UNIT   PIC -9(10).9(3).
051900210928
052000210928            05 WS-MISC-INFO-2 REDEFINES WS-MISC-INFO-AREA.
052100210928              10 WS-MISC-INFO-2-NAME   PIC X(11).
052200210928              10 WS-MISC-INFO-2-NKEY-1 PIC X(6).
052300210928              10 WS-MISC-INFO-2-KEY-1  PIC 9(8).
052400210928              10 WS-MISC-INFO-2-NKEY-2 PIC X(6).
052500210928              10 WS-MISC-INFO-2-KEY-2  PIC 9(9).
052600210928      /
052700210928       01 TRANSACTION-CATEGORIES.
052800210928          05 TRANS-CATEGORY              PIC X(3).
052900210928             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI".
053000210928             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
053100210928             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO"
053200210928                                                "TFE" "CQD" "FEE" "SAJ".
053300210928             88 SWITCH-OUT-TRANSACTION   VALUES "SWO" "TRO".
053400210928             88 ADDITION-TRANSACTION     VALUES "BUY" "INC" "CPG"
053500210928                                                "SWI" "TRI" "INT"
053600210928                                                "MFR" "SSD" "SSU" "BAJ"
053700210928                                                "BFW".
053800210928             88 REDUCTION-TRANSACTION    VALUES "SEL" "SWO" "TRO"
053900210928                                                "TFE" "CQD" "FEE" "SAJ".
054000210928             88 VALID-TRANSACTION        VALUES "BUY" "SEL" "SWI"
054100210928                                                "SWO" "TRI" "TRO".
054200210928             88 SWITCH-IN                VALUE "SWI".
054300210928             88 TRANSFER-IN              VALUE "TRI".
054400210928             88 BUY-TRANSACTION          VALUE "BUY".
054500210928
054600210928       01 TRANSACTION-STATUS-CATEGORIES.
054700210928          05 TRANS-STATUS-CATEGORY       PIC X(3).
054800210928             88 HISTORY                  VALUES "HST" "HSC".
054900210928             88 HISTORY-CONVERSION       VALUES "HSC".
055000210928             88 PENDING                  VALUES "PND" "VER".
055100210928             88 CONTRACTED               VALUES "CON".
055200210928             88 UNCONFIRMED              VALUES "UNC".
055300210928             88 CANCELLED                VALUES "CAN".
055400210928             88 SETTLED                  VALUES "SET".
055500210928             88 RVSD                     VALUES "RVS".
055600210928
055700210928       01 TRANSACTION-REVERSE-CATEGORIES.
055800210928          05 TRANS-REVERSE-CATEGORY      PIC X(1).
055900210928             88 TRANS-REVERSED           VALUES "Y".
056000210928
056100210928       01 OLD-INVRIDX                    PIC 9(2) VALUE 0.
056200210928
056300210928       01 WS-ACC-CONT-INV-RESET-ARRAYX.
056400210928          05 WS-ACC-CONT-INV-RESET-ARRAY OCCURS 50 TIMES
056500210928                                         INDEXED BY INVRIDX.
056600210928             10 WS-ARRAY-INVR-ACCOUNT-NO   PIC 9(09).
056700210928             10 WS-ARRAY-INVR-CONTRACT-NO  PIC 9(09).
056800210928             10 WS-ARRAY-INVR-INVEST-CODE  PIC X(05).
056900210928             10 WS-ARRAY-INVR-RESET-NO     PIC 9(02).
057000210928             10 WS-ARRAY-INVR-UNIT-BAL     PIC S9(10)V9(3) COMP-3.
057100210928             10 WS-ARRAY-INVR-GDV          PIC S9(11)V9(2) COMP-3.
057200210928             10 WS-ARRAY-INVR-GDV-CUR      PIC S9(11)V9(2) COMP-3.
057300210928
057400210928       01 WS-ACC-CONT-INV-ARRAYX.
057401211007111744*   05 WS-ACC-CONT-INV-ARRAY OCCURS 40 TIMES INDEXED BY CONTIDX.
057402211007111744    05 WS-ACC-CONT-INV-ARRAY OCCURS 1 TO 1000 TIMES DEPENDING ON
057403211007111744                        ln_InvArraySize INDEXED BY CONTIDX.
057600210928             10 WS-ARRAY-ACCOUNT-NO        PIC 9(09).
057700210928             10 WS-ARRAY-CONTRACT-NO       PIC 9(09).
057800210928             10 WS-ARRAY-INVESTMENT-CODE   PIC X(05).
057900210928             10 WS-ARRAY-INV-CURR-CODE     PIC X(03).
058000210928             10 WS-ARRAY-BEFORE-MV         PIC S9(11)V9(2) COMP-3.
058100210928             10 WS-ARRAY-BEFORE-GDV        PIC S9(11)V9(2) COMP-3.
058200210928             10 WS-ARRAY-BEFORE-NDV        PIC S9(11)V9(2) COMP-3.
058300210928             10 WS-ARRAY-AFTER-MV          PIC S9(11)V9(2) COMP-3.
058400210928             10 WS-ARRAY-INV-EXCH-RATE     PIC S9(2)V9(7) COMP-3.
058500210928
058600210928
058700210928      * RFS49699 - Begin
058800210928
058900210928       01 WS-ARRAY-LOG-MISC.
059000210928           05 WS-ARRAY1-NAME           PIC X(32)
059100210928                               VALUE "WS-ACC-CONT-INV-RESET-ARRAY".
059200210928           05 WS-ARRAY1-MAX            PIC 9(09)
059300210928                               VALUE 50.
059400210928           05 WS-ARRAY1-MAX-USED       PIC 9(09)
059500210928                               VALUE 0.
059600210928           05 WS-ARRAY2-NAME           PIC X(32)
059700210928                               VALUE "WS-ACC-CONT-INV-ARRAY".
059800210928           05 WS-ARRAY2-MAX            PIC 9(09)
059900210928                               VALUE 40.
060000210928           05 WS-ARRAY2-MAX-USED       PIC 9(09)
060100210928                               VALUE 0.
060200210928
060300210928      * RFS49699 - End
060400210928
060500210928       01 WS-VARS-4ROUNDING.
060600210928          05 WS-CONT-NDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
060700210928          05 WS-CONT-GDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
060800210928          05 WS-NDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
060900210928          05 WS-GDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
061000210928
061100210928       01 WS-LEVEL-88.
061200210928          05 WS-INV-RESET-FLAG             PIC X.
061300210928             88 INV-RESET-FOUND            VALUE "Y".
061400210928          05 WS-NEED-GDV-FLAG              PIC X.
061500210928             88 NEEDS-GDV-AMOUNT           VALUE "Y".
061600210928          05 WS-FIRST-RECALC-PASS          PIC X.
061700210928             88 FIRST-RECALC-PASS          VALUE "Y".
061800210928          05 WS-ARRAY-POINTER              PIC X.
061900210928             88 ARRAY-POINTER-FOUND        VALUE "Y".
062000210928             88 ARRAY-POINTER-NOT-FOUND    VALUE "N".
062100210928          05 WS-SQL-FILE-OPEN              PIC X.
062200210928             88 SQL-FILE-OPEN              VALUE "Y".
062300210928             88 SQL-FILE-NOT-OPEN          VALUE "N".
062400210928          05 WS-LOAD-STRUCTURE             PIC X.
062500210928             88 FRONT-END                  VALUE "F".
062600210928          05 WS-NDV-DIFF-FLAG              PIC X(01).
062700210928             88 NDV-DIFFERENCE-FOUND       VALUE "Y".
062800210928          05 WS-GDV-DIFF-FLAG              PIC X(01).
062900210928             88 GDV-DIFFERENCE-FOUND       VALUE "Y".
063000210928          05 WS-NDV-UPDATE-FLAG            PIC X(01).
063100210928             88 NDV-NOT-UPDATED            VALUE "Y".
063200210928          05 WS-GDV-UPDATE-FLAG            PIC X(01).
063300210928             88 GDV-NOT-UPDATED            VALUE "Y".
063400210928          05 WS-XFER-AMT-EXISTS-FLAG       PIC X(01).
063500210928             88 TRANSFER-AMT-EXISTS        VALUE "Y".
063600210928          05 WS-INV-SEG-FIRST-PASS         PIC X.
063700210928             88 INV-SEG-FIRST-PASS         VALUE "Y".
063800210928
063900210928       01 WS-CURRENCY                      PIC X(3).
064000210928       01 WS-EX-CURRENCY                   PIC X(3).
064100210928       01 WS-TRANS-COUNT                   PIC 9(3) VALUE 0.
064200210928       01 WS-GUAR-DEATH-VALUE-BEF           PIC S9(11)V9(2).
064300210928       01 WS-SWO-GDV-CHANGE                PIC S9(11)V9(2) COMP-3
064400210928                                           VALUE 0.
064500210928       01 WS-SWO-NDV-CHANGE                PIC S9(11)V9(2) COMP-3
064600210928                                           VALUE 0.
064700210928       01 WS-EXCLUDE-VARIABLES.
064800210928          05 WS-EX-ACCOUNT-NO              PIC 9(9).
064900210928          05 WS-EX-ACCOUNT-TYPE            PIC X(5).
065000210928          05 WS-EX-NOM-ACCOUNT-TYPE        PIC X(5).
065100210928          05 WS-EX-TRANS-TYPE              PIC X(3).
065200210928          05 WS-EX-TRANS-ORIGIN            PIC X(3).
065300210928          05 WS-EX-REVERSAL-CODE           PIC X(4).
065400210928          05 WS-EXCLUDE-TRANS              PIC X(1).
065500210928
065600210928       01 WS-OTHER-VARIABLES.
065700210928          05 WS-DIFF-INVESTMENT-FLAG        PIC X(01).
065800210928          05 WS-OLD-CURR-INVESTMENT-CODE    PIC X(05).
065900210928          05 WS-CONT-INVESTMENT-CODE        PIC X(05).
066000210928          05 WS-PRICE-FOUND                 PIC X(01).
066100210928          05 WS-REQUIRED-UNITSP             PIC S9(10)V9(3) COMP-3.
066200210928          05 WS-INV-UNIT-PRICE              PIC S9(5)V9(4) COMP-3.
066300210928          05 WS-INV-TRADE-DATE              PIC S9(8)       COMP-3.
066400210928          05 WS-INV-DST-FLAG                PIC X.
066500210928          05 WS-INV-BEF-MARKET-VALUE        PIC S9(11)V9(4) COMP-3.
066600210928          05 WS-INV-AFT-MARKET-VALUE        PIC S9(11)V9(2) COMP-3.
066700210928          05 WS-CONT-INV-MARKET-VALUE       PIC S9(12)V9(4) COMP-3.
066800210928          05 WS-CURR-CONTRACT-MV-AFT        PIC S9(12)V9(2) COMP-3.
066900210928          05 WS-INV-BEF-GDV                 PIC S9(11)V9(2) COMP-3.
067000210928          05 WS-INV-BEF-NDV                 PIC S9(11)V9(2) COMP-3.
067100210928          05 WS-CURR-CONTRACT-GDV-BEF       PIC S9(12)V9(2) COMP-3.
067200210928          05 WS-CURR-CONTRACT-GDV-AFT       PIC S9(12)V9(2) COMP-3.
067300210928          05 WS-CURR-CONTRACT-NDV-BEF       PIC S9(12)V9(2) COMP-3.
067400210928          05 WS-CURR-CONTRACT-NDV-AFT       PIC S9(12)V9(2) COMP-3.
067500210928          05 WS-GDV-CHANGE                  PIC S9(11)V9(2) COMP-3.
067600210928          05 WS-INV-GDV-PERCENT             PIC S9(2)V9(3) COMP-3.
067700210928          05 WS-INV-GDV-PERCENT-TOTAL       PIC S9(2)V9(3) COMP-3.
067800210928          05 WS-NDV-CHANGE                  PIC S9(11)V9(2) COMP-3.
067900210928          05 WS-INV-NDV-PERCENT             PIC S9(2)V9(3) COMP-3.
068000210928          05 WS-INV-NDV-PERCENT-TOTAL       PIC S9(2)V9(3) COMP-3.
068100210928          05 WS-INV-GDV-AFT                 PIC S9(11)V9(2) COMP-3.
068200210928          05 WS-INV-GDV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
068300210928          05 WS-INV-NDV-AFT                 PIC S9(11)V9(2) COMP-3.
068400210928          05 WS-INV-NDV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
068500210928          05 WS-CONT-INV-ARRAY-COUNT        PIC S9(03) COMP-3.
068600210928          05 WS-CONT-INV-COUNT              PIC S9(03) COMP-3.
068700210928          05 WS-INV-OPENING-UNIT-BAL        PIC S9(10)V9(3) COMP-3.
068800210928          05 WS-NEXT-PROCESS-DATE           PIC 9(8).
068900210928          05 WS-DUMMY-PERCENT               PIC S9(2)V9(3) COMP-3.
069000210928
069100210928       01 WS-OTHER-VARIABLES3.
069200210928          05 WS-FROM-ACCOUNT-TYPE        PIC X(05).
069300210928          05 WS-FROM-NOM-ACCOUNT-TYPE    PIC X(05).
069400210928          05 WS-FROM-TRANS-TYPE-CODE     PIC X(03).
069500210928          05 WS-TO-ACCOUNT-TYPE          PIC X(05).
069600210928          05 WS-TO-NOM-ACCOUNT-TYPE      PIC X(05).
069700210928          05 WS-TO-TRANS-TYPE-CODE       PIC X(03).
069800210928          05 WS-TRANS-ORIGIN-CODE        PIC X(03).
069900210928          05 WS-CONTR-REDEM-CODE         PIC X(06).
070000210928          05 WS-FROM-PLACEMENT-DATE      PIC S9(09) COMP-3.
070100210928          05 WS-FROM-TRANS-NO            PIC S9(09) COMP-3.
070200210928          05 WS-TO-PLACEMENT-DATE        PIC S9(09) COMP-3.
070300210928          05 WS-TO-TRANS-NO              PIC S9(09) COMP-3.
070400210928          05 WS-FROM-ACCOUNT-NO          PIC S9(09) COMP-3.
070500210928          05 WS-TO-ACCOUNT-NO            PIC S9(09) COMP-3.
070600210928          05 WS-FROM-CONTRACT-NO         PIC 9(09).
070700210928          05 WS-TO-CONTRACT-NO           PIC 9(09).
070800210928          05 WS-TRANSFER-GBV             PIC X(01) VALUE "N".
070900210928
071000210928       01 CURRENT-RECORD-VARS.
071100210928          05 CURR-ACCOUNT-NO                PIC S9(9).
071200210928          05 CURR-INVESTMENT-CODE           PIC X(5).
071300210928          05 CURR-CONTRACT-NO               PIC S9(9).
071400210928          05 CURR-RESET-UNIT-PRICE          PIC S9(5)V9(4) COMP-3.
071500210928          05 CURR-RESET-EXCH-RATE           PIC S9(2)V9(7) COMP-3.
071600210928          05 CURR-OPENING-UNIT-BAL          PIC S9(9)V9(3) COMP-3.
071700210928          05 CURR-RESET-NO                  PIC 9(2).
071800210928          05 CURR-HAS-RESET-FLAG            PIC X(1).
071900210928          05 CURR-GUAR-DEATH-VALUE-BEF      PIC S9(11)V9(2) COMP-3.
072000210928          05 CURR-GUAR-DEATH-VAL-CUR-BEF    PIC S9(11)V9(2) COMP-3.
072100210928          05 CURR-DEATH-PERCENT             PIC S9(3)V9(2).
072200210928
072300210928       01 WS-SQL-VARIABLES.
072400210928          05 WS-SQL-PROCESS-DATE           PIC S9(9) COMP-3.
072500210928          05 WS-SQL-PROC-SEQ-NO            PIC S9(9) COMP-3.
072600210928          05 WS-SQL-PLACEMENT-DATE         PIC S9(9) COMP-3.
072700210928          05 WS-SQL-TRANS-NO               PIC S9(9) COMP-3.
072800210928
072900210928       01  WS-SCHED-CODE             PIC X(5).
073000210928       01  WS-ACCT-TYPE-CODE         PIC X(5).
073100210928       01  WS-START-DATE             PIC S9(8) COMP-3.
073200210928       01  WS-ANN-AGE                PIC S9(3).
073300210928       01  WS-ANN-SEQ-NO             PIC S9(3).
073400210928       01  WS-SYS-DATE               PIC 9(8) VALUE ZEROES.
073500210928       01  WS-DTH-PERCENT            PIC S9(8) COMP-3.
073600210928       01  WS-ANN-DOB                PIC S9(8).
073700210928       01  WS-INV-UNITS              PIC S9(10)V999  COMP-3.
073800210928
073900210928       01  WS-SQLLOG-VARIABLES.
074000210928           05 WS-ROUTINE-NAME               PIC  X(25).
074100210928           05 WS-SQLERR-STATEMENT           PIC X(25)   VALUE " ".
074200210928           05 WS-SQLERR-DATA                PIC X(1780) VALUE " ".
074300210928           05 WS-SQL-STATS                  PIC X(1966) VALUE " ".
074400210928           05 WS-SQLERR-REPLY               PIC X(01)  VALUE " ".
074500210928
074600210928107585 01  lc-TransferGDV                   PIC X(01).
074700210928
074800210928      *rfs42749 begins
074900210928       01  lc_Constants.
075000210928           05  lc_distrS                    PIC X(01) Value "S".
075100210928      *rfs42749 ends
075200210928
075300210928180708 01 WS-PLACEMENTDATE           PIC S9(09) VALUE 0.
075400210928180708 01 WS-TRANSNO                 PIC S9(09) VALUE 0.
075500210928
075501211007      * RFS1117445 - START
075502211007       01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
075503211007       01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
075504211007       01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
075505211007      * RFS1117445 - END
075600210928R47405 COPY CPGLWBRULE.
07570021092884063 *COPY CPGLWBCKTT.
07580021092884063  COPY CPCKFEETRN.
075900210928
076000210928       LINKAGE SECTION.
076100210928        01 COMM-AREA                     PIC X(200).
076200210928        01 COMM-AREA-BUFFER REDEFINES COMM-AREA.
076300210928           03 COMM-REJECTION-CODE        PIC X(3).
076400210928           03 COMM-USER                  PIC X(10).
076500210928           03 COMM-CALLER-ID-CODE        PIC X(10).
076600210928           03 COMM-ACTION                PIC X(10).
076700210928           03 COMM-OPEN-FILES            PIC X(1).
076800210928           03 COMM-PROCESS-DATE          PIC S9(8).
076900210928           03 COMM-ACCOUNT-NO            PIC 9(9).
077000210928           03 COMM-CONTRACT-NO           PIC 9(9).
077100210928           03 COMM-RESET-NUMBER          PIC 9(5).
077200210928           03 COMM-EFFECT-DATE           PIC S9(8).
077300210928
077400210928       PROCEDURE DIVISION USING COMM-AREA.
077500210928       MAINLINE.
077600210928           PERFORM INITIAL-LOGIC     THRU INL-EXIT.
077700210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
077800210928              GO TO ML-0020.
077900210928       ML-0010.
078000210928           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
078100210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
078200210928              GO TO ML-0020.
078300210928           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
078400210928
078500210928       ML-0020.
078600210928           PERFORM END-JOB             THRU EOJ-EXIT.
078700210928           GOBACK.
078800210928
078900210928       SQL-DECLARE-RTN.
079000210928           MOVE "SQL-DECLARE-RTN" TO WS-ROUTINE-NAME.
079100210928
079200210928***********************************************************************
079300210928******* CURSOR: SEGEXTSQ  - select trans after the effective date
079400210928*******                   - use in DETAIL-PROCESSING RTN
079500210928***********************************************************************
079600210928******* ALIAS        FILENAME                         OPENNAME
079700210928***********************************************************************
079800210928******* TRDPSP       TRANS-DAILY-PROC-SEQ             MFATRDPSP
079900210928******* TRNP         TRANS                            MFATRNP
080000210928***********************************************************************
080100210928           MOVE "DECLARE SEGEXTSQ" TO WS-SQLERR-STATEMENT.
080200210928      *RFS91599 Replaced 'Implicit Join' by 'Inner Join'
080300210928           EXEC SQL
080400210928              DECLARE SEGEXTSQ CURSOR FOR
080500210928               SELECT TRDPSP.PROCESS_DATE,
080600210928                      TRDPSP.PROC_SEQ_NO,
080700210928                      TRDPSP.PLACEMENT_DATE,
080800210928                      TRDPSP.TRANS_NO
08090021092891599            FROM MFATRDPSP TRDPSP
081000210928  |              INNER JOIN MFATRNP   TRNP ON
081100210928  |                TRDPSP.PLACEMENT_DATE = TRNP.PLACEMENT_DATE AND
081200210928  |                TRDPSP.TRANS_NO       = TRNP.TRANS_NO
08130021092891599           WHERE TRDPSP.PROCESS_DATE   > :COMM-EFFECT-DATE
081400210928                  AND TRDPSP.PROCESS_DATE  <= :COMM-PROCESS-DATE
081500210928                  AND   TRNP.REVERSE       <> "Y"
081600210928                  AND   TRNP.ACCOUNT_NO     = :CURR-ACCOUNT-NO
081700210928                ORDER BY TRDPSP.PROCESS_DATE,
081800210928                         TRDPSP.PROC_SEQ_NO
081900210928                FOR READ ONLY
082000210928           END-EXEC.
082100210928
082200210928***********************************************************************
082300210928******* CURSOR: INVPRC    - get investment unit price for a trade date
082400210928*******                   - use in GET-INVESTMENT-UNIT-PRICE RTN
082500210928***********************************************************************
082600210928******* ALIAS        FILENAME                         OPENNAME
082700210928***********************************************************************
082800210928******* INVUPP       INVESTMENT-UNIT-PRICE            MFAINVUPP
082900210928***********************************************************************
083000210928           MOVE "DECLARE INVPRC" TO WS-SQLERR-STATEMENT.
083100210928           EXEC SQL
083200210928             DECLARE INVPRC CURSOR FOR
083300210928             SELECT TRADE_DATE,
083400210928                    UNIT_PRICE,
083500210928                    DISTRIBUTION_FLAG
083600210928               FROM MFAINVUPP
083700210928              WHERE INVESTMENT_CODE = :WS-CONT-INVESTMENT-CODE
083800210928                AND TRADE_DATE     <= :WS-CURR-TRANS-TRADE-DATE
08390021092842749           AND DISTRIBUTION_FLAG <> :lc_distrS
084000210928              ORDER BY TRADE_DATE DESC,
084100210928                       DISTRIBUTION_FLAG DESC
084200210928              FOR READ ONLY
084300210928           END-EXEC.
084400210928
084500210928       SDR-EXIT.
084600210928           EXIT.
084700210928
084800210928      /
084900210928       GET-CURRENT-RECORD.
085000210928
085100210928           MOVE "Y" TO WS-INV-SEG-FIRST-PASS.
085200210928           INITIALIZE WS-ACC-CONT-INV-RESET-ARRAYX.
085300210928
085400210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-R-REC.
085500210928           MOVE COMM-ACCOUNT-NO
085600210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-R.
085700210928           MOVE COMM-CONTRACT-NO
085800210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-R.
085900210928           MOVE SPACES
086000210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-R.
086100210928
086200210928           START ACCOUNT-CONTRACT-INVEST-R
086300210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
086400210928                 INVALID KEY
086500210928                 MOVE HIGH-VALUES TO CURR-CONTROLS
086600210928                 GO TO GCR-EXIT.
086700210928
086800210928           SET INVRIDX TO 1.
086900210928           SET INVRIDX DOWN BY 1.
087000210928
087100210928       GCR-0010.
087200210928           READ ACCOUNT-CONTRACT-INVEST-R NEXT RECORD
087300210928                AT END
087400210928                GO TO GCR-EXIT.
087500210928
087600210928           IF COMM-ACCOUNT-NO NOT =
087700210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-R
087800210928              GO TO GCR-EXIT
087900210928           END-IF.
088000210928
088100210928           IF COMM-CONTRACT-NO NOT =
088200210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-R
088300210928              GO TO GCR-EXIT
088400210928           END-IF.
088500210928
088600210928           MOVE COMM-ACCOUNT-NO TO CURR-ACCOUNT-NO.
088700210928           MOVE COMM-CONTRACT-NO TO CURR-CONTRACT-NO.
088800210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-R
088900210928             TO CURR-INVESTMENT-CODE.
089000210928           MOVE COMM-RESET-NUMBER TO CURR-RESET-NO.
089100210928           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-R
089200210928             TO CURR-OPENING-UNIT-BAL.
089300210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-R
089400210928             TO CURR-GUAR-DEATH-VALUE-BEF.
089500210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-R
089600210928             TO CURR-GUAR-DEATH-VAL-CUR-BEF.
089700210928
089800210928           MOVE CURR-ACCOUNT-NO
089900210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET.
090000210928           MOVE CURR-CONTRACT-NO
090100210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET.
090200210928           MOVE CURR-RESET-NO
090300210928             TO RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET.
090400210928           MOVE CURR-INVESTMENT-CODE
090500210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET.
090600210928
090700210928           READ ACCOUNT-CONTRACT-INV-RESET
090800210928                INVALID KEY
090900210928                  MOVE ZEROES TO CURR-RESET-UNIT-PRICE
091000210928                                 CURR-RESET-EXCH-RATE
091100210928                                 CURR-OPENING-UNIT-BAL
091200210928                                 CURR-GUAR-DEATH-VALUE-BEF
091300210928                                 CURR-GUAR-DEATH-VAL-CUR-BEF
091400210928                NOT INVALID KEY
091500210928                  MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INV-RESET
091600210928                                     TO CURR-OPENING-UNIT-BAL
091700210928           END-READ.
091800210928
091900210928       GCR-0020.
092000210928
092100210928           MOVE 0 TO CURR-DEATH-PERCENT.
092200210928           IF INV-SEG-FIRST-PASS
092300210928              CALL "SEGDTHPER" USING CURR-ACCOUNT-NO
092400210928                                     CURR-CONTRACT-NO
092500210928                                     CURR-INVESTMENT-CODE
092600210928                                     CURR-DEATH-PERCENT
092700210928165027*       CANCEL "SEGDTHPER"
092800210928           END-IF.
092900210928
093000210928           SET INVRIDX UP BY 1.
093100210928      * RFS49699 - Array logging logic
093200210928
093300210928           IF INVRIDX  > WS-ARRAY1-MAX-USED
093400210928               MOVE INVRIDX                TO WS-ARRAY1-MAX-USED
093500210928           END-IF.
093600210928
093700210928      * RFS49699 - End
093800210928           MOVE CURR-ACCOUNT-NO
093900210928             TO WS-ARRAY-INVR-ACCOUNT-NO
094000210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
094100210928           MOVE CURR-CONTRACT-NO
094200210928             TO WS-ARRAY-INVR-CONTRACT-NO
094300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
094400210928           MOVE CURR-INVESTMENT-CODE
094500210928             TO WS-ARRAY-INVR-INVEST-CODE
094600210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
094700210928           MOVE CURR-RESET-NO
094800210928             TO WS-ARRAY-INVR-RESET-NO
094900210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
095000210928           MOVE CURR-OPENING-UNIT-BAL
095100210928             TO WS-ARRAY-INVR-UNIT-BAL
095200210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
095300210928           MOVE CURR-GUAR-DEATH-VALUE-BEF
095400210928             TO WS-ARRAY-INVR-GDV
095500210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
095600210928           MOVE CURR-GUAR-DEATH-VAL-CUR-BEF
095700210928             TO WS-ARRAY-INVR-GDV-CUR
095800210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
095900210928
096000210928           MOVE "N" TO WS-INV-SEG-FIRST-PASS.
096100210928           GO TO GCR-0010.
096200210928
096300210928       GCR-EXIT.
096400210928           EXIT.
096500210928      /
096600210928       DETAIL-PROCESSING.
096700210928
096800210928           MOVE "Y" TO WS-FIRST-RECALC-PASS.
096900210928           MOVE "N" TO WS-SQL-FILE-OPEN.
097000210928
097100210928
097200210928           MOVE "OPEN SEGEXTSQ" TO WS-SQLERR-STATEMENT.
097300210928           EXEC SQL
097400210928                OPEN SEGEXTSQ
097500210928           END-EXEC.
097600210928
097700210928           IF SQLCODE = 0
097800210928              CONTINUE
097900210928           ELSE
098000210928              GO TO DPR-CLOSE
098100210928           END-IF.
098200210928
098300210928           MOVE "Y" TO WS-SQL-FILE-OPEN.
098400210928
098500210928       DPR-0010.
098600210928
098700210928           EXEC SQL
098800210928              FETCH NEXT FROM SEGEXTSQ
098900210928               INTO :WS-SQL-PROCESS-DATE,   :WS-SQL-PROC-SEQ-NO,
099000210928                    :WS-SQL-PLACEMENT-DATE, :WS-SQL-TRANS-NO
099100210928           END-EXEC.
099200210928
099300210928           IF SQLCODE = 0
099400210928              CONTINUE
099500210928           ELSE
099600210928              GO TO DPR-CLOSE
099700210928           END-IF.
099800210928
099900210928           INITIALIZE MFATRNP OF TRANS-REC.
100000210928           MOVE WS-SQL-PLACEMENT-DATE
100100210928             TO PLACEMENT-DATE OF TRANS.
100200210928           MOVE WS-SQL-TRANS-NO
100300210928             TO TRANS-NO OF TRANS.
100400210928
100500210928           READ TRANS
100600210928                INVALID KEY
100700210928                GO TO DPR-0010.
100800210928
100900210928           IF ACCOUNT-NO OF TRANS NOT = COMM-ACCOUNT-NO
101000210928              GO TO DPR-EXIT
101100210928           END-IF.
101200210928
101300210928           IF PROCESS-DATE OF TRANS > COMM-PROCESS-DATE OR
101400210928              PROCESS-DATE OF TRANS < COMM-EFFECT-DATE
101500210928              GO TO DPR-EXIT
101600210928           END-IF.
101700210928
101800210928           IF PROCESS-DATE OF TRANS = COMM-EFFECT-DATE
101900210928              GO TO DPR-0010
102000210928           END-IF.
102100210928
102200210928           MOVE TRANS-TYPE-CODE OF TRANS
102300210928             TO TRANS-CATEGORY.
102400210928           MOVE TRANS-STATUS-CODE OF TRANS
102500210928             TO TRANS-STATUS-CATEGORY.
102600210928           MOVE REVERSE OF TRANS
102700210928             TO TRANS-REVERSE-CATEGORY.
102800210928
102900210928           IF TRANS-REVERSED OR
103000210928              NOT HISTORY OR
103100210928              NOT VALID-TRANSACTION
103200210928              GO TO DPR-0010
103300210928           END-IF.
103400210928
103500210928      * This routine will check the transaction if to be excluded or not.
103600210928           MOVE "N" TO WS-EXCLUDE-TRANS.
103700210928           INITIALIZE WS-EXCLUDE-VARIABLES.
103800210928           MOVE ACCOUNT-NO OF TRANS TO WS-EX-ACCOUNT-NO.
103900210928           MOVE TRANS-ORIGIN-CODE OF TRANS TO WS-EX-TRANS-ORIGIN.
104000210928           MOVE TRANS-TYPE-CODE OF TRANS TO WS-EX-TRANS-TYPE.
104100210928           MOVE REVERSAL-CODE OF TRANS TO WS-EX-REVERSAL-CODE.
104200210928180708     INITIALIZE WS-PLACEMENTDATE WS-TRANSNO.
104300210928180708     MOVE PLACEMENT-DATE OF TRANS  TO WS-PLACEMENTDATE.
104400210928180708     MOVE TRANS-NO OF TRANS        TO WS-TRANSNO.
104500210928           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
104600210928           IF WS-EXCLUDE-TRANS = "Y"
104700210928              GO TO DPR-0010
104800210928           END-IF.
104900210928
105000210928           INITIALIZE MFATRCODP OF TRANS-CONT-DTL-R2-REC.
105100210928           MOVE PLACEMENT-DATE OF TRANS
105200210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-R2.
105300210928           MOVE TRANS-NO OF TRANS
105400210928             TO TRANS-NO OF TRANS-CONTRACT-DTL-R2.
105500210928           MOVE CURR-CONTRACT-NO
105600210928             TO CONTRACT-NO OF TRANS-CONTRACT-DTL-R2.
105700210928
105800210928           READ TRANS-CONTRACT-DTL-R2 WITH NO LOCK
105900210928                INVALID KEY
106000210928                GO TO DPR-0010.
106100210928
106200210928           IF REVERSED-DDS OF TRANS-CONTRACT-DTL-R2 = "Y"
106300210928              GO TO DPR-0010
106400210928           END-IF.
106500210928
106600210928      * Get the GBV from Trans-GBV-Transfer it it exists
106700210928           MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
106800210928           INITIALIZE MFATRACXP OF TRANS-GBV-TRANSFER-REC.
106900210928           IF BUY-TRANSACTION
107000210928R49898        OR SWITCH-IN-TRANSACTION
107100210928              MOVE PLACEMENT-DATE OF TRANS
107200210928                TO PLACEMENT-DATE OF TRANS-GBV-TRANSFER
107300210928              MOVE TRANS-NO OF TRANS
107400210928                TO TRANS-NO OF TRANS-GBV-TRANSFER
107500210928
107600210928              READ TRANS-GBV-TRANSFER
107700210928                   INVALID KEY
107800210928                   GO TO DPR-0020
107900210928              END-READ
108000210928
108100210928              MOVE "Y" TO WS-XFER-AMT-EXISTS-FLAG
108200210928           END-IF.
108300210928
108400210928       DPR-0020.
108500210928           MOVE UNIT-AMT OF TRANS TO WS-CURR-TRANS-UNIT-AMT.
108600210928           MOVE UNIT-PRICE OF TRANS TO WS-CURR-TRANS-UNIT-PRICE.
108700210928           MOVE TRADE-DATE OF TRANS TO WS-CURR-TRANS-TRADE-DATE.
108800210928           MOVE GROSS-AMT OF TRANS TO WS-CURR-TRANS-GROSS-AMT.
108900210928           MOVE PLACEMENT-DATE OF TRANS
109000210928             TO WS-CURR-TRANS-PLACEMENT-DATE.
109100210928           MOVE TRANS-NO OF TRANS TO WS-CURR-TRANS-TRANS-NO.
109200210928           MOVE ACCOUNT-NO OF TRANS TO CURR-ACCOUNT-NO.
109300210928           MOVE INVESTMENT-CODE OF TRANS TO CURR-INVESTMENT-CODE.
109400210928
109500210928           IF REDEMPTION-TRANSACTION
109600210928              COMPUTE WS-CURR-TRANS-GROSS-AMT ROUNDED =
109700210928                      ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R2 *
109800210928                      UNIT-PRICE OF TRANS
109900210928           END-IF.
110000210928           MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R2
110100210928             TO WS-CURR-ORIG-UNIT-BAL.
110200210928
110300210928           IF SWITCH-IN-TRANSACTION
110400210928              COMPUTE WS-CONTRACT-GROSS-AMT ROUNDED =
110500210928                      ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R2 *
110600210928                      UNIT-PRICE OF TRANS
110700210928           END-IF.
110800210928
110900210928           PERFORM SET-INTERNAL-ARRAY-POINTER THRU SIAP-EXIT.
111000210928           IF ARRAY-POINTER-NOT-FOUND
111100210928              GO TO DPR-0010
111200210928           END-IF.
111300210928
111400210928           IF BUY-TRANSACTION
111500210928R49898        OR SWITCH-IN-TRANSACTION
111600210928              PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT
111700210928              MOVE GDV-CHANGE OF TRANS-CONTRACT-DTL-R2 TO
111800210928                                               WS-CURR-TRANS-AMT-CUR
111900210928
112000210928R49898*       IF BUY-TRANSACTION AND TRANSFER-AMT-EXISTS
112100210928R49898        IF (BUY-TRANSACTION OR SWITCH-IN-TRANSACTION)
112200210928R49898           AND TRANSFER-AMT-EXISTS
112300210928                 MOVE GUAR-BASE-VALUE OF TRANS-GBV-TRANSFER
112400210928                   TO WS-CURR-TRANS-AMT-CUR
112500210928                 COMPUTE WS-CURR-TRANS-AMT-CUR ROUNDED
112600210928                       = WS-CURR-TRANS-AMT-CUR *
112700210928                         CURR-DEATH-PERCENT / 100
112800210928              END-IF
112900210928
113000210928              IF WS-CURRENCY NOT = UNITRAX-BASE-CURRENCY
113100210928                 MOVE WS-CURRENCY TO WS-EXCH-CURRENCY
113200210928                 MOVE WS-CURR-TRANS-PLACEMENT-DATE
113300210928                   TO WS-EXCH-PLACEMENT-DATE
113400210928                 MOVE WS-CURR-TRANS-TRANS-NO TO WS-EXCH-TRANS-NO
113500210928                 MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
113600210928                 PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
113700210928                 COMPUTE WS-CURR-TRANS-AMT ROUNDED =
113800210928                         WS-CURR-TRANS-AMT-CUR / WS-EXCH-RATE-VALUE
113900210928              ELSE
114000210928                 MOVE WS-CURR-TRANS-AMT-CUR TO WS-CURR-TRANS-AMT
114100210928              END-IF
114200210928              ADD WS-CURR-ORIG-UNIT-BAL
114300210928               TO WS-ARRAY-INVR-UNIT-BAL
114400210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
114500210928
114600210928              ADD WS-CURR-TRANS-AMT
114700210928               TO WS-ARRAY-INVR-GDV
114800210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
114900210928
115000210928              ADD WS-CURR-TRANS-AMT-CUR
115100210928               TO WS-ARRAY-INVR-GDV-CUR
115200210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
115300210928              PERFORM UPD-ACC-CON-INV-BUY THRU UACIB-EXIT
115400210928
115500210928              MOVE WS-ARRAY-INVR-GDV
115600210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
115700210928               TO GUAR-DEATH-VALUE OF TRANS-CONTRACT-DTL-R2
115800210928              MOVE WS-ARRAY-INVR-GDV-CUR
115900210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
116000210928               TO GUAR-DEATH-VALUE-CUR OF TRANS-CONTRACT-DTL-R2
116100210928              REWRITE TRANS-CONT-DTL-R2-REC
116200210928              GO TO DPR-0010
116300210928           END-IF.
116400210928
116401211007111744        INITIALIZE ln_InvArraySize
116402211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
116500210928           SET OLD-INVRIDX TO INVRIDX.
116600210928           INITIALIZE WS-OTHER-VARIABLES WS-ACC-CONT-INV-ARRAYX.
116601211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
116602211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
116603211007111744     INITIALIZE WS-ARRAY-ACCOUNT-NO(IVS-CNT1)
116604211007111744                WS-ARRAY-CONTRACT-NO(IVS-CNT1)
116605211007111744                WS-ARRAY-INVESTMENT-CODE(IVS-CNT1)
116606211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
116607211007111744                WS-ARRAY-BEFORE-MV(IVS-CNT1)
116608211007111744                WS-ARRAY-BEFORE-GDV(IVS-CNT1)
116609211007111744                WS-ARRAY-BEFORE-NDV(IVS-CNT1)
116610211007111744                WS-ARRAY-AFTER-MV(IVS-CNT1)
116611211007111744                WS-ARRAY-INV-EXCH-RATE(IVS-CNT1)
116612211007111744     END-PERFORM
116700210928           PERFORM CALC-CONTRACT-MARKET-VALUE THRU CCMV-EXIT.
116800210928           MOVE "N" TO WS-TRANSFER-GBV.
116900210928           IF SWITCH-IN-TRANSACTION
117000210928              MOVE CONTRACT-NO OF TRANS-CONTRACT-DTL-R2
117100210928                   TO WS-TO-CONTRACT-NO
117200210928              PERFORM GET-SEG-TRANSFER-PARAMETERS THRU GSTP-EXIT
117300210928           END-IF.
117400210928           PERFORM CALC-NEW-CHANGE-GDV THRU CNCG-EXIT.
117500210928           PERFORM RECALC-GDV-VALUES THRU RNGV-EXIT.
117600210928           PERFORM CHECK-GDV-ROUNDING THRU CNGR-EXIT.
117700210928           SET INVRIDX TO OLD-INVRIDX.
117800210928
117900210928           MOVE "N" TO WS-FIRST-RECALC-PASS.
118000210928
118100210928           GO TO DPR-0010.
118200210928
118300210928       DPR-CLOSE.
118400210928           MOVE "CLOSE SEGEXTSQ" TO WS-SQLERR-STATEMENT.
118500210928           EXEC SQL
118600210928             CLOSE SEGEXTSQ
118700210928           END-EXEC.
118800210928
118900210928       DPR-EXIT.
119000210928           EXIT.
119100210928      /
119200210928       SET-INTERNAL-ARRAY-POINTER.
119300210928           MOVE "N" TO WS-ARRAY-POINTER
119400210928           SET INVRIDX TO 1.
119500210928
119600210928           SEARCH WS-ACC-CONT-INV-RESET-ARRAY VARYING INVRIDX
119700210928           WHEN WS-ARRAY-INVR-ACCOUNT-NO(INVRIDX) = COMM-ACCOUNT-NO AND
119800210928              WS-ARRAY-INVR-INVEST-CODE(INVRIDX) = CURR-INVESTMENT-CODE
119900210928              MOVE "Y" TO WS-ARRAY-POINTER
120000210928              GO TO SIAP-EXIT
120100210928           WHEN WS-ARRAY-INVR-ACCOUNT-NO(INVRIDX) = 0 OR
120200210928                WS-ARRAY-INVR-INVEST-CODE(INVRIDX) = " "
120300210928              GO TO SIAP-EXIT
120400210928           END-SEARCH.
120500210928
120600210928       SIAP-EXIT.
120700210928           EXIT.
120800210928      /
120900210928       UPD-ACC-CON-INV-BUY.
121000210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-REC.
121100210928           MOVE CURR-ACCOUNT-NO
121200210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
121300210928           MOVE CURR-CONTRACT-NO
121400210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
121500210928           MOVE CURR-INVESTMENT-CODE
121600210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
121700210928
121800210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
121900210928                INVALID KEY
122000210928                GO TO UACIB-EXIT.
122100210928
122200210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
122300210928             TO OLD-GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
122400210928           MOVE GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
122500210928             TO OLD-GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
122600210928
122700210928           MOVE WS-ARRAY-INVR-GDV-CUR
122800210928             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
122900210928             TO GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
123000210928           IF WS-CURRENCY = UNITRAX-BASE-CURRENCY
123100210928              MOVE WS-ARRAY-INVR-GDV-CUR
123200210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
123300210928                TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
123400210928           ELSE
123500210928                  MOVE WS-ARRAY-INVR-GDV
123600210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
123700210928                TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
123800210928           END-IF.
123900210928
124000210928           REWRITE ACC-CON-INV-REC.
124100210928
124200210928       UACIB-EXIT.
124300210928           EXIT.
124400210928      /
124500210928       CALC-CONTRACT-MARKET-VALUE.
124600210928
124700210928           SET INVRIDX TO 1.
124800210928           SET INVRIDX DOWN BY 1.
124900210928
125000210928           SET CONTIDX TO 1.
125100210928           SET CONTIDX DOWN BY 1.
125200210928
125300210928       CCMV-0010.
125400210928           SET INVRIDX UP BY 1.
125500210928
125600210928           IF WS-ARRAY-INVR-ACCOUNT-NO
125700210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
125800210928              WS-ARRAY-INVR-CONTRACT-NO
125900210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
126000210928              WS-ARRAY-INVR-RESET-NO
126100210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
126200210928              WS-ARRAY-INVR-INVEST-CODE
126300210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = " "
126400210928              GO TO CCMV-EXIT.
126500210928
126600210928           MOVE "N" TO WS-DIFF-INVESTMENT-FLAG.
126700210928           IF CURR-INVESTMENT-CODE NOT =
126800210928              WS-ARRAY-INVR-INVEST-CODE OF
126900210928                 WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
127000210928              MOVE "Y" TO WS-DIFF-INVESTMENT-FLAG
127100210928           END-IF.
127200210928
127300210928           MOVE CURR-INVESTMENT-CODE TO WS-OLD-CURR-INVESTMENT-CODE.
127400210928           MOVE WS-ARRAY-INVR-INVEST-CODE
127500210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
127600210928             TO CURR-INVESTMENT-CODE
127700210928                WS-CONT-INVESTMENT-CODE.
127800210928           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
127900210928           MOVE WS-OLD-CURR-INVESTMENT-CODE TO CURR-INVESTMENT-CODE.
128000210928
128100210928           IF WS-CURRENCY NOT = UNITRAX-BASE-CURRENCY
128200210928              MOVE WS-CURRENCY TO WS-EXCH-CURRENCY
128300210928              MOVE WS-CURR-TRANS-PLACEMENT-DATE
128400210928                   TO WS-EXCH-PLACEMENT-DATE
128500210928              MOVE WS-CURR-TRANS-TRANS-NO TO WS-EXCH-TRANS-NO
128600210928              MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
128700210928              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
128800210928              IF WS-EXCH-RATE-VALUE = 0 OR
128900210928                 WS-EXCHANGE-FOUND NOT = "Y"
129000210928                 MOVE "06" TO WS-REJECTION-CODE
129100210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
129200210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
129300210928                 MOVE WS-EXCH-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
129400210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
129500210928                 MOVE WS-EXCH-TRANS-NO TO WS-MISC-INFO-2-KEY-2
129600210928                 PERFORM LOG-ERROR THRU LER-EXIT
129700210928                 GO TO CCMV-EXIT
129800210928              END-IF
129900210928           ELSE
130000210928              MOVE "Y" TO WS-EXCHANGE-FOUND
130100210928              MOVE 1.0 TO WS-EXCH-RATE-VALUE
130200210928           END-IF.
130300210928
130400210928           IF CURR-INVESTMENT-CODE NOT = WS-CONT-INVESTMENT-CODE
130500210928              PERFORM GET-INVESTMENT-MARKET-VALUE THRU GIMV-EXIT
130600210928              IF WS-PRICE-FOUND NOT = "Y" OR
130700210928                 WS-INV-UNIT-PRICE = 0
130800210928                 MOVE "05" TO WS-REJECTION-CODE
130900210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
131000210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
131100210928                 MOVE WS-EXCH-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
131200210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
131300210928                 MOVE WS-EXCH-TRANS-NO TO WS-MISC-INFO-2-KEY-2
131400210928                 PERFORM LOG-ERROR THRU LER-EXIT
131500210928                 GO TO CCMV-EXIT
131600210928              END-IF
131700210928           ELSE
131800210928              MOVE WS-CURR-TRANS-UNIT-PRICE TO WS-INV-UNIT-PRICE
131900210928           END-IF.
132000210928
132100210928       CCMV-0020.
132200210928           MOVE WS-ARRAY-INVR-UNIT-BAL
132300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
132400210928             TO WS-INV-OPENING-UNIT-BAL.
132500210928
132600210928      ** Calculate the market value of the investment before this trade.
132700210928           IF WS-CURRENCY = UNITRAX-BASE-CURRENCY
132800210928              COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
132900210928                      WS-INV-OPENING-UNIT-BAL * WS-INV-UNIT-PRICE
133000210928           ELSE
133100210928              COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
133200210928                      WS-INV-OPENING-UNIT-BAL *
133300210928                      WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
133400210928           END-IF.
133500210928
133600210928      * Get the GDV of the current account/contract/investment
133700210928           IF FIRST-RECALC-PASS
133800210928              MOVE WS-ARRAY-INVR-GDV
133900210928                   OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
134000210928                TO WS-INV-BEF-GDV
134100210928           ELSE
134200210928           MOVE WS-ARRAY-INVR-ACCOUNT-NO
134300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
134400210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
134500210928           MOVE WS-ARRAY-INVR-CONTRACT-NO
134600210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
134700210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
134800210928           MOVE WS-ARRAY-INVR-INVEST-CODE
134900210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
135000210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-SWI
135100210928
135200210928           READ ACCOUNT-CONTRACT-INVEST-SWI
135300210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
135400210928                TO WS-INV-BEF-GDV
135500210928           END-IF.
135600210928
135700210928           IF CURR-INVESTMENT-CODE = WS-CONT-INVESTMENT-CODE
135800210928              IF NOT SWITCH-IN-TRANSACTION
135900210928                 SUBTRACT WS-CURR-ORIG-UNIT-BAL FROM
136000210928                          WS-ARRAY-INVR-UNIT-BAL
136100210928                             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
136200210928              ELSE
136300210928                 ADD WS-CURR-ORIG-UNIT-BAL
136400210928                       TO WS-ARRAY-INVR-UNIT-BAL
136500210928                             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
136600210928              END-IF
136700210928           END-IF.
136800210928
136900210928           IF WS-CURRENCY = UNITRAX-BASE-CURRENCY
137000210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
137100210928                 WS-ARRAY-INVR-UNIT-BAL
137200210928                    OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) *
137300210928                       WS-INV-UNIT-PRICE
137400210928           ELSE
137500210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
137600210928                 WS-ARRAY-INVR-UNIT-BAL
137700210928                    OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) *
137800210928                       WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
137900210928           END-IF.
138000210928
138100210928           ADD WS-INV-BEF-GDV TO WS-CURR-CONTRACT-GDV-BEF.
138200210928           ADD WS-INV-BEF-MARKET-VALUE TO WS-CONT-INV-MARKET-VALUE.
138300210928           ADD WS-INV-AFT-MARKET-VALUE TO WS-CURR-CONTRACT-MV-AFT.
138400210928
138500210928           SET CONTIDX UP BY 1.
138600210928      * RFS49699 - Array logging logic
138700210928
138800210928           IF CONTIDX  > WS-ARRAY2-MAX-USED
138900210928               MOVE CONTIDX                TO WS-ARRAY2-MAX-USED
139000210928           END-IF.
139100210928
139200210928      * RFS49699 - End
139201211007      * RFS1117445 Start
139202211007           IF CONTIDX >  ln_InvArraySize
139203211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
139204211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(CONTIDX)
139205211007                      WS-ARRAY-CONTRACT-NO(CONTIDX)
139206211007                      WS-ARRAY-INVESTMENT-CODE(CONTIDX)
139207211007                      WS-ARRAY-INV-CURR-CODE(CONTIDX)
139208211007                      WS-ARRAY-BEFORE-MV(CONTIDX)
139209211007                      WS-ARRAY-BEFORE-GDV(CONTIDX)
139210211007                      WS-ARRAY-BEFORE-NDV(CONTIDX)
139211211007                      WS-ARRAY-AFTER-MV(CONTIDX)
139212211007                      WS-ARRAY-INV-EXCH-RATE(CONTIDX)
139213211007           END-IF
139214211007      *    RFS1117445 End
139215211007
139300210928           MOVE CURR-ACCOUNT-NO TO WS-ARRAY-ACCOUNT-NO(CONTIDX).
139400210928           MOVE WS-CONT-INVESTMENT-CODE
139500210928                TO WS-ARRAY-INVESTMENT-CODE(CONTIDX).
139600210928           MOVE CURR-CONTRACT-NO TO WS-ARRAY-CONTRACT-NO(CONTIDX).
139700210928           MOVE WS-CURRENCY TO WS-ARRAY-INV-CURR-CODE(CONTIDX).
139800210928           MOVE WS-INV-BEF-MARKET-VALUE TO WS-ARRAY-BEFORE-MV(CONTIDX).
139900210928           MOVE WS-INV-BEF-GDV TO WS-ARRAY-BEFORE-GDV(CONTIDX).
140000210928           MOVE WS-INV-AFT-MARKET-VALUE TO WS-ARRAY-AFTER-MV(CONTIDX).
140100210928           MOVE WS-EXCH-RATE-VALUE TO WS-ARRAY-INV-EXCH-RATE(CONTIDX).
140200210928
140300210928           ADD 1 TO WS-CONT-INV-ARRAY-COUNT.
140400210928
140500210928           GO TO CCMV-0010.
140600210928
140700210928       CCMV-EXIT.
140800210928           EXIT.
140900210928      /
141000210928       CALC-NEW-CHANGE-GDV.
141100210928
141200210928      ** Get the change in NDV/GDV from the out transaction
141300210928           IF WS-TRANSFER-GBV = "Y" AND SWITCH-IN-TRANSACTION
141400210928              MOVE ZEROES TO WS-SWO-NDV-CHANGE WS-SWO-GDV-CHANGE
141500210928              PERFORM GET-NDV-GDV-CHANGE THRU GNGC-EXIT
141600210928           END-IF.
141700210928
141800210928           IF REDEMPTION-TRANSACTION
141900210928              IF WS-CONT-INV-MARKET-VALUE NOT = 0
142000210928              COMPUTE WS-GDV-CHANGE ROUNDED = WS-CURR-CONTRACT-GDV-BEF *
142100210928                      WS-CURR-TRANS-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
142200210928              ELSE
142300210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GDV-CHANGE
142400210928              END-IF
142500210928           ELSE
142600210928              IF WS-TRANSFER-GBV = "N" AND PURCHASE-TRANSACTION
142700210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GDV-CHANGE
142800210928              ELSE
142900210928                 IF WS-TRANSFER-GBV = "Y" AND PURCHASE-TRANSACTION
143000210928                    MOVE WS-SWO-GDV-CHANGE TO WS-GDV-CHANGE
143100210928                 END-IF
143200210928              END-IF
143300210928           END-IF.
143400210928
143500210928           IF SWITCH-OUT-TRANSACTION
143600210928              MOVE WS-GDV-CHANGE TO WS-SWO-GDV-CHANGE
143700210928           END-IF.
143800210928
143900210928           IF SWITCH-IN-TRANSACTION
144000210928              ADD WS-GDV-CHANGE TO WS-CURR-CONTRACT-GDV-BEF
144100210928                  GIVING WS-CURR-CONTRACT-GDV-AFT
144200210928           ELSE
144300210928              SUBTRACT WS-GDV-CHANGE FROM WS-CURR-CONTRACT-GDV-BEF
144400210928                  GIVING WS-CURR-CONTRACT-GDV-AFT
144500210928           END-IF.
144600210928
144700210928       CNCG-EXIT.
144800210928           EXIT.
144900210928      /
145000210928       GET-NDV-GDV-CHANGE.
145100210928      * Get the fee charges for the out transaction.
145200210928           MOVE 0 TO WS-DEDUCTION-AMT.
145300210928           MOVE PLACEMENT-DATE OF TRANS-OFFSET
145400210928                TO WS-TRN-PLACEMENT-DATE.
145500210928           MOVE TRANS-NO       OF TRANS-OFFSET TO WS-TRN-TRANS-NO.
145600210928           MOVE PROCESS-DATE   OF TRANS-OFFSET TO WS-TRN-PROCESS-DATE.
145700210928           PERFORM GET-DEDUCTION-AMT THRU GDA-EXIT.
145800210928
145900210928           INITIALIZE MFATRCTGP OF TRANS-CONTRACT-TGT-REC.
146000210928           MOVE WS-CURR-TRANS-PLACEMENT-DATE
146100210928             TO PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET2.
146200210928           MOVE WS-CURR-TRANS-TRANS-NO
146300210928             TO TRANS-NO-2 OF TRANS-CONTRACT-TARGET2.
146400210928           MOVE CURR-CONTRACT-NO
146500210928             TO CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET2.
146600210928
146700210928           START TRANS-CONTRACT-TARGET2
146800210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
146900210928                 INVALID KEY
147000210928                 GO TO GNGC-0500.
147100210928
147200210928       GNGC-0010.
147300210928           READ TRANS-CONTRACT-TARGET2 NEXT RECORD
147400210928                AT END
147500210928                GO TO GNGC-0500.
147600210928
147700210928           IF WS-CURR-TRANS-PLACEMENT-DATE NOT =
147800210928              PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET2 OR
147900210928              WS-CURR-TRANS-TRANS-NO NOT =
148000210928              TRANS-NO-2 OF TRANS-CONTRACT-TARGET2 OR
148100210928              CURR-CONTRACT-NO NOT =
148200210928              CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET2
148300210928              GO TO GNGC-0500
148400210928           END-IF.
148500210928
148600210928           INITIALIZE MFATRCODP OF TRANS-CON-DTL-REC.
148700210928           MOVE PLACEMENT-DATE OF TRANS-CONTRACT-TARGET2
148800210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS.
148900210928           MOVE TRANS-NO OF TRANS-CONTRACT-TARGET2
149000210928             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
149100210928           MOVE CONTRACT-NO OF TRANS-CONTRACT-TARGET2
149200210928             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
149300210928
149400210928           READ TRANS-CONTRACT-DETAILS
149500210928                INVALID KEY
149600210928                GO TO GNGC-0500.
149700210928
149800210928           IF WS-DEDUCTION-AMT > 0
149900210928                GO TO GNGC-0020.
150000210928
150100210928           ADD NDV-CHANGE OF TRANS-CONTRACT-DETAILS
150200210928             TO WS-SWO-NDV-CHANGE.
150300210928           ADD GDV-CHANGE OF TRANS-CONTRACT-DETAILS
150400210928             TO WS-SWO-GDV-CHANGE.
150500210928
150600210928           GO TO GNGC-0010.
150700210928      * begin
150800210928
150900210928       GNGC-0020.
151000210928
151100210928           COMPUTE WS-OUT-TRANS-GROSS ROUNDED =
151200210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
151300210928                   UNIT-PRICE OF TRANS-OFFSET.
151400210928
151500210928      * Apply the deductions on the out-side of the transaction
151600210928           COMPUTE WS-DEDUCTION-PROP ROUNDED =
151700210928                   WS-OUT-TRANS-GROSS / GROSS-AMT OF TRANS-OFFSET
151800210928                   * WS-DEDUCTION-AMT.
151900210928
152000210928           COMPUTE WS-DEDUCTION-GDV-CHANGE ROUNDED =
152100210928                  WS-DEDUCTION-PROP *
152200210928                  GDV-CHANGE OF TRANS-CONTRACT-DETAILS  /
152300210928                  WS-OUT-TRANS-GROSS.
152400210928
152500210928           COMPUTE WS-SWO-GDV-CHANGE ROUNDED
152600210928                 = WS-SWO-GDV-CHANGE +
152700210928                   GDV-CHANGE OF TRANS-CONTRACT-DETAILS -
152800210928                   WS-DEDUCTION-GDV-CHANGE.
152900210928
153000210928           COMPUTE WS-DEDUCTION-NDV-CHANGE ROUNDED =
153100210928                  WS-DEDUCTION-PROP *
153200210928                  NDV-CHANGE OF TRANS-CONTRACT-DETAILS  /
153300210928                  WS-OUT-TRANS-GROSS.
153400210928
153500210928           COMPUTE WS-SWO-NDV-CHANGE ROUNDED
153600210928                 = WS-SWO-NDV-CHANGE +
153700210928                   NDV-CHANGE OF TRANS-CONTRACT-DETAILS -
153800210928                   WS-DEDUCTION-NDV-CHANGE.
153900210928
154000210928           GO TO GNGC-0010.
154100210928
154200210928       GNGC-0500.
154300210928      * Get the fee charges for the IN  transaction.
154400210928           MOVE 0 TO WS-DEDUCTION-AMT.
154500210928           MOVE PLACEMENT-DATE OF TRANS
154600210928                TO WS-TRN-PLACEMENT-DATE.
154700210928           MOVE TRANS-NO       OF TRANS        TO WS-TRN-TRANS-NO.
154800210928           MOVE PROCESS-DATE   OF TRANS        TO WS-TRN-PROCESS-DATE.
154900210928           PERFORM GET-DEDUCTION-AMT THRU GDA-EXIT.
155000210928
155100210928           IF WS-DEDUCTION-AMT <= 0
155200210928              GO TO GNGC-EXIT.
155300210928
155400210928           COMPUTE WS-IN-TRANS-GROSS ROUNDED =
155500210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R   *
155600210928                   UNIT-PRICE OF TRANS.
155700210928
155800210928           COMPUTE WS-DEDUCTION-PROP ROUNDED =
155900210928                   WS-IN-TRANS-GROSS / NET-AMT OF TRANS
156000210928                   * WS-DEDUCTION-AMT.
156100210928
156200210928           COMPUTE WS-DEDUCTION-GDV-CHANGE ROUNDED =
156300210928                  WS-DEDUCTION-PROP * WS-SWO-GDV-CHANGE /
156400210928                  WS-IN-TRANS-GROSS.
156500210928
156600210928           COMPUTE WS-SWO-GDV-CHANGE ROUNDED
156700210928                 = WS-SWO-GDV-CHANGE -
156800210928                   WS-DEDUCTION-GDV-CHANGE.
156900210928
157000210928           COMPUTE WS-DEDUCTION-NDV-CHANGE ROUNDED =
157100210928                  WS-DEDUCTION-PROP * WS-SWO-NDV-CHANGE /
157200210928                  WS-IN-TRANS-GROSS.
157300210928
157400210928           COMPUTE WS-SWO-NDV-CHANGE ROUNDED
157500210928                 = WS-SWO-NDV-CHANGE -
157600210928                   WS-DEDUCTION-NDV-CHANGE.
157700210928       GNGC-EXIT.
157800210928           EXIT.
157900210928      /
158000210928       RECALC-GDV-VALUES.
158100210928
158200210928           IF WS-REJECTION-CODE NOT = " " AND "00"
158300210928              GO TO RNGV-EXIT
158400210928           END-IF.
158500210928
158600210928           INITIALIZE WS-CONT-INV-COUNT WS-INV-GDV-PERCENT-TOTAL
158700210928                                        WS-INV-NDV-PERCENT-TOTAL
158800210928                                        WS-CONT-NDV-AFT-TOTAL
158900210928                                        WS-CONT-GDV-AFT-TOTAL.
159000210928           SET CONTIDX TO 1.
159100210928           SET CONTIDX DOWN BY 1.
159200210928
159300210928       RNGV-NEXT.
159400210928           SET CONTIDX UP BY 1.
159401211007
159402211007111744     IF CONTIDX > WS-CONT-INV-ARRAY-COUNT
159403211007111744        GO TO RNGV-EXIT
159404211007111744     END-IF
159405211007
159500210928           IF WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
159600210928              IS EQUAL TO 0 OR
159700210928              WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
159800210928              IS EQUAL TO 0 OR
159900210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
159901211007              IS EQUAL TO " "  OR
159902211007111744        CONTIDX > WS-CONT-INV-ARRAY-COUNT
160100210928              GO TO RNGV-EXIT
160200210928           END-IF.
160300210928
160400210928       RNGV-PROCESS.
160500210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-REC.
160600210928           MOVE WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
160700210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
160800210928           MOVE WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
160900210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
161000210928           MOVE WS-ARRAY-INVESTMENT-CODE
161100210928             OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
161200210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
161300210928
161400210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
161500210928                INVALID KEY
161600210928                GO TO RNGV-NEXT.
161700210928
161800210928           ADD 1 TO WS-CONT-INV-COUNT.
161900210928
162000210928           IF SWITCH-IN-TRANSACTION
162100210928              IF WS-ARRAY-INVESTMENT-CODE(CONTIDX) =
162200210928                 CURR-INVESTMENT-CODE
162300210928                 ADD WS-GDV-CHANGE TO WS-ARRAY-BEFORE-GDV(CONTIDX)
162400210928                 MOVE WS-ARRAY-BEFORE-GDV(CONTIDX) TO WS-INV-GDV-AFT
162500210928                 GO TO RNGV-0010
162600210928              ELSE
162700210928                 GO TO RNGV-NEXT
162800210928              END-IF
162900210928           END-IF.
163000210928
163100210928           IF PURCHASE-TRANSACTION AND WS-CURR-CONTRACT-GDV-BEF = 0
163200210928              MOVE WS-CURR-CONTRACT-MV-AFT TO WS-INV-GDV-AFT
163300210928           ELSE
163400210928              IF WS-CURR-CONTRACT-MV-AFT NOT = 0
163500210928                 COMPUTE WS-INV-GDV-PERCENT ROUNDED =
163600210928                   WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
163700210928              ELSE
163800210928                 MOVE 0 TO WS-INV-GDV-PERCENT
163900210928              END-IF
164000210928
164100210928           ADD WS-INV-GDV-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
164200210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
164300210928              WS-INV-GDV-PERCENT-TOTAL NOT = 1.000 AND
164400210928              WS-INV-GDV-PERCENT-TOTAL NOT = 0
164500210928              SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
164600210928                       GIVING WS-DUMMY-PERCENT
164700210928              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
164800210928              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
164900210928           ELSE
165000210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
165100210928                (WS-INV-GDV-PERCENT-TOTAL = 0.999 OR
165200210928                 WS-INV-GDV-PERCENT-TOTAL > 1.000)
165300210928                 SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
165400210928                          GIVING WS-DUMMY-PERCENT
165500210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
165600210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
165700210928              END-IF
165800210928           END-IF
165900210928
166000210928           COMPUTE WS-INV-GDV-AFT ROUNDED =
166100210928                   WS-CURR-CONTRACT-GDV-AFT * WS-INV-GDV-PERCENT
166200210928           END-IF.
166300210928
166400210928       RNGV-0010.
166500210928           IF WS-ARRAY-INV-CURR-CODE(CONTIDX) = UNITRAX-BASE-CURRENCY
166600210928              MOVE WS-INV-GDV-AFT TO WS-INV-GDV-AFT-CUR
166700210928           ELSE
166800210928              COMPUTE WS-INV-GDV-AFT-CUR ROUNDED =
166900210928                      WS-INV-GDV-AFT * WS-ARRAY-INV-EXCH-RATE(CONTIDX)
167000210928           END-IF.
167100210928
167200210928           IF WS-INV-GDV-AFT IS NEGATIVE
167300210928              MOVE 0 TO WS-INV-GDV-AFT
167400210928                        WS-INV-GDV-AFT-CUR
167500210928           END-IF.
167600210928
167700210928      * Update the Old NDV and GDV only if the transaction pertains the
167800210928      * the right fund in the contract.
167900210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
168000210928              IS EQUAL TO CURR-INVESTMENT-CODE
168100210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
168200210928             TO OLD-GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
168300210928           MOVE GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
168400210928             TO OLD-GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
168500210928           END-IF
168600210928
168700210928      ** Update the Trans-Contract-Details record
168800210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
168900210928              IS EQUAL TO CURR-INVESTMENT-CODE
169000210928              MOVE WS-INV-GDV-AFT
169100210928                TO GUAR-DEATH-VALUE OF TRANS-CONTRACT-DTL-R2
169200210928              IF SWITCH-IN-TRANSACTION OR REDEMPTION-TRANSACTION
169300210928              MOVE WS-GDV-CHANGE
169400210928                TO GDV-CHANGE OF TRANS-CONTRACT-DTL-R2
169500210928              ELSE
169600210928              MOVE WS-INV-GDV-AFT-CUR
169700210928                TO GUAR-DEATH-VALUE-CUR OF TRANS-CONTRACT-DTL-R2
169800210928              END-IF
169900210928              REWRITE TRANS-CONT-DTL-R2-REC
170000210928           END-IF.
170100210928
170200210928           MOVE WS-INV-GDV-AFT
170300210928                TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
170400210928           MOVE WS-INV-GDV-AFT-CUR
170500210928                TO GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
170600210928
170700210928           IF REDEMPTION-TRANSACTION
170800210928              ADD WS-INV-GDV-AFT TO WS-CONT-GDV-AFT-TOTAL
170900210928R12702     END-IF.
171000210928
171100210928           REWRITE ACC-CON-INV-REC.
171200210928
171300210928           GO TO RNGV-NEXT.
171400210928
171500210928       RNGV-EXIT.
171600210928           EXIT.
171700210928      /
171800210928       CHECK-GDV-ROUNDING.
171900210928           IF PURCHASE-TRANSACTION
172000210928              GO TO CNGR-EXIT
172100210928           END-IF.
172200210928
172300210928           MOVE "N" TO WS-GDV-DIFF-FLAG
172400210928           MOVE 0   TO WS-GDV-DIFF-AMOUNT
172500210928           MOVE "Y" TO WS-GDV-UPDATE-FLAG
172600210928
172700210928           IF WS-CURR-CONTRACT-GDV-AFT NOT = WS-CONT-GDV-AFT-TOTAL
172800210928              MOVE "Y" TO WS-GDV-DIFF-FLAG
172900210928              SUBTRACT WS-CONT-GDV-AFT-TOTAL
173000210928                  FROM WS-CURR-CONTRACT-GDV-AFT
173100210928                GIVING WS-GDV-DIFF-AMOUNT
173200210928           END-IF.
173300210928
173400210928           IF GDV-DIFFERENCE-FOUND
173500210928              GO TO CNGR-0010
173600210928           END-IF.
173700210928
173800210928           GO TO CNGR-EXIT.
173900210928
174000210928       CNGR-0010.
174100210928           INITIALIZE MFAACCCIP OF ACCOUNT-CONTRACT-INVEST.
174200210928           MOVE CURR-ACCOUNT-NO
174300210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST.
174400210928           MOVE CURR-CONTRACT-NO
174500210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST.
174600210928           MOVE SPACES TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST.
174700210928
174800210928           START ACCOUNT-CONTRACT-INVEST WITH NO LOCK
174900210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
175000210928                 INVALID KEY
175100210928                 GO TO CNGR-EXIT.
175200210928
175300210928       CNGR-0020.
175400210928           READ ACCOUNT-CONTRACT-INVEST NEXT RECORD WITH NO LOCK
175500210928                AT END
175600210928                GO TO CNGR-EXIT.
175700210928
175800210928           IF CURR-ACCOUNT-NO NOT =
175900210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST OR
176000210928              CURR-CONTRACT-NO NOT =
176100210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST
176200210928              GO TO CNGR-EXIT
176300210928           END-IF.
176400210928
176500210928           IF OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST = 0 OR
176600210928              CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST = 0
176700210928              GO TO CNGR-0020
176800210928           END-IF.
176900210928
177000210928           IF GDV-DIFFERENCE-FOUND AND
177100210928              GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST = 0
177200210928              GO TO CNGR-0020
177300210928           END-IF.
177400210928
177500210928           IF GDV-DIFFERENCE-FOUND AND GDV-NOT-UPDATED
177600210928              ADD WS-GDV-DIFF-AMOUNT
177700210928                  TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST
177800210928                     GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST
177900210928              MOVE "N" TO WS-GDV-UPDATE-FLAG
178000210928              REWRITE ACCT-CONT-INVEST-REC
178100210928                      INVALID KEY
178200210928                      MOVE "Y" TO WS-GDV-UPDATE-FLAG
178300210928              END-REWRITE
178400210928           END-IF.
178500210928
178600210928           IF (GDV-DIFFERENCE-FOUND AND GDV-NOT-UPDATED)
178700210928               GO TO CNGR-0020
178800210928           END-IF.
178900210928
179000210928       CNGR-EXIT.
179100210928           EXIT.
179200210928      /
179300210928       GET-INVESTMENT-MARKET-VALUE.
179400210928           MOVE "OPEN INVPRC" TO WS-SQLERR-STATEMENT.
179500210928           EXEC SQL
179600210928             OPEN INVPRC
179700210928           END-EXEC.
179800210928
179900210928           IF SQLCODE = 0
180000210928              MOVE "Y" TO WS-PRICE-FOUND
180100210928              CONTINUE
180200210928           ELSE
180300210928              MOVE "N" TO WS-PRICE-FOUND
180400210928              MOVE 0 TO WS-INV-UNIT-PRICE
180500210928              GO TO GIMV-EXIT
180600210928           END-IF.
180700210928
180800210928           MOVE "FETCH INVPRC" TO WS-SQLERR-STATEMENT.
180900210928           EXEC SQL
181000210928             FETCH NEXT FROM INVPRC
181100210928              INTO :WS-INV-TRADE-DATE,
181200210928                   :WS-INV-UNIT-PRICE,
181300210928                   :WS-INV-DST-FLAG
181400210928           END-EXEC.
181500210928
181600210928           IF SQLCODE = 0
181700210928              MOVE "Y" TO WS-PRICE-FOUND
181800210928              CONTINUE
181900210928           ELSE
182000210928              MOVE "N" TO WS-PRICE-FOUND
182100210928              MOVE 0 TO WS-INV-UNIT-PRICE
182200210928           END-IF.
182300210928
182400210928           MOVE "CLOSE INVPRC" TO WS-SQLERR-STATEMENT.
182500210928           EXEC SQL
182600210928             CLOSE INVPRC
182700210928           END-EXEC.
182800210928
182900210928       GIMV-EXIT.
183000210928           EXIT.
183100210928      /
183200210928       GET-INVESTMENT-CURRENCY.
183300210928           EXEC SQL
183400210928             SELECT COALESCE(LOAD_STRUCTURE, " "),
183500210928                    COALESCE(CURRENCY, " ")
183600210928               INTO :WS-LOAD-STRUCTURE,
183700210928                    :WS-CURRENCY
183800210928               FROM MFAINVP
183900210928              WHERE INVESTMENT_CODE = :CURR-INVESTMENT-CODE
184000210928           END-EXEC.
184100210928
184200210928           IF SQLCODE = 100
184300210928              MOVE " "  TO WS-LOAD-STRUCTURE
184400210928              MOVE " "  TO WS-CURRENCY
184500210928           END-IF.
184600210928
184700210928       GIC-EXIT.
184800210928           EXIT.
184900210928      /
185000210928       GET-EXCHANGE-RATE-2.
185100210928
185200210928           IF WS-DIFF-INVESTMENT-FLAG = "Y"
185300210928              GO TO GER2-0010.
185400210928
185500210928           EXEC SQL
185600210928             SELECT COALESCE(EXCHANGE_RATE, 0),
185700210928                    COALESCE(CURRENCY, " ")
185800210928               INTO :WS-EXCH-RATE-VALUE,
185900210928                    :WS-EX-CURRENCY
186000210928               FROM MFATREXRP
186100210928              WHERE PLACEMENT_DATE  = :WS-EXCH-PLACEMENT-DATE AND
186200210928                    TRANS_NO = :WS-EXCH-TRANS-NO
186300210928           END-EXEC.
186400210928
186500210928           IF SQLCODE = 100
186600210928              GO TO GER2-0010
186700210928           END-IF.
186800210928
186900210928           IF WS-EX-CURRENCY NOT = WS-EXCH-CURRENCY OR
187000210928              WS-EXCH-RATE-VALUE = 0
187100210928                GO TO GER2-0010
187200210928           END-IF.
187300210928
187400210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
187500210928           GO TO GER2-EXIT.
187600210928
187700210928       GER2-0010.
187800210928
187900210928           EXEC SQL
188000210928             SELECT COALESCE(EXCHANGE_RATE, 0)
188100210928               INTO :WS-EXCH-RATE-VALUE
188200210928               FROM MFAEXRHMP
188300210928              WHERE TRADE_DATE  = :WS-EXCH-TRADE-DATE AND
188400210928                    CURRENCY = :WS-EXCH-CURRENCY AND
188500210928                  EXCHANGE_RATE_TYPE = :PROG-EXCHANGE-RATE-TYPE
188600210928           END-EXEC.
188700210928
188800210928           IF SQLCODE = 100
188900210928              GO TO GER2-EXIT
189000210928           END-IF.
189100210928
189200210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
189300210928
189400210928       GER2-EXIT.
189500210928           EXIT.
189600210928
189700210928      /
189800210928       LOG-ERROR.
189900210928           INITIALIZE MFACTERRP OF CONTRACT-ERROR-LOG.
190000210928
190100210928           IF COMM-REJECTION-CODE = SPACES OR "00"
190200210928             MOVE WS-REJECTION-CODE TO COMM-REJECTION-CODE
190300210928           END-IF.
190400210928
190500210928           ACCEPT WS-SYSTIME-LONG FROM TIME.
190600210928           CALL "GETDAT" USING WS-SYSDATE-N.
190700210928
190800210928           INITIALIZE MFAACCNTP OF ACCOUNT-REC.
190900210928           MOVE COMM-ACCOUNT-NO TO ACCOUNT-NO OF ACCOUNT.
191000210928           READ ACCOUNT
191100210928                INVALID KEY
191200210928                MOVE 0 TO INVESTOR-NO OF ACCOUNT
191300210928           END-READ.
191400210928
191500210928           MOVE WS-REJECTION-CODE
191600210928                             TO REJECTION-CODE OF CONTRACT-ERROR-LOG.
191700210928           MOVE INVESTOR-NO  OF ACCOUNT
191800210928                             TO INVESTOR-NO OF CONTRACT-ERROR-LOG.
191900210928           MOVE ACCOUNT-NO   OF ACCOUNT-CONTRACT-INV-RESET
192000210928                             TO ACCOUNT-NO OF CONTRACT-ERROR-LOG.
192100210928
192200210928           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-INV-RESET
192300210928                             TO CONTRACT-NO OF CONTRACT-ERROR-LOG.
192400210928           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
192500210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG.
192600210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
192700210928                             TO INVESTMENT-CODE
192800210928                             OF CONTRACT-ERROR-LOG.
192900210928
193000210928           MOVE COMM-CALLER-ID-CODE TO CALLER-ID-CODE
193100210928                             OF CONTRACT-ERROR-LOG.
193200210928           MOVE PROG-ID-CODE TO PROGRAM-ID-CODE
193300210928                             OF CONTRACT-ERROR-LOG.
193400210928           MOVE COMM-USER    TO AUDIT-USER OF CONTRACT-ERROR-LOG.
193500210928
193600210928           MOVE WS-MISC-INFO-AREA
193700210928                             TO MISC-INFO OF CONTRACT-ERROR-LOG.
193800210928           MOVE WS-SYSDATE-N TO AUDIT-DATE OF CONTRACT-ERROR-LOG.
193900210928           MOVE WS-SYSTIME-LONG-N
194000210928                             TO LOG-TIME OF CONTRACT-ERROR-LOG.
194100210928
194200210928           WRITE CONT-ERR-LOG-REC.
194300210928
194400210928           MOVE SPACES         TO WS-MISC-INFO-AREA.
194500210928
194600210928       LER-EXIT.
194700210928           EXIT.
194800210928
194900210928       COPY CPYSEGRTNC.
195000210928       COPY CPYEXCLTRN.
195100210928       COPY CPYTRNDAMT.
195200210928      /
195300210928       INITIAL-LOGIC.
195400210928
195500210928           MOVE SPACES       TO COMM-REJECTION-CODE.
195600210928           MOVE LOW-VALUES   TO CURR-CONTROLS.
195700210928
195800210928           IF COMM-OPEN-FILES NOT = "Y" AND
195900210928              OPEN-FILES-ONCE NOT = "Y"
196000210928             GO TO INL-0010
196100210928           END-IF.
196200210928
196300210928           OPEN INPUT  BUSINESS-DAYS
196400210928                       ACCOUNT
196500210928                       INVESTMENT
196600210928                       ACCOUNT-CONTRACT-INVEST-SWI
196700210928                       ACCOUNT-CONTRACT-INVEST-R
196800210928                       ACCOUNT-CONTRACT
196900210928                       ACCOUNT-CONTRACT-RESET
197000210928                       ACCOUNT-CONTRACT-INV-RESET
197100210928                       TRANS-R
197200210928                       TRANS
197300210928                       TRANS-GBV
197400210928                       TRANS-CONTRACT-DTL-R
197500210928                       ACCOUNT-NOMINEE
197600210928                       ACCOUNT-ATTRIBUTES
197700210928                       EXCLUDE-TRANS
197800210928                       TRANS-TARGET
197900210928                       TRANS-OFFSET
198000210928                       TRANS-CONTRACT-DETAILS
198100210928                       TRANS-GBV-TRANSFER
198200210928                       SEG-SWITCH-TRF-OPT
198300210928                       TRANS-CONTRACT-TARGET2
198400210928                       TRANS-CHARGES
198500210928                       TRANS-SEG-DEDUCTION-CODES
198600210928127401                 INVESTMENT-STRUCTURE-XREF
198700210928180708                 TRANS-MISC-DETAILS
198800210928180708                 TRANS-REDEM-DETAILS
198900210928                 I-O   ACCOUNT-CONTRACT-INVESTMENT
199000210928                       TRANS-CONTRACT-DTL-R2
199100210928                       ACCOUNT-CONTRACT-INVEST
199200210928                       CONTRACT-ERROR-LOG.
199300210928
199400210928           MOVE "N"          TO OPEN-FILES-ONCE.
199500210928
199600210928       INL-0010.
199700210928           EXEC SQL
199800210928              WHENEVER SQLERROR CONTINUE
199900210928           END-EXEC.
200000210928
200100210928           EXEC SQL
200200210928              WHENEVER NOT FOUND CONTINUE
200300210928           END-EXEC.
200400210928
200500210928           IF UNITRAX-BASE-CURRENCY   NOT = SPACES AND
200600210928              PROG-EXCHANGE-RATE-TYPE NOT = SPACES
200700210928             GO TO INL-EXIT
200800210928           END-IF.
200900210928
201000210928           EXEC SQL
201100210928             SELECT COALESCE(CURRENCY, "CAD")
201200210928               INTO :UNITRAX-BASE-CURRENCY
201300210928               FROM MFACURP
201400210928              WHERE BASE_CURRENCY = "Y"
201500210928           END-EXEC.
201600210928
201700210928           IF SQLCODE = 100
201800210928              MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
201900210928           END-IF.
202000210928
202100210928           EXEC SQL
202200210928             SELECT COALESCE(EXCHANGE_RATE_TYPE, " ")
202300210928               INTO :PROG-EXCHANGE-RATE-TYPE
202400210928               FROM MFAPRGERP
202500210928              WHERE PROGRAM_CODE = "SEGCALCV"
202600210928                AND PROGRAM_ACTION = "DEFAULT"
202700210928           END-EXEC.
202800210928
202900210928           IF SQLCODE = 100 OR PROG-EXCHANGE-RATE-TYPE = " "
203000210928              MOVE "06"       TO COMM-REJECTION-CODE
203100210928              MOVE HIGH-VALUES TO CURR-CONTROLS
203200210928           END-IF.
203300210928
203400210928
203500210928       INL-EXIT.
203600210928           EXIT.
203700210928      /
203800210928       END-JOB.
203900210928
204000210928      * RFS49699 - Begin
204100210928
204200210928           MOVE "LOGARR"               to Pass-Screen-Code.
204300210928           MOVE "LOGARR"               to Pass-Edit-Code.
204400210928           MOVE "N"                    to Pass-Level-Code.
204500210928
204600210928           call "FXSCEDTAL1" using Pass-Screen-Code
204700210928                                   Pass-Edit-Code
204800210928                                   Pass-Level-Code
204900210928                                   Retn-Edit-Allowed-Flag.
205000210928
205100210928165027*    cancel "FXSCEDTAL1".
205200210928
205300210928           IF Retn-Edit-Allowed
205400210928               PERFORM ARRAY-LOGGING     THRU ARL-EXIT
205500210928           END-IF.
205600210928
205700210928      * RFS49699 - End
205800210928
205900210928           IF SQL-FILE-NOT-OPEN
206000210928              GO TO EOJ-EXIT
206100210928           END-IF.
206200210928
206300210928           EXEC SQL
206400210928                CLOSE SEGEXTSQ
206500210928           END-EXEC.
206600210928
206700210928       EOJ-EXIT.
206800210928           EXIT.
206900210928
207000210928      * RFS49699 - Begin call array logging if on!
207100210928
207200210928       ARRAY-LOGGING.
207300210928
207400210928           MOVE "SEGRVSCLGD"           TO  pp-Program-Name.
207500210928
207600210928           MOVE WS-ARRAY1-NAME         TO  pp-Array-Name.
207700210928           SET  WS-ARR-ACCCRP          TO  TRUE.
207800210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
207900210928           MOVE WS-ARRAY1-MAX          TO  pp-Max-Size.
208000210928           MOVE WS-ARRAY1-MAX-USED     TO  pp-Max-Size-Used.
208100210928           MOVE SPACES                 TO  rp-Err-Flag.
208200210928
208300210928           CALL "FXLOGAU"      using PR-FXLOGAU.
208400210928
208500210928           MOVE WS-ARRAY2-NAME         TO  pp-Array-Name.
208600210928           SET  WS-ARR-ACCCIP          TO  TRUE.
208700210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
208800210928           MOVE WS-ARRAY2-MAX          TO  pp-Max-Size.
208900210928           MOVE WS-ARRAY2-MAX-USED     TO  pp-Max-Size-Used.
209000210928           MOVE SPACES                 TO  rp-Err-Flag.
209100210928
209200210928           CALL "FXLOGAU"      using PR-FXLOGAU.
209300210928
209400210928165027*    CANCEL  "FXLOGAU".
209500210928
209600210928       ARL-EXIT.
209700210928           EXIT.
209800210928
209900210928      * RFS49699 - End
210000210928
