000100210928       IDENTIFICATION DIVISION.
000200210928       PROGRAM-ID.    SEGRVSCLCP.
000300210928       AUTHOR.        RICHARD SALIRE.
000400210928       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000500210928       DATE-WRITTEN.  MAY 2001.
000600210928       DATE-COMPILED.
000700210928      *******************************************************************
000800210928      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
000900210928      *******************************************************************
001000210928      *            * yyyy/mm/dd   *
001100210928      * R SALIRE   * 2001/09/04   * RFS 11255 - Exclude selected txns
001200210928      * R SALIRE   * 2001/09/25   * RFS 11593 - Fix for full and partial
001300210928      *            *              * depletion of contracts.  Gross-Amt
001400210928      *            *              * of the trade should be the Orig-Unit-Bal
001500210928      *            *              * of Trans-Contract-Details times the
001600210928      *            *              * Unit-Price of the trade.
001700210928      * R SALIRE   * 2001/10/11   * RFS 11622 - Use the unit-price prior
001800210928      *            *              * to trade-date of transaction if the
001900210928      *            *              * price on the trade-date doesn't exists.
002000210928      * R SALIRE   * 2001/10/18   * RFS 11698 - Use copybook CPYSEGRTNE.
002100210928      *            *              * Changes made to copybook CPYSEGRTNE.
002200210928      *            *              * This will handle switches or transfers
002300210928      *            *              * from Non-Seg to Seg or vice-versa.
002400210928      * R SALIRE   * 2001/11/14   * RFS 12089 - Partial and full switch
002500210928      *            *              * for one fund on the same day resulting
002600210928      *            *              * incorrect GBV.
002700210928      *            *              * RFS 12145 - Recompile.
002800210928      *            *              * Changes made to copybook CPYSEGRTNE.
002900210928      * R SALIRE   * 2001/12/12   * RFS 12387 - Fix division by zero when
003000210928      *            *              * when calculating the percentage.
003100210928      * R SALIRE   * 2001/12/27   * RFS 12454 - Switches within the same
003200210928      *            *              * contract make GBV change.
003300210928      *            *              * Have to ensure that the percentage
003400210928      *            *              * total would equal to 100 percent.
003500210928      * R SALIRE   * 2002/01/31   * RFS 12702 - GBV is rounding incorrectly
003600210928      *            *              * with switch transactions.
003700210928      * Daisy Ly   *  2002/03/20  *  RFS 13185 - recompile
003800210928      * Fatema Haji*  2002/03/21  *  RFS 13331 - recompile
003900210928      * R SALIRE   * 2002/05/13   * RFS 13394 - New functionality to carry
004000210928      *            *              * over contract NDV/GBV onto Unitrax.
004100210928      * R Salire   * 2002/08/07   * RFS 14600 - Recompile
004200210928      * R SALIRE   * 2002/08/23   * RFS 13306 - Transfer in kind func
004300210928      * C. Carino  * 2002/10/03   * RFS 14407 - recompile for
004400210928      *                           *  ACCOUNT-ATTRIBUTE (MFAACCATP)
004500210928      * Daisy Ly   * 2003/07/11   * RFS 16512 - apply out/in trade
004600210928      *            *              * deduction to the GBV-CHANGES and
004700210928      *            *              * NBV-CHANGE for transfer/switches in
004800210928      * Fatema Haji*  2004/01/07  * RFS 19318 - recompile
004900210928      * E. Salvador*  2004/05/07  * RFS 20516 - Modify the routine
005000210928      *            *              * "CHECK-IF-EXCLUDE-TRANSACTION" so
005100210928      *            *              * that if a match is found in the
005200210928      *            *              * "EXCLUDE-TRANS" file, exclude that
005300210928      *            *              * transaction from the GBV/NDV calcu-
005400210928      *            *              * lation, else, include if not found.
005500210928      * Fatema Haji* 2004/09/09   * RFS 23824 - Recompile only
005600210928      * Frank Hong * 2005/06/16   * RFS 26151.
005700210928      *            *              * Modify the program to take into
005800210928      *            *              * account the number of units of transactions
005900210928      *            *              * that are in Exclude Transactions table
006000210928      *            *              * (RFEXCTRN) without affecting the Guaranteed
006100210928      *            *              * Base Value (GBV), Net Deposit Value (NDV),
006200210928      *            *              * Guaranteed Death Value (GDV) of the contract
006300210928      * Esin A.    * 2006/02/23   * RFS 31514 - Recompile only
006400210928      * Esin A.    * 2007/03/09   * RFS 40576 - Recompile only.
006500210928      * Esin A.    * 2007/03/09   * RFS 40576 - Recompile only.
006600210928      * Raymond Mui* 2007/11/23   * RFS 45845 - Recompile only.
006700210928      * Emman. Yala* 2008/01/10   * RFS47227 - Recompile.
006800210928      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
006900210928      * Bojana J.  * 2008/05/06   * RFS 51776 - recompile.
007000210928      * Sanjeev P. * 2008/06/17   * RFS 48640 - recompile.
007100210928      * Fatema Haji* 2008/08/18   * RFS 55960 - recompile.
007200210928      * Sanjeev P  *  2008/12/11  * RFS49898 - New DMD Maturity Option.
007300210928      * Bojana J.  *  2009/05/27  * RFS 57388 - Recompile (MFAACCCRP).
007400210928      * Emman. Yala*  2011/02/23  * RFS91599 - Recompile (MFAACCCRP)80605
007500210928      *            *              * Replaced Implicit Join by Inner Join
007600210928      * Nasra F.   *  2011/08/05  * RFS98889 - Add trade date criteria
007700210928      *            *              * when reversing.
007800210928      * Thilaga K  * 2012/08/13   * RFS107585- Recompile for MFASGSTOP
007900210928      * Venkatesh C* 2012/10/19   * RFS117298 - Recompile for MFAACCONP
008000210928      * Ambikapathy* 2012/12/14   * RFS112135 - Recompile for MFASGSTOP
008100210928      * Abhisek M  * 2013/04/01   * RFS120002 - Recompile for MFATRACXP
008200210928      * Premil K   * 2013/07/12   * RFS110904 - Preform GDV reset and
008300210928      *                           * Reverse reset.
008400210928      * Andy Chan  * 2013/08/29   * RFS127401 - Get SETPOL Inv Structure
008500210928      * Thilaga    * 2014/05/15   * RFS133150 - Recompile
008600210928      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
008700210928      * CHAYA SP   * 2020/06/30   * RFS185172 - Recompile for MFAACCONP
008800210928      * Vignesh    *  2020/06/25  * RFS183812 - Recompile for MFASGSTOP
008900210928      * VIGNESH    * 2020/07/15   * RFS185171 -Recompile for MFAEXTRNP
009000210928      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
009100210928      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
009200210928      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
009300210928      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
009400210928      * Kavin      * 2021/01/05   * RFS180708 - passing Trans sub type
009500210928      *                           * key value to MFATRNMSCP file
009600210928      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
009601211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
009602211007      *            *              * Array from 100 to 1000
009603211007      *            *              * Tagged as 111744
009700210928      * -------------------------------------------------------------
009800210928      *******************************************************************
009900210928      *===============================================================*
010000210928      * Important: IMPORTANT TO ALL PROGRAMMERS
010100210928      *
010200210928      * If any programmer creates, changes or deletes an array in this
010300210928      * programs please add the logic to support the array logging process!
010400210928      *
010500210928      * View the WS-ARRAY-LOG-MISC variables and the code associated with
010600210928      * RFS49699.
010700210928      *
010800210928      * This change is for audit purposes, it logs the
010900210928      * name of the array, max size, size used. At the end of
011000210928      * this program the array information is passed to FXLOGUA pgm,
011100210928      * which write this information to the MFALOGAUP array audit file!
011200210928      *
011300210928      *===============================================================*
011400210928       ENVIRONMENT DIVISION.
011500210928       CONFIGURATION SECTION.
011600210928       SOURCE-COMPUTER. IBM-AS400.
011700210928       OBJECT-COMPUTER. IBM-AS400.
011800210928       SPECIAL-NAMES.
011900210928           LOCAL-DATA IS WS-LOCAL.
012000210928      /
012100210928       INPUT-OUTPUT SECTION.
012200210928       FILE-CONTROL.
012300210928
012400210928           SELECT  ACCOUNT-CONTRACT
012500210928                   ASSIGN TO DATABASE-MFAACCONP
012600210928                   ORGANIZATION IS INDEXED
012700210928                   ACCESS IS DYNAMIC
012800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012900210928      /
013000210928           SELECT  ACCOUNT-CONTRACT-INVESTMENT
013100210928                   ASSIGN TO DATABASE-MFAACCCIP
013200210928                   ORGANIZATION IS INDEXED
013300210928                   ACCESS IS DYNAMIC
013400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013500210928      /
013600210928           SELECT  ACCOUNT-CONTRACT-INVEST-SWI
013700210928                   ASSIGN TO DATABASE-MFAACCCIP
013800210928                   ORGANIZATION IS INDEXED
013900210928                   ACCESS IS DYNAMIC
014000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
014100210928      /
014200210928           SELECT  ACCOUNT-CONTRACT-INVEST-R
014300210928                   ASSIGN TO DATABASE-MFAACCCIP
014400210928                   ORGANIZATION IS INDEXED
014500210928                   ACCESS IS DYNAMIC
014600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
014700210928      /
014800210928           SELECT  ACCOUNT-CONTRACT-RESET
014900210928                   ASSIGN TO DATABASE-MFAACCCRP
015000210928                   ORGANIZATION IS INDEXED
015100210928                   ACCESS IS DYNAMIC
015200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015300210928      /
015400210928           SELECT  ACCOUNT-CONTRACT-INV-RESET
015500210928                   ASSIGN TO DATABASE-MFAACCCIRP
015600210928                   ORGANIZATION IS INDEXED
015700210928                   ACCESS IS DYNAMIC
015800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015900210928      /
016000210928           SELECT  ACCOUNT
016100210928                   ASSIGN TO DATABASE-MFAACCNTP
016200210928                   ORGANIZATION IS INDEXED
016300210928                   ACCESS IS DYNAMIC
016400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016500210928      /
016600210928           SELECT  INVESTMENT
016700210928                   ASSIGN TO DATABASE-MFAINVP
016800210928                   ORGANIZATION IS INDEXED
016900210928                   ACCESS IS DYNAMIC
017000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017100210928      /
017200210928           SELECT  INVESTMENT-UNIT-PRICE
017300210928                   ASSIGN TO DATABASE-MFAINVUPLB
017400210928                   ORGANIZATION IS INDEXED
017500210928                   ACCESS IS DYNAMIC
017600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
017700210928                   WITH DUPLICATES.
017800210928      /
017900210928           SELECT  PROGRAM-EXCHANGE-RATE
018000210928                   ASSIGN TO DATABASE-MFAPRGERP
018100210928                   ORGANIZATION IS INDEXED
018200210928                   ACCESS IS DYNAMIC
018300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018400210928      /
018500210928           SELECT  EXCHANGE-RATE-M-2
018600210928                   ASSIGN TO DATABASE-MFAEXRHMP
018700210928                   ORGANIZATION IS INDEXED
018800210928                   ACCESS IS DYNAMIC
018900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019000210928      /
019100210928           SELECT  CURRENCY-CODE
019200210928                   ASSIGN TO DATABASE-MFACURP
019300210928                   ORGANIZATION IS INDEXED
019400210928                   ACCESS IS DYNAMIC
019500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019600210928      /
019700210928           SELECT  CONTRACT-ERROR-LOG
019800210928                   ASSIGN TO DATABASE-MFACTERRP
019900210928                   ORGANIZATION IS INDEXED
020000210928                   ACCESS IS DYNAMIC
020100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
020200210928                   WITH DUPLICATES.
020300210928      /
020400210928           SELECT  TRANS-R
020500210928                   ASSIGN TO DATABASE-MFATRNLN
020600210928                   ORGANIZATION IS INDEXED
020700210928                   ACCESS IS DYNAMIC
020800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
020900210928                   WITH DUPLICATES.
021000210928      /
021100210928           SELECT  TRANS-GBV
021200210928                   ASSIGN TO DATABASE-MFATRNLN
021300210928                   ORGANIZATION IS INDEXED
021400210928                   ACCESS IS DYNAMIC
021500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
021600210928                   WITH DUPLICATES.
021700210928      /
021800210928           SELECT  TRANS
021900210928                   ASSIGN TO DATABASE-MFATRNP
022000210928                   ORGANIZATION IS INDEXED
022100210928                   ACCESS IS DYNAMIC
022200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022300210928      /
022400210928           SELECT  TRANS-EXCHANGE-RATE-2
022500210928                   ASSIGN TO DATABASE-MFATREXRP
022600210928                   ORGANIZATION IS INDEXED
022700210928                   ACCESS IS DYNAMIC
022800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022900210928      /
023000210928           SELECT  TRANS-CONTRACT-DTL-R
023100210928                   ASSIGN TO DATABASE-MFATRCODP
023200210928                   ORGANIZATION IS INDEXED
023300210928                   ACCESS IS DYNAMIC
023400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023500210928      /
023600210928           SELECT  TRANS-CONTRACT-DTL-R2
023700210928                   ASSIGN TO DATABASE-MFATRCODP
023800210928                   ORGANIZATION IS INDEXED
023900210928                   ACCESS IS DYNAMIC
024000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024100210928      /
024200210928           SELECT  BUSINESS-DAYS
024300210928                   ASSIGN TO DATABASE-MFABUSDAP
024400210928                   ORGANIZATION IS INDEXED
024500210928                   ACCESS IS DYNAMIC
024600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024700210928      /
024800210928           SELECT  ACCOUNT-NOMINEE
024900210928                   ASSIGN TO DATABASE-MFAACCNMP
025000210928                   ORGANIZATION IS INDEXED
025100210928                   ACCESS IS DYNAMIC
025200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025300210928      /
025400210928           SELECT  EXCLUDE-TRANS
025500210928                   ASSIGN TO DATABASE-MFAEXTRNP
025600210928                   ORGANIZATION IS INDEXED
025700210928                   ACCESS IS DYNAMIC
025800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025900210928      /
026000210928      * RFS 20516 - Start
026100210928      **   SELECT  ACCOUNT-ATTRIBUTES
026200210928      **           ASSIGN TO DATABASE-MFAACCATP
026300210928      **           ORGANIZATION IS INDEXED
026400210928      **           ACCESS IS DYNAMIC
026500210928      **           RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
026600210928      */
026700210928      * RFS 20516 - End
026800210928R11622     SELECT  INVESTMENT-UNIT-PRICE-LAST
026900210928R11622             ASSIGN TO DATABASE-MFAINVUPLB
027000210928R11622             ORGANIZATION IS INDEXED
027100210928R11622             ACCESS IS DYNAMIC
027200210928R11622             RECORD IS EXTERNALLY-DESCRIBED-KEY
027300210928R11622               WITH DUPLICATES.
027400210928      /
027500210928R11698     SELECT  TRANS-TARGET
027600210928R11698             ASSIGN TO DATABASE-MFATRNTGP
027700210928R11698             ORGANIZATION IS INDEXED
027800210928R11698             ACCESS IS DYNAMIC
027900210928R11698             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028000210928      /
028100210928R11698*    SELECT  TRANS-TARGET-2
028200210928R11698*            ASSIGN TO DATABASE-MFATRNTGLA
028300210928R11698*            ORGANIZATION IS INDEXED
028400210928R11698*            ACCESS IS DYNAMIC
028500210928R11698*            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028600210928      *
028700210928R11698     SELECT  TRANS-OFFSET
028800210928R11698             ASSIGN TO DATABASE-MFATRNP
028900210928R11698             ORGANIZATION IS INDEXED
029000210928R11698             ACCESS IS DYNAMIC
029100210928R11698             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029200210928
029300210928R11698*    SELECT  SEG-TRANSFER-OPTIONS
029400210928R11698*            ASSIGN TO DATABASE-MFATRFOPP
029500210928R11698*            ORGANIZATION IS INDEXED
029600210928R11698*            ACCESS IS DYNAMIC
029700210928R11698*            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029800210928      *
029900210928R11698     SELECT  TRANS-CONTRACT-DETAILS
030000210928R11698             ASSIGN TO DATABASE-MFATRCODP
030100210928R11698             ORGANIZATION IS INDEXED
030200210928R11698             ACCESS IS DYNAMIC
030300210928R11698             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
030400210928      /
030500210928R12702     SELECT  ACCOUNT-CONTRACT-INVEST
030600210928R12702             ASSIGN TO DATABASE-MFAACCCIP
030700210928R12702             ORGANIZATION IS INDEXED
030800210928R12702             ACCESS IS DYNAMIC
030900210928R12702             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031000210928      /
031100210928R13394     SELECT  TRANS-GBV-TRANSFER
031200210928R13394             ASSIGN TO DATABASE-MFATRACXP
031300210928R13394             ORGANIZATION IS INDEXED
031400210928R13394             ACCESS IS DYNAMIC
031500210928R13394             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031600210928
031700210928R13306     SELECT  SEG-SWITCH-TRF-OPT
031800210928R13306             ASSIGN TO DATABASE-MFASGSTOP
031900210928R13306             ORGANIZATION IS INDEXED
032000210928R13306             ACCESS IS DYNAMIC
032100210928R13306             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
032200210928
032300210928R13306     SELECT  TRANS-CONTRACT-TARGET2
032400210928R13306             ASSIGN TO DATABASE-MFATRCTGLA
032500210928R13306             ORGANIZATION IS INDEXED
032600210928R13306             ACCESS IS DYNAMIC
032700210928R13306             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
032800210928
03290021092816512      SELECT  TRANS-CHARGES
03300021092816512              ASSIGN TO DATABASE-MFATRNCHP
03310021092816512              ORGANIZATION IS INDEXED
03320021092816512              ACCESS IS DYNAMIC
03330021092816512              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
033400210928
03350021092816512      SELECT  TRANS-SEG-DEDUCTION-CODES
03360021092816512              ASSIGN TO DATABASE-MFATRNSDCP
03370021092816512              ORGANIZATION IS INDEXED
03380021092816512              ACCESS IS DYNAMIC
03390021092816512              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
034000210928
034100210928      *RFS110904 - START
034200210928           SELECT  INVESTMENT-STRUCTURE-XREF
034300210928                   ASSIGN TO DATABASE-MFAINVSXP
034400210928                   ORGANIZATION IS INDEXED
034500210928                   ACCESS IS DYNAMIC
034600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
034700210928      *RFS110904 - END
034800210928
034900210928      *RFS180708 - Start
035000210928           SELECT  TRANS-MISC-DETAILS
035100210928                   ASSIGN TO DATABASE-MFATRNMSCP
035200210928                   ORGANIZATION IS INDEXED
035300210928                   ACCESS IS DYNAMIC
035400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
035500210928
035600210928           SELECT  TRANS-REDEM-DETAILS
035700210928                   ASSIGN TO DATABASE-MFATRNREP
035800210928                   ORGANIZATION IS INDEXED
035900210928                   ACCESS IS DYNAMIC
036000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
036100210928      *RFS180708 - End
036200210928
036300210928       DATA DIVISION.
036400210928       FILE SECTION.
036500210928       FD  ACCOUNT-CONTRACT
036600210928           LABEL RECORDS ARE STANDARD.
036700210928       01  ACC-CON-REC.           COPY DD-ALL-FORMATS OF MFAACCONP.
036800210928      /
036900210928       FD  ACCOUNT-CONTRACT-INVESTMENT
037000210928           LABEL RECORDS ARE STANDARD.
037100210928       01  ACC-CON-INV-REC.       COPY DD-ALL-FORMATS OF MFAACCCIP.
037200210928      /
037300210928       FD  ACCOUNT-CONTRACT-INVEST-SWI
037400210928           LABEL RECORDS ARE STANDARD.
037500210928       01  ACC-CON-INV-SWI-REC.   COPY DD-ALL-FORMATS OF MFAACCCIP.
037600210928
037700210928       FD  ACCOUNT-CONTRACT-INVEST-R
037800210928           LABEL RECORDS ARE STANDARD.
037900210928       01  ACC-CON-INV-R-REC.     COPY DD-ALL-FORMATS OF MFAACCCIP.
038000210928      /
038100210928       FD  ACCOUNT-CONTRACT-RESET
038200210928           LABEL RECORDS ARE STANDARD.
038300210928       01  ACC-CON-RESET-REC.     COPY DD-ALL-FORMATS OF MFAACCCRP.
038400210928      /
038500210928       FD  ACCOUNT-CONTRACT-INV-RESET
038600210928           LABEL RECORDS ARE STANDARD.
038700210928       01  ACC-CON-INV-RESET-REC. COPY DD-ALL-FORMATS OF MFAACCCIRP.
038800210928      /
038900210928       FD  ACCOUNT
039000210928           LABEL RECORDS ARE STANDARD.
039100210928       01  ACCOUNT-REC.           COPY DD-ALL-FORMATS OF MFAACCNTP.
039200210928      /
039300210928       FD  INVESTMENT
039400210928           LABEL RECORDS ARE STANDARD.
039500210928       01  INVESTMENT-REC.        COPY DD-ALL-FORMATS OF MFAINVP.
039600210928      /
039700210928       FD  INVESTMENT-UNIT-PRICE
039800210928           LABEL RECORDS ARE STANDARD.
039900210928       01  IUP-REC.               COPY DD-ALL-FORMATS OF MFAINVUPLB.
040000210928      /
040100210928       FD  PROGRAM-EXCHANGE-RATE
040200210928           LABEL RECORDS ARE STANDARD.
040300210928       01  PROG-EXCH-RATE-REC.    COPY DD-ALL-FORMATS OF MFAPRGERP.
040400210928      /
040500210928       FD  EXCHANGE-RATE-M-2
040600210928           LABEL RECORDS ARE STANDARD.
040700210928       01  EXCHANGE-RATE-M-2-REC. COPY DD-ALL-FORMATS OF MFAEXRHMP.
040800210928      /
040900210928       FD  CURRENCY-CODE
041000210928           LABEL RECORDS ARE STANDARD.
041100210928       01  CURRENCY-CODE-REC.     COPY DD-ALL-FORMATS OF MFACURP.
041200210928      /
041300210928       FD  CONTRACT-ERROR-LOG
041400210928           LABEL RECORDS ARE STANDARD.
041500210928       01  CONT-ERR-LOG-REC.      COPY DD-ALL-FORMATS OF MFACTERRP.
041600210928      /
041700210928       FD  TRANS-R
041800210928           LABEL RECORDS ARE STANDARD.
041900210928       01  TRANS-R-REC.           COPY DD-ALL-FORMATS OF MFATRNLN.
042000210928      /
042100210928       FD  TRANS-GBV
042200210928           LABEL RECORDS ARE STANDARD.
042300210928       01  TRANS-GBV-REC.         COPY DD-ALL-FORMATS OF MFATRNLN.
042400210928      /
042500210928       FD  TRANS
042600210928           LABEL RECORDS ARE STANDARD.
042700210928       01  TRANS-REC.          COPY DD-ALL-FORMATS OF MFATRNP.
042800210928      /
042900210928       FD  TRANS-EXCHANGE-RATE-2
043000210928           LABEL RECORDS ARE STANDARD.
043100210928       01  TRANS-EXCHANGE-RATE-2-REC. COPY DD-ALL-FORMATS OF MFATREXRP.
043200210928      /
043300210928       FD  TRANS-CONTRACT-DTL-R
043400210928           LABEL RECORDS ARE STANDARD.
043500210928       01  TRANS-CONT-DTL-R-REC.      COPY DD-ALL-FORMATS OF MFATRCODP.
043600210928      /
043700210928       FD  TRANS-CONTRACT-DTL-R2
043800210928           LABEL RECORDS ARE STANDARD.
043900210928       01  TRANS-CONT-DTL-R2-REC.      COPY DD-ALL-FORMATS OF MFATRCODP.
044000210928      /
044100210928       FD  BUSINESS-DAYS
044200210928           LABEL RECORDS ARE STANDARD.
044300210928       01  BUSINESS-DAYS-REC.         COPY DD-ALL-FORMATS OF MFABUSDAP.
044400210928      /
044500210928RF8092 FD  ACCOUNT-NOMINEE
044600210928RF8092     LABEL RECORDS ARE STANDARD.
044700210928RF8092 01  ACCOUNT-NOMINEE-REC.       COPY DD-ALL-FORMATS OF MFAACCNMP.
044800210928      /
044900210928R11255 FD  EXCLUDE-TRANS
045000210928R11255     LABEL RECORDS ARE STANDARD.
045100210928R11255 01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
045200210928      /
045300210928      * RFS 20516 - Start
045400210928R11255*FD  ACCOUNT-ATTRIBUTES
045500210928R11255**   LABEL RECORDS ARE STANDARD.
045600210928R11255*01  ACCOUNT-ATTRIBUTES-REC.    COPY DD-ALL-FORMATS OF MFAACCATP.
045700210928      * RFS 20516 - End
045800210928      /
045900210928R11622 FD  INVESTMENT-UNIT-PRICE-LAST
046000210928R11622     LABEL RECORDS ARE STANDARD.
046100210928R11622 01  INVESTMENT-LAST-PRICE-REC. COPY DD-ALL-FORMATS OF MFAINVUPLB.
046200210928      /
046300210928R11698 FD  TRANS-TARGET
046400210928R11698     LABEL RECORDS ARE STANDARD.
046500210928R11698 01  TRANS-TARGET-REC.
046600210928R11698                            COPY DD-ALL-FORMATS OF MFATRNTGP.
046700210928      /
046800210928R11698*FD  TRANS-TARGET-2
046900210928R11698*    LABEL RECORDS ARE STANDARD.
047000210928R11698*01  TRANS-TARGET-2-REC.
047100210928R11698*                           COPY DD-ALL-FORMATS OF MFATRNTGLA.
047200210928      *
047300210928R11698 FD  TRANS-OFFSET
047400210928R11698     LABEL RECORDS ARE STANDARD.
047500210928R11698 01  TRANS-2-REC.           COPY DD-ALL-FORMATS OF MFATRNP.
047600210928      /
047700210928R11698*FD  SEG-TRANSFER-OPTIONS
047800210928R11698*    LABEL RECORDS ARE STANDARD.
047900210928R11698*01  SEG-TRANSFER-OPTIONS-REC.  COPY DD-ALL-FORMATS OF MFATRFOPP.
048000210928      *
048100210928       FD  TRANS-CONTRACT-DETAILS
048200210928           LABEL RECORDS ARE STANDARD.
048300210928       01  TRANS-CON-DTL-REC.       COPY DD-ALL-FORMATS OF MFATRCODP.
048400210928      /
048500210928R12702 FD  ACCOUNT-CONTRACT-INVEST
048600210928R12702     LABEL RECORDS ARE STANDARD.
048700210928R12702 01  ACCT-CONT-INVEST-REC.  COPY DD-ALL-FORMATS OF MFAACCCIP.
048800210928      /
048900210928R13394 FD  TRANS-GBV-TRANSFER
049000210928R13394     LABEL RECORDS ARE STANDARD.
049100210928R13394 01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
049200210928
049300210928R13306 FD  SEG-SWITCH-TRF-OPT
049400210928R13306     LABEL RECORDS ARE STANDARD.
049500210928R13306 01  SEG-SWITCH-TRF-OPT-REC.    COPY DD-ALL-FORMATS OF MFASGSTOP.
049600210928
049700210928R13306 FD  TRANS-CONTRACT-TARGET2
049800210928R13306     LABEL RECORDS ARE STANDARD.
049900210928R13306 01  TRANS-CONTRACT-TGT-REC.   COPY DD-ALL-FORMATS OF MFATRCTGLA.
050000210928
05010021092816512  FD  TRANS-CHARGES
05020021092816512      LABEL RECORDS ARE STANDARD.
05030021092816512  01  TRANS-CHARGES-REC.        COPY DD-ALL-FORMATS OF MFATRNCHP.
050400210928
05050021092816512  FD  TRANS-SEG-DEDUCTION-CODES
05060021092816512      LABEL RECORDS ARE STANDARD.
05070021092816512  01  TRANS-SEG-DEDUCTION-CODES-REC.
050800210928                         COPY DD-ALL-FORMATS OF MFATRNSDCP.
050900210928
051000210928      *RFS110904 - START
051100210928       FD  INVESTMENT-STRUCTURE-XREF
051200210928           LABEL RECORDS ARE STANDARD.
051300210928       01  INV-STRU-XREF-REC. COPY DD-ALL-FORMATS OF MFAINVSXP.
051400210928      *RFS110904 - END
051500210928
051600210928      *RFS180708 - Start
051700210928       FD  TRANS-MISC-DETAILS
051800210928           LABEL RECORDS ARE STANDARD.
051900210928       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
052000210928
052100210928       FD  TRANS-REDEM-DETAILS
052200210928           LABEL RECORDS ARE STANDARD.
052300210928       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
052400210928      *RFS180708 - End
052500210928
052600210928       WORKING-STORAGE SECTION.
052700210928
052800210928      * Copybooks
052900210928
053000210928      * RFS49699 - Begin
053100210928
053200210928      *  screen edits allowed
053300210928           copy CPSCEDTAL1.
053400210928
053500210928      *  log array info
053600210928           copy CPFXLOGAU.
053700210928
053800210928      *  log array table name
053900210928           copy CPFXLOGAT.
054000210928
054100210928      * RFS49699 - End
054200210928
054300210928           EXEC SQL
054400210928                INCLUDE SQLCA
054500210928           END-EXEC.
054600210928
054700210928       01  CURR-CONTROLS.
054800210928          03 CURR-LEVEL1             PIC X(1).
054900210928
055000210928       01  PREV-CONTROLS.
055100210928          03 PREV-LEVEL1             PIC X(1).
055200210928
055300210928       01  PROG-ID-CODE              PIC X(10) VALUE "SEGRECALCP".
055400210928
055500210928       01  OPEN-FILES-ONCE           PIC X(1)  VALUE "Y".
055600210928
055700210928       01  UNITRAX-BASE-CURRENCY     PIC X(3)  VALUE " ".
055800210928
055900210928       01  PROG-EXCHANGE-RATE-TYPE   PIC X     VALUE " ".
056000210928
056100210928       01 SW01-SWITCHES.                                                RFS8712
056200210928          05 SW01-STS-FLAG                       PIC X(01).             RFS8712
056300210928             88 SW01-STS-OK                      VALUE " ".             RFS8712
056400210928             88 SW01-STS-OPEN                    VALUE "1".             RFS8712
056500210928             88 SW01-STS-START                   VALUE "2".             RFS8712
056600210928             88 SW01-STS-READ                    VALUE "3".             RFS8712
056700210928             88 SW01-STS-REWRITE                 VALUE "4".             RFS8712
056800210928             88 SW01-STS-WRITE                   VALUE "5".             RFS8712
056900210928             88 SW01-STS-DELETE                  VALUE "6".             RFS8712
057000210928             88 SW01-STS-END                     VALUE "7".             RFS8712
057100210928             88 SW01-STS-CLOSE                   VALUE "8".             RFS8712
057200210928             88 SW01-STS-RANGE                   VALUE "9".             RFS8712
057300210928             88 SW01-STS-FOUND                   VALUE "A".             RFS8712
057400210928             88 SW01-STS-FAIL                    VALUE "*".             RFS8712
057500210928
057600210928       01  WS-MISC-FIELDS.
057700210928           05 WS-NEW-GUAR-BASE-VALUE   PIC S9(11)V99 COMP-3 VALUE 0.
057800210928           05 WS-NEW-GUAR-BASE-VAL-CUR PIC S9(11)V99 COMP-3 VALUE 0.
057900210928           05 WS-CURR-UNIT-BAL         PIC S9(10)V999 COMP-3 VALUE 0.
058000210928           05 WS-REJECTION-CODE        PIC X(3).
058100210928           05 WS-EXCHANGE-FOUND        PIC X(1).
058200210928      * Exchange variables
058300210928           05 WS-EXCH-PLACEMENT-DATE   PIC S9(10)      COMP-3.
058400210928           05 WS-EXCH-TRANS-NO         PIC S9(10)      COMP-3.
058500210928           05 WS-EXCH-CURRENCY         PIC X(3).
058600210928           05 WS-EXCH-TRADE-DATE       PIC 9(8).
058700210928           05 WS-EXCH-RATE             PIC S9(2)V9(7)  COMP-3.
058800210928           05 WS-EXCH-RATE-VALUE       PIC S9(2)V9(7)  COMP-3.
058900210928           05 WS-CURR-TRANS-UNIT-AMT   PIC S9(10)V9(3) COMP-3.
059000210928           05 WS-CURR-TRANS-UNIT-PRICE PIC S9(5)V9(4) COMP-3.
059100210928           05 WS-CURR-TRANS-TRADE-DATE PIC 9(8).
059200210928           05 WS-CURR-TRANS-GROSS-AMT  PIC S9(11)V9(2) COMP-3.
059300210928           05 WS-CURR-TRANS-AMT        PIC S9(11)V9(2) COMP-3.
059400210928           05 WS-CURR-TRANS-AMT-CUR    PIC S9(11)V9(2) COMP-3.
059500210928           05 WS-CURR-TRANS-PLACEMENT-DATE PIC 9(8).
059600210928           05 WS-CURR-TRANS-TRANS-NO   PIC S9(10)      COMP-3.
059700210928           05 WS-CURR-ORIG-UNIT-BAL    PIC S9(10)V9(3) COMP-3.
059800210928 16512     05 WS-BYPASS-DEDUCTION      PIC X.
059900210928 16512     05 WS-CONTRACT-GROSS-AMT    PIC S9(11)V9(2) COMP-3.
060000210928 16512     05 WS-DEDUCTION-AMT         PIC S9(11)V9(2) COMP-3.
060100210928 16512     05 WS-TRN-PLACEMENT-DATE    PIC 9(8).
060200210928 16512     05 WS-TRN-TRANS-NO          PIC S9(10)      COMP-3.
060300210928 16512     05 WS-TRN-PROCESS-DATE      PIC 9(8).
060400210928 16512     05 WS-DEDUCTION-PROP          PIC S9(10)V9(8) COMP-3.
060500210928 16512     05 WS-DEDUCTION-GBV-CHANGE    PIC S9(10)V9(8) COMP-3.
060600210928 16512     05 WS-DEDUCTION-NDV-CHANGE    PIC S9(10)V9(8) COMP-3.
060700210928 16512     05 WS-IN-DEDUCTION-AMT        PIC S9(11)V9(2) COMP-3.
060800210928 16512     05 WS-OUT-TRANS-GROSS         PIC S9(11)V9(2) COMP-3.
060900210928 16512     05 WS-IN-TRANS-GROSS          PIC S9(11)V9(2) COMP-3.
061000210928 16512     05 WS-FROM-GROSS-AMT          PIC S9(11)V9(2) COMP-3.
061100210928
061200210928           05 WS-SYSDATE.
061300210928              10 WS-SYSDATE-CC         PIC 99.
061400210928              10 WS-SYSDATE-YMD.
061500210928                 15 WS-SYSDATE-YY      PIC 99.
061600210928                 15 WS-SYSDATE-MM      PIC 99.
061700210928                 15 WS-SYSDATE-DD      PIC 99.
061800210928           05 WS-SYSDATE-N REDEFINES WS-SYSDATE
061900210928                                       PIC 9(8).
062000210928
062100210928           05 WS-SYSTIME-LONG.
062200210928              10 WS-SYSTIME.
062300210928                 15 WS-SYSTIME-HH      PIC 99.
062400210928                 15 WS-SYSTIME-MI      PIC 99.
062500210928                 15 WS-SYSTIME-SS      PIC 99.
062600210928              10 WS-SYSTIME-N REDEFINES WS-SYSTIME
062700210928                                       PIC 9(6).
062800210928              10 WS-SYSTIME-2 REDEFINES WS-SYSTIME
062900210928                                       PIC 9(4).
063000210928              10 WS-SYSTIME-HS         PIC 99.
063100210928
063200210928            05 WS-SYSTIME-LONG-N REDEFINES WS-SYSTIME-LONG
063300210928                                       PIC 9(8).
063400210928
063500210928            05 WS-MISC-INFO-AREA       PIC X(40).
063600210928
063700210928            05 WS-MISC-INFO-1 REDEFINES WS-MISC-INFO-AREA.
063800210928              10 WS-MISC-INFO-1-NAME   PIC X(20).
063900210928              10 WS-MISC-INFO-1-UNIT   PIC -9(10).9(3).
064000210928
064100210928            05 WS-MISC-INFO-2 REDEFINES WS-MISC-INFO-AREA.
064200210928              10 WS-MISC-INFO-2-NAME   PIC X(11).
064300210928              10 WS-MISC-INFO-2-NKEY-1 PIC X(6).
064400210928              10 WS-MISC-INFO-2-KEY-1  PIC 9(8).
064500210928              10 WS-MISC-INFO-2-NKEY-2 PIC X(6).
064600210928              10 WS-MISC-INFO-2-KEY-2  PIC 9(9).
064700210928      /
064800210928       01 TRANSACTION-CATEGORIES.
064900210928          05 TRANS-CATEGORY              PIC X(3).
065000210928             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI".
065100210928             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
065200210928             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO"
065300210928                                                "TFE" "CQD" "FEE" "SAJ".
065400210928             88 SWITCH-OUT-TRANSACTION   VALUES "SWO" "TRO".
065500210928             88 ADDITION-TRANSACTION     VALUES "BUY" "INC" "CPG"
065600210928                                                "SWI" "TRI" "INT"
065700210928                                                "MFR" "SSD" "SSU" "BAJ"
065800210928                                                "BFW".
065900210928             88 REDUCTION-TRANSACTION    VALUES "SEL" "SWO" "TRO"
066000210928                                                "TFE" "CQD" "FEE" "SAJ".
066100210928             88 VALID-TRANSACTION        VALUES "BUY" "SEL" "SWI"
06620021092826151                                           "MFR"
066300210928                                                "SWO" "TRI" "TRO".
066400210928             88 SWITCH-IN                VALUE "SWI".
066500210928             88 TRANSFER-IN              VALUE "TRI".
066600210928             88 BUY-TRANSACTION          VALUE "BUY".
06670021092826151        88 MAN-FEE-REB-TRANSACTION  VALUE "MFR".
066800210928
066900210928       01 TRANSACTION-STATUS-CATEGORIES.
067000210928          05 TRANS-STATUS-CATEGORY       PIC X(3).
067100210928             88 HISTORY                  VALUES "HST" "HSC".
067200210928             88 HISTORY-CONVERSION       VALUES "HSC".
067300210928             88 PENDING                  VALUES "PND" "VER".
067400210928             88 CONTRACTED               VALUES "CON".
067500210928             88 UNCONFIRMED              VALUES "UNC".
067600210928             88 CANCELLED                VALUES "CAN".
067700210928             88 SETTLED                  VALUES "SET".
067800210928             88 RVSD                     VALUES "RVS".
067900210928
068000210928       01 TRANSACTION-REVERSE-CATEGORIES.
068100210928          05 TRANS-REVERSE-CATEGORY      PIC X(1).
068200210928             88 TRANS-REVERSED           VALUES "Y".
068300210928
068400210928       01 OLD-INVRIDX                    PIC 9(2) VALUE 0.
068500210928
068600210928       01 WS-ACC-CONT-INV-RESET-ARRAYX.
068700210928          05 WS-ACC-CONT-INV-RESET-ARRAY OCCURS 50 TIMES
068800210928                                         INDEXED BY INVRIDX.
068900210928             10 WS-ARRAY-INVR-ACCOUNT-NO   PIC 9(09).
069000210928             10 WS-ARRAY-INVR-CONTRACT-NO  PIC 9(09).
069100210928             10 WS-ARRAY-INVR-INVEST-CODE  PIC X(05).
069200210928             10 WS-ARRAY-INVR-RESET-NO     PIC 9(02).
069300210928             10 WS-ARRAY-INVR-UNIT-BAL     PIC S9(10)V9(3) COMP-3.
069400210928             10 WS-ARRAY-INVR-GBV          PIC S9(11)V9(2) COMP-3.
069500210928             10 WS-ARRAY-INVR-GBV-CUR      PIC S9(11)V9(2) COMP-3.
069600210928
069700210928       01 WS-ACC-CONT-INV-ARRAYX.
069701211007111744*   05 WS-ACC-CONT-INV-ARRAY OCCURS 40 TIMES INDEXED BY CONTIDX.
069702211007111744    05 WS-ACC-CONT-INV-ARRAY OCCURS 1 TO 1000 TIMES DEPENDING ON
069703211007111744                      ln_InvArraySize INDEXED BY CONTIDX.
069900210928             10 WS-ARRAY-ACCOUNT-NO        PIC 9(09).
070000210928             10 WS-ARRAY-CONTRACT-NO       PIC 9(09).
070100210928             10 WS-ARRAY-INVESTMENT-CODE   PIC X(05).
070200210928             10 WS-ARRAY-INV-CURR-CODE     PIC X(03).
070300210928             10 WS-ARRAY-BEFORE-MV         PIC S9(11)V9(2) COMP-3.
070400210928             10 WS-ARRAY-BEFORE-GBV        PIC S9(11)V9(2) COMP-3.
070500210928             10 WS-ARRAY-BEFORE-NDV        PIC S9(11)V9(2) COMP-3.
070600210928             10 WS-ARRAY-AFTER-MV          PIC S9(11)V9(2) COMP-3.
070700210928             10 WS-ARRAY-INV-EXCH-RATE     PIC S9(2)V9(7) COMP-3.
070800210928
070900210928      * RFS49699 - Begin
071000210928
071100210928       01 WS-ARRAY-LOG-MISC.
071200210928           05 WS-ARRAY1-NAME           PIC X(32)
071300210928                               VALUE "WS-ACC-CONT-INV-RESET-ARRAY".
071400210928           05 WS-ARRAY1-MAX            PIC 9(09)
071500210928                               VALUE 50.
071600210928           05 WS-ARRAY1-MAX-USED       PIC 9(09)
071700210928                               VALUE 0.
071800210928           05 WS-ARRAY2-NAME           PIC X(32)
071900210928                               VALUE "WS-ACC-CONT-INV-ARRAY".
072000210928           05 WS-ARRAY2-MAX            PIC 9(09)
072100210928                               VALUE 40.
072200210928           05 WS-ARRAY2-MAX-USED       PIC 9(09)
072300210928                               VALUE 0.
072400210928
072500210928      * RFS49699 - End
072600210928
072700210928      * RFS 110904 - START
072800210928       01 lc_InvStructureCode               PIC X(5).
072900210928110904 01 li_count                  PIC S9(10).
073000210928      * RFS 110904 - END
073100210928
073200210928R12702 01 WS-VARS-4ROUNDING.
073300210928R12702    05 WS-CONT-NDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
073400210928R12702    05 WS-CONT-GBV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
073500210928R12702    05 WS-NDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
073600210928R12702    05 WS-GBV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
073700210928
073800210928       01 WS-LEVEL-88.
073900210928          05 WS-INV-RESET-FLAG             PIC X.
074000210928             88 INV-RESET-FOUND            VALUE "Y".
074100210928          05 WS-NEED-GBV-FLAG              PIC X.
074200210928             88 NEEDS-GBV-AMOUNT           VALUE "Y".
074300210928          05 WS-FIRST-RECALC-PASS          PIC X.
074400210928             88 FIRST-RECALC-PASS          VALUE "Y".
074500210928          05 WS-ARRAY-POINTER              PIC X.
074600210928             88 ARRAY-POINTER-FOUND        VALUE "Y".
074700210928             88 ARRAY-POINTER-NOT-FOUND    VALUE "N".
074800210928          05 WS-SQL-FILE-OPEN              PIC X.
074900210928             88 SQL-FILE-OPEN              VALUE "Y".
075000210928             88 SQL-FILE-NOT-OPEN          VALUE "N".
075100210928XXXXXX    05 WS-LOAD-STRUCTURE             PIC X.
075200210928XXXXXX       88 FRONT-END                  VALUE "F".
075300210928R12702    05 WS-NDV-DIFF-FLAG              PIC X(01).
075400210928R12702       88 NDV-DIFFERENCE-FOUND       VALUE "Y".
075500210928R12702    05 WS-GBV-DIFF-FLAG              PIC X(01).
075600210928R12702       88 GBV-DIFFERENCE-FOUND       VALUE "Y".
075700210928R12702    05 WS-NDV-UPDATE-FLAG            PIC X(01).
075800210928R12702       88 NDV-NOT-UPDATED            VALUE "Y".
075900210928R12702    05 WS-GBV-UPDATE-FLAG            PIC X(01).
076000210928R12702       88 GBV-NOT-UPDATED            VALUE "Y".
076100210928R13394    05 WS-XFER-AMT-EXISTS-FLAG       PIC X(01).
076200210928R13394       88 TRANSFER-AMT-EXISTS        VALUE "Y".
076300210928
076400210928       01 WS-TRANS-COUNT                   PIC 9(3) VALUE 0.
076500210928       01 WS-GUAR-BASE-VALUE-BEF           PIC S9(11)V9(2).
076600210928       01 WS-SWO-GBV-CHANGE                PIC S9(11)V9(2) COMP-3
076700210928                                           VALUE 0.
076800210928       01 WS-SWO-NDV-CHANGE                PIC S9(11)V9(2) COMP-3
076900210928                                           VALUE 0.
077000210928107585 01 lc-TransferGDV                   PIC X(01).
077100210928       01 WS-EXCLUDE-VARIABLES.
077200210928          05 WS-EX-ACCOUNT-NO              PIC 9(9).
077300210928          05 WS-EX-ACCOUNT-TYPE            PIC X(5).
077400210928          05 WS-EX-NOM-ACCOUNT-TYPE        PIC X(5).
077500210928          05 WS-EX-TRANS-TYPE              PIC X(3).
077600210928          05 WS-EX-TRANS-ORIGIN            PIC X(3).
077700210928          05 WS-EX-REVERSAL-CODE           PIC X(4).
077800210928          05 WS-EXCLUDE-TRANS              PIC X(1).
077900210928
078000210928       01 WS-OTHER-VARIABLES.
078100210928          05 WS-DIFF-INVESTMENT-FLAG        PIC X(01).
078200210928          05 WS-OLD-CURR-INVESTMENT-CODE    PIC X(05).
078300210928          05 WS-CONT-INVESTMENT-CODE        PIC X(05).
078400210928          05 WS-PRICE-FOUND                 PIC X(01).
078500210928          05 WS-REQUIRED-UNITSP             PIC S9(10)V9(3) COMP-3.
078600210928      *   05 WS-ORIG-UNIT-BAL               PIC S9(10)V9(3) COMP-3.
078700210928          05 WS-INV-UNIT-PRICE              PIC S9(5)V9(4) COMP-3.
078800210928          05 WS-INV-BEF-MARKET-VALUE        PIC S9(11)V9(4) COMP-3.
078900210928          05 WS-INV-AFT-MARKET-VALUE        PIC S9(11)V9(2) COMP-3.
079000210928          05 WS-CONT-INV-MARKET-VALUE       PIC S9(12)V9(4) COMP-3.
079100210928          05 WS-CURR-CONTRACT-MV-AFT        PIC S9(12)V9(2) COMP-3.
079200210928          05 WS-INV-BEF-GBV                 PIC S9(11)V9(2) COMP-3.
079300210928          05 WS-INV-BEF-NDV                 PIC S9(11)V9(2) COMP-3.
079400210928          05 WS-CURR-CONTRACT-GBV-BEF       PIC S9(12)V9(2) COMP-3.
079500210928          05 WS-CURR-CONTRACT-GBV-AFT       PIC S9(12)V9(2) COMP-3.
079600210928          05 WS-CURR-CONTRACT-NDV-BEF       PIC S9(12)V9(2) COMP-3.
079700210928          05 WS-CURR-CONTRACT-NDV-AFT       PIC S9(12)V9(2) COMP-3.
079800210928          05 WS-GBV-CHANGE                  PIC S9(11)V9(2) COMP-3.
079900210928          05 WS-INV-GBV-PERCENT             PIC S9(2)V9(3) COMP-3.
080000210928          05 WS-INV-GBV-PERCENT-TOTAL       PIC S9(2)V9(3) COMP-3.
080100210928          05 WS-NDV-CHANGE                  PIC S9(11)V9(2) COMP-3.
080200210928          05 WS-INV-NDV-PERCENT             PIC S9(2)V9(3) COMP-3.
080300210928          05 WS-INV-NDV-PERCENT-TOTAL       PIC S9(2)V9(3) COMP-3.
080400210928          05 WS-INV-GBV-AFT                 PIC S9(11)V9(2) COMP-3.
080500210928          05 WS-INV-GBV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
080600210928          05 WS-INV-NDV-AFT                 PIC S9(11)V9(2) COMP-3.
080700210928          05 WS-INV-NDV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
080800210928          05 WS-CONT-INV-ARRAY-COUNT        PIC S9(03) COMP-3.
080900210928          05 WS-CONT-INV-COUNT              PIC S9(03) COMP-3.
081000210928          05 WS-INV-OPENING-UNIT-BAL        PIC S9(10)V9(3) COMP-3.
081100210928          05 WS-NEXT-PROCESS-DATE           PIC 9(8).
081200210928          05 WS-DUMMY-PERCENT               PIC S9(2)V9(3) COMP-3.
081300210928
081400210928R11698 01 WS-OTHER-VARIABLES3.
081500210928R11698    05 WS-FROM-ACCOUNT-TYPE        PIC X(05).
081600210928R11698    05 WS-FROM-NOM-ACCOUNT-TYPE    PIC X(05).
081700210928R11698    05 WS-FROM-TRANS-TYPE-CODE     PIC X(03).
081800210928R11698    05 WS-TO-ACCOUNT-TYPE          PIC X(05).
081900210928R11698    05 WS-TO-NOM-ACCOUNT-TYPE      PIC X(05).
082000210928R11698    05 WS-TO-TRANS-TYPE-CODE       PIC X(03).
082100210928R11698    05 WS-TRANS-ORIGIN-CODE        PIC X(03).
082200210928R11698    05 WS-CONTR-REDEM-CODE         PIC X(06).
082300210928R11698    05 WS-FROM-PLACEMENT-DATE      PIC S9(09) COMP-3.
082400210928R11698    05 WS-FROM-TRANS-NO            PIC S9(09) COMP-3.
082500210928R11698    05 WS-TO-PLACEMENT-DATE        PIC S9(09) COMP-3.
082600210928R11698    05 WS-TO-TRANS-NO              PIC S9(09) COMP-3.
082700210928R11698    05 WS-FROM-ACCOUNT-NO          PIC S9(09) COMP-3.
082800210928R11698    05 WS-TO-ACCOUNT-NO            PIC S9(09) COMP-3.
082900210928R11698    05 WS-FROM-CONTRACT-NO         PIC 9(09).
083000210928R11698    05 WS-TO-CONTRACT-NO           PIC 9(09).
083100210928R11698    05 WS-TRANSFER-GBV             PIC X(01) VALUE "N".
083200210928
083300210928       01 CURRENT-RECORD-VARS.
083400210928          05 CURR-ACCOUNT-NO                PIC S9(9).
083500210928          05 CURR-INVESTMENT-CODE           PIC X(5).
083600210928          05 CURR-CONTRACT-NO               PIC 9(9).
083700210928          05 CURR-RESET-UNIT-PRICE          PIC S9(5)V9(4) COMP-3.
083800210928          05 CURR-RESET-EXCH-RATE           PIC S9(2)V9(7) COMP-3.
083900210928          05 CURR-OPENING-UNIT-BAL          PIC S9(9)V9(3) COMP-3.
084000210928          05 CURR-RESET-NO                  PIC 9(2).
084100210928          05 CURR-HAS-RESET-FLAG            PIC X(1).
084200210928          05 CURR-GUAR-BASE-VALUE-BEF       PIC S9(11)V9(2) COMP-3.
084300210928          05 CURR-GUAR-BASE-VAL-CUR-BEF     PIC S9(11)V9(2) COMP-3.
084400210928
084500210928       01 WS-SQL-VARIABLES.
084600210928          05 WS-SQL-PROCESS-DATE           PIC S9(9) COMP-3.
084700210928          05 WS-SQL-PROC-SEQ-NO            PIC S9(9) COMP-3.
084800210928          05 WS-SQL-PLACEMENT-DATE         PIC S9(9) COMP-3.
084900210928          05 WS-SQL-TRANS-NO               PIC S9(9) COMP-3.
085000210928
085100210928180708 01 WS-PLACEMENTDATE               PIC S9(09) VALUE 0.
085200210928180708 01 WS-TRANSNO                     PIC S9(09) VALUE 0.
085300210928
085301211007      * RFS1117445 - START
085302211007       01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
085303211007       01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
085304211007       01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
085305211007      * RFS1117445 - END
085400210928       LINKAGE SECTION.
085500210928        01 COMM-AREA                     PIC X(200).
085600210928        01 COMM-AREA-BUFFER REDEFINES COMM-AREA.
085700210928           03 COMM-REJECTION-CODE        PIC X(3).
085800210928           03 COMM-USER                  PIC X(10).
085900210928           03 COMM-CALLER-ID-CODE        PIC X(10).
086000210928           03 COMM-ACTION                PIC X(10).
086100210928           03 COMM-OPEN-FILES            PIC X(1).
086200210928           03 COMM-PROCESS-DATE          PIC S9(8).
086300210928           03 COMM-ACCOUNT-NO            PIC 9(9).
086400210928           03 COMM-CONTRACT-NO           PIC 9(9).
086500210928           03 COMM-RESET-NUMBER          PIC 9(5).
086600210928           03 COMM-EFFECT-DATE           PIC S9(8).
086700210928           03 COMM-RESET-REQ-FUND        PIC X(5).
086800210928
086900210928       PROCEDURE DIVISION USING COMM-AREA.
087000210928       MAINLINE.
087100210928           PERFORM INITIAL-LOGIC     THRU INL-EXIT.
087200210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
087300210928              GO TO ML-1200.
087400210928       ML-0010.
087500210928           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
087600210928       ML-0020.
087700210928           IF PREV-CONTROLS IS EQUAL TO LOW-VALUES
087800210928              GO TO ML-0040.
087900210928       ML-0030.
088000210928       ML-0040.
088100210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
088200210928              GO TO ML-1200.
088300210928       ML-0050.
088400210928           MOVE CURR-CONTROLS          TO PREV-CONTROLS.
088500210928       ML-1100.
088600210928           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
088700210928           GO TO ML-0010.
088800210928       ML-1200.
088900210928           PERFORM END-JOB             THRU EOJ-EXIT.
089000210928           GOBACK.
089100210928      /
089200210928       GET-CURRENT-RECORD.
089300210928
089400210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
089500210928              GO TO GCR-EXIT
089600210928           END-IF.
089700210928
089800210928           EVALUATE COMM-ACTION
089900210928
090000210928           WHEN "ALL FUNDS"
090100210928             PERFORM GET-ALL-FUNDS-RECORD
090200210928                                       THRU GAFR-EXIT
090300210928           WHEN OTHER
090400210928             MOVE HIGH-VALUES  TO CURR-CONTROLS
090500210928
090600210928           END-EVALUATE.
090700210928
090800210928       GCR-EXIT.
090900210928           EXIT.
091000210928      /
091100210928       GET-ALL-FUNDS-RECORD.
091200210928
091300210928           INITIALIZE WS-ACC-CONT-INV-RESET-ARRAYX.
091400210928           PERFORM GET-ALL-INV-UNIT-BAL THRU GAIUB-EXIT.
091500210928
091600210928       GAFR-EXIT.
091700210928           EXIT.
091800210928      /
091900210928       GET-ALL-INV-UNIT-BAL.
092000210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-R-REC.
092100210928           MOVE COMM-ACCOUNT-NO
092200210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-R.
092300210928           MOVE COMM-CONTRACT-NO
092400210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-R.
092500210928           MOVE SPACES
092600210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-R.
092700210928
092800210928           START ACCOUNT-CONTRACT-INVEST-R
092900210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
093000210928                 INVALID KEY
093100210928                 MOVE HIGH-VALUES TO CURR-CONTROLS
093200210928                 GO TO GAIUB-EXIT.
093300210928
093400210928           SET INVRIDX TO 1.
093500210928           SET INVRIDX DOWN BY 1.
093600210928
093700210928       GAIUB-0010.
093800210928           READ ACCOUNT-CONTRACT-INVEST-R NEXT RECORD
093900210928                AT END
094000210928                GO TO GAIUB-EXIT.
094100210928
094200210928           IF COMM-ACCOUNT-NO NOT =
094300210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-R
094400210928              GO TO GAIUB-EXIT
094500210928           END-IF.
094600210928
094700210928           IF COMM-CONTRACT-NO NOT =
094800210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-R
094900210928              GO TO GAIUB-EXIT
095000210928           END-IF.
095100210928
095200210928           MOVE COMM-ACCOUNT-NO TO CURR-ACCOUNT-NO.
095300210928           MOVE COMM-CONTRACT-NO TO CURR-CONTRACT-NO.
095400210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-R
095500210928             TO CURR-INVESTMENT-CODE.
095600210928           MOVE COMM-RESET-NUMBER TO CURR-RESET-NO.
095700210928           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-R
095800210928             TO CURR-OPENING-UNIT-BAL.
095900210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-R
096000210928             TO CURR-GUAR-BASE-VALUE-BEF.
096100210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-R
096200210928             TO CURR-GUAR-BASE-VAL-CUR-BEF.
096300210928
096400210928           MOVE CURR-ACCOUNT-NO
096500210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET.
096600210928           MOVE CURR-CONTRACT-NO
096700210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET.
096800210928           MOVE CURR-RESET-NO
096900210928             TO RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET.
097000210928           MOVE CURR-INVESTMENT-CODE
097100210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET.
097200210928
097300210928           MOVE "N" TO WS-INV-RESET-FLAG.
097400210928           READ ACCOUNT-CONTRACT-INV-RESET
097500210928                NOT INVALID KEY
097600210928                MOVE "Y" TO WS-INV-RESET-FLAG
097700210928
097800210928                INVALID KEY
097900210928                MOVE "N" TO WS-INV-RESET-FLAG
098000210928           END-READ.
098100210928
098200210928           IF INV-RESET-FOUND
098300210928              MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INV-RESET
098400210928                TO CURR-OPENING-UNIT-BAL
098500210928              MOVE "Y" TO CURR-HAS-RESET-FLAG
098600210928              GO TO GAIUB-0030
098700210928           ELSE
098800210928              MOVE ZEROES TO CURR-RESET-UNIT-PRICE
098900210928                             CURR-RESET-EXCH-RATE
099000210928              MOVE "N" TO CURR-HAS-RESET-FLAG
099100210928           END-IF.
099200210928
099300210928           PERFORM GET-OPEN-UNIT-BALANCE THRU GOUB-EXIT.
099400210928
099500210928       GAIUB-0020.
099600210928      ** Move zero to current GBV if no more
099700210928      ** units for the fund.  Otherwise get the GBV in Trans-Contract-Dtl
099800210928           IF COMM-CALLER-ID-CODE = "SEGRVSRES"
099900210928              MOVE 0 TO WS-GUAR-BASE-VALUE-BEF
100000210928              IF CURR-OPENING-UNIT-BAL = 0
100100210928                 MOVE 0 TO CURR-GUAR-BASE-VALUE-BEF
100200210928                           CURR-GUAR-BASE-VAL-CUR-BEF
100300210928              ELSE
100400210928                 PERFORM VCA-GET-NEXT-BUSINESS-DATE
100500210928                 PERFORM GET-TRANS-GBV-BEF-RESET THRU GTGBR-EXIT
100600210928              END-IF
100700210928           END-IF.
100800210928
100900210928       GAIUB-0030.
101000210928
101100210928           SET INVRIDX UP BY 1.
101200210928      * RFS49699 - Array logging logic
101300210928
101400210928           IF INVRIDX  > WS-ARRAY1-MAX-USED
101500210928               MOVE INVRIDX                TO WS-ARRAY1-MAX-USED
101600210928           END-IF.
101700210928
101800210928      * RFS49699 - End
101900210928           MOVE CURR-ACCOUNT-NO
102000210928             TO WS-ARRAY-INVR-ACCOUNT-NO
102100210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
102200210928           MOVE CURR-CONTRACT-NO
102300210928             TO WS-ARRAY-INVR-CONTRACT-NO
102400210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
102500210928           MOVE CURR-INVESTMENT-CODE
102600210928             TO WS-ARRAY-INVR-INVEST-CODE
102700210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
102800210928           MOVE CURR-RESET-NO
102900210928             TO WS-ARRAY-INVR-RESET-NO
103000210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
103100210928           MOVE CURR-OPENING-UNIT-BAL
103200210928             TO WS-ARRAY-INVR-UNIT-BAL
103300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
103400210928           MOVE CURR-GUAR-BASE-VALUE-BEF
103500210928             TO WS-ARRAY-INVR-GBV
103600210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
103700210928           MOVE CURR-GUAR-BASE-VAL-CUR-BEF
103800210928             TO WS-ARRAY-INVR-GBV-CUR
103900210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
104000210928
104100210928           GO TO GAIUB-0010.
104200210928
104300210928       GAIUB-EXIT.
104400210928           EXIT.
104500210928      /
104600210928       DETAIL-PROCESSING.
104700210928
104800210928           EVALUATE COMM-ACTION
104900210928
105000210928           WHEN "ALL FUNDS"
105100210928             PERFORM DETAIL-ALL-FUNDS-PROCESSING
105200210928                                       THRU DAFP-EXIT
105300210928           WHEN OTHER
105400210928           MOVE HIGH-VALUES  TO CURR-CONTROLS
105500210928
105600210928           END-EVALUATE.
105700210928
105800210928           MOVE HIGH-VALUES TO CURR-CONTROLS.
105900210928
106000210928       DPR-EXIT.
106100210928           EXIT.
106200210928      /
106300210928       DETAIL-ALL-FUNDS-PROCESSING.
106400210928
106500210928           MOVE "Y" TO WS-FIRST-RECALC-PASS.
106600210928           MOVE "N" TO WS-SQL-FILE-OPEN.
106700210928
106800210928           EXEC SQL
106900210928                WHENEVER SQLERROR GOTO DAFP-EXIT
107000210928           END-EXEC.
107100210928
107200210928           EXEC SQL
107300210928                WHENEVER NOT FOUND GOTO DAFP-EXIT
107400210928           END-EXEC.
107500210928
107600210928      *RFS91599 Replaced 'Implicit Join' by 'Inner Join'
107700210928           EXEC SQL
107800210928           DECLARE SEGEXTSQ CURSOR FOR SELECT A.PROCESS_DATE,
10790021092891599      A.PROC_SEQ_NO, A.PLACEMENT_DATE, A.TRANS_NO
108000210928  |        FROM MFATRDPSP A
108100210928  |        INNER JOIN MFATRNP B ON
108200210928  |          A.PLACEMENT_DATE = B.PLACEMENT_DATE AND
108300210928  |          A.TRANS_NO = B.TRANS_NO
108400210928  |        WHERE  A.PROCESS_DATE > :COMM-EFFECT-DATE
10850021092898889      AND TRADE_DATE > :COMM-EFFECT-DATE
10860021092891599      AND A.PROCESS_DATE <= :COMM-PROCESS-DATE
108700210928           AND B.REVERSE <> "Y" AND B.ACCOUNT_NO = :CURR-ACCOUNT-NO
108800210928           ORDER BY A.PROCESS_DATE, A.PROC_SEQ_NO
108900210928           END-EXEC.
109000210928
109100210928           EXEC SQL
109200210928                OPEN SEGEXTSQ
109300210928           END-EXEC.
109400210928
109500210928           MOVE "Y" TO WS-SQL-FILE-OPEN.
109600210928
109700210928       DAFP-0010.
109800210928
109900210928           EXEC SQL
110000210928                WHENEVER NOT FOUND GOTO DAFP-EXIT
110100210928           END-EXEC.
110200210928
110300210928           EXEC SQL
110400210928           FETCH NEXT FROM SEGEXTSQ INTO :WS-SQL-PROCESS-DATE,
110500210928           :WS-SQL-PROC-SEQ-NO, :WS-SQL-PLACEMENT-DATE, :WS-SQL-TRANS-NO
110600210928           END-EXEC.
110700210928
110800210928           EXEC SQL
110900210928                WHENEVER SQLERROR GOTO DAFP-EXIT
111000210928           END-EXEC.
111100210928
111200210928           INITIALIZE MFATRNP OF TRANS-REC.
111300210928           MOVE WS-SQL-PLACEMENT-DATE
111400210928             TO PLACEMENT-DATE OF TRANS.
111500210928           MOVE WS-SQL-TRANS-NO
111600210928             TO TRANS-NO OF TRANS.
111700210928
111800210928           READ TRANS
111900210928                INVALID KEY
112000210928                GO TO DAFP-0010.
112100210928
112200210928           IF ACCOUNT-NO OF TRANS NOT = COMM-ACCOUNT-NO
112300210928              GO TO DAFP-EXIT
112400210928           END-IF.
112500210928
112600210928           IF PROCESS-DATE OF TRANS > COMM-PROCESS-DATE OR
112700210928              PROCESS-DATE OF TRANS < COMM-EFFECT-DATE
112800210928              GO TO DAFP-EXIT
112900210928           END-IF.
113000210928
113100210928           IF PROCESS-DATE OF TRANS = COMM-EFFECT-DATE
113200210928              GO TO DAFP-0010
113300210928           END-IF.
113400210928
113500210928           MOVE TRANS-TYPE-CODE OF TRANS
113600210928             TO TRANS-CATEGORY.
113700210928           MOVE TRANS-STATUS-CODE OF TRANS
113800210928             TO TRANS-STATUS-CATEGORY.
113900210928           MOVE REVERSE OF TRANS
114000210928             TO TRANS-REVERSE-CATEGORY.
114100210928
114200210928           IF TRANS-REVERSED OR
114300210928              NOT HISTORY OR
114400210928              NOT VALID-TRANSACTION
114500210928              GO TO DAFP-0010
114600210928           END-IF.
114700210928
114800210928      * This routine will check the transaction if to be excluded or not.
114900210928           MOVE "N" TO WS-EXCLUDE-TRANS.
115000210928           INITIALIZE WS-EXCLUDE-VARIABLES.
115100210928           MOVE ACCOUNT-NO OF TRANS TO WS-EX-ACCOUNT-NO.
115200210928           MOVE TRANS-ORIGIN-CODE OF TRANS TO WS-EX-TRANS-ORIGIN.
115300210928           MOVE TRANS-TYPE-CODE OF TRANS TO WS-EX-TRANS-TYPE.
115400210928           MOVE REVERSAL-CODE OF TRANS TO WS-EX-REVERSAL-CODE.
115500210928180708     MOVE TRANS-NO OF TRANS TO WS-TRANSNO.
115600210928180708     MOVE PLACEMENT-DATE OF TRANS TO WS-PLACEMENTDATE.
115700210928           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
11580021092826151**    IF WS-EXCLUDE-TRANS = "Y"
11590021092826151**       GO TO DAFP-0010
11600021092826151**    END-IF.
116100210928
11620021092826151      IF WS-EXCLUDE-TRANS NOT = "Y" AND
11630021092826151         MAN-FEE-REB-TRANSACTION
11640021092826151         GO TO DAFP-0010
11650021092826151      END-IF.
116600210928
116700210928           INITIALIZE MFATRCODP OF TRANS-CONT-DTL-R2-REC.
116800210928           MOVE PLACEMENT-DATE OF TRANS
116900210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-R2.
117000210928           MOVE TRANS-NO OF TRANS
117100210928             TO TRANS-NO OF TRANS-CONTRACT-DTL-R2.
117200210928           MOVE CURR-CONTRACT-NO
117300210928             TO CONTRACT-NO OF TRANS-CONTRACT-DTL-R2.
117400210928
117500210928           READ TRANS-CONTRACT-DTL-R2 WITH NO LOCK
117600210928                INVALID KEY
117700210928                GO TO DAFP-0010.
117800210928
117900210928           IF REVERSED-DDS OF TRANS-CONTRACT-DTL-R2 = "Y"
118000210928              GO TO DAFP-0010
118100210928           END-IF.
118200210928
118300210928R13394* Get the GBV from Trans-GBV-Transfer it it exists
118400210928           MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
118500210928           INITIALIZE MFATRACXP OF TRANS-GBV-TRANSFER-REC.
118600210928           IF BUY-TRANSACTION
118700210928R49898        OR SWITCH-IN-TRANSACTION
118800210928              MOVE PLACEMENT-DATE OF TRANS
118900210928                TO PLACEMENT-DATE OF TRANS-GBV-TRANSFER
119000210928              MOVE TRANS-NO OF TRANS
119100210928                TO TRANS-NO OF TRANS-GBV-TRANSFER
119200210928
119300210928              READ TRANS-GBV-TRANSFER
119400210928                   INVALID KEY
119500210928                   GO TO DAFP-0020
119600210928              END-READ
119700210928
119800210928              MOVE "Y" TO WS-XFER-AMT-EXISTS-FLAG
119900210928           END-IF.
120000210928
120100210928      *    DISPLAY "PLACEMENT-DATE OF TRANS..."
120200210928      *             PLACEMENT-DATE OF TRANS.
120300210928      *    DISPLAY "TRANS-NO       OF TRANS..."
120400210928      *             TRANS-NO       OF TRANS.
120500210928      *    DISPLAY "TRANS-TYPE-CODE OF TRANS..."
120600210928      *             TRANS-TYPE-CODE OF TRANS.
120700210928       DAFP-0020.
120800210928           MOVE UNIT-AMT OF TRANS TO WS-CURR-TRANS-UNIT-AMT.
120900210928           MOVE UNIT-PRICE OF TRANS TO WS-CURR-TRANS-UNIT-PRICE.
121000210928           MOVE TRADE-DATE OF TRANS TO WS-CURR-TRANS-TRADE-DATE.
121100210928           MOVE GROSS-AMT OF TRANS TO WS-CURR-TRANS-GROSS-AMT.
121200210928           MOVE PLACEMENT-DATE OF TRANS
121300210928             TO WS-CURR-TRANS-PLACEMENT-DATE.
121400210928           MOVE TRANS-NO OF TRANS TO WS-CURR-TRANS-TRANS-NO.
121500210928           MOVE ACCOUNT-NO OF TRANS TO CURR-ACCOUNT-NO.
121600210928           MOVE INVESTMENT-CODE OF TRANS TO CURR-INVESTMENT-CODE.
121700210928
121800210928XXXXXX     IF REDEMPTION-TRANSACTION
121900210928XXXXXX        COMPUTE WS-CURR-TRANS-GROSS-AMT ROUNDED =
122000210928XXXXXX                ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R2 *
122100210928XXXXXX                UNIT-PRICE OF TRANS
122200210928XXXXXX     END-IF.
122300210928           MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R2
122400210928             TO WS-CURR-ORIG-UNIT-BAL.
122500210928
12260021092816512      IF SWITCH-IN-TRANSACTION
12270021092816512         COMPUTE WS-CONTRACT-GROSS-AMT ROUNDED =
12280021092816512                 ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R2 *
12290021092816512                 UNIT-PRICE OF TRANS
12300021092816512      END-IF.
123100210928
123200210928           PERFORM SET-INTERNAL-ARRAY-POINTER THRU SIAP-EXIT.
123300210928           IF ARRAY-POINTER-NOT-FOUND
123400210928              GO TO DAFP-0010
123500210928           END-IF.
123600210928
123700210928      *    IF BUY-TRANSACTION OR TRANSFER-IN
123800210928           IF BUY-TRANSACTION
123900210928R49898        OR SWITCH-IN-TRANSACTION
12400021092826151         OR MAN-FEE-REB-TRANSACTION
124100210928              PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT
124200210928XXXXXX        IF FRONT-END
124300210928XXXXXX           MOVE NET-AMT OF TRANS TO WS-CURR-TRANS-AMT-CUR
124400210928XXXXXX        ELSE
124500210928XXXXXX           MOVE GROSS-AMT OF TRANS TO WS-CURR-TRANS-AMT-CUR
124600210928XXXXXX        END-IF
124700210928
124800210928R13394*       IF BUY-TRANSACTION AND TRANSFER-AMT-EXISTS
124900210928R49898        IF (BUY-TRANSACTION OR SWITCH-IN-TRANSACTION)
125000210928R49898           AND TRANSFER-AMT-EXISTS
125100210928                 MOVE GUAR-BASE-VALUE OF TRANS-GBV-TRANSFER
125200210928                   TO WS-CURR-TRANS-AMT-CUR
125300210928R13394        END-IF
125400210928
125500210928              IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
125600210928                 MOVE CURRENCY-DDS OF INVESTMENT TO WS-EXCH-CURRENCY
125700210928                 MOVE WS-CURR-TRANS-PLACEMENT-DATE
125800210928                   TO WS-EXCH-PLACEMENT-DATE
125900210928                 MOVE WS-CURR-TRANS-TRANS-NO TO WS-EXCH-TRANS-NO
126000210928                 MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
126100210928                 PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
126200210928                 COMPUTE WS-CURR-TRANS-AMT ROUNDED =
126300210928                         WS-CURR-TRANS-AMT-CUR / WS-EXCH-RATE-VALUE
126400210928              ELSE
126500210928                 MOVE WS-CURR-TRANS-AMT-CUR TO WS-CURR-TRANS-AMT
126600210928              END-IF
126700210928R11622*       ADD WS-CURR-TRANS-UNIT-AMT
126800210928R11622        ADD WS-CURR-ORIG-UNIT-BAL
126900210928               TO WS-ARRAY-INVR-UNIT-BAL
127000210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
127100210928
12720021092826151         IF WS-EXCLUDE-TRANS NOT = "Y"
127300210928              ADD WS-CURR-TRANS-AMT
127400210928               TO WS-ARRAY-INVR-GBV
127500210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
127600210928
127700210928              ADD WS-CURR-TRANS-AMT-CUR
127800210928               TO WS-ARRAY-INVR-GBV-CUR
127900210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
12800021092826151         END-IF
128100210928
128200210928              PERFORM UPD-ACC-CON-INV-BUY THRU UACIB-EXIT
128300210928
128400210928              MOVE WS-ARRAY-INVR-GBV
128500210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
128600210928               TO GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-R2
128700210928              MOVE WS-ARRAY-INVR-GBV-CUR
128800210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
128900210928               TO GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DTL-R2
129000210928              REWRITE TRANS-CONT-DTL-R2-REC
129100210928              GO TO DAFP-0010
129200210928           END-IF.
129300210928
129301211007111744        INITIALIZE ln_InvArraySize
129302211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
129400210928           SET OLD-INVRIDX TO INVRIDX.
129500210928           INITIALIZE WS-OTHER-VARIABLES WS-ACC-CONT-INV-ARRAYX.
129501211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
129502211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
129503211007111744     INITIALIZE WS-ARRAY-ACCOUNT-NO(IVS-CNT1)
129504211007111744                WS-ARRAY-CONTRACT-NO(IVS-CNT1)
129505211007111744                WS-ARRAY-INVESTMENT-CODE(IVS-CNT1)
129506211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
129507211007111744                WS-ARRAY-BEFORE-MV(IVS-CNT1)
129508211007111744                WS-ARRAY-BEFORE-GBV(IVS-CNT1)
129509211007111744                WS-ARRAY-BEFORE-NDV(IVS-CNT1)
129510211007111744                WS-ARRAY-AFTER-MV(IVS-CNT1)
129511211007111744                WS-ARRAY-INV-EXCH-RATE(IVS-CNT1)
129512211007111744     END-PERFORM
129513211007
129600210928           PERFORM CALC-CONTRACT-MARKET-VALUE THRU CCMV-EXIT.
129700210928
12980021092826151** Don't update GBV if this is a transaction on exclude table
12990021092826151      IF WS-EXCLUDE-TRANS = "Y"
13000021092826151         SET INVRIDX TO OLD-INVRIDX
13010021092826151         MOVE "N" TO WS-FIRST-RECALC-PASS
13020021092826151         GO TO DAFP-0010
13030021092826151      END-IF.
130400210928
130500210928R11698     MOVE "N" TO WS-TRANSFER-GBV.
130600210928           IF SWITCH-IN-TRANSACTION
13070021092816512         MOVE CONTRACT-NO OF TRANS-CONTRACT-DTL-R2
13080021092816512              TO WS-TO-CONTRACT-NO
130900210928R11698        PERFORM GET-SEG-TRANSFER-PARAMETERS THRU GSTP-EXIT
131000210928           END-IF.
131100210928           PERFORM CALC-NEW-CHANGE-GBV THRU CNCG-EXIT.
131200210928           PERFORM RECALC-NETDEP-GBV-VALUES THRU RNGV-EXIT.
131300210928R12702     PERFORM CHECK-NDV-GBV-ROUNDING THRU CNGR-EXIT.
131400210928           SET INVRIDX TO OLD-INVRIDX.
131500210928
131600210928           MOVE "N" TO WS-FIRST-RECALC-PASS.
131700210928
131800210928           GO TO DAFP-0010.
131900210928
132000210928       DAFP-EXIT.
132100210928           EXIT.
132200210928      /
132300210928       SET-INTERNAL-ARRAY-POINTER.
132400210928           MOVE "N" TO WS-ARRAY-POINTER
132500210928           SET INVRIDX TO 1.
132600210928      *    SET INVRIDX DOWN BY 1.
132700210928
132800210928           SEARCH WS-ACC-CONT-INV-RESET-ARRAY VARYING INVRIDX
132900210928           WHEN WS-ARRAY-INVR-ACCOUNT-NO(INVRIDX) = COMM-ACCOUNT-NO AND
133000210928              WS-ARRAY-INVR-INVEST-CODE(INVRIDX) = CURR-INVESTMENT-CODE
133100210928              MOVE "Y" TO WS-ARRAY-POINTER
133200210928              GO TO SIAP-EXIT
133300210928           WHEN WS-ARRAY-INVR-ACCOUNT-NO(INVRIDX) = 0 OR
133400210928                WS-ARRAY-INVR-INVEST-CODE(INVRIDX) = " "
133500210928              GO TO SIAP-EXIT
133600210928           END-SEARCH.
133700210928
133800210928       SIAP-EXIT.
133900210928           EXIT.
134000210928      /
134100210928       GET-OPEN-UNIT-BALANCE.
134200210928           INITIALIZE MFATRNP OF TRANS-R-REC.
134300210928           MOVE CURR-ACCOUNT-NO TO ACCOUNT-NO OF TRANS-R.
134400210928           MOVE CURR-INVESTMENT-CODE TO INVESTMENT-CODE OF TRANS-R.
134500210928           MOVE COMM-PROCESS-DATE TO PROCESS-DATE OF TRANS-R.
134600210928      *    MOVE ZEROES TO PROCESS-DATE OF TRANS-R
134700210928           MOVE ZEROES TO TRANS-PROC-SEQ-NO OF TRANS-R
134800210928                          PLACEMENT-DATE OF TRANS-R
134900210928                          TRANS-NO OF TRANS-R
135000210928                          WS-TRANS-COUNT.
135100210928
135200210928           START TRANS-R
135300210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
135400210928                 INVALID KEY
135500210928                 GO TO GOUB-EXIT.
135600210928
135700210928       GOUB-0010.
135800210928           READ TRANS-R NEXT RECORD
135900210928                AT END
136000210928                GO TO GOUB-EXIT.
136100210928
136200210928           IF ACCOUNT-NO OF TRANS-R NOT = CURR-ACCOUNT-NO
136300210928              GO TO GOUB-EXIT
136400210928           END-IF.
136500210928
136600210928           IF INVESTMENT-CODE OF TRANS-R NOT = CURR-INVESTMENT-CODE
136700210928              GO TO GOUB-EXIT
136800210928           END-IF.
136900210928
137000210928           IF PROCESS-DATE OF TRANS-R > COMM-PROCESS-DATE OR
137100210928              PROCESS-DATE OF TRANS-R < COMM-EFFECT-DATE
137200210928              GO TO GOUB-EXIT
137300210928           END-IF.
137400210928
137500210928           MOVE "N" TO WS-NEED-GBV-FLAG.
137600210928           IF PROCESS-DATE OF TRANS-R = COMM-EFFECT-DATE
137700210928              MOVE "Y" TO WS-NEED-GBV-FLAG
137800210928           END-IF.
137900210928
138000210928           MOVE TRANS-TYPE-CODE OF TRANS-R
138100210928             TO TRANS-CATEGORY.
138200210928           MOVE TRANS-STATUS-CODE OF TRANS-R
138300210928             TO TRANS-STATUS-CATEGORY.
138400210928           MOVE REVERSE OF TRANS-R
138500210928             TO TRANS-REVERSE-CATEGORY.
138600210928
138700210928           IF TRANS-REVERSED
138800210928              GO TO GOUB-0010
138900210928           END-IF.
139000210928
139100210928           IF NOT HISTORY
139200210928              GO TO GOUB-0010
139300210928           END-IF.
139400210928
139500210928           IF NOT VALID-TRANSACTION
139600210928              GO TO GOUB-0010
139700210928           END-IF.
139800210928
139900210928           INITIALIZE MFATRCODP OF TRANS-CONT-DTL-R-REC.
140000210928           MOVE PLACEMENT-DATE OF TRANS-R
140100210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-R.
140200210928           MOVE TRANS-NO OF TRANS-R
140300210928             TO TRANS-NO OF TRANS-CONTRACT-DTL-R.
140400210928           MOVE CURR-CONTRACT-NO
140500210928             TO CONTRACT-NO OF TRANS-CONTRACT-DTL-R.
140600210928
140700210928           READ TRANS-CONTRACT-DTL-R
140800210928                INVALID KEY
140900210928                GO TO GOUB-0010.
141000210928
141100210928           IF REVERSED-DDS OF TRANS-CONTRACT-DTL-R = "Y"
141200210928              GO TO GOUB-0010
141300210928           END-IF.
141400210928
141500210928           IF NEEDS-GBV-AMOUNT AND WS-TRANS-COUNT NOT = 0
141600210928              MOVE GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-R
141700210928                TO CURR-GUAR-BASE-VALUE-BEF
141800210928              GO TO GOUB-EXIT
141900210928           END-IF.
142000210928
14210021092826151** Check if the transaction is in exclude transaction table and
14220021092826151** it is a MFR transaction, don't udpate unit balance.
142300210928
14240021092826151      MOVE "N" TO WS-EXCLUDE-TRANS.
14250021092826151      INITIALIZE WS-EXCLUDE-VARIABLES.
14260021092826151      MOVE ACCOUNT-NO OF TRANS-R TO WS-EX-ACCOUNT-NO.
14270021092826151      MOVE TRANS-ORIGIN-CODE OF TRANS-R TO WS-EX-TRANS-ORIGIN.
14280021092826151      MOVE TRANS-TYPE-CODE OF TRANS-R TO WS-EX-TRANS-TYPE.
14290021092826151      MOVE REVERSAL-CODE OF TRANS-R TO WS-EX-REVERSAL-CODE.
143000210928180708     MOVE TRANS-NO OF TRANS-R TO WS-TRANSNO.
143100210928180708     MOVE PLACEMENT-DATE OF TRANS-R TO WS-PLACEMENTDATE.
14320021092826151      PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
143300210928
14340021092826151      IF WS-EXCLUDE-TRANS NOT = "Y" AND
14350021092826151         MAN-FEE-REB-TRANSACTION
14360021092826151         GO TO GOUB-0010
14370021092826151      END-IF.
143800210928
143900210928           IF PURCHASE-TRANSACTION
14400021092826151         OR MAN-FEE-REB-TRANSACTION
144100210928              SUBTRACT ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R
144200210928                  FROM CURR-OPENING-UNIT-BAL
144300210928           ELSE
144400210928              ADD ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R
144500210928               TO CURR-OPENING-UNIT-BAL
144600210928           END-IF.
144700210928
144800210928           ADD 1 TO WS-TRANS-COUNT.
144900210928
145000210928           GO TO GOUB-0010.
145100210928
145200210928       GOUB-EXIT.
145300210928           EXIT.
145400210928      /
145500210928       GET-TRANS-GBV-BEF-RESET.
145600210928           INITIALIZE MFATRNP OF TRANS-GBV-REC.
145700210928           MOVE CURR-ACCOUNT-NO TO ACCOUNT-NO OF TRANS-GBV.
145800210928           MOVE CURR-INVESTMENT-CODE TO INVESTMENT-CODE OF TRANS-GBV.
145900210928           MOVE WS-NEXT-PROCESS-DATE TO PROCESS-DATE OF TRANS-GBV.
146000210928      *    MOVE COMM-PROCESS-DATE TO PROCESS-DATE OF TRANS-GBV.
146100210928      *    MOVE ZEROES TO PROCESS-DATE OF TRANS-GBV
146200210928           MOVE ZEROES TO TRANS-PROC-SEQ-NO OF TRANS-GBV
146300210928                          PLACEMENT-DATE OF TRANS-GBV
146400210928                          TRANS-NO OF TRANS-GBV.
146500210928
146600210928           START TRANS-GBV
146700210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
146800210928                 INVALID KEY
146900210928                 GO TO GTGBR-EXIT.
147000210928
147100210928       GTGBR-0010.
147200210928           READ TRANS-GBV NEXT RECORD
147300210928                AT END
147400210928                GO TO GTGBR-EXIT.
147500210928
147600210928           IF ACCOUNT-NO OF TRANS-GBV NOT = CURR-ACCOUNT-NO
147700210928              GO TO GTGBR-EXIT
147800210928           END-IF.
147900210928
148000210928           IF INVESTMENT-CODE OF TRANS-GBV NOT = CURR-INVESTMENT-CODE
148100210928              GO TO GTGBR-EXIT
148200210928           END-IF.
148300210928
148400210928           IF PROCESS-DATE OF TRANS-GBV > COMM-EFFECT-DATE
148500210928              GO TO GTGBR-0010
148600210928           END-IF.
148700210928
148800210928           MOVE TRANS-TYPE-CODE OF TRANS-GBV
148900210928             TO TRANS-CATEGORY.
149000210928           MOVE TRANS-STATUS-CODE OF TRANS-GBV
149100210928             TO TRANS-STATUS-CATEGORY.
149200210928           MOVE REVERSE OF TRANS-GBV
149300210928             TO TRANS-REVERSE-CATEGORY.
149400210928
149500210928           IF TRANS-REVERSED
149600210928              GO TO GTGBR-0010
149700210928           END-IF.
149800210928
149900210928           IF NOT HISTORY
150000210928              GO TO GTGBR-0010
150100210928           END-IF.
150200210928
150300210928           IF NOT VALID-TRANSACTION
150400210928              GO TO GTGBR-0010
150500210928           END-IF.
150600210928
150700210928           INITIALIZE MFATRCODP OF TRANS-CONT-DTL-R-REC.
150800210928           MOVE PLACEMENT-DATE OF TRANS-GBV
150900210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-R.
151000210928           MOVE TRANS-NO OF TRANS-GBV
151100210928             TO TRANS-NO OF TRANS-CONTRACT-DTL-R.
151200210928           MOVE CURR-CONTRACT-NO
151300210928             TO CONTRACT-NO OF TRANS-CONTRACT-DTL-R.
151400210928
151500210928           READ TRANS-CONTRACT-DTL-R
151600210928                INVALID KEY
151700210928                GO TO GTGBR-0010.
151800210928
151900210928           IF REVERSED-DDS OF TRANS-CONTRACT-DTL-R = "Y"
152000210928              GO TO GTGBR-0010
152100210928           END-IF.
152200210928
152300210928           MOVE GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-R
152400210928             TO CURR-GUAR-BASE-VALUE-BEF.
152500210928
152600210928      *    GO TO GTGBR-0010.
152700210928
152800210928       GTGBR-EXIT.
152900210928           EXIT.
153000210928      /
153100210928       UPD-ACC-CON-INV-BUY.
153200210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-REC.
153300210928           MOVE CURR-ACCOUNT-NO
153400210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
153500210928           MOVE CURR-CONTRACT-NO
153600210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
153700210928           MOVE CURR-INVESTMENT-CODE
153800210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
153900210928
154000210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
154100210928                INVALID KEY
154200210928                GO TO UACIB-EXIT.
154300210928
154400210928      *    MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
154500210928      *      TO OLD-NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
154600210928      *    MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
154700210928      *     TO OLD-NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
154800210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
154900210928             TO OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
155000210928           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
155100210928             TO OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
155200210928
155300210928      *    ADD WS-CURR-TRANS-AMT-CUR
155400210928           MOVE WS-ARRAY-INVR-GBV-CUR
155500210928             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
155600210928             TO GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
155700210928      *         NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
155800210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
155900210928      *       ADD WS-CURR-TRANS-AMT-CUR
156000210928              MOVE WS-ARRAY-INVR-GBV-CUR
156100210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
156200210928                TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
156300210928      *            NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
156400210928           ELSE
156500210928      *       ADD WS-CURR-TRANS-AMT
156600210928                  MOVE WS-ARRAY-INVR-GBV
156700210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
156800210928                TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
156900210928      *            NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
157000210928           END-IF.
157100210928
157200210928           REWRITE ACC-CON-INV-REC.
157300210928
157400210928       UACIB-EXIT.
157500210928           EXIT.
157600210928      /
157700210928       CALC-CONTRACT-MARKET-VALUE.
157800210928      *    DISPLAY "CALC-CONTRACT-MARKET-VALUE.......".
157900210928
158000210928           SET INVRIDX TO 1.
158100210928           SET INVRIDX DOWN BY 1.
158200210928
158300210928           SET CONTIDX TO 1.
158400210928           SET CONTIDX DOWN BY 1.
158500210928
158600210928       CCMV-0010.
158700210928           SET INVRIDX UP BY 1.
158800210928
158900210928           IF WS-ARRAY-INVR-ACCOUNT-NO
159000210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
159100210928              WS-ARRAY-INVR-CONTRACT-NO
159200210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
159300210928              WS-ARRAY-INVR-RESET-NO
159400210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
159500210928              WS-ARRAY-INVR-INVEST-CODE
159600210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = " "
159700210928              GO TO CCMV-EXIT.
159800210928
159900210928           MOVE "N" TO WS-DIFF-INVESTMENT-FLAG.
160000210928           IF CURR-INVESTMENT-CODE NOT =
160100210928              WS-ARRAY-INVR-INVEST-CODE OF
160200210928                 WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
160300210928              MOVE "Y" TO WS-DIFF-INVESTMENT-FLAG
160400210928           END-IF.
160500210928
160600210928           MOVE CURR-INVESTMENT-CODE TO WS-OLD-CURR-INVESTMENT-CODE.
160700210928           MOVE WS-ARRAY-INVR-INVEST-CODE
160800210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
160900210928             TO CURR-INVESTMENT-CODE
161000210928                WS-CONT-INVESTMENT-CODE.
161100210928           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
161200210928           MOVE WS-OLD-CURR-INVESTMENT-CODE TO CURR-INVESTMENT-CODE.
161300210928
161400210928      *    IF WS-ARRAY-INVR-RESET-FLAG
161500210928      *       OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = "Y"
161600210928      *       AND REDEMPTION-TRANSACTION
161700210928      *       MOVE WS-ARRAY-INVR-UNIT-PRICE
161800210928      *            OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
161900210928      *         TO WS-INV-UNIT-PRICE
162000210928      *       MOVE WS-ARRAY-INVR-EXCH-RATE
162100210928      *            OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
162200210928      *         TO WS-EXCH-RATE-VALUE
162300210928      *         GO TO CCMV-0020
162400210928      *    END-IF.
162500210928
162600210928           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
162700210928              MOVE CURRENCY-DDS OF INVESTMENT TO WS-EXCH-CURRENCY
162800210928              MOVE WS-CURR-TRANS-PLACEMENT-DATE
162900210928                   TO WS-EXCH-PLACEMENT-DATE
163000210928              MOVE WS-CURR-TRANS-TRANS-NO TO WS-EXCH-TRANS-NO
163100210928              MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
163200210928              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
163300210928              IF WS-EXCH-RATE-VALUE = 0 OR
163400210928                 WS-EXCHANGE-FOUND NOT = "Y"
163500210928                 MOVE "06" TO WS-REJECTION-CODE
163600210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
163700210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
163800210928                 MOVE WS-EXCH-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
163900210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
164000210928                 MOVE WS-EXCH-TRANS-NO TO WS-MISC-INFO-2-KEY-2
164100210928                 PERFORM LOG-ERROR THRU LER-EXIT
164200210928                 GO TO CCMV-EXIT
164300210928              END-IF
164400210928           ELSE
164500210928              MOVE "Y" TO WS-EXCHANGE-FOUND
164600210928              MOVE 1.0 TO WS-EXCH-RATE-VALUE
164700210928           END-IF.
164800210928
164900210928           IF CURR-INVESTMENT-CODE NOT = WS-CONT-INVESTMENT-CODE
165000210928              PERFORM GET-INVESTMENT-MARKET-VALUE THRU GIMV-EXIT
165100210928              IF WS-PRICE-FOUND NOT = "Y" OR
165200210928                 WS-INV-UNIT-PRICE = 0
165300210928R11622           PERFORM GET-LAST-UNIT-PRICE THRU GLUP-EXIT
165400210928      *          DISPLAY "WS-INV-UNIT-PRICE..." WS-INV-UNIT-PRICE
165500210928R11622           IF WS-PRICE-FOUND NOT = "Y" OR
165600210928R11622              WS-INV-UNIT-PRICE = 0
165700210928                 MOVE "05" TO WS-REJECTION-CODE
165800210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
165900210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
166000210928                 MOVE WS-EXCH-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
166100210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
166200210928                 MOVE WS-EXCH-TRANS-NO TO WS-MISC-INFO-2-KEY-2
166300210928                 PERFORM LOG-ERROR THRU LER-EXIT
166400210928                 GO TO CCMV-EXIT
166500210928                 END-IF
166600210928              END-IF
166700210928           ELSE
166800210928              MOVE WS-CURR-TRANS-UNIT-PRICE TO WS-INV-UNIT-PRICE
166900210928           END-IF.
167000210928
167100210928       CCMV-0020.
167200210928           MOVE WS-ARRAY-INVR-UNIT-BAL
167300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
167400210928             TO WS-INV-OPENING-UNIT-BAL.
167500210928
167600210928      ** Calculate the market value of the investment before this trade.
167700210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
167800210928              COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
167900210928                      WS-INV-OPENING-UNIT-BAL * WS-INV-UNIT-PRICE
168000210928           ELSE
168100210928              COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
168200210928                      WS-INV-OPENING-UNIT-BAL *
168300210928                      WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
168400210928           END-IF.
168500210928
168600210928      * Get the GBV of the current account/contract/investment
168700210928           IF FIRST-RECALC-PASS
168800210928              MOVE WS-ARRAY-INVR-GBV
168900210928                   OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
169000210928                TO WS-INV-BEF-GBV
169100210928           ELSE
169200210928           MOVE WS-ARRAY-INVR-ACCOUNT-NO
169300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
169400210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
169500210928           MOVE WS-ARRAY-INVR-CONTRACT-NO
169600210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
169700210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
169800210928           MOVE WS-ARRAY-INVR-INVEST-CODE
169900210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
170000210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-SWI
170100210928
170200210928           READ ACCOUNT-CONTRACT-INVEST-SWI
170300210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
170400210928                TO WS-INV-BEF-GBV
170500210928           END-IF.
170600210928
170700210928           IF CURR-INVESTMENT-CODE = WS-CONT-INVESTMENT-CODE
170800210928              IF NOT SWITCH-IN-TRANSACTION
170900210928R11622*          SUBTRACT WS-CURR-TRANS-UNIT-AMT FROM
171000210928R11622           SUBTRACT WS-CURR-ORIG-UNIT-BAL FROM
171100210928                          WS-ARRAY-INVR-UNIT-BAL
171200210928                             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
171300210928              ELSE
171400210928R11622*          ADD WS-CURR-TRANS-UNIT-AMT
171500210928R11622           ADD WS-CURR-ORIG-UNIT-BAL
171600210928                       TO WS-ARRAY-INVR-UNIT-BAL
171700210928                             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
171800210928              END-IF
171900210928           END-IF.
172000210928
17210021092826151** Only updates unit balance if this is a transaction on exclude table
17220021092826151      IF WS-EXCLUDE-TRANS = "Y"
17230021092826151         GO TO CCMV-0010
17240021092826151      END-IF.
172500210928
172600210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
172700210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
172800210928                 WS-ARRAY-INVR-UNIT-BAL
172900210928                    OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) *
173000210928                       WS-INV-UNIT-PRICE
173100210928           ELSE
173200210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
173300210928                 WS-ARRAY-INVR-UNIT-BAL
173400210928                    OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) *
173500210928                       WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
173600210928           END-IF.
173700210928
173800210928           ADD WS-INV-BEF-GBV TO WS-CURR-CONTRACT-GBV-BEF.
173900210928      *    ADD WS-INV-BEF-NDV TO WS-CURR-CONTRACT-NDV-BEF.
174000210928           ADD WS-INV-BEF-MARKET-VALUE TO WS-CONT-INV-MARKET-VALUE.
174100210928           ADD WS-INV-AFT-MARKET-VALUE TO WS-CURR-CONTRACT-MV-AFT.
174200210928      *    DISPLAY "WS-INV-BEF-GBV..." WS-INV-BEF-GBV.
174300210928      *    DISPLAY "WS-CURR-CONTRACT-GBV-BEF..."
174400210928      *             WS-CURR-CONTRACT-GBV-BEF.
174500210928      *    DISPLAY "WS-INV-BEF-MARKET-VALUE...."
174600210928      *             WS-INV-BEF-MARKET-VALUE.
174700210928      *    DISPLAY "WS-CONT-INV-MARKET-VALUE..."
174800210928      *             WS-CONT-INV-MARKET-VALUE.
174900210928      *    DISPLAY "WS-INV-AFT-MARKET-VALUE...."
175000210928      *             WS-INV-AFT-MARKET-VALUE.
175100210928
175200210928           SET CONTIDX UP BY 1.
175300210928      * RFS49699 - Array logging logic
175400210928
175500210928           IF CONTIDX  > WS-ARRAY2-MAX-USED
175600210928               MOVE CONTIDX                TO WS-ARRAY2-MAX-USED
175700210928           END-IF.
175800210928
175900210928      * RFS49699 - End
175901211007      * RFS1117445 - START
175902211007           IF CONTIDX >  ln_InvArraySize
175903211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
175904211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(CONTIDX)
175905211007                      WS-ARRAY-CONTRACT-NO(CONTIDX)
175906211007                      WS-ARRAY-INVESTMENT-CODE(CONTIDX)
175907211007                      WS-ARRAY-INV-CURR-CODE(CONTIDX)
175908211007                      WS-ARRAY-BEFORE-MV(CONTIDX)
175909211007                      WS-ARRAY-BEFORE-GBV(CONTIDX)
175910211007                      WS-ARRAY-BEFORE-NDV(CONTIDX)
175911211007                      WS-ARRAY-AFTER-MV(CONTIDX)
175912211007                      WS-ARRAY-INV-EXCH-RATE(CONTIDX)
175913211007           END-IF
175914211007      *    RFS1117445 End
176000210928
176100210928           MOVE CURR-ACCOUNT-NO TO WS-ARRAY-ACCOUNT-NO(CONTIDX).
176200210928           MOVE WS-CONT-INVESTMENT-CODE
176300210928                TO WS-ARRAY-INVESTMENT-CODE(CONTIDX).
176400210928           MOVE CURR-CONTRACT-NO TO WS-ARRAY-CONTRACT-NO(CONTIDX).
176500210928           MOVE CURRENCY-DDS OF INVESTMENT
176600210928                TO WS-ARRAY-INV-CURR-CODE(CONTIDX).
176700210928           MOVE WS-INV-BEF-MARKET-VALUE TO WS-ARRAY-BEFORE-MV(CONTIDX).
176800210928           MOVE WS-INV-BEF-GBV TO WS-ARRAY-BEFORE-GBV(CONTIDX).
176900210928      *    MOVE WS-INV-BEF-NDV TO WS-ARRAY-BEFORE-NDV(CONTIDX).
177000210928           MOVE WS-INV-AFT-MARKET-VALUE TO WS-ARRAY-AFTER-MV(CONTIDX).
177100210928           MOVE WS-EXCH-RATE-VALUE TO WS-ARRAY-INV-EXCH-RATE(CONTIDX).
177200210928
177300210928           ADD 1 TO WS-CONT-INV-ARRAY-COUNT.
177400210928
177500210928           GO TO CCMV-0010.
177600210928
177700210928       CCMV-EXIT.
177800210928           EXIT.
177900210928      /
178000210928       CALC-NEW-CHANGE-GBV.
178100210928      *    DISPLAY "CALC-NEW-CHANGE-GBV..............".
178200210928
178300210928      ** Get the change in NDV/GBV from the out transaction
178400210928           IF WS-TRANSFER-GBV = "Y" AND SWITCH-IN-TRANSACTION
178500210928              MOVE ZEROES TO WS-SWO-NDV-CHANGE WS-SWO-GBV-CHANGE
178600210928              PERFORM GET-NDV-GBV-CHANGE THRU GNGC-EXIT
178700210928           END-IF.
178800210928
178900210928           IF REDEMPTION-TRANSACTION
179000210928              IF WS-CONT-INV-MARKET-VALUE NOT = 0
179100210928              COMPUTE WS-GBV-CHANGE ROUNDED = WS-CURR-CONTRACT-GBV-BEF *
179200210928                      WS-CURR-TRANS-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
179300210928
179400210928      *       COMPUTE WS-NDV-CHANGE ROUNDED = WS-CURR-CONTRACT-NDV-BEF *
179500210928      *               WS-CURR-TRANS-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
179600210928              ELSE
179700210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GBV-CHANGE
179800210928              END-IF
179900210928           ELSE
180000210928              IF WS-TRANSFER-GBV = "N" AND PURCHASE-TRANSACTION
180100210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GBV-CHANGE
180200210928              ELSE
180300210928                 IF WS-TRANSFER-GBV = "Y" AND PURCHASE-TRANSACTION
180400210928                    MOVE WS-SWO-GBV-CHANGE TO WS-GBV-CHANGE
180500210928                 END-IF
180600210928              END-IF
180700210928           END-IF.
180800210928
180900210928      *    IF WS-TRANSFER-GBV = "N" AND SWITCH-IN
181000210928      *       MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GBV-CHANGE
181100210928      *    END-IF.
181200210928
181300210928           IF SWITCH-OUT-TRANSACTION
181400210928              MOVE WS-GBV-CHANGE TO WS-SWO-GBV-CHANGE
181500210928           END-IF.
181600210928
181700210928      *    DISPLAY "WS-GBV-CHANGE...." WS-GBV-CHANGE.
181800210928           IF SWITCH-IN-TRANSACTION
181900210928              ADD WS-GBV-CHANGE TO WS-CURR-CONTRACT-GBV-BEF
182000210928                  GIVING WS-CURR-CONTRACT-GBV-AFT
182100210928      *       ADD WS-NDV-CHANGE TO WS-CURR-CONTRACT-NDV-BEF
182200210928      *           GIVING WS-CURR-CONTRACT-NDV-AFT
182300210928           ELSE
182400210928              SUBTRACT WS-GBV-CHANGE FROM WS-CURR-CONTRACT-GBV-BEF
182500210928                  GIVING WS-CURR-CONTRACT-GBV-AFT
182600210928      *       SUBTRACT WS-NDV-CHANGE FROM WS-CURR-CONTRACT-NDV-BEF
182700210928      *           GIVING WS-CURR-CONTRACT-NDV-AFT
182800210928           END-IF.
182900210928      *    DISPLAY "WS-CURR-CONTRACT-GBV-BEF....."
183000210928      *             WS-CURR-CONTRACT-GBV-BEF.
183100210928      *    DISPLAY "WS-CURR-CONTRACT-GBV-AFT...."
183200210928      *             WS-CURR-CONTRACT-GBV-AFT.
183300210928
183400210928       CNCG-EXIT.
183500210928           EXIT.
183600210928      /
183700210928       GET-NDV-GBV-CHANGE.
18380021092816512 * Get the fee charges for the out transaction.
18390021092816512      MOVE 0 TO WS-DEDUCTION-AMT.
18400021092816512      MOVE PLACEMENT-DATE OF TRANS-OFFSET
18410021092816512           TO WS-TRN-PLACEMENT-DATE.
18420021092816512      MOVE TRANS-NO       OF TRANS-OFFSET TO WS-TRN-TRANS-NO.
18430021092816512      MOVE PROCESS-DATE   OF TRANS-OFFSET TO WS-TRN-PROCESS-DATE.
18440021092816512      PERFORM GET-DEDUCTION-AMT THRU GDA-EXIT.
184500210928
184600210928           INITIALIZE MFATRCTGP OF TRANS-CONTRACT-TGT-REC.
184700210928           MOVE WS-CURR-TRANS-PLACEMENT-DATE
184800210928             TO PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET2.
184900210928           MOVE WS-CURR-TRANS-TRANS-NO
185000210928             TO TRANS-NO-2 OF TRANS-CONTRACT-TARGET2.
185100210928           MOVE CURR-CONTRACT-NO
185200210928             TO CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET2.
185300210928
185400210928           START TRANS-CONTRACT-TARGET2
185500210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
185600210928                 INVALID KEY
18570021092816512 *          GO TO GNGC-EXIT.
18580021092816512            GO TO GNGC-0500.
185900210928
186000210928       GNGC-0010.
186100210928           READ TRANS-CONTRACT-TARGET2 NEXT RECORD
186200210928                AT END
186300210928      *         GO TO GNGC-EXIT.
18640021092816512           GO TO GNGC-0500.
186500210928
186600210928           IF WS-CURR-TRANS-PLACEMENT-DATE NOT =
186700210928              PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET2 OR
186800210928              WS-CURR-TRANS-TRANS-NO NOT =
186900210928              TRANS-NO-2 OF TRANS-CONTRACT-TARGET2 OR
187000210928              CURR-CONTRACT-NO NOT =
187100210928              CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET2
187200210928      *       GO TO GNGC-EXIT
18730021092816512         GO TO GNGC-0500
187400210928           END-IF.
187500210928
187600210928           INITIALIZE MFATRCODP OF TRANS-CON-DTL-REC.
187700210928           MOVE PLACEMENT-DATE OF TRANS-CONTRACT-TARGET2
187800210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS.
187900210928           MOVE TRANS-NO OF TRANS-CONTRACT-TARGET2
188000210928             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
188100210928           MOVE CONTRACT-NO OF TRANS-CONTRACT-TARGET2
188200210928             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
188300210928
188400210928           READ TRANS-CONTRACT-DETAILS
188500210928                INVALID KEY
188600210928      *         GO TO GNGC-EXIT.
18870021092816512           GO TO GNGC-0500.
188800210928
188900210928           IF WS-DEDUCTION-AMT > 0
18900021092816512           GO TO GNGC-0020.
189100210928
189200210928           ADD NDV-CHANGE OF TRANS-CONTRACT-DETAILS
189300210928             TO WS-SWO-NDV-CHANGE.
189400210928           ADD GBV-CHANGE OF TRANS-CONTRACT-DETAILS
189500210928             TO WS-SWO-GBV-CHANGE.
189600210928
189700210928           GO TO GNGC-0010.
18980021092816512 * begin
189900210928
190000210928       GNGC-0020.
190100210928
190200210928           COMPUTE WS-OUT-TRANS-GROSS ROUNDED =
190300210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
190400210928                   UNIT-PRICE OF TRANS-OFFSET.
190500210928
190600210928      * Apply the deductions on the out-side of the transaction
190700210928           COMPUTE WS-DEDUCTION-PROP ROUNDED =
190800210928                   WS-OUT-TRANS-GROSS / GROSS-AMT OF TRANS-OFFSET
190900210928                   * WS-DEDUCTION-AMT.
191000210928
191100210928           COMPUTE WS-DEDUCTION-GBV-CHANGE ROUNDED =
191200210928                  WS-DEDUCTION-PROP *
191300210928                  GBV-CHANGE OF TRANS-CONTRACT-DETAILS  /
191400210928                  WS-OUT-TRANS-GROSS.
191500210928
191600210928           COMPUTE WS-SWO-GBV-CHANGE ROUNDED
191700210928                 = WS-SWO-GBV-CHANGE +
191800210928                   GBV-CHANGE OF TRANS-CONTRACT-DETAILS -
191900210928                   WS-DEDUCTION-GBV-CHANGE.
192000210928
192100210928           COMPUTE WS-DEDUCTION-NDV-CHANGE ROUNDED =
192200210928                  WS-DEDUCTION-PROP *
192300210928                  NDV-CHANGE OF TRANS-CONTRACT-DETAILS  /
192400210928                  WS-OUT-TRANS-GROSS.
192500210928
192600210928           COMPUTE WS-SWO-NDV-CHANGE ROUNDED
192700210928                 = WS-SWO-NDV-CHANGE +
192800210928                   NDV-CHANGE OF TRANS-CONTRACT-DETAILS -
192900210928                   WS-DEDUCTION-NDV-CHANGE.
193000210928
193100210928           GO TO GNGC-0010.
193200210928
193300210928       GNGC-0500.
19340021092816512 * Get the fee charges for the IN  transaction.
19350021092816512      MOVE 0 TO WS-DEDUCTION-AMT.
19360021092816512      MOVE PLACEMENT-DATE OF TRANS
19370021092816512           TO WS-TRN-PLACEMENT-DATE.
19380021092816512      MOVE TRANS-NO       OF TRANS        TO WS-TRN-TRANS-NO.
19390021092816512      MOVE PROCESS-DATE   OF TRANS        TO WS-TRN-PROCESS-DATE.
19400021092816512      PERFORM GET-DEDUCTION-AMT THRU GDA-EXIT.
19410021092816512
19420021092816512      IF WS-DEDUCTION-AMT <= 0
194300210928              GO TO GNGC-EXIT.
194400210928
194500210928           COMPUTE WS-IN-TRANS-GROSS ROUNDED =
194600210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R   *
194700210928                   UNIT-PRICE OF TRANS.
194800210928
194900210928           COMPUTE WS-DEDUCTION-PROP ROUNDED =
195000210928                   WS-IN-TRANS-GROSS / NET-AMT OF TRANS
195100210928                   * WS-DEDUCTION-AMT.
195200210928
195300210928           COMPUTE WS-DEDUCTION-GBV-CHANGE ROUNDED =
195400210928                  WS-DEDUCTION-PROP * WS-SWO-GBV-CHANGE /
195500210928                  WS-IN-TRANS-GROSS.
195600210928
195700210928           COMPUTE WS-SWO-GBV-CHANGE ROUNDED
195800210928                 = WS-SWO-GBV-CHANGE -
195900210928                   WS-DEDUCTION-GBV-CHANGE.
196000210928
196100210928           COMPUTE WS-DEDUCTION-NDV-CHANGE ROUNDED =
196200210928                  WS-DEDUCTION-PROP * WS-SWO-NDV-CHANGE /
196300210928                  WS-IN-TRANS-GROSS.
196400210928
196500210928           COMPUTE WS-SWO-NDV-CHANGE ROUNDED
196600210928                 = WS-SWO-NDV-CHANGE -
196700210928                   WS-DEDUCTION-NDV-CHANGE.
196800210928       GNGC-EXIT.
196900210928           EXIT.
197000210928      /
197100210928       RECALC-NETDEP-GBV-VALUES.
197200210928
197300210928           IF WS-REJECTION-CODE NOT = " " AND "00"
197400210928              GO TO RNGV-EXIT
197500210928           END-IF.
197600210928
197700210928           INITIALIZE WS-CONT-INV-COUNT WS-INV-GBV-PERCENT-TOTAL
197800210928                                        WS-INV-NDV-PERCENT-TOTAL
197900210928R12702                                  WS-CONT-NDV-AFT-TOTAL
198000210928R12702                                  WS-CONT-GBV-AFT-TOTAL.
198100210928           SET CONTIDX TO 1.
198200210928           SET CONTIDX DOWN BY 1.
198300210928
198400210928       RNGV-NEXT.
198500210928           SET CONTIDX UP BY 1.
198501211007
198502211007111744     IF CONTIDX > WS-CONT-INV-ARRAY-COUNT
198503211007111744        GO TO RNGV-EXIT
198504211007111744     END-IF
198505211007
198600210928           IF WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
198700210928              IS EQUAL TO 0 OR
198800210928              WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
198900210928              IS EQUAL TO 0 OR
199000210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
199001211007              IS EQUAL TO " "  OR
199002211007111744        CONTIDX > WS-CONT-INV-ARRAY-COUNT
199200210928              GO TO RNGV-EXIT
199300210928           END-IF.
199400210928
199500210928       RNGV-PROCESS.
199600210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-REC.
199700210928           MOVE WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
199800210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
199900210928           MOVE WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
200000210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
200100210928           MOVE WS-ARRAY-INVESTMENT-CODE
200200210928             OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
200300210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
200400210928
200500210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
200600210928                INVALID KEY
200700210928                GO TO RNGV-NEXT.
200800210928
200900210928           ADD 1 TO WS-CONT-INV-COUNT.
201000210928
201100210928R11698*    IF SWITCH-IN AND WS-TRANSFER-GBV = "N"
201200210928           IF SWITCH-IN-TRANSACTION
201300210928R11698        IF WS-ARRAY-INVESTMENT-CODE(CONTIDX) =
201400210928R11698           CURR-INVESTMENT-CODE
201500210928R11698           ADD WS-GBV-CHANGE TO WS-ARRAY-BEFORE-GBV(CONTIDX)
201600210928R11698           MOVE WS-ARRAY-BEFORE-GBV(CONTIDX) TO WS-INV-GBV-AFT
201700210928R11698           GO TO RNGV-0010
201800210928R11698        ELSE
201900210928R11698           GO TO RNGV-NEXT
202000210928R11698        END-IF
202100210928R11698     END-IF.
202200210928
202300210928           IF PURCHASE-TRANSACTION AND WS-CURR-CONTRACT-GBV-BEF = 0
202400210928              MOVE WS-CURR-CONTRACT-MV-AFT TO WS-INV-GBV-AFT
202500210928           ELSE
202600210928R12387        IF WS-CURR-CONTRACT-MV-AFT NOT = 0
202700210928                 COMPUTE WS-INV-GBV-PERCENT ROUNDED =
202800210928                   WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
202900210928R12387        ELSE
203000210928R12387           MOVE 0 TO WS-INV-GBV-PERCENT
203100210928R12387        END-IF
203200210928
203300210928           ADD WS-INV-GBV-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
203400210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
203500210928              WS-INV-GBV-PERCENT-TOTAL NOT = 1.000 AND
203600210928              WS-INV-GBV-PERCENT-TOTAL NOT = 0
203700210928              SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
203800210928                       GIVING WS-DUMMY-PERCENT
203900210928              ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
204000210928R12454        ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
204100210928      *       ADD 0.01 TO WS-INV-GBV-PERCENT
204200210928XXXXX2     ELSE
204300210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
204400210928                (WS-INV-GBV-PERCENT-TOTAL = 0.999 OR
204500210928                 WS-INV-GBV-PERCENT-TOTAL > 1.000)
204600210928                 SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
204700210928                          GIVING WS-DUMMY-PERCENT
204800210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
204900210928R12454           ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
205000210928XXXXX2        END-IF
205100210928           END-IF
205200210928
205300210928           COMPUTE WS-INV-GBV-AFT ROUNDED =
205400210928                   WS-CURR-CONTRACT-GBV-AFT * WS-INV-GBV-PERCENT
205500210928           END-IF.
205600210928
205700210928      * FOR NDV
205800210928           IF PURCHASE-TRANSACTION AND WS-CURR-CONTRACT-NDV-BEF = 0
205900210928              MOVE WS-CURR-CONTRACT-MV-AFT TO WS-INV-NDV-AFT
206000210928           ELSE
206100210928R12387        IF WS-CURR-CONTRACT-MV-AFT NOT = 0
206200210928                 COMPUTE WS-INV-NDV-PERCENT ROUNDED =
206300210928                   WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
206400210928R12387        ELSE
206500210928R12387           MOVE 0 TO WS-INV-NDV-PERCENT
206600210928R12387        END-IF
206700210928
206800210928           ADD WS-INV-NDV-PERCENT TO WS-INV-NDV-PERCENT-TOTAL
206900210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
207000210928              WS-INV-NDV-PERCENT-TOTAL NOT = 1.000 AND
207100210928              WS-INV-NDV-PERCENT-TOTAL NOT = 0
207200210928              SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
207300210928                       GIVING WS-DUMMY-PERCENT
207400210928              ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
207500210928R12454        ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT-TOTAL
207600210928      *       ADD 0.01 TO WS-INV-NDV-PERCENT
207700210928XXXXX2     ELSE
207800210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
207900210928                (WS-INV-NDV-PERCENT-TOTAL = 0.999 OR
208000210928                 WS-INV-NDV-PERCENT-TOTAL > 1.000)
208100210928                 SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
208200210928                          GIVING WS-DUMMY-PERCENT
208300210928                 ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
208400210928R12454           ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT-TOTAL
208500210928XXXXX2        END-IF
208600210928           END-IF
208700210928
208800210928           COMPUTE WS-INV-NDV-AFT ROUNDED =
208900210928                   WS-CURR-CONTRACT-NDV-AFT * WS-INV-NDV-PERCENT
209000210928           END-IF.
209100210928
209200210928       RNGV-0010.
209300210928           IF WS-ARRAY-INV-CURR-CODE(CONTIDX) = UNITRAX-BASE-CURRENCY
209400210928              MOVE WS-INV-GBV-AFT TO WS-INV-GBV-AFT-CUR
209500210928              MOVE WS-INV-NDV-AFT TO WS-INV-NDV-AFT-CUR
209600210928           ELSE
209700210928              COMPUTE WS-INV-GBV-AFT-CUR ROUNDED =
209800210928                      WS-INV-GBV-AFT * WS-ARRAY-INV-EXCH-RATE(CONTIDX)
209900210928              COMPUTE WS-INV-NDV-AFT-CUR ROUNDED =
210000210928                      WS-INV-NDV-AFT * WS-ARRAY-INV-EXCH-RATE(CONTIDX)
210100210928           END-IF.
210200210928
210300210928           IF WS-INV-GBV-AFT IS NEGATIVE
210400210928              MOVE 0 TO WS-INV-GBV-AFT
210500210928                        WS-INV-GBV-AFT-CUR
210600210928           END-IF.
210700210928
210800210928           IF WS-INV-NDV-AFT IS NEGATIVE
210900210928              MOVE 0 TO WS-INV-NDV-AFT
211000210928                        WS-INV-NDV-AFT-CUR
211100210928           END-IF.
211200210928
211300210928      * Update the Old NDV and GBV only if the transaction pertains the
211400210928      * the right fund in the contract.
211500210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
211600210928              IS EQUAL TO CURR-INVESTMENT-CODE
211700210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
211800210928             TO OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
211900210928           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
212000210928             TO OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
212100210928           END-IF
212200210928
212300210928      ** Update the Trans-Contract-Details record
212400210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
212500210928              IS EQUAL TO CURR-INVESTMENT-CODE
212600210928              MOVE WS-INV-GBV-AFT
212700210928                TO GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-R2
212800210928              IF SWITCH-IN-TRANSACTION OR REDEMPTION-TRANSACTION
212900210928              MOVE WS-GBV-CHANGE
213000210928                TO GBV-CHANGE OF TRANS-CONTRACT-DTL-R2
213100210928              ELSE
213200210928              MOVE WS-INV-GBV-AFT-CUR
213300210928                TO GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DTL-R2
213400210928              END-IF
213500210928              REWRITE TRANS-CONT-DTL-R2-REC
213600210928           END-IF.
213700210928
213800210928           MOVE WS-INV-GBV-AFT
213900210928                TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
214000210928           MOVE WS-INV-GBV-AFT-CUR
214100210928                TO GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
214200210928
214300210928R12702     IF REDEMPTION-TRANSACTION
214400210928R12702        ADD WS-INV-GBV-AFT TO WS-CONT-GBV-AFT-TOTAL
214500210928R12702*       ADD WS-INV-NDV-AFT TO WS-CONT-NDV-AFT-TOTAL
214600210928R12702     END-IF.
214700210928
214800210928           REWRITE ACC-CON-INV-REC.
214900210928
215000210928           GO TO RNGV-NEXT.
215100210928
215200210928       RNGV-EXIT.
215300210928           EXIT.
215400210928      /
215500210928       CHECK-NDV-GBV-ROUNDING.
215600210928           IF PURCHASE-TRANSACTION
215700210928              GO TO CNGR-EXIT
215800210928           END-IF.
215900210928
216000210928           MOVE "N" TO WS-NDV-DIFF-FLAG
216100210928                       WS-GBV-DIFF-FLAG.
216200210928           MOVE 0   TO WS-NDV-DIFF-AMOUNT
216300210928                       WS-GBV-DIFF-AMOUNT.
216400210928           MOVE "Y" TO WS-NDV-UPDATE-FLAG
216500210928                       WS-GBV-UPDATE-FLAG.
216600210928
216700210928           IF WS-CURR-CONTRACT-GBV-AFT NOT = WS-CONT-GBV-AFT-TOTAL
216800210928              MOVE "Y" TO WS-GBV-DIFF-FLAG
216900210928              SUBTRACT WS-CONT-GBV-AFT-TOTAL
217000210928                  FROM WS-CURR-CONTRACT-GBV-AFT
217100210928                GIVING WS-GBV-DIFF-AMOUNT
217200210928           END-IF.
217300210928
217400210928           IF GBV-DIFFERENCE-FOUND
217500210928              GO TO CNGR-0010
217600210928           END-IF.
217700210928
217800210928           GO TO CNGR-EXIT.
217900210928
218000210928       CNGR-0010.
218100210928           INITIALIZE MFAACCCIP OF ACCOUNT-CONTRACT-INVEST.
218200210928           MOVE CURR-ACCOUNT-NO
218300210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST.
218400210928           MOVE CURR-CONTRACT-NO
218500210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST.
218600210928           MOVE SPACES TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST.
218700210928
218800210928           START ACCOUNT-CONTRACT-INVEST WITH NO LOCK
218900210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
219000210928                 INVALID KEY
219100210928                 GO TO CNGR-EXIT.
219200210928
219300210928       CNGR-0020.
219400210928           READ ACCOUNT-CONTRACT-INVEST NEXT RECORD WITH NO LOCK
219500210928                AT END
219600210928                GO TO CNGR-EXIT.
219700210928
219800210928           IF CURR-ACCOUNT-NO NOT =
219900210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST OR
220000210928              CURR-CONTRACT-NO NOT =
220100210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST
220200210928              GO TO CNGR-EXIT
220300210928           END-IF.
220400210928
220500210928           IF OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST = 0 OR
220600210928              CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST = 0
220700210928              GO TO CNGR-0020
220800210928           END-IF.
220900210928
221000210928           IF GBV-DIFFERENCE-FOUND AND
221100210928              GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST = 0
221200210928              GO TO CNGR-0020
221300210928           END-IF.
221400210928
221500210928           IF GBV-DIFFERENCE-FOUND AND GBV-NOT-UPDATED
221600210928              ADD WS-GBV-DIFF-AMOUNT
221700210928                  TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST
221800210928                     GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST
221900210928              MOVE "N" TO WS-GBV-UPDATE-FLAG
222000210928              REWRITE ACCT-CONT-INVEST-REC
222100210928                      INVALID KEY
222200210928                      MOVE "Y" TO WS-GBV-UPDATE-FLAG
222300210928              END-REWRITE
222400210928           END-IF.
222500210928
222600210928           IF (GBV-DIFFERENCE-FOUND AND GBV-NOT-UPDATED)
222700210928               GO TO CNGR-0020
222800210928           END-IF.
222900210928
223000210928       CNGR-EXIT.
223100210928           EXIT.
223200210928      /
223300210928       GET-INVESTMENT-MARKET-VALUE.
223400210928           INITIALIZE MFAINVUPP OF INVESTMENT-UNIT-PRICE.
223500210928
223600210928           MOVE WS-CONT-INVESTMENT-CODE
223700210928                TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE.
223800210928           MOVE WS-CURR-TRANS-TRADE-DATE
223900210928                TO TRADE-DATE OF INVESTMENT-UNIT-PRICE.
224000210928           MOVE "Y" TO DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE.
224100210928
224200210928           READ INVESTMENT-UNIT-PRICE
224300210928           INVALID KEY
224400210928           GO TO GIMV-0010.
224500210928
224600210928           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
224700210928                TO WS-INV-UNIT-PRICE.
224800210928
224900210928           MOVE "Y" TO WS-PRICE-FOUND.
225000210928
225100210928           GO TO GIMV-EXIT.
225200210928
225300210928       GIMV-0010.
225400210928           MOVE " " TO DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE.
225500210928           READ INVESTMENT-UNIT-PRICE
225600210928           INVALID KEY
225700210928           MOVE "N" TO WS-PRICE-FOUND
225800210928           GO TO GIMV-EXIT.
225900210928
226000210928           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
226100210928                TO WS-INV-UNIT-PRICE.
226200210928
226300210928           MOVE "Y" TO WS-PRICE-FOUND.
226400210928
226500210928       GIMV-EXIT.
226600210928           EXIT.
226700210928      /
226800210928R11622 GET-LAST-UNIT-PRICE.
226900210928R11622     MOVE "N" TO WS-PRICE-FOUND.
227000210928R11622
227100210928R11622     INITIALIZE MFAINVUPP OF INVESTMENT-LAST-PRICE-REC.
227200210928R11622     MOVE WS-CONT-INVESTMENT-CODE
227300210928R11622       TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-LAST.
227400210928R11622     MOVE WS-CURR-TRANS-TRADE-DATE
227500210928R11622       TO TRADE-DATE OF INVESTMENT-UNIT-PRICE-LAST.
227600210928R11622
227700210928R11622     START INVESTMENT-UNIT-PRICE-LAST
227800210928R11622           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
227900210928R11622           INVALID KEY
228000210928R11622           GO TO GLUP-EXIT.
228100210928R11622
228200210928R11622 GLUP-0010.
228300210928R11622     READ INVESTMENT-UNIT-PRICE-LAST PRIOR RECORD
228400210928R11622          AT END
228500210928R11622          GO TO GLUP-EXIT.
228600210928R11622
228700210928R11622     IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-LAST NOT =
228800210928R11622        WS-CONT-INVESTMENT-CODE
228900210928R11622        GO TO GLUP-EXIT
229000210928R11622     END-IF.
229100210928R11622
229200210928R11622     IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE-LAST NOT = " "
229300210928R11622        GO TO GLUP-0010
229400210928R11622     END-IF.
229500210928R11622
229600210928R11622     MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE-LAST
229700210928R11622       TO WS-INV-UNIT-PRICE.
229800210928R11622
229900210928R11622     MOVE "Y" TO WS-PRICE-FOUND.
230000210928R11622
230100210928R11622 GLUP-EXIT.
230200210928R11622     EXIT.
230300210928      /
230400210928       GET-INVESTMENT-CURRENCY.
230500210928           MOVE CURR-INVESTMENT-CODE
230600210928             TO INVESTMENT-CODE OF INVESTMENT.
230700210928
230800210928           READ INVESTMENT.
230900210928
231000210928XXXXXX     MOVE LOAD-STRUCTURE OF INVESTMENT TO WS-LOAD-STRUCTURE.
231100210928
231200210928       GIC-EXIT.
231300210928           EXIT.
231400210928      /
231500210928       GET-EXCHANGE-RATE-2.
231600210928
231700210928           IF WS-DIFF-INVESTMENT-FLAG = "Y"
231800210928              GO TO GER2-0010.
231900210928
232000210928           INITIALIZE MFATREXRP OF TRANS-EXCHANGE-RATE-2-REC.
232100210928           MOVE WS-EXCH-PLACEMENT-DATE
232200210928                             TO PLACEMENT-DATE
232300210928                             OF TRANS-EXCHANGE-RATE-2.
232400210928           MOVE WS-EXCH-TRANS-NO
232500210928                             TO TRANS-NO
232600210928                             OF TRANS-EXCHANGE-RATE-2.
232700210928
232800210928           READ TRANS-EXCHANGE-RATE-2
232900210928           INVALID KEY
233000210928           GO TO GER2-0010.
233100210928
233200210928           IF CURRENCY-DDS OF TRANS-EXCHANGE-RATE-2 NOT =
233300210928              WS-EXCH-CURRENCY
233400210928             GO TO GER2-0010
233500210928           END-IF.
233600210928
233700210928           IF EXCHANGE-RATE OF TRANS-EXCHANGE-RATE-2 = 0
233800210928              GO TO GER2-0010
233900210928           END-IF.
234000210928
234100210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
234200210928           MOVE EXCHANGE-RATE OF TRANS-EXCHANGE-RATE-2
234300210928                             TO WS-EXCH-RATE-VALUE.
234400210928           GO TO GER2-EXIT.
234500210928
234600210928       GER2-0010.
234700210928
234800210928           INITIALIZE MFAEXRHMP OF EXCHANGE-RATE-M-2.
234900210928           MOVE WS-EXCH-TRADE-DATE
235000210928                             TO TRADE-DATE OF EXCHANGE-RATE-M-2.
235100210928           MOVE WS-EXCH-CURRENCY
235200210928                             TO CURRENCY-DDS OF EXCHANGE-RATE-M-2.
235300210928           MOVE PROG-EXCHANGE-RATE-TYPE
235400210928                             TO EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M-2.
235500210928
235600210928           READ EXCHANGE-RATE-M-2
235700210928           INVALID KEY
235800210928             GO TO GER2-EXIT.
235900210928
236000210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
236100210928           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-2
236200210928                             TO WS-EXCH-RATE-VALUE.
236300210928
236400210928       GER2-EXIT.
236500210928           EXIT.
236600210928      /
236700210928       CHECK-IF-EXCLUDE-TRANSACTION.
236800210928           INITIALIZE MFAACCNTP OF ACCOUNT-REC.
236900210928           MOVE WS-EX-ACCOUNT-NO TO ACCOUNT-NO OF ACCOUNT
237000210928                                    ACCOUNT-NO OF ACCOUNT-NOMINEE.
237100210928
237200210928           READ ACCOUNT
237300210928                INVALID KEY
237400210928                MOVE " " TO WS-EX-ACCOUNT-TYPE
237500210928                GO TO CIET-0010.
237600210928
237700210928           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT TO WS-EX-ACCOUNT-TYPE.
237800210928
237900210928       CIET-0010.
238000210928           INITIALIZE MFAACCNMP OF ACCOUNT-NOMINEE-REC.
238100210928
238200210928           READ ACCOUNT-NOMINEE
238300210928                INVALID KEY
238400210928                MOVE " " TO WS-EX-NOM-ACCOUNT-TYPE
238500210928                GO TO CIET-0020.
238600210928
238700210928           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE
238800210928             TO WS-EX-NOM-ACCOUNT-TYPE.
238900210928
239000210928       CIET-0020.
239100210928           INITIALIZE MFAEXTRNP OF EXCLUDE-TRANS-REC.
239200210928           MOVE WS-EX-ACCOUNT-TYPE
239300210928             TO ACCOUNT-TYPE-CODE OF EXCLUDE-TRANS.
239400210928           MOVE WS-EX-NOM-ACCOUNT-TYPE
239500210928             TO NOMINEE-ACCOUNT-TYPE OF EXCLUDE-TRANS.
239600210928           MOVE WS-EX-TRANS-TYPE
239700210928             TO TRANS-TYPE-CODE OF EXCLUDE-TRANS.
239800210928           MOVE WS-EX-TRANS-ORIGIN
239900210928             TO TRANS-ORIGIN-CODE OF EXCLUDE-TRANS.
240000210928           MOVE WS-EX-REVERSAL-CODE
240100210928             TO REVERSAL-CODE OF EXCLUDE-TRANS.
240200210928110904     MOVE spaces
240300210928110904       TO INVESTMENT-STRUCTURE-CODE OF EXCLUDE-TRANS.
240400210928180708     PERFORM READ-TRANSMISC.
240500210928
240600210928           READ EXCLUDE-TRANS
240700210928                INVALID KEY
240800210928      * RFS 110904 - START
240900210928            If Guar-Benefit-Eligible = "Y"
241000210928            PERFORM GET-INVESTMENT-STRUCTURE-CODE
241100210928                         THRU GIS-EXIT
241200210928                  IF lc_InvStructureCode = SPACE
241300210928                     GO TO CIET-EXIT
241400210928                  ELSE
241500210928                     MOVE lc_InvStructureCode TO
241600210928                          INVESTMENT-STRUCTURE-CODE OF
241700210928                          EXCLUDE-TRANS-REC
241800210928                     READ EXCLUDE-TRANS
241900210928                          INVALID KEY
242000210928                          GO TO CIET-EXIT
242100210928                     END-READ
242200210928                  END-IF
242300210928             ELSE
242400210928               GO TO CIET-EXIT
242500210928             END-IF
242600210928      * RFS 110904 - END
242700210928           END-READ.
242800210928
242900210928      * RFS 20516 - Start
243000210928           MOVE "Y" TO WS-EXCLUDE-TRANS.
243100210928
243200210928      **   IF ACCOUNT-ATTRIBUTE-CODE OF EXCLUDE-TRANS = " "
243300210928      **      MOVE "Y" TO WS-EXCLUDE-TRANS
243400210928      **      GO TO CIET-EXIT
243500210928      **   END-IF.
243600210928
243700210928      **   INITIALIZE MFAACCATP OF ACCOUNT-ATTRIBUTES-REC.
243800210928      **   MOVE WS-EX-ACCOUNT-NO
243900210928      **     TO ACCOUNT-NO OF ACCOUNT-ATTRIBUTES.
244000210928      **   MOVE ACCOUNT-ATTRIBUTE-CODE OF EXCLUDE-TRANS
244100210928      **     TO ACCOUNT-ATTRIBUTE-CODE OF ACCOUNT-ATTRIBUTES.
244200210928
244300210928      **   READ ACCOUNT-ATTRIBUTES
244400210928      **        INVALID KEY
244500210928      **        MOVE "Y" TO WS-EXCLUDE-TRANS
244600210928      **        GO TO CIET-EXIT.
244700210928      * RFS 20516 - End
244800210928
244900210928       CIET-EXIT.
245000210928           EXIT.
245100210928      /
245200210928      * RFS 110904 - START
245300210928       GET-INVESTMENT-STRUCTURE-CODE.
245400210928
245500210928             MOVE SPACES TO lc_InvStructureCode
245600210928             INITIALIZE MFAINVSXP OF INV-STRU-XREF-REC.
245700210928             MOVE CURR-INVESTMENT-CODE TO
245800210928                  INVESTMENT-CODE OF INV-STRU-XREF-REC.
245900210928             MOVE LOW-VALUES TO INVESTMENT-STRUCTURE-CODE OF
246000210928                  INV-STRU-XREF-REC.
246100210928             START INVESTMENT-STRUCTURE-XREF
246200210928             KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
246300210928                INVALID KEY
246400210928             MOVE SPACES TO CURR-INVESTMENT-CODE
246500210928             NOT INVALID
246600210928127401       PERFORM GET-SETPOL-INV-STRUCTURE
246700210928127401         UNTIL LC_INVSTRUCTURECODE NOT = SPACES
246800210928127401       If lc_InvStructureCode = HIGH-VALUES
246900210928127401          MOVE Spaces to lc_InvStructureCode
247000210928127401       End-If.
247100210928127401**     READ INVESTMENT-STRUCTURE-XREF NEXT RECORD
247200210928127401**     AT END
247300210928127401**     MOVE SPACES TO lc_InvStructureCode
247400210928127401**     NOT AT END
247500210928127401**     IF (CURR-INVESTMENT-CODE NOT =
247600210928127401**         INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF)
247700210928127401**         MOVE SPACES TO lc_InvStructureCode
247800210928127401**     ELSE
247900210928127401**         MOVE INVESTMENT-STRUCTURE-CODE OF
248000210928127401**              INV-STRU-XREF-REC TO
248100210928127401**              lc_InvStructureCode
248200210928127401**     END-IF
248300210928127401**     END-READ.
248400210928
248500210928       GIS-EXIT.
248600210928           EXIT.
248700210928
248800210928127401  GET-SETPOL-INV-STRUCTURE.
248900210928
249000210928127401     READ INVESTMENT-STRUCTURE-XREF NEXT RECORD
249100210928127401     AT END
249200210928127401     MOVE HIGH-VALUES to lc_InvStructureCode
249300210928127401     NOT AT END
249400210928127401     IF (CURR-INVESTMENT-CODE NOT =
249500210928127401         INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF)
249600210928127401         MOVE HIGH-VALUES to lc_InvStructureCode
249700210928127401     ELSE
249800210928127401         MOVE INVESTMENT-STRUCTURE-CODE OF
249900210928127401              INV-STRU-XREF-REC TO
250000210928127401              LC_INVSTRUCTURECODE
250100210928127401         Move 0 to li_Count
250200210928127401         EXEC SQL
250300210928127401          Select coun(1)
250400210928127401            into :li_count
250500210928127401          From MFAFNCTP
250600210928127401          where Investment_Structure_Code = :LC_INVSTRUCTURECODE
250700210928127401            and FUNCTION_CODE          = "SETPOL"
250800210928127401         END-EXEC
250900210928127401         If li_Count = 0
251000210928127401            Move Spaces to LC_INVSTRUCTURECODE
251100210928127401         End-If
251200210928127401     END-IF
251300210928127401     END-READ.
251400210928
251500210928      * RFS 110904 - END
251600210928
251700210928       LOG-ERROR.
251800210928           INITIALIZE MFACTERRP OF CONTRACT-ERROR-LOG.
251900210928
252000210928           IF COMM-REJECTION-CODE = SPACES OR "00"
252100210928             MOVE WS-REJECTION-CODE TO COMM-REJECTION-CODE
252200210928           END-IF.
252300210928
252400210928           ACCEPT WS-SYSTIME-LONG FROM TIME.
252500210928           CALL "GETDAT" USING WS-SYSDATE-N.
252600210928
252700210928           INITIALIZE MFAACCNTP OF ACCOUNT-REC.
252800210928           MOVE COMM-ACCOUNT-NO TO ACCOUNT-NO OF ACCOUNT.
252900210928           READ ACCOUNT
253000210928                INVALID KEY
253100210928                MOVE 0 TO INVESTOR-NO OF ACCOUNT
253200210928           END-READ.
253300210928
253400210928           MOVE WS-REJECTION-CODE
253500210928                             TO REJECTION-CODE OF CONTRACT-ERROR-LOG.
253600210928           MOVE INVESTOR-NO  OF ACCOUNT
253700210928                             TO INVESTOR-NO OF CONTRACT-ERROR-LOG.
253800210928           MOVE ACCOUNT-NO   OF ACCOUNT-CONTRACT-INV-RESET
253900210928                             TO ACCOUNT-NO OF CONTRACT-ERROR-LOG.
254000210928
254100210928           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-INV-RESET
254200210928                             TO CONTRACT-NO OF CONTRACT-ERROR-LOG.
254300210928           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
254400210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG.
254500210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
254600210928                             TO INVESTMENT-CODE
254700210928                             OF CONTRACT-ERROR-LOG.
254800210928
254900210928           MOVE COMM-CALLER-ID-CODE TO CALLER-ID-CODE
255000210928                             OF CONTRACT-ERROR-LOG.
255100210928           MOVE PROG-ID-CODE TO PROGRAM-ID-CODE
255200210928                             OF CONTRACT-ERROR-LOG.
255300210928           MOVE COMM-USER    TO AUDIT-USER OF CONTRACT-ERROR-LOG.
255400210928
255500210928           MOVE WS-MISC-INFO-AREA
255600210928                             TO MISC-INFO OF CONTRACT-ERROR-LOG.
255700210928           MOVE WS-SYSDATE-N TO AUDIT-DATE OF CONTRACT-ERROR-LOG.
255800210928           MOVE WS-SYSTIME-LONG-N
255900210928                             TO LOG-TIME OF CONTRACT-ERROR-LOG.
256000210928
256100210928           WRITE CONT-ERR-LOG-REC.
256200210928
256300210928           MOVE SPACES         TO WS-MISC-INFO-AREA.
256400210928
256500210928       LER-EXIT.
256600210928           EXIT.
256700210928      /
256800210928       INITIAL-LOGIC.
256900210928
257000210928           MOVE SPACES       TO COMM-REJECTION-CODE.
257100210928           MOVE LOW-VALUES   TO CURR-CONTROLS
257200210928                                PREV-CONTROLS.
257300210928
257400210928           IF COMM-OPEN-FILES NOT = "Y" AND
257500210928              OPEN-FILES-ONCE NOT = "Y"
257600210928             GO TO INL-0010
257700210928           END-IF.
257800210928
257900210928           OPEN INPUT  INVESTMENT-UNIT-PRICE
258000210928                       BUSINESS-DAYS
258100210928                       ACCOUNT
258200210928                       INVESTMENT
258300210928      *                ACCOUNT-CONTRACT-RESET-R
258400210928                       PROGRAM-EXCHANGE-RATE
258500210928                       EXCHANGE-RATE-M-2
258600210928                       CURRENCY-CODE
258700210928                       ACCOUNT-CONTRACT-INVEST-SWI
258800210928                       ACCOUNT-CONTRACT-INVEST-R
258900210928                       ACCOUNT-CONTRACT
259000210928                       ACCOUNT-CONTRACT-RESET
259100210928                       ACCOUNT-CONTRACT-INV-RESET
259200210928                       TRANS-EXCHANGE-RATE-2
259300210928                       TRANS-R
259400210928                       TRANS
259500210928                       TRANS-GBV
259600210928                       TRANS-CONTRACT-DTL-R
259700210928      *                TRANS-DAILY-PROC-SEQ
259800210928RF8092                 ACCOUNT-NOMINEE
259900210928      * RFS 20516 - Start
260000210928RF8092**               ACCOUNT-ATTRIBUTES
260100210928      * RFS 20516 - End
260200210928RF8092                 EXCLUDE-TRANS
260300210928R11622                 INVESTMENT-UNIT-PRICE-LAST
260400210928R11698                 TRANS-TARGET
260500210928R11698*                TRANS-TARGET-2
260600210928R11698                 TRANS-OFFSET
260700210928R11698*                SEG-TRANSFER-OPTIONS
260800210928R11698                 TRANS-CONTRACT-DETAILS
260900210928R13394                 TRANS-GBV-TRANSFER
261000210928R13306                 SEG-SWITCH-TRF-OPT
261100210928R13306                 TRANS-CONTRACT-TARGET2
26120021092816512                  TRANS-CHARGES
26130021092816512                  TRANS-SEG-DEDUCTION-CODES
261400210928110904                 INVESTMENT-STRUCTURE-XREF
261500210928180708                 TRANS-MISC-DETAILS
261600210928180708                 TRANS-REDEM-DETAILS
261700210928                 I-O   ACCOUNT-CONTRACT-INVESTMENT
261800210928                       TRANS-CONTRACT-DTL-R2
261900210928R12702                 ACCOUNT-CONTRACT-INVEST
262000210928                       CONTRACT-ERROR-LOG.
262100210928
262200210928           MOVE "N"          TO OPEN-FILES-ONCE.
262300210928
262400210928       INL-0010.
262500210928
262600210928           IF UNITRAX-BASE-CURRENCY   NOT = SPACES AND
262700210928              PROG-EXCHANGE-RATE-TYPE NOT = SPACES
262800210928             GO TO INL-EXIT
262900210928           END-IF.
263000210928
263100210928           PERFORM GET-BASE-CURRENCY
263200210928                             THRU GBC-EXIT.
263300210928
263400210928           PERFORM GET-EXCHANGE-RATE-TYPE
263500210928                             THRU GERT-EXIT.
263600210928
263700210928       INL-EXIT.
263800210928           EXIT.
263900210928      /
264000210928       GET-BASE-CURRENCY.
264100210928           MOVE LOW-VALUES   TO CURRENCY-DDS OF CURRENCY-CODE.
264200210928
264300210928           START CURRENCY-CODE
264400210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
264500210928           INVALID KEY
264600210928             MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
264700210928             GO TO GBC-EXIT.
264800210928
264900210928       GBC-0010.
265000210928
265100210928           READ CURRENCY-CODE NEXT RECORD
265200210928             AT END
265300210928             MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
265400210928             GO TO GBC-EXIT.
265500210928
265600210928           IF BASE-CURRENCY  OF CURRENCY-CODE NOT = "Y"
265700210928             GO TO GBC-0010.
265800210928
265900210928           MOVE CURRENCY-DDS OF CURRENCY-CODE
266000210928                             TO UNITRAX-BASE-CURRENCY.
266100210928
266200210928       GBC-EXIT.
266300210928           EXIT.
266400210928      /
266500210928       GET-EXCHANGE-RATE-TYPE.
266600210928
266700210928           MOVE "SEGCALCV"   TO PROGRAM-CODE
266800210928                             OF PROGRAM-EXCHANGE-RATE.
266900210928           MOVE "DEFAULT"    TO PROGRAM-ACTION
267000210928                             OF PROGRAM-EXCHANGE-RATE.
267100210928
267200210928           READ PROGRAM-EXCHANGE-RATE
267300210928           INVALID KEY
267400210928             MOVE "06"       TO COMM-REJECTION-CODE
267500210928             MOVE HIGH-VALUES TO CURR-CONTROLS
267600210928             GO TO GERT-EXIT.
267700210928
267800210928           MOVE EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
267900210928                             TO PROG-EXCHANGE-RATE-TYPE.
268000210928
268100210928       GERT-EXIT.
268200210928           EXIT.
268300210928
268400210928       END-JOB.
268500210928
268600210928      * RFS49699 - Begin
268700210928
268800210928           MOVE "LOGARR"               to Pass-Screen-Code.
268900210928           MOVE "LOGARR"               to Pass-Edit-Code.
269000210928           MOVE "N"                    to Pass-Level-Code.
269100210928
269200210928           call "FXSCEDTAL1" using Pass-Screen-Code
269300210928                                   Pass-Edit-Code
269400210928                                   Pass-Level-Code
269500210928                                   Retn-Edit-Allowed-Flag.
269600210928
269700210928           cancel  "FXSCEDTAL1".
269800210928
269900210928           IF Retn-Edit-Allowed
270000210928               PERFORM ARRAY-LOGGING     THRU ARL-EXIT
270100210928           END-IF.
270200210928
270300210928      * RFS49699 - End
270400210928
270500210928           IF SQL-FILE-NOT-OPEN
270600210928              GO TO EOJ-EXIT
270700210928           END-IF.
270800210928
270900210928           EXEC SQL
271000210928                CLOSE SEGEXTSQ
271100210928           END-EXEC.
271200210928
271300210928      *    CLOSE       ACCOUNT-CONTRACT
271400210928      *                ACCOUNT-CONTRACT-INVESTMENT
271500210928      *                ACCOUNT-CONTRACT-RESET
271600210928      *                ACCOUNT-CONTRACT-RESET-R
271700210928      *                ACCOUNT-CONTRACT-INV-RESET
271800210928      *                ACCOUNT
271900210928      *                INVESTMENT
272000210928      *                INVESTMENT-UNIT-PRICE
272100210928      *                PROGRAM-EXCHANGE-RATE
272200210928      *                EXCHANGE-RATE-M
272300210928      *                CURRENCY-CODE
272400210928      *                CONTRACT-ERROR-LOG.
272500210928
272600210928       EOJ-EXIT.
272700210928           EXIT.
272800210928
272900210928      * RFS49699 - Begin call array logging if on!
273000210928
273100210928       ARRAY-LOGGING.
273200210928
273300210928           MOVE "SEGRVSCLCP"           TO  pp-Program-Name.
273400210928
273500210928           MOVE WS-ARRAY1-NAME         TO  pp-Array-Name.
273600210928           SET  WS-ARR-ACCCRP          TO  TRUE.
273700210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
273800210928           MOVE WS-ARRAY1-MAX          TO  pp-Max-Size.
273900210928           MOVE WS-ARRAY1-MAX-USED     TO  pp-Max-Size-Used.
274000210928           MOVE SPACES                 TO  rp-Err-Flag.
274100210928
274200210928           CALL "FXLOGAU"      using PR-FXLOGAU.
274300210928
274400210928           MOVE WS-ARRAY2-NAME         TO  pp-Array-Name.
274500210928           SET  WS-ARR-ACCCIP          TO  TRUE.
274600210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
274700210928           MOVE WS-ARRAY2-MAX          TO  pp-Max-Size.
274800210928           MOVE WS-ARRAY2-MAX-USED     TO  pp-Max-Size-Used.
274900210928           MOVE SPACES                 TO  rp-Err-Flag.
275000210928
275100210928           CALL "FXLOGAU"      using PR-FXLOGAU.
275200210928
275300210928           CANCEL  "FXLOGAU".
275400210928
275500210928       ARL-EXIT.
275600210928           EXIT.
275700210928
275800210928      * RFS49699 - End
275900210928
276000210928      *COPY CPYSEGRTNE.
276100210928       COPY CPYSEGRTNC.
27620021092816512  COPY CPYTRNDAMT.
276300210928      * ---------------------------------
276400210928       VCA-GET-NEXT-BUSINESS-DATE.
276500210928      * ---------------------------------
276600210928           MOVE COMM-EFFECT-DATE     TO
276700210928                                 BUSINESS-DAY OF BUSINESS-DAYS.
276800210928
276900210928           START BUSINESS-DAYS
277000210928             KEY IS GREATER THAN EXTERNALLY-DESCRIBED-KEY
277100210928               INVALID KEY
277200210928                 CONTINUE
277300210928               NOT INVALID KEY
277400210928                 SET SW01-STS-OK     TO TRUE
277500210928                 PERFORM VCAA-NEXT-BUSINESS-DATE
277600210928                                           UNTIL NOT SW01-STS-OK
277700210928           END-START.
277800210928      * ---------------------------------
277900210928       VCAA-NEXT-BUSINESS-DATE.                                         RFS8712
278000210928      * ---------------------------------
278100210928            READ BUSINESS-DAYS NEXT RECORD
278200210928              AT END
278300210928                  SET SW01-STS-END                        TO TRUE
278400210928              NOT AT END
278500210928                  IF ALLOW-TRADING OF BUSINESS-DAYS = "Y"
278600210928                      MOVE BUSINESS-DAY OF BUSINESS-DAYS  TO
278700210928                                           WS-NEXT-PROCESS-DATE
278800210928                      SET SW01-STS-FOUND                  TO TRUE
278900210928                  END-IF
279000210928            END-READ.
279100210928      * ---------------------------------
279200210928      * ---------------------------------
279300210928
279400210928      * RFS180708 - Starts
279500210928
279600210928       READ-TRANSMISC.
279700210928
279800210928               MOVE SPACES           TO TRANS-SUB-TYPE OF
279900210928                                        EXCLUDE-TRANS.
280000210928               INITIALIZE MFATRNMSCP OF TRANS-MISC-DETAILS-REC.
280100210928               MOVE WS-PLACEMENTDATE TO PLACEMENT-DATE OF
280200210928                                        TRANS-MISC-DETAILS.
280300210928               MOVE WS-TRANSNO       TO TRANS-NO OF
280400210928                                        TRANS-MISC-DETAILS.
280500210928               READ TRANS-MISC-DETAILS
280600210928               INVALID KEY
280700210928                  MOVE SPACES        TO TRANS-SUB-TYPE OF EXCLUDE-TRANS
280800210928               NOT INVALID KEY
280900210928                  MOVE TRANS-SUB-TYPE OF TRANS-MISC-DETAILS TO
281000210928                       TRANS-SUB-TYPE OF EXCLUDE-TRANS
281100210928               END-READ.
281200210928
281300210928          READ-TRANSMISC-EXIT.
281400210928                    EXIT.
281500210928
281600210928      * RFS180708 - End
