000100210928      * %ATTR COMMIT(*NONE) COMPILEOPT('ACTGRP(*CALLER)')
000200210928      * %ATTR CLOSQLCSR(*ENDACTGRP)
000300210928       IDENTIFICATION DIVISION.
000400210928       PROGRAM-ID.    SEGRECALGD.
000500210928       AUTHOR.        FATEMA HAJI.
000600210928       INSTALLATION.  UNISEN INC.
000700210928       DATE-WRITTEN.  JANUARY 2004.
000800210928       DATE-COMPILED.
000900210928      *******************************************************************
001000210928      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
001100210928      *******************************************************************
001200210928      *Fatema Haji * 2004/01/26   * RFS 17973 - created the program
001300210928      *Daisy Ly    * 2004/07/08   * RFS 23118 - recompile for copy
001400210928      *            *              * book change CPYSEGRTNC
001500210928      *Fatema Haji * 2004/10/25   * RFS 24316 - Removed the duplicate
001600210928      *            *              * procedure GET-GDV-CHANGE. It was
001700210928      *            *              * causing JOBGBVRCAL to fail.
001800210928      * ESIN A.    *  2007/03/09  * RFS 40576 - RECOMPILE ONLY.
001900210928      * Raymond Mui*  2007/11/23  * RFS 45845 - RECOMPILE ONLY.
002000210928      * Ade Adeyemi*  2008/01/22  * RFS42749 Exclude DISTR-FLAG =  S
002100210928      * Bojana J.  *  2008/05/06  * RFS 51776 - Recompile.
002200210928      * Bojana J.  *  2008/05/14  * RFS 47405 - Include CPGLWBRULE copy book.
002300210928      * Daniel M.  *  2008/05/23  * RFS 47405 - Include CPGLWBCKTT copy book.
002400210928      * Daniel M.  *  2008/06/19  * RFS 46707 - Recompile changes to CPGLWBRULE.
002500210928      * Sanjeev P. *  2008/06/25  * RFS 48640 - Recompile only.
002600210928      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
002700210928      * Sanjeev P  *  2008/12/09  * RFS49898 - New DMD Maturity Option.
002800210928      * Bojana J.  *  2009/05/27  * RFS 57388 - Recompile (MFAACCCRP).
002900210928      * Pawel A    *  2010/07/30  * RFS84063 - Recompile (CPEXCLTRN)
003000210928      * Emman. Yala*  2011/02/23  * RFS91599 - RECOMPILE (MFAACCCRP)80605
003100210928      *            *              * Replaced Implicit Join by Inner Join
003200210928      * THILAGA K. *  2011/04/11  * RFS 63488 - GLWB AND GDV Resets.
003300210928      *            *              * Change in Cursor SEGEXTSQ.
003400210928      * THILAGA K  * 2012/08/13   * RFS107585- ADDED VAR LC-TRANSFERGDV
003500210928      * Ambikapathy* 2012/12/14   * RFS112135 - Recompile for MFASGSTOP
003600210928      * ABHISEK M  * 2013/04/01   * RFS120002 - Recompile for MFATRACXP
003700210928      * PREMIL K   * 2013/07/12   * RFS110904 - PREFORM GDV RESET AND
003800210928      *                           * REVERSE RESET.
003900210928      * ANDY CHAN  * 2013/08/29   * RFS127401 - RECOMPILE DUE TO CPYEXCLTRN
004000210928      * THILAGA K   * 2014/01/21 * RFS133150 - RECOMPILE FOR MFATRCODP
004100210928      * ARTHY K     * 2014/04/03 * RFS134936 - RECOMPILE FOR MFAACCONP
004200210928      * MANJUSHA V * 2014/04/01  * RFS129902 - RECOMPILE FOR CPGLWBRULE
004300210928      * KAMAL T    * 2014/06/17  * RFS118472 - RECOMPILE FOR CPGLWBRULE
004400210928      * KAMAL T    * 2014/06/17  * RFS136634 - RECOMPILE
004500210928      * NAGAMNAI S * 2014/08/13  * RFS139007 - RECOMPILE FOR CPGLWBRULE
004600210928      * DIGVIJAY   *  2016/12/28  * RFS 165027 - OPTIMIZATION OF
004700210928      *            *              * RUNTIME - CHANGING COMPILER OPTION
004800210928      *            *              * AND COMMENTING CANCEL             ***
004900210928      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
005000210928      * CHAYA SP   * 2020/06/30   * RFS185172 - Recompile for MFAACCONP
005100210928      * Vignesh    *  2020/06/25  * RFS183812 - Recompile for MFASGSTOP
005200210928      * VIGNESH    * 2020/07/15   * RFS185171 -Recompile for MFAEXTRNP
005300210928      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
005400210928      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
005500210928      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
005600210928      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
005700210928      * Kavin      * 2020/01/05   * RFS180708 - Added MFATRNMSCP file
005800210928      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
005801211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
005802211007      *            *              * Array from 100 to 1000
005803211007      *            *              * Tagged as 111744
005900210928      *****************************************************************
006000210928      *===============================================================*
006100210928      * Important: IMPORTANT TO ALL PROGRAMMERS
006200210928      *
006300210928      * If any programmer creates, changes or deletes an array in this
006400210928      * programs please add the logic to support the array logging process!
006500210928      *
006600210928      * View the WS-ARRAY-LOG-MISC variables and the code associated with
006700210928      * RFS49699.
006800210928      *
006900210928      * This change is for audit purposes, it logs the
007000210928      * name of the array, max size, size used. At the end of
007100210928      * this program the array information is passed to FXLOGUA pgm,
007200210928      * which write this information to the MFALOGAUP array audit file!
007300210928      *
007400210928      *===============================================================*
007500210928       ENVIRONMENT DIVISION.
007600210928       CONFIGURATION SECTION.
007700210928       SOURCE-COMPUTER. IBM-AS400.
007800210928       OBJECT-COMPUTER. IBM-AS400.
007900210928       SPECIAL-NAMES.
008000210928           LOCAL-DATA IS WS-LOCAL.
008100210928      /
008200210928       INPUT-OUTPUT SECTION.
008300210928       FILE-CONTROL.
008400210928
008500210928           SELECT  ACCOUNT-CONTRACT-INVESTMENT
008600210928                   ASSIGN TO DATABASE-MFAACCCIP
008700210928                   ORGANIZATION IS INDEXED
008800210928                   ACCESS IS DYNAMIC
008900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009000210928
009100210928           SELECT  ACCOUNT-CONTRACT-INVEST-SWI
009200210928                   ASSIGN TO DATABASE-MFAACCCIP
009300210928                   ORGANIZATION IS INDEXED
009400210928                   ACCESS IS DYNAMIC
009500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009600210928
009700210928           SELECT  ACCOUNT-CONTRACT-INVEST-R
009800210928                   ASSIGN TO DATABASE-MFAACCCIP
009900210928                   ORGANIZATION IS INDEXED
010000210928                   ACCESS IS DYNAMIC
010100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010200210928
010300210928           SELECT  ACCOUNT-CONTRACT-RESET
010400210928                   ASSIGN TO DATABASE-MFAACCCRP
010500210928                   ORGANIZATION IS INDEXED
010600210928                   ACCESS IS DYNAMIC
010700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010800210928
010900210928           SELECT  ACCOUNT-CONTRACT-INV-RESET
011000210928                   ASSIGN TO DATABASE-MFAACCCIRP
011100210928                   ORGANIZATION IS INDEXED
011200210928                   ACCESS IS DYNAMIC
011300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
011400210928
011500210928           SELECT  ACCOUNT
011600210928                   ASSIGN TO DATABASE-MFAACCNTP
011700210928                   ORGANIZATION IS INDEXED
011800210928                   ACCESS IS DYNAMIC
011900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012000210928
012100210928           SELECT  ACCOUNT-NOMINEE
012200210928                   ASSIGN TO DATABASE-MFAACCNMP
012300210928                   ORGANIZATION IS INDEXED
012400210928                   ACCESS IS DYNAMIC
012500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012600210928      /
012700210928           SELECT  TRANS-OFFSET
012800210928                   ASSIGN TO DATABASE-MFATRNP
012900210928                   ORGANIZATION IS INDEXED
013000210928                   ACCESS IS DYNAMIC
013100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013200210928      /
013300210928           SELECT  TRANS-TARGET
013400210928                   ASSIGN TO DATABASE-MFATRNTGP
013500210928                   ORGANIZATION IS INDEXED
013600210928                   ACCESS IS DYNAMIC
013700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013800210928      /
013900210928           SELECT  TRANS-TARGET-2
014000210928                   ASSIGN TO DATABASE-MFATRNTGLA
014100210928                   ORGANIZATION IS INDEXED
014200210928                   ACCESS IS DYNAMIC
014300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
014400210928
014500210928           SELECT  CONTRACT-ERROR-LOG
014600210928                   ASSIGN TO DATABASE-MFACTERRP
014700210928                   ORGANIZATION IS INDEXED
014800210928                   ACCESS IS DYNAMIC
014900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
015000210928                   WITH DUPLICATES.
015100210928
015200210928           SELECT  TRANS-R
015300210928                   ASSIGN TO DATABASE-MFATRNLN
015400210928                   ORGANIZATION IS INDEXED
015500210928                   ACCESS IS DYNAMIC
015600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
015700210928                   WITH DUPLICATES.
015800210928      /
015900210928           SELECT  SEG-TRANSFER-OPTIONS
016000210928                   ASSIGN TO DATABASE-MFATRFOPP
016100210928                   ORGANIZATION IS INDEXED
016200210928                   ACCESS IS DYNAMIC
016300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016400210928      /
016500210928           SELECT  TRANS
016600210928                   ASSIGN TO DATABASE-MFATRNP
016700210928                   ORGANIZATION IS INDEXED
016800210928                   ACCESS IS DYNAMIC
016900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017000210928      /
017100210928           SELECT  TRANS-CONTRACT-DTL-R
017200210928                   ASSIGN TO DATABASE-MFATRCODP
017300210928                   ORGANIZATION IS INDEXED
017400210928                   ACCESS IS DYNAMIC
017500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017600210928      /
017700210928           SELECT  BUSINESS-DAYS
017800210928                   ASSIGN TO DATABASE-MFABUSDAP
017900210928                   ORGANIZATION IS INDEXED
018000210928                   ACCESS IS DYNAMIC
018100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018200210928      /
018300210928           SELECT  TRANS-CONTRACT-DETAILS
018400210928                   ASSIGN TO DATABASE-MFATRCODP
018500210928                   ORGANIZATION IS INDEXED
018600210928                   ACCESS IS DYNAMIC
018700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018800210928      /
018900210928           SELECT  EXCLUDE-TRANS
019000210928                   ASSIGN TO DATABASE-MFAEXTRNP
019100210928                   ORGANIZATION IS INDEXED
019200210928                   ACCESS IS DYNAMIC
019300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019400210928      /
019500210928           SELECT  ACCOUNT-ATTRIBUTES
019600210928                   ASSIGN TO DATABASE-MFAACCATP
019700210928                   ORGANIZATION IS INDEXED
019800210928                   ACCESS IS DYNAMIC
019900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020000210928      /
020100210928           SELECT  ACCOUNT-CONTRACT-INVEST
020200210928                   ASSIGN TO DATABASE-MFAACCCIP
020300210928                   ORGANIZATION IS INDEXED
020400210928                   ACCESS IS DYNAMIC
020500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020600210928      /
020700210928           SELECT  TRANS-GBV-TRANSFER
020800210928                   ASSIGN TO DATABASE-MFATRACXP
020900210928                   ORGANIZATION IS INDEXED
021000210928                   ACCESS IS DYNAMIC
021100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021200210928
021300210928           SELECT  SEG-SWITCH-TRF-OPT
021400210928                   ASSIGN TO DATABASE-MFASGSTOP
021500210928                   ORGANIZATION IS INDEXED
021600210928                   ACCESS IS DYNAMIC
021700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021800210928
021900210928           SELECT  TRANS-CONTRACT-TARGET2
022000210928                   ASSIGN TO DATABASE-MFATRCTGLA
022100210928                   ORGANIZATION IS INDEXED
022200210928                   ACCESS IS DYNAMIC
022300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022400210928
022500210928           SELECT  TRANS-CHARGES
022600210928                   ASSIGN TO DATABASE-MFATRNCHP
022700210928                   ORGANIZATION IS INDEXED
022800210928                   ACCESS IS DYNAMIC
022900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023000210928
023100210928           SELECT  TRANS-SEG-DEDUCTION-CODES
023200210928                   ASSIGN TO DATABASE-MFATRNSDCP
023300210928                   ORGANIZATION IS INDEXED
023400210928                   ACCESS IS DYNAMIC
023500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023600210928
023700210928      *RFS110904 - START
023800210928           SELECT  INVESTMENT-STRUCTURE-XREF
023900210928                   ASSIGN TO DATABASE-MFAINVSXP
024000210928                   ORGANIZATION IS INDEXED
024100210928                   ACCESS IS DYNAMIC
024200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024300210928      *RFS110904 - END
024400210928
024500210928      *RFS180708 - Start
024600210928           SELECT  TRANS-MISC-DETAILS
024700210928                   ASSIGN TO DATABASE-MFATRNMSCP
024800210928                   ORGANIZATION IS INDEXED
024900210928                   ACCESS IS DYNAMIC
025000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025100210928
025200210928           SELECT  TRANS-REDEM-DETAILS
025300210928                   ASSIGN TO DATABASE-MFATRNREP
025400210928                   ORGANIZATION IS INDEXED
025500210928                   ACCESS IS DYNAMIC
025600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025700210928      *RFS180708 - End
025800210928
025900210928       DATA DIVISION.
026000210928       FILE SECTION.
026100210928      /
026200210928       FD  TRANS-TARGET
026300210928           LABEL RECORDS ARE STANDARD.
026400210928       01  TRANS-TARGET-REC.
026500210928                                  COPY DD-ALL-FORMATS OF MFATRNTGP.
026600210928      /
026700210928       FD  TRANS-TARGET-2
026800210928           LABEL RECORDS ARE STANDARD.
026900210928       01  TRANS-TARGET-2-REC.
027000210928                                  COPY DD-ALL-FORMATS OF MFATRNTGLA.
027100210928      /
027200210928       FD  ACCOUNT-CONTRACT-INVESTMENT
027300210928           LABEL RECORDS ARE STANDARD.
027400210928       01  ACC-CON-INV-REC.       COPY DD-ALL-FORMATS OF MFAACCCIP.
027500210928      /
027600210928       FD  ACCOUNT-CONTRACT-INVEST-SWI
027700210928           LABEL RECORDS ARE STANDARD.
027800210928       01  ACC-CON-INV-SWI-REC.   COPY DD-ALL-FORMATS OF MFAACCCIP.
027900210928
028000210928       FD  ACCOUNT-CONTRACT-INVEST-R
028100210928           LABEL RECORDS ARE STANDARD.
028200210928       01  ACC-CON-INV-R-REC.     COPY DD-ALL-FORMATS OF MFAACCCIP.
028300210928      /
028400210928       FD  ACCOUNT-CONTRACT-RESET
028500210928           LABEL RECORDS ARE STANDARD.
028600210928       01  ACC-CON-RESET-REC.     COPY DD-ALL-FORMATS OF MFAACCCRP.
028700210928      /
028800210928      *FD  ACCOUNT-CONTRACT-RESET-R
028900210928      *    LABEL RECORDS ARE STANDARD.
029000210928      *01  ACC-CON-RESET-R-REC.   COPY DD-ALL-FORMATS OF MFAACCCRP.
029100210928      *
029200210928       FD  ACCOUNT-CONTRACT-INV-RESET
029300210928           LABEL RECORDS ARE STANDARD.
029400210928       01  ACC-CON-INV-RESET-REC. COPY DD-ALL-FORMATS OF MFAACCCIRP.
029500210928      /
029600210928       FD  ACCOUNT
029700210928           LABEL RECORDS ARE STANDARD.
029800210928       01  ACCOUNT-REC.           COPY DD-ALL-FORMATS OF MFAACCNTP.
029900210928      /
030000210928       FD  ACCOUNT-NOMINEE
030100210928           LABEL RECORDS ARE STANDARD.
030200210928       01  ACCOUNT-NOMINEE-REC.   COPY DD-ALL-FORMATS OF MFAACCNMP.
030300210928      /
030400210928       FD  TRANS-OFFSET
030500210928           LABEL RECORDS ARE STANDARD.
030600210928       01  TRANS-2-REC.           COPY DD-ALL-FORMATS OF MFATRNP.
030700210928      /
030800210928       FD  CONTRACT-ERROR-LOG
030900210928           LABEL RECORDS ARE STANDARD.
031000210928       01  CONT-ERR-LOG-REC.      COPY DD-ALL-FORMATS OF MFACTERRP.
031100210928      /
031200210928       FD  TRANS-R
031300210928           LABEL RECORDS ARE STANDARD.
031400210928       01  TRANS-R-REC.           COPY DD-ALL-FORMATS OF MFATRNLN.
031500210928      /
031600210928       FD  TRANS-CONTRACT-DTL-R
031700210928           LABEL RECORDS ARE STANDARD.
031800210928       01  TRANS-CONT-DTL-R-REC.      COPY DD-ALL-FORMATS OF MFATRCODP.
031900210928      /
032000210928       FD  TRANS
032100210928           LABEL RECORDS ARE STANDARD.
032200210928       01  TRANS-REC.          COPY DD-ALL-FORMATS OF MFATRNP.
032300210928      /
032400210928       FD  SEG-TRANSFER-OPTIONS
032500210928           LABEL RECORDS ARE STANDARD.
032600210928       01  SEG-TRANSFER-OPTIONS-REC.  COPY DD-ALL-FORMATS OF MFATRFOPP.
032700210928      /
032800210928       FD  BUSINESS-DAYS
032900210928           LABEL RECORDS ARE STANDARD.
033000210928       01  BUSINESS-DAYS-REC.         COPY DD-ALL-FORMATS OF MFABUSDAP.
033100210928      /
033200210928       FD  TRANS-CONTRACT-DETAILS
033300210928           LABEL RECORDS ARE STANDARD.
033400210928       01  TRANS-CON-DTL-REC.       COPY DD-ALL-FORMATS OF MFATRCODP.
033500210928      /
033600210928       FD  ACCOUNT-ATTRIBUTES
033700210928           LABEL RECORDS ARE STANDARD.
033800210928       01  ACCOUNT-ATT-REC.           COPY DD-ALL-FORMATS OF MFAACCATP.
033900210928      /
034000210928       FD  EXCLUDE-TRANS
034100210928           LABEL RECORDS ARE STANDARD.
034200210928       01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
034300210928      /
034400210928       FD  ACCOUNT-CONTRACT-INVEST
034500210928           LABEL RECORDS ARE STANDARD.
034600210928       01  ACCT-CONT-INVEST-REC.  COPY DD-ALL-FORMATS OF MFAACCCIP.
034700210928      /
034800210928       FD  TRANS-GBV-TRANSFER
034900210928           LABEL RECORDS ARE STANDARD.
035000210928       01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
035100210928
035200210928       FD  SEG-SWITCH-TRF-OPT
035300210928           LABEL RECORDS ARE STANDARD.
035400210928       01  SEG-SWITCH-TRF-OPT-REC.    COPY DD-ALL-FORMATS OF MFASGSTOP.
035500210928
035600210928       FD  TRANS-CONTRACT-TARGET2
035700210928           LABEL RECORDS ARE STANDARD.
035800210928       01  TRANS-CONTRACT-TGT-REC.   COPY DD-ALL-FORMATS OF MFATRCTGLA.
035900210928
036000210928       FD  TRANS-CHARGES
036100210928           LABEL RECORDS ARE STANDARD.
036200210928       01  TRANS-CHARGES-REC.        COPY DD-ALL-FORMATS OF MFATRNCHP.
036300210928
036400210928       FD  TRANS-SEG-DEDUCTION-CODES
036500210928           LABEL RECORDS ARE STANDARD.
036600210928       01  TRANS-SEG-DEDUCTION-CODES-REC.
036700210928                         COPY DD-ALL-FORMATS OF MFATRNSDCP.
036800210928
036900210928      *RFS110904 - START
037000210928       FD  INVESTMENT-STRUCTURE-XREF
037100210928           LABEL RECORDS ARE STANDARD.
037200210928       01  INV-STRU-XREF-REC. COPY DD-ALL-FORMATS OF MFAINVSXP.
037300210928      *RFS110904 - END
037400210928
037500210928      *RFS180708 - Start
037600210928       FD  TRANS-MISC-DETAILS
037700210928           LABEL RECORDS ARE STANDARD.
037800210928       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
037900210928
038000210928       FD  TRANS-REDEM-DETAILS
038100210928           LABEL RECORDS ARE STANDARD.
038200210928       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
038300210928      *RFS180708 - End
038400210928
038500210928       WORKING-STORAGE SECTION.
038600210928
038700210928      * Copybooks
038800210928
038900210928      * RFS49699 - Begin
039000210928
039100210928      *  screen edits allowed
039200210928           copy CPSCEDTAL1.
039300210928
039400210928      *  log array info
039500210928           copy CPFXLOGAU.
039600210928
039700210928      *  log array table name
039800210928           copy CPFXLOGAT.
039900210928
040000210928      * RFS49699 - End
040100210928
040200210928           EXEC SQL
040300210928                INCLUDE SQLCA
040400210928           END-EXEC.
040500210928
040600210928       01  CURR-CONTROLS.
040700210928          03 CURR-LEVEL1             PIC X(1).
040800210928
040900210928       01  PROG-ID-CODE              PIC X(10) VALUE "SEGRECALGD".
041000210928
041100210928       01  OPEN-FILES-ONCE           PIC X(1)  VALUE "Y".
041200210928
041300210928       01  EXCLUDE-TRANS-FLAG        PIC X(1).
041400210928
041500210928       01  UNITRAX-BASE-CURRENCY     PIC X(3)  VALUE " ".
041600210928
041700210928       01  PROG-EXCHANGE-RATE-TYPE   PIC X     VALUE " ".
041800210928
041900210928107585 01 LC-TRANSFERGDV              PIC X(01).
042000210928       01 SW01-SWITCHES.                                                RFS8712
042100210928          05 SW01-STS-FLAG                       PIC X(01).             RFS8712
042200210928             88 SW01-STS-OK                      VALUE " ".             RFS8712
042300210928             88 SW01-STS-OPEN                    VALUE "1".             RFS8712
042400210928             88 SW01-STS-START                   VALUE "2".             RFS8712
042500210928             88 SW01-STS-READ                    VALUE "3".             RFS8712
042600210928             88 SW01-STS-REWRITE                 VALUE "4".             RFS8712
042700210928             88 SW01-STS-WRITE                   VALUE "5".             RFS8712
042800210928             88 SW01-STS-DELETE                  VALUE "6".             RFS8712
042900210928             88 SW01-STS-END                     VALUE "7".             RFS8712
043000210928             88 SW01-STS-CLOSE                   VALUE "8".             RFS8712
043100210928             88 SW01-STS-RANGE                   VALUE "9".             RFS8712
043200210928             88 SW01-STS-FOUND                   VALUE "A".             RFS8712
043300210928             88 SW01-STS-FAIL                    VALUE "*".             RFS8712
043400210928
043500210928110904 01  ACCOUNT-CONTRACT.
043600210928110904     05 GUAR-BENEFIT-ELIGIBLE     PIC X(1).
043700210928110904     05 LI-ACCOUNTNO              PIC S9(9).
043800210928110904     05 LI-CONTRACTNO             PIC S9(9).
043900210928
044000210928       01  WS-MISC-FIELDS.
044100210928           05 WS-NEW-GUAR-DEATH-VALUE   PIC S9(11)V99 COMP-3 VALUE 0.
044200210928           05 WS-NEW-GUAR-DEATH-VAL-CUR PIC S9(11)V99 COMP-3 VALUE 0.
044300210928           05 WS-CURR-UNIT-BAL         PIC S9(10)V999 COMP-3 VALUE 0.
044400210928           05 WS-REJECTION-CODE        PIC X(3).
044500210928           05 WS-EXCHANGE-FOUND        PIC X(1).
044600210928      * Exchange variables
044700210928           05 WS-EXCH-PLACEMENT-DATE   PIC S9(10)      COMP-3.
044800210928           05 WS-EXCH-TRANS-NO         PIC S9(10)      COMP-3.
044900210928           05 WS-EXCH-CURRENCY         PIC X(3).
045000210928           05 WS-EXCH-TRADE-DATE       PIC S9(8) COMP-3.
045100210928           05 WS-EXCH-RATE             PIC S9(2)V9(7)  COMP-3.
045200210928           05 WS-EXCH-RATE-VALUE       PIC S9(2)V9(7)  COMP-3.
045300210928           05 WS-CURR-TRANS-UNIT-AMT   PIC S9(10)V9(3) COMP-3.
045400210928           05 WS-CURR-TRANS-UNIT-PRICE PIC S9(5)V9(4) COMP-3.
045500210928           05 WS-CURR-TRANS-TRADE-DATE PIC S9(8) COMP-3.
045600210928           05 WS-CURR-TRANS-GROSS-AMT  PIC S9(11)V9(2) COMP-3.
045700210928           05 WS-CURR-TRANS-NET-AMT    PIC S9(11)V9(2) COMP-3.
045800210928           05 WS-CURR-TRANS-AMT        PIC S9(11)V9(2) COMP-3.
045900210928           05 WS-CURR-TRANS-AMT-CUR    PIC S9(11)V9(2) COMP-3.
046000210928           05 WS-CURR-TRANS-PLACEMENT-DATE PIC 9(8).
046100210928           05 WS-CURR-TRANS-TRANS-NO   PIC S9(10)      COMP-3.
046200210928           05 WS-CURR-ORIG-UNIT-BAL    PIC S9(10)V9(3) COMP-3.
046300210928
046400210928           05 WS-BYPASS-DEDUCTION      PIC X.
046500210928           05 WS-DEDUCTION-AMT         PIC S9(11)V9(2) COMP-3.
046600210928           05 WS-DEDUCTION-PROP        PIC S9(10)V9(8) COMP-3.
046700210928           05 WS-DEDUCTION-GDV-CHANGE  PIC S9(10)V9(8) COMP-3.
046800210928           05 WS-IN-DEDUCTION-AMT      PIC S9(11)V9(2) COMP-3.
046900210928           05 WS-OUT-TRANS-GROSS       PIC S9(11)V9(2) COMP-3.
047000210928           05 WS-IN-TRANS-GROSS        PIC S9(11)V9(2) COMP-3.
047100210928           05 WS-FROM-GROSS-AMT        PIC S9(11)V9(2) COMP-3.
047200210928           05 WS-TRN-AMT               PIC S9(11)V9(2) COMP-3.
047300210928           05 WS-TRN-PROCESS-DATE      PIC 9(08) VALUE 0.
047400210928           05 WS-TRN-PLACEMENT-DATE    PIC 9(08) VALUE 0.
047500210928           05 WS-TRN-TRANS-NO          PIC 9(09) VALUE 0.
047600210928
047700210928           05 WS-SYSDATE.
047800210928              10 WS-SYSDATE-CC         PIC 99.
047900210928              10 WS-SYSDATE-YMD.
048000210928                 15 WS-SYSDATE-YY      PIC 99.
048100210928                 15 WS-SYSDATE-MM      PIC 99.
048200210928                 15 WS-SYSDATE-DD      PIC 99.
048300210928           05 WS-SYSDATE-N REDEFINES WS-SYSDATE
048400210928                                       PIC 9(8).
048500210928
048600210928           05 WS-SYSTIME-LONG.
048700210928              10 WS-SYSTIME.
048800210928                 15 WS-SYSTIME-HH      PIC 99.
048900210928                 15 WS-SYSTIME-MI      PIC 99.
049000210928                 15 WS-SYSTIME-SS      PIC 99.
049100210928              10 WS-SYSTIME-N REDEFINES WS-SYSTIME
049200210928                                       PIC 9(6).
049300210928              10 WS-SYSTIME-2 REDEFINES WS-SYSTIME
049400210928                                       PIC 9(4).
049500210928              10 WS-SYSTIME-HS         PIC 99.
049600210928
049700210928            05 WS-SYSTIME-LONG-N REDEFINES WS-SYSTIME-LONG
049800210928                                       PIC 9(8).
049900210928
050000210928            05 WS-MISC-INFO-AREA       PIC X(40).
050100210928
050200210928            05 WS-MISC-INFO-1 REDEFINES WS-MISC-INFO-AREA.
050300210928              10 WS-MISC-INFO-1-NAME   PIC X(20).
050400210928              10 WS-MISC-INFO-1-UNIT   PIC -9(10).9(3).
050500210928
050600210928            05 WS-MISC-INFO-2 REDEFINES WS-MISC-INFO-AREA.
050700210928              10 WS-MISC-INFO-2-NAME   PIC X(11).
050800210928              10 WS-MISC-INFO-2-NKEY-1 PIC X(6).
050900210928              10 WS-MISC-INFO-2-KEY-1  PIC 9(8).
051000210928              10 WS-MISC-INFO-2-NKEY-2 PIC X(6).
051100210928              10 WS-MISC-INFO-2-KEY-2  PIC 9(9).
051200210928      /
051300210928       01 TRANSACTION-CATEGORIES.
051400210928          05 TRANS-CATEGORY              PIC X(3).
051500210928             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI".
051600210928             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
051700210928             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO"
051800210928                                                "TFE" "CQD" "FEE" "SAJ".
051900210928             88 SWITCH-OUT-TRANSACTION   VALUES "SWO" "TRO".
052000210928             88 ADDITION-TRANSACTION     VALUES "BUY" "INC" "CPG"
052100210928                                                "SWI" "TRI" "INT"
052200210928                                                "MFR" "SSD" "SSU" "BAJ"
052300210928                                                "BFW".
052400210928             88 REDUCTION-TRANSACTION    VALUES "SEL" "SWO" "TRO"
052500210928                                                "TFE" "CQD" "FEE" "SAJ".
052600210928             88 VALID-TRANSACTION        VALUES "BUY" "SEL" "SWI"
052700210928                                                "SWO" "TRI" "TRO".
052800210928             88 SWITCH-IN                VALUE "SWI".
052900210928             88 SWITCH-OUT               VALUE "SWO".
053000210928             88 TRANSFER-IN              VALUE "TRI".
053100210928             88 TRANSFER-OUT             VALUE "TRO".
053200210928             88 BUY-TRANSACTION          VALUE "BUY".
053300210928
053400210928       01 TRANSACTION-STATUS-CATEGORIES.
053500210928          05 TRANS-STATUS-CATEGORY       PIC X(3).
053600210928             88 HISTORY                  VALUES "HST" "HSC".
053700210928             88 HISTORY-CONVERSION       VALUES "HSC".
053800210928             88 PENDING                  VALUES "PND" "VER".
053900210928             88 CONTRACTED               VALUES "CON".
054000210928             88 UNCONFIRMED              VALUES "UNC".
054100210928             88 CANCELLED                VALUES "CAN".
054200210928             88 SETTLED                  VALUES "SET".
054300210928             88 RVSD                     VALUES "RVS".
054400210928
054500210928       01 TRANSACTION-REVERSE-CATEGORIES.
054600210928          05 TRANS-REVERSE-CATEGORY      PIC X(1).
054700210928             88 TRANS-REVERSED           VALUES "Y".
054800210928
054900210928       01 OLD-INVRIDX                    PIC 9(2) VALUE 0.
055000210928
055100210928       01 WS-ACC-CONT-INV-RESET-ARRAYX.
055200210928          05 WS-ACC-CONT-INV-RESET-ARRAY OCCURS 100 TIMES
055300210928                                         INDEXED BY INVRIDX.
055400210928             10 WS-ARRAY-INVR-ACCOUNT-NO   PIC 9(09).
055500210928             10 WS-ARRAY-INVR-CONTRACT-NO  PIC 9(09).
055600210928             10 WS-ARRAY-INVR-INVEST-CODE  PIC X(05).
055700210928             10 WS-ARRAY-INVR-RESET-NO     PIC 9(02).
055800210928             10 WS-ARRAY-INVR-UNIT-BAL     PIC S9(10)V9(3) COMP-3.
055900210928             10 WS-ARRAY-INVR-GDV          PIC S9(11)V9(2) COMP-3.
056000210928             10 WS-ARRAY-INVR-GDV-CUR      PIC S9(11)V9(2) COMP-3.
056100210928
056200210928       01 WS-ACC-CONT-INV-ARRAYX.
056201211007111744*   05 WS-ACC-CONT-INV-ARRAY OCCURS 100 TIMES INDEXED BY CONTIDX.
056202211007111744    05 WS-ACC-CONT-INV-ARRAY OCCURS 1 TO 1000 TIMES DEPENDING ON
056203211007111744                            ln_InvArraySize INDEXED BY CONTIDX.
056400210928             10 WS-ARRAY-ACCOUNT-NO        PIC 9(09).
056500210928             10 WS-ARRAY-CONTRACT-NO       PIC 9(09).
056600210928             10 WS-ARRAY-INVESTMENT-CODE   PIC X(05).
056700210928             10 WS-ARRAY-INV-CURR-CODE     PIC X(03).
056800210928             10 WS-ARRAY-BEFORE-MV         PIC S9(11)V9(2) COMP-3.
056900210928             10 WS-ARRAY-BEFORE-GDV        PIC S9(11)V9(2) COMP-3.
057000210928             10 WS-ARRAY-AFTER-MV          PIC S9(11)V9(2) COMP-3.
057100210928             10 WS-ARRAY-INV-EXCH-RATE     PIC S9(2)V9(7) COMP-3.
057200210928
057300210928      * RFS49699 - Begin
057400210928
057500210928       01 WS-ARRAY-LOG-MISC.
057600210928           05 WS-ARRAY1-NAME           PIC X(32)
057700210928                               VALUE "WS-ACC-CONT-INV-RESET-ARRAY".
057800210928           05 WS-ARRAY1-MAX            PIC 9(09)
057900210928                               VALUE 100.
058000210928           05 WS-ARRAY1-MAX-USED       PIC 9(09)
058100210928                               VALUE 0.
058200210928           05 WS-ARRAY2-NAME           PIC X(32)
058300210928                               VALUE "WS-ACC-CONT-INV-ARRAY".
058400210928           05 WS-ARRAY2-MAX            PIC 9(09)
058500210928                               VALUE 100.
058600210928           05 WS-ARRAY2-MAX-USED       PIC 9(09)
058700210928                               VALUE 0.
058800210928
058900210928      * RFS49699 - End
059000210928
059100210928      * RFS 110904 - START
059200210928       01 LC-INVSTRUCTURECODE           PIC X(5).
059300210928127401 01 LC-GUARBENEFITELIGIBLE        PIC X(5).
059400210928      * RFS 110904 - END
059500210928
059600210928       01 WS-VARS-4ROUNDING.
059700210928          05 WS-CONT-GDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
059800210928          05 WS-GDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
059900210928
060000210928       01 WS-LEVEL-88.
060100210928          05 WS-INV-RESET-FLAG             PIC X.
060200210928             88 INV-RESET-FOUND            VALUE "Y".
060300210928          05 WS-NEED-GDV-FLAG              PIC X.
060400210928             88 NEEDS-GDV-AMOUNT           VALUE "Y".
060500210928          05 WS-FIRST-RECALC-PASS          PIC X.
060600210928             88 FIRST-RECALC-PASS          VALUE "Y".
060700210928          05 WS-ARRAY-POINTER              PIC X.
060800210928             88 ARRAY-POINTER-FOUND        VALUE "Y".
060900210928             88 ARRAY-POINTER-NOT-FOUND    VALUE "N".
061000210928          05 WS-SQL-FILE-OPEN              PIC X.
061100210928             88 SQL-FILE-OPEN              VALUE "Y".
061200210928             88 SQL-FILE-NOT-OPEN          VALUE "N".
061300210928          05 WS-LOAD-STRUCTURE             PIC X.
061400210928             88 FRONT-END                  VALUE "F".
061500210928          05 WS-GDV-DIFF-FLAG              PIC X(01).
061600210928             88 GDV-DIFFERENCE-FOUND       VALUE "Y".
061700210928          05 WS-GDV-UPDATE-FLAG            PIC X(01).
061800210928             88 GDV-NOT-UPDATED            VALUE "Y".
061900210928          05 WS-XFER-AMT-EXISTS-FLAG       PIC X(01).
062000210928             88 TRANSFER-AMT-EXISTS        VALUE "Y".
062100210928          05 WS-INV-SEG-FIRST-PASS         PIC X.
062200210928             88 INV-SEG-FIRST-PASS         VALUE "Y".
062300210928
062400210928       01 WS-SQL-VARIABLES.
062500210928          05 WS-SQL-PROCESS-DATE           PIC S9(9) COMP-3.
062600210928          05 WS-SQL-PROC-SEQ-NO            PIC S9(9) COMP-3.
062700210928          05 WS-SQL-PLACEMENT-DATE         PIC S9(9) COMP-3.
062800210928          05 WS-SQL-TRANS-NO               PIC S9(9) COMP-3.
062900210928
063000210928       01 WS-CURRENCY                      PIC X(3).
063100210928       01 WS-EX-CURRENCY                   PIC X(3).
063200210928       01 WS-TRANS-COUNT                   PIC 9(3) VALUE 0.
063300210928       01 WS-SWO-GDV-CHANGE                PIC S9(11)V9(2) COMP-3
063400210928                                               VALUE 0.
063500210928       01 WS-GET-LOAD-STRUCTURE            PIC X(01).
063600210928       01 WS-OTHER-VARIABLES.
063700210928          05 WS-DIFF-INVESTMENT-FLAG        PIC X(01).
063800210928          05 WS-OLD-CURR-INVESTMENT-CODE    PIC X(05).
063900210928          05 WS-CONT-INVESTMENT-CODE        PIC X(05).
064000210928          05 WS-PRICE-FOUND                 PIC X(01).
064100210928          05 WS-REQUIRED-UNITSP             PIC S9(10)V9(3) COMP-3.
064200210928          05 WS-INV-UNIT-PRICE              PIC S9(5)V9(4) COMP-3.
064300210928          05 WS-INV-TRADE-DATE              PIC S9(8)       COMP-3.
064400210928          05 WS-INV-DST-FLAG                PIC X.
064500210928          05 WS-INV-BEF-MARKET-VALUE        PIC S9(11)V9(4) COMP-3.
064600210928          05 WS-INV-AFT-MARKET-VALUE        PIC S9(11)V9(2) COMP-3.
064700210928          05 WS-CONT-INV-MARKET-VALUE       PIC S9(12)V9(4) COMP-3.
064800210928          05 WS-CURR-CONTRACT-MV-AFT        PIC S9(12)V9(2) COMP-3.
064900210928          05 WS-INV-BEF-GDV                 PIC S9(11)V9(2) COMP-3.
065000210928          05 WS-INV-BEF-NDV                 PIC S9(11)V9(2) COMP-3.
065100210928          05 WS-CURR-CONTRACT-GDV-BEF       PIC S9(12)V9(2) COMP-3.
065200210928          05 WS-CURR-CONTRACT-GDV-AFT       PIC S9(12)V9(2) COMP-3.
065300210928          05 WS-GDV-CHANGE                  PIC S9(11)V9(2) COMP-3.
065400210928          05 WS-INV-GDV-PERCENT             PIC S9(2)V9(3) COMP-3.
065500210928          05 WS-INV-GDV-PERCENT-TOTAL       PIC S9(2)V9(3) COMP-3.
065600210928          05 WS-INV-GDV-AFT                 PIC S9(11)V9(2) COMP-3.
065700210928          05 WS-INV-GDV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
065800210928          05 WS-CONT-INV-ARRAY-COUNT        PIC S9(03) COMP-3.
065900210928          05 WS-CONT-INV-COUNT              PIC S9(03) COMP-3.
066000210928          05 WS-INV-OPENING-UNIT-BAL        PIC S9(10)V9(3) COMP-3.
066100210928          05 WS-NEXT-PROCESS-DATE           PIC 9(8).
066200210928          05 WS-DUMMY-PERCENT               PIC S9(2)V9(3) COMP-3.
066300210928          05 WS-GDV-CHANGE-AMT              PIC S9(11)V9(2) COMP-3.
066400210928
066500210928       01 WS-DEFAULT.
066600210928          05 WS-RECORD-FOUND                PIC X(01).
066700210928             88 RECORD-FOUND                VALUE "Y".
066800210928
066900210928       01 CURRENT-RECORD-VARS.
067000210928          05 CURR-ACCOUNT-NO                PIC S9(9).
067100210928          05 CURR-INVESTMENT-CODE           PIC X(5).
067200210928          05 CURR-CONTRACT-NO               PIC S9(9).
067300210928          05 CURR-RESET-UNIT-PRICE          PIC S9(5)V9(4) COMP-3.
067400210928          05 CURR-RESET-EXCH-RATE           PIC S9(2)V9(7) COMP-3.
067500210928          05 CURR-OPENING-UNIT-BAL          PIC S9(9)V9(3) COMP-3.
067600210928          05 CURR-RESET-NO                  PIC 9(2).
067700210928          05 CURR-HAS-RESET-FLAG            PIC X(1).
067800210928          05 CURR-GUAR-DEATH-VALUE-BEF      PIC S9(11)V9(2) COMP-3.
067900210928          05 CURR-GUAR-DEATH-VAL-CUR-BEF    PIC S9(11)V9(2) COMP-3.
068000210928          05 CURR-DEATH-PERCENT             PIC S9(3)V9(2).
068100210928
068200210928       01 WS-OTHER-VARIABLES3.
068300210928          05 WS-FROM-ACCOUNT-TYPE        PIC X(05).
068400210928          05 WS-FROM-NOM-ACCOUNT-TYPE    PIC X(05).
068500210928          05 WS-FROM-TRANS-TYPE-CODE     PIC X(03).
068600210928          05 WS-TO-ACCOUNT-TYPE          PIC X(05).
068700210928          05 WS-TO-NOM-ACCOUNT-TYPE      PIC X(05).
068800210928          05 WS-TO-TRANS-TYPE-CODE       PIC X(03).
068900210928          05 WS-TRANS-ORIGIN-CODE        PIC X(03).
069000210928          05 WS-CONTR-REDEM-CODE         PIC X(06).
069100210928          05 WS-FROM-PLACEMENT-DATE      PIC S9(09) COMP-3.
069200210928          05 WS-FROM-TRANS-NO            PIC S9(09) COMP-3.
069300210928          05 WS-TO-PLACEMENT-DATE        PIC S9(09) COMP-3.
069400210928          05 WS-TO-TRANS-NO              PIC S9(09) COMP-3.
069500210928          05 WS-FROM-ACCOUNT-NO          PIC S9(09) COMP-3.
069600210928          05 WS-TO-ACCOUNT-NO            PIC S9(09) COMP-3.
069700210928          05 WS-FROM-CONTRACT-NO         PIC 9(09).
069800210928          05 WS-TO-CONTRACT-NO           PIC 9(09).
069900210928          05 WS-TRANSFER-GBV             PIC X(01) VALUE "N".
070000210928      /
070100210928       01 WS-OTHER-VARIABLES4.
070200210928          05 WS-EX-ACCOUNT-TYPE          PIC X(05).
070300210928          05 WS-EX-NOM-ACCOUNT-TYPE      PIC X(05).
070400210928          05 WS-EX-TRANS-TYPE            PIC X(03).
070500210928          05 WS-EX-TRANS-ORIGIN          PIC X(03).
070600210928          05 WS-EX-REVERSAL-CODE         PIC X(04).
070700210928          05 WS-EX-ACCOUNT-ATT-CODE      PIC X(05).
070800210928          05 WS-EXCLUDE-TRANS              PIC X(1).
070900210928
071000210928       01  WS-SCHED-CODE             PIC X(5).
071100210928       01  WS-ACCT-TYPE-CODE         PIC X(5).
071200210928       01  WS-START-DATE             PIC S9(8) COMP-3.
071300210928       01  WS-ANN-AGE                PIC S9(3).
071400210928       01  WS-ANN-SEQ-NO             PIC S9(3).
071500210928       01  WS-SYS-DATE               PIC 9(8) VALUE ZEROES.
071600210928       01  WS-ANN-DOB                PIC S9(8).
071700210928       01  WS-DTH-PERCENT            PIC S9(3)V9(2) COMP-3.
071800210928       01  WS-INV-UNITS              PIC S9(10)V999  COMP-3.
071900210928
072000210928       01  WS-SQLLOG-VARIABLES.
072100210928           05 WS-ROUTINE-NAME               PIC  X(25).
072200210928           05 WS-SQLERR-STATEMENT           PIC X(25)   VALUE " ".
072300210928           05 WS-SQLERR-DATA                PIC X(1780) VALUE " ".
072400210928           05 WS-SQL-STATS                  PIC X(1966) VALUE " ".
072500210928           05 WS-SQLERR-REPLY               PIC X(01)  VALUE " ".
072600210928
072700210928      *rfs42749 begins
072800210928       01  lc-Constants.
072900210928          05  lc-distrS                    PIC X(01) Value "S".
073000210928      *rfs42749 ends
073100210928
073200210928180708 01 WS-PLACEMENTDATE           PIC S9(09) VALUE 0.
073300210928180708 01 WS-TRANSNO                 PIC S9(09) VALUE 0.
073400210928
073401211007      * RFS1117445 - START
073402211007       01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
073403211007       01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
073404211007       01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
073405211007      * RFS1117445 - END
073406211007
073500210928R47405 COPY CPGLWBRULE.
07360021092884063 *COPY CPGLWBCKTT.
07370021092884063  COPY CPCKFEETRN.
073800210928
073900210928       LINKAGE SECTION.
074000210928        01 COMM-AREA                     PIC X(200).
074100210928        01 COMM-AREA-BUFFER REDEFINES COMM-AREA.
074200210928           03 COMM-REJECTION-CODE        PIC X(3).
074300210928           03 COMM-USER                  PIC X(10).
074400210928           03 COMM-CALLER-ID-CODE        PIC X(10).
074500210928           03 COMM-ACTION                PIC X(10).
074600210928           03 COMM-OPEN-FILES            PIC X(1).
074700210928           03 COMM-PROCESS-DATE          PIC S9(8).
074800210928           03 COMM-ACCOUNT-NO            PIC 9(9).
074900210928           03 COMM-CONTRACT-NO           PIC 9(9).
075000210928           03 COMM-RESET-NUMBER          PIC 9(5).
075100210928           03 COMM-EFFECT-DATE           PIC S9(8).
075200210928
075300210928       PROCEDURE DIVISION USING COMM-AREA.
075400210928       MAINLINE.
075500210928
075600210928           PERFORM INITIAL-LOGIC     THRU INL-EXIT.
075700210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
075800210928              GO TO ML-0020.
075900210928
076000210928       ML-0010.
076100210928           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
076200210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
076300210928              GO TO ML-0020.
076400210928           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
076500210928
076600210928       ML-0020.
076700210928           PERFORM END-JOB             THRU EOJ-EXIT.
076800210928           GOBACK.
076900210928      /
077000210928       SQL-DECLARE-RTN.
077100210928           MOVE "ACICUR" TO WS-SQLERR-STATEMENT.
077200210928***********************************************************************
077300210928******* CURSOR: ACICUR - select all the investments for a contract
077400210928*******                - use in LOAD-ACC-CON-INV-ARRAY RTN
077500210928***********************************************************************
077600210928******* ALIAS        FILENAME                     OPENNAME
077700210928***********************************************************************
077800210928******* ACCCIP       ACCOUNT-CONTRACT-INVESTMENT  MFAACCCIP
077900210928***********************************************************************
078000210928
078100210928           EXEC SQL
078200210928             DECLARE ACICUR CURSOR FOR
078300210928              SELECT INVESTMENT_CODE,
078400210928                     CURR_UNIT_BAL,
078500210928                     GUAR_DEATH_VALUE,
078600210928                     GUAR_DEATH_VALUE_CUR,
078700210928                     OPENING_UNIT_BALANCE,
078800210928                     0,0,
078900210928                     " ", 0
079000210928                FROM MFAACCCIP
079100210928               WHERE ACCOUNT_NO  = :CURR-ACCOUNT-NO
079200210928                 AND CONTRACT_NO = :CURR-CONTRACT-NO
079300210928              FOR READ ONLY
079400210928           END-EXEC.
079500210928
079600210928***********************************************************************
079700210928******* CURSOR: SEGEXTSQ  - select trans after the effective date
079800210928*******                   - use in DETAIL-PROCESSING RTN
079900210928***********************************************************************
080000210928******* ALIAS        FILENAME                         OPENNAME
080100210928***********************************************************************
080200210928******* TRDPSP       TRANS-DAILY-PROC-SEQ             MFATRDPSP
080300210928******* TRNP         TRANS                            MFATRNP
080400210928***********************************************************************
080500210928           MOVE "DECLARE SEGEXTSQ" TO WS-SQLERR-STATEMENT.
080600210928      *RFS91599 Replaced 'Implicit Join' by 'Inner Join'
080700210928           EXEC SQL
080800210928              DECLARE SEGEXTSQ CURSOR FOR
080900210928               SELECT TRDPSP.PROCESS_DATE,
081000210928                      TRDPSP.PROC_SEQ_NO,
081100210928                      TRDPSP.PLACEMENT_DATE,
081200210928                      TRDPSP.TRANS_NO
08130021092891599            FROM MFATRDPSP TRDPSP
081400210928  |              INNER JOIN  MFATRNP   TRNP ON
081500210928  |                   TRDPSP.PLACEMENT_DATE = TRNP.PLACEMENT_DATE AND
081600210928  |                   TRDPSP.TRANS_NO       = TRNP.TRANS_NO
081700210928      * RFS63488 - START
08180021092891599 *          WHERE   TRDPSP.PROCESS_DATE > :COMM-EFFECT-DATE
081900210928                 WHERE   TRNP.TRADE_DATE     > :COMM-EFFECT-DATE
082000210928      * RFS63488 - END
082100210928                  AND TRDPSP.PROCESS_DATE  <= :COMM-PROCESS-DATE
082200210928                  AND   TRNP.REVERSE       <> "Y"
082300210928                  AND   TRNP.ACCOUNT_NO     = :CURR-ACCOUNT-NO
082400210928                ORDER BY TRDPSP.PROCESS_DATE,
082500210928                         TRDPSP.PROC_SEQ_NO
082600210928                FOR READ ONLY
082700210928           END-EXEC.
082800210928
082900210928***********************************************************************
083000210928******* CURSOR: INVPRC    - get investment unit price for a trade date
083100210928*******                   - use in GET-INVESTMENT-UNIT-PRICE RTN
083200210928***********************************************************************
083300210928******* ALIAS        FILENAME                         OPENNAME
083400210928***********************************************************************
083500210928******* INVUPP       INVESTMENT-UNIT-PRICE            MFAINVUPP
083600210928***********************************************************************
083700210928           MOVE "DECLARE INVPRC" TO WS-SQLERR-STATEMENT.
083800210928           EXEC SQL
083900210928             DECLARE INVPRC CURSOR FOR
084000210928             SELECT TRADE_DATE,
084100210928                    UNIT_PRICE,
084200210928                    DISTRIBUTION_FLAG
084300210928               FROM MFAINVUPP
084400210928              WHERE INVESTMENT_CODE = :WS-CONT-INVESTMENT-CODE
084500210928                AND TRADE_DATE     <= :WS-CURR-TRANS-TRADE-DATE
08460021092842749           AND DISTRIBUTION_FLAG <> :lc-distrS
084700210928              ORDER BY TRADE_DATE DESC,
084800210928                       DISTRIBUTION_FLAG DESC
084900210928              FOR READ ONLY
085000210928           END-EXEC.
085100210928
085200210928       SDR-EXIT.
085300210928           EXIT.
085400210928
085500210928       GET-CURRENT-RECORD.
085600210928           MOVE "Y" TO WS-INV-SEG-FIRST-PASS.
085700210928           INITIALIZE WS-ACC-CONT-INV-RESET-ARRAYX.
085800210928
085900210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-R-REC.
086000210928           MOVE COMM-ACCOUNT-NO
086100210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-R.
086200210928           MOVE COMM-CONTRACT-NO
086300210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-R.
086400210928           MOVE SPACES
086500210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-R.
086600210928
086700210928           START ACCOUNT-CONTRACT-INVEST-R
086800210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
086900210928                 INVALID KEY
087000210928                 MOVE HIGH-VALUES TO CURR-CONTROLS
087100210928                 GO TO GCR-EXIT.
087200210928
087300210928           SET INVRIDX TO 1.
087400210928           SET INVRIDX DOWN BY 1.
087500210928
087600210928       GCR-0010.
087700210928           READ ACCOUNT-CONTRACT-INVEST-R NEXT RECORD
087800210928                AT END
087900210928                GO TO GCR-EXIT.
088000210928
088100210928           IF COMM-ACCOUNT-NO NOT =
088200210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-R
088300210928              GO TO GCR-EXIT
088400210928           END-IF.
088500210928
088600210928           IF COMM-CONTRACT-NO NOT =
088700210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-R
088800210928              GO TO GCR-EXIT
088900210928           END-IF.
089000210928
089100210928           MOVE COMM-ACCOUNT-NO TO CURR-ACCOUNT-NO.
089200210928           MOVE COMM-CONTRACT-NO TO CURR-CONTRACT-NO.
089300210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-R
089400210928             TO CURR-INVESTMENT-CODE.
089500210928           MOVE COMM-RESET-NUMBER TO CURR-RESET-NO.
089600210928           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-R
089700210928             TO CURR-OPENING-UNIT-BAL.
089800210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-R
089900210928             TO CURR-GUAR-DEATH-VALUE-BEF.
090000210928           MOVE GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST-R
090100210928             TO CURR-GUAR-DEATH-VAL-CUR-BEF.
090200210928
090300210928           MOVE CURR-ACCOUNT-NO
090400210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET.
090500210928           MOVE CURR-CONTRACT-NO
090600210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET.
090700210928           MOVE CURR-RESET-NO
090800210928             TO RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET.
090900210928           MOVE CURR-INVESTMENT-CODE
091000210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET.
091100210928
091200210928           READ ACCOUNT-CONTRACT-INV-RESET
091300210928                INVALID KEY
091400210928                  MOVE ZEROES TO CURR-RESET-UNIT-PRICE
091500210928                                 CURR-RESET-EXCH-RATE
091600210928                                 CURR-OPENING-UNIT-BAL
091700210928                                 CURR-GUAR-DEATH-VALUE-BEF
091800210928                                 CURR-GUAR-DEATH-VAL-CUR-BEF
091900210928                NOT INVALID KEY
092000210928                  MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INV-RESET
092100210928                                     TO CURR-OPENING-UNIT-BAL
092200210928           END-READ.
092300210928
092400210928       GCR-0020.
092500210928
092600210928           MOVE 0 TO CURR-DEATH-PERCENT.
092700210928           IF INV-SEG-FIRST-PASS
092800210928              CALL "SEGDTHPER" USING CURR-ACCOUNT-NO
092900210928                                     CURR-CONTRACT-NO
093000210928                                     CURR-INVESTMENT-CODE
093100210928                                     CURR-DEATH-PERCENT
093200210928165027*       CANCEL "SEGDTHPER"
093300210928           END-IF.
093400210928
093500210928           SET INVRIDX UP BY 1.
093600210928      * RFS49699 - Array logging logic
093700210928
093800210928           IF INVRIDX   > WS-ARRAY1-MAX-USED
093900210928               MOVE INVRIDX                TO WS-ARRAY1-MAX-USED
094000210928           END-IF.
094100210928
094200210928      * RFS49699 - End
094300210928           MOVE CURR-ACCOUNT-NO
094400210928             TO WS-ARRAY-INVR-ACCOUNT-NO
094500210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
094600210928           MOVE CURR-CONTRACT-NO
094700210928             TO WS-ARRAY-INVR-CONTRACT-NO
094800210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
094900210928           MOVE CURR-INVESTMENT-CODE
095000210928             TO WS-ARRAY-INVR-INVEST-CODE
095100210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
095200210928           MOVE CURR-RESET-NO
095300210928             TO WS-ARRAY-INVR-RESET-NO
095400210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
095500210928           MOVE CURR-OPENING-UNIT-BAL
095600210928             TO WS-ARRAY-INVR-UNIT-BAL
095700210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
095800210928           MOVE CURR-GUAR-DEATH-VALUE-BEF
095900210928             TO WS-ARRAY-INVR-GDV
096000210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
096100210928           MOVE CURR-GUAR-DEATH-VAL-CUR-BEF
096200210928             TO WS-ARRAY-INVR-GDV-CUR
096300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
096400210928
096500210928           MOVE "N" TO WS-INV-SEG-FIRST-PASS.
096600210928           GO TO GCR-0010.
096700210928
096800210928       GCR-EXIT.
096900210928           EXIT.
097000210928      /
097100210928       DETAIL-PROCESSING.
097200210928      *    DISPLAY "DETAIL-PROCESSING.............".
097300210928
097400210928      *    MOVE HIGH-VALUES TO CURR-CONTROLS.
097500210928
097600210928           MOVE "Y" TO WS-FIRST-RECALC-PASS.
097700210928           MOVE "N" TO WS-SQL-FILE-OPEN.
097800210928
097900210928           MOVE "OPEN SEGEXTSQ" TO WS-SQLERR-STATEMENT.
098000210928           EXEC SQL
098100210928                OPEN SEGEXTSQ
098200210928           END-EXEC.
098300210928
098400210928R24316     MOVE "Y" TO WS-SQL-FILE-OPEN.
098500210928
098600210928           IF SQLCODE = 0
098700210928              CONTINUE
098800210928           ELSE
098900210928              PERFORM DISPLAY-ERROR-INFO THRU DRI-EXIT
099000210928              GO TO DPR-EXIT
099100210928           END-IF.
099200210928
099300210928      *    DISPLAY "SQL FILE OPENED.............".
099400210928      *    MOVE "Y" TO WS-SQL-FILE-OPEN.
099500210928
099600210928       DPR-0010.
099700210928      *    DISPLAY "DPR-0010.................".
099800210928
099900210928           MOVE "FETCH SEGEXTSQ" TO WS-SQLERR-STATEMENT.
100000210928           EXEC SQL
100100210928              FETCH NEXT FROM SEGEXTSQ
100200210928               INTO :WS-SQL-PROCESS-DATE,   :WS-SQL-PROC-SEQ-NO,
100300210928                    :WS-SQL-PLACEMENT-DATE, :WS-SQL-TRANS-NO
100400210928           END-EXEC.
100500210928
100600210928           IF SQLCODE = 0
100700210928              CONTINUE
100800210928           ELSE
100900210928              GO TO DPR-CLOSE
101000210928           END-IF.
101100210928
101200210928
101300210928      * This routine will determine if txn is excluded or not
101400210928      * for GDV recalculation.
101500210928           MOVE "N"                     TO WS-EXCLUDE-TRANS.
101600210928
101700210928           INITIALIZE MFATRNP OF TRANS-REC.
101800210928           MOVE WS-SQL-PLACEMENT-DATE
101900210928             TO PLACEMENT-DATE OF TRANS.
102000210928           MOVE WS-SQL-TRANS-NO
102100210928             TO TRANS-NO OF TRANS.
102200210928
102300210928           READ TRANS
102400210928                INVALID KEY
102500210928                GO TO DPR-0010.
102600210928
102700210928180708     INITIALIZE WS-PLACEMENTDATE WS-TRANSNO.
102800210928180708     MOVE PLACEMENT-DATE OF TRANS  TO WS-PLACEMENTDATE.
102900210928180708     MOVE TRANS-NO OF TRANS        TO WS-TRANSNO.
103000210928           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
103100210928
103200210928      * If exclude-trans-flag = 'Y' bypass the trans otherwise
103300210928      * process the trans.
103400210928
103500210928           IF EXCLUDE-TRANS-FLAG = "Y"
103600210928              GO TO DPR-0010
103700210928           END-IF.
103800210928
103900210928           IF ACCOUNT-NO OF TRANS NOT = COMM-ACCOUNT-NO
104000210928              GO TO DPR-EXIT
104100210928           END-IF.
104200210928
104300210928           IF PROCESS-DATE OF TRANS > COMM-PROCESS-DATE
104400210928              GO TO DPR-EXIT
104500210928           END-IF.
104600210928
104700210928           IF PROCESS-DATE OF TRANS < COMM-EFFECT-DATE
104800210928              GO TO DPR-EXIT
104900210928           END-IF.
105000210928
105100210928           IF PROCESS-DATE OF TRANS = COMM-EFFECT-DATE
105200210928              GO TO DPR-0010
105300210928           END-IF.
105400210928
105500210928           MOVE TRANS-TYPE-CODE OF TRANS
105600210928             TO TRANS-CATEGORY.
105700210928           MOVE TRANS-STATUS-CODE OF TRANS
105800210928             TO TRANS-STATUS-CATEGORY.
105900210928           MOVE REVERSE OF TRANS
106000210928             TO TRANS-REVERSE-CATEGORY.
106100210928
106200210928           IF TRANS-REVERSED OR
106300210928              NOT HISTORY OR
106400210928              NOT VALID-TRANSACTION
106500210928              GO TO DPR-0010
106600210928           END-IF.
106700210928
106800210928      *    DISPLAY "TRANS FOUND!!!!!!!!!!!!!!!".
106900210928           INITIALIZE MFATRCODP OF TRANS-CONT-DTL-R-REC.
107000210928           MOVE PLACEMENT-DATE OF TRANS
107100210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-R.
107200210928           MOVE TRANS-NO OF TRANS
107300210928             TO TRANS-NO OF TRANS-CONTRACT-DTL-R.
107400210928           MOVE CURR-CONTRACT-NO
107500210928             TO CONTRACT-NO OF TRANS-CONTRACT-DTL-R.
107600210928
107700210928           READ TRANS-CONTRACT-DTL-R WITH NO LOCK
107800210928                INVALID KEY
107900210928                GO TO DPR-0010.
108000210928
108100210928           IF REVERSED-DDS OF TRANS-CONTRACT-DTL-R = "Y"
108200210928              GO TO DPR-0010
108300210928           END-IF.
108400210928
108500210928      * Get the GBV from Trans-GBV-Transfer it it exists
108600210928           MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
108700210928           INITIALIZE MFATRACXP OF TRANS-GBV-TRANSFER-REC.
108800210928           IF BUY-TRANSACTION
108900210928R49898        OR SWITCH-IN-TRANSACTION
109000210928              MOVE WS-SQL-PLACEMENT-DATE
109100210928                TO PLACEMENT-DATE OF TRANS-GBV-TRANSFER
109200210928              MOVE WS-SQL-TRANS-NO
109300210928                TO TRANS-NO OF TRANS-GBV-TRANSFER
109400210928
109500210928              READ TRANS-GBV-TRANSFER
109600210928                   INVALID KEY
109700210928                   GO TO DPR-0020
109800210928              END-READ
109900210928
110000210928              MOVE "Y" TO WS-XFER-AMT-EXISTS-FLAG
110100210928           END-IF.
110200210928
110300210928       DPR-0020.
110400210928           MOVE UNIT-AMT OF TRANS TO WS-CURR-TRANS-UNIT-AMT.
110500210928           MOVE UNIT-PRICE OF TRANS TO WS-CURR-TRANS-UNIT-PRICE.
110600210928           MOVE TRADE-DATE OF TRANS TO WS-CURR-TRANS-TRADE-DATE.
110700210928           MOVE NET-AMT OF TRANS TO WS-CURR-TRANS-NET-AMT.
110800210928           MOVE GROSS-AMT OF TRANS TO WS-CURR-TRANS-GROSS-AMT.
110900210928           MOVE ACCOUNT-NO OF TRANS TO CURR-ACCOUNT-NO.
111000210928           MOVE INVESTMENT-CODE OF TRANS TO CURR-INVESTMENT-CODE.
111100210928           MOVE PLACEMENT-DATE OF TRANS
111200210928             TO WS-CURR-TRANS-PLACEMENT-DATE.
111300210928           MOVE TRANS-NO OF TRANS TO WS-CURR-TRANS-TRANS-NO.
111400210928           MOVE "Y" TO WS-GET-LOAD-STRUCTURE.
111500210928           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
111600210928
111700210928           IF REDEMPTION-TRANSACTION
111800210928              COMPUTE WS-CURR-TRANS-GROSS-AMT ROUNDED =
111900210928                      ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R *
112000210928                      UNIT-PRICE OF TRANS
112100210928           END-IF.
112200210928           MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R
112300210928             TO WS-CURR-ORIG-UNIT-BAL.
112400210928
112500210928           PERFORM SET-INTERNAL-ARRAY-POINTER THRU SIAP-EXIT.
112600210928           IF ARRAY-POINTER-NOT-FOUND
112700210928      *       DISPLAY "ARRAY POINTER NOT FOUND!!!!!!!!"
112800210928              GO TO DPR-0010
112900210928           END-IF.
113000210928
113100210928           IF BUY-TRANSACTION
113200210928              MOVE "Y" TO WS-GET-LOAD-STRUCTURE
113300210928              PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT
113400210928              MOVE GDV-CHANGE OF TRANS-CONTRACT-DTL-R TO
113500210928                                               WS-CURR-TRANS-AMT-CUR
113600210928
113700210928      * If TRANSFER-AMT-EXISTS is TRUE, GBV should be coming from
113800210928      * the Trans-GBV-Transfer file
113900210928              IF TRANSFER-AMT-EXISTS
114000210928                 MOVE GUAR-BASE-VALUE OF TRANS-GBV-TRANSFER
114100210928                   TO WS-CURR-TRANS-AMT-CUR
114200210928                 COMPUTE WS-CURR-TRANS-AMT-CUR ROUNDED
114300210928                       = WS-CURR-TRANS-AMT-CUR *
114400210928                         CURR-DEATH-PERCENT / 100
114500210928              END-IF
114600210928
114700210928              IF WS-CURRENCY NOT = UNITRAX-BASE-CURRENCY
114800210928                 MOVE WS-CURRENCY TO WS-EXCH-CURRENCY
114900210928                 MOVE WS-CURR-TRANS-PLACEMENT-DATE
115000210928                   TO WS-EXCH-PLACEMENT-DATE
115100210928                 MOVE WS-CURR-TRANS-TRANS-NO TO WS-EXCH-TRANS-NO
115200210928                 MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
115300210928                 PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
115400210928                 COMPUTE WS-CURR-TRANS-AMT ROUNDED =
115500210928                         WS-CURR-TRANS-AMT-CUR / WS-EXCH-RATE-VALUE
115600210928              ELSE
115700210928                 MOVE WS-CURR-TRANS-AMT-CUR TO WS-CURR-TRANS-AMT
115800210928              END-IF
115900210928              ADD WS-CURR-ORIG-UNIT-BAL
116000210928               TO WS-ARRAY-INVR-UNIT-BAL
116100210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
116200210928
116300210928              ADD WS-CURR-TRANS-AMT
116400210928               TO WS-ARRAY-INVR-GDV
116500210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
116600210928
116700210928              ADD WS-CURR-TRANS-AMT-CUR
116800210928               TO WS-ARRAY-INVR-GDV-CUR
116900210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
117000210928
117100210928              PERFORM UPD-ACC-CON-INV-BUY THRU UACIB-EXIT
117200210928              ADD WS-CURR-TRANS-AMT
117300210928                TO GUAR-DEATH-VALUE OF TRANS-CONTRACT-DTL-R
117400210928              ADD WS-CURR-TRANS-AMT-CUR
117500210928                TO GUAR-DEATH-VALUE-CUR OF TRANS-CONTRACT-DTL-R
117600210928              REWRITE TRANS-CONT-DTL-R-REC
117700210928              GO TO DPR-0010
117800210928           END-IF.
117900210928
117901211007111744        INITIALIZE ln_InvArraySize
117902211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
118000210928           SET OLD-INVRIDX TO INVRIDX.
118100210928           INITIALIZE WS-OTHER-VARIABLES WS-ACC-CONT-INV-ARRAYX.
118101211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
118102211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
118103211007111744     INITIALIZE WS-ARRAY-ACCOUNT-NO(IVS-CNT1)
118104211007111744                WS-ARRAY-CONTRACT-NO(IVS-CNT1)
118105211007111744                WS-ARRAY-INVESTMENT-CODE(IVS-CNT1)
118106211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
118107211007111744                WS-ARRAY-BEFORE-MV(IVS-CNT1)
118108211007111744                WS-ARRAY-BEFORE-GDV(IVS-CNT1)
118109211007111744                WS-ARRAY-AFTER-MV(IVS-CNT1)
118110211007111744                WS-ARRAY-INV-EXCH-RATE(IVS-CNT1)
118111211007111744     END-PERFORM
118112211007
118200210928           PERFORM CALC-CONTRACT-MARKET-VALUE THRU CCMV-EXIT.
118300210928           MOVE "N" TO WS-TRANSFER-GBV.
118400210928           IF SWITCH-IN-TRANSACTION
118500210928              MOVE CONTRACT-NO OF TRANS-CONTRACT-DTL-R
118600210928                   TO WS-TO-CONTRACT-NO
118700210928              PERFORM GET-SEG-TRANSFER-PARAMETERS THRU GSTP-EXIT
118800210928           END-IF.
118900210928           PERFORM CALC-NEW-CHANGE-GDV THRU CNCG-EXIT.
119000210928           PERFORM RECALC-GDV-VALUES THRU RGV-EXIT.
119100210928           PERFORM CHECK-GDV-ROUNDING THRU CGR-EXIT.
119200210928           SET INVRIDX TO OLD-INVRIDX.
119300210928
119400210928           MOVE "N" TO WS-FIRST-RECALC-PASS.
119500210928
119600210928           GO TO DPR-0010.
119700210928
119800210928       DPR-CLOSE.
119900210928
120000210928           MOVE "CLOSE SEGEXTSQ" TO WS-SQLERR-STATEMENT.
120100210928           EXEC SQL
120200210928             CLOSE SEGEXTSQ
120300210928           END-EXEC.
120400210928
120500210928       DPR-EXIT.
120600210928           EXIT.
120700210928
120800210928      /
120900210928       SET-INTERNAL-ARRAY-POINTER.
121000210928           MOVE "N" TO WS-ARRAY-POINTER.
121100210928           SET INVRIDX TO 1.
121200210928
121300210928           SEARCH WS-ACC-CONT-INV-RESET-ARRAY VARYING INVRIDX
121400210928           WHEN WS-ARRAY-INVR-ACCOUNT-NO(INVRIDX) = COMM-ACCOUNT-NO AND
121500210928              WS-ARRAY-INVR-INVEST-CODE(INVRIDX) = CURR-INVESTMENT-CODE
121600210928              MOVE "Y" TO WS-ARRAY-POINTER
121700210928              GO TO SIAP-EXIT
121800210928           WHEN WS-ARRAY-INVR-ACCOUNT-NO(INVRIDX) = 0 OR
121900210928                WS-ARRAY-INVR-INVEST-CODE(INVRIDX) = " "
122000210928              GO TO SIAP-EXIT
122100210928           END-SEARCH.
122200210928
122300210928       SIAP-EXIT.
122400210928           EXIT.
122500210928      /
122600210928       UPD-ACC-CON-INV-BUY.
122700210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-REC.
122800210928           MOVE CURR-ACCOUNT-NO
122900210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
123000210928           MOVE CURR-CONTRACT-NO
123100210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
123200210928           MOVE CURR-INVESTMENT-CODE
123300210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
123400210928
123500210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
123600210928                INVALID KEY
123700210928                GO TO UACIB-EXIT.
123800210928
123900210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
124000210928            TO OLD-GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
124100210928           MOVE GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
124200210928            TO OLD-GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
124300210928
124400210928           MOVE WS-ARRAY-INVR-GDV-CUR
124500210928             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
124600210928             TO GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
124700210928           IF WS-CURRENCY = UNITRAX-BASE-CURRENCY
124800210928              MOVE WS-ARRAY-INVR-GDV-CUR
124900210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
125000210928                TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
125100210928           ELSE
125200210928              MOVE WS-ARRAY-INVR-GDV
125300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
125400210928                TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
125500210928           END-IF.
125600210928
125700210928           REWRITE ACC-CON-INV-REC.
125800210928
125900210928       UACIB-EXIT.
126000210928           EXIT.
126100210928      /
126200210928       CALC-CONTRACT-MARKET-VALUE.
126300210928
126400210928           SET INVRIDX TO 1.
126500210928           SET INVRIDX DOWN BY 1.
126600210928
126700210928           SET CONTIDX TO 1.
126800210928           SET CONTIDX DOWN BY 1.
126900210928
127000210928       CCMV-0010.
127100210928           SET INVRIDX UP BY 1.
127200210928      * RFS49699 - Array logging logic
127300210928
127400210928           IF INVRIDX  > WS-ARRAY1-MAX-USED
127500210928               MOVE INVRIDX                TO WS-ARRAY1-MAX-USED
127600210928           END-IF.
127700210928
127800210928      * RFS49699 - End
127900210928
128000210928           IF WS-ARRAY-INVR-ACCOUNT-NO
128100210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
128200210928              WS-ARRAY-INVR-CONTRACT-NO
128300210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
128400210928              WS-ARRAY-INVR-RESET-NO
128500210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
128600210928              WS-ARRAY-INVR-INVEST-CODE
128700210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = " "
128800210928              GO TO CCMV-EXIT.
128900210928
129000210928           MOVE "N" TO WS-DIFF-INVESTMENT-FLAG.
129100210928           IF CURR-INVESTMENT-CODE NOT =
129200210928              WS-ARRAY-INVR-INVEST-CODE OF
129300210928                 WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
129400210928              MOVE "Y" TO WS-DIFF-INVESTMENT-FLAG
129500210928           END-IF.
129600210928
129700210928           MOVE CURR-INVESTMENT-CODE TO WS-OLD-CURR-INVESTMENT-CODE.
129800210928           MOVE WS-ARRAY-INVR-INVEST-CODE
129900210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
130000210928             TO CURR-INVESTMENT-CODE
130100210928                WS-CONT-INVESTMENT-CODE.
130200210928           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
130300210928           MOVE WS-OLD-CURR-INVESTMENT-CODE TO CURR-INVESTMENT-CODE.
130400210928
130500210928           IF WS-CURRENCY NOT = UNITRAX-BASE-CURRENCY
130600210928              MOVE WS-CURRENCY TO WS-EXCH-CURRENCY
130700210928              MOVE WS-CURR-TRANS-PLACEMENT-DATE
130800210928                   TO WS-EXCH-PLACEMENT-DATE
130900210928              MOVE WS-CURR-TRANS-TRANS-NO TO WS-EXCH-TRANS-NO
131000210928              MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
131100210928              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
131200210928              IF WS-EXCH-RATE-VALUE = 0 OR
131300210928                 WS-EXCHANGE-FOUND NOT = "Y"
131400210928                 MOVE "06" TO WS-REJECTION-CODE
131500210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
131600210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
131700210928                 MOVE WS-EXCH-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
131800210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
131900210928                 MOVE WS-EXCH-TRANS-NO TO WS-MISC-INFO-2-KEY-2
132000210928                 PERFORM LOG-ERROR THRU LER-EXIT
132100210928                 GO TO CCMV-EXIT
132200210928              END-IF
132300210928           ELSE
132400210928              MOVE "Y" TO WS-EXCHANGE-FOUND
132500210928              MOVE 1.0 TO WS-EXCH-RATE-VALUE
132600210928           END-IF.
132700210928
132800210928           IF CURR-INVESTMENT-CODE NOT = WS-CONT-INVESTMENT-CODE
132900210928              PERFORM GET-INVESTMENT-MARKET-VALUE THRU GIMV-EXIT
133000210928              IF WS-PRICE-FOUND NOT = "Y" OR
133100210928                 WS-INV-UNIT-PRICE = 0
133200210928                 MOVE "05" TO WS-REJECTION-CODE
133300210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
133400210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
133500210928                 MOVE WS-EXCH-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
133600210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
133700210928                 MOVE WS-EXCH-TRANS-NO TO WS-MISC-INFO-2-KEY-2
133800210928                 PERFORM LOG-ERROR THRU LER-EXIT
133900210928                 GO TO CCMV-EXIT
134000210928              END-IF
134100210928           ELSE
134200210928              MOVE WS-CURR-TRANS-UNIT-PRICE TO WS-INV-UNIT-PRICE
134300210928           END-IF.
134400210928
134500210928       CCMV-0020.
134600210928           MOVE WS-ARRAY-INVR-UNIT-BAL
134700210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
134800210928             TO WS-INV-OPENING-UNIT-BAL.
134900210928
135000210928      ** Calculate the market value of the investment before this trade.
135100210928           IF WS-CURRENCY = UNITRAX-BASE-CURRENCY
135200210928              COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
135300210928                      WS-INV-OPENING-UNIT-BAL * WS-INV-UNIT-PRICE
135400210928           ELSE
135500210928              COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
135600210928                      WS-INV-OPENING-UNIT-BAL *
135700210928                      WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
135800210928           END-IF.
135900210928
136000210928      * Get the GDV of the current account/contract/investment
136100210928           IF FIRST-RECALC-PASS
136200210928              MOVE WS-ARRAY-INVR-GDV
136300210928                   OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
136400210928                TO WS-INV-BEF-GDV
136500210928           ELSE
136600210928           MOVE WS-ARRAY-INVR-ACCOUNT-NO
136700210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
136800210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
136900210928           MOVE WS-ARRAY-INVR-CONTRACT-NO
137000210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
137100210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
137200210928           MOVE WS-ARRAY-INVR-INVEST-CODE
137300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
137400210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-SWI
137500210928
137600210928           READ ACCOUNT-CONTRACT-INVEST-SWI
137700210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
137800210928                TO WS-INV-BEF-GDV
137900210928           END-IF.
138000210928
138100210928           IF CURR-INVESTMENT-CODE = WS-CONT-INVESTMENT-CODE
138200210928              IF NOT SWITCH-IN-TRANSACTION
138300210928                 SUBTRACT WS-CURR-ORIG-UNIT-BAL FROM
138400210928                          WS-ARRAY-INVR-UNIT-BAL
138500210928                             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
138600210928              ELSE
138700210928                 ADD WS-CURR-ORIG-UNIT-BAL
138800210928                       TO WS-ARRAY-INVR-UNIT-BAL
138900210928                             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
139000210928              END-IF
139100210928           END-IF.
139200210928
139300210928           IF WS-CURRENCY = UNITRAX-BASE-CURRENCY
139400210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
139500210928                 WS-ARRAY-INVR-UNIT-BAL
139600210928                    OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) *
139700210928                       WS-INV-UNIT-PRICE
139800210928           ELSE
139900210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
140000210928                 WS-ARRAY-INVR-UNIT-BAL
140100210928                    OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) *
140200210928                       WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
140300210928           END-IF.
140400210928
140500210928           ADD WS-INV-BEF-GDV TO WS-CURR-CONTRACT-GDV-BEF.
140600210928           ADD WS-INV-BEF-MARKET-VALUE TO WS-CONT-INV-MARKET-VALUE.
140700210928           ADD WS-INV-AFT-MARKET-VALUE TO WS-CURR-CONTRACT-MV-AFT.
140800210928
140900210928           SET CONTIDX UP BY 1.
141000210928      * RFS49699 - Array logging logic
141100210928
141200210928           IF CONTIDX > WS-ARRAY2-MAX-USED
141300210928               MOVE CONTIDX                TO WS-ARRAY2-MAX-USED
141400210928           END-IF.
141500210928
141600210928      * RFS49699 - End
141601211007      * RFS49699 - End
141602211007           IF CONTIDX >  ln_InvArraySize
141603211007              COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
141604211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(CONTIDX)
141605211007                      WS-ARRAY-CONTRACT-NO(CONTIDX)
141606211007                      WS-ARRAY-INVESTMENT-CODE(CONTIDX)
141607211007                      WS-ARRAY-INV-CURR-CODE(CONTIDX)
141608211007                      WS-ARRAY-BEFORE-MV(CONTIDX)
141609211007                      WS-ARRAY-BEFORE-GDV(CONTIDX)
141610211007                      WS-ARRAY-AFTER-MV(CONTIDX)
141611211007                      WS-ARRAY-INV-EXCH-RATE(CONTIDX)
141612211007           END-IF
141613211007      *    RFS1117445 End
141614211007
141700210928           MOVE CURR-ACCOUNT-NO TO WS-ARRAY-ACCOUNT-NO(CONTIDX).
141800210928           MOVE WS-CONT-INVESTMENT-CODE
141900210928                TO WS-ARRAY-INVESTMENT-CODE(CONTIDX).
142000210928           MOVE CURR-CONTRACT-NO TO WS-ARRAY-CONTRACT-NO(CONTIDX).
142100210928           MOVE WS-CURRENCY TO WS-ARRAY-INV-CURR-CODE(CONTIDX).
142200210928           MOVE WS-INV-BEF-MARKET-VALUE TO WS-ARRAY-BEFORE-MV(CONTIDX).
142300210928           MOVE WS-INV-BEF-GDV TO WS-ARRAY-BEFORE-GDV(CONTIDX).
142400210928           MOVE WS-INV-AFT-MARKET-VALUE TO WS-ARRAY-AFTER-MV(CONTIDX).
142500210928           MOVE WS-EXCH-RATE-VALUE TO WS-ARRAY-INV-EXCH-RATE(CONTIDX).
142600210928
142700210928           ADD 1 TO WS-CONT-INV-ARRAY-COUNT.
142800210928
142900210928           GO TO CCMV-0010.
143000210928
143100210928       CCMV-EXIT.
143200210928           EXIT.
143300210928      /
143400210928       CALC-NEW-CHANGE-GDV.
143500210928
143600210928      ** Get the change in GDV from the out transaction
143700210928           IF WS-TRANSFER-GBV = "Y" AND SWITCH-IN-TRANSACTION
143800210928              MOVE ZEROES TO WS-SWO-GDV-CHANGE
143900210928              PERFORM GET-GDV-CHANGE THRU GGC-EXIT
144000210928           END-IF.
144100210928
144200210928      ** Calculate the GDV change
144300210928           IF REDEMPTION-TRANSACTION
144400210928              IF WS-CONT-INV-MARKET-VALUE NOT = 0
144500210928              COMPUTE WS-GDV-CHANGE ROUNDED = WS-CURR-CONTRACT-GDV-BEF *
144600210928                      WS-CURR-TRANS-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
144700210928              ELSE
144800210928               MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GDV-CHANGE
144900210928              END-IF
145000210928           ELSE
145100210928              IF WS-TRANSFER-GBV = "N" AND PURCHASE-TRANSACTION
145200210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GDV-CHANGE
145300210928              ELSE
145400210928                 IF WS-TRANSFER-GBV = "Y" AND PURCHASE-TRANSACTION
145500210928                    MOVE WS-SWO-GDV-CHANGE TO WS-GDV-CHANGE
145600210928                 END-IF
145700210928              END-IF
145800210928           END-IF.
145900210928
146000210928           IF SWITCH-OUT OR TRANSFER-OUT
146100210928              MOVE WS-GDV-CHANGE TO WS-SWO-GDV-CHANGE
146200210928                                    WS-GDV-CHANGE-AMT
146300210928           END-IF.
146400210928
146500210928           IF SWITCH-IN OR TRANSFER-IN
146600210928              ADD WS-GDV-CHANGE TO WS-CURR-CONTRACT-GDV-BEF
146700210928                  GIVING WS-CURR-CONTRACT-GDV-AFT
146800210928           ELSE
146900210928              SUBTRACT WS-GDV-CHANGE FROM WS-CURR-CONTRACT-GDV-BEF
147000210928                  GIVING WS-CURR-CONTRACT-GDV-AFT
147100210928           END-IF.
147200210928
147300210928       CNCG-EXIT.
147400210928           EXIT.
147500210928      /
147600210928       GET-GDV-CHANGE.
147700210928      * Get the fee charges for the out transaction.
147800210928           MOVE 0 TO WS-DEDUCTION-AMT.
147900210928           MOVE PLACEMENT-DATE OF TRANS-OFFSET
148000210928                TO WS-TRN-PLACEMENT-DATE.
148100210928           MOVE TRANS-NO       OF TRANS-OFFSET TO WS-TRN-TRANS-NO.
148200210928           MOVE PROCESS-DATE   OF TRANS-OFFSET TO WS-TRN-PROCESS-DATE.
148300210928           PERFORM GET-DEDUCTION-AMT THRU GDA-EXIT.
148400210928
148500210928           INITIALIZE MFATRCTGP OF TRANS-CONTRACT-TGT-REC.
148600210928           MOVE WS-CURR-TRANS-PLACEMENT-DATE
148700210928             TO PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET2.
148800210928           MOVE WS-CURR-TRANS-TRANS-NO
148900210928             TO TRANS-NO-2 OF TRANS-CONTRACT-TARGET2.
149000210928           MOVE CURR-CONTRACT-NO
149100210928             TO CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET2.
149200210928
149300210928           START TRANS-CONTRACT-TARGET2
149400210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
149500210928                 INVALID KEY
149600210928                 GO TO GGC-0500.
149700210928
149800210928       GGC-0010.
149900210928           READ TRANS-CONTRACT-TARGET2 NEXT RECORD
150000210928                AT END
150100210928                GO TO GGC-0500.
150200210928
150300210928           IF WS-CURR-TRANS-PLACEMENT-DATE NOT =
150400210928              PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET2 OR
150500210928              WS-CURR-TRANS-TRANS-NO NOT =
150600210928              TRANS-NO-2 OF TRANS-CONTRACT-TARGET2 OR
150700210928              CURR-CONTRACT-NO NOT =
150800210928              CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET2
150900210928              GO TO GGC-0500
151000210928           END-IF.
151100210928
151200210928           INITIALIZE MFATRCODP OF TRANS-CON-DTL-REC.
151300210928           MOVE PLACEMENT-DATE OF TRANS-CONTRACT-TARGET2
151400210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS.
151500210928           MOVE TRANS-NO OF TRANS-CONTRACT-TARGET2
151600210928             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
151700210928           MOVE CONTRACT-NO OF TRANS-CONTRACT-TARGET2
151800210928             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
151900210928
152000210928           READ TRANS-CONTRACT-DETAILS
152100210928                INVALID KEY
152200210928                GO TO GGC-0500.
152300210928
152400210928           IF WS-DEDUCTION-AMT > 0
152500210928                GO TO GGC-0020.
152600210928
152700210928           ADD GDV-CHANGE OF TRANS-CONTRACT-DETAILS
152800210928             TO WS-SWO-GDV-CHANGE.
152900210928
153000210928           GO TO GGC-0010.
153100210928
153200210928       GGC-0020.
153300210928
153400210928           COMPUTE WS-OUT-TRANS-GROSS ROUNDED =
153500210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
153600210928                   UNIT-PRICE OF TRANS-OFFSET.
153700210928
153800210928      * Apply the deductions on the out-side of the transaction
153900210928           COMPUTE WS-DEDUCTION-PROP ROUNDED =
154000210928                   WS-OUT-TRANS-GROSS / GROSS-AMT OF TRANS-OFFSET
154100210928                   * WS-DEDUCTION-AMT.
154200210928
154300210928           COMPUTE WS-DEDUCTION-GDV-CHANGE ROUNDED =
154400210928                  WS-DEDUCTION-PROP *
154500210928                  GDV-CHANGE OF TRANS-CONTRACT-DETAILS  /
154600210928                  WS-OUT-TRANS-GROSS.
154700210928
154800210928           COMPUTE WS-SWO-GDV-CHANGE ROUNDED
154900210928                 = WS-SWO-GDV-CHANGE +
155000210928                   GDV-CHANGE OF TRANS-CONTRACT-DETAILS -
155100210928                   WS-DEDUCTION-GDV-CHANGE.
155200210928
155300210928           GO TO GGC-0010.
155400210928
155500210928       GGC-0500.
155600210928      * Get the fee charges for the IN  transaction.
155700210928           MOVE 0 TO WS-DEDUCTION-AMT.
155800210928           MOVE PLACEMENT-DATE OF TRANS
155900210928                TO WS-TRN-PLACEMENT-DATE.
156000210928           MOVE TRANS-NO       OF TRANS        TO WS-TRN-TRANS-NO.
156100210928           MOVE PROCESS-DATE   OF TRANS        TO WS-TRN-PROCESS-DATE.
156200210928           PERFORM GET-DEDUCTION-AMT THRU GDA-EXIT.
156300210928
156400210928           IF WS-DEDUCTION-AMT <= 0
156500210928              GO TO GGC-EXIT.
156600210928
156700210928           COMPUTE WS-IN-TRANS-GROSS ROUNDED =
156800210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R   *
156900210928                   UNIT-PRICE OF TRANS.
157000210928
157100210928           COMPUTE WS-DEDUCTION-PROP ROUNDED =
157200210928                   WS-IN-TRANS-GROSS / NET-AMT OF TRANS
157300210928                   * WS-DEDUCTION-AMT.
157400210928
157500210928           COMPUTE WS-DEDUCTION-GDV-CHANGE ROUNDED =
157600210928                  WS-DEDUCTION-PROP * WS-SWO-GDV-CHANGE /
157700210928                  WS-IN-TRANS-GROSS.
157800210928
157900210928           COMPUTE WS-SWO-GDV-CHANGE ROUNDED
158000210928                 = WS-SWO-GDV-CHANGE -
158100210928                   WS-DEDUCTION-GDV-CHANGE.
158200210928
158300210928       GGC-EXIT.
158400210928           EXIT.
158500210928      /
158600210928       RECALC-GDV-VALUES.
158700210928
158800210928           IF WS-REJECTION-CODE NOT = " " AND "00"
158900210928              GO TO RGV-EXIT
159000210928           END-IF.
159100210928
159200210928           INITIALIZE WS-CONT-INV-COUNT WS-INV-GDV-PERCENT-TOTAL
159300210928                                        WS-CONT-GDV-AFT-TOTAL.
159400210928           SET CONTIDX TO 1.
159500210928           SET CONTIDX DOWN BY 1.
159600210928
159700210928       RGV-NEXT.
159800210928           SET CONTIDX UP BY 1.
159801211007
159802211007111744     IF CONTIDX > WS-CONT-INV-ARRAY-COUNT
159803211007111744        GO TO RGV-EXIT
159804211007111744     END-IF
159805211007
159900210928           IF WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
160000210928              IS EQUAL TO 0 OR
160100210928              WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
160200210928              IS EQUAL TO 0 OR
160300210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
160301211007              IS EQUAL TO " "  OR
160302211007111744        CONTIDX > WS-CONT-INV-ARRAY-COUNT
160500210928              GO TO RGV-EXIT
160600210928           END-IF.
160700210928
160800210928       RGV-PROCESS.
160900210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-REC.
161000210928           MOVE WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
161100210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
161200210928           MOVE WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
161300210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
161400210928           MOVE WS-ARRAY-INVESTMENT-CODE
161500210928             OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
161600210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
161700210928
161800210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
161900210928                INVALID KEY
162000210928                GO TO RGV-NEXT.
162100210928
162200210928           IF SWITCH-IN OR TRANSFER-IN
162300210928              IF CURR-INVESTMENT-CODE =
162400210928                 WS-ARRAY-INVESTMENT-CODE
162500210928                    OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
162600210928                 IF WS-TRANSFER-GBV = "N"
162700210928                    MOVE WS-CURR-TRANS-GROSS-AMT TO WS-INV-GDV-AFT
162800210928                                                    WS-GDV-CHANGE-AMT
162900210928                 ELSE
163000210928                    MOVE WS-SWO-GDV-CHANGE TO WS-INV-GDV-AFT
163100210928                                              WS-GDV-CHANGE-AMT
163200210928                 END-IF
163300210928                 ADD WS-ARRAY-BEFORE-GDV
163400210928                    OF WS-ACC-CONT-INV-ARRAY(CONTIDX) TO WS-INV-GDV-AFT
163500210928                 MOVE "Y" TO WS-RECORD-FOUND
163600210928                 GO TO RGV-INFUND
163700210928              ELSE
163800210928                 MOVE "N" TO WS-RECORD-FOUND
163900210928                 GO TO RGV-NEXT
164000210928              END-IF
164100210928           END-IF.
164200210928           ADD 1 TO WS-CONT-INV-COUNT.
164300210928
164400210928           IF PURCHASE-TRANSACTION AND WS-CURR-CONTRACT-GDV-BEF = 0 AND
164500210928              WS-ARRAY-INVESTMENT-CODE
164600210928                OF WS-ACC-CONT-INV-ARRAY(CONTIDX) = CURR-INVESTMENT-CODE
164700210928              IF SWITCH-IN OR TRANSFER-IN
164800210928                 MOVE WS-SWO-GDV-CHANGE TO WS-INV-GDV-AFT
164900210928              ELSE
165000210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-INV-GDV-AFT
165100210928              END-IF
165200210928           ELSE
165300210928              IF WS-CURR-CONTRACT-MV-AFT NOT = 0
165400210928              COMPUTE WS-INV-GDV-PERCENT ROUNDED =
165500210928                   WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
165600210928              ELSE
165700210928                 MOVE 0 TO WS-INV-GDV-PERCENT
165800210928              END-IF
165900210928
166000210928           ADD WS-INV-GDV-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
166100210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
166200210928              WS-INV-GDV-PERCENT-TOTAL NOT = 1.000 AND
166300210928              WS-INV-GDV-PERCENT-TOTAL NOT = 0
166400210928              SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
166500210928                       GIVING WS-DUMMY-PERCENT
166600210928              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
166700210928              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
166800210928           ELSE
166900210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
167000210928                (WS-INV-GDV-PERCENT-TOTAL = 0.999 OR
167100210928                 WS-INV-GDV-PERCENT-TOTAL > 1.000)
167200210928                 SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
167300210928                          GIVING WS-DUMMY-PERCENT
167400210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
167500210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
167600210928              END-IF
167700210928           END-IF
167800210928
167900210928           COMPUTE WS-INV-GDV-AFT ROUNDED =
168000210928                   WS-CURR-CONTRACT-GDV-AFT * WS-INV-GDV-PERCENT
168100210928           END-IF.
168200210928
168300210928       RGV-INFUND.
168400210928           IF WS-ARRAY-INV-CURR-CODE(CONTIDX) = UNITRAX-BASE-CURRENCY
168500210928              MOVE WS-INV-GDV-AFT TO WS-INV-GDV-AFT-CUR
168600210928           ELSE
168700210928              COMPUTE WS-INV-GDV-AFT-CUR ROUNDED =
168800210928                      WS-INV-GDV-AFT * WS-ARRAY-INV-EXCH-RATE(CONTIDX)
168900210928           END-IF.
169000210928
169100210928           IF WS-INV-GDV-AFT IS NEGATIVE AND
169200210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
169300210928              IS EQUAL TO CURR-INVESTMENT-CODE
169400210928              MOVE 0 TO WS-INV-GDV-AFT
169500210928                        WS-INV-GDV-AFT-CUR
169600210928           END-IF.
169700210928
169800210928      * Update the Old GDV only if the transaction pertains tha        t
169900210928      * the right fund in the contract.
170000210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
170100210928              IS EQUAL TO CURR-INVESTMENT-CODE
170200210928           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
170300210928             TO OLD-GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
170400210928           MOVE GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
170500210928             TO OLD-GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
170600210928           END-IF.
170700210928
170800210928      ** Update the Trans-Contract-Details record with the new GDV
170900210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
171000210928              IS EQUAL TO CURR-INVESTMENT-CODE
171100210928              MOVE WS-INV-GDV-AFT
171200210928                TO GUAR-DEATH-VALUE OF TRANS-CONTRACT-DTL-R
171300210928      * Store the value of the change in GDV for trade reversal
171400210928              IF SWITCH-IN-TRANSACTION OR REDEMPTION-TRANSACTION
171500210928                 MOVE WS-GDV-CHANGE-AMT
171600210928                   TO GDV-CHANGE OF TRANS-CONTRACT-DTL-R
171700210928              ELSE
171800210928                 MOVE WS-INV-GDV-AFT-CUR
171900210928                   TO GUAR-DEATH-VALUE-CUR OF TRANS-CONTRACT-DTL-R
172000210928              END-IF
172100210928              REWRITE TRANS-CONT-DTL-R-REC
172200210928           END-IF.
172300210928
172400210928           MOVE WS-INV-GDV-AFT
172500210928                TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
172600210928           MOVE WS-INV-GDV-AFT-CUR
172700210928                TO GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
172800210928
172900210928           IF REDEMPTION-TRANSACTION
173000210928              ADD WS-INV-GDV-AFT TO WS-CONT-GDV-AFT-TOTAL
173100210928           END-IF.
173200210928
173300210928           REWRITE ACC-CON-INV-REC.
173400210928
173500210928           GO TO RGV-NEXT.
173600210928
173700210928       RGV-EXIT.
173800210928           EXIT.
173900210928      /
174000210928       CHECK-GDV-ROUNDING.
174100210928           IF PURCHASE-TRANSACTION
174200210928              GO TO CGR-EXIT
174300210928           END-IF.
174400210928
174500210928           MOVE "N" TO WS-GDV-DIFF-FLAG.
174600210928           MOVE 0   TO WS-GDV-DIFF-AMOUNT.
174700210928           MOVE "Y" TO WS-GDV-UPDATE-FLAG.
174800210928
174900210928           IF WS-CURR-CONTRACT-GDV-AFT NOT = WS-CONT-GDV-AFT-TOTAL
175000210928              MOVE "Y" TO WS-GDV-DIFF-FLAG
175100210928              SUBTRACT WS-CONT-GDV-AFT-TOTAL
175200210928                  FROM WS-CURR-CONTRACT-GDV-AFT
175300210928                GIVING WS-GDV-DIFF-AMOUNT
175400210928           END-IF.
175500210928
175600210928           IF GDV-DIFFERENCE-FOUND
175700210928              GO TO CGR-0010
175800210928           END-IF.
175900210928
176000210928           GO TO CGR-EXIT.
176100210928
176200210928       CGR-0010.
176300210928           INITIALIZE MFAACCCIP OF ACCOUNT-CONTRACT-INVEST.
176400210928           MOVE CURR-ACCOUNT-NO
176500210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST.
176600210928           MOVE CURR-CONTRACT-NO
176700210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST.
176800210928           MOVE SPACES TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST.
176900210928
177000210928           START ACCOUNT-CONTRACT-INVEST
177100210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
177200210928                 INVALID KEY
177300210928                 GO TO CGR-EXIT.
177400210928
177500210928       CGR-0020.
177600210928           READ ACCOUNT-CONTRACT-INVEST NEXT RECORD
177700210928                AT END
177800210928                GO TO CGR-EXIT.
177900210928
178000210928           IF CURR-ACCOUNT-NO NOT =
178100210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST OR
178200210928              CURR-CONTRACT-NO NOT =
178300210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST
178400210928              GO TO CGR-EXIT
178500210928           END-IF.
178600210928
178700210928           IF OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST = 0 OR
178800210928              CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST = 0
178900210928              GO TO CGR-0020
179000210928           END-IF.
179100210928
179200210928           IF GDV-DIFFERENCE-FOUND AND
179300210928              GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST = 0
179400210928              GO TO CGR-0020
179500210928           END-IF.
179600210928
179700210928           IF GDV-DIFFERENCE-FOUND AND GDV-NOT-UPDATED
179800210928              ADD WS-GDV-DIFF-AMOUNT
179900210928                  TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST
180000210928                     GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST
180100210928              MOVE "N" TO WS-GDV-UPDATE-FLAG
180200210928              REWRITE ACCT-CONT-INVEST-REC
180300210928                      INVALID KEY
180400210928                      MOVE "Y" TO WS-GDV-UPDATE-FLAG
180500210928              END-REWRITE
180600210928           END-IF.
180700210928
180800210928           IF (GDV-DIFFERENCE-FOUND AND GDV-NOT-UPDATED)
180900210928               GO TO CGR-0020
181000210928           END-IF.
181100210928
181200210928       CGR-EXIT.
181300210928           EXIT.
181400210928      /
181500210928       GET-INVESTMENT-MARKET-VALUE.
181600210928
181700210928           MOVE "OPEN INVPRC" TO WS-SQLERR-STATEMENT.
181800210928           EXEC SQL
181900210928             OPEN INVPRC
182000210928           END-EXEC.
182100210928
182200210928           IF SQLCODE = 0
182300210928              MOVE "Y" TO WS-PRICE-FOUND
182400210928              CONTINUE
182500210928           ELSE
182600210928              MOVE "N" TO WS-PRICE-FOUND
182700210928              MOVE 0 TO WS-INV-UNIT-PRICE
182800210928              GO TO GIMV-EXIT
182900210928           END-IF.
183000210928
183100210928           MOVE "FETCH INVPRC" TO WS-SQLERR-STATEMENT.
183200210928           EXEC SQL
183300210928             FETCH NEXT FROM INVPRC
183400210928              INTO :WS-INV-TRADE-DATE,
183500210928                   :WS-INV-UNIT-PRICE,
183600210928                   :WS-INV-DST-FLAG
183700210928           END-EXEC.
183800210928
183900210928           IF SQLCODE = 0
184000210928              MOVE "Y" TO WS-PRICE-FOUND
184100210928              CONTINUE
184200210928           ELSE
184300210928              MOVE "N" TO WS-PRICE-FOUND
184400210928              MOVE 0 TO WS-INV-UNIT-PRICE
184500210928           END-IF.
184600210928
184700210928           MOVE "CLOSE INVPRC" TO WS-SQLERR-STATEMENT.
184800210928           EXEC SQL
184900210928             CLOSE INVPRC
185000210928           END-EXEC.
185100210928
185200210928       GIMV-EXIT.
185300210928           EXIT.
185400210928
185500210928      /
185600210928       GET-INVESTMENT-CURRENCY.
185700210928
185800210928           EXEC SQL
185900210928             SELECT COALESCE(LOAD_STRUCTURE, " "),
186000210928                    COALESCE(CURRENCY, " ")
186100210928               INTO :WS-LOAD-STRUCTURE,
186200210928                    :WS-CURRENCY
186300210928               FROM MFAINVP
186400210928              WHERE INVESTMENT_CODE = :CURR-INVESTMENT-CODE
186500210928           END-EXEC.
186600210928
186700210928           IF SQLCODE = 100
186800210928              MOVE " "  TO WS-LOAD-STRUCTURE
186900210928              MOVE " "  TO WS-CURRENCY
187000210928           END-IF.
187100210928
187200210928       GIC-EXIT.
187300210928           EXIT.
187400210928      /
187500210928       GET-EXCHANGE-RATE-2.
187600210928
187700210928           IF WS-DIFF-INVESTMENT-FLAG = "Y"
187800210928              GO TO GER2-0010.
187900210928
188000210928           EXEC SQL
188100210928             SELECT COALESCE(EXCHANGE_RATE, 0),
188200210928                    COALESCE(CURRENCY, " ")
188300210928               INTO :WS-EXCH-RATE-VALUE,
188400210928                    :WS-EX-CURRENCY
188500210928               FROM MFATREXRP
188600210928              WHERE PLACEMENT_DATE  = :WS-EXCH-PLACEMENT-DATE AND
188700210928                    TRANS_NO = :WS-EXCH-TRANS-NO
188800210928           END-EXEC.
188900210928
189000210928           IF SQLCODE = 100
189100210928              GO TO GER2-0010
189200210928           END-IF.
189300210928
189400210928           IF WS-EX-CURRENCY NOT = WS-EXCH-CURRENCY OR
189500210928              WS-EXCH-RATE-VALUE = 0
189600210928                GO TO GER2-0010
189700210928           END-IF.
189800210928
189900210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
190000210928           GO TO GER2-EXIT.
190100210928
190200210928       GER2-0010.
190300210928
190400210928           EXEC SQL
190500210928             SELECT COALESCE(EXCHANGE_RATE, 0)
190600210928               INTO :WS-EXCH-RATE-VALUE
190700210928               FROM MFAEXRHMP
190800210928              WHERE TRADE_DATE  = :WS-EXCH-TRADE-DATE AND
190900210928                    CURRENCY = :WS-EXCH-CURRENCY AND
191000210928                  EXCHANGE_RATE_TYPE = :PROG-EXCHANGE-RATE-TYPE
191100210928           END-EXEC.
191200210928
191300210928           IF SQLCODE = 100
191400210928              GO TO GER2-EXIT
191500210928           END-IF.
191600210928
191700210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
191800210928
191900210928       GER2-EXIT.
192000210928           EXIT.
192100210928
192200210928      * ---------------------------------
192300210928       DISPLAY-ERROR-INFO.
192400210928      * ---------------------------------
192500210928           DISPLAY "ROUTINE-NAME =  " WS-ROUTINE-NAME.
192600210928           DISPLAY "SQL STATEMENT = " WS-SQLERR-STATEMENT.
192700210928           DISPLAY "COMM-ACCOUNT-NO..." COMM-ACCOUNT-NO.
192800210928           DISPLAY "COMM-CONTRACT-NO.." COMM-CONTRACT-NO.
192900210928           DISPLAY "COMM-RESET-NUMBER..." COMM-RESET-NUMBER.
193000210928       DRI-EXIT.
193100210928           EXIT.
193200210928
193300210928      /
193400210928       LOG-ERROR.
193500210928           INITIALIZE MFACTERRP OF CONTRACT-ERROR-LOG.
193600210928
193700210928           IF COMM-REJECTION-CODE = SPACES OR "00"
193800210928             MOVE WS-REJECTION-CODE TO COMM-REJECTION-CODE
193900210928           END-IF.
194000210928
194100210928           ACCEPT WS-SYSTIME-LONG FROM TIME.
194200210928           CALL "GETDAT" USING WS-SYSDATE-N.
194300210928
194400210928           MOVE WS-REJECTION-CODE
194500210928                             TO REJECTION-CODE OF CONTRACT-ERROR-LOG.
194600210928           MOVE INVESTOR-NO  OF ACCOUNT
194700210928                             TO INVESTOR-NO OF CONTRACT-ERROR-LOG.
194800210928           MOVE ACCOUNT-NO   OF ACCOUNT-CONTRACT-INV-RESET
194900210928                             TO ACCOUNT-NO OF CONTRACT-ERROR-LOG.
195000210928
195100210928           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-INV-RESET
195200210928                             TO CONTRACT-NO OF CONTRACT-ERROR-LOG.
195300210928           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
195400210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG.
195500210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
195600210928                             TO INVESTMENT-CODE
195700210928                             OF CONTRACT-ERROR-LOG.
195800210928
195900210928           MOVE COMM-CALLER-ID-CODE TO CALLER-ID-CODE
196000210928                             OF CONTRACT-ERROR-LOG.
196100210928           MOVE PROG-ID-CODE TO PROGRAM-ID-CODE
196200210928                             OF CONTRACT-ERROR-LOG.
196300210928           MOVE COMM-USER    TO AUDIT-USER OF CONTRACT-ERROR-LOG.
196400210928
196500210928           MOVE WS-MISC-INFO-AREA
196600210928                             TO MISC-INFO OF CONTRACT-ERROR-LOG.
196700210928           MOVE WS-SYSDATE-N TO AUDIT-DATE OF CONTRACT-ERROR-LOG.
196800210928           MOVE WS-SYSTIME-LONG-N
196900210928                             TO LOG-TIME OF CONTRACT-ERROR-LOG.
197000210928
197100210928           WRITE CONT-ERR-LOG-REC.
197200210928
197300210928           MOVE SPACES         TO WS-MISC-INFO-AREA.
197400210928
197500210928       LER-EXIT.
197600210928           EXIT.
197700210928      /
197800210928      *COPY CPYSEGRTNE.
197900210928       COPY CPYSEGRTNC.
198000210928       COPY CPYEXCLTRN.
198100210928       COPY CPYTRNDAMT.
198200210928      /
198300210928       INITIAL-LOGIC.
198400210928
198500210928           MOVE SPACES       TO COMM-REJECTION-CODE.
198600210928           MOVE LOW-VALUES   TO CURR-CONTROLS.
198700210928
198800210928           IF COMM-OPEN-FILES NOT = "Y" AND
198900210928              OPEN-FILES-ONCE NOT = "Y"
199000210928             GO TO INL-0010
199100210928           END-IF.
199200210928
199300210928           OPEN INPUT  BUSINESS-DAYS
199400210928                       ACCOUNT
199500210928                       ACCOUNT-CONTRACT-INVEST-SWI
199600210928                       ACCOUNT-CONTRACT-INVEST-R
199700210928                       ACCOUNT-CONTRACT-RESET
199800210928                       ACCOUNT-CONTRACT-INV-RESET
199900210928                       TRANS-R
200000210928                       TRANS
200100210928                       TRANS-TARGET
200200210928                       TRANS-TARGET-2
200300210928                       ACCOUNT-NOMINEE
200400210928                       TRANS-OFFSET
200500210928                       SEG-TRANSFER-OPTIONS
200600210928                       TRANS-CONTRACT-DETAILS
200700210928                       ACCOUNT-ATTRIBUTES
200800210928                       EXCLUDE-TRANS
200900210928                       TRANS-GBV-TRANSFER
201000210928                       SEG-SWITCH-TRF-OPT
201100210928                       TRANS-CONTRACT-TARGET2
201200210928                       TRANS-CHARGES
201300210928                       TRANS-SEG-DEDUCTION-CODES
201400210928110904                 INVESTMENT-STRUCTURE-XREF
201500210928180708                 TRANS-MISC-DETAILS
201600210928180708                 TRANS-REDEM-DETAILS
201700210928                 I-O   ACCOUNT-CONTRACT-INVESTMENT
201800210928                       TRANS-CONTRACT-DTL-R
201900210928                       ACCOUNT-CONTRACT-INVEST
202000210928                       CONTRACT-ERROR-LOG.
202100210928
202200210928           MOVE "N"          TO OPEN-FILES-ONCE.
202300210928           PERFORM     SQL-DECLARE-RTN  THRU SDR-EXIT.
202400210928
202500210928       INL-0010.
202600210928
202700210928           EXEC SQL
202800210928              WHENEVER SQLERROR CONTINUE
202900210928           END-EXEC.
203000210928
203100210928           EXEC SQL
203200210928              WHENEVER NOT FOUND CONTINUE
203300210928           END-EXEC.
203400210928
203500210928           IF UNITRAX-BASE-CURRENCY   NOT = SPACES AND
203600210928              PROG-EXCHANGE-RATE-TYPE NOT = SPACES
203700210928             GO TO INL-EXIT
203800210928           END-IF.
203900210928
204000210928           EXEC SQL
204100210928             SELECT COALESCE(CURRENCY, "CAD")
204200210928               INTO :UNITRAX-BASE-CURRENCY
204300210928               FROM MFACURP
204400210928              WHERE BASE_CURRENCY = "Y"
204500210928           END-EXEC.
204600210928
204700210928           IF SQLCODE = 100
204800210928              MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
204900210928           END-IF.
205000210928
205100210928           EXEC SQL
205200210928             SELECT COALESCE(EXCHANGE_RATE_TYPE, " ")
205300210928               INTO :PROG-EXCHANGE-RATE-TYPE
205400210928               FROM MFAPRGERP
205500210928              WHERE PROGRAM_CODE = "SEGCALCV"
205600210928                AND PROGRAM_ACTION = "DEFAULT"
205700210928           END-EXEC.
205800210928
205900210928           IF SQLCODE = 100 OR PROG-EXCHANGE-RATE-TYPE = " "
206000210928              MOVE "06"       TO COMM-REJECTION-CODE
206100210928              MOVE HIGH-VALUES TO CURR-CONTROLS
206200210928           END-IF.
206300210928
206400210928110904     MOVE COMM-ACCOUNT-NO  TO LI-ACCOUNTNO
206500210928110904     MOVE COMM-CONTRACT-NO TO LI-CONTRACTNO
206600210928110904     EXEC SQL
206700210928110904       SELECT GUAR_BENEFIT_ELIGIBLE
206800210928110904         INTO :GUAR-BENEFIT-ELIGIBLE
206900210928110904         FROM MFAACCONP
207000210928110904        WHERE ACCOUNT_NO  = :LI-ACCOUNTNO
207100210928110904          AND CONTRACT_NO = :LI-CONTRACTNO
207200210928110904     END-EXEC.
207300210928
207400210928       INL-EXIT.
207500210928           EXIT.
207600210928
207700210928       END-JOB.
207800210928
207900210928      * RFS49699 - Begin
208000210928
208100210928           MOVE "LOGARR"               to Pass-Screen-Code.
208200210928           MOVE "LOGARR"               to Pass-Edit-Code.
208300210928           MOVE "N"                    to Pass-Level-Code.
208400210928
208500210928           call "FXSCEDTAL1" using Pass-Screen-Code
208600210928                                   Pass-Edit-Code
208700210928                                   Pass-Level-Code
208800210928                                   Retn-Edit-Allowed-Flag.
208900210928
209000210928
209100210928           IF Retn-Edit-Allowed
209200210928               PERFORM ARRAY-LOGGING     THRU ARL-EXIT
209300210928           END-IF.
209400210928
209500210928      * RFS49699 - End
209600210928
209700210928           IF SQL-FILE-NOT-OPEN
209800210928              GO TO EOJ-EXIT
209900210928           END-IF.
210000210928
210100210928           EXEC SQL
210200210928                CLOSE SEGEXTSQ
210300210928           END-EXEC.
210400210928
210500210928           EXEC SQL
210600210928                WHENEVER SQLERROR GOTO EOJ-EXIT
210700210928           END-EXEC.
210800210928
210900210928           EXEC SQL
211000210928                WHENEVER NOT FOUND GOTO EOJ-EXIT
211100210928           END-EXEC.
211200210928
211300210928
211400210928       EOJ-EXIT.
211500210928           EXIT.
211600210928
211700210928      * RFS49699 - Begin call array logging if on!
211800210928
211900210928       ARRAY-LOGGING.
212000210928
212100210928           MOVE "SEGRECALGD"           TO  pp-Program-Name.
212200210928
212300210928           MOVE WS-ARRAY1-NAME         TO  pp-Array-Name.
212400210928           SET  WS-ARR-ACCCRP          TO  TRUE.
212500210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
212600210928           MOVE WS-ARRAY1-MAX          TO  pp-Max-Size.
212700210928           MOVE WS-ARRAY1-MAX-USED     TO  pp-Max-Size-Used.
212800210928           MOVE SPACES                 TO  rp-Err-Flag.
212900210928
213000210928           CALL "FXLOGAU"      using PR-FXLOGAU.
213100210928
213200210928           MOVE WS-ARRAY2-NAME         TO  pp-Array-Name.
213300210928           SET  WS-ARR-ACCCIP          TO  TRUE.
213400210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
213500210928           MOVE WS-ARRAY2-MAX          TO  pp-Max-Size.
213600210928           MOVE WS-ARRAY2-MAX-USED     TO  pp-Max-Size-Used.
213700210928           MOVE SPACES                 TO  rp-Err-Flag.
213800210928
213900210928           CALL "FXLOGAU"      using PR-FXLOGAU.
214000210928
214100210928
214200210928       ARL-EXIT.
214300210928           EXIT.
214400210928
214500210928      * RFS49699 - End
