000100210928       IDENTIFICATION DIVISION.
000200210928       PROGRAM-ID.    SEGRESET.
000300210928       AUTHOR.        REECE TAM.
000400210928       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000500210928       DATE-WRITTEN.  NOVEMBER 1998.
000600210928       DATE-COMPILED.
000700210928      *******************************************************************
000800210928      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
000900210928      *******************************************************************
001000210928      *            * yyyy/mm/dd   *
001100210928      * Sartaj H.  * 2000/10/06   * RFS 7450 - Recompile only
001200210928      *            *              *
001300210928      * Lev        * 2000/12/06   * RFS 8712 - Use process date + 1
001400210928      *            *              * business day, similar to TRNRVS pgm
001500210928      *            *              * (apply only for intaractive reset
001600210928      *            *              * process)
001700210928      * R SALIRE   * 2001/03/14   * RFS 9789 - RECOMPILE
001800210928      * R SALIRE   * 2001/05/14   * RFS 9789 - RECOMPILE
001900210928      * F.Haji     * 2001/06/25   * RFS 7720 - If the special module
002000210928      *            *              * exists,calculate the impact the
002100210928      *            *              * reset has on the whole contract.
002200210928      *            *              * If the reset will increase the GBV
002300210928      *            *              * use the reset value otherwise use
002400210928      *            *              * the previous GBV.
002500210928      * R SALIRE   * 2001/09/05   * RFS 11255 - Phase 2
002600210928      *            *              * Check transaction if to be excluded
002700210928      *            *              * or not from GBV recalc
002800210928      * R SALIRE   * 2001/10/10   * RFS 11622 - Use the unit-price prior
002900210928      *            *              * to trade-date of transaction if the
003000210928      *            *              * price on the trade-date doesn't exists.
003100210928      * R SALIRE   * 2001/10/18   * RFS 11698 - Use copybook CPYSEGRTNE.
003200210928      *            *              * Changes made to copybook CPYSEGRTNE.
003300210928      *            *              * This will handle switches or transfers
003400210928      *            *              * from Non-Seg to Seg or vice-versa.
003500210928      * R SALIRE   * 2001/11/15   * RFS 12145 - Recompile.
003600210928      *            *              * Changes made to copybook CPYSEGRTN2.
003700210928      * R SALIRE   * 2001/12/12   * RFS 12387 - Fix division by zero when
003800210928      *            *              * when calculating the percentage.
003900210928      * R SALIRE   * 2001/12/27   * RFS 12454 - Switches within the same
004000210928      *            *              * contract make GBV change.
004100210928      *            *              * Have to ensure that the percentage
004200210928      *            *              * total would equal to 100 percent.
004300210928      * R SALIRE   * 2002/02/05   * RFS 12702 - GBV is rounding incorrectly
004400210928      *            *              * with switch transactions.
004500210928      * Daisy Ly   *  2002/03/20  *  RFS 13185 - recompile
004600210928      * Fatema Haji*  2002/03/21  *  RFS 13331 - recompile
004700210928      * R SALIRE   * 2002/05/13   * RFS 13394 - New functionality to carry
004800210928      *            *              * over contract NDV/GBV onto Unitrax.
004900210928      * R Salire   * 2002/08/07   * RFS 14600 - Recompile
005000210928      * R SALIRE   * 2002/08/23   * RFS 13306 - Transfer in kind func
005100210928      * C. Carino  * 2002/10/03   * RFS 14407 - recompile for          *
005200210928      *                           *  ACCOUNT-ATTRIBUTE (MFAACCATP)
005300210928      * Ewa        * 2002/12/30   * RFS 15872 - Commented out the
005400210928      * Kolasinska *              * DISPLAY stat. used for debugging.
005500210928      * Bud Kovacs * 2003/11/24   * RFS 19446                          *
005600210928      *            *              * -Recompile only because of file    *
005700210928      *            *              *  investment-seg (changed).         *
005800210928      * Fatema Haji*  2004/01/07  * RFS 19318 - recompile
005900210928      * Pubudu Jay * 2004/05/21   * RFS 20516                          *
006000210928      *            *              * Use Standard (Direct) method calcu-*
006100210928      *            *              * lation when Account No and "PRE99" *
006200210928      *            *              * attribute code exists in the       *
006300210928      *            *              * Account-Attributes file (MFAACCATP)*
006400210928      * Fatema Haji*  2004/09/09  * RFS 23824 - recompile
006500210928      * Angela N.  *  2005/04/27  * RFS 24943 - Added new edit code
006600210928      *            *              * DMCCON to determine Gross value
006700210928      *            *              * reduction of the NDV and/or GBV
006800210928      *            *              * values at the contract level Direct
006900210928      *            *              * Method calculation.
007000210928      * Lev O      *  2005/07/06  * RFS24943, RFS29028 -
007100210928      *            *              * Change the program
007200210928      *            *              * just to capture MV for the
007300210928      *            *              * effective date.
007400210928      * Frank Hong *  2005/06/02  * RFS 26151.
007500210928      *            *              * Modify the program to take into
007600210928      *            *              * account the number of units of transactions
007700210928      *            *              * that are in Exclude Transactions table
007800210928      *            *              * (RFEXCTRN) without affecting the Guaranteed
007900210928      *            *              * Base Value (GBV), Net Deposit Value (NDV),
008000210928      *            *              * Guaranteed Death Value (GDV) of the contract
008100210928      * Esin A.    *  2006/03/23  * RFS 31514 - Recompile only
008200210928      * Esin A.    *  2007/03/09  * RFS 40576 - Recompile only.
008300210928      * Raymond Mui*  2007/11/23  * RFS 45845 - Recompile only.
008400210928      * Emman. Yala*  2008/01/10  * RFS47227 - Recompile.
008500210928      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
008600210928      * Bojana J.  *  2008/05/06  * RFS 51776 - recompile.
008700210928      * Fatema Haji*  2008/08/18  * RFS 55960 - recompile.
008800210928      * Sanjeev P  *  2008/12/11  * RFS49898 - New DMD Maturity Option.
008900210928      * Gary Xia   *  2009/06/02  * RFS 57388 - Log auto resets.
009000210928      * Fatema Haji*  2009/06/10  * RFS58986 - Hard reject on Detrimental
009100210928      *            *              * reset
009200210928      * Gary Xia   *  2009/07/24  * RFS 57388 - Legacy issue. Last reset
009300210928      *            *              * date not populated.
009400210928      * Waldi R.   *  2010/01/05  * RFS 75247 - Do not populate Last
009500210928      *            *              * Reset Date.
009600210928      * Emman. Yala*  2011/02/23  * RFS91599 - Recompile for 80605
009700210928      *            *              * Replaced Implicit Join by Inner Join
009800210928      * VENKATESH C*  2011/03/03  * RFS80605 - MODIFIED FOR RFS80605
009900210928      * Venkatesh C*  2011/05/26  * RFS96705- Fix for AWD carried over
010000210928      * Venkatesh C*  2011/04/11  * RFS63488- GLWB and GDV resets
010100210928      * Thilaga K  *  2012/07/23  * RFS106211-Development for Handling
010200210928      *            *              * Age 80 resets
010300210928      * Venkatesh C*  2012/10/15  * RFS107679 - Maturity date enhance
010400210928      *            *              * ment
010500210928      * Abhisek M  *  2013/04/01  * RFS120002-Recompile for MFATRACXP
010600210928      * Nagamani S * 2013/04/22   * RFS122007- Recompile for MFAGDTHCSP*
010700210928      * Premil K   * 2013/07/12   * RFS110904 - Preform GDV reset and
010800210928      *                           * Reverse reset.
010900210928      * Andy Chan  * 2013/08/29   * RFS127401 - Get SETPOL Inv Structure
011000210928      * Thilaga K   * 2014/01/21 * RFS133150 - Recompile for MFATRCODP
011100210928      * Vinsfy  J   * 2014/04/07 * RFS129784 - Product level reset.
011200210928      * Abhisek M   * 2014/04/16 * RFS134936 Recompile for MFAACCONP
011300210928      * Vinsfy J   * 2014/06/13 * RFS136634 - Recompile for MFAACCATP
011400210928      * TamilSelvi * 2014/06/03   * RFS137220 - Recompile for MFAGDTHCSP
011500210928      * Kamal T     * 2015/05/18 * RFS132483 - Orig CMD updated when
011600210928      *                          * edit code CMDFCN not enabled
011700210928      * Niranjan   * 2019/10/24   * RFS1015375 - Product reset fixes
011800210928      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
011900210928      * Chaya SP   *  2020/03/25  * RFS185170 - Recompile for MFAGDTHCSP *
012000210928      * CHAYA SP   * 2020/06/30   * RFS185172 - Recompile for MFAACCONP
012100210928      * VIGNESH    * 2020/07/15   * RFS185171 -Recompile for MFAEXTRNP
012200210928      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
012300210928      *                           * and MFAGDTHCSP
012400210928      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
012500210928      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
012600210928      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
012700210928      * Kavin      * 2021/01/05   * RFS180708 - passing Trans sub type
012800210928      *                           * key value to MFAEXTRNP file
012900210928      * Kavin      * 2021/02/17   * RFS186290 - Recompile only
013000210928      * Raja N     * 2020/03/20   * RFS186918 - Account Maturity
013100210928      *            *              * Percentage change & Manual Resets
013200210928      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
013300210928      * Kavin      * 2021/08/13   * RFS186199 - Recompile for MFAACCCERP
013301211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
013302211007      *            *              * Array from 100 to 1000
013303211007      *            *              * Tagged as 111744
013400210928      * -------------------------------------------------------------
013500210928      ******************************************************************
013600210928      *===============================================================*
013700210928      * Important: IMPORTANT TO ALL PROGRAMMERS
013800210928      *
013900210928      * If any programmer creates, changes or deletes an array in this
014000210928      * programs please add the logic to support the array logging process!
014100210928      *
014200210928      * View the WS-ARRAY-LOG-MISC variables and the code associated with
014300210928      * RFS49699.
014400210928      *
014500210928      * This change is for audit purposes, it logs the
014600210928      * name of the array, max size, size used. At the end of
014700210928      * this program the array information is passed to FXLOGUA pgm,
014800210928      * which write this information to the MFALOGAUP array audit file!
014900210928      *
015000210928      *===============================================================*
015100210928       ENVIRONMENT DIVISION.
015200210928       CONFIGURATION SECTION.
015300210928       SOURCE-COMPUTER. IBM-AS400.
015400210928       OBJECT-COMPUTER. IBM-AS400.
015500210928       SPECIAL-NAMES.
015600210928186918 DATA-AREA IS WS-DTAARA-MFASEGPARM
015700210928           LOCAL-DATA IS WS-LOCAL.
015800210928      /
015900210928       INPUT-OUTPUT SECTION.
016000210928       FILE-CONTROL.
016100210928
016200210928           SELECT  ACCOUNT-CONTRACT
016300210928                   ASSIGN TO DATABASE-MFAACCONP
016400210928                   ORGANIZATION IS INDEXED
016500210928                   ACCESS IS DYNAMIC
016600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016700210928
016800210928           SELECT  ACCOUNT-CONTRACT-INVESTMENT
016900210928                   ASSIGN TO DATABASE-MFAACCCIP
017000210928                   ORGANIZATION IS INDEXED
017100210928                   ACCESS IS DYNAMIC
017200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017300210928
017400210928           SELECT  ACCOUNT-CONTRACT-RESET
017500210928                   ASSIGN TO DATABASE-MFAACCCRP
017600210928                   ORGANIZATION IS INDEXED
017700210928                   ACCESS IS DYNAMIC
017800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017900210928
018000210928           SELECT  ACCOUNT-CONTRACT-RESET-R
018100210928                   ASSIGN TO DATABASE-MFAACCCRP
018200210928                   ORGANIZATION IS INDEXED
018300210928                   ACCESS IS DYNAMIC
018400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018500210928
018600210928           SELECT  ACCOUNT-CONTRACT-INV-RESET
018700210928                   ASSIGN TO DATABASE-MFAACCCIRP
018800210928                   ORGANIZATION IS INDEXED
018900210928                   ACCESS IS DYNAMIC
019000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019100210928
019200210928           SELECT  ACCOUNT
019300210928                   ASSIGN TO DATABASE-MFAACCNTP
019400210928                   ORGANIZATION IS INDEXED
019500210928                   ACCESS IS DYNAMIC
019600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019700210928
019800210928           SELECT  INVESTMENT
019900210928                   ASSIGN TO DATABASE-MFAINVP
020000210928                   ORGANIZATION IS INDEXED
020100210928                   ACCESS IS DYNAMIC
020200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020300210928
020400210928           SELECT  INVESTMENT-2
020500210928                   ASSIGN TO DATABASE-MFAINVP
020600210928                   ORGANIZATION IS INDEXED
020700210928                   ACCESS IS DYNAMIC
020800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020900210928
021000210928           SELECT  INVESTMENT-UNIT-PRICE
021100210928                   ASSIGN TO DATABASE-MFAINVUPLB
021200210928                   ORGANIZATION IS INDEXED
021300210928                   ACCESS IS DYNAMIC
021400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
021500210928                   WITH DUPLICATES.
021600210928
021700210928           SELECT  PROGRAM-EXCHANGE-RATE
021800210928                   ASSIGN TO DATABASE-MFAPRGERP
021900210928                   ORGANIZATION IS INDEXED
022000210928                   ACCESS IS DYNAMIC
022100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022200210928
022300210928           SELECT  EXCHANGE-RATE-M
022400210928                   ASSIGN TO DATABASE-MFAEXRHMP
022500210928                   ORGANIZATION IS INDEXED
022600210928                   ACCESS IS DYNAMIC
022700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022800210928
022900210928           SELECT  EXCHANGE-RATE-M-2
023000210928                   ASSIGN TO DATABASE-MFAEXRHMP
023100210928                   ORGANIZATION IS INDEXED
023200210928                   ACCESS IS DYNAMIC
023300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023400210928
023500210928           SELECT  CURRENCY-CODE
023600210928                   ASSIGN TO DATABASE-MFACURP
023700210928                   ORGANIZATION IS INDEXED
023800210928                   ACCESS IS DYNAMIC
023900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024000210928
024100210928           SELECT  CONTRACT-ERROR-LOG
024200210928                   ASSIGN TO DATABASE-MFACTERRP
024300210928                   ORGANIZATION IS INDEXED
024400210928                   ACCESS IS DYNAMIC
024500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
024600210928                   WITH DUPLICATES.
024700210928      *
024800210928           SELECT  BUSINESS-DAYS                                        RFS8712
024900210928                   ASSIGN TO DATABASE-MFABUSDAP                         RFS8712
025000210928                   ORGANIZATION IS INDEXED                              RFS8712
025100210928                   ACCESS IS DYNAMIC                                    RFS8712
025200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY               RFS8712
025300210928                   FILE STATUS IS WS-FILE-STATUS.                       RFS8712
025400210928      *
025500210928           SELECT  TRANS-D
025600210928                   ASSIGN TO DATABASE-MFATRNLA
025700210928                   ORGANIZATION IS INDEXED
025800210928                   ACCESS IS DYNAMIC
025900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
026000210928                   WITH DUPLICATES.
026100210928      *
026200210928      *    SELECT  TRANS-GBV
026300210928      *            ASSIGN TO DATABASE-MFATRNLN
026400210928      *            ORGANIZATION IS INDEXED
026500210928      *            ACCESS IS DYNAMIC
026600210928      *            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
026700210928      *            WITH DUPLICATES.
026800210928      *
026900210928           SELECT  TRANS-GBV
027000210928                   ASSIGN TO DATABASE-MFATRNP
027100210928                   ORGANIZATION IS INDEXED
027200210928                   ACCESS IS DYNAMIC
027300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
027400210928
027500210928           SELECT  TRANS-CONTRACT-DTL
027600210928                   ASSIGN TO DATABASE-MFATRCODP
027700210928                   ORGANIZATION IS INDEXED
027800210928                   ACCESS IS DYNAMIC
027900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028000210928      *
028100210928      /
028200210928           SELECT  TRANS-EXCHANGE-RATE-2
028300210928                   ASSIGN TO DATABASE-MFATREXRP
028400210928                   ORGANIZATION IS INDEXED
028500210928                   ACCESS IS DYNAMIC
028600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028700210928      /
028800210928           SELECT  ACC-CON-INVESTMENT
028900210928                   ASSIGN TO DATABASE-MFAACCCIP
029000210928                   ORGANIZATION IS INDEXED
029100210928                   ACCESS IS DYNAMIC
029200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029300210928      /
029400210928           SELECT  TRANS-CON-DTL
029500210928                   ASSIGN TO DATABASE-MFATRCODP
029600210928                   ORGANIZATION IS INDEXED
029700210928                   ACCESS IS DYNAMIC
029800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029900210928      /
030000210928           SELECT  INVESTMENT-UNIT-PRICE-2
030100210928                   ASSIGN TO DATABASE-MFAINVUPLB
030200210928                   ORGANIZATION IS INDEXED
030300210928                   ACCESS IS DYNAMIC
030400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
030500210928                   WITH DUPLICATES.
030600210928      /
030700210928           SELECT  ACCOUNT-NOMINEE
030800210928                   ASSIGN TO DATABASE-MFAACCNMP
030900210928                   ORGANIZATION IS INDEXED
031000210928                   ACCESS IS DYNAMIC
031100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031200210928      /
031300210928           SELECT  EXCLUDE-TRANS
031400210928                   ASSIGN TO DATABASE-MFAEXTRNP
031500210928                   ORGANIZATION IS INDEXED
031600210928                   ACCESS IS DYNAMIC
031700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031800210928      /
031900210928           SELECT  ACCOUNT-ATTRIBUTES
032000210928                   ASSIGN TO DATABASE-MFAACCATP
032100210928                   ORGANIZATION IS INDEXED
032200210928                   ACCESS IS DYNAMIC
032300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
032400210928      /
032500210928           SELECT  TRANS-DESCENDING
032600210928                   ASSIGN TO DATABASE-MFATRNLN
032700210928                   ORGANIZATION IS INDEXED
032800210928                   ACCESS IS DYNAMIC
032900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
033000210928                          WITH DUPLICATES.
033100210928      /
033200210928           SELECT  INVESTMENT-SEG
033300210928                   ASSIGN TO DATABASE-MFAINVSGP
033400210928                   ORGANIZATION IS INDEXED
033500210928                   ACCESS IS DYNAMIC
033600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
033700210928      /
033800210928           SELECT  TRANS-CONTRACT-DTL-DES
033900210928                   ASSIGN TO DATABASE-MFATRCODP
034000210928                   ORGANIZATION IS INDEXED
034100210928                   ACCESS IS DYNAMIC
034200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
034300210928      /
034400210928R11698*    SELECT  TRANS-TARGET
034500210928R11698*            ASSIGN TO DATABASE-MFATRNTGP
034600210928R11698*            ORGANIZATION IS INDEXED
034700210928R11698*            ACCESS IS DYNAMIC
034800210928R11698*            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
034900210928      *
035000210928R11698*    SELECT  TRANS-TARGET-2
035100210928R11698*            ASSIGN TO DATABASE-MFATRNTGLA
035200210928R11698*            ORGANIZATION IS INDEXED
035300210928R11698*            ACCESS IS DYNAMIC
035400210928R11698*            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
035500210928      /
035600210928R11698*    SELECT  TRANS-OFFSET
035700210928R11698*            ASSIGN TO DATABASE-MFATRNP
035800210928R11698*            ORGANIZATION IS INDEXED
035900210928R11698*            ACCESS IS DYNAMIC
036000210928R11698*            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
036100210928      *
036200210928R11698*    SELECT  SEG-TRANSFER-OPTIONS
036300210928R11698*            ASSIGN TO DATABASE-MFATRFOPP
036400210928R11698*            ORGANIZATION IS INDEXED
036500210928R11698*            ACCESS IS DYNAMIC
036600210928R11698*            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
036700210928      *
036800210928R11698*    SELECT  TRANS-CONTRACT-DETAILS
036900210928R11698*            ASSIGN TO DATABASE-MFATRCODP
037000210928R11698*            ORGANIZATION IS INDEXED
037100210928R11698*            ACCESS IS DYNAMIC
037200210928R11698*            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
037300210928      *
037400210928      *    SELECT  ACCOUNT-CONTRACT-INVEST
037500210928      *            ASSIGN TO DATABASE-MFAACCCIP
037600210928      *            ORGANIZATION IS INDEXED
037700210928      *            ACCESS IS DYNAMIC
037800210928      *            RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
037900210928      *
038000210928R13394     SELECT  TRANS-GBV-TRANSFER
038100210928R13394             ASSIGN TO DATABASE-MFATRACXP
038200210928R13394             ORGANIZATION IS INDEXED
038300210928R13394             ACCESS IS DYNAMIC
038400210928R13394             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
038500210928
038600210928      * 57388 begins
038700210928           SELECT  CONTRACT-CHANGE-LOG
038800210928                   ASSIGN TO DATABASE-MFACTCLP
038900210928                   ORGANIZATION IS INDEXED
039000210928                   ACCESS IS DYNAMIC
039100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
039200210928                   WITH DUPLICATES.
039300210928      * 57388 ends
039400210928      *RFS80605.11 - START
039500210928           SELECT  INVESTOR-CHANGE-LOG
039600210928                   ASSIGN TO DATABASE-MFAIVRCLP
039700210928                   ORGANIZATION IS INDEXED
039800210928                   ACCESS IS DYNAMIC
039900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
040000210928                   WITH DUPLICATES.
040100210928      *RFS80605.11 - END
040200210928
040300210928      *RFS110904 - START
040400210928           SELECT  INVESTMENT-STRUCTURE-XREF
040500210928                   ASSIGN TO DATABASE-MFAINVSXP
040600210928                   ORGANIZATION IS INDEXED
040700210928                   ACCESS IS DYNAMIC
040800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
040900210928      *RFS110904 - END
041000210928
041100210928      *RFS180708 - Start
041200210928           SELECT  TRANS-MISC-DETAILS
041300210928                   ASSIGN TO DATABASE-MFATRNMSCP
041400210928                   ORGANIZATION IS INDEXED
041500210928                   ACCESS IS DYNAMIC
041600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
041700210928
041800210928           SELECT  TRANS-REDEM-DETAILS
041900210928                   ASSIGN TO DATABASE-MFATRNREP
042000210928                   ORGANIZATION IS INDEXED
042100210928                   ACCESS IS DYNAMIC
042200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
042300210928      *RFS180708 - End
042400210928
042500210928       DATA DIVISION.
042600210928       FILE SECTION.
042700210928       FD  ACCOUNT-CONTRACT
042800210928           LABEL RECORDS ARE STANDARD.
042900210928       01  ACC-CON-REC.           COPY DD-ALL-FORMATS OF MFAACCONP.
043000210928      /
043100210928       FD  ACCOUNT-CONTRACT-INVESTMENT
043200210928           LABEL RECORDS ARE STANDARD.
043300210928       01  ACC-CON-INV-REC.       COPY DD-ALL-FORMATS OF MFAACCCIP.
043400210928      /
043500210928       FD  ACCOUNT-CONTRACT-RESET
043600210928           LABEL RECORDS ARE STANDARD.
043700210928       01  ACC-CON-RESET-REC.     COPY DD-ALL-FORMATS OF MFAACCCRP.
043800210928      /
043900210928       FD  ACCOUNT-CONTRACT-RESET-R
044000210928           LABEL RECORDS ARE STANDARD.
044100210928       01  ACC-CON-RESET-R-REC.   COPY DD-ALL-FORMATS OF MFAACCCRP.
044200210928      /
044300210928       FD  ACCOUNT-CONTRACT-INV-RESET
044400210928           LABEL RECORDS ARE STANDARD.
044500210928       01  ACC-CON-INV-RESET-REC. COPY DD-ALL-FORMATS OF MFAACCCIRP.
044600210928      /
044700210928       FD  ACCOUNT
044800210928           LABEL RECORDS ARE STANDARD.
044900210928       01  ACCOUNT-REC.           COPY DD-ALL-FORMATS OF MFAACCNTP.
045000210928      /
045100210928       FD  INVESTMENT
045200210928           LABEL RECORDS ARE STANDARD.
045300210928       01  INVESTMENT-REC.        COPY DD-ALL-FORMATS OF MFAINVP.
045400210928      /
045500210928       FD  INVESTMENT-2
045600210928           LABEL RECORDS ARE STANDARD.
045700210928       01  INVESTMENT-2-REC.      COPY DD-ALL-FORMATS OF MFAINVP.
045800210928      /
045900210928       FD  INVESTMENT-UNIT-PRICE
046000210928           LABEL RECORDS ARE STANDARD.
046100210928       01  IUP-REC.               COPY DD-ALL-FORMATS OF MFAINVUPLB.
046200210928      /
046300210928       FD  PROGRAM-EXCHANGE-RATE
046400210928           LABEL RECORDS ARE STANDARD.
046500210928       01  PROG-EXCH-RATE-REC.    COPY DD-ALL-FORMATS OF MFAPRGERP.
046600210928      /
046700210928       FD  EXCHANGE-RATE-M
046800210928           LABEL RECORDS ARE STANDARD.
046900210928       01  EXCHANGE-RATE-M-REC.   COPY DD-ALL-FORMATS OF MFAEXRHMP.
047000210928      /
047100210928       FD  EXCHANGE-RATE-M-2
047200210928           LABEL RECORDS ARE STANDARD.
047300210928       01  EXCHANGE-RATE-M-2-REC. COPY DD-ALL-FORMATS OF MFAEXRHMP.
047400210928      /
047500210928       FD  CURRENCY-CODE
047600210928           LABEL RECORDS ARE STANDARD.
047700210928       01  CURRENCY-CODE-REC.     COPY DD-ALL-FORMATS OF MFACURP.
047800210928      /
047900210928       FD  CONTRACT-ERROR-LOG
048000210928           LABEL RECORDS ARE STANDARD.
048100210928       01  CONT-ERR-LOG-REC.      COPY DD-ALL-FORMATS OF MFACTERRP.
048200210928      /                                                                 RFS8712
048300210928       FD  BUSINESS-DAYS                                                RFS8712
048400210928           LABEL RECORDS ARE STANDARD.                                  RFS8712
048500210928       01  BUSINESS-DAY-REC.                                            RFS8712
048600210928                                 COPY DD-ALL-FORMATS OF MFABUSDAP.      RFS8712
048700210928      /
048800210928       FD  TRANS-D
048900210928           LABEL RECORDS ARE STANDARD.
049000210928       01  TRANS-D-REC.          COPY DD-ALL-FORMATS OF MFATRNLA.
049100210928      /
049200210928       FD  TRANS-GBV
049300210928           LABEL RECORDS ARE STANDARD.
049400210928       01  TRANS-GBV-REC.        COPY DD-ALL-FORMATS OF MFATRNP.
049500210928      /
049600210928       FD  TRANS-CONTRACT-DTL
049700210928           LABEL RECORDS ARE STANDARD.
049800210928       01  TRANS-CONTRACT-DTL-REC.   COPY DD-ALL-FORMATS OF MFATRCODP.
049900210928      *
050000210928       FD  TRANS-EXCHANGE-RATE-2
050100210928           LABEL RECORDS ARE STANDARD.
050200210928       01  TRANS-EXCHANGE-RATE-2-REC. COPY DD-ALL-FORMATS OF MFATREXRP.
050300210928      /
050400210928       FD  ACC-CON-INVESTMENT
050500210928           LABEL RECORDS ARE STANDARD.
050600210928       01  ACC-CON-INVEST-REC.       COPY DD-ALL-FORMATS OF MFAACCCIP.
050700210928      /
050800210928       FD  TRANS-CON-DTL
050900210928           LABEL RECORDS ARE STANDARD.
051000210928       01  TRANS-CON-DTL-REC.        COPY DD-ALL-FORMATS OF MFATRCODP.
051100210928      /
051200210928       FD  INVESTMENT-UNIT-PRICE-2
051300210928           LABEL RECORDS ARE STANDARD.
051400210928       01  IUP-2-REC.                COPY DD-ALL-FORMATS OF MFAINVUPLB.
051500210928      /
051600210928R11255 FD  ACCOUNT-NOMINEE
051700210928R11255     LABEL RECORDS ARE STANDARD.
051800210928R11255 01  ACCOUNT-NOMINEE-REC.       COPY DD-ALL-FORMATS OF MFAACCNMP.
051900210928      /
052000210928R11255 FD  EXCLUDE-TRANS
052100210928R11255     LABEL RECORDS ARE STANDARD.
052200210928R11255 01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
052300210928      /
052400210928R11255 FD  ACCOUNT-ATTRIBUTES
052500210928R11255     LABEL RECORDS ARE STANDARD.
052600210928R11255 01  ACCOUNT-ATTRIBUTES-REC.    COPY DD-ALL-FORMATS OF MFAACCATP.
052700210928      /
052800210928       FD  TRANS-DESCENDING
052900210928           LABEL RECORDS ARE STANDARD.
053000210928       01  TRANS-DESCENDING-REC.      COPY DD-ALL-FORMATS OF MFATRNLN.
053100210928      /
053200210928       FD  INVESTMENT-SEG
053300210928           LABEL RECORDS ARE STANDARD.
053400210928       01  INVESTMENT-SEG-REC.        COPY DD-ALL-FORMATS OF MFAINVSGP.
053500210928      /
053600210928       FD  TRANS-CONTRACT-DTL-DES
053700210928           LABEL RECORDS ARE STANDARD.
053800210928       01  TRANS-CONTRACT-DTL-DES-REC. COPY DD-ALL-FORMATS OF MFATRCODP.
053900210928      /
054000210928      *RFS80605.11 - START
054100210928       FD INVESTOR-CHANGE-LOG
054200210928           LABEL RECORDS ARE STANDARD.
054300210928       01 INVESTOR-CHANGE-LOG-REC. COPY DD-ALL-FORMATS OF MFAIVRCLP.
054400210928      *RFS80605.11 - END
054500210928R11698*FD  TRANS-TARGET
054600210928R11698*    LABEL RECORDS ARE STANDARD.
054700210928R11698*01  TRANS-TARGET-REC.
054800210928R11698*                           COPY DD-ALL-FORMATS OF MFATRNTGP.
054900210928      *
055000210928R11698*FD  TRANS-TARGET-2
055100210928R11698*    LABEL RECORDS ARE STANDARD.
055200210928R11698*01  TRANS-TARGET-2-REC.
055300210928R11698*                           COPY DD-ALL-FORMATS OF MFATRNTGLA.
055400210928      *
055500210928R11698*FD  TRANS-OFFSET
055600210928R11698*    LABEL RECORDS ARE STANDARD.
055700210928R11698*01  TRANS-2-REC.           COPY DD-ALL-FORMATS OF MFATRNP.
055800210928      *
055900210928R11698*FD  SEG-TRANSFER-OPTIONS
056000210928R11698*    LABEL RECORDS ARE STANDARD.
056100210928R11698*01  SEG-TRANSFER-OPTIONS-REC.  COPY DD-ALL-FORMATS OF MFATRFOPP.
056200210928      *
056300210928R11698*FD  TRANS-CONTRACT-DETAILS
056400210928R11698*    LABEL RECORDS ARE STANDARD.
056500210928R11698*01  TRANS-CON-DTLS-REC.       COPY DD-ALL-FORMATS OF MFATRCODP.
056600210928      *
056700210928      *FD  ACCOUNT-CONTRACT-INVEST
056800210928      *    LABEL RECORDS ARE STANDARD.
056900210928      *01  ACCT-CONT-INVEST-REC.  COPY DD-ALL-FORMATS OF MFAACCCIP.
057000210928      *
057100210928R13394 FD  TRANS-GBV-TRANSFER
057200210928R13394     LABEL RECORDS ARE STANDARD.
057300210928R13394 01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
057400210928
05750021092857388  FD  CONTRACT-CHANGE-LOG
05760021092857388      LABEL RECORDS ARE STANDARD.
05770021092857388  01  CONTRACT-CHANGE-LOG-REC. COPY DD-ALL-FORMATS OF MFACTCLP.
057800210928
057900210928      *RFS110904 - START
058000210928       FD  INVESTMENT-STRUCTURE-XREF
058100210928           LABEL RECORDS ARE STANDARD.
058200210928       01  INV-STRU-XREF-REC. COPY DD-ALL-FORMATS OF MFAINVSXP.
058300210928      *RFS110904 - END
058400210928
058500210928      *RFS180708 - Start
058600210928       FD  TRANS-MISC-DETAILS
058700210928           LABEL RECORDS ARE STANDARD.
058800210928       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
058900210928
059000210928       FD  TRANS-REDEM-DETAILS
059100210928           LABEL RECORDS ARE STANDARD.
059200210928       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
059300210928      *RFS180708 - End
059400210928
059500210928       WORKING-STORAGE SECTION.
059600210928
059700210928      * Copybooks
059800210928
059900210928      * RFS49699 - Begin
060000210928
060100210928      *  screen edits allowed
060200210928           copy CPSCEDTAL1.
060300210928
060400210928      *  log array info
060500210928           copy CPFXLOGAU.
060600210928
060700210928      *  log array table name
060800210928           copy CPFXLOGAT.
060900210928
061000210928      * RFS49699 - End
061100210928
061200210928186918 COPY CPFXSGMTVA.
061300210928
061400210928           EXEC SQL
061500210928                INCLUDE SQLCA
061600210928           END-EXEC.
061700210928
061800210928      * RFS80605 - START
061900210928         COPY CPYSQLFLD
062000210928              REPLACING == "CURRENT_PROGRAM" == BY == "SEGRESET" ==.
062100210928      * RFS80605 - END
062200210928
062300210928       01 LT-CONSTANTS.                                                 RFS8712
062400210928          05 LT-Y                                PIC X(01) VALUE "Y".   RFS8712
062500210928          05 LT-N                                PIC X(01) VALUE "N".   RFS8712
062600210928
062700210928       01 SW01-SWITCHES.                                                RFS8712
062800210928          05 SW01-STS-FLAG                       PIC X(01).             RFS8712
062900210928             88 SW01-STS-OK                      VALUE " ".             RFS8712
063000210928                                                                        RFS8712
063100210928             88 SW01-STS-OPEN                    VALUE "1".             RFS8712
063200210928             88 SW01-STS-START                   VALUE "2".             RFS8712
063300210928             88 SW01-STS-READ                    VALUE "3".             RFS8712
063400210928             88 SW01-STS-REWRITE                 VALUE "4".             RFS8712
063500210928             88 SW01-STS-WRITE                   VALUE "5".             RFS8712
063600210928             88 SW01-STS-DELETE                  VALUE "6".             RFS8712
063700210928             88 SW01-STS-END                     VALUE "7".             RFS8712
063800210928             88 SW01-STS-CLOSE                   VALUE "8".             RFS8712
063900210928             88 SW01-STS-RANGE                   VALUE "9".             RFS8712
064000210928             88 SW01-STS-FOUND                   VALUE "A".             RFS8712
064100210928             88 SW01-STS-FAIL                    VALUE "*".             RFS8712
064200210928
064300210928       01 WS-FILE-STATUS             PIC X(2).                          RFS8712
064400210928
064500210928       01  CURR-CONTROLS.
064600210928          03 CURR-LEVEL1             PIC X(1).
064700210928
064800210928       01  PREV-CONTROLS.
064900210928          03 PREV-LEVEL1             PIC X(1).
065000210928
065100210928       01  PROG-ID-CODE              PIC X(10) VALUE "SEGRESET".
065200210928
065300210928       01  OPEN-FILES-ONCE           PIC X(1)  VALUE "Y".
065400210928
065500210928       01  UNITRAX-BASE-CURRENCY     PIC X(3)  VALUE " ".
065600210928
065700210928       01  PROG-EXCHANGE-RATE-TYPE   PIC X     VALUE " ".
065800210928
065900210928       01  WS-MISC-FIELDS.
066000210928           05 WS-NEW-GUAR-BASE-VALUE   PIC S9(11)V99 COMP-3 VALUE 0.
066100210928           05 WS-NEW-GUAR-BASE-VAL-CUR PIC S9(11)V99 COMP-3 VALUE 0.
066200210928           05 WS-NEW-NET-DEP-VALUE     PIC S9(11)V99 COMP-3 VALUE 0.
066300210928           05 WS-NEW-NET-DEP-VALUE-CUR PIC S9(11)V99 COMP-3 VALUE 0.
066400210928           05 WS-CURR-TRANS-AMT        PIC S9(11)V99 COMP-3 VALUE 0.
066500210928           05 WS-CURR-TRANS-AMT-CUR    PIC S9(11)V99 COMP-3 VALUE 0.
066600210928           05 WS-CURR-TRANS-UNIT-AMT   PIC S9(11)V99 COMP-3 VALUE 0.
066700210928           05 WS-CURR-TRANS-UNIT-PRICE PIC S9(5)V9(4) COMP-3 VALUE 0.
066800210928           05 WS-CURR-UNIT-BAL         PIC S9(10)V999 COMP-3 VALUE 0.
066900210928           05 WS-REJECTION-CODE        PIC X(3).
067000210928           05 WS-PRICE-FOUND           PIC X(1).
067100210928           05 WS-EXCHANGE-FOUND        PIC X(1).
067200210928           05 WS-ACC-CON-INV-UNIT-BAL  PIC S9(10)V999 COMP-3 VALUE 0.
067300210928           05 WS-OLD-GUAR-BASE-VALUE   PIC S9(11)V99 COMP-3.
067400210928           05 WS-OLD-GUAR-BASE-VALUE-CUR PIC S9(11)V99 COMP-3.
067500210928           05 WS-NEW-GBV-TOTAL         PIC S9(11)V99 COMP-3 VALUE 0.
067600210928           05 WS-OLD-GBV-TOTAL         PIC S9(11)V99 COMP-3 VALUE 0.
067700210928           05 WS-OLD-NET-DEP-VALUE     PIC S9(11)V99 COMP-3.
067800210928           05 WS-OLD-NET-DEP-VALUE-CUR PIC S9(11)V99 COMP-3.
067900210928           05 WS-INV-UNIT-PRICE        PIC S9(05)V9(4) COMP-3.
068000210928           05 WS-INV-EXCH-RATE         PIC S9(02)V9(7) COMP-3.
068100210928           05 WS-CONT-MV-BEF-TOTAL     PIC S9(11)V9(4) COMP-3.
068200210928           05 WS-CONT-MV-AFT-TOTAL     PIC S9(11)V9(2) COMP-3.
068300210928           05 WS-CONT-GBV-TOTAL        PIC S9(11)V9(2) COMP-3.
068400210928           05 WS-PRICE-FOUND-2         PIC X.
068500210928           05 WS-CONT-INV-COUNT        PIC S9(03) COMP-3.
068600210928           05 WS-CONT-INV-ARRAY-COUNT  PIC S9(03) COMP-3.
068700210928           05 WS-DUMMY-PERCENT         PIC S9(2)V9(3) COMP-3.
068800210928           05 WS-INV-GBV-PERCENT-TOTAL PIC S9(2)V9(3) COMP-3.
068900210928           05 WS-INV-GBV-PERCENT       PIC S9(2)V9(3) COMP-3.
069000210928           05 WS-NEW-CONTRACT-GBV      PIC S9(11)V9(2) COMP-3.
069100210928           05 WS-GBV-CHANGE            PIC S9(11)V9(2) COMP-3.
069200210928           05 WS-INV-GBV-AFT           PIC S9(11)V9(2) COMP-3.
069300210928           05 WS-INV-GBV-AFT-CUR       PIC S9(11)V9(2) COMP-3.
069400210928
069500210928           05 WS-SYSDATE.
069600210928              10 WS-SYSDATE-CC         PIC 99.
069700210928              10 WS-SYSDATE-YMD.
069800210928                 15 WS-SYSDATE-YY      PIC 99.
069900210928                 15 WS-SYSDATE-MM      PIC 99.
070000210928                 15 WS-SYSDATE-DD      PIC 99.
070100210928           05 WS-SYSDATE-N REDEFINES WS-SYSDATE
070200210928                                       PIC 9(8).
070300210928
070400210928           05 WS-SYSTIME-LONG.
070500210928              10 WS-SYSTIME.
070600210928                 15 WS-SYSTIME-HH      PIC 99.
070700210928                 15 WS-SYSTIME-MI      PIC 99.
070800210928                 15 WS-SYSTIME-SS      PIC 99.
070900210928              10 WS-SYSTIME-N REDEFINES WS-SYSTIME
071000210928                                       PIC 9(6).
071100210928              10 WS-SYSTIME-2 REDEFINES WS-SYSTIME
071200210928                                       PIC 9(4).
071300210928              10 WS-SYSTIME-HS         PIC 99.
071400210928
071500210928            05 WS-SYSTIME-LONG-N REDEFINES WS-SYSTIME-LONG
071600210928                                       PIC 9(8).
071700210928
071800210928            05 WS-MISC-INFO-AREA       PIC X(40).
071900210928
072000210928            05 WS-MISC-INFO-1 REDEFINES WS-MISC-INFO-AREA.
072100210928              10 WS-MISC-INFO-1-NAME   PIC X(12).
072200210928              10 WS-MISC-INFO-1-DATE   PIC Z9(8).
072300210928              10 FILLER                PIC X(2).
072400210928              10 WS-MISC-INFO-1-NOTE   PIC X(15).
072500210928
072600210928186918     05 lc-ACCOUNT-NO            PIC S9(9)        VALUE 0.
072700210928186918     05 lc-CONTRACT-NO           PIC S9(9)        VALUE 0.
072800210928186918     05 lc-RESET-NUMBER          PIC S9(4)        VALUE 0.
072900210928186918     05 lc-INVESTMENT-CODE       PIC X(05)        VALUE SPACES.
073000210928186918     05 lc-ELEMENT-CODE          PIC X(03)        VALUE "018".
073100210928186918     05 lc-ORIGINAL-VALUE        PIC S9(13)V9(02) VALUE 0.
073200210928186918     05 lc-RESULTING-VALUE       PIC S9(13)V9(02) VALUE 100.
073300210928
073400210928186918     05 lncc_R                   PIC X(01)        VALUE "R".
073500210928
073600210928       01 WS-EXCLUDE-VARIABLES.
073700210928          05 WS-EX-ACCOUNT-NO              PIC 9(9).
073800210928          05 WS-EX-ACCOUNT-TYPE            PIC X(5).
073900210928          05 WS-EX-NOM-ACCOUNT-TYPE        PIC X(5).
074000210928          05 WS-EX-TRANS-TYPE              PIC X(3).
074100210928          05 WS-EX-TRANS-ORIGIN            PIC X(3).
074200210928          05 WS-EX-REVERSAL-CODE           PIC X(4).
074300210928          05 WS-EXCLUDE-TRANS              PIC X(1).
074400210928
074500210928       01 WS-NEXT-PROCESS-DATE          PIC 9(8).                       RFS8712
074600210928       01 WS-NEXT-PROCESS-DATE-R REDEFINES WS-NEXT-PROCESS-DATE.        RFS8712
074700210928          03 WS-NEXT-PROCESS-YEAR       PIC 9(4).                       RFS8712
074800210928          03 WS-NEXT-PROCESS-MONTH      PIC 9(2).                       RFS8712
074900210928          03 WS-NEXT-PROCESS-DAY        PIC 9(2).                       RFS8712
075000210928                                                                        RFS8712
075100210928      * RFS 110904 - START
075200210928       01 lc_InvStructureCode           PIC X(5).
075300210928127401 01 li_count                      PIC S9(10).
075400210928      * RFS 110904 - END
075500210928
075600210928       01 TRANSACTION-CATEGORIES.
075700210928          05 TRANS-CATEGORY              PIC X(3).
075800210928             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI".
075900210928             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
076000210928             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO"
076100210928                                                "TFE" "CQD" "FEE" "SAJ".
076200210928             88 SWITCH-OUT-TRANSACTION   VALUES "SWO" "TRO".
076300210928             88 ADDITION-TRANSACTION     VALUES "BUY" "INC" "CPG"
076400210928                                                "SWI" "TRI" "INT"
076500210928                                                "MFR" "SSD" "SSU" "BAJ"
076600210928                                                "BFW".
076700210928             88 REDUCTION-TRANSACTION    VALUES "SEL" "SWO" "TRO"
076800210928                                                "TFE" "CQD" "FEE" "SAJ".
076900210928             88 VALID-TRANSACTION        VALUES "BUY" "SEL" "SWI"
07700021092826151                                           "MFR"
077100210928                                                "SWO" "TRI" "TRO".
077200210928             88 SWITCH-IN                VALUE "SWI".
077300210928             88 TRANSFER-IN              VALUE "TRI".
077400210928             88 BUY-TRANSACTION          VALUE "BUY".
07750021092826151        88 MAN-FEE-REB-TRANSACTION  VALUE "MFR".
077600210928
077700210928       01 TRANSACTION-STATUS-CATEGORIES.
077800210928          05 TRANS-STATUS-CATEGORY       PIC X(3).
077900210928             88 HISTORY                  VALUES "HST" "HSC".
078000210928             88 HISTORY-CONVERSION       VALUES "HSC".
078100210928             88 PENDING                  VALUES "PND" "VER".
078200210928             88 CONTRACTED               VALUES "CON".
078300210928             88 UNCONFIRMED              VALUES "UNC".
078400210928             88 CANCELLED                VALUES "CAN".
078500210928             88 SETTLED                  VALUES "SET".
078600210928             88 RVSD                     VALUES "RVS".
078700210928
078800210928       01 TRANSACTION-REVERSE-CATEGORIES.
078900210928          05 TRANS-REVERSE-CATEGORY      PIC X(1).
079000210928             88 TRANS-REVERSED           VALUES "Y".
079100210928
079200210928       01 CURRENT-RECORD-VARS.
079300210928          05 CURR-ACCOUNT-NO             PIC S9(9).
079400210928          05 CURR-CONTRACT-NO            PIC 9(9).
079500210928          05 CURR-INVESTMENT-CODE        PIC X(5).
079600210928          05 CURR-EFFECT-DATE            PIC S9(8).
079700210928          05 WS-EXCH-PLACEMENT-DATE      PIC S9(10) COMP-3.
079800210928          05 WS-EXCH-TRANS-NO            PIC S9(10) COMP-3.
079900210928          05 WS-EXCH-CURRENCY            PIC X(3).
080000210928          05 WS-EXCH-TRADE-DATE          PIC 9(8).
080100210928          05 WS-EXCH-RATE-VALUE          PIC S9(2)V9(7) COMP-3.
080200210928          05 WS-TRANS-INVESTMENT-CODE    PIC X(05).
080300210928          05 WS-INVESTMENT-CODE          PIC X(05).
080400210928          05 WS-TRANS-TRADE-AMT          PIC S9(11)V9(2) COMP-3.
080500210928          05 WS-TRANS-TRADE-AMT-BASE     PIC S9(11)V9(2) COMP-3.
080600210928          05 WS-INV-GBV-CUR              PIC S9(11)V9(2) COMP-3.
080700210928          05 WS-INV-GBV                  PIC S9(11)V9(2) COMP-3.
080800210928
080900210928R12702 01 WS-VARS-4ROUNDING.
081000210928R12702    05 WS-CONT-NDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
081100210928R12702    05 WS-CONT-GBV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
081200210928R12702    05 WS-NDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
081300210928R12702    05 WS-GBV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
081400210928
081500210928       01 WS-LEVEL-88.
081600210928          05 WS-SQL-FILE-OPEN              PIC X.
081700210928             88 SQL-FILE-OPEN              VALUE "Y".
081800210928             88 SQL-FILE-NOT-OPEN          VALUE "N".
081900210928          05 WS-LOAD-STRUCTURE             PIC X.
082000210928             88 FRONT-END                  VALUE "F".
082100210928          05 WS-FIRST-PASS                 PIC X.
082200210928             88 FIRST-PASS                 VALUE "Y".
082300210928          05 WS-INV-SEG-FIRST-PASS         PIC X.
082400210928             88 INV-SEG-FIRST-PASS         VALUE "Y".
082500210928          05 WS-CALC-METHOD                PIC X.
082600210928             88 PROPORTIONAL-METHOD        VALUE "P".
082700210928             88 STANDARD-METHOD            VALUE "S".
082800210928R12702    05 WS-NDV-DIFF-FLAG              PIC X(01).
082900210928R12702       88 NDV-DIFFERENCE-FOUND       VALUE "Y".
083000210928R12702    05 WS-GBV-DIFF-FLAG              PIC X(01).
083100210928R12702       88 GBV-DIFFERENCE-FOUND       VALUE "Y".
083200210928R12702    05 WS-NDV-UPDATE-FLAG            PIC X(01).
083300210928R12702       88 NDV-NOT-UPDATED            VALUE "Y".
083400210928R12702    05 WS-GBV-UPDATE-FLAG            PIC X(01).
083500210928R12702       88 GBV-NOT-UPDATED            VALUE "Y".
083600210928R13394    05 WS-XFER-AMT-EXISTS-FLAG       PIC X(01).
083700210928R13394       88 TRANSFER-AMT-EXISTS        VALUE "Y".
083800210928
083900210928       01 WS-SQL-VARIABLES.
084000210928          05 WS-SQL-PROCESS-DATE           PIC S9(9) COMP-3.
084100210928          05 WS-SQL-PROC-SEQ-NO            PIC S9(9) COMP-3.
084200210928          05 WS-SQL-PLACEMENT-DATE         PIC S9(9) COMP-3.
084300210928          05 WS-SQL-TRANS-NO               PIC S9(9) COMP-3.
084400210928
084500210928R11698*01 WS-OTHER-VARIABLES3.
084600210928R11698*   05 WS-FROM-ACCOUNT-TYPE        PIC X(05).
084700210928R11698*   05 WS-FROM-NOM-ACCOUNT-TYPE    PIC X(05).
084800210928R11698*   05 WS-FROM-TRANS-TYPE-CODE     PIC X(03).
084900210928R11698*   05 WS-TO-ACCOUNT-TYPE          PIC X(05).
085000210928R11698*   05 WS-TO-NOM-ACCOUNT-TYPE      PIC X(05).
085100210928R11698*   05 WS-TO-TRANS-TYPE-CODE       PIC X(03).
085200210928R11698*   05 WS-TRANS-ORIGIN-CODE        PIC X(03).
085300210928R11698*   05 WS-FROM-PLACEMENT-DATE      PIC S9(09) COMP-3.
085400210928R11698*   05 WS-FROM-TRANS-NO            PIC S9(09) COMP-3.
085500210928R11698*   05 WS-TO-PLACEMENT-DATE        PIC S9(09) COMP-3.
085600210928R11698*   05 WS-TO-TRANS-NO              PIC S9(09) COMP-3.
085700210928R11698*   05 WS-FROM-ACCOUNT-NO          PIC S9(09) COMP-3.
085800210928R11698*   05 WS-TO-ACCOUNT-NO            PIC S9(09) COMP-3.
085900210928R11698*   05 WS-FROM-CONTRACT-NO         PIC 9(09).
086000210928R11698*   05 WS-TO-CONTRACT-NO           PIC 9(09).
086100210928R11698*   05 WS-TRANSFER-GBV             PIC X(01).
086200210928
086300210928       01 WS-ACC-CON-INV-ARRAYX.
086301211007111744*   05 WS-ACC-CON-INV-ARRAY OCCURS 100 TIMES INDEXED BY CONTIDX.
086302211007111744    05 WS-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES DEPENDING ON
086303211007111744                             ln_InvArraySize INDEXED BY CONTIDX.
086500210928             10 WS-ARRAY-ACCOUNT-NO        PIC 9(09).
086600210928             10 WS-ARRAY-CONTRACT-NO       PIC 9(09).
086700210928             10 WS-ARRAY-INVESTMENT-CODE   PIC X(05).
086800210928             10 WS-ARRAY-CUR-UNITBAL       PIC S9(10)V9(3) COMP-3.
086900210928             10 WS-ARRAY-GBV               PIC S9(11)V9(2) COMP-3.
087000210928             10 WS-ARRAY-GBV-CUR           PIC S9(11)V9(2) COMP-3.
087100210928             10 WS-ARRAY-OPEN-UNITBAL      PIC S9(10)V9(3) COMP-3.
087200210928             10 WS-ARRAY-INV-MV-BEF        PIC S9(11)V9(4) COMP-3.
087300210928             10 WS-ARRAY-INV-MV-AFT        PIC S9(11)V9(2) COMP-3.
087400210928             10 WS-ARRAY-INV-CUR-CODE      PIC X(03).
087500210928             10 WS-ARRAY-EXCH-RATE         PIC S9(02)V9(7) COMP-3.
087600210928
087700210928      * RFS49699 - Begin
087800210928
087900210928       01 WS-ARRAY-LOG-MISC.
088000210928           05 WS-ARRAY1-NAME           PIC X(32)
088100210928                               VALUE "WS-ACC-CON-INV-ARRAY".
088200210928           05 WS-ARRAY1-MAX            PIC 9(09)
088300210928                               VALUE 100.
088400210928           05 WS-ARRAY1-MAX-USED       PIC 9(09)
088500210928                               VALUE 0.
088600210928
088700210928      * RFS49699 - End
088800210928
088900210928      * RFS24943 - Begin
089000210928
089100210928      * RFS29028 - Begin
089200210928       01 SW-REVISED-METHOD-FLAG       PIC 1 VALUE B'0'.
089300210928         88 SW-REVISED-METHOD-NOT-USED VALUE B'0'.
089400210928         88 SW-REVISED-METHOD-USED     VALUE B'1'.
089500210928      * RFS29028 - End
089600210928
089700210928       01  WS-CALC-NEW-GBV-VARS.
089800210928      * Check screen edit code of DMCCON
089900210928           05 WS-DMCCON-EDIT           PIC X(1) VALUE "N".
090000210928             88 WS-DMCCON-EDIT-NO      VALUE "N".
090100210928             88 WS-DMCCON-EDIT-YES     VALUE "Y".
090200210928      * Check account attribute code of PRE99
090300210928           05 WS-PRE-1999              PIC X(1) VALUE "N".
090400210928      * Total Units in the contract
090500210928           05 WS-TOT-UNIT              PIC S9(10)V9(3) COMP-3.
090600210928
090700210928      * RFS80605 - Start
090800210928       01 RESET-PROCESSED-FLAG         PIC X(1) VALUE "N".
090900210928            88 RESET-PROCESSED-NO               VALUE "N".
091000210928            88 RESET-PROCESSED-YES              VALUE "Y".
091100210928
091200210928       01 GDV-SCHED-CODE-EXISTS        PIC X(1) VALUE "N".
091300210928            88 GDV-SCHED-CODE-EXISTS-NO         VALUE "N".
091400210928            88 GDV-SCHED-CODE-EXISTS-YES        VALUE "Y".
091500210928
091600210928       01 CURR-ACCOUNT-NO-SIGNED          PIC S9(9) VALUE 0.
091700210928       01 CURR-CONTRACT-NO-SIGNED         PIC S9(9) VALUE 0.
091800210928
091900210928       01 WS-GDV-SCHED-CODE               PIC X(5)  VALUE SPACES.
092000210928       01 WS-ACCOUNT-NO                   PIC S9(9) VALUE 0.
092100210928       01 WS-CONTRACT-NO                  PIC S9(9) VALUE 0.
092200210928       01 WS-AWD-CARRIED-OVER             PIC S9(13)V9(2).
092300210928
092400210928       01 WS-ERR-CODE              PIC X(2) VALUE SPACES.
092500210928           88 WS-ERR-OK                          VALUE SPACES.
092600210928           88 WS-ERR-10                          VALUE "10".
092700210928           88 WS-ERR-11                          VALUE "11".
092800210928           88 WS-ERR-12                          VALUE "12".
09290021092880605      88 WS-ERR-13                          VALUE "13".
093000210928186918     88 WS-ERR-14                          VALUE "14".
093100210928       01 lb_AWDchangedFlag        PIC X(01) VALUE SPACES.
093200210928           88 lb_AWDChanged_Yes     VALUE "Y".
093300210928           88 lb_AWDChanged_No      VALUE "N".
093400210928      * RFS80605- END
093500210928
093600210928      * RFS132483 - Begin
093700210928
093800210928       01  lc_ScreenAllowed_CMDFCN.
093900210928           05 lc_CMDFCN_ScreenCode       PIC X(8) VALUE "ACCCDTL".
094000210928           05 lc_CMDFCN_EditCode         PIC X(6) VALUE "CMDFCN".
094100210928           05 lc_CMDFCN_EditLevel        PIC X(1) VALUE "C".
094200210928           05 lc_CMDFCN_RtnFlag          PIC X.
094300210928              88 lncc_CMDFCN_EditExist       Value "Y".
094400210928              88 lncc_CMDFCN_EditNotExist    Value "N".
094500210928
094600210928      * RFS132483 - End
09470021092863488  01 WS-FXGETFMV              PIC X(8) VALUE 'FXGETFMV'.
09480021092863488  01 WS-R                     PIC X VALUE 'R'.
09490021092863488  01 PC_ACCOUNTNO             PIC S9(9) VALUE 0.
09500021092863488  01 PC_TRADEDATE             PIC S9(8) VALUE 0.
09510021092863488  01 PC_FMVAMT                PIC S9(9)V9(2) VALUE 0.
09520021092863488  01 PC_MODE                  PIC X(1).
09530021092863488  01 PC_CONTRACTNO            PIC S9(9) VALUE 0.
09540021092863488  01 PC_INVESTMENTCODE        PIC X(5).
09550021092863488  01 PC_UNITAMOUNT            PIC S9(9)V9(3) VALUE 0.
095600210928
095700210928      * Screen Edits Allowed Declaration
095800210928       01  SCREEN-EDITS-ALLOWED-REC.
095900210928                             COPY DD-ALL-FORMATS OF MFAEDTSCP.
096000210928      * Use the function FXSCEDTALW
096100210928       01  WS-SCREEN-EDITS-ALLOWED.
096200210928           05 WS-SEA-EDIT-SQLLOG           PIC X(1) VALUE "N".
096300210928           05 WS-SEA-RETURN-CODE           PIC X(2) VALUE "00".
096400210928
096500210928       01  WS-SCREEN-EDITS-ALLOWED.
096600210928           05 WS-ACCCDTL-SCREEN-CODE   PIC X(8)     VALUE "ACCCDTL".
096700210928           05 WS-DMCCON-EDIT-CODE      PIC X(8)     VALUE "DMCCON" .
096800210928           05 WS-DMCCON-LEVEL-CODE     PIC X(1)     VALUE "A".
096900210928      * RFS24943 - End
097000210928
09710021092857388  01 WS-RESET-NUMBER-C         PIC X(5).
09720021092857388  01 WS-INSPECT-CNT            PIC 9(1).
097300210928
097400210928180708 01 WS-PLACEMENTDATE          PIC S9(09) VALUE 0.
097500210928180708 01 WS-TRANSNO                PIC S9(09) VALUE 0.
097600210928
097700210928      *RFS186918 STARTS
097800210928       01 lc_MFASEGPARM.
097900210928          05 FILLER                         PIC X(50) VALUE SPACES.
098000210928          05 lc_AccountLvlGuarantee         PIC X(01).
098100210928             88 lb_AccountLvlGuaranteeYes   VALUE "Y".
098200210928             88 lb_AccountLvlGuaranteeNo    VALUE "N".
098300210928          05 FILLER                         PIC X(05).
098400210928          05 lc_ManualResetCompareGMV       PIC X(01).
098500210928             88 lb_ManualResetCompareGMVYes VALUE "Y".
098600210928             88 lb_ManualResetCompareGMVNo  VALUE "N".
098700210928      *RFS186918 ENDS
098701211007      * RFS1117445 - START
098702211007       01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
098703211007       01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
098704211007       01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
098705211007      * RFS1117445 - END
098800210928
098900210928      * ---------------------------------------------------------------
099000210928       LINKAGE SECTION.
099100210928        01 COMM-AREA                     PIC X(200).
099200210928        01 COMM-AREA-BUFFER REDEFINES COMM-AREA.
099300210928           03 COMM-REJECTION-CODE        PIC X(3).
099400210928           03 COMM-USER                  PIC X(10).
099500210928           03 COMM-CALLER-ID-CODE        PIC X(10).
099600210928           03 COMM-ACTION                PIC X(10).
099700210928           03 COMM-OPEN-FILES            PIC X(1).
099800210928      * 'Y' = open files, otherwise skip open files
099900210928           03 COMM-SPMODULE              PIC X(1).
100000210928           03 COMM-PROCESS-DATE          PIC S9(8).
100100210928           03 COMM-ACCOUNT-NO            PIC 9(9).
100200210928           03 COMM-CONTRACT-NO           PIC 9(9).
100300210928           03 COMM-RESET-NUMBER          PIC 9(5).
100400210928           03 COMM-RESET-REQ-FUND        PIC X(5).
100500210928      * The following data fields for ONE FUND only:
100600210928           03 COMM-CURR-UNIT-BAL         PIC S9(10)V9(3) COMP-3.
100700210928           03 COMM-OLD-NET-DEP-VALUE     PIC S9(11)V9(2) COMP-3.
100800210928           03 COMM-OLD-GUAR-BASE-VALUE   PIC S9(11)V9(2) COMP-3.
100900210928           03 COMM-NEW-NET-DEP-VALUE     PIC S9(11)V9(2) COMP-3.
101000210928           03 COMM-NEW-GUAR-BASE-VALUE   PIC S9(11)V9(2) COMP-3.
101100210928           03 COMM-OLD-NET-DEP-VAL-CUR   PIC S9(11)V9(2) COMP-3.
101200210928           03 COMM-OLD-GUAR-BASE-VAL-CUR PIC S9(11)V9(2) COMP-3.
101300210928           03 COMM-NEW-NET-DEP-VAL-CUR   PIC S9(11)V9(2) COMP-3.
101400210928           03 COMM-NEW-GUAR-BASE-VAL-CUR PIC S9(11)V9(2) COMP-3.
101500210928R58986     03 COMM-NDRST-EDIT            PIC X(1).
101600210928129784     03 COMM-PRODUCT-RESET         PIC X(1).
101700210928       PROCEDURE DIVISION USING COMM-AREA.
101800210928       MAINLINE.
101900210928           PERFORM INITIAL-LOGIC     THRU INL-EXIT.
102000210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
102100210928              GO TO ML-1200.
102200210928       ML-0010.
102300210928           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
102400210928       ML-0020.
102500210928           IF PREV-CONTROLS IS EQUAL TO LOW-VALUES
102600210928              GO TO ML-0040.
102700210928       ML-0030.
102800210928       ML-0040.
102900210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
103000210928              GO TO ML-1200.
103100210928       ML-0050.
103200210928           MOVE CURR-CONTROLS          TO PREV-CONTROLS.
103300210928       ML-1100.
103400210928           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
103500210928           GO TO ML-0010.
103600210928       ML-1200.
103700210928           PERFORM END-JOB             THRU EOJ-EXIT.
103800210928           GOBACK.
103900210928      *RFS80605- Start
104000210928
104100210928        COPY CPYSQLRTN.
104200210928      *RFS80605- End
104300210928      /
104400210928       GET-CURRENT-RECORD.
104500210928
104600210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
104700210928              GO TO GCR-EXIT
104800210928           END-IF.
104900210928
105000210928           EVALUATE COMM-ACTION
105100210928
105200210928           WHEN "ALL FUNDS"
105300210928             PERFORM GET-ALL-FUNDS-RECORD
105400210928                                       THRU GAFR-EXIT
105500210928           WHEN OTHER
105600210928             MOVE HIGH-VALUES  TO CURR-CONTROLS
105700210928
105800210928           END-EVALUATE.
105900210928
106000210928       GCR-EXIT.
106100210928           EXIT.
106200210928      /
106300210928       GET-ALL-FUNDS-RECORD.
106400210928      *    DISPLAY "GET-ALL-FUNDS-RECORD...............".
106500210928      * RFS29028 - Begin
106600210928           SET SW-REVISED-METHOD-NOT-USED      TO TRUE
106700210928      * RFS29028 - End
106800210928
106900210928           MOVE COMM-ACCOUNT-NO
107000210928                             TO ACCOUNT-NO
107100210928                             OF ACCOUNT-CONTRACT-INV-RESET.
107200210928           MOVE COMM-CONTRACT-NO
107300210928                             TO CONTRACT-NO
107400210928                             OF ACCOUNT-CONTRACT-INV-RESET.
107500210928           MOVE COMM-RESET-NUMBER
107600210928                             TO RESET-NUMBER
107700210928                             OF ACCOUNT-CONTRACT-INV-RESET.
107800210928
107900210928           START ACCOUNT-CONTRACT-INV-RESET
108000210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
108100210928           INVALID KEY
108200210928           MOVE HIGH-VALUES  TO CURR-CONTROLS
108300210928           GO TO GAFR-EXIT.
108400210928
108500210928           MOVE COMM-ACCOUNT-NO
108600210928                             TO ACCOUNT-NO OF ACCOUNT-CONTRACT.
108700210928           MOVE COMM-CONTRACT-NO
108800210928                             TO CONTRACT-NO OF ACCOUNT-CONTRACT.
108900210928
109000210928           READ ACCOUNT-CONTRACT.
109100210928
109200210928      *** RFS 15872  starts
109300210928      *    DISPLAY "COMM-ACCOUNT-NO..." COMM-ACCOUNT-NO.
109400210928      *    DISPLAY "COMM-CONTRACT-NO.." COMM-CONTRACT-NO.
109500210928      *    DISPLAY "COMM-RESET-NUMBER..." COMM-RESET-NUMBER.
109600210928      *** RFS 15872  ends
109700210928           MOVE COMM-ACCOUNT-NO
109800210928                             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-RESET.
109900210928           MOVE COMM-CONTRACT-NO
110000210928                             TO CONTRACT-NO OF ACCOUNT-CONTRACT-RESET.
110100210928           MOVE COMM-RESET-NUMBER
110200210928                             TO RESET-NUMBER OF ACCOUNT-CONTRACT-RESET.
110300210928
110400210928           READ ACCOUNT-CONTRACT-RESET.
110500210928
110600210928           MOVE COMM-ACCOUNT-NO
110700210928                             TO ACCOUNT-NO OF ACCOUNT.
110800210928           READ ACCOUNT.
110900210928       GAFR-EXIT.
111000210928           EXIT.
111100210928
111200210928      /
111300210928       DETAIL-PROCESSING.
111400210928
111500210928           EVALUATE COMM-ACTION
111600210928
111700210928           WHEN "ALL FUNDS"
111800210928             PERFORM DETAIL-ALL-FUNDS-PROCESSING
111900210928                                       THRU DAFP-EXIT
112000210928           WHEN OTHER
112100210928           MOVE HIGH-VALUES  TO CURR-CONTROLS
112200210928
112300210928           END-EVALUATE.
112400210928
112500210928      * RFS80605 - START
112600210928
112700210928      * RFS96705 changed the operator from >= to >
112800210928
112900210928           IF RESET-PROCESSED-FLAG = 'Y' AND GDV-SCHED-CODE-EXISTS-YES
113000210928 96705      AND (WS-NEW-GBV-TOTAL > WS-OLD-GBV-TOTAL OR
113100210928             COMM-NDRST-EDIT = 'Y')
113200210928                PERFORM UPDATE-ACCOUNT-CONTRACT
113300210928           END-IF
113400210928      * RFS80605 - END
113500210928
113600210928           IF COMM-SPMODULE = 'Y'
113700210928             IF WS-NEW-GBV-TOTAL < WS-OLD-GBV-TOTAL
113800210928R58986       AND Comm-NDRST-Edit = "N"
113900210928R5375        AND COMM-PRODUCT-RESET = SPACES
114000210928              PERFORM MOVE-OLD-TO-NEW THRU MOTN-EXIT.
114100210928      * RFS129784 - BEGIN.
114200210928           IF COMM-PRODUCT-RESET = 'N'
114300210928              PERFORM MOVE-OLD-TO-NEW THRU MOTN-EXIT
114400210928           END-IF.
114500210928      * RFS129784 - END.
114600210928
114700210928       DPR-EXIT.
114800210928           EXIT.
114900210928      /
115000210928       DETAIL-ALL-FUNDS-PROCESSING.
115100210928      *    DISPLAY "DETAIL-ALL-FUNDS-PROCESSING............".
115200210928
115300210928           MOVE "Y" TO WS-FIRST-PASS WS-INV-SEG-FIRST-PASS.
115400210928           MOVE "P" TO WS-CALC-METHOD.
115500210928      * RFS24943 - Begin
115600210928           MOVE "N" TO WS-PRE-1999.
115700210928
115800210928      * RFS24943 - End
115900210928
116000210928      * RFS80605 - START
116100210928           SET RESET-PROCESSED-YES TO TRUE.
116200210928      * RFS80605 - End
116300210928
116400210928       DAFP-0010.
116500210928      *    DISPLAY "DAFP-0010.......".
116600210928
116700210928           READ ACCOUNT-CONTRACT-INV-RESET NEXT RECORD
116800210928           AT END
116900210928           GO TO DAFP-0500.
117000210928
117100210928           IF ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
117200210928              COMM-ACCOUNT-NO
117300210928             GO TO DAFP-0500
117400210928           END-IF.
117500210928
117600210928           IF CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
117700210928              COMM-CONTRACT-NO
117800210928             GO TO DAFP-0500
117900210928           END-IF.
118000210928
118100210928           IF RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET NOT =
118200210928              COMM-RESET-NUMBER
118300210928             GO TO DAFP-0500
118400210928           END-IF.
118500210928
118600210928      * Skip process if it has already been reset
118700210928
118800210928           IF RESET-PROCESSED OF ACCOUNT-CONTRACT-INV-RESET = "Y"
118900210928             GO TO DAFP-0010
119000210928           END-IF.
119100210928
119200210928           INITIALIZE CURRENT-RECORD-VARS.
119300210928           MOVE ACCOUNT-NO   OF ACCOUNT-CONTRACT-INV-RESET
119400210928                             TO ACCOUNT-NO
119500210928                             OF ACCOUNT-CONTRACT-INVESTMENT
119600210928                             CURR-ACCOUNT-NO.
119700210928           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-INV-RESET
119800210928                             TO CONTRACT-NO
119900210928                             OF ACCOUNT-CONTRACT-INVESTMENT
120000210928                             CURR-CONTRACT-NO.
120100210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
120200210928                             TO INVESTMENT-CODE
120300210928                             OF ACCOUNT-CONTRACT-INVESTMENT
120400210928                             CURR-INVESTMENT-CODE.
120500210928           MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET
120600210928                             TO CURR-EFFECT-DATE.
120700210928
120800210928      *    READ ACCOUNT-CONTRACT-INVESTMENT.
120900210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK.
121000210928
121100210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
121200210928                             TO INVESTMENT-CODE OF INVESTMENT.
121300210928
121400210928           READ INVESTMENT.
121500210928
121600210928      * Use the price from the account-contract-inv-reset directly
121700210928      * if death or maturity reset.
121800210928
121900210928           IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "D" OR "M"
122000210928             MOVE "Y"        TO WS-PRICE-FOUND
122100210928             MOVE TRADE-DATE OF ACCOUNT-CONTRACT-INV-RESET
122200210928                             TO TRADE-DATE OF INVESTMENT-UNIT-PRICE
122300210928             MOVE UNIT-PRICE OF ACCOUNT-CONTRACT-INV-RESET
122400210928                             TO UNIT-PRICE OF INVESTMENT-UNIT-PRICE
122500210928             GO TO DAFP-0020
122600210928           END-IF.
122700210928
122800210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
122900210928                             TO INVESTMENT-CODE
123000210928                             OF INVESTMENT-UNIT-PRICE.
123100210928
123200210928XXXXXX     MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
123300210928XXXXXX                     TO WS-CURR-UNIT-BAL WS-ACC-CON-INV-UNIT-BAL.
123400210928
123500210928XXXXXX* Get the total number of units as of the Effective date
123600210928XXXXXX* of the contract, if less than the process-date
123700210928XXXXXX* Also, calculate the NDV prior to this reset
123800210928XXXXXX     IF EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET
123900210928XXXXXX        IS LESS THAN COMM-PROCESS-DATE
124000210928XXXXXX*       PERFORM CALC-NEW-NET-DEP-VALUE THRU CNND-EXIT
12410021092863488 * the below stmt is commented and a new para is included next line
12420021092863488 *       PERFORM GET-UNIT-BALANCE THRU GUB-EXIT
12430021092863488         PERFORM GET-FMV-PARA
124400210928XXXXXX        MOVE WS-ACC-CON-INV-UNIT-BAL TO WS-CURR-UNIT-BAL
124500210928XXXXXX     END-IF.
124600210928
124700210928XXXXXX     IF WS-CURR-UNIT-BAL = 0
124800210928XXXXXX        MOVE "Y"         TO WS-PRICE-FOUND
124900210928XXXXXX        MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET
125000210928XXXXXX                         TO TRADE-DATE OF INVESTMENT-UNIT-PRICE
125100210928XXXXXX        MOVE 0           TO UNIT-PRICE OF INVESTMENT-UNIT-PRICE
125200210928XXXXXX
125300210928XXXXXX        MOVE "Y"         TO WS-EXCHANGE-FOUND
125400210928XXXXXX        MOVE 1.0         TO EXCHANGE-RATE OF EXCHANGE-RATE-M
125500210928XXXXXX        GO TO DAFP-0035
125600210928XXXXXX     END-IF.
125700210928
125800210928           MOVE EFFECT-DATE  OF ACCOUNT-CONTRACT-INV-RESET
125900210928                             TO TRADE-DATE
126000210928                             OF INVESTMENT-UNIT-PRICE.
126100210928
126200210928           MOVE SPACES       TO DISTRIBUTION-FLAG
126300210928                             OF INVESTMENT-UNIT-PRICE.
126400210928
126500210928           READ INVESTMENT-UNIT-PRICE
126600210928           INVALID KEY
126700210928             PERFORM GET-LAST-UNIT-PRICE
126800210928                             THRU GLUP-EXIT
126900210928             IF WS-PRICE-FOUND NOT = "Y"
127000210928               MOVE "05"     TO WS-REJECTION-CODE
127100210928               MOVE "TRADE DATE:"
127200210928                             TO WS-MISC-INFO-1-NAME
127300210928               MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET
127400210928                             TO WS-MISC-INFO-1-DATE
127500210928               MOVE "NOT FOUND"
127600210928                             TO WS-MISC-INFO-1-NOTE
127700210928               PERFORM LOG-ERROR THRU LER-EXIT
127800210928               GO TO DAFP-0040
127900210928             END-IF.
128000210928
128100210928       DAFP-0020.
128200210928
128300210928           IF UNIT-PRICE OF INVESTMENT-UNIT-PRICE = ZEROS
128400210928             MOVE "05"       TO WS-REJECTION-CODE
128500210928             MOVE "TRADE DATE:"
128600210928                             TO WS-MISC-INFO-1-NAME
128700210928             MOVE TRADE-DATE OF INVESTMENT-UNIT-PRICE
128800210928                             TO WS-MISC-INFO-1-DATE
128900210928             MOVE "ZERO VALUE"
129000210928                             TO WS-MISC-INFO-1-NOTE
129100210928             PERFORM LOG-ERROR THRU LER-EXIT
129200210928             GO TO DAFP-0040
129300210928           END-IF.
129400210928
129500210928
129600210928      * Use the exchange from the account-contract-inv-reset directly
129700210928      * if death or maturity reset.
129800210928
129900210928           IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "D" OR "M"
130000210928             MOVE "Y"        TO WS-EXCHANGE-FOUND
130100210928             MOVE EXCHANGE-RATE OF ACCOUNT-CONTRACT-INV-RESET
130200210928                             TO EXCHANGE-RATE OF EXCHANGE-RATE-M
130300210928             GO TO DAFP-0030
130400210928           END-IF.
130500210928
130600210928           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
130700210928             PERFORM GET-EXCHANGE-RATE
130800210928                             THRU GER-EXIT
130900210928           ELSE
131000210928             MOVE "Y"        TO WS-EXCHANGE-FOUND
131100210928             MOVE 1.0        TO EXCHANGE-RATE OF EXCHANGE-RATE-M
131200210928           END-IF.
131300210928
131400210928       DAFP-0030.
131500210928
131600210928           IF WS-EXCHANGE-FOUND NOT = "Y"
131700210928             MOVE "06"       TO WS-REJECTION-CODE
131800210928             MOVE "TRADE DATE:"
131900210928                             TO WS-MISC-INFO-1-NAME
132000210928             MOVE TRADE-DATE OF INVESTMENT-UNIT-PRICE
132100210928                             TO WS-MISC-INFO-1-DATE
132200210928             MOVE "NOT FOUND"
132300210928                             TO WS-MISC-INFO-1-NOTE
132400210928             PERFORM LOG-ERROR THRU LER-EXIT
132500210928             GO TO DAFP-0040
132600210928           END-IF.
132700210928
132800210928           IF EXCHANGE-RATE OF EXCHANGE-RATE-M = ZEROS
132900210928             MOVE "06"       TO WS-REJECTION-CODE
133000210928             MOVE "TRADE DATE:"
133100210928                             TO WS-MISC-INFO-1-NAME
133200210928             MOVE TRADE-DATE OF INVESTMENT-UNIT-PRICE
133300210928                             TO WS-MISC-INFO-1-DATE
133400210928             MOVE "ZERO VALUE"
133500210928                             TO WS-MISC-INFO-1-NOTE
133600210928             PERFORM LOG-ERROR THRU LER-EXIT
133700210928             GO TO DAFP-0040
133800210928           END-IF.
133900210928
134000210928XXXXXX DAFP-0035.
134100210928      * Calculate new guar. base value
134200210928
134300210928      *    MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
134400210928      *                      TO WS-NEW-NET-DEP-VALUE.
134500210928      *    MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
134600210928      *                      TO WS-NEW-NET-DEP-VALUE-CUR.
134700210928
134800210928      * Determine whether proportionate or standard
134900210928           IF INV-SEG-FIRST-PASS
135000210928              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
135100210928                TO INVESTMENT-CODE OF INVESTMENT-SEG
135200210928              READ INVESTMENT-SEG
135300210928                   INVALID KEY
135400210928                   MOVE "P" TO WS-CALC-METHOD
135500210928              END-READ
135600210928              MOVE "N" TO WS-INV-SEG-FIRST-PASS
135700210928
135800210928      * RFS80605 - START
135900210928              MOVE GDV-SCHED-CODE OF INVESTMENT-SEG
136000210928                TO WS-GDV-SCHED-CODE
136100210928
136200210928              PERFORM GET-GDV-SCHED-CODE
136300210928
136400210928      * RFS80605 - END
136500210928           END-IF.
136600210928
136700210928      * RFS 20516 - Start
136800210928           INITIALIZE MFAACCATP OF ACCOUNT-ATTRIBUTES-REC.
136900210928           MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-RESET
137000210928                           TO ACCOUNT-NO OF ACCOUNT-ATTRIBUTES.
137100210928           MOVE "PRE99"    TO ACCOUNT-ATTRIBUTE-CODE
137200210928                           OF ACCOUNT-ATTRIBUTES.
137300210928           READ ACCOUNT-ATTRIBUTES
137400210928           NOT INVALID KEY
137500210928               MOVE "S" TO WS-CALC-METHOD
137600210928      * RFS24943 - Begin
137700210928               MOVE "Y" TO WS-PRE-1999
137800210928      * RFS24943 - End
137900210928           INVALID KEY
138000210928               GO TO DAFP-0032
138100210928           END-READ.
138200210928       DAFP-0032.
138300210928      * RFS 20516 - End
138400210928
138500210928      * Get the last GBV of the trade of the account/contract/investment
138600210928      ** prior to this reset.
138700210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
138800210928             TO WS-OLD-GUAR-BASE-VALUE.
138900210928           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
139000210928             TO WS-OLD-GUAR-BASE-VALUE-CUR.
139100210928           MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
139200210928             TO WS-OLD-NET-DEP-VALUE.
139300210928           MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
139400210928             TO WS-OLD-NET-DEP-VALUE-CUR.
139500210928
139600210928      * RFS24943 - Begin
139700210928      * For revised direct method just continue: the program will
139800210928      * capture MV for the effective date.
139900210928           IF ( WS-DMCCON-EDIT-YES     AND
140000210928                WS-PRE-1999 = LT-Y )
140100210928            SET SW-REVISED-METHOD-USED         TO TRUE
140200210928           ELSE
140300210928            IF EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET
140400210928              IS LESS THAN COMM-PROCESS-DATE
140500210928              IF PROPORTIONAL-METHOD
140600210928                 IF FIRST-PASS
140700210928                    MOVE "N" TO WS-FIRST-PASS
140800210928                    PERFORM GET-ACC-CON-INV-GBV THRU GACIG-EXIT
140900210928      *             DISPLAY "WS-REJECTION-CODE..." WS-REJECTION-CODE
141000210928                    IF WS-REJECTION-CODE NOT = " " AND "00"
141100210928                       MOVE HIGH-VALUES TO CURR-CONTROLS
141200210928                       GO TO DAFP-EXIT
141300210928                    END-IF
141400210928                 END-IF
141500210928                 PERFORM GET-INV-PREVIOUS-GBV THRU GIPG-EXIT
141600210928              ELSE
141700210928                 PERFORM GET-STANDARD-PREVIOUS-GBV THRU GSPG-EXIT
141800210928              END-IF
141900210928            END-IF
142000210928      * RFS24943 - Begin
142100210928           END-IF.
142200210928      * RFS24943 - End
142300210928
142400210928           PERFORM CALC-NEW-GUAR-BASE-VALUE
142500210928                             THRU CNGB-EXIT.
142600210928
142700210928      *RFS186918 STARTS
142800210928           IF lb_ManualResetCompareGMVYes AND
142900210928              RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = lncc_R
143000210928              PERFORM GMVResetProcess
143100210928                 THRU GMVResetProcess-EXIT
143200210928           END-IF
143300210928      *RFS186918 ENDS
143400210928
143500210928      * Set Account-Contract-Inv-Reset record
143600210928
143700210928           MOVE "Y"          TO RESET-PROCESSED
143800210928                             OF ACCOUNT-CONTRACT-INV-RESET.
143900210928           MOVE TRADE-DATE   OF INVESTMENT-UNIT-PRICE
144000210928                             TO TRADE-DATE
144100210928                             OF ACCOUNT-CONTRACT-INV-RESET.
144200210928           MOVE UNIT-PRICE   OF INVESTMENT-UNIT-PRICE
144300210928                             TO UNIT-PRICE
144400210928                             OF ACCOUNT-CONTRACT-INV-RESET.
144500210928
144600210928           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M
144700210928                             TO EXCHANGE-RATE
144800210928                             OF ACCOUNT-CONTRACT-INV-RESET.
144900210928      *    MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
145000210928           MOVE WS-CURR-UNIT-BAL
145100210928                             TO CURR-UNIT-BAL
145200210928                             OF ACCOUNT-CONTRACT-INV-RESET.
145300210928
145400210928      *    MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
145500210928           MOVE WS-OLD-NET-DEP-VALUE
145600210928                             TO OLD-NET-DEPOSIT-VALUE
145700210928                             OF ACCOUNT-CONTRACT-INV-RESET.
145800210928      *    MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
145900210928           MOVE WS-OLD-GUAR-BASE-VALUE
146000210928                             TO OLD-GUAR-BASE-VALUE
146100210928                             OF ACCOUNT-CONTRACT-INV-RESET.
146200210928
146300210928      *    MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
146400210928           MOVE WS-OLD-NET-DEP-VALUE-CUR
146500210928                             TO OLD-NET-DEPOSIT-VALUE-CUR
146600210928                             OF ACCOUNT-CONTRACT-INV-RESET.
146700210928      *    MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
146800210928           MOVE WS-OLD-GUAR-BASE-VALUE-CUR
146900210928                             TO OLD-GUAR-BASE-VALUE-CUR
147000210928                             OF ACCOUNT-CONTRACT-INV-RESET.
147100210928
147200210928           MOVE WS-NEW-GUAR-BASE-VALUE
147300210928                             TO NEW-GUAR-BASE-VALUE
147400210928                             OF ACCOUNT-CONTRACT-INV-RESET.
147500210928           MOVE WS-NEW-GUAR-BASE-VAL-CUR
147600210928                             TO NEW-GUAR-BASE-VALUE-CUR
147700210928                             OF ACCOUNT-CONTRACT-INV-RESET.
147800210928
147900210928           MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
148000210928      *    MOVE WS-NEW-NET-DEP-VALUE
148100210928                             TO NEW-NET-DEPOSIT-VALUE
148200210928                             OF ACCOUNT-CONTRACT-INV-RESET.
148300210928           MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
148400210928      *    MOVE WS-NEW-NET-DEP-VALUE-CUR
148500210928                             TO NEW-NET-DEPOSIT-VALUE-CUR
148600210928                             OF ACCOUNT-CONTRACT-INV-RESET.
148700210928
148800210928      *    Calculate the total old and new GBV
148900210928
149000210928           IF COMM-SPMODULE = 'Y'
149100210928R58986     OR Comm-NDRST-Edit = "Y"
149200210928             COMPUTE WS-OLD-GBV-TOTAL = WS-OLD-GBV-TOTAL +
149300210928                                        WS-OLD-GUAR-BASE-VALUE
149400210928
149500210928             COMPUTE WS-NEW-GBV-TOTAL = WS-NEW-GBV-TOTAL +
149600210928                                        WS-NEW-GUAR-BASE-VALUE.
149700210928
149800210928      * Skip update of reset pointer and account-contract-investment
149900210928      * for death or maturity reset.
150000210928
150100210928           IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "D" OR "M"
150200210928R58986*       OR Comm-NDRST-Edit = "Y"
150300210928             GO TO DAFP-0040
150400210928           END-IF.
150500210928
150600210928           MOVE LAST-RESET-DATE OF ACCOUNT-CONTRACT-INVESTMENT
150700210928                             TO LAST-RESET-DATE
150800210928                             OF ACCOUNT-CONTRACT-INV-RESET.
150900210928
151000210928           MOVE LAST-RESET-NUMBER OF ACCOUNT-CONTRACT-INVESTMENT
151100210928                             TO LAST-RESET-NUMBER
151200210928                             OF ACCOUNT-CONTRACT-INV-RESET.
151300210928
151400210928      * Set Account-Contract-Investment record
151500210928
151600210928           MOVE EFFECT-DATE  OF ACCOUNT-CONTRACT-INV-RESET
151700210928                             TO LAST-RESET-DATE
151800210928                             OF ACCOUNT-CONTRACT-INVESTMENT.
151900210928           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
152000210928                             TO LAST-RESET-NUMBER
152100210928                             OF ACCOUNT-CONTRACT-INVESTMENT.
152200210928
152300210928           MOVE WS-NEW-GUAR-BASE-VALUE
152400210928                             TO GUAR-BASE-VALUE
152500210928                             OF ACCOUNT-CONTRACT-INVESTMENT.
152600210928           MOVE WS-NEW-GUAR-BASE-VAL-CUR
152700210928                             TO GUAR-BASE-VALUE-CUR
152800210928                             OF ACCOUNT-CONTRACT-INVESTMENT.
152900210928
153000210928      * RFS29028 - Begin: need to update Opening Unit balance
153100210928      *                   which will be used in calculations.
153200210928           IF SW-REVISED-METHOD-USED
153300210928             MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INV-RESET   TO
153400210928                  OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT
153500210928           END-IF.
153600210928      * RFS29028 - End
153700210928
153800210928      *    MOVE WS-NEW-NET-DEP-VALUE
153900210928      *                      TO NET-DEPOSIT-VALUE
154000210928      *                      OF ACCOUNT-CONTRACT-INVESTMENT.
154100210928      *    MOVE WS-NEW-NET-DEP-VALUE-CUR
154200210928      *                      TO NET-DEPOSIT-VALUE-CUR
154300210928      *                      OF ACCOUNT-CONTRACT-INVESTMENT.
154400210928
154500210928       DAFP-0040.
154600210928
154700210928           REWRITE ACC-CON-INV-REC.
154800210928           REWRITE ACC-CON-INV-RESET-REC.
154900210928
155000210928           GO TO DAFP-0010.
155100210928
155200210928       DAFP-0500.
155300210928
155400210928      * Skip update data if error
155500210928
155600210928           IF COMM-REJECTION-CODE NOT = " " AND "00"
155700210928             GO TO DAFP-0900
155800210928           END-IF.
155900210928
156000210928      * Skip update if it has already been reset
156100210928
156200210928           IF RESET-PROCESSED OF ACCOUNT-CONTRACT-RESET = "Y"
156300210928             GO TO DAFP-0900
156400210928           END-IF.
156500210928
156600210928      * Set Account-Contract-Reset record
156700210928
156800210928           MOVE "Y"          TO RESET-PROCESSED
156900210928                             OF ACCOUNT-CONTRACT-RESET.
157000210928           MOVE COMM-PROCESS-DATE                                       RFS8712
157100210928      *    MOVE WS-NEXT-PROCESS-DATE                                    RFS8712
157200210928                             TO RESET-PROCESSED-DATE
157300210928                             OF ACCOUNT-CONTRACT-RESET.
157400210928      * 57388 begins
15750021092875247 *    MOVE COMM-PROCESS-DATE
15760021092875247 *                      TO LAST-RESET-DATE
15770021092875247 *                      OF ACCOUNT-CONTRACT-RESET.
157800210928      * 57388 ends
157900210928      * RFS107679 - start
158000210928132483     IF lncc_CMDFCN_EditExist
158100210928               MOVE MATURITY-DATE OF ACCOUNT-CONTRACT
158200210928                         TO ORIGINAL-CMD
158300210928132483*                  OF ACCOUNT-CONTRACT.
158400210928132483                   OF ACCOUNT-CONTRACT
158500210928132483     END-IF.
158600210928
158700210928      * RFS107679 - End
158800210928      * Set Account-Contract record
158900210928
159000210928R58986     IF Comm-NDRST-Edit = "N"
159100210928           MOVE DEPOSIT-MATURITY-DATE OF ACCOUNT-CONTRACT-RESET
159200210928                             TO DEPOSIT-MATURITY-DATE
159300210928                             OF ACCOUNT-CONTRACT.
159400210928
15950021092880605      PERFORM GET-AWD-CARRIED-OVER.
159600210928
159700210928       DAFP-0900.
159800210928
159900210928           REWRITE ACC-CON-RESET-REC.
160000210928           REWRITE ACC-CON-REC.
160100210928
16020021092857388      PERFORM WRITE-CONTRACT-LOG.
160300210928
160400210928           MOVE HIGH-VALUES  TO CURR-CONTROLS.
160500210928
160600210928       DAFP-EXIT.
160700210928           EXIT.
160800210928      /
160900210928       GET-INV-PREVIOUS-GBV.
161000210928      *    DISPLAY "GET-INV-PREVIOUS-GBV.................".
161100210928           SET CONTIDX TO 1.
161200210928
161300210928           SEARCH WS-ACC-CON-INV-ARRAY VARYING CONTIDX
161400210928           WHEN WS-ARRAY-ACCOUNT-NO(CONTIDX) =
161500210928                ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT AND
161600210928                WS-ARRAY-CONTRACT-NO(CONTIDX) =
161700210928                CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT AND
161800210928                WS-ARRAY-INVESTMENT-CODE(CONTIDX) =
161900210928                INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
162000210928                GO TO GIPG-0010
162100210928           WHEN WS-ARRAY-ACCOUNT-NO(CONTIDX) = 0 OR
162200210928                WS-ARRAY-CONTRACT-NO(CONTIDX) = 0 OR
162300210928                WS-ARRAY-INVESTMENT-CODE(CONTIDX) = " "
162400210928                GO TO GIPG-EXIT
162500210928           END-SEARCH.
162600210928
162700210928       GIPG-0010.
162800210928      *    DISPLAY "GIPG-0010.................................".
162900210928      *    DISPLAY "ACC-CON-INV SEARCH FOUND!!!!!!!!!!!!!!!!!".
163000210928R15872*    DISPLAY "WS-ARRAY-INVESTMENT-CODE......"
163100210928R15872*             WS-ARRAY-INVESTMENT-CODE(CONTIDX).
163200210928
163300210928           MOVE WS-ARRAY-GBV(CONTIDX) TO WS-OLD-GUAR-BASE-VALUE.
163400210928           MOVE WS-ARRAY-GBV-CUR(CONTIDX) TO WS-OLD-GUAR-BASE-VALUE-CUR.
163500210928
163600210928      *** RFS 15872  starts
163700210928      *    DISPLAY "WS-OLD-GUAR-BASE-VALUE...."
163800210928      *             WS-OLD-GUAR-BASE-VALUE.
163900210928      *    DISPLAY "WS-OLD-GUAR-BASE-VALUE-CUR..."
164000210928      *             WS-OLD-GUAR-BASE-VALUE-CUR.
164100210928      *** RFS 15872  ends
164200210928
164300210928       GIPG-EXIT.
164400210928           EXIT.
164500210928      /
164600210928       CALC-NEW-GUAR-BASE-VALUE.
164700210928
164800210928           COMPUTE WS-NEW-GUAR-BASE-VAL-CUR ROUNDED =
164900210928                   WS-CURR-UNIT-BAL *
165000210928                   UNIT-PRICE OF INVESTMENT-UNIT-PRICE.
165100210928
165200210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
165300210928             MOVE WS-NEW-GUAR-BASE-VAL-CUR
165400210928                             TO WS-NEW-GUAR-BASE-VALUE
165500210928           ELSE
165600210928             COMPUTE WS-NEW-GUAR-BASE-VALUE ROUNDED =
165700210928                     WS-CURR-UNIT-BAL *
165800210928                     UNIT-PRICE OF INVESTMENT-UNIT-PRICE /
165900210928                     EXCHANGE-RATE OF EXCHANGE-RATE-M
166000210928           END-IF.
166100210928
166200210928       CNGB-EXIT.
166300210928           EXIT.
166400210928
166500210928      *RFS186918 STARTS
166600210928       GMVResetProcess.
166700210928           INITIALIZE pi_SegMatValAccountNo
166800210928                      pi_SegMatValContractNo
166900210928                      pc_SegMatValMode
167000210928                      pc_SegMatValInvCode
167100210928                      pi_SegMatValGMV
167200210928                      pi_SegMatValGDV
167300210928                      pi_GMPercent
167400210928                      pi_GDPercent
167500210928                      pi_CurrMarketValue
167600210928                      pi_TradeDate
167700210928                      pc_SegMatValReturn
167800210928
167900210928           MOVE COMM-ACCOUNT-NO  TO pi_SegMatValAccountNo
168000210928           MOVE COMM-CONTRACT-NO TO pi_SegMatValContractNo
168100210928           SET pb_GuarMatBene    TO TRUE
168200210928
168300210928           CALL "FXSEGMATVA"  USING pi_SegMatValAccountNo
168400210928                                    pi_SegMatValContractNo
168500210928                                    pc_SegMatValMode
168600210928                                    pc_SegMatValInvCode
168700210928                                    pi_SegMatValGMV
168800210928                                    pi_SegMatValGDV
168900210928                                    pi_GMPercent
169000210928                                    pi_GDPercent
169100210928                                    pi_CurrMarketValue
169200210928                                    pi_TradeDate
169300210928                                    pc_SegMatValReturn
169400210928
169500210928           IF pb_SegMatValReturnOK
169600210928            COMPUTE WS-OLD-GUAR-BASE-VALUE ROUNDED =
169700210928                    WS-OLD-GUAR-BASE-VALUE * (pi_GMPercent / 100)
169800210928
169900210928            COMPUTE WS-OLD-GUAR-BASE-VALUE-CUR ROUNDED =
170000210928                    WS-OLD-GUAR-BASE-VALUE-CUR * (pi_GMPercent / 100)
170100210928
170200210928            INITIALIZE lc-ACCOUNT-NO
170300210928                       lc-CONTRACT-NO
170400210928                       lc-RESET-NUMBER
170500210928                       lc-ORIGINAL-VALUE
170600210928
170700210928            MOVE COMM-ACCOUNT-NO   TO lc-ACCOUNT-NO
170800210928            MOVE COMM-CONTRACT-NO  TO lc-CONTRACT-NO
170900210928            MOVE COMM-RESET-NUMBER TO lc-RESET-NUMBER
171000210928            MOVE pi_GMPercent      TO lc-ORIGINAL-VALUE
171100210928
171200210928            EXEC SQL
171300210928              INSERT INTO MFAACCCERP
171400210928                         (ACCOUNT_NO
171500210928                         ,CONTRACT_NO
171600210928                         ,RESET_NUMBER
171700210928                         ,INVESTMENT_CODE
171800210928                         ,ELEMENT_CODE
171900210928                         ,ORIGINAL_VALUE
172000210928                         ,RESULTING_VALUE
172100210928                         )
172200210928                   VALUES(:lc-ACCOUNT-NO
172300210928                         ,:lc-CONTRACT-NO
172400210928                         ,:lc-RESET-NUMBER
172500210928                         ,:lc-INVESTMENT-CODE
172600210928                         ,:lc-ELEMENT-CODE
172700210928                         ,:lc-ORIGINAL-VALUE
172800210928                         ,:lc-RESULTING-VALUE
172900210928                         )
173000210928            END-EXEC
173100210928
173200210928            EVALUATE TRUE
173300210928                WHEN SQLCODE = 0
173400210928                     CONTINUE
173500210928                WHEN OTHER
173600210928                     MOVE "GMVResetProcess: INSERT INTO MFAACCCERP"
173700210928                                    TO WS-SQL-ERR-SHORT-DESCR
173800210928                     SET WS-ERR-14  TO TRUE
173900210928                     PERFORM DSP-ERROR
174000210928            END-EVALUATE
174100210928           END-IF
174200210928           .
174300210928
174400210928           GMVResetProcess-EXIT. EXIT.
174500210928      *RFS186918 ENDS
174600210928
174700210928      /
174800210928       GET-ACC-CON-INV-GBV.
174900210928      *    DISPLAY "GET-ACC-CON-INV-GBV..........".
175000210928
175100210928      *    DISPLAY "GET-ACC-CON-INV-GBV.................".
175200210928      *    IF WS-CURR-UNIT-BAL = 0
175300210928      *       MOVE 0 TO WS-OLD-GUAR-BASE-VALUE
175400210928      *                 WS-OLD-GUAR-BASE-VALUE-CUR
175500210928      *                 WS-OLD-NET-DEP-VALUE
175600210928      *                 WS-OLD-NET-DEP-VALUE-CUR
175700210928      *       GO TO GACIG-EXIT
175800210928      *    END-IF.
175900210928      *
176000210928      *    PERFORM VCA-GET-NEXT-BUSINESS-DATE.
176100210928      *    INITIALIZE MFATRNP OF TRANS-GBV-REC.
176200210928      *    MOVE CURR-ACCOUNT-NO TO ACCOUNT-NO OF TRANS-GBV.
176300210928      *    MOVE CURR-INVESTMENT-CODE TO INVESTMENT-CODE OF TRANS-GBV.
176400210928      *    MOVE WS-NEXT-PROCESS-DATE TO PROCESS-DATE OF TRANS-GBV.
176500210928      *    MOVE ZEROES TO TRANS-PROC-SEQ-NO OF TRANS-GBV.
176600210928      *
176700210928      *    START TRANS-GBV
176800210928      *          KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
176900210928      *          INVALID KEY
177000210928      *          GO TO GACIG-EXIT.
177100210928      *
177200210928      *GACIG-0010.
177300210928      *    READ TRANS-GBV NEXT RECORD
177400210928      *         AT END
177500210928      *         GO TO GACIG-EXIT.
177600210928      *
177700210928      *    IF ACCOUNT-NO OF TRANS-GBV NOT = CURR-ACCOUNT-NO
177800210928      *       GO TO GACIG-EXIT.
177900210928      *
178000210928      *    IF INVESTMENT-CODE OF TRANS-GBV NOT = CURR-INVESTMENT-CODE
178100210928      *       GO TO GACIG-EXIT.
178200210928      *
178300210928      *    IF PROCESS-DATE OF TRANS-GBV > CURR-EFFECT-DATE
178400210928      *       GO TO GACIG-EXIT.
178500210928      *
178600210928      *    MOVE TRANS-TYPE-CODE OF TRANS-GBV TO TRANS-CATEGORY.
178700210928      *    MOVE TRANS-STATUS-CODE OF TRANS-GBV TO TRANS-STATUS-CATEGORY.
178800210928      *    MOVE REVERSE OF TRANS-GBV TO TRANS-REVERSE-CATEGORY.
178900210928      *
179000210928      *    IF TRANS-REVERSED OR NOT HISTORY OR
179100210928      *       NOT VALID-TRANSACTION
179200210928      *       GO TO GACIG-0010
179300210928      *    END-IF.
179400210928      *
179500210928      *    INITIALIZE MFATRCODP OF TRANS-CONT-DTL-GBV-REC.
179600210928      *    MOVE PLACEMENT-DATE OF TRANS-GBV
179700210928      *      TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-GBV.
179800210928      *    MOVE TRANS-NO OF TRANS-GBV
179900210928      *      TO TRANS-NO OF TRANS-CONTRACT-DTL-GBV.
180000210928      *    MOVE CURR-CONTRACT-NO
180100210928      *      TO CONTRACT-NO OF TRANS-CONTRACT-DTL-GBV.
180200210928      *
180300210928      *    READ TRANS-CONTRACT-DTL-GBV
180400210928      *         INVALID KEY
180500210928      *         GO TO GACIG-0010.
180600210928      *
180700210928      *    IF REVERSED-DDS OF TRANS-CONTRACT-DTL-GBV = "Y"
180800210928      *       GO TO GACIG-0010.
180900210928      *
181000210928      *    MOVE GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-GBV
181100210928      *      TO WS-OLD-GUAR-BASE-VALUE.
181200210928      *    MOVE GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DTL-GBV
181300210928      *      TO WS-OLD-GUAR-BASE-VALUE-CUR.
181400210928      *    MOVE NET-DEPOSIT-VALUE OF TRANS-CONTRACT-DTL-GBV
181500210928      *      TO WS-OLD-NET-DEP-VALUE.
181600210928      *    MOVE NET-DEPOSIT-VALUE-CUR OF TRANS-CONTRACT-DTL-GBV
181700210928      *      TO WS-OLD-NET-DEP-VALUE-CUR.
181800210928      *
181900210928           PERFORM LOAD-ACC-CON-INV-ARRAY THRU LACIA-EXIT.
182000210928           PERFORM RECALC-TRADES-IN-REVERSE THRU RTIR-EXIT.
182100210928           IF WS-REJECTION-CODE NOT = " " AND "00"
182200210928              GO TO GACIG-EXIT
182300210928           END-IF.
182400210928
182500210928       GACIG-EXIT.
182600210928           EXIT.
182700210928      /
182800210928       LOAD-ACC-CON-INV-ARRAY.
182900210928
183000210928
183100210928      *    DISPLAY "LOAD-ACC-CON-INV-ARRAY.....................".
183200210928           INITIALIZE MFAACCCIP OF ACC-CON-INVEST-REC.
183300210928           MOVE COMM-ACCOUNT-NO TO ACCOUNT-NO OF ACC-CON-INVESTMENT.
183400210928           MOVE COMM-CONTRACT-NO TO CONTRACT-NO OF ACC-CON-INVESTMENT.
183500210928           MOVE SPACES TO INVESTMENT-CODE OF ACC-CON-INVESTMENT.
183600210928
183700210928           START ACC-CON-INVESTMENT
183800210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
183900210928                 INVALID KEY
184000210928                 GO TO LACIA-EXIT.
184100210928
184200210928           SET CONTIDX TO 1.
184300210928           SET CONTIDX DOWN BY 1.
184301211007111744        INITIALIZE ln_InvArraySize
184302211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
184303211007           INITIALIZE WS-ACC-CON-INV-ARRAYX WS-CONT-INV-COUNT.
184304211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
184305211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
184306211007111744     INITIALIZE WS-ARRAY-ACCOUNT-NO(IVS-CNT1)
184307211007111744                WS-ARRAY-CONTRACT-NO(IVS-CNT1)
184308211007111744                WS-ARRAY-INVESTMENT-CODE(IVS-CNT1)
184309211007111744                WS-ARRAY-CUR-UNITBAL(IVS-CNT1)
184310211007111744                WS-ARRAY-GBV(IVS-CNT1)
184311211007111744                WS-ARRAY-GBV-CUR(IVS-CNT1)
184312211007111744                WS-ARRAY-OPEN-UNITBAL(IVS-CNT1)
184313211007111744                WS-ARRAY-INV-MV-BEF(IVS-CNT1)
184314211007111744                WS-ARRAY-INV-MV-AFT(IVS-CNT1)
184315211007111744                WS-ARRAY-INV-CUR-CODE(IVS-CNT1)
184316211007111744                WS-ARRAY-EXCH-RATE(IVS-CNT1)
184317211007111744     END-PERFORM.
184400210928
184600210928
184700210928       LACIA-0010.
184800210928      *    DISPLAY "LACIA-0010..........".
184900210928           SET CONTIDX UP BY 1.
185000210928      * RFS49699 - Array logging logic
185100210928
185200210928           IF CONTIDX > WS-ARRAY1-MAX-USED
185300210928               MOVE CONTIDX                TO WS-ARRAY1-MAX-USED
185400210928           END-IF.
185500210928
185600210928      * RFS49699 - End
185700210928
185800210928           READ ACC-CON-INVESTMENT NEXT RECORD
185900210928                AT END
186000210928                GO TO LACIA-EXIT.
186100210928
186200210928      *    DISPLAY "ACCOUNT-NO OF ACC-CON-INV..."
186300210928      *             ACCOUNT-NO OF ACC-CON-INVESTMENT.
186400210928      *    DISPLAY "COMM-ACCOUNT-NO..." COMM-ACCOUNT-NO.
186500210928      *    DISPLAY "CONTRACT-NO OF ACC-CON-INV..."
186600210928      *             CONTRACT-NO OF ACC-CON-INVESTMENT.
186700210928      *    DISPLAY "COMM-CONTRACT-NO..." COMM-CONTRACT-NO.
186800210928           IF ACCOUNT-NO OF ACC-CON-INVESTMENT NOT = COMM-ACCOUNT-NO OR
186900210928              CONTRACT-NO OF ACC-CON-INVESTMENT NOT = COMM-CONTRACT-NO
187000210928              GO TO LACIA-EXIT
187100210928           END-IF.
187101211007      *    RFS1117445 Start
187102211007           IF CONTIDX >  ln_InvArraySize
187103211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
187104211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(CONTIDX)
187105211007                      WS-ARRAY-CONTRACT-NO(CONTIDX)
187106211007                      WS-ARRAY-INVESTMENT-CODE(CONTIDX)
187107211007                      WS-ARRAY-CUR-UNITBAL(CONTIDX)
187108211007                      WS-ARRAY-GBV(CONTIDX)
187109211007                      WS-ARRAY-GBV-CUR(CONTIDX)
187110211007                      WS-ARRAY-OPEN-UNITBAL(CONTIDX)
187111211007           END-IF
187112211007      *    RFS1117445 End
187200210928
187300210928           MOVE ACCOUNT-NO OF ACC-CON-INVESTMENT
187400210928             TO WS-ARRAY-ACCOUNT-NO(CONTIDX).
187500210928           MOVE CONTRACT-NO OF ACC-CON-INVESTMENT
187600210928             TO WS-ARRAY-CONTRACT-NO(CONTIDX).
187700210928           MOVE INVESTMENT-CODE OF ACC-CON-INVESTMENT
187800210928             TO WS-ARRAY-INVESTMENT-CODE(CONTIDX).
187900210928           MOVE CURR-UNIT-BAL OF ACC-CON-INVESTMENT
188000210928             TO WS-ARRAY-CUR-UNITBAL(CONTIDX).
188100210928           MOVE GUAR-BASE-VALUE OF ACC-CON-INVESTMENT
188200210928             TO WS-ARRAY-GBV(CONTIDX).
188300210928           MOVE GUAR-BASE-VALUE-CUR OF ACC-CON-INVESTMENT
188400210928             TO WS-ARRAY-GBV-CUR(CONTIDX).
188500210928           MOVE OPENING-UNIT-BALANCE OF ACC-CON-INVESTMENT
188600210928             TO WS-ARRAY-OPEN-UNITBAL(CONTIDX).
188700210928
188800210928           ADD 1 TO WS-CONT-INV-COUNT.
188900210928
189000210928           GO TO LACIA-0010.
189100210928
189200210928       LACIA-EXIT.
189300210928           EXIT.
189400210928      /
189500210928       RECALC-TRADES-IN-REVERSE.
189600210928      *    DISPLAY "RECALC-TRADES-IN-REVERSE................".
189700210928
189800210928           EXEC SQL
189900210928                WHENEVER SQLERROR GOTO RTIR-EXIT
190000210928           END-EXEC.
190100210928
190200210928           EXEC SQL
190300210928                WHENEVER NOT FOUND GOTO RTIR-EXIT
190400210928           END-EXEC.
190500210928
190600210928      *RFS91599 Replaced 'Implicit Join' by 'Inner Join'
190700210928           EXEC SQL
190800210928           DECLARE SEGEXTSQ CURSOR FOR SELECT A.PROCESS_DATE,
190900210928           A.PROC_SEQ_NO, A.PLACEMENT_DATE, A.TRANS_NO
19100021092891599      FROM MFATRDPSP A
191100210928  |        INNER JOIN MFATRNP B ON
191200210928  |          A.PLACEMENT_DATE = B.PLACEMENT_DATE AND
191300210928 91599       A.TRANS_NO = B.TRANS_NO
191400210928 63488*    WHERE A.PROCESS_DATE > :CURR-EFFECT-DATE
191500210928 63488     WHERE B.TRADE_DATE   > :CURR-EFFECT-DATE
19160021092891599      AND A.PROCESS_DATE <= :COMM-PROCESS-DATE
191700210928           AND B.REVERSE <> "Y" AND B.ACCOUNT_NO = :CURR-ACCOUNT-NO
191800210928           ORDER BY A.PROCESS_DATE DESC, A.PROC_SEQ_NO DESC
191900210928           END-EXEC.
192000210928
192100210928           EXEC SQL
192200210928                OPEN SEGEXTSQ
192300210928           END-EXEC.
192400210928
192500210928           MOVE "Y" TO WS-SQL-FILE-OPEN.
192600210928       RTIR-0010.
192700210928      *    DISPLAY "RTIR-0010.................".
192800210928
192900210928           EXEC SQL
193000210928                WHENEVER NOT FOUND GOTO RTIR-EXIT
193100210928           END-EXEC.
193200210928
193300210928           EXEC SQL
193400210928           FETCH NEXT FROM SEGEXTSQ INTO :WS-SQL-PROCESS-DATE,
193500210928           :WS-SQL-PROC-SEQ-NO, :WS-SQL-PLACEMENT-DATE, :WS-SQL-TRANS-NO
193600210928           END-EXEC.
193700210928
193800210928           EXEC SQL
193900210928                WHENEVER SQLERROR GOTO RTIR-EXIT
194000210928           END-EXEC.
194100210928
194200210928      *    DISPLAY "WS-SQL-PLACEMENT-DATE..." WS-SQL-PLACEMENT-DATE.
194300210928      *    DISPLAY "WS-SQL-TRANS-NO....." WS-SQL-TRANS-NO.
194400210928           INITIALIZE MFATRNP OF TRANS-GBV-REC.
194500210928           MOVE WS-SQL-PLACEMENT-DATE TO PLACEMENT-DATE OF TRANS-GBV.
194600210928           MOVE WS-SQL-TRANS-NO TO TRANS-NO OF TRANS-GBV.
194700210928           READ TRANS-GBV
194800210928                INVALID KEY
194900210928                GO TO RTIR-0010.
195000210928
195100210928      *    DISPLAY "TRANS-TYPE-CODE..." TRANS-TYPE-CODE OF TRANS-GBV.
195200210928           IF ACCOUNT-NO OF TRANS-GBV NOT = COMM-ACCOUNT-NO
195300210928              GO TO RTIR-EXIT
195400210928           END-IF.
195500210928
195600210928           IF PROCESS-DATE OF TRANS-GBV > COMM-PROCESS-DATE
195700210928              GO TO RTIR-EXIT
195800210928           END-IF.
195900210928
196000210928           IF PROCESS-DATE OF TRANS-GBV < CURR-EFFECT-DATE
196100210928              GO TO RTIR-EXIT
196200210928           END-IF.
196300210928
196400210928      *    IF PROCESS-DATE OF TRANS-GBV = CURR-EFFECT-DATE
196500210928      *       MOVE "Y" TO WS-LAST-TRADE-PROCESSED
196600210928      *    END-IF.
196700210928
196800210928           MOVE TRANS-TYPE-CODE OF TRANS-GBV TO TRANS-CATEGORY.
196900210928           MOVE TRANS-STATUS-CODE OF TRANS-GBV TO TRANS-STATUS-CATEGORY.
197000210928           MOVE REVERSE OF TRANS-GBV TO TRANS-REVERSE-CATEGORY.
197100210928
197200210928           IF TRANS-REVERSED OR NOT HISTORY OR NOT VALID-TRANSACTION
197300210928              GO TO RTIR-0010
197400210928           END-IF.
197500210928
197600210928      * This routine will determine if txn is excluded or not
197700210928      * for GBV recalculation.
197800210928           MOVE "N" TO WS-EXCLUDE-TRANS.
197900210928           INITIALIZE WS-EXCLUDE-VARIABLES.
198000210928           MOVE ACCOUNT-NO OF TRANS-GBV TO WS-EX-ACCOUNT-NO.
198100210928           MOVE TRANS-ORIGIN-CODE OF TRANS-GBV TO WS-EX-TRANS-ORIGIN.
198200210928           MOVE TRANS-TYPE-CODE OF TRANS-GBV TO WS-EX-TRANS-TYPE.
198300210928           MOVE REVERSAL-CODE OF TRANS-GBV TO WS-EX-REVERSAL-CODE.
198400210928180708     INITIALIZE WS-TRANSNO WS-PLACEMENTDATE.
198500210928180708     MOVE TRANS-NO OF TRANS-GBV       TO WS-TRANSNO.
198600210928180708     MOVE PLACEMENT-DATE OF TRANS-GBV TO WS-PLACEMENTDATE.
198700210928           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
19880021092826151**    IF WS-EXCLUDE-TRANS = "Y"
19890021092826151      IF WS-EXCLUDE-TRANS NOT = "Y" AND
19900021092826151         MAN-FEE-REB-TRANSACTION
199100210928              GO TO RTIR-0010
199200210928           END-IF.
199300210928
199400210928      *    DISPLAY "PLACEMENT-DATE OF TRANS-GBV..."
199500210928      *             PLACEMENT-DATE OF TRANS-GBV.
199600210928      *    DISPLAY "TRANS-NO OF TRANS-GBV........."
199700210928      *             TRANS-NO OF TRANS-GBV.
199800210928      *    DISPLAY "ACCOUNT-NO OF TRANS-GBV......."
199900210928      *             ACCOUNT-NO OF TRANS-GBV.
200000210928      *    DISPLAY "TRANS-TYPE-CODE OF TRANS-GBV.."
200100210928      *             TRANS-TYPE-CODE OF TRANS-GBV.
200200210928           INITIALIZE MFATRCODP OF TRANS-CON-DTL-REC.
200300210928           MOVE PLACEMENT-DATE OF TRANS-GBV
200400210928             TO PLACEMENT-DATE OF TRANS-CON-DTL.
200500210928           MOVE TRANS-NO OF TRANS-GBV
200600210928             TO TRANS-NO OF TRANS-CON-DTL.
200700210928           MOVE COMM-CONTRACT-NO TO CONTRACT-NO OF TRANS-CON-DTL.
200800210928
200900210928           READ TRANS-CON-DTL
201000210928                INVALID KEY
201100210928                GO TO RTIR-0010.
201200210928
201300210928           IF REVERSED-DDS OF TRANS-CON-DTL = "Y"
201400210928              GO TO RTIR-0010
201500210928           END-IF.
201600210928
201700210928R13394* Get the GBV from Trans-GBV-Transfer if it exists
201800210928           MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
201900210928           INITIALIZE MFATRACXP OF TRANS-GBV-TRANSFER-REC.
202000210928           IF BUY-TRANSACTION
202100210928R49898        OR SWITCH-IN-TRANSACTION
202200210928              MOVE PLACEMENT-DATE OF TRANS-GBV
202300210928                TO PLACEMENT-DATE OF TRANS-GBV-TRANSFER
202400210928              MOVE TRANS-NO OF TRANS-GBV
202500210928                TO TRANS-NO OF TRANS-GBV-TRANSFER
202600210928
202700210928              READ TRANS-GBV-TRANSFER
202800210928                   INVALID KEY
202900210928                   GO TO RTIR-0020
203000210928              END-READ
203100210928
203200210928              MOVE "Y" TO WS-XFER-AMT-EXISTS-FLAG
203300210928R13394     END-IF.
203400210928
203500210928       RTIR-0020.
203600210928      *    DISPLAY "TRANS-CON-DTL RECORD FOUND!!!!!!!!!!!!".
203700210928      *    MOVE "N" TO WS-TRANSFER-GBV.
203800210928      *    PERFORM GET-SEG-TRANSFER-PARAMETERS THRU GSTP-EXIT.
203900210928           MOVE INVESTMENT-CODE OF TRANS-GBV
204000210928             TO WS-TRANS-INVESTMENT-CODE WS-INVESTMENT-CODE.
204100210928           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
204200210928           IF FRONT-END AND BUY-TRANSACTION
204300210928              MOVE NET-AMT OF TRANS-GBV TO WS-TRANS-TRADE-AMT
204400210928           ELSE
204500210928              MOVE GROSS-AMT OF TRANS-GBV TO WS-TRANS-TRADE-AMT
204600210928           END-IF.
204700210928
204800210928           IF SWITCH-IN-TRANSACTION
204900210928              MOVE GBV-CHANGE OF TRANS-CON-DTL TO WS-TRANS-TRADE-AMT
205000210928           END-IF.
205100210928
205200210928R13394     IF BUY-TRANSACTION AND TRANSFER-AMT-EXISTS
205300210928              MOVE GUAR-BASE-VALUE OF TRANS-GBV-TRANSFER
205400210928                TO WS-TRANS-TRADE-AMT
205500210928R13394     END-IF.
205600210928
205700210928      *    IF BUY-TRANSACTION OR TRANSFER-IN
205800210928           IF PURCHASE-TRANSACTION
20590021092826151         OR MAN-FEE-REB-TRANSACTION
206000210928              PERFORM SEARCH-ACC-CON-INV-ARRAY THRU SACIA-EXIT
206100210928              IF WS-REJECTION-CODE NOT = " " AND "00"
206200210928                 GO TO RTIR-EXIT
206300210928              END-IF
206400210928              GO TO RTIR-0010
206500210928           END-IF.
206600210928
206700210928           PERFORM GET-CON-INV-MARKET-VALUE THRU GCIMV-EXIT.
206800210928           IF WS-REJECTION-CODE NOT = " " AND "00"
206900210928              GO TO RTIR-EXIT
207000210928           END-IF.
207100210928
20720021092826151      IF WS-EXCLUDE-TRANS = "Y"
20730021092826151         GO TO RTIR-0010
20740021092826151      END-IF.
207500210928
207600210928           MOVE GBV-CHANGE OF TRANS-CON-DTL TO WS-GBV-CHANGE.
207700210928           PERFORM CALC-NEW-GBV-CHANGE THRU CNGC-EXIT.
207800210928           PERFORM RECALC-CONTRACT-INV-GBV THRU RCIG-EXIT.
207900210928R12702     PERFORM CHECK-NDV-GBV-ROUNDING THRU CNGR-EXIT.
208000210928
208100210928           GO TO RTIR-0010.
208200210928
208300210928       RTIR-EXIT.
208400210928           EXIT.
208500210928      /
208600210928       SEARCH-ACC-CON-INV-ARRAY.
208700210928      *    DISPLAY "SEARCH-ACC-CON-INV-ARRAY...............".
208800210928           SET CONTIDX TO 1.
208900210928           SEARCH WS-ACC-CON-INV-ARRAY VARYING CONTIDX
209000210928           WHEN WS-ARRAY-ACCOUNT-NO(CONTIDX) = COMM-ACCOUNT-NO AND
209100210928                WS-ARRAY-INVESTMENT-CODE(CONTIDX) =
209200210928                WS-TRANS-INVESTMENT-CODE
209300210928                GO TO SACIA-0010
209400210928           WHEN WS-ARRAY-ACCOUNT-NO(CONTIDX) = 0 OR
209500210928                WS-ARRAY-INVESTMENT-CODE(CONTIDX) = " "
209600210928                GO TO SACIA-EXIT
209700210928           END-SEARCH.
209800210928
209900210928       SACIA-0010.
210000210928      *    DISPLAY "SACIA-0010.................".
210100210928      *    DISPLAY "RECORD IN SEARCH ROUTINE FOUND!!!!!!!!!!!!".
210200210928      *    DISPLAY "WS-ARRAY-CUR-UNITBAL..1.."
210300210928      *             WS-ARRAY-CUR-UNITBAL(CONTIDX).
210400210928      *    DISPLAY "ORIG-UNIT-BAL OF TRANS-CON-DTL...."
210500210928      *             ORIG-UNIT-BAL OF TRANS-CON-DTL.
210600210928           SUBTRACT ORIG-UNIT-BAL OF TRANS-CON-DTL
210700210928               FROM WS-ARRAY-CUR-UNITBAL(CONTIDX).
210800210928           SUBTRACT ORIG-UNIT-BAL OF TRANS-CON-DTL
210900210928               FROM WS-ARRAY-OPEN-UNITBAL(CONTIDX).
211000210928
21110021092826151      IF WS-EXCLUDE-TRANS = "Y"
21120021092826151         GO TO SACIA-EXIT
21130021092826151      END-IF.
211400210928
211500210928      *    DISPLAY "WS-ARRAY-CUR-UNITBAL..2.."
211600210928      *             WS-ARRAY-CUR-UNITBAL(CONTIDX).
211700210928
211800210928      *    DISPLAY "WS-ARRAY-GBV.1..." WS-ARRAY-GBV(CONTIDX).
211900210928      *    DISPLAY "WS-TRANS-TRADE-AMT..." WS-TRANS-TRADE-AMT.
212000210928           IF CURRENCY-DDS OF INVESTMENT-2 NOT = UNITRAX-BASE-CURRENCY
212100210928              MOVE PLACEMENT-DATE OF TRANS-GBV TO WS-EXCH-PLACEMENT-DATE
212200210928              MOVE TRANS-NO OF TRANS-GBV TO WS-EXCH-TRANS-NO
212300210928              MOVE TRADE-DATE OF TRANS-GBV TO WS-EXCH-TRADE-DATE
212400210928              MOVE CURRENCY-DDS OF INVESTMENT-2 TO WS-EXCH-CURRENCY
212500210928              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
212600210928              IF WS-EXCHANGE-FOUND NOT = "Y"
212700210928                 MOVE "06"       TO WS-REJECTION-CODE
212800210928                 MOVE "TRADE DATE:" TO WS-MISC-INFO-1-NAME
212900210928                 MOVE TRADE-DATE OF TRANS-GBV TO WS-MISC-INFO-1-DATE
213000210928                 MOVE "NOT FOUND" TO WS-MISC-INFO-1-NOTE
213100210928                 PERFORM LOG-ERROR THRU LER-EXIT
213200210928                 GO TO SACIA-EXIT
213300210928              ELSE
213400210928                 COMPUTE WS-INV-GBV-CUR ROUNDED =
213500210928                         WS-TRANS-TRADE-AMT / WS-EXCH-RATE-VALUE
213600210928                  MOVE WS-INV-GBV-CUR TO WS-INV-GBV
213700210928              END-IF
213800210928           ELSE
213900210928              MOVE WS-TRANS-TRADE-AMT TO WS-INV-GBV-CUR
214000210928                                         WS-INV-GBV
214100210928           END-IF.
214200210928           SUBTRACT WS-INV-GBV FROM WS-ARRAY-GBV(CONTIDX).
214300210928           IF WS-ARRAY-GBV(CONTIDX) < 0
214400210928              MOVE 0 TO WS-ARRAY-GBV(CONTIDX)
214500210928           END-IF.
214600210928           SUBTRACT WS-INV-GBV-CUR FROM WS-ARRAY-GBV-CUR(CONTIDX).
214700210928           IF WS-ARRAY-GBV-CUR(CONTIDX) < 0
214800210928              MOVE 0 TO WS-ARRAY-GBV-CUR(CONTIDX)
214900210928           END-IF.
215000210928      *    DISPLAY "WS-ARRAY-GBV.2..." WS-ARRAY-GBV(CONTIDX).
215100210928
215200210928       SACIA-EXIT.
215300210928           EXIT.
215400210928      /
215500210928       GET-CON-INV-MARKET-VALUE.
215600210928
215700210928
215800210928      *    DISPLAY "GET-CON-INV-MARKET-VALUE...............".
215900210928           IF WS-REJECTION-CODE NOT = " " AND "00"
216000210928              GO TO GCIMV-EXIT
216100210928           END-IF.
216200210928
216300210928           INITIALIZE WS-CONT-GBV-TOTAL
216400210928                      WS-CONT-MV-BEF-TOTAL WS-CONT-MV-AFT-TOTAL
216500210928           SET CONTIDX TO 1.
216600210928           SET CONTIDX DOWN BY 1.
216700210928
216800210928       GCIMV-NEXT.
216900210928      *    DISPLAY "GCIMV-NEXT................".
217000210928           SET CONTIDX UP BY 1.
217001211007
217002211007111744     IF CONTIDX > WS-CONT-INV-ARRAY-COUNT
217003211007111744        GO TO GCIMV-EXIT
217004211007111744     END-IF
217005211007
217100210928           IF WS-ARRAY-ACCOUNT-NO(CONTIDX) = 0 OR
217200210928              WS-ARRAY-CONTRACT-NO(CONTIDX) = 0 OR
217201211007              WS-ARRAY-INVESTMENT-CODE(CONTIDX) = " " OR
217202211007111744        CONTIDX > WS-CONT-INV-ARRAY-COUNT
217400210928              GO TO GCIMV-EXIT
217500210928           END-IF.
217600210928
217700210928           MOVE WS-ARRAY-INVESTMENT-CODE(CONTIDX) TO WS-INVESTMENT-CODE.
217800210928           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
217900210928
218000210928      *    DISPLAY "WS-ARRAY-INVESTMENT-CODE(CONTIDX)...."
218100210928      *             WS-ARRAY-INVESTMENT-CODE(CONTIDX).
218200210928      *    DISPLAY "WS-TRANS-INVESTMENT-CODE..."
218300210928      *             WS-TRANS-INVESTMENT-CODE.
218400210928           IF WS-ARRAY-INVESTMENT-CODE(CONTIDX) =
218500210928              WS-TRANS-INVESTMENT-CODE
218600210928              MOVE UNIT-PRICE OF TRANS-GBV TO WS-INV-UNIT-PRICE
218700210928              GO TO GCIMV-0010
218800210928           END-IF.
218900210928
219000210928           INITIALIZE MFAINVUPP OF IUP-2-REC.
219100210928           MOVE WS-ARRAY-INVESTMENT-CODE(CONTIDX)
219200210928             TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-2.
219300210928           MOVE TRADE-DATE OF TRANS-GBV
219400210928             TO TRADE-DATE OF INVESTMENT-UNIT-PRICE-2.
219500210928           MOVE SPACES TO DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE-2.
219600210928
219700210928      *    DISPLAY "LOOKING FOR THE UNIT PRICE....".
219800210928           READ INVESTMENT-UNIT-PRICE-2
219900210928                INVALID KEY
220000210928      *         DISPLAY "UNIT-PRICE NOT FOUND 1.........."
220100210928                MOVE "N" TO WS-PRICE-FOUND-2
220200210928                GO TO GCIMV-0001
220300210928
220400210928                NOT INVALID KEY
220500210928      *         DISPLAY "UNIT-PRICE FOUND 1..............."
220600210928                MOVE "Y" TO WS-PRICE-FOUND-2
220700210928                MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE-2
220800210928                  TO WS-INV-UNIT-PRICE
220900210928           END-READ.
221000210928      *    DISPLAY "WS-INV-UNIT-PRICE...." WS-INV-UNIT-PRICE.
221100210928
221200210928       GCIMV-0001.
221300210928      *    DISPLAY "GCIMV-0001..............................".
221400210928           IF WS-PRICE-FOUND-2 NOT = "Y"
221500210928      *       DISPLAY "READING LAST-UNIT-PRICE 2..........."
221600210928              PERFORM GET-LAST-UNIT-PRICE-2 THRU GLUP2-EXIT
221700210928      *       DISPLAY "WS-PRICE-FOUND-2..." WS-PRICE-FOUND-2
221800210928              IF WS-PRICE-FOUND-2 NOT = "Y"
221900210928                 MOVE "05"     TO WS-REJECTION-CODE
222000210928                 MOVE "TRADE DATE:" TO WS-MISC-INFO-1-NAME
222100210928                 MOVE TRADE-DATE OF TRANS-GBV TO WS-MISC-INFO-1-DATE
222200210928                 MOVE "NOT FOUND" TO WS-MISC-INFO-1-NOTE
222300210928                 PERFORM LOG-ERROR THRU LER-EXIT
222400210928                 GO TO GCIMV-EXIT
222500210928              END-IF
222600210928           END-IF.
222700210928
222800210928       GCIMV-0010.
222900210928      *    DISPLAY "GCIMV-0010............".
223000210928           IF CURRENCY-DDS OF INVESTMENT-2 NOT = UNITRAX-BASE-CURRENCY
223100210928              MOVE PLACEMENT-DATE OF TRANS-GBV TO WS-EXCH-PLACEMENT-DATE
223200210928              MOVE TRANS-NO OF TRANS-GBV TO WS-EXCH-TRANS-NO
223300210928              MOVE TRADE-DATE OF TRANS-GBV TO WS-EXCH-TRADE-DATE
223400210928              MOVE CURRENCY-DDS OF INVESTMENT-2 TO WS-EXCH-CURRENCY
223500210928              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
223600210928              IF WS-EXCHANGE-FOUND NOT = "Y"
223700210928                 MOVE "06"       TO WS-REJECTION-CODE
223800210928                 MOVE "TRADE DATE:" TO WS-MISC-INFO-1-NAME
223900210928                 MOVE TRADE-DATE OF TRANS-GBV TO WS-MISC-INFO-1-DATE
224000210928                 MOVE "NOT FOUND" TO WS-MISC-INFO-1-NOTE
224100210928                 PERFORM LOG-ERROR THRU LER-EXIT
224200210928                 GO TO GCIMV-EXIT
224300210928              END-IF
224400210928           ELSE
224500210928              MOVE 1.0 TO WS-EXCH-RATE-VALUE
224600210928           END-IF.
224700210928
224800210928      *    DISPLAY "WS-ARRAY-CUR-UNITBAL..."
224900210928      *             WS-ARRAY-CUR-UNITBAL(CONTIDX).
225000210928      *    DISPLAY "WS-INV-UNIT-PRICE...." WS-INV-UNIT-PRICE.
225100210928           IF CURRENCY-DDS OF INVESTMENT-2 = UNITRAX-BASE-CURRENCY
225200210928              COMPUTE WS-ARRAY-INV-MV-BEF(CONTIDX) ROUNDED =
225300210928                   WS-ARRAY-CUR-UNITBAL(CONTIDX) * WS-INV-UNIT-PRICE
225400210928           ELSE
225500210928              COMPUTE WS-ARRAY-INV-MV-BEF(CONTIDX) ROUNDED =
225600210928                   WS-ARRAY-CUR-UNITBAL(CONTIDX) *
225700210928                   WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
225800210928           END-IF.
225900210928      *    DISPLAY "WS-ARRAY-INV-MV-BEF.." WS-ARRAY-INV-MV-BEF(CONTIDX).
226000210928
226100210928           IF WS-ARRAY-INVESTMENT-CODE(CONTIDX) =
226200210928              WS-TRANS-INVESTMENT-CODE
226300210928              IF REDEMPTION-TRANSACTION
226400210928                 ADD ORIG-UNIT-BAL OF TRANS-CON-DTL
226500210928                  TO WS-ARRAY-CUR-UNITBAL(CONTIDX)
226600210928              ELSE
226700210928                 SUBTRACT ORIG-UNIT-BAL OF TRANS-CON-DTL
226800210928                     FROM WS-ARRAY-CUR-UNITBAL(CONTIDX)
226900210928                 IF WS-ARRAY-CUR-UNITBAL(CONTIDX) IS NEGATIVE
227000210928                    MOVE 0 TO WS-ARRAY-CUR-UNITBAL(CONTIDX)
227100210928                 END-IF
227200210928              END-IF
227300210928
227400210928              IF CURRENCY-DDS OF INVESTMENT-2 = UNITRAX-BASE-CURRENCY
227500210928                 MOVE WS-TRANS-TRADE-AMT TO WS-TRANS-TRADE-AMT-BASE
227600210928              ELSE
227700210928                 COMPUTE WS-TRANS-TRADE-AMT-BASE ROUNDED =
227800210928                         WS-TRANS-TRADE-AMT / WS-EXCH-RATE-VALUE
227900210928              END-IF
228000210928           END-IF.
228100210928
228200210928      *    DISPLAY "WS-ARRAY-CUR-UNITBAL..2.."
228300210928      *             WS-ARRAY-CUR-UNITBAL(CONTIDX).
228400210928           IF CURRENCY-DDS OF INVESTMENT-2 = UNITRAX-BASE-CURRENCY
228500210928              COMPUTE WS-ARRAY-INV-MV-AFT(CONTIDX) ROUNDED =
228600210928                   WS-ARRAY-CUR-UNITBAL(CONTIDX) * WS-INV-UNIT-PRICE
228700210928           ELSE
228800210928              COMPUTE WS-ARRAY-INV-MV-AFT(CONTIDX) ROUNDED =
228900210928                   WS-ARRAY-CUR-UNITBAL(CONTIDX) *
229000210928                   WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
229100210928           END-IF.
229200210928      *    DISPLAY "WS-ARRAY-INV-MV-AFT.." WS-ARRAY-INV-MV-AFT(CONTIDX).
229300210928      *    DISPLAY "WS-ARRAY-GBV........." WS-ARRAY-GBV(CONTIDX).
229400210928
229500210928           ADD WS-ARRAY-INV-MV-BEF(CONTIDX) TO WS-CONT-MV-BEF-TOTAL.
229600210928           ADD WS-ARRAY-INV-MV-AFT(CONTIDX) TO WS-CONT-MV-AFT-TOTAL.
229700210928           ADD WS-ARRAY-GBV(CONTIDX) TO WS-CONT-GBV-TOTAL.
229800210928      *    DISPLAY "WS-CONT-MV-BEF-TOTAL..." WS-CONT-MV-BEF-TOTAL.
229900210928      *    DISPLAY "WS-CONT-MV-AFT-TOTAL..." WS-CONT-MV-AFT-TOTAL.
230000210928      *    DISPLAY "WS-CONT-GBV-TOTAL......" WS-CONT-GBV-TOTAL.
230100210928
230200210928           MOVE CURRENCY-DDS OF INVESTMENT-2
230300210928             TO WS-ARRAY-INV-CUR-CODE(CONTIDX).
230400210928           MOVE WS-EXCH-RATE-VALUE TO WS-ARRAY-EXCH-RATE(CONTIDX).
230500210928
230600210928           GO TO GCIMV-NEXT.
230700210928
230800210928       GCIMV-EXIT.
230900210928           EXIT.
231000210928      /
231100210928       CALC-NEW-GBV-CHANGE.
231200210928
231300210928      *    DISPLAY "CALC-NEW-GBV-CHANGE...........................".
231400210928      *    DISPLAY "WS-TRANS-TRADE-AMT-BASE....."
231500210928      *             WS-TRANS-TRADE-AMT-BASE.
231600210928      *    DISPLAY "WS-CONT-MV-BEF-TOTAL..." WS-CONT-MV-BEF-TOTAL.
231700210928      *    DISPLAY "WS-CONT-GBV-TOTAL..." WS-CONT-GBV-TOTAL.
231800210928      *    IF WS-CONT-MV-BEF-TOTAL NOT = 0
231900210928      *       COMPUTE WS-GBV-CHANGE ROUNDED = WS-CONT-GBV-TOTAL *
232000210928      *               WS-TRANS-TRADE-AMT-BASE / WS-CONT-MV-BEF-TOTAL
232100210928      *    ELSE
232200210928      *       MOVE WS-TRANS-TRADE-AMT-BASE TO WS-GBV-CHANGE
232300210928      *    END-IF.
232400210928      *
232500210928      *    IF WS-TRANSFER-GBV = "N" AND SWITCH-IN
232600210928      *       MOVE WS-TRANS-TRADE-AMT-BASE TO WS-GBV-CHANGE
232700210928      *    END-IF.
232800210928
232900210928      *    DISPLAY "WS-GBV-CHANGE..." WS-GBV-CHANGE.
233000210928           IF REDEMPTION-TRANSACTION
233100210928              ADD WS-GBV-CHANGE TO WS-CONT-GBV-TOTAL
233200210928                  GIVING WS-NEW-CONTRACT-GBV
233300210928           ELSE
233400210928              SUBTRACT WS-GBV-CHANGE FROM WS-CONT-GBV-TOTAL
233500210928                  GIVING WS-NEW-CONTRACT-GBV
233600210928           END-IF.
233700210928      *    DISPLAY "WS-NEW-CONTRACT-GBV...." WS-NEW-CONTRACT-GBV.
233800210928
233900210928       CNGC-EXIT.
234000210928           EXIT.
234100210928      /
234200210928       RECALC-CONTRACT-INV-GBV.
234300210928      *    DISPLAY "RECALC-CONTRACT-INV-GBV..................".
234400210928           SET CONTIDX TO 1.
234500210928           SET CONTIDX DOWN BY 1.
234600210928
234700210928           INITIALIZE WS-CONT-INV-ARRAY-COUNT
234800210928                      WS-INV-GBV-PERCENT-TOTAL
234900210928R12702                WS-CONT-NDV-AFT-TOTAL
235000210928R12702                WS-CONT-GBV-AFT-TOTAL.
235100210928
235200210928       RCIG-NEXT.
235300210928      *    DISPLAY "RCIG-NEXT.................".
235400210928           SET CONTIDX UP BY 1.
235401211007
235402211007111744     IF CONTIDX > WS-CONT-INV-ARRAY-COUNT
235403211007111744        GO TO RCIG-EXIT
235404211007111744     END-IF
235405211007
235500210928           IF WS-ARRAY-ACCOUNT-NO(CONTIDX) = 0 OR
235600210928              WS-ARRAY-CONTRACT-NO(CONTIDX) = 0 OR
235601211007              WS-ARRAY-INVESTMENT-CODE(CONTIDX) = " " OR
235602211007111744        CONTIDX > WS-CONT-INV-ARRAY-COUNT
235800210928              GO TO RCIG-EXIT
235900210928           END-IF.
236000210928
236100210928           ADD 1 TO WS-CONT-INV-ARRAY-COUNT.
236200210928
236300210928R11698     IF SWITCH-IN
236400210928R11698        IF WS-ARRAY-INVESTMENT-CODE(CONTIDX) =
236500210928R11698           WS-TRANS-INVESTMENT-CODE
236600210928R11698           SUBTRACT WS-GBV-CHANGE FROM WS-ARRAY-GBV(CONTIDX)
236700210928R11698             GIVING WS-INV-GBV-AFT
236800210928R11698           GO TO RCIG-0010
236900210928R11698        ELSE
237000210928R11698           GO TO RCIG-NEXT
237100210928R11698        END-IF
237200210928R11698     END-IF.
237300210928
237400210928      *    DISPLAY "WS-ARRAY-INV-MV-AFT(CONTIDX)...."
237500210928      *             WS-ARRAY-INV-MV-AFT(CONTIDX).
237600210928      *    DISPLAY "WS-CONT-MV-AFT-TOTAL..." WS-CONT-MV-AFT-TOTAL.
237700210928R12387     IF WS-CONT-MV-AFT-TOTAL NOT = 0
237800210928           COMPUTE WS-INV-GBV-PERCENT ROUNDED =
237900210928                   WS-ARRAY-INV-MV-AFT(CONTIDX) / WS-CONT-MV-AFT-TOTAL
238000210928R12387     ELSE
238100210928R12387        MOVE 0 TO WS-INV-GBV-PERCENT
238200210928R12387     END-IF.
238300210928
238400210928      *    DISPLAY "WS-INV-GBV-PERCENT...." WS-INV-GBV-PERCENT.
238500210928           ADD WS-INV-GBV-PERCENT TO WS-INV-GBV-PERCENT-TOTAL.
238600210928      *    DISPLAY "WS-INV-GBV-PERCENT-TOTAL...."
238700210928      *             WS-INV-GBV-PERCENT-TOTAL.
238800210928      *    DISPLAY "WS-CONT-INV-COUNT..." WS-CONT-INV-COUNT.
238900210928      *    DISPLAY "WS-CONT-INV-ARRAY-COUNT..." WS-CONT-INV-ARRAY-COUNT.
239000210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
239100210928              WS-INV-GBV-PERCENT-TOTAL NOT = 1.000 AND 0
239200210928              SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
239300210928                       GIVING WS-DUMMY-PERCENT
239400210928      *       DISPLAY "WS-DUMMY-PERCENT...." WS-DUMMY-PERCENT
239500210928              ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
239600210928R12454        ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
239700210928      *       DISPLAY "WS-INV-GBV-PERCENT..." WS-INV-GBV-PERCENT
239800210928XXXXX2     ELSE
239900210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
240000210928                (WS-INV-GBV-PERCENT-TOTAL = 0.999 OR
240100210928                 WS-INV-GBV-PERCENT-TOTAL > 1.000)
240200210928                 SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
240300210928                          GIVING WS-DUMMY-PERCENT
240400210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
240500210928R12454           ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
240600210928XXXXX2        END-IF
240700210928           END-IF.
240800210928
240900210928      *    DISPLAY "WS-NEW-CONTRACT-GBV..." WS-NEW-CONTRACT-GBV.
241000210928      *    DISPLAY "WS-INV-GBV-PERCENT...." WS-INV-GBV-PERCENT.
241100210928      *
241200210928           COMPUTE WS-INV-GBV-AFT ROUNDED =
241300210928                   WS-NEW-CONTRACT-GBV * WS-INV-GBV-PERCENT.
241400210928      *    DISPLAY "WS-INV-GBV-AFT...." WS-INV-GBV-AFT.
241500210928
241600210928       RCIG-0010.
241700210928
241800210928           IF WS-ARRAY-INV-CUR-CODE(CONTIDX) = UNITRAX-BASE-CURRENCY
241900210928              MOVE WS-INV-GBV-AFT TO WS-INV-GBV-AFT-CUR
242000210928           ELSE
242100210928              COMPUTE WS-INV-GBV-AFT-CUR ROUNDED =
242200210928                      WS-INV-GBV-AFT * WS-ARRAY-EXCH-RATE(CONTIDX)
242300210928           END-IF.
242400210928
242500210928           IF WS-INV-GBV-AFT IS NEGATIVE OR
242600210928              WS-ARRAY-CUR-UNITBAL(CONTIDX) = 0
242700210928              MOVE ZEROES TO WS-INV-GBV-AFT
242800210928                             WS-INV-GBV-AFT-CUR
242900210928           END-IF.
243000210928
243100210928R12702     IF REDEMPTION-TRANSACTION
243200210928R12702        ADD WS-INV-GBV-AFT TO WS-CONT-GBV-AFT-TOTAL
243300210928R12702*       ADD WS-INV-NDV-AFT TO WS-CONT-NDV-AFT-TOTAL
243400210928R12702     END-IF.
243500210928
243600210928           MOVE WS-INV-GBV-AFT TO WS-ARRAY-GBV(CONTIDX).
243700210928           MOVE WS-INV-GBV-AFT-CUR TO WS-ARRAY-GBV-CUR(CONTIDX).
243800210928      *    DISPLAY "WS-ARRAY-GBV(CONTIDX)..." WS-ARRAY-GBV(CONTIDX).
243900210928
244000210928           GO TO RCIG-NEXT.
244100210928
244200210928       RCIG-EXIT.
244300210928           EXIT.
244400210928      /
244500210928       CHECK-NDV-GBV-ROUNDING.
244600210928           IF PURCHASE-TRANSACTION
244700210928              GO TO CNGR-EXIT
244800210928           END-IF.
244900210928
245000210928           MOVE "N" TO WS-NDV-DIFF-FLAG
245100210928                       WS-GBV-DIFF-FLAG.
245200210928           MOVE 0   TO WS-NDV-DIFF-AMOUNT
245300210928                       WS-GBV-DIFF-AMOUNT.
245400210928           MOVE "Y" TO WS-NDV-UPDATE-FLAG
245500210928                       WS-GBV-UPDATE-FLAG.
245600210928
245700210928           IF WS-NEW-CONTRACT-GBV NOT = WS-CONT-GBV-AFT-TOTAL
245800210928              MOVE "Y" TO WS-GBV-DIFF-FLAG
245900210928              SUBTRACT WS-CONT-GBV-AFT-TOTAL
246000210928                  FROM WS-NEW-CONTRACT-GBV
246100210928                GIVING WS-GBV-DIFF-AMOUNT
246200210928           END-IF.
246300210928
246400210928           IF GBV-DIFFERENCE-FOUND
246500210928              GO TO CNGR-0010
246600210928           END-IF.
246700210928
246800210928           GO TO CNGR-EXIT.
246900210928
247000210928       CNGR-0010.
247100210928
247200210928           SET CONTIDX TO 1.
247300210928
247400210928           SEARCH WS-ACC-CON-INV-ARRAY VARYING CONTIDX
247500210928           WHEN WS-ARRAY-ACCOUNT-NO(CONTIDX) = CURR-ACCOUNT-NO AND
247600210928                WS-ARRAY-CONTRACT-NO(CONTIDX) = CURR-CONTRACT-NO AND
247700210928                WS-ARRAY-CUR-UNITBAL(CONTIDX) NOT = 0
247800210928                GO TO CNGR-0020
247900210928           WHEN WS-ARRAY-ACCOUNT-NO(CONTIDX) = 0 OR
248000210928                WS-ARRAY-CONTRACT-NO(CONTIDX) = 0 OR
248100210928                WS-ARRAY-INVESTMENT-CODE(CONTIDX) = " "
248200210928                GO TO CNGR-EXIT
248300210928           END-SEARCH.
248400210928
248500210928       CNGR-0020.
248600210928           ADD WS-GBV-DIFF-AMOUNT TO WS-ARRAY-GBV(CONTIDX)
248700210928                                     WS-ARRAY-GBV-CUR(CONTIDX).
248800210928
248900210928       CNGR-EXIT.
249000210928           EXIT.
249100210928      /
249200210928       GET-LAST-UNIT-PRICE-2.
249300210928      *    DISPLAY "GET-LAST-UNIT-PRICE-2.........................".
249400210928
249500210928           MOVE "N"          TO WS-PRICE-FOUND.
249600210928
249700210928           MOVE WS-ARRAY-INVESTMENT-CODE(CONTIDX)
249800210928             TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-2.
249900210928           MOVE TRADE-DATE OF TRANS-GBV
250000210928             TO TRADE-DATE OF INVESTMENT-UNIT-PRICE-2.
250100210928           MOVE SPACES TO DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE-2.
250200210928
250300210928           START INVESTMENT-UNIT-PRICE-2
250400210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
250500210928           INVALID KEY
250600210928           GO TO GLUP2-EXIT.
250700210928
250800210928       GLUP2-0010.
250900210928      *    DISPLAY " GLUP2-0010................".
251000210928           READ INVESTMENT-UNIT-PRICE-2 PRIOR RECORD
251100210928           AT END
251200210928           GO TO GLUP2-EXIT.
251300210928
251400210928           IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-2 NOT =
251500210928              WS-ARRAY-INVESTMENT-CODE(CONTIDX)
251600210928              GO TO GLUP2-EXIT
251700210928           END-IF.
251800210928
251900210928           IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE-2 NOT = SPACES
252000210928             GO TO GLUP2-0010
252100210928           END-IF.
252200210928
252300210928           MOVE "Y"          TO WS-PRICE-FOUND-2.
252400210928           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE-2
252500210928             TO WS-INV-UNIT-PRICE.
252600210928      *    DISPLAY "WS-INV-UNIT-PRICE...." WS-INV-UNIT-PRICE.
252700210928
252800210928       GLUP2-EXIT.
252900210928           EXIT.
253000210928      /
253100210928      *CALC-NEW-NET-DEP-VALUE.
253200210928      *
253300210928      *    PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
253400210928      *
253500210928      *    MOVE 0 TO WS-NEW-NET-DEP-VALUE WS-NEW-NET-DEP-VALUE-CUR.
253600210928      *    PERFORM GET-UNIT-BALANCE THRU GUB-EXIT.
253700210928      *    IF WS-ACC-CON-INV-UNIT-BAL > 0
253800210928      *       MOVE WS-ACC-CON-INV-UNIT-BAL TO WS-CURR-UNIT-BAL
253900210928      *    END-IF.
254000210928      *    IF WS-NEW-NET-DEP-VALUE IS NEGATIVE OR
254100210928      *       WS-NEW-NET-DEP-VALUE-CUR IS NEGATIVE
254200210928      *       MOVE 0 TO WS-NEW-NET-DEP-VALUE WS-NEW-NET-DEP-VALUE-CUR
254300210928      *    END-IF.
254400210928      *
254500210928      *CNND-EXIT.
254600210928      *    EXIT.
254700210928      /
254800210928       GET-INVESTMENT-CURRENCY.
254900210928           MOVE WS-INVESTMENT-CODE
255000210928             TO INVESTMENT-CODE OF INVESTMENT-2.
255100210928
255200210928           READ INVESTMENT-2
255300210928                INVALID KEY
255400210928                MOVE "CAD" TO CURRENCY-DDS OF INVESTMENT-2
255500210928                GO TO GIC-EXIT.
255600210928
255700210928           MOVE LOAD-STRUCTURE OF INVESTMENT-2 TO WS-LOAD-STRUCTURE.
255800210928
255900210928       GIC-EXIT.
256000210928           EXIT.
256100210928      /
25620021092863488  GET-FMV-PARA.
25630021092863488
256400210928  |            MOVE WS-R                 TO PC_MODE
256500210928  |            MOVE CURR-ACCOUNT-NO      TO PC_ACCOUNTNO
256600210928  |            MOVE CURR-CONTRACT-NO     TO PC_CONTRACTNO
256700210928  |            MOVE CURR-INVESTMENT-CODE TO PC_INVESTMENTCODE
256800210928  |            MOVE CURR-EFFECT-DATE     TO PC_TRADEDATE
256900210928  |
257000210928  |           CALL WS-FXGETFMV USING PC_ACCOUNTNO
257100210928  |                                  PC_TRADEDATE
257200210928  |                                  PC_FMVAMT
257300210928  |                                  PC_MODE
257400210928  |                                  PC_CONTRACTNO
257500210928  |                                  PC_INVESTMENTCODE
257600210928  |                                  PC_UNITAMOUNT.
25770021092863488
25780021092863488         MOVE PC_UNITAMOUNT   TO WS-ACC-CON-INV-UNIT-BAL.
257900210928
258000210928 63488* The paragraphs from GET-UNIT-BALANCE thru GUB-EXIT are commented
258100210928 63488* for RFS63488
258200210928
258300210928      *GET-UNIT-BALANCE.
258400210928
258500210928      *    INITIALIZE MFATRNP OF TRANS-D-REC.
258600210928      *    MOVE CURR-ACCOUNT-NO TO ACCOUNT-NO OF TRANS-D.
258700210928      *    MOVE CURR-INVESTMENT-CODE TO INVESTMENT-CODE OF TRANS-D.
258800210928      *    MOVE CURR-EFFECT-DATE TO PROCESS-DATE OF TRANS-D.
258900210928      *    MOVE COMM-PROCESS-DATE TO PROCESS-DATE OF TRANS-D.
259000210928      *    MOVE ZEROES TO TRANS-PROC-SEQ-NO OF TRANS-D.
259100210928      *
259200210928      *    START TRANS-D
259300210928      *          KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
259400210928      *          INVALID KEY
259500210928      *          GO TO GUB-EXIT.
259600210928      *
259700210928      *GUB-0010.
259800210928      *    READ TRANS-D NEXT RECORD
259900210928      *         AT END
260000210928      *         GO TO GUB-EXIT.
260100210928      *
260200210928      *    IF ACCOUNT-NO OF TRANS-D NOT = CURR-ACCOUNT-NO
260300210928      *       GO TO GUB-EXIT.
260400210928      *
260500210928      *    IF INVESTMENT-CODE OF TRANS-D NOT = CURR-INVESTMENT-CODE
260600210928      *       GO TO GUB-EXIT.
260700210928      *
260800210928      *    IF PROCESS-DATE OF TRANS-D < CURR-EFFECT-DATE OR
260900210928      *       PROCESS-DATE OF TRANS-D > COMM-PROCESS-DATE
261000210928      *       GO TO GUB-EXIT.
261100210928      *
261200210928      *    IF PROCESS-DATE OF TRANS-D = CURR-EFFECT-DATE
261300210928      *       GO TO GUB-0010
261400210928      *    END-IF.
261500210928      *
261600210928      *    MOVE TRANS-TYPE-CODE OF TRANS-D
261700210928      *      TO TRANS-CATEGORY.
261800210928      *    MOVE TRANS-STATUS-CODE OF TRANS-D
261900210928      *      TO TRANS-STATUS-CATEGORY.
262000210928      *    MOVE REVERSE OF TRANS-D
262100210928      *      TO TRANS-REVERSE-CATEGORY.
262200210928      *
262300210928      *    IF TRANS-REVERSED
262400210928      *       GO TO GUB-0010.
262500210928      *
262600210928      *    IF NOT HISTORY
262700210928      *       GO TO GUB-0010.
262800210928      *
262900210928      *    IF NOT VALID-TRANSACTION
263000210928      *       GO TO GUB-0010.
263100210928      *
263200210928      *    MOVE UNIT-AMT OF TRANS-D TO WS-CURR-TRANS-UNIT-AMT.
263300210928      *    MOVE UNIT-PRICE OF TRANS-D TO WS-CURR-TRANS-UNIT-PRICE.
263400210928      *
263500210928      *    INITIALIZE MFATRCODP OF TRANS-CONTRACT-DTL.
263600210928      *    MOVE PLACEMENT-DATE OF TRANS-D
263700210928      *      TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL.
263800210928      *    MOVE TRANS-NO OF TRANS-D
263900210928      *      TO TRANS-NO OF TRANS-CONTRACT-DTL.
264000210928      *    MOVE CURR-CONTRACT-NO
264100210928      *      TO CONTRACT-NO OF TRANS-CONTRACT-DTL.
264200210928      *
264300210928      *    READ TRANS-CONTRACT-DTL
264400210928      *         INVALID KEY
264500210928      *         GO TO GUB-0010.
264600210928      *
264700210928      *    IF REVERSED-DDS OF TRANS-CONTRACT-DTL = "Y"
264800210928      *       GO TO GUB-0010.
264900210928      *
265000210928      *    IF CURRENCY-DDS OF INVESTMENT-2 NOT = UNITRAX-BASE-CURRENCY
265100210928      *       MOVE PLACEMENT-DATE OF TRANS-D TO WS-EXCH-PLACEMENT-DATE
265200210928      *       MOVE TRANS-NO OF TRANS-D TO WS-EXCH-TRANS-NO
265300210928      *       MOVE TRADE-DATE OF TRANS-D TO WS-EXCH-TRADE-DATE
265400210928      *       MOVE CURRENCY-DDS OF INVESTMENT-2 TO WS-EXCH-CURRENCY
265500210928      *       PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
265600210928      *       IF WS-EXCHANGE-FOUND NOT = "Y"
265700210928      *          MOVE 1.0 TO WS-EXCH-RATE-VALUE
265800210928      *       END-IF
265900210928      *    END-IF.
266000210928      *
266100210928      *    IF AVERAGE-EXCHANGE-RATE OF TRANS-CONTRACT-DTL NOT = 0
266200210928      *       MOVE AVERAGE-EXCHANGE-RATE OF TRANS-CONTRACT-DTL
266300210928      *         TO WS-EXCH-RATE-VALUE
266400210928      *    END-IF.
266500210928      *    IF AVERAGE-UNIT-COST OF TRANS-CONTRACT-DTL NOT = 0
266600210928      *       MOVE AVERAGE-UNIT-COST OF TRANS-CONTRACT-DTL
266700210928      *         TO WS-CURR-TRANS-UNIT-PRICE
266800210928      *    END-IF.
266900210928      *
267000210928      *    COMPUTE WS-CURR-TRANS-AMT ROUNDED =
267100210928      *            WS-CURR-TRANS-UNIT-AMT * WS-CURR-TRANS-UNIT-PRICE.
267200210928      *
267300210928      *    IF CURRENCY-DDS OF INVESTMENT-2 = UNITRAX-BASE-CURRENCY
267400210928      *       MOVE WS-CURR-TRANS-AMT TO WS-CURR-TRANS-AMT-CUR
267500210928      *    ELSE
267600210928      *       COMPUTE WS-CURR-TRANS-AMT-CUR ROUNDED =
267700210928      *               WS-CURR-TRANS-AMT / WS-EXCH-RATE-VALUE
267800210928      *    END-IF.
267900210928
26800021092826151** Check if the transaction is in exclude transaction table.
26810021092826151** if it is a MFR transaction and not on exclude transaction table,
26820021092826151** don't update the unit balance.
268300210928
26840021092826151 *    MOVE "N" TO WS-EXCLUDE-TRANS.
26850021092826151 *    INITIALIZE WS-EXCLUDE-VARIABLES.
26860021092826151 *    MOVE ACCOUNT-NO OF TRANS-D TO WS-EX-ACCOUNT-NO.
26870021092826151 *    MOVE TRANS-ORIGIN-CODE OF TRANS-D TO WS-EX-TRANS-ORIGIN.
26880021092826151 *    MOVE TRANS-TYPE-CODE OF TRANS-D TO WS-EX-TRANS-TYPE.
26890021092826151 *    MOVE REVERSAL-CODE OF TRANS-D TO WS-EX-REVERSAL-CODE.
26900021092826151 *    PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
269100210928      *
26920021092826151 *    IF WS-EXCLUDE-TRANS NOT = "Y" AND
26930021092826151 *       MAN-FEE-REB-TRANSACTION
26940021092826151 *       GO TO GUB-0010
26950021092826151 *    END-IF.
269600210928      *
269700210928      *    IF PURCHASE-TRANSACTION
26980021092826151 *       OR MAN-FEE-REB-TRANSACTION
269900210928      *       SUBTRACT ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL
270000210928      *           FROM WS-ACC-CON-INV-UNIT-BAL
270100210928      *    ELSE
270200210928      *       ADD ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL
270300210928      *           TO WS-ACC-CON-INV-UNIT-BAL
270400210928      *    END-IF.
270500210928      *
270600210928      *    GO TO GUB-0010.
270700210928
270800210928      *GUB-EXIT.
270900210928      *    EXIT.
271000210928      /
271100210928       GET-LAST-UNIT-PRICE.
271200210928
271300210928           MOVE "N"          TO WS-PRICE-FOUND.
271400210928
271500210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
271600210928                             TO INVESTMENT-CODE
271700210928                             OF INVESTMENT-UNIT-PRICE.
271800210928
271900210928           MOVE EFFECT-DATE  OF ACCOUNT-CONTRACT-INV-RESET
272000210928                             TO TRADE-DATE
272100210928                             OF INVESTMENT-UNIT-PRICE.
272200210928
272300210928           MOVE SPACES       TO DISTRIBUTION-FLAG
272400210928                             OF INVESTMENT-UNIT-PRICE.
272500210928
272600210928           START INVESTMENT-UNIT-PRICE
272700210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
272800210928           INVALID KEY
272900210928           GO TO GLUP-EXIT.
273000210928
273100210928       GLUP-0010.
273200210928
273300210928           READ INVESTMENT-UNIT-PRICE PRIOR RECORD
273400210928           AT END
273500210928           GO TO GLUP-EXIT.
273600210928
273700210928           IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE NOT =
273800210928              INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
273900210928             GO TO GLUP-EXIT
274000210928           END-IF.
274100210928
274200210928           IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE NOT = SPACES
274300210928             GO TO GLUP-0010
274400210928           END-IF.
274500210928
274600210928           MOVE "Y"          TO WS-PRICE-FOUND.
274700210928
274800210928       GLUP-EXIT.
274900210928           EXIT.
275000210928      /
275100210928       GET-EXCHANGE-RATE.
275200210928
275300210928           MOVE "N"          TO WS-EXCHANGE-FOUND.
275400210928
275500210928           MOVE TRADE-DATE   OF INVESTMENT-UNIT-PRICE
275600210928                             TO TRADE-DATE OF EXCHANGE-RATE-M.
275700210928           MOVE CURRENCY-DDS OF INVESTMENT
275800210928                             TO CURRENCY-DDS OF EXCHANGE-RATE-M.
275900210928           MOVE PROG-EXCHANGE-RATE-TYPE
276000210928                             TO EXCHANGE-RATE-TYPE
276100210928                             OF EXCHANGE-RATE-M.
276200210928
276300210928           READ EXCHANGE-RATE-M
276400210928           INVALID KEY
276500210928             GO TO GER-EXIT.
276600210928
276700210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
276800210928
276900210928       GER-EXIT.
277000210928           EXIT.
277100210928      /
277200210928       GET-EXCHANGE-RATE-2.
277300210928
277400210928           INITIALIZE MFATREXRP OF TRANS-EXCHANGE-RATE-2-REC.
277500210928           MOVE WS-EXCH-PLACEMENT-DATE
277600210928                             TO PLACEMENT-DATE
277700210928                             OF TRANS-EXCHANGE-RATE-2.
277800210928           MOVE WS-EXCH-TRANS-NO
277900210928                             TO TRANS-NO
278000210928                             OF TRANS-EXCHANGE-RATE-2.
278100210928
278200210928           READ TRANS-EXCHANGE-RATE-2
278300210928           INVALID KEY
278400210928           GO TO GER2-0010.
278500210928
278600210928           IF CURRENCY-DDS OF TRANS-EXCHANGE-RATE-2 NOT =
278700210928              WS-EXCH-CURRENCY
278800210928             GO TO GER2-0010
278900210928           END-IF.
279000210928
279100210928           IF EXCHANGE-RATE OF TRANS-EXCHANGE-RATE-2 = 0
279200210928              GO TO GER2-0010
279300210928           END-IF.
279400210928
279500210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
279600210928           MOVE EXCHANGE-RATE OF TRANS-EXCHANGE-RATE-2
279700210928                             TO WS-EXCH-RATE-VALUE.
279800210928           GO TO GER2-EXIT.
279900210928
280000210928       GER2-0010.
280100210928
280200210928           INITIALIZE MFAEXRHMP OF EXCHANGE-RATE-M-2.
280300210928           MOVE WS-EXCH-TRADE-DATE
280400210928                             TO TRADE-DATE OF EXCHANGE-RATE-M-2.
280500210928           MOVE WS-EXCH-CURRENCY
280600210928                             TO CURRENCY-DDS OF EXCHANGE-RATE-M-2.
280700210928           MOVE PROG-EXCHANGE-RATE-TYPE
280800210928                             TO EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M-2.
280900210928
281000210928           READ EXCHANGE-RATE-M-2
281100210928           INVALID KEY
281200210928             GO TO GER2-EXIT.
281300210928
281400210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
281500210928           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-2
281600210928                             TO WS-EXCH-RATE-VALUE.
281700210928
281800210928       GER2-EXIT.
281900210928           EXIT.
282000210928      /
282100210928       LOG-ERROR.
282200210928           INITIALIZE MFACTERRP OF CONTRACT-ERROR-LOG.
282300210928
282400210928           IF COMM-REJECTION-CODE = SPACES OR "00"
282500210928             MOVE WS-REJECTION-CODE TO COMM-REJECTION-CODE
282600210928           END-IF.
282700210928
282800210928           ACCEPT WS-SYSTIME-LONG FROM TIME.
282900210928           CALL "GETDAT" USING WS-SYSDATE-N.
283000210928
283100210928           MOVE WS-REJECTION-CODE
283200210928                             TO REJECTION-CODE OF CONTRACT-ERROR-LOG.
283300210928           MOVE INVESTOR-NO  OF ACCOUNT
283400210928                             TO INVESTOR-NO OF CONTRACT-ERROR-LOG.
283500210928           MOVE ACCOUNT-NO   OF ACCOUNT-CONTRACT-INV-RESET
283600210928                             TO ACCOUNT-NO OF CONTRACT-ERROR-LOG.
283700210928
283800210928           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-INV-RESET
283900210928                             TO CONTRACT-NO OF CONTRACT-ERROR-LOG.
284000210928           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
284100210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG.
284200210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
284300210928                             TO INVESTMENT-CODE
284400210928                             OF CONTRACT-ERROR-LOG.
284500210928
284600210928           MOVE COMM-CALLER-ID-CODE TO CALLER-ID-CODE
284700210928                             OF CONTRACT-ERROR-LOG.
284800210928           MOVE PROG-ID-CODE TO PROGRAM-ID-CODE
284900210928                             OF CONTRACT-ERROR-LOG.
285000210928           MOVE COMM-USER    TO AUDIT-USER OF CONTRACT-ERROR-LOG.
285100210928
285200210928           MOVE WS-MISC-INFO-AREA
285300210928                             TO MISC-INFO OF CONTRACT-ERROR-LOG.
285400210928           MOVE WS-SYSDATE-N TO AUDIT-DATE OF CONTRACT-ERROR-LOG.
285500210928           MOVE WS-SYSTIME-LONG-N
285600210928                             TO LOG-TIME OF CONTRACT-ERROR-LOG.
285700210928
285800210928           WRITE CONT-ERR-LOG-REC.
285900210928
286000210928           MOVE SPACES         TO WS-MISC-INFO-AREA.
286100210928
286200210928       LER-EXIT.
286300210928           EXIT.
286400210928      /
286500210928       INITIAL-LOGIC.
286600210928
286700210928      *RFS186918 STARTS
286800210928           ACCEPT lc_Mfasegparm FROM WS-DTAARA-MFASEGPARM
286900210928                                FOR  "MFASEGPARM".
287000210928      *RFS186918 ENDS
287100210928
287200210928           MOVE SPACES       TO COMM-REJECTION-CODE.
287300210928           MOVE "N"          TO WS-SQL-FILE-OPEN.
287400210928           MOVE LOW-VALUES   TO CURR-CONTROLS
287500210928                                PREV-CONTROLS.
287600210928      * RFS24943 - Begin
287700210928      * Get screen edit code DMCCON
287800210928
287900210928           INITIALIZE MFAEDTSCP OF SCREEN-EDITS-ALLOWED-REC.
288000210928           MOVE WS-ACCCDTL-SCREEN-CODE TO
288100210928                        SCREEN-CODE OF SCREEN-EDITS-ALLOWED-REC.
288200210928           MOVE WS-DMCCON-EDIT-CODE    TO
288300210928                        EDIT-CODE OF SCREEN-EDITS-ALLOWED-REC.
288400210928           MOVE WS-DMCCON-LEVEL-CODE   TO
288500210928                        LEVEL-CODE OF SCREEN-EDITS-ALLOWED-REC.
288600210928           PERFORM GET-SCREEN-EDITS-ALLOWED THRU GSEA-EXIT.
288700210928
288800210928           IF WS-SEA-RETURN-CODE = "00"
288900210928             SET WS-DMCCON-EDIT-YES    TO TRUE
289000210928           END-IF.
289100210928
289200210928      * RFS24943 - End
289300210928      * RFS132483 - Begin
289400210928
289500210928           INITIALIZE lc_CMDFCN_RtnFlag
289600210928              CALL "FXSCEDTAL1" USING lc_CMDFCN_ScreenCode
289700210928                                      lc_CMDFCN_EditCode
289800210928                                      lc_CMDFCN_EditLevel
289900210928                                      lc_CMDFCN_RtnFlag.
290000210928              CANCEL "FXSCEDTAL1".
290100210928
290200210928      * RFS132483 - End
290300210928
290400210928      * RFS80605 - Start
290500210928           INITIALIZE WS-AWD-CARRIED-OVER.
290600210928           SET lb_AWDChanged_No TO TRUE
290700210928      * RFS80605 - End
290800210928
290900210928           IF COMM-OPEN-FILES NOT = "Y" AND
291000210928              OPEN-FILES-ONCE NOT = "Y"
291100210928             GO TO INL-0010
291200210928           END-IF.
291300210928
291400210928           OPEN INPUT  INVESTMENT-UNIT-PRICE
291500210928                       ACCOUNT
291600210928                       INVESTMENT
291700210928                       INVESTMENT-2
291800210928                       ACCOUNT-CONTRACT-RESET-R
291900210928                       PROGRAM-EXCHANGE-RATE
292000210928                       EXCHANGE-RATE-M
292100210928                       EXCHANGE-RATE-M-2
292200210928                       CURRENCY-CODE
292300210928                       BUSINESS-DAYS                                    RFS8712
292400210928                       TRANS-D
292500210928                       TRANS-CONTRACT-DTL
292600210928                       TRANS-GBV
292700210928                       TRANS-EXCHANGE-RATE-2
292800210928                       TRANS-CON-DTL
292900210928                       ACC-CON-INVESTMENT
293000210928                       INVESTMENT-UNIT-PRICE-2
293100210928                       ACCOUNT-NOMINEE
293200210928                       ACCOUNT-ATTRIBUTES
293300210928                       EXCLUDE-TRANS
293400210928                       TRANS-DESCENDING
293500210928                       INVESTMENT-SEG
293600210928                       TRANS-CONTRACT-DTL-DES
293700210928R11698*                TRANS-TARGET
293800210928R11698*                TRANS-TARGET-2
293900210928R11698*                TRANS-OFFSET
294000210928R11698*                SEG-TRANSFER-OPTIONS
294100210928R11698*                TRANS-CONTRACT-DETAILS
294200210928R13394                 TRANS-GBV-TRANSFER
294300210928110904                 INVESTMENT-STRUCTURE-XREF
294400210928180708                 TRANS-MISC-DETAILS
294500210928180708                 TRANS-REDEM-DETAILS
294600210928                I-O    ACCOUNT-CONTRACT
294700210928                       ACCOUNT-CONTRACT-INVESTMENT
294800210928                       ACCOUNT-CONTRACT-RESET
294900210928                       ACCOUNT-CONTRACT-INV-RESET
295000210928R12702*                ACCOUNT-CONTRACT-INVEST
295100210928                       CONTRACT-ERROR-LOG
29520021092880605                  INVESTOR-CHANGE-LOG
29530021092857388                  CONTRACT-CHANGE-LOG.
295400210928
295500210928           MOVE "N"          TO OPEN-FILES-ONCE.
295600210928
295700210928       INL-0010.
295800210928
295900210928      *    PERFORM VA-GET-JOB-INFORMATION                               RFS8712
296000210928      *
296100210928      *    PERFORM VC-GET-NEXT-PROCESS-DATE                             RFS8712
296200210928
296300210928           IF UNITRAX-BASE-CURRENCY   NOT = SPACES AND
296400210928              PROG-EXCHANGE-RATE-TYPE NOT = SPACES
296500210928             GO TO INL-EXIT
296600210928           END-IF.
296700210928
296800210928           PERFORM GET-BASE-CURRENCY
296900210928                             THRU GBC-EXIT.
297000210928
297100210928           PERFORM GET-EXCHANGE-RATE-TYPE
297200210928                             THRU GERT-EXIT.
297300210928
297400210928       INL-EXIT.
297500210928           EXIT.
297600210928      /
297700210928      * RFS24943 - Begin
297800210928       GET-SCREEN-EDITS-ALLOWED.
297900210928            CALL "FXSCEDTALW" USING SCREEN-EDITS-ALLOWED-REC,
298000210928                                    WS-SEA-EDIT-SQLLOG,
298100210928                                    WS-SEA-RETURN-CODE.
298200210928       GSEA-EXIT.
298300210928            EXIT.
298400210928      * RFS24943 - End
298500210928      /
298600210928       GET-BASE-CURRENCY.
298700210928           MOVE LOW-VALUES   TO CURRENCY-DDS OF CURRENCY-CODE.
298800210928
298900210928           START CURRENCY-CODE
299000210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
299100210928           INVALID KEY
299200210928             MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
299300210928             GO TO GBC-EXIT.
299400210928
299500210928       GBC-0010.
299600210928
299700210928           READ CURRENCY-CODE NEXT RECORD
299800210928             AT END
299900210928             MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
300000210928             GO TO GBC-EXIT.
300100210928
300200210928           IF BASE-CURRENCY  OF CURRENCY-CODE NOT = "Y"
300300210928             GO TO GBC-0010.
300400210928
300500210928           MOVE CURRENCY-DDS OF CURRENCY-CODE
300600210928                             TO UNITRAX-BASE-CURRENCY.
300700210928
300800210928       GBC-EXIT.
300900210928           EXIT.
301000210928      /
301100210928       GET-EXCHANGE-RATE-TYPE.
301200210928
301300210928           MOVE PROG-ID-CODE TO PROGRAM-CODE
301400210928                             OF PROGRAM-EXCHANGE-RATE.
301500210928           MOVE "DEFAULT"    TO PROGRAM-ACTION
301600210928                             OF PROGRAM-EXCHANGE-RATE.
301700210928
301800210928           READ PROGRAM-EXCHANGE-RATE
301900210928           INVALID KEY
302000210928             MOVE "06"       TO COMM-REJECTION-CODE
302100210928             MOVE HIGH-VALUES TO CURR-CONTROLS
302200210928             GO TO GERT-EXIT.
302300210928
302400210928           MOVE EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
302500210928                             TO PROG-EXCHANGE-RATE-TYPE.
302600210928
302700210928       GERT-EXIT.
302800210928           EXIT.
302900210928
303000210928      * RFS80605- START
303100210928
303200210928       GET-AWD-CARRIED-OVER.
303300210928           INITIALIZE WS-AWD-CARRIED-OVER.
303400210928           MOVE CURR-CONTRACT-NO TO CURR-CONTRACT-NO-SIGNED
303500210928           EXEC SQL
303600210928             SELECT AWD_CARRIED_OVER
303700210928               INTO :WS-AWD-CARRIED-OVER
303800210928               FROM MFAACCONP
303900210928               WHERE ACCOUNT_NO  = :CURR-ACCOUNT-NO AND
304000210928                     CONTRACT_NO = :CURR-CONTRACT-NO-SIGNED
304100210928           END-EXEC.
304200210928
304300210928           IF SQLCODE = 0
304400210928              CONTINUE
304500210928           ELSE
304600210928              SET WS-ERR-13  TO TRUE
304700210928              PERFORM DSP-ERROR
304800210928           END-IF.
304900210928
305000210928           MOVE WS-AWD-CARRIED-OVER TO AWD-CARRIED-OVER OF
305100210928                                           ACCOUNT-CONTRACT-RESET.
305200210928
305300210928       GET-GDV-SCHED-CODE.
305400210928
305500210928               IF gdv-sched-code of investment-seg-rec
305600210928                  not = spaces
305700210928                  move gdv-sched-code of investment-seg-rec
305800210928                    to WS-GDV-SCHED-CODE
305900210928                  move CURR-ACCOUNT-NO to CURR-ACCOUNT-NO-SIGNED
306000210928                  move CURR-CONTRACT-NO to CURR-CONTRACT-NO-SIGNED
306100210928                  exec sql
306200210928                    select value(d1.gdv_sched_code,
306300210928                                 d2.gdv_sched_code,
306400210928                                 "")
306500210928                      into :WS-GDV-SCHED-CODE
306600210928                      from mfaaccntp acc
306700210928                      join mfaacconp con
306800210928                        on con.account_no = :CURR-ACCOUNT-NO-SIGNED
306900210928                         and con.contract_no = :CURR-CONTRACT-NO-SIGNED
307000210928                        left outer join mfagdthcsp d1
307100210928                          on d1.gdv_sched_code =
307200210928                             :WS-GDV-SCHED-CODE
307300210928                         and d1.start_date <= con.start_date
307400210928                         and d1.end_date >= con.start_date
307500210928                         and d1.reset_type = "GDV"
307600210928                         and d1.account_type_code =
307700210928                         acc.account_type_code
30780021092863488                    and d1.RESET_STRUCTURE_XREF =
30790021092863488                    con.RESET_STRUCTURE_XREF
308000210928                       left outer join mfagdthcsp d2
308100210928                          on d2.gdv_sched_code =
308200210928                             :WS-GDV-SCHED-CODE
308300210928                         and d2.start_date <= con.start_date
308400210928                         and d2.end_date >= con.start_date
308500210928                         and d2.reset_type = "GDV"
308600210928                         and d2.account_type_code = ""
30870021092863488                    and d2.RESET_STRUCTURE_XREF =
30880021092863488                    con.RESET_STRUCTURE_XREF
30890021092863488                  left outer join mfagdthcsp d3
309000210928 |                        on d3.gdv_sched_code =
309100210928 |                           :WS-GDV-SCHED-CODE
309200210928 |                       and d3.start_date <= con.start_date
309300210928 |                       and d3.end_date >= con.start_date
309400210928 |                       and d3.reset_type = "GDV"
309500210928 |                       and d3.account_type_code =
309600210928 |                       acc.account_type_code
309700210928 |                       and d3.RESET_STRUCTURE_XREF = " "
309800210928 |                     left outer join mfagdthcsp d4
309900210928 |                        on d4.gdv_sched_code =
310000210928 |                           :WS-GDV-SCHED-CODE
310100210928 |                       and d4.start_date <= con.start_date
310200210928 |                       and d4.end_date >= con.start_date
310300210928 |                       and d4.reset_type = "GDV"
310400210928 |                       and d4.account_type_code = ""
31050021092863488                    and d4.RESET_STRUCTURE_XREF = " "
310600210928                       where acc.account_no = :CURR-ACCOUNT-NO-SIGNED
310700210928                  END-EXEC
310800210928                END-IF.
310900210928                IF WS-GDV-SCHED-CODE NOT = SPACES
311000210928                   SET GDV-SCHED-CODE-EXISTS-YES TO TRUE
311100210928                ELSE
311200210928                   SET GDV-SCHED-CODE-EXISTS-NO  TO TRUE
311300210928                END-IF.
311400210928
311500210928
311600210928       UPDATE-ACCOUNT-CONTRACT.
311700210928
311800210928            MOVE  CURR-CONTRACT-NO  TO WS-CONTRACT-NO
311900210928
312000210928            EXEC SQL
312100210928              UPDATE MFAACCONP
312200210928              SET AWD_CARRIED_OVER      = 0,
312300210928              OLD_GDV_AWD_CARRIED_OVER  = :WS-AWD-CARRIED-OVER
312400210928              WHERE
312500210928               ACCOUNT_NO   = :CURR-ACCOUNT-NO AND
312600210928               CONTRACT_NO  = :WS-CONTRACT-NO
312700210928            END-EXEC
312800210928
312900210928            IF SQLCODE = 0
313000210928Def11         If Ws-Awd-Carried-Over NOT = 0
313100210928               PERFORM Create_AWDChg_AuditLog
313200210928              End-if
313300210928            ELSE
313400210928               SET WS-ERR-11  TO TRUE
313500210928               PERFORM DSP-ERROR
313600210928            END-IF.
313700210928
313800210928      *-----------------------
313900210928       Create_AWDChg_AuditLog.
314000210928      *----*
314100210928           SET lb_AWDChanged_Yes TO TRUE.
314200210928           PERFORM WRITE-CONTRACT-LOG.
314300210928           SET lb_AWDChanged_No TO TRUE.
314400210928
314500210928      * RFS80605- END
314600210928
314700210928      * ---------------------------------
314800210928       MOVE-OLD-TO-NEW.
314900210928      * ---------------------------------
315000210928           DISPLAY "MOVE-OLD-TO-NEW...............".
315100210928
315200210928           MOVE COMM-ACCOUNT-NO
315300210928                             TO ACCOUNT-NO
315400210928                             OF ACCOUNT-CONTRACT-INV-RESET.
315500210928           MOVE COMM-CONTRACT-NO
315600210928                             TO CONTRACT-NO
315700210928                             OF ACCOUNT-CONTRACT-INV-RESET.
315800210928           MOVE COMM-RESET-NUMBER
315900210928                             TO RESET-NUMBER
316000210928                             OF ACCOUNT-CONTRACT-INV-RESET.
316100210928           MOVE SPACES TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
316200210928
316300210928           START ACCOUNT-CONTRACT-INV-RESET WITH NO LOCK
316400210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
316500210928           INVALID KEY
316600210928           GO TO MOTN-EXIT.
316700210928
316800210928       MOTN-0010.
316900210928
317000210928           READ ACCOUNT-CONTRACT-INV-RESET NEXT RECORD WITH NO LOCK
317100210928           AT END
317200210928           GO TO MOTN-EXIT.
317300210928
317400210928           IF ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
317500210928              COMM-ACCOUNT-NO
317600210928             GO TO MOTN-EXIT
317700210928           END-IF.
317800210928
317900210928           IF CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
318000210928              COMM-CONTRACT-NO
318100210928             GO TO MOTN-EXIT
318200210928           END-IF.
318300210928
318400210928           IF RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET NOT =
318500210928              COMM-RESET-NUMBER
318600210928             GO TO MOTN-EXIT
318700210928           END-IF.
318800210928
318900210928           MOVE OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
319000210928             TO NEW-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET.
319100210928
319200210928           MOVE OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INV-RESET
319300210928             TO NEW-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INV-RESET.
319400210928
319500210928           REWRITE ACC-CON-INV-RESET-REC.
319600210928
319700210928           MOVE COMM-ACCOUNT-NO
319800210928                  TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
319900210928           MOVE COMM-CONTRACT-NO
320000210928                  TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
320100210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
320200210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
320300210928
320400210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK.
320500210928
320600210928           MOVE OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
320700210928                             TO GUAR-BASE-VALUE
320800210928                             OF ACCOUNT-CONTRACT-INVESTMENT.
320900210928           MOVE OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INV-RESET
321000210928                             TO GUAR-BASE-VALUE-CUR
321100210928                             OF ACCOUNT-CONTRACT-INVESTMENT.
321200210928
321300210928           REWRITE ACC-CON-INV-REC.
321400210928
321500210928           GO TO MOTN-0010.
321600210928
321700210928       MOTN-EXIT.
321800210928           EXIT.
321900210928      /
322000210928       CHECK-IF-EXCLUDE-TRANSACTION.
322100210928R15872*    DISPLAY "CHECK-IF-EXCLUDE-TRANSACTION..........".
322200210928           INITIALIZE MFAACCNTP OF ACCOUNT-REC.
322300210928           MOVE WS-EX-ACCOUNT-NO TO ACCOUNT-NO OF ACCOUNT
322400210928                                    ACCOUNT-NO OF ACCOUNT-NOMINEE.
322500210928
322600210928           READ ACCOUNT
322700210928                INVALID KEY
322800210928                MOVE " " TO WS-EX-ACCOUNT-TYPE
322900210928                GO TO CIET-0010.
323000210928
323100210928           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT TO WS-EX-ACCOUNT-TYPE.
323200210928
323300210928       CIET-0010.
323400210928           INITIALIZE MFAACCNMP OF ACCOUNT-NOMINEE-REC.
323500210928
323600210928           READ ACCOUNT-NOMINEE
323700210928                INVALID KEY
323800210928                MOVE " " TO WS-EX-NOM-ACCOUNT-TYPE
323900210928                GO TO CIET-0020.
324000210928
324100210928           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-NOMINEE
324200210928             TO WS-EX-NOM-ACCOUNT-TYPE.
324300210928
324400210928       CIET-0020.
324500210928           INITIALIZE MFAEXTRNP OF EXCLUDE-TRANS-REC.
324600210928           MOVE WS-EX-ACCOUNT-TYPE
324700210928             TO ACCOUNT-TYPE-CODE OF EXCLUDE-TRANS.
324800210928           MOVE WS-EX-NOM-ACCOUNT-TYPE
324900210928             TO NOMINEE-ACCOUNT-TYPE OF EXCLUDE-TRANS.
325000210928           MOVE WS-EX-TRANS-TYPE
325100210928             TO TRANS-TYPE-CODE OF EXCLUDE-TRANS.
325200210928           MOVE WS-EX-TRANS-ORIGIN
325300210928             TO TRANS-ORIGIN-CODE OF EXCLUDE-TRANS.
325400210928           MOVE WS-EX-REVERSAL-CODE
325500210928             TO REVERSAL-CODE OF EXCLUDE-TRANS.
325600210928110904     MOVE SPACES
325700210928110904       TO INVESTMENT-STRUCTURE-CODE OF EXCLUDE-TRANS-REC.
325800210928180708     PERFORM READ-TRANSMISC.
325900210928
326000210928           READ EXCLUDE-TRANS
326100210928                INVALID KEY
326200210928      * RFS 110904 - START
326300210928            IF GUAR-BENEFIT-ELIGIBLE OF ACCOUNT-CONTRACT = "Y"
326400210928            PERFORM GET-INVESTMENT-STRUCTURE-CODE
326500210928                         THRU GIS-EXIT
326600210928                  IF lc_InvStructureCode = SPACE
326700210928                     GO TO CIET-EXIT
326800210928                  ELSE
326900210928                     MOVE lc_InvStructureCode TO
327000210928                     INVESTMENT-STRUCTURE-CODE OF EXCLUDE-TRANS-REC
327100210928                     READ EXCLUDE-TRANS
327200210928                          INVALID KEY
327300210928                          GO TO CIET-EXIT
327400210928                     END-READ
327500210928                  END-IF
327600210928            ELSE
327700210928             GO TO CIET-EXIT
327800210928            END-IF
327900210928      * RFS 110904 - END
328000210928           END-READ.
328100210928
328200210928      * RFS 20516 - Start
328300210928           MOVE "Y" TO WS-EXCLUDE-TRANS.
328400210928
328500210928      **   IF ACCOUNT-ATTRIBUTE-CODE OF EXCLUDE-TRANS = " "
328600210928      **      MOVE "Y" TO WS-EXCLUDE-TRANS
328700210928      **      GO TO CIET-EXIT
328800210928      **   END-IF.
328900210928
329000210928      **   INITIALIZE MFAACCATP OF ACCOUNT-ATTRIBUTES-REC.
329100210928      **   MOVE WS-EX-ACCOUNT-NO
329200210928      **     TO ACCOUNT-NO OF ACCOUNT-ATTRIBUTES.
329300210928      **   MOVE ACCOUNT-ATTRIBUTE-CODE OF EXCLUDE-TRANS
329400210928      **     TO ACCOUNT-ATTRIBUTE-CODE OF ACCOUNT-ATTRIBUTES.
329500210928
329600210928      **   READ ACCOUNT-ATTRIBUTES
329700210928      **        INVALID KEY
329800210928      **        MOVE "Y" TO WS-EXCLUDE-TRANS
329900210928      **        GO TO CIET-EXIT.
330000210928      * RFS 20516 - End
330100210928
330200210928       CIET-EXIT.
330300210928           EXIT.
330400210928      /
330500210928      * RFS 110904 - START
330600210928       GET-INVESTMENT-STRUCTURE-CODE.
330700210928           MOVE SPACES TO lc_InvStructureCode
330800210928           INITIALIZE MFAINVSXP OF INV-STRU-XREF-REC.
330900210928           MOVE CURR-INVESTMENT-CODE TO
331000210928                INVESTMENT-CODE OF INV-STRU-XREF-REC.
331100210928           MOVE LOW-VALUES TO INVESTMENT-STRUCTURE-CODE OF
331200210928                INV-STRU-XREF-REC.
331300210928           START INVESTMENT-STRUCTURE-XREF
331400210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
331500210928           INVALID KEY
331600210928           MOVE SPACES TO CURR-INVESTMENT-CODE
331700210928           NOT INVALID
331800210928127401       PERFORM GET-SETPOL-INV-STRUCTURE
331900210928127401         UNTIL LC_INVSTRUCTURECODE NOT = SPACES
332000210928127401       If lc_InvStructureCode = HIGH-VALUES
332100210928127401          MOVE Spaces to lc_InvStructureCode
332200210928127401       End-If.
332300210928127401**   READ INVESTMENT-STRUCTURE-XREF NEXT RECORD
332400210928127401**   AT END
332500210928127401**   MOVE SPACES TO lc_InvStructureCode
332600210928127401**   NOT AT END
332700210928127401**   IF (CURR-INVESTMENT-CODE NOT =
332800210928127401**       INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF)
332900210928127401**       MOVE SPACES TO lc_InvStructureCode
333000210928127401**   ELSE
333100210928127401**       MOVE INVESTMENT-STRUCTURE-CODE OF
333200210928127401**            INV-STRU-XREF-REC TO
333300210928127401**            lc_InvStructureCode
333400210928127401**   END-IF
333500210928127401**   END-READ.
333600210928
333700210928       GIS-EXIT.
333800210928           EXIT.
333900210928
334000210928127401  GET-SETPOL-INV-STRUCTURE.
334100210928
334200210928127401     READ INVESTMENT-STRUCTURE-XREF NEXT RECORD
334300210928127401     AT END
334400210928127401     MOVE HIGH-VALUES to lc_InvStructureCode
334500210928127401     NOT AT END
334600210928127401     IF (CURR-INVESTMENT-CODE NOT =
334700210928127401         INVESTMENT-CODE OF INVESTMENT-STRUCTURE-XREF)
334800210928127401         MOVE HIGH-VALUES to lc_InvStructureCode
334900210928127401     ELSE
335000210928127401         MOVE INVESTMENT-STRUCTURE-CODE OF
335100210928127401              INV-STRU-XREF-REC TO
335200210928127401              LC_INVSTRUCTURECODE
335300210928127401         Move 0 to li_Count
335400210928127401         EXEC SQL
335500210928127401          Select coun(1)
335600210928127401            into :li_count
335700210928127401          From MFAFNCTP
335800210928127401          where Investment_Structure_Code = :LC_INVSTRUCTURECODE
335900210928127401            and FUNCTION_CODE          = "SETPOL"
336000210928127401         END-EXEC
336100210928127401         If li_Count = 0
336200210928127401            Move Spaces to LC_INVSTRUCTURECODE
336300210928127401         End-If
336400210928127401     END-IF
336500210928127401     END-READ.
336600210928
336700210928      * RFS 110904 - END
336800210928
336900210928       GET-STANDARD-PREVIOUS-GBV.
337000210928           INITIALIZE MFATRNP OF TRANS-DESCENDING-REC.
337100210928           MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET
337200210928             TO ACCOUNT-NO OF TRANS-DESCENDING.
337300210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
337400210928             TO INVESTMENT-CODE OF TRANS-DESCENDING.
337500210928           MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET
337600210928             TO PROCESS-DATE OF TRANS-DESCENDING.
337700210928           MOVE 9999 TO TRANS-PROC-SEQ-NO OF TRANS-DESCENDING.
337800210928
337900210928           START TRANS-DESCENDING
338000210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
338100210928                 INVALID KEY
338200210928                 GO TO GSPG-EXIT.
338300210928
338400210928       GSPG-0010.
338500210928           READ TRANS-DESCENDING NEXT RECORD
338600210928                AT END
338700210928                GO TO GSPG-EXIT.
338800210928
338900210928           IF ACCOUNT-NO OF TRANS-DESCENDING NOT =
339000210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET
339100210928              GO TO GSPG-EXIT.
339200210928
339300210928           IF INVESTMENT-CODE OF TRANS-DESCENDING NOT =
339400210928              INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
339500210928              GO TO GSPG-EXIT.
339600210928
339700210928           IF PROCESS-DATE OF TRANS-DESCENDING IS LESS THAN
339800210928              EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET OR
339900210928              PROCESS-DATE OF TRANS-DESCENDING IS GREATER THAN
340000210928              EFFECT-DATE OF ACCOUNT-CONTRACT-INV-RESET
340100210928              GO TO GSPG-EXIT.
340200210928
340300210928           IF REVERSE OF TRANS-DESCENDING = "Y"
340400210928              GO TO GSPG-0010.
340500210928
340600210928           IF TRANS-TYPE-CODE OF TRANS-DESCENDING NOT = "BUY" AND
340700210928              TRANS-TYPE-CODE OF TRANS-DESCENDING NOT = "SEL" AND
340800210928              TRANS-TYPE-CODE OF TRANS-DESCENDING NOT = "SWO" AND
340900210928              TRANS-TYPE-CODE OF TRANS-DESCENDING NOT = "SWI" AND
341000210928              TRANS-TYPE-CODE OF TRANS-DESCENDING NOT = "TRO" AND
34110021092826151         TRANS-TYPE-CODE OF TRANS-DESCENDING NOT = "TRI" AND
34120021092826151         TRANS-TYPE-CODE OF TRANS-DESCENDING NOT = "MFR"
34130021092826151**       TRANS-TYPE-CODE OF TRANS-DESCENDING NOT = "TRI"
341400210928
341500210928              GO TO GSPG-0010.
341600210928
341700210928           IF TRANS-STATUS-CODE OF TRANS-DESCENDING NOT = "HST" AND
341800210928              TRANS-STATUS-CODE OF TRANS-DESCENDING NOT = "HSC"
341900210928              GO TO GSPG-0010.
342000210928
342100210928           MOVE "N" TO WS-EXCLUDE-TRANS.
342200210928           INITIALIZE WS-EXCLUDE-VARIABLES.
342300210928           MOVE ACCOUNT-NO OF TRANS-DESCENDING TO WS-EX-ACCOUNT-NO.
342400210928           MOVE TRANS-ORIGIN-CODE OF TRANS-DESCENDING
342500210928             TO WS-EX-TRANS-ORIGIN.
342600210928           MOVE TRANS-TYPE-CODE OF TRANS-DESCENDING TO WS-EX-TRANS-TYPE
342700210928           MOVE REVERSAL-CODE OF TRANS-DESCENDING
342800210928             TO WS-EX-REVERSAL-CODE.
342900210928180708     INITIALIZE WS-TRANSNO WS-PLACEMENTDATE.
343000210928180708     MOVE TRANS-NO OF TRANS-DESCENDING TO WS-TRANSNO.
343100210928180708     MOVE PLACEMENT-DATE OF TRANS-DESCENDING TO WS-PLACEMENTDATE.
343200210928
343300210928           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
34340021092826151**    IF WS-EXCLUDE-TRANS = "Y"
34350021092826151      IF WS-EXCLUDE-TRANS NOT = "Y"
34360021092826151         AND MAN-FEE-REB-TRANSACTION
343700210928              GO TO GSPG-0010
343800210928           END-IF.
343900210928
344000210928           INITIALIZE MFATRCODP OF TRANS-CONTRACT-DTL-DES-REC.
344100210928           MOVE PLACEMENT-DATE OF TRANS-DESCENDING
344200210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-DES.
344300210928           MOVE TRANS-NO OF TRANS-DESCENDING
344400210928             TO TRANS-NO OF TRANS-CONTRACT-DTL-DES.
344500210928           MOVE COMM-CONTRACT-NO
344600210928             TO CONTRACT-NO OF TRANS-CONTRACT-DTL-DES.
344700210928
344800210928           READ TRANS-CONTRACT-DTL-DES
344900210928                INVALID KEY
345000210928                GO TO GSPG-0010.
345100210928
345200210928           IF REVERSED-DDS OF TRANS-CONTRACT-DTL-DES = "Y"
345300210928              GO TO GSPG-0010.
345400210928
345500210928           MOVE NET-DEPOSIT-VALUE OF TRANS-CONTRACT-DTL-DES
345600210928             TO WS-OLD-NET-DEP-VALUE.
345700210928           MOVE NET-DEPOSIT-VALUE-CUR OF TRANS-CONTRACT-DTL-DES
345800210928             TO WS-OLD-NET-DEP-VALUE-CUR.
345900210928           MOVE GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-DES
346000210928             TO WS-OLD-GUAR-BASE-VALUE.
346100210928           MOVE GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DTL-DES
346200210928             TO WS-OLD-GUAR-BASE-VALUE-CUR.
346300210928
346400210928       GSPG-EXIT.
346500210928           EXIT.
346600210928      /
346700210928      *COPY CPYSEGRTN2.
346800210928      /
346900210928      * ---------------------------------
347000210928      *VA-GET-JOB-INFORMATION.                                          RFS8712
347100210928      * ---------------------------------
347200210928      *    CALL "QUSRJOBI" USING QWC-JOBI0600
347300210928      *                          LEN-RCV-DATA
347400210928      *                          NAME-FORMAT
347500210928      *                          JOB-CURR-NAME
347600210928      *                          INTERNAL-JOB-ID.
347700210928      * ---------------------------------
347800210928      *VC-GET-NEXT-PROCESS-DATE.                                        RFS8712
347900210928      * ---------------------------------
348000210928      *    MOVE COMM-PROCESS-DATE     TO WS-NEXT-PROCESS-DATE
348100210928      *
348200210928      *    IF JOB-TYPE-INTERACTIVE
348300210928      *        PERFORM VCA-GET-NEXT-BUSINESS-DATE
348400210928      *    END-IF.
348500210928      * ---------------------------------
348600210928       VCA-GET-NEXT-BUSINESS-DATE.
348700210928      * ---------------------------------
348800210928           MOVE CURR-EFFECT-DATE TO
348900210928                                 BUSINESS-DAY OF BUSINESS-DAYS.
349000210928
349100210928           START BUSINESS-DAYS
349200210928             KEY IS GREATER THAN EXTERNALLY-DESCRIBED-KEY
349300210928               INVALID KEY
349400210928                 CONTINUE
349500210928               NOT INVALID KEY
349600210928                 SET SW01-STS-OK     TO TRUE
349700210928                 PERFORM VCAA-NEXT-BUSINESS-DATE
349800210928                                           UNTIL NOT SW01-STS-OK
349900210928           END-START.
350000210928      * ---------------------------------
350100210928       VCAA-NEXT-BUSINESS-DATE.                                         RFS8712
350200210928      * ---------------------------------
350300210928            READ BUSINESS-DAYS NEXT RECORD
350400210928              AT END
350500210928                  SET SW01-STS-END                        TO TRUE
350600210928              NOT AT END
350700210928                  IF ALLOW-TRADING OF BUSINESS-DAYS = LT-Y
350800210928                      MOVE BUSINESS-DAY OF BUSINESS-DAYS  TO
350900210928                                           WS-NEXT-PROCESS-DATE
351000210928                      SET SW01-STS-FOUND                  TO TRUE
351100210928                  END-IF
351200210928            END-READ.
351300210928      * ---------------------------------
351400210928      * ---------------------------------
351500210928       END-JOB.
351600210928
351700210928      *    CLOSE       ACCOUNT-CONTRACT
351800210928      *                ACCOUNT-CONTRACT-INVESTMENT
351900210928      *                ACCOUNT-CONTRACT-RESET
352000210928      *                ACCOUNT-CONTRACT-RESET-R
352100210928      *                ACCOUNT-CONTRACT-INV-RESET
352200210928      *                ACCOUNT
352300210928      *                INVESTMENT
352400210928      *                INVESTMENT-UNIT-PRICE
352500210928      *                PROGRAM-EXCHANGE-RATE
352600210928      *                EXCHANGE-RATE-M
352700210928      *                CURRENCY-CODE
352800210928      *                INVESTOR-CHANGE-LOG
352900210928      *                CONTRACT-ERROR-LOG.
353000210928      *                BUSINESS-DAYS                                    RFS8712
353100210928
353200210928      * RFS49699 - Begin
353300210928
353400210928           MOVE "LOGARR"               to Pass-Screen-Code.
353500210928           MOVE "LOGARR"               to Pass-Edit-Code.
353600210928           MOVE "N"                    to Pass-Level-Code.
353700210928
353800210928           call "FXSCEDTAL1" using Pass-Screen-Code
353900210928                                   Pass-Edit-Code
354000210928                                   Pass-Level-Code
354100210928                                   Retn-Edit-Allowed-Flag.
354200210928
354300210928           cancel  "FXSCEDTAL1".
354400210928
354500210928           IF Retn-Edit-Allowed
354600210928               PERFORM ARRAY-LOGGING     THRU ARL-EXIT
354700210928           END-IF.
354800210928
354900210928      * RFS49699 - End
355000210928
355100210928      * RFS 58986 Begins
355200210928           IF Comm-NDRST-Edit = "Y"
355300210928             Move Ws-Old-GBV-Total TO Comm-Old-Guar-Base-Value
355400210928             Move WS-New-GBV-Total TO Comm-New-Guar-Base-Value
355500210928           END-IF.
355600210928      * RFS 58986 Ends
355700210928
355800210928           IF SQL-FILE-NOT-OPEN
355900210928              GO TO EOJ-EXIT
356000210928           END-IF.
356100210928
356200210928           EXEC SQL
356300210928                CLOSE SEGEXTSQ
356400210928           END-EXEC.
356500210928
356600210928           EXEC SQL
356700210928                WHENEVER SQLERROR GOTO EOJ-EXIT
356800210928           END-EXEC.
356900210928
357000210928           EXEC SQL
357100210928                WHENEVER NOT FOUND GOTO EOJ-EXIT
357200210928           END-EXEC.
357300210928
357400210928
357500210928       EOJ-EXIT.
357600210928           EXIT.
357700210928
357800210928      * RFS49699 - Begin call array logging if on!
357900210928
358000210928       ARRAY-LOGGING.
358100210928
358200210928           MOVE "SEGRESET"             TO  pp-Program-Name.
358300210928
358400210928           MOVE WS-ARRAY1-NAME         TO  pp-Array-Name.
358500210928           SET  WS-ARR-ACCCIP          TO  TRUE.
358600210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
358700210928           MOVE WS-ARRAY1-MAX          TO  pp-Max-Size.
358800210928           MOVE WS-ARRAY1-MAX-USED     TO  pp-Max-Size-Used.
358900210928           MOVE SPACES                 TO  rp-Err-Flag.
359000210928
359100210928           CALL "FXLOGAU"      using PR-FXLOGAU.
359200210928
359300210928           CANCEL  "FXLOGAU".
359400210928
359500210928       ARL-EXIT.
359600210928           EXIT.
359700210928
359800210928      * RFS49699 - End
359900210928
360000210928      * 57388 begin
360100210928       WRITE-CONTRACT-LOG.
360200210928           MOVE 0 TO WS-INSPECT-CNT.
360300210928           MOVE SPACES TO WS-RESET-NUMBER-C.
360400210928           MOVE COMM-RESET-NUMBER
360500210928             TO WS-RESET-NUMBER-C.
360600210928           INSPECT WS-RESET-NUMBER-C
360700210928                   TALLYING WS-INSPECT-CNT  FOR LEADING "0".
360800210928           MOVE WS-RESET-NUMBER-C(WS-INSPECT-CNT + 1:)
360900210928             TO WS-RESET-NUMBER-C.
361000210928           INITIALIZE MFACTCLP OF CONTRACT-CHANGE-LOG.
361100210928           MOVE INVESTOR-NO  OF ACCOUNT
361200210928             TO INVESTOR-NO  OF CONTRACT-CHANGE-LOG.
361300210928           MOVE ACCOUNT-NO   OF ACCOUNT
361400210928             TO ACCOUNT-NO   OF CONTRACT-CHANGE-LOG.
361500210928           CALL "GETDAT" USING WS-SYSDATE-N.
361600210928           ACCEPT WS-SYSTIME-LONG FROM TIME.
361700210928           MOVE WS-SYSDATE-N
361800210928             TO AUDIT-DATE   OF CONTRACT-CHANGE-LOG.
361900210928           MOVE WS-SYSTIME-LONG-N
362000210928             TO LOG-TIME     OF CONTRACT-CHANGE-LOG.
362100210928           MOVE "SEGRESET"
362200210928             TO AUDIT-USER   OF CONTRACT-CHANGE-LOG.
362300210928           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-RESET
362400210928             TO CONTRACT-NO  OF CONTRACT-CHANGE-LOG.
362500210928           STRING "GBV RESET # " DELIMITED BY SIZE
362600210928                  WS-RESET-NUMBER-C  DELIMITED BY SIZE
362700210928             INTO CHANGE-CATEGORY OF CONTRACT-CHANGE-LOG
362800210928      *RFS106211- Start
362900210928      *    IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "A"
363000210928           IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "A" OR "T"
363100210928      *RFS106211- End
363200210928             MOVE "SEGAUTORST"
363300210928               TO AUDIT-USER   OF CONTRACT-CHANGE-LOG
363400210928             STRING "AUTO RESET # " DELIMITED BY SIZE
363500210928                    WS-RESET-NUMBER-C  DELIMITED BY SIZE
363600210928               INTO CHANGE-CATEGORY OF CONTRACT-CHANGE-LOG
363700210928           END-IF.
36380021092880605      IF lb_AWDChanged_Yes
363900210928  |          MOVE "AWD Carr.Over"
364000210928  |             TO CHANGE-CATEGORY OF CONTRACT-CHANGE-LOG
364100210928  |          MOVE "ACCCGB" TO SCREEN-CODE OF INVESTOR-CHANGE-LOG-REC
364200210928  |          MOVE "ACCCGB" TO SCREEN-CODE OF CONTRACT-CHANGE-LOG-REC
364300210928  |          PERFORM Write_InvestorChgLog
36440021092880605      END-IF.
364500210928           WRITE CONTRACT-CHANGE-LOG-REC.
364600210928      * 57388 end
364700210928
364800210928      * RFS80605.11 - START
364900210928      *-------------------------
365000210928       Write_InvestorChgLog.
365100210928      *----*
365200210928      * Set investor-change-log    record
365300210928           MOVE 0 TO WS-INSPECT-CNT.
365400210928           MOVE SPACES TO WS-RESET-NUMBER-C.
365500210928           MOVE COMM-RESET-NUMBER
365600210928             TO WS-RESET-NUMBER-C.
365700210928           INSPECT WS-RESET-NUMBER-C
365800210928                   TALLYING WS-INSPECT-CNT  FOR LEADING "0".
365900210928           MOVE WS-RESET-NUMBER-C(WS-INSPECT-CNT + 1:)
366000210928             TO WS-RESET-NUMBER-C.
366100210928           INITIALIZE MFAIVRCLP OF INVESTOR-CHANGE-LOG.
366200210928           MOVE INVESTOR-NO  OF ACCOUNT
366300210928             TO INVESTOR-NO  OF INVESTOR-CHANGE-LOG-REC
366400210928           MOVE ACCOUNT-NO   OF ACCOUNT
366500210928             TO ACCOUNT-NO   OF INVESTOR-CHANGE-LOG-REC
366600210928           MOVE WS-SYSDATE-N
366700210928             TO AUDIT-DATE   OF INVESTOR-CHANGE-LOG-REC
366800210928           MOVE WS-SYSTIME-LONG-N
366900210928             TO LOG-TIME     OF INVESTOR-CHANGE-LOG-REC
367000210928           MOVE "SEGRESET"
367100210928             TO AUDIT-USER   OF INVESTOR-CHANGE-LOG-REC
367200210928           STRING "GDV RESET # " DELIMITED BY SIZE
367300210928                  WS-RESET-NUMBER-C  DELIMITED BY SIZE
367400210928             INTO CHANGE-CATEGORY OF INVESTOR-CHANGE-LOG-REC
367500210928      *RFS106211 - Start
367600210928      *    IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "A"
367700210928           IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "A" OR "T"
367800210928      *RFS106211 - End
367900210928             MOVE "SEGAUTORST"
368000210928               TO AUDIT-USER OF INVESTOR-CHANGE-LOG-REC
368100210928             STRING "AUTO RESET # " DELIMITED BY SIZE
368200210928                    WS-RESET-NUMBER-C  DELIMITED BY SIZE
368300210928               INTO CHANGE-CATEGORY OF INVESTOR-CHANGE-LOG-REC
368400210928           END-IF.
368500210928           IF lb_AWDchanged_Yes
368600210928             MOVE "ACCCGB" TO SCREEN-CODE OF INVESTOR-CHANGE-LOG-REC
368700210928             MOVE "AWD Carr.Over"
368800210928                TO CHANGE-CATEGORY OF INVESTOR-CHANGE-LOG-REC
368900210928           END-IF.
369000210928           WRITE INVESTOR-CHANGE-LOG-REC.
369100210928      * RFS80605.11 - END
369200210928
369300210928      * RFS180708 - Starts
369400210928
369500210928        READ-TRANSMISC.
369600210928
369700210928             MOVE SPACES           TO TRANS-SUB-TYPE OF EXCLUDE-TRANS.
369800210928             INITIALIZE MFATRNMSCP OF TRANS-MISC-DETAILS-REC.
369900210928             MOVE WS-PLACEMENTDATE TO PLACEMENT-DATE OF
370000210928                                      TRANS-MISC-DETAILS.
370100210928             MOVE WS-TRANSNO       TO TRANS-NO OF TRANS-MISC-DETAILS.
370200210928             READ TRANS-MISC-DETAILS
370300210928             INVALID KEY
370400210928                MOVE SPACES        TO TRANS-SUB-TYPE OF EXCLUDE-TRANS
370500210928             NOT INVALID KEY
370600210928                MOVE TRANS-SUB-TYPE OF TRANS-MISC-DETAILS TO
370700210928                     TRANS-SUB-TYPE OF EXCLUDE-TRANS
370800210928             END-READ.
370900210928
371000210928        READ-TRANSMISC-EXIT.
371100210928                 EXIT.
371200210928
371300210928      * RFS180708 - End
