000100210928       IDENTIFICATION DIVISION.
000200210928       PROGRAM-ID.    SEGRECALCP.
000300210928       AUTHOR.        RICHARD SALIRE.
000400210928       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000500210928       DATE-WRITTEN.  MAY 2001.
000600210928       DATE-COMPILED.
000700210928      *******************************************************************
000800210928      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
000900210928      *******************************************************************
001000210928      * R SALIRE   * 2001/09/05   * RFS 11396 - Fix adhoc 3002
001100210928      *            *              * Decimal data error.
001200210928      * F.Haji     * 2001/08/14   * RFS 8092 - Replace the existing
001300210928      *            *              * logic for determining the GBV and
001400210928      *            *              * NDV with the new table driven logic
001500210928      * F Haji     * 2001/08/28   * RFS 11255 - This RFS is Phase 2 of
001600210928      *            *              * RFS 8092. Exclude any transacaction
001700210928      *            *              * that meet the criteria on the
001800210928      *            *              * Exclude Transactions table
001900210928      *            *              * (i.e. AWD's and Buy-"top-up")
002000210928      *            *              * from GBV calculation.
002100210928      * R SALIRE   * 2001/09/25   * RFS 11593 - Fix for full and partial
002200210928      *            *              * depletion of contracts.  Gross-Amt
002300210928      *            *              * of the trade should be the Orig-Unit-Bal
002400210928      *            *              * of Trans-Contract-Details times the
002500210928      *            *              * Unit-Price of the trade.
002600210928      * R SALIRE   * 2001/10/10   * RFS 11622 - Use the unit-price prior
002700210928      *            *              * to trade-date of transaction if the
002800210928      *            *              * price on the trade-date doesn't exists.
002900210928      * R SALIRE   * 2001/10/16   * RFS 11698 - Recompile.
003000210928      *            *              * Changes made to copybook CPYSEGRTNE.
003100210928      *            *              * This will handle switches or transfers
003200210928      *            *              * from Non-Seg to Seg or vice-versa.
003300210928      * R SALIRE   * 2001/11/14   * RFS 12089 - Partial and full switch
003400210928      *            *              * for one fund on the same day resulting
003500210928      *            *              * incorrect GBV.
003600210928      *            *              * RFS 12145 - Recompile.
003700210928      *            *              * Changes made to copybook CPYSEGRTNE.
003800210928      * R SALIRE   * 2001/12/12   * RFS 12387 - Fix division by zero when
003900210928      *            *              * when calculating the percentage.
004000210928      * R SALIRE   * 2001/12/27   * RFS 12454 - Switches within the same
004100210928      *            *              * contract make GBV change.
004200210928      *            *              * Have to ensure that the percentage
004300210928      *            *              * total would equal to 100 percent.
004400210928      * R SALIRE   * 2002/01/31   * RFS 12702 - GBV is rounding incorrectly
004500210928      *            *              * with switch transactions.
004600210928      * Daisy Ly   *  2002/03/20  *  RFS 13185 - recompile
004700210928      * Fatema Haji*  2002/03/21  *  RFS 13331 - recompile
004800210928      * R SALIRE   * 2002/05/13   * RFS 13394 - New functionality to carry
004900210928      *            *              * over contract NDV/GBV onto Unitrax.
005000210928      * R Salire   * 2002/08/07   * RFS 14600 - Recompile
005100210928      * R SALIRE   * 2002/08/22   * RFS 13306 - Transfer in kind func
005200210928      * C. Carino  * 2002/10/03   * RFS 14407 - recompile for          *
005300210928      *                           *  ACCOUNT-ATTRIBUTE (MFAACCATP)
005400210928      * Ewa        * 2002/12/30   * RFS 15872 - Commented out the
005500210928      * Kolasinska *              * DISPLAY stat. used for debugging.
005600210928      * Daisy Ly   * 2003/07/11   * RFS 16512 - apply out/in trade
005700210928      *            *              * deduction to the GBV-CHANGES and
005800210928      *            *              * NBV-CHANGE for transfer/switches in
005900210928      * Fatema Haji*  2004/01/07  * RFS 19318 - recompile
006000210928      * Fatema Haji*  2004/09/09  * RFS 23824 - recompile
006100210928      * Frank Hong *  2005/05/17  * RFS 26151.
006200210928      *            *              * Modify the program to take into
006300210928      *            *              * account the number of units of transactions
006400210928      *            *              * that are in Exclude Transactions table
006500210928      *            *              * (RFEXCTRN) without affecting the Guaranteed
006600210928      *            *              * Base Value (GBV), Net Deposit Value (NDV),
006700210928      *            *              * Guaranteed Death Value (GDV) of the contract
006800210928      * Esin A.    *  2006/03/23  * RFS 31514 - Recompile only
006900210928      * Esin A.    *  2007/03/09  * RFS 40576 - Recompile only.
007000210928      * Esin A.    *  2007/05/14  * RFS 40872 - Fix the defect that
007100210928      *            *              * caused doubled GBV value while
007200210928      *            *              * resetting backdated reset
007300210928      *            *              * transactions
007400210928      * Raymond Mui*  2007/11/23  * RFS 45845 - Recompile only.
007500210928      * Emman. Yala* 2008/01/10   * RFS47227 - Recompile.
007600210928      * Bojana J.  *  2008/05/06  * RFS 51776 - recompile.
007700210928      * Bojana J.  *  2008/05/14  * RFS 47405 - Include CPGLWBRULE copy book.
007800210928      * Daniel M.  *  2008/05/23  * RFS 47405 - Include CPGLWBCKTT copy book.
007900210928      * Daniel M.  *  2008/06/12  * RFS 46707 - Changes to CPGLWBRULE.
008000210928      * Fatema Haji*  2008/08/18  * RFS 55960 - Recompile (MFAACCONP).
008100210928      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
008200210928      * Sanjeev P  *  2008/12/09  * RFS49898 - New DMD Maturity Option.
008300210928      * Bojana J.  * 2009/05/27   * RFS 57388 - Recompile (MFAACCCRP).
008400210928      * Pawel A    *  2010/07/30  * RFS84063 - Recompile (CPEXCLTRN)
008500210928      * Emman. Yala*  2011/02/23  * RFS91599 - Recompile (MFAACCCRP)80605
008600210928      *            *              * Replaced Implicit Join by Inner Join
008700210928      * Thilaga K. * 2011/04/12   * RFS 63488 - GLWB AND GDV Resets.
008800210928      *            *              * Change in Cursor SEGEXTSQ.
008900210928      *            *              * Replacing the existing logic for getting
009000210928      *            *              * Open Unit Balance by calling FXGETFMV.
009100210928      * Thilaga K  * 2012/08/13   * RFS107585- Recompile for MFASGSTOP
009200210928      * Venkatesh C* 2012/10/19   * RFS117298 - Recompile for MFAACCONP
009300210928      * Ambikapathy* 2012/12/14   * RFS112135 - Recompile for MFASGSTOP
009400210928      * Abhisek M  * 2013/04/01   * RFS120002 - Recompile for MFATRACXP
009500210928      * PREMIL K   * 2013/07/17   * RFS110904 - PREFORM GDV RESET AND
009600210928      *                           * REVERSE RESET.
009700210928      * Andy Chan  * 2013/08/29   * RFS127401 - Recompile due to CPYEXCLTRN
009800210928      * Thilaga K   * 2014/01/21 * RFS133150 - Recompile for MFATRCODP
009900210928      * Arthy K     * 2014/04/03 * RFS134936 - Recompile for MFAACCONP
010000210928      * Manjusha V * 2014/04/01  * RFS129902 - Recompile for CPGLWBRULE
010100210928      * Kamal T    * 2014/06/17  * RFS118472 - Recompile for CPGLWBRULE
010200210928      * Vinsfy J   * 2014/06/17  * RFS136634 - Recompile
010300210928      * Nagamnai S * 2014/08/13  * RFS139007 - Recompile for CPGLWBRULE
010400210928      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
010500210928      * CHAYA SP   * 2020/06/30   * RFS185172 - Recompile for MFAACCONP
010600210928      * Vignesh    *  2020/06/25  * RFS183812 - Recompile for MFASGSTOP
010700210928      * VIGNESH    * 2020/07/15   * RFS185171 -Recompile for MFAEXTRNP
010800210928      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
010900210928      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
011000210928      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
011100210928      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
011200210928      * Kavin      * 2021/01/05   * RFS180708 - Added MFATRNMSCP file
011300210928      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
011301211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
011302211007      *            *              * Array from 100 to 1000
011303211007      *            *              * Tagged as 111744
011400210928      *******************************************************************
011500210928      *===============================================================*
011600210928      * Important: IMPORTANT TO ALL PROGRAMMERS
011700210928      *
011800210928      * If any programmer creates, changes or deletes an array in this
011900210928      * programs please add the logic to support the array logging process!
012000210928      *
012100210928      * View the WS-ARRAY-LOG-MISC variables and the code associated with
012200210928      * RFS49699.
012300210928      *
012400210928      * This change is for audit purposes, it logs the
012500210928      * name of the array, max size, size used. At the end of
012600210928      * this program the array information is passed to FXLOGUA pgm,
012700210928      * which write this information to the MFALOGAUP array audit file!
012800210928      *
012900210928      *===============================================================*
013000210928       ENVIRONMENT DIVISION.
013100210928       CONFIGURATION SECTION.
013200210928       SOURCE-COMPUTER. IBM-AS400.
013300210928       OBJECT-COMPUTER. IBM-AS400.
013400210928       SPECIAL-NAMES.
013500210928           LOCAL-DATA IS WS-LOCAL.
013600210928      /
013700210928       INPUT-OUTPUT SECTION.
013800210928       FILE-CONTROL.
013900210928
014000210928           SELECT  TRANS-DAILY-PROC-SEQ
014100210928                   ASSIGN TO DATABASE-MFATRDPSP
014200210928                   ORGANIZATION IS SEQUENTIAL
014300210928                   ACCESS IS SEQUENTIAL.
014400210928
014500210928           SELECT  ACCOUNT-CONTRACT
014600210928                   ASSIGN TO DATABASE-MFAACCONP
014700210928                   ORGANIZATION IS INDEXED
014800210928                   ACCESS IS DYNAMIC
014900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015000210928
015100210928           SELECT  ACCOUNT-CONTRACT-INVESTMENT
015200210928                   ASSIGN TO DATABASE-MFAACCCIP
015300210928                   ORGANIZATION IS INDEXED
015400210928                   ACCESS IS DYNAMIC
015500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015600210928
015700210928           SELECT  ACCOUNT-CONTRACT-INVEST-SWI
015800210928                   ASSIGN TO DATABASE-MFAACCCIP
015900210928                   ORGANIZATION IS INDEXED
016000210928                   ACCESS IS DYNAMIC
016100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016200210928
016300210928           SELECT  ACCOUNT-CONTRACT-INVEST-R
016400210928                   ASSIGN TO DATABASE-MFAACCCIP
016500210928                   ORGANIZATION IS INDEXED
016600210928                   ACCESS IS DYNAMIC
016700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016800210928
016900210928           SELECT  ACCOUNT-CONTRACT-RESET
017000210928                   ASSIGN TO DATABASE-MFAACCCRP
017100210928                   ORGANIZATION IS INDEXED
017200210928                   ACCESS IS DYNAMIC
017300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017400210928
017500210928           SELECT  ACCOUNT-CONTRACT-INV-RESET
017600210928                   ASSIGN TO DATABASE-MFAACCCIRP
017700210928                   ORGANIZATION IS INDEXED
017800210928                   ACCESS IS DYNAMIC
017900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018000210928
018100210928           SELECT  ACCOUNT
018200210928                   ASSIGN TO DATABASE-MFAACCNTP
018300210928                   ORGANIZATION IS INDEXED
018400210928                   ACCESS IS DYNAMIC
018500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018600210928
018700210928RF8092     SELECT  ACCOUNT-NOMINEE
018800210928RF8092             ASSIGN TO DATABASE-MFAACCNMP
018900210928RF8092             ORGANIZATION IS INDEXED
019000210928RF8092             ACCESS IS DYNAMIC
019100210928RF8092             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019200210928      /
019300210928RF8092     SELECT  TRANS-OFFSET
019400210928RF8092             ASSIGN TO DATABASE-MFATRNP
019500210928RF8092             ORGANIZATION IS INDEXED
019600210928RF8092             ACCESS IS DYNAMIC
019700210928RF8092             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019800210928      /
019900210928RF8092     SELECT  TRANS-TARGET
020000210928RF8092             ASSIGN TO DATABASE-MFATRNTGP
020100210928RF8092             ORGANIZATION IS INDEXED
020200210928RF8092             ACCESS IS DYNAMIC
020300210928RF8092             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020400210928      /
020500210928RF8092     SELECT  TRANS-TARGET-2
020600210928RF8092             ASSIGN TO DATABASE-MFATRNTGLA
020700210928RF8092             ORGANIZATION IS INDEXED
020800210928RF8092             ACCESS IS DYNAMIC
020900210928RF8092             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021000210928      /
021100210928           SELECT  INVESTMENT
021200210928                   ASSIGN TO DATABASE-MFAINVP
021300210928                   ORGANIZATION IS INDEXED
021400210928                   ACCESS IS DYNAMIC
021500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021600210928
021700210928           SELECT  INVESTMENT-UNIT-PRICE
021800210928                   ASSIGN TO DATABASE-MFAINVUPLB
021900210928                   ORGANIZATION IS INDEXED
022000210928                   ACCESS IS DYNAMIC
022100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
022200210928                   WITH DUPLICATES.
022300210928
022400210928           SELECT  PROGRAM-EXCHANGE-RATE
022500210928                   ASSIGN TO DATABASE-MFAPRGERP
022600210928                   ORGANIZATION IS INDEXED
022700210928                   ACCESS IS DYNAMIC
022800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022900210928
023000210928           SELECT  EXCHANGE-RATE-M-2
023100210928                   ASSIGN TO DATABASE-MFAEXRHMP
023200210928                   ORGANIZATION IS INDEXED
023300210928                   ACCESS IS DYNAMIC
023400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023500210928
023600210928           SELECT  CURRENCY-CODE
023700210928                   ASSIGN TO DATABASE-MFACURP
023800210928                   ORGANIZATION IS INDEXED
023900210928                   ACCESS IS DYNAMIC
024000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024100210928
024200210928           SELECT  CONTRACT-ERROR-LOG
024300210928                   ASSIGN TO DATABASE-MFACTERRP
024400210928                   ORGANIZATION IS INDEXED
024500210928                   ACCESS IS DYNAMIC
024600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
024700210928                   WITH DUPLICATES.
024800210928
024900210928           SELECT  TRANS-R
025000210928                   ASSIGN TO DATABASE-MFATRNLN
025100210928                   ORGANIZATION IS INDEXED
025200210928                   ACCESS IS DYNAMIC
025300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
025400210928                   WITH DUPLICATES.
025500210928      /
025600210928           SELECT  TRANS-GBV
025700210928                   ASSIGN TO DATABASE-MFATRNLN
025800210928                   ORGANIZATION IS INDEXED
025900210928                   ACCESS IS DYNAMIC
026000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
026100210928                   WITH DUPLICATES.
026200210928      /
026300210928RF8092     SELECT  SEG-TRANSFER-OPTIONS
026400210928RF8092             ASSIGN TO DATABASE-MFATRFOPP
026500210928RF8092             ORGANIZATION IS INDEXED
026600210928RF8092             ACCESS IS DYNAMIC
026700210928RF8092             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
026800210928      /
026900210928           SELECT  TRANS
027000210928                   ASSIGN TO DATABASE-MFATRNP
027100210928                   ORGANIZATION IS INDEXED
027200210928                   ACCESS IS DYNAMIC
027300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
027400210928      /
027500210928           SELECT  TRANS-EXCHANGE-RATE-2
027600210928                   ASSIGN TO DATABASE-MFATREXRP
027700210928                   ORGANIZATION IS INDEXED
027800210928                   ACCESS IS DYNAMIC
027900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028000210928      /
028100210928           SELECT  TRANS-CONTRACT-DTL-R
028200210928                   ASSIGN TO DATABASE-MFATRCODP
028300210928                   ORGANIZATION IS INDEXED
028400210928                   ACCESS IS DYNAMIC
028500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028600210928      /
028700210928           SELECT  BUSINESS-DAYS
028800210928                   ASSIGN TO DATABASE-MFABUSDAP
028900210928                   ORGANIZATION IS INDEXED
029000210928                   ACCESS IS DYNAMIC
029100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029200210928      /
029300210928           SELECT  TRANS-CONTRACT-DETAILS
029400210928                   ASSIGN TO DATABASE-MFATRCODP
029500210928                   ORGANIZATION IS INDEXED
029600210928                   ACCESS IS DYNAMIC
029700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029800210928      /
029900210928R11255     SELECT  EXCLUDE-TRANS
030000210928R11255             ASSIGN TO DATABASE-MFAEXTRNP
030100210928R11255             ORGANIZATION IS INDEXED
030200210928R11255             ACCESS IS DYNAMIC
030300210928R11255             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
030400210928      /
030500210928R11255     SELECT  ACCOUNT-ATTRIBUTES
030600210928R11255             ASSIGN TO DATABASE-MFAACCATP
030700210928R11255             ORGANIZATION IS INDEXED
030800210928R11255             ACCESS IS DYNAMIC
030900210928R11255             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031000210928      /
031100210928R11622     SELECT  INVESTMENT-UNIT-PRICE-LAST
031200210928R11622             ASSIGN TO DATABASE-MFAINVUPLB
031300210928R11622             ORGANIZATION IS INDEXED
031400210928R11622             ACCESS IS DYNAMIC
031500210928R11622             RECORD IS EXTERNALLY-DESCRIBED-KEY
031600210928R11622               WITH DUPLICATES.
031700210928      /
031800210928R12702     SELECT  ACCOUNT-CONTRACT-INVEST
031900210928R12702             ASSIGN TO DATABASE-MFAACCCIP
032000210928R12702             ORGANIZATION IS INDEXED
032100210928R12702             ACCESS IS DYNAMIC
032200210928R12702             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
032300210928      /
032400210928R13394     SELECT  TRANS-GBV-TRANSFER
032500210928R13394             ASSIGN TO DATABASE-MFATRACXP
032600210928R13394             ORGANIZATION IS INDEXED
032700210928R13394             ACCESS IS DYNAMIC
032800210928R13394             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
032900210928
033000210928R13306     SELECT  SEG-SWITCH-TRF-OPT
033100210928R13306             ASSIGN TO DATABASE-MFASGSTOP
033200210928R13306             ORGANIZATION IS INDEXED
033300210928R13306             ACCESS IS DYNAMIC
033400210928R13306             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
033500210928
033600210928R13306     SELECT  TRANS-CONTRACT-TARGET2
033700210928R13306             ASSIGN TO DATABASE-MFATRCTGLA
033800210928R13306             ORGANIZATION IS INDEXED
033900210928R13306             ACCESS IS DYNAMIC
034000210928R13306             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
034100210928
03420021092816512      SELECT  TRANS-CHARGES
03430021092816512              ASSIGN TO DATABASE-MFATRNCHP
03440021092816512              ORGANIZATION IS INDEXED
03450021092816512              ACCESS IS DYNAMIC
03460021092816512              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
034700210928
03480021092816512      SELECT  TRANS-SEG-DEDUCTION-CODES
03490021092816512              ASSIGN TO DATABASE-MFATRNSDCP
03500021092816512              ORGANIZATION IS INDEXED
03510021092816512              ACCESS IS DYNAMIC
03520021092816512              RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
035300210928
035400210928      *RFS110904 - START
035500210928           SELECT  INVESTMENT-STRUCTURE-XREF
035600210928                   ASSIGN TO DATABASE-MFAINVSXP
035700210928                   ORGANIZATION IS INDEXED
035800210928                   ACCESS IS DYNAMIC
035900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
036000210928      *RFS110904 - END
036100210928
036200210928      *RFS180708 - Start
036300210928           SELECT  TRANS-MISC-DETAILS
036400210928                   ASSIGN TO DATABASE-MFATRNMSCP
036500210928                   ORGANIZATION IS INDEXED
036600210928                   ACCESS IS DYNAMIC
036700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
036800210928
036900210928           SELECT  TRANS-REDEM-DETAILS
037000210928                   ASSIGN TO DATABASE-MFATRNREP
037100210928                   ORGANIZATION IS INDEXED
037200210928                   ACCESS IS DYNAMIC
037300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
037400210928      *RFS180708 - End
037500210928
037600210928       DATA DIVISION.
037700210928       FILE SECTION.
037800210928       FD  TRANS-DAILY-PROC-SEQ
037900210928           LABEL RECORDS ARE STANDARD.
038000210928       01  TRANS-DLY-PROC-REC.    COPY DD-ALL-FORMATS OF MFATRDPSP.
038100210928      /
038200210928       FD  TRANS-TARGET
038300210928           LABEL RECORDS ARE STANDARD.
038400210928       01  TRANS-TARGET-REC.
038500210928                                  COPY DD-ALL-FORMATS OF MFATRNTGP.
038600210928      /
038700210928       FD  TRANS-TARGET-2
038800210928           LABEL RECORDS ARE STANDARD.
038900210928       01  TRANS-TARGET-2-REC.
039000210928                                  COPY DD-ALL-FORMATS OF MFATRNTGLA.
039100210928      /
039200210928       FD  ACCOUNT-CONTRACT
039300210928           LABEL RECORDS ARE STANDARD.
039400210928       01  ACC-CON-REC.           COPY DD-ALL-FORMATS OF MFAACCONP.
039500210928      /
039600210928       FD  ACCOUNT-CONTRACT-INVESTMENT
039700210928           LABEL RECORDS ARE STANDARD.
039800210928       01  ACC-CON-INV-REC.       COPY DD-ALL-FORMATS OF MFAACCCIP.
039900210928      /
040000210928       FD  ACCOUNT-CONTRACT-INVEST-SWI
040100210928           LABEL RECORDS ARE STANDARD.
040200210928       01  ACC-CON-INV-SWI-REC.   COPY DD-ALL-FORMATS OF MFAACCCIP.
040300210928
040400210928       FD  ACCOUNT-CONTRACT-INVEST-R
040500210928           LABEL RECORDS ARE STANDARD.
040600210928       01  ACC-CON-INV-R-REC.     COPY DD-ALL-FORMATS OF MFAACCCIP.
040700210928      /
040800210928       FD  ACCOUNT-CONTRACT-RESET
040900210928           LABEL RECORDS ARE STANDARD.
041000210928       01  ACC-CON-RESET-REC.     COPY DD-ALL-FORMATS OF MFAACCCRP.
041100210928      /
041200210928       FD  ACCOUNT-CONTRACT-INV-RESET
041300210928           LABEL RECORDS ARE STANDARD.
041400210928       01  ACC-CON-INV-RESET-REC. COPY DD-ALL-FORMATS OF MFAACCCIRP.
041500210928      /
041600210928       FD  ACCOUNT
041700210928           LABEL RECORDS ARE STANDARD.
041800210928       01  ACCOUNT-REC.           COPY DD-ALL-FORMATS OF MFAACCNTP.
041900210928      /
042000210928RF8092 FD  ACCOUNT-NOMINEE
042100210928RF8092     LABEL RECORDS ARE STANDARD.
042200210928RF8092 01  ACCOUNT-NOMINEE-REC.   COPY DD-ALL-FORMATS OF MFAACCNMP.
042300210928      /
042400210928RF8092 FD  TRANS-OFFSET
042500210928RF8092     LABEL RECORDS ARE STANDARD.
042600210928RF8092 01  TRANS-2-REC.           COPY DD-ALL-FORMATS OF MFATRNP.
042700210928      /
042800210928       FD  INVESTMENT
042900210928           LABEL RECORDS ARE STANDARD.
043000210928       01  INVESTMENT-REC.        COPY DD-ALL-FORMATS OF MFAINVP.
043100210928      /
043200210928       FD  INVESTMENT-UNIT-PRICE
043300210928           LABEL RECORDS ARE STANDARD.
043400210928       01  IUP-REC.               COPY DD-ALL-FORMATS OF MFAINVUPLB.
043500210928      /
043600210928       FD  PROGRAM-EXCHANGE-RATE
043700210928           LABEL RECORDS ARE STANDARD.
043800210928       01  PROG-EXCH-RATE-REC.    COPY DD-ALL-FORMATS OF MFAPRGERP.
043900210928      /
044000210928       FD  EXCHANGE-RATE-M-2
044100210928           LABEL RECORDS ARE STANDARD.
044200210928       01  EXCHANGE-RATE-M-2-REC. COPY DD-ALL-FORMATS OF MFAEXRHMP.
044300210928      /
044400210928       FD  CURRENCY-CODE
044500210928           LABEL RECORDS ARE STANDARD.
044600210928       01  CURRENCY-CODE-REC.     COPY DD-ALL-FORMATS OF MFACURP.
044700210928      /
044800210928       FD  CONTRACT-ERROR-LOG
044900210928           LABEL RECORDS ARE STANDARD.
045000210928       01  CONT-ERR-LOG-REC.      COPY DD-ALL-FORMATS OF MFACTERRP.
045100210928      /
045200210928       FD  TRANS-R
045300210928           LABEL RECORDS ARE STANDARD.
045400210928       01  TRANS-R-REC.           COPY DD-ALL-FORMATS OF MFATRNLN.
045500210928      /
045600210928       FD  TRANS-GBV
045700210928           LABEL RECORDS ARE STANDARD.
045800210928       01  TRANS-GBV-REC.         COPY DD-ALL-FORMATS OF MFATRNLN.
045900210928      /
046000210928       FD  TRANS
046100210928           LABEL RECORDS ARE STANDARD.
046200210928       01  TRANS-REC.          COPY DD-ALL-FORMATS OF MFATRNP.
046300210928      /
046400210928       FD  TRANS-EXCHANGE-RATE-2
046500210928           LABEL RECORDS ARE STANDARD.
046600210928       01  TRANS-EXCHANGE-RATE-2-REC. COPY DD-ALL-FORMATS OF MFATREXRP.
046700210928      /
046800210928       FD  TRANS-CONTRACT-DTL-R
046900210928           LABEL RECORDS ARE STANDARD.
047000210928       01  TRANS-CONT-DTL-R-REC.      COPY DD-ALL-FORMATS OF MFATRCODP.
047100210928      /
047200210928RF8092 FD  SEG-TRANSFER-OPTIONS
047300210928RF8092     LABEL RECORDS ARE STANDARD.
047400210928RF8092 01  SEG-TRANSFER-OPTIONS-REC.  COPY DD-ALL-FORMATS OF MFATRFOPP.
047500210928      /
047600210928       FD  BUSINESS-DAYS
047700210928           LABEL RECORDS ARE STANDARD.
047800210928       01  BUSINESS-DAYS-REC.         COPY DD-ALL-FORMATS OF MFABUSDAP.
047900210928      /
048000210928       FD  TRANS-CONTRACT-DETAILS
048100210928           LABEL RECORDS ARE STANDARD.
048200210928       01  TRANS-CON-DTL-REC.       COPY DD-ALL-FORMATS OF MFATRCODP.
048300210928      /
048400210928R11255 FD  ACCOUNT-ATTRIBUTES
048500210928R11255     LABEL RECORDS ARE STANDARD.
048600210928R11255 01  ACCOUNT-ATT-REC.           COPY DD-ALL-FORMATS OF MFAACCATP.
048700210928      /
048800210928R11255 FD  EXCLUDE-TRANS
048900210928R11255     LABEL RECORDS ARE STANDARD.
049000210928R11255 01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
049100210928      /
049200210928R11622 FD  INVESTMENT-UNIT-PRICE-LAST
049300210928R11622     LABEL RECORDS ARE STANDARD.
049400210928R11622 01  INVESTMENT-LAST-PRICE-REC. COPY DD-ALL-FORMATS OF MFAINVUPLB.
049500210928      /
049600210928R12702 FD  ACCOUNT-CONTRACT-INVEST
049700210928R12702     LABEL RECORDS ARE STANDARD.
049800210928R12702 01  ACCT-CONT-INVEST-REC.  COPY DD-ALL-FORMATS OF MFAACCCIP.
049900210928      /
050000210928R13394 FD  TRANS-GBV-TRANSFER
050100210928R13394     LABEL RECORDS ARE STANDARD.
050200210928R13394 01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
050300210928
050400210928R13306 FD  SEG-SWITCH-TRF-OPT
050500210928R13306     LABEL RECORDS ARE STANDARD.
050600210928R13306 01  SEG-SWITCH-TRF-OPT-REC.    COPY DD-ALL-FORMATS OF MFASGSTOP.
050700210928
050800210928R13306 FD  TRANS-CONTRACT-TARGET2
050900210928R13306     LABEL RECORDS ARE STANDARD.
051000210928R13306 01  TRANS-CONTRACT-TGT-REC.   COPY DD-ALL-FORMATS OF MFATRCTGLA.
051100210928
05120021092816512  FD  TRANS-CHARGES
05130021092816512      LABEL RECORDS ARE STANDARD.
05140021092816512  01  TRANS-CHARGES-REC.        COPY DD-ALL-FORMATS OF MFATRNCHP.
051500210928
05160021092816512  FD  TRANS-SEG-DEDUCTION-CODES
05170021092816512      LABEL RECORDS ARE STANDARD.
05180021092816512  01  TRANS-SEG-DEDUCTION-CODES-REC.
051900210928                         COPY DD-ALL-FORMATS OF MFATRNSDCP.
052000210928
052100210928      *RFS110904 - START
052200210928       FD  INVESTMENT-STRUCTURE-XREF
052300210928           LABEL RECORDS ARE STANDARD.
052400210928       01  INV-STRU-XREF-REC. COPY DD-ALL-FORMATS OF MFAINVSXP.
052500210928      *RFS110904 - END
052600210928
052700210928      *RFS180708 - Start
052800210928       FD  TRANS-MISC-DETAILS
052900210928           LABEL RECORDS ARE STANDARD.
053000210928       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
053100210928
053200210928       FD  TRANS-REDEM-DETAILS
053300210928           LABEL RECORDS ARE STANDARD.
053400210928       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
053500210928      *RFS180708 - End
053600210928
053700210928       WORKING-STORAGE SECTION.
053800210928
053900210928      * Copybooks
054000210928
054100210928      * RFS49699 - Begin
054200210928
054300210928      *  screen edits allowed
054400210928           copy CPSCEDTAL1.
054500210928
054600210928      *  log array info
054700210928           copy CPFXLOGAU.
054800210928
054900210928      *  log array table name
055000210928           copy CPFXLOGAT.
055100210928
055200210928      * RFS49699 - End
055300210928
055400210928           EXEC SQL
055500210928                INCLUDE SQLCA
055600210928           END-EXEC.
055700210928
055800210928       01  CURR-CONTROLS.
055900210928          03 CURR-LEVEL1             PIC X(1).
056000210928
056100210928       01  PREV-CONTROLS.
056200210928          03 PREV-LEVEL1             PIC X(1).
056300210928
056400210928       01  PROG-ID-CODE              PIC X(10) VALUE "SEGRECALCP".
056500210928
056600210928       01  OPEN-FILES-ONCE           PIC X(1)  VALUE "Y".
056700210928
056800210928       01  EXCLUDE-TRANS-FLAG        PIC X(1).
056900210928
057000210928       01  UNITRAX-BASE-CURRENCY     PIC X(3)  VALUE " ".
057100210928
057200210928       01  PROG-EXCHANGE-RATE-TYPE   PIC X     VALUE " ".
057300210928
057400210928       01 SW01-SWITCHES.                                                RFS8712
057500210928          05 SW01-STS-FLAG                       PIC X(01).             RFS8712
057600210928             88 SW01-STS-OK                      VALUE " ".             RFS8712
057700210928             88 SW01-STS-OPEN                    VALUE "1".             RFS8712
057800210928             88 SW01-STS-START                   VALUE "2".             RFS8712
057900210928             88 SW01-STS-READ                    VALUE "3".             RFS8712
058000210928             88 SW01-STS-REWRITE                 VALUE "4".             RFS8712
058100210928             88 SW01-STS-WRITE                   VALUE "5".             RFS8712
058200210928             88 SW01-STS-DELETE                  VALUE "6".             RFS8712
058300210928             88 SW01-STS-END                     VALUE "7".             RFS8712
058400210928             88 SW01-STS-CLOSE                   VALUE "8".             RFS8712
058500210928             88 SW01-STS-RANGE                   VALUE "9".             RFS8712
058600210928             88 SW01-STS-FOUND                   VALUE "A".             RFS8712
058700210928             88 SW01-STS-FAIL                    VALUE "*".             RFS8712
058800210928
058900210928       01  WS-MISC-FIELDS.
059000210928           05 WS-NEW-GUAR-BASE-VALUE   PIC S9(11)V99 COMP-3 VALUE 0.
059100210928           05 WS-NEW-GUAR-BASE-VAL-CUR PIC S9(11)V99 COMP-3 VALUE 0.
059200210928           05 WS-CURR-UNIT-BAL         PIC S9(10)V999 COMP-3 VALUE 0.
059300210928           05 WS-REJECTION-CODE        PIC X(3).
059400210928           05 WS-EXCHANGE-FOUND        PIC X(1).
059500210928      * Exchange variables
059600210928           05 WS-EXCH-PLACEMENT-DATE   PIC S9(10)      COMP-3.
059700210928           05 WS-EXCH-TRANS-NO         PIC S9(10)      COMP-3.
059800210928           05 WS-EXCH-CURRENCY         PIC X(3).
059900210928           05 WS-EXCH-TRADE-DATE       PIC 9(8).
060000210928           05 WS-EXCH-RATE             PIC S9(2)V9(7)  COMP-3.
060100210928           05 WS-EXCH-RATE-VALUE       PIC S9(2)V9(7)  COMP-3.
060200210928           05 WS-CURR-TRANS-UNIT-AMT   PIC S9(10)V9(3) COMP-3.
060300210928           05 WS-CURR-TRANS-UNIT-PRICE PIC S9(5)V9(4) COMP-3.
060400210928           05 WS-CURR-TRANS-TRADE-DATE PIC 9(8).
060500210928           05 WS-CURR-TRANS-GROSS-AMT  PIC S9(11)V9(2) COMP-3.
060600210928           05 WS-CURR-TRANS-NET-AMT    PIC S9(11)V9(2) COMP-3.
060700210928           05 WS-CURR-TRANS-AMT        PIC S9(11)V9(2) COMP-3.
060800210928           05 WS-CURR-TRANS-AMT-CUR    PIC S9(11)V9(2) COMP-3.
060900210928           05 WS-CURR-TRANS-PLACEMENT-DATE PIC 9(8).
061000210928           05 WS-CURR-TRANS-TRANS-NO   PIC S9(10)      COMP-3.
061100210928           05 WS-CURR-ORIG-UNIT-BAL    PIC S9(10)V9(3) COMP-3.
061200210928
061300210928R16512     05 WS-BYPASS-DEDUCTION      PIC X.
061400210928R16512     05 WS-DEDUCTION-AMT         PIC S9(11)V9(2) COMP-3.
061500210928R16512     05 WS-DEDUCTION-PROP        PIC S9(10)V9(8) COMP-3.
061600210928R16512     05 WS-DEDUCTION-GBV-CHANGE  PIC S9(10)V9(8) COMP-3.
061700210928R16512     05 WS-DEDUCTION-NDV-CHANGE  PIC S9(10)V9(8) COMP-3.
061800210928R16512     05 WS-IN-DEDUCTION-AMT      PIC S9(11)V9(2) COMP-3.
061900210928R16512     05 WS-OUT-TRANS-GROSS       PIC S9(11)V9(2) COMP-3.
062000210928R16512     05 WS-IN-TRANS-GROSS        PIC S9(11)V9(2) COMP-3.
062100210928R16512     05 WS-FROM-GROSS-AMT        PIC S9(11)V9(2) COMP-3.
062200210928R16512     05 WS-TRN-AMT               PIC S9(11)V9(2) COMP-3.
062300210928R16512     05 WS-TRN-PROCESS-DATE      PIC 9(08) VALUE 0.
062400210928R16512     05 WS-TRN-PLACEMENT-DATE    PIC 9(08) VALUE 0.
062500210928R16512     05 WS-TRN-TRANS-NO          PIC 9(09) VALUE 0.
062600210928
062700210928           05 WS-SYSDATE.
062800210928              10 WS-SYSDATE-CC         PIC 99.
062900210928              10 WS-SYSDATE-YMD.
063000210928                 15 WS-SYSDATE-YY      PIC 99.
063100210928                 15 WS-SYSDATE-MM      PIC 99.
063200210928                 15 WS-SYSDATE-DD      PIC 99.
063300210928           05 WS-SYSDATE-N REDEFINES WS-SYSDATE
063400210928                                       PIC 9(8).
063500210928
063600210928           05 WS-SYSTIME-LONG.
063700210928              10 WS-SYSTIME.
063800210928                 15 WS-SYSTIME-HH      PIC 99.
063900210928                 15 WS-SYSTIME-MI      PIC 99.
064000210928                 15 WS-SYSTIME-SS      PIC 99.
064100210928              10 WS-SYSTIME-N REDEFINES WS-SYSTIME
064200210928                                       PIC 9(6).
064300210928              10 WS-SYSTIME-2 REDEFINES WS-SYSTIME
064400210928                                       PIC 9(4).
064500210928              10 WS-SYSTIME-HS         PIC 99.
064600210928
064700210928            05 WS-SYSTIME-LONG-N REDEFINES WS-SYSTIME-LONG
064800210928                                       PIC 9(8).
064900210928
065000210928            05 WS-MISC-INFO-AREA       PIC X(40).
065100210928
065200210928            05 WS-MISC-INFO-1 REDEFINES WS-MISC-INFO-AREA.
065300210928              10 WS-MISC-INFO-1-NAME   PIC X(20).
065400210928              10 WS-MISC-INFO-1-UNIT   PIC -9(10).9(3).
065500210928
065600210928            05 WS-MISC-INFO-2 REDEFINES WS-MISC-INFO-AREA.
065700210928              10 WS-MISC-INFO-2-NAME   PIC X(11).
065800210928              10 WS-MISC-INFO-2-NKEY-1 PIC X(6).
065900210928              10 WS-MISC-INFO-2-KEY-1  PIC 9(8).
066000210928              10 WS-MISC-INFO-2-NKEY-2 PIC X(6).
066100210928              10 WS-MISC-INFO-2-KEY-2  PIC 9(9).
066200210928
066300210928      /
066400210928       01 TRANSACTION-CATEGORIES.
066500210928          05 TRANS-CATEGORY              PIC X(3).
066600210928             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI".
066700210928             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
066800210928             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO"
066900210928                                                "TFE" "CQD" "FEE" "SAJ".
067000210928             88 SWITCH-OUT-TRANSACTION   VALUES "SWO" "TRO".
067100210928             88 ADDITION-TRANSACTION     VALUES "BUY" "INC" "CPG"
067200210928                                                "SWI" "TRI" "INT"
067300210928                                                "MFR" "SSD" "SSU" "BAJ"
067400210928                                                "BFW".
067500210928             88 REDUCTION-TRANSACTION    VALUES "SEL" "SWO" "TRO"
067600210928                                                "TFE" "CQD" "FEE" "SAJ".
067700210928             88 VALID-TRANSACTION        VALUES "BUY" "SEL" "SWI"
06780021092826151                                           "MFR"
067900210928                                                "SWO" "TRI" "TRO".
068000210928             88 SWITCH-IN                VALUE "SWI".
068100210928             88 SWITCH-OUT               VALUE "SWO".
068200210928             88 TRANSFER-IN              VALUE "TRI".
068300210928             88 TRANSFER-OUT             VALUE "TRO".
068400210928             88 BUY-TRANSACTION          VALUE "BUY".
06850021092826151        88 MAN-FEE-REB-TRANSACTION  VALUE "MFR".
068600210928
068700210928       01 TRANSACTION-STATUS-CATEGORIES.
068800210928          05 TRANS-STATUS-CATEGORY       PIC X(3).
068900210928             88 HISTORY                  VALUES "HST" "HSC".
069000210928             88 HISTORY-CONVERSION       VALUES "HSC".
069100210928             88 PENDING                  VALUES "PND" "VER".
069200210928             88 CONTRACTED               VALUES "CON".
069300210928             88 UNCONFIRMED              VALUES "UNC".
069400210928             88 CANCELLED                VALUES "CAN".
069500210928             88 SETTLED                  VALUES "SET".
069600210928             88 RVSD                     VALUES "RVS".
069700210928
069800210928107585 01 lc-TransferGDV                    PIC X(01).
069900210928
070000210928       01 TRANSACTION-REVERSE-CATEGORIES.
070100210928          05 TRANS-REVERSE-CATEGORY      PIC X(1).
070200210928             88 TRANS-REVERSED           VALUES "Y".
070300210928
070400210928       01 OLD-INVRIDX                    PIC 9(2) VALUE 0.
070500210928
070600210928       01 WS-ACC-CONT-INV-RESET-ARRAYX.
070700210928          05 WS-ACC-CONT-INV-RESET-ARRAY OCCURS 100 TIMES
070800210928                                         INDEXED BY INVRIDX.
070900210928             10 WS-ARRAY-INVR-ACCOUNT-NO   PIC 9(09).
071000210928             10 WS-ARRAY-INVR-CONTRACT-NO  PIC 9(09).
071100210928             10 WS-ARRAY-INVR-INVEST-CODE  PIC X(05).
071200210928             10 WS-ARRAY-INVR-RESET-NO     PIC 9(02).
071300210928             10 WS-ARRAY-INVR-UNIT-BAL     PIC S9(10)V9(3) COMP-3.
071400210928             10 WS-ARRAY-INVR-GBV          PIC S9(11)V9(2) COMP-3.
071500210928             10 WS-ARRAY-INVR-GBV-CUR      PIC S9(11)V9(2) COMP-3.
071600210928
071700210928       01 WS-ACC-CONT-INV-ARRAYX.
071701211007111744*  05 WS-ACC-CONT-INV-ARRAY OCCURS 100 TIMES INDEXED BY CONTIDX.
071702211007111744   05 WS-ACC-CONT-INV-ARRAY OCCURS 1 TO 1000 TIMES DEPENDING ON
071703211007                          ln_InvArraySize INDEXED BY CONTIDX.
071900210928             10 WS-ARRAY-ACCOUNT-NO        PIC 9(09).
072000210928             10 WS-ARRAY-CONTRACT-NO       PIC 9(09).
072100210928             10 WS-ARRAY-INVESTMENT-CODE   PIC X(05).
072200210928             10 WS-ARRAY-INV-CURR-CODE     PIC X(03).
072300210928             10 WS-ARRAY-BEFORE-MV         PIC S9(11)V9(2) COMP-3.
072400210928             10 WS-ARRAY-BEFORE-GBV        PIC S9(11)V9(2) COMP-3.
072500210928             10 WS-ARRAY-BEFORE-NDV        PIC S9(11)V9(2) COMP-3.
072600210928             10 WS-ARRAY-AFTER-MV          PIC S9(11)V9(2) COMP-3.
072700210928             10 WS-ARRAY-INV-EXCH-RATE     PIC S9(2)V9(7) COMP-3.
072800210928
072900210928      * RFS49699 - Begin
073000210928
073100210928       01 WS-ARRAY-LOG-MISC.
073200210928           05 WS-ARRAY1-NAME           PIC X(32)
073300210928                               VALUE "WS-ACC-CONT-INV-RESET-ARRAY".
073400210928           05 WS-ARRAY1-MAX            PIC 9(09)
073500210928                               VALUE 100.
073600210928           05 WS-ARRAY1-MAX-USED       PIC 9(09)
073700210928                               VALUE 0.
073800210928           05 WS-ARRAY2-NAME           PIC X(32)
073900210928                               VALUE "WS-ACC-CONT-INV-ARRAY".
074000210928           05 WS-ARRAY2-MAX            PIC 9(09)
074100210928                               VALUE 100.
074200210928           05 WS-ARRAY2-MAX-USED       PIC 9(09)
074300210928                               VALUE 0.
074400210928
074500210928      * RFS49699 - End
074600210928
074700210928R12702 01 WS-VARS-4ROUNDING.
074800210928R12702    05 WS-CONT-NDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
074900210928R12702    05 WS-CONT-GBV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
075000210928R12702    05 WS-NDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
075100210928R12702    05 WS-GBV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
075200210928
075300210928       01 WS-LEVEL-88.
075400210928          05 WS-INV-RESET-FLAG             PIC X.
075500210928             88 INV-RESET-FOUND            VALUE "Y".
075600210928          05 WS-NEED-GBV-FLAG              PIC X.
075700210928             88 NEEDS-GBV-AMOUNT           VALUE "Y".
075800210928          05 WS-FIRST-RECALC-PASS          PIC X.
075900210928             88 FIRST-RECALC-PASS          VALUE "Y".
076000210928          05 WS-ARRAY-POINTER              PIC X.
076100210928             88 ARRAY-POINTER-FOUND        VALUE "Y".
076200210928             88 ARRAY-POINTER-NOT-FOUND    VALUE "N".
076300210928          05 WS-SQL-FILE-OPEN              PIC X.
076400210928             88 SQL-FILE-OPEN              VALUE "Y".
076500210928             88 SQL-FILE-NOT-OPEN          VALUE "N".
076600210928          05 WS-LOAD-STRUCTURE             PIC X.
076700210928             88 FRONT-END                  VALUE "F".
076800210928R12702    05 WS-NDV-DIFF-FLAG              PIC X(01).
076900210928R12702       88 NDV-DIFFERENCE-FOUND       VALUE "Y".
077000210928R12702    05 WS-GBV-DIFF-FLAG              PIC X(01).
077100210928R12702       88 GBV-DIFFERENCE-FOUND       VALUE "Y".
077200210928R12702    05 WS-NDV-UPDATE-FLAG            PIC X(01).
077300210928R12702       88 NDV-NOT-UPDATED            VALUE "Y".
077400210928R12702    05 WS-GBV-UPDATE-FLAG            PIC X(01).
077500210928R12702       88 GBV-NOT-UPDATED            VALUE "Y".
077600210928R13394    05 WS-XFER-AMT-EXISTS-FLAG       PIC X(01).
077700210928R13394       88 TRANSFER-AMT-EXISTS        VALUE "Y".
077800210928
077900210928      * RFS 110904 - START
078000210928       01 LC-INVSTRUCTURECODE              PIC X(5).
078100210928127401 01 lc-GuarBenefitEligible           PIC X(5).
078200210928      * RFS 110904 - END
078300210928       01 WS-SQL-VARIABLES.
078400210928          05 WS-SQL-PROCESS-DATE           PIC S9(9) COMP-3.
078500210928          05 WS-SQL-PROC-SEQ-NO            PIC S9(9) COMP-3.
078600210928          05 WS-SQL-PLACEMENT-DATE         PIC S9(9) COMP-3.
078700210928          05 WS-SQL-TRANS-NO               PIC S9(9) COMP-3.
078800210928
078900210928       01 WS-TRANS-COUNT                   PIC 9(3) VALUE 0.
079000210928       01 WS-SWO-GBV-CHANGE                PIC S9(11)V9(2) COMP-3
079100210928                                               VALUE 0.
079200210928       01 WS-SWO-NDV-CHANGE                PIC S9(11)V9(2) COMP-3.
079300210928       01 WS-GET-LOAD-STRUCTURE            PIC X(01).
079400210928       01 WS-OTHER-VARIABLES.
079500210928          05 WS-DIFF-INVESTMENT-FLAG        PIC X(01).
079600210928          05 WS-OLD-CURR-INVESTMENT-CODE    PIC X(05).
079700210928          05 WS-CONT-INVESTMENT-CODE        PIC X(05).
079800210928          05 WS-PRICE-FOUND                 PIC X(01).
079900210928          05 WS-REQUIRED-UNITSP             PIC S9(10)V9(3) COMP-3.
080000210928          05 WS-INV-UNIT-PRICE              PIC S9(5)V9(4) COMP-3.
080100210928          05 WS-INV-BEF-MARKET-VALUE        PIC S9(11)V9(4) COMP-3.
080200210928          05 WS-INV-AFT-MARKET-VALUE        PIC S9(11)V9(2) COMP-3.
080300210928          05 WS-CONT-INV-MARKET-VALUE       PIC S9(12)V9(4) COMP-3.
080400210928          05 WS-CURR-CONTRACT-MV-AFT        PIC S9(12)V9(2) COMP-3.
080500210928          05 WS-INV-BEF-GBV                 PIC S9(11)V9(2) COMP-3.
080600210928          05 WS-INV-BEF-NDV                 PIC S9(11)V9(2) COMP-3.
080700210928          05 WS-CURR-CONTRACT-GBV-BEF       PIC S9(12)V9(2) COMP-3.
080800210928          05 WS-CURR-CONTRACT-GBV-AFT       PIC S9(12)V9(2) COMP-3.
080900210928          05 WS-CURR-CONTRACT-NDV-BEF       PIC S9(12)V9(2) COMP-3.
081000210928          05 WS-CURR-CONTRACT-NDV-AFT       PIC S9(12)V9(2) COMP-3.
081100210928          05 WS-GBV-CHANGE                  PIC S9(11)V9(2) COMP-3.
081200210928          05 WS-INV-GBV-PERCENT             PIC S9(2)V9(3) COMP-3.
081300210928          05 WS-INV-GBV-PERCENT-TOTAL       PIC S9(2)V9(3) COMP-3.
081400210928          05 WS-NDV-CHANGE                  PIC S9(11)V9(2) COMP-3.
081500210928          05 WS-INV-NDV-PERCENT             PIC S9(2)V9(3) COMP-3.
081600210928          05 WS-INV-NDV-PERCENT-TOTAL       PIC S9(2)V9(3) COMP-3.
081700210928          05 WS-INV-GBV-AFT                 PIC S9(11)V9(2) COMP-3.
081800210928          05 WS-INV-GBV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
081900210928          05 WS-INV-NDV-AFT                 PIC S9(11)V9(2) COMP-3.
082000210928          05 WS-INV-NDV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
082100210928          05 WS-CONT-INV-ARRAY-COUNT        PIC S9(03) COMP-3.
082200210928          05 WS-CONT-INV-COUNT              PIC S9(03) COMP-3.
082300210928          05 WS-INV-OPENING-UNIT-BAL        PIC S9(10)V9(3) COMP-3.
082400210928          05 WS-NEXT-PROCESS-DATE           PIC 9(8).
082500210928          05 WS-DUMMY-PERCENT               PIC S9(2)V9(3) COMP-3.
082600210928          05 WS-GBV-CHANGE-AMT              PIC S9(11)V9(2) COMP-3.
082700210928
082800210928       01 WS-DEFAULT.
082900210928          05 WS-RECORD-FOUND                PIC X(01).
083000210928             88 RECORD-FOUND                VALUE "Y".
083100210928
083200210928       01 CURRENT-RECORD-VARS.
083300210928          05 CURR-ACCOUNT-NO                PIC S9(9).
083400210928          05 CURR-INVESTMENT-CODE           PIC X(5).
083500210928          05 CURR-CONTRACT-NO               PIC 9(9).
083600210928          05 CURR-RESET-UNIT-PRICE          PIC S9(5)V9(4) COMP-3.
083700210928          05 CURR-RESET-EXCH-RATE           PIC S9(2)V9(7) COMP-3.
083800210928          05 CURR-OPENING-UNIT-BAL          PIC S9(9)V9(3) COMP-3.
083900210928          05 CURR-RESET-NO                  PIC 9(2).
084000210928          05 CURR-HAS-RESET-FLAG            PIC X(1).
084100210928          05 CURR-GUAR-BASE-VALUE-BEF       PIC S9(11)V9(2) COMP-3.
084200210928          05 CURR-GUAR-BASE-VAL-CUR-BEF     PIC S9(11)V9(2) COMP-3.
084300210928
084400210928RF8092 01 WS-OTHER-VARIABLES3.
084500210928RF8092    05 WS-FROM-ACCOUNT-TYPE        PIC X(05).
084600210928RF8092    05 WS-FROM-NOM-ACCOUNT-TYPE    PIC X(05).
084700210928RF8092    05 WS-FROM-TRANS-TYPE-CODE     PIC X(03).
084800210928RF8092    05 WS-TO-ACCOUNT-TYPE          PIC X(05).
084900210928RF8092    05 WS-TO-NOM-ACCOUNT-TYPE      PIC X(05).
085000210928RF8092    05 WS-TO-TRANS-TYPE-CODE       PIC X(03).
085100210928RF8092    05 WS-TRANS-ORIGIN-CODE        PIC X(03).
085200210928RF8092    05 WS-CONTR-REDEM-CODE         PIC X(06).
085300210928RF8092    05 WS-FROM-PLACEMENT-DATE      PIC S9(09) COMP-3.
085400210928RF8092    05 WS-FROM-TRANS-NO            PIC S9(09) COMP-3.
085500210928RF8092    05 WS-TO-PLACEMENT-DATE        PIC S9(09) COMP-3.
085600210928RF8092    05 WS-TO-TRANS-NO              PIC S9(09) COMP-3.
085700210928RF8092    05 WS-FROM-ACCOUNT-NO          PIC S9(09) COMP-3.
085800210928RF8092    05 WS-TO-ACCOUNT-NO            PIC S9(09) COMP-3.
085900210928RF8092    05 WS-FROM-CONTRACT-NO         PIC 9(09).
086000210928RF8092    05 WS-TO-CONTRACT-NO           PIC 9(09).
086100210928RF8092    05 WS-TRANSFER-GBV             PIC X(01) VALUE "N".
086200210928      /
086300210928R11255 01 WS-OTHER-VARIABLES4.
086400210928R11255    05 WS-EX-ACCOUNT-TYPE          PIC X(05).
086500210928R11255    05 WS-EX-NOM-ACCOUNT-TYPE      PIC X(05).
086600210928R11255    05 WS-EX-TRANS-TYPE-CODE       PIC X(03).
086700210928R11255    05 WS-EX-TRANS-ORIGIN-CODE     PIC X(03).
086800210928R11255    05 WS-EX-REVERSAL-CODE         PIC X(04).
086900210928R11255    05 WS-EX-ACCOUNT-ATT-CODE      PIC X(05).
087000210928
087100210928      * RFS63488 - START
087200210928       01 WS-COMMVAR.
087300210928          05 WS-ACCOUNT-NO               PIC S9(9)      VALUE ZEROES.
087400210928          05 WS-TRADE-DATE               PIC S9(8)      VALUE ZEROES.
087500210928          05 WS-FMV-AMT                  PIC S9(09)V99  VALUE ZEROES.
087600210928          05 WS-MODE                     PIC X(1)       VALUE SPACES.
087700210928          05 WS-CONTRACT-NO              PIC S9(9)      VALUE ZEROES.
087800210928          05 WS-INVESTMENT-CODE          PIC X(5)       VALUE SPACES.
087900210928          05 WS-UNIT-AMOUNT              PIC S9(09)V9999
088000210928                                                        VALUE ZEROES.
088100210928
088200210928       01 CONSTANTS.
088300210928          05 lncc_R                      PIC X(01)      VALUE "R".
088400210928
088500210928      * RFS63488 - END
088501211007      * RFS1117445 - START
088502211007       01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
088503211007       01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
088504211007       01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
088505211007      * RFS1117445 - END
088506211007
088600210928
088700210928180708 01 WS-PLACEMENTDATE           PIC S9(09) VALUE 0.
088800210928180708 01 WS-TRANSNO                 PIC S9(09) VALUE 0.
088900210928
089000210928R47405 COPY CPGLWBRULE.
08910021092884063 *COPY CPGLWBCKTT.
08920021092884063  COPY CPCKFEETRN.
089300210928
089400210928       LINKAGE SECTION.
089500210928        01 COMM-AREA                     PIC X(200).
089600210928        01 COMM-AREA-BUFFER REDEFINES COMM-AREA.
089700210928           03 COMM-REJECTION-CODE        PIC X(3).
089800210928           03 COMM-USER                  PIC X(10).
089900210928           03 COMM-CALLER-ID-CODE        PIC X(10).
090000210928           03 COMM-ACTION                PIC X(10).
090100210928           03 COMM-OPEN-FILES            PIC X(1).
090200210928           03 COMM-PROCESS-DATE          PIC S9(8).
090300210928           03 COMM-ACCOUNT-NO            PIC 9(9).
090400210928           03 COMM-CONTRACT-NO           PIC 9(9).
090500210928           03 COMM-RESET-NUMBER          PIC 9(5).
090600210928           03 COMM-EFFECT-DATE           PIC S9(8).
090700210928           03 COMM-RESET-REQ-FUND        PIC X(5).
090800210928
090900210928       PROCEDURE DIVISION USING COMM-AREA.
091000210928       MAINLINE.
091100210928
091200210928           PERFORM INITIAL-LOGIC     THRU INL-EXIT.
091300210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
091400210928              GO TO ML-1200.
091500210928       ML-0010.
091600210928           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
091700210928       ML-0020.
091800210928           IF PREV-CONTROLS IS EQUAL TO LOW-VALUES
091900210928              GO TO ML-0040.
092000210928       ML-0030.
092100210928       ML-0040.
092200210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
092300210928              GO TO ML-1200.
092400210928       ML-0050.
092500210928           MOVE CURR-CONTROLS          TO PREV-CONTROLS.
092600210928       ML-1100.
092700210928           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
092800210928           GO TO ML-0010.
092900210928       ML-1200.
093000210928           PERFORM END-JOB             THRU EOJ-EXIT.
093100210928           GOBACK.
093200210928      /
093300210928       GET-CURRENT-RECORD.
093400210928
093500210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
093600210928              GO TO GCR-EXIT
093700210928           END-IF.
093800210928
093900210928           EVALUATE COMM-ACTION
094000210928
094100210928           WHEN "ALL FUNDS"
094200210928             PERFORM GET-ALL-FUNDS-RECORD
094300210928                                       THRU GAFR-EXIT
094400210928           WHEN OTHER
094500210928             MOVE HIGH-VALUES  TO CURR-CONTROLS
094600210928
094700210928           END-EVALUATE.
094800210928
094900210928       GCR-EXIT.
095000210928           EXIT.
095100210928      /
095200210928       GET-ALL-FUNDS-RECORD.
095300210928
095400210928
095500210928           INITIALIZE WS-ACC-CONT-INV-RESET-ARRAYX.
095600210928           PERFORM GET-ALL-INV-UNIT-BAL THRU GAIUB-EXIT.
095700210928
095800210928       GAFR-EXIT.
095900210928           EXIT.
096000210928      /
096100210928       GET-ALL-INV-UNIT-BAL.
096200210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-R-REC.
096300210928           MOVE COMM-ACCOUNT-NO
096400210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-R.
096500210928           MOVE COMM-CONTRACT-NO
096600210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-R.
096700210928           MOVE SPACES
096800210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-R.
096900210928
097000210928           START ACCOUNT-CONTRACT-INVEST-R
097100210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
097200210928                 INVALID KEY
097300210928                 MOVE HIGH-VALUES TO CURR-CONTROLS
097400210928                 GO TO GAIUB-EXIT.
097500210928
097600210928           SET INVRIDX TO 1.
097700210928           SET INVRIDX DOWN BY 1.
097800210928
097900210928       GAIUB-0010.
098000210928           READ ACCOUNT-CONTRACT-INVEST-R NEXT RECORD
098100210928                AT END
098200210928                GO TO GAIUB-EXIT.
098300210928
098400210928           IF COMM-ACCOUNT-NO NOT =
098500210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-R
098600210928              GO TO GAIUB-EXIT
098700210928           END-IF.
098800210928
098900210928           IF COMM-CONTRACT-NO NOT =
099000210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-R
099100210928              GO TO GAIUB-EXIT
099200210928           END-IF.
099300210928
099400210928           MOVE COMM-ACCOUNT-NO TO CURR-ACCOUNT-NO.
099500210928           MOVE COMM-CONTRACT-NO TO CURR-CONTRACT-NO.
099600210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-R
099700210928             TO CURR-INVESTMENT-CODE.
099800210928           MOVE COMM-RESET-NUMBER TO CURR-RESET-NO.
099900210928           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-R
100000210928             TO CURR-OPENING-UNIT-BAL.
100100210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-R
100200210928             TO CURR-GUAR-BASE-VALUE-BEF.
100300210928           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST-R
100400210928             TO CURR-GUAR-BASE-VAL-CUR-BEF.
100500210928
100600210928           MOVE CURR-ACCOUNT-NO
100700210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET.
100800210928           MOVE CURR-CONTRACT-NO
100900210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET.
101000210928           MOVE CURR-RESET-NO
101100210928             TO RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET.
101200210928           MOVE CURR-INVESTMENT-CODE
101300210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET.
101400210928
101500210928           MOVE "N" TO WS-INV-RESET-FLAG.
101600210928           READ ACCOUNT-CONTRACT-INV-RESET
101700210928                NOT INVALID KEY
101800210928                MOVE "Y" TO WS-INV-RESET-FLAG
101900210928
102000210928                INVALID KEY
102100210928                MOVE "N" TO WS-INV-RESET-FLAG
102200210928           END-READ.
102300210928
102400210928           IF INV-RESET-FOUND
102500210928              MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INV-RESET
102600210928                TO CURR-OPENING-UNIT-BAL
102700210928              MOVE "Y" TO CURR-HAS-RESET-FLAG
102800210928              GO TO GAIUB-0030
102900210928           ELSE
103000210928              MOVE ZEROES TO CURR-RESET-UNIT-PRICE
103100210928                             CURR-RESET-EXCH-RATE
103200210928              MOVE "N" TO CURR-HAS-RESET-FLAG
103300210928           END-IF.
103400210928
103500210928           PERFORM GET-OPEN-UNIT-BALANCE THRU GOUB-EXIT.
103600210928
103700210928       GAIUB-0020.
103800210928      ** Move zero to current GBV if no more
103900210928      ** units for the fund.  Otherwise get the GBV in Trans-Contract-Dtl
104000210928           IF CURR-OPENING-UNIT-BAL = 0
104100210928              MOVE 0 TO CURR-GUAR-BASE-VALUE-BEF
104200210928                        CURR-GUAR-BASE-VAL-CUR-BEF
104300210928           ELSE
104400210928              PERFORM VCA-GET-NEXT-BUSINESS-DATE
104500210928              PERFORM GET-TRANS-GBV-BEF-RESET THRU GTGBR-EXIT
104600210928           END-IF.
104700210928
104800210928       GAIUB-0030.
104900210928
105000210928           SET INVRIDX UP BY 1.
105100210928      * RFS49699 - Array logging logic
105200210928
105300210928           IF INVRIDX  > WS-ARRAY1-MAX-USED
105400210928               MOVE INVRIDX                TO WS-ARRAY1-MAX-USED
105500210928           END-IF.
105600210928
105700210928      * RFS49699 - End
105800210928           MOVE CURR-ACCOUNT-NO
105900210928             TO WS-ARRAY-INVR-ACCOUNT-NO
106000210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
106100210928           MOVE CURR-CONTRACT-NO
106200210928             TO WS-ARRAY-INVR-CONTRACT-NO
106300210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
106400210928           MOVE CURR-INVESTMENT-CODE
106500210928             TO WS-ARRAY-INVR-INVEST-CODE
106600210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
106700210928           MOVE CURR-RESET-NO
106800210928             TO WS-ARRAY-INVR-RESET-NO
106900210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
107000210928           MOVE CURR-OPENING-UNIT-BAL
107100210928             TO WS-ARRAY-INVR-UNIT-BAL
107200210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
107300210928           MOVE CURR-GUAR-BASE-VALUE-BEF
107400210928             TO WS-ARRAY-INVR-GBV
107500210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
107600210928           MOVE CURR-GUAR-BASE-VAL-CUR-BEF
107700210928             TO WS-ARRAY-INVR-GBV-CUR
107800210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX).
107900210928
108000210928           GO TO GAIUB-0010.
108100210928
108200210928       GAIUB-EXIT.
108300210928           EXIT.
108400210928      /
108500210928       DETAIL-PROCESSING.
108600210928
108700210928           EVALUATE COMM-ACTION
108800210928
108900210928           WHEN "ALL FUNDS"
109000210928             PERFORM DETAIL-ALL-FUNDS-PROCESSING
109100210928                                       THRU DAFP-EXIT
109200210928           WHEN OTHER
109300210928           MOVE HIGH-VALUES  TO CURR-CONTROLS
109400210928
109500210928           END-EVALUATE.
109600210928
109700210928           MOVE HIGH-VALUES TO CURR-CONTROLS.
109800210928
109900210928       DPR-EXIT.
110000210928           EXIT.
110100210928      /
110200210928       DETAIL-ALL-FUNDS-PROCESSING.
110300210928
110400210928           MOVE "Y" TO WS-FIRST-RECALC-PASS.
110500210928           MOVE "N" TO WS-SQL-FILE-OPEN.
110600210928
110700210928           EXEC SQL
110800210928                WHENEVER SQLERROR GOTO DAFP-EXIT
110900210928           END-EXEC.
111000210928
111100210928           EXEC SQL
111200210928                WHENEVER NOT FOUND GOTO DAFP-EXIT
111300210928           END-EXEC.
111400210928
111500210928      *RFS91599 Replaced 'Implicit Join' by 'Inner Join'
111600210928           EXEC SQL
111700210928           DECLARE SEGEXTSQ CURSOR FOR SELECT A.PROCESS_DATE,
11180021092891599      A.PROC_SEQ_NO, A.PLACEMENT_DATE, A.TRANS_NO
111900210928  |        FROM MFATRDPSP A
112000210928  |        INNER JOIN MFATRNP B ON
112100210928  |          A.PLACEMENT_DATE = B.PLACEMENT_DATE AND
112200210928  |          A.TRANS_NO = B.TRANS_NO
112300210928      *RFS63488 - Start
112400210928  |   *    WHERE  A.PROCESS_DATE > :COMM-EFFECT-DATE
112500210928  |        WHERE  B.TRADE_DATE > :COMM-EFFECT-DATE
112600210928      *RFS63488 - End
11270021092891599      AND A.PROCESS_DATE <= :COMM-PROCESS-DATE
112800210928           AND B.REVERSE <> "Y" AND B.ACCOUNT_NO = :CURR-ACCOUNT-NO
112900210928           ORDER BY A.PROCESS_DATE, A.PROC_SEQ_NO
113000210928           END-EXEC.
113100210928
113200210928           EXEC SQL
113300210928                OPEN SEGEXTSQ
113400210928           END-EXEC.
113500210928
113600210928           MOVE "Y" TO WS-SQL-FILE-OPEN.
113700210928
113800210928       DAFP-0010.
113900210928
114000210928           EXEC SQL
114100210928                WHENEVER NOT FOUND GOTO DAFP-EXIT
114200210928           END-EXEC.
114300210928
114400210928           EXEC SQL
114500210928           FETCH NEXT FROM SEGEXTSQ INTO :WS-SQL-PROCESS-DATE,
114600210928           :WS-SQL-PROC-SEQ-NO, :WS-SQL-PLACEMENT-DATE, :WS-SQL-TRANS-NO
114700210928           END-EXEC.
114800210928
114900210928           EXEC SQL
115000210928                WHENEVER SQLERROR GOTO DAFP-EXIT
115100210928           END-EXEC.
115200210928
115300210928           INITIALIZE MFATRNP OF TRANS-REC.
115400210928           MOVE WS-SQL-PLACEMENT-DATE
115500210928             TO PLACEMENT-DATE OF TRANS.
115600210928           MOVE WS-SQL-TRANS-NO
115700210928             TO TRANS-NO OF TRANS.
115800210928
115900210928           READ TRANS
116000210928                INVALID KEY
116100210928                GO TO DAFP-0010.
116200210928
116300210928180708     INITIALIZE WS-PLACEMENTDATE WS-TRANSNO.
116400210928180708     MOVE PLACEMENT-DATE OF TRANS  TO WS-PLACEMENTDATE.
116500210928180708     MOVE TRANS-NO OF TRANS        TO WS-TRANSNO.
116600210928           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
116700210928
116800210928      * If exclude-trans-flag = 'Y' bypass the trans otherwise
116900210928      * process the trans.
117000210928
11710021092826151**    IF EXCLUDE-TRANS-FLAG = "Y"
11720021092826151**       GO TO DAFP-0010
11730021092826151**    END-IF.
117400210928
117500210928           IF ACCOUNT-NO OF TRANS NOT = COMM-ACCOUNT-NO
117600210928              GO TO DAFP-EXIT
117700210928           END-IF.
117800210928
117900210928           IF PROCESS-DATE OF TRANS > COMM-PROCESS-DATE
118000210928              GO TO DAFP-EXIT
118100210928           END-IF.
118200210928
118300210928           IF PROCESS-DATE OF TRANS < COMM-EFFECT-DATE
118400210928              GO TO DAFP-EXIT
118500210928           END-IF.
118600210928
118700210928           IF PROCESS-DATE OF TRANS = COMM-EFFECT-DATE
118800210928              GO TO DAFP-0010
118900210928           END-IF.
119000210928
119100210928           MOVE TRANS-TYPE-CODE OF TRANS
119200210928             TO TRANS-CATEGORY.
119300210928           MOVE TRANS-STATUS-CODE OF TRANS
119400210928             TO TRANS-STATUS-CATEGORY.
119500210928           MOVE REVERSE OF TRANS
119600210928             TO TRANS-REVERSE-CATEGORY.
119700210928
11980021092826151      IF EXCLUDE-TRANS-FLAG NOT = "Y" AND
11990021092826151         MAN-FEE-REB-TRANSACTION
12000021092826151         GO TO DAFP-0010
12010021092826151      END-IF.
120200210928
120300210928           IF TRANS-REVERSED OR
120400210928              NOT HISTORY OR
120500210928              NOT VALID-TRANSACTION
120600210928              GO TO DAFP-0010
120700210928           END-IF.
120800210928
120900210928           INITIALIZE MFATRCODP OF TRANS-CONT-DTL-R-REC.
121000210928           MOVE PLACEMENT-DATE OF TRANS
121100210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-R.
121200210928           MOVE TRANS-NO OF TRANS
121300210928             TO TRANS-NO OF TRANS-CONTRACT-DTL-R.
121400210928           MOVE CURR-CONTRACT-NO
121500210928             TO CONTRACT-NO OF TRANS-CONTRACT-DTL-R.
121600210928
121700210928           READ TRANS-CONTRACT-DTL-R WITH NO LOCK
121800210928                INVALID KEY
121900210928                GO TO DAFP-0010.
122000210928
122100210928           IF REVERSED-DDS OF TRANS-CONTRACT-DTL-R = "Y"
122200210928              GO TO DAFP-0010
122300210928           END-IF.
122400210928
122500210928R13394* Get the GBV from Trans-GBV-Transfer it it exists
122600210928R13394     MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
122700210928R13394     INITIALIZE MFATRACXP OF TRANS-GBV-TRANSFER-REC.
122800210928R13394     IF BUY-TRANSACTION
122900210928R49898        OR SWITCH-IN-TRANSACTION
123000210928              MOVE PLACEMENT-DATE OF TRANS
123100210928                TO PLACEMENT-DATE OF TRANS-GBV-TRANSFER
123200210928              MOVE TRANS-NO OF TRANS
123300210928                TO TRANS-NO OF TRANS-GBV-TRANSFER
123400210928
123500210928              READ TRANS-GBV-TRANSFER
123600210928                   INVALID KEY
123700210928                   GO TO DAFP-0020
123800210928              END-READ
123900210928
124000210928              MOVE "Y" TO WS-XFER-AMT-EXISTS-FLAG
124100210928R13394     END-IF.
124200210928
124300210928       DAFP-0020.
124400210928           MOVE UNIT-AMT OF TRANS TO WS-CURR-TRANS-UNIT-AMT.
124500210928           MOVE UNIT-PRICE OF TRANS TO WS-CURR-TRANS-UNIT-PRICE.
124600210928           MOVE TRADE-DATE OF TRANS TO WS-CURR-TRANS-TRADE-DATE.
124700210928           MOVE NET-AMT OF TRANS TO WS-CURR-TRANS-NET-AMT.
124800210928           MOVE GROSS-AMT OF TRANS TO WS-CURR-TRANS-GROSS-AMT.
124900210928           MOVE ACCOUNT-NO OF TRANS TO CURR-ACCOUNT-NO.
125000210928           MOVE INVESTMENT-CODE OF TRANS TO CURR-INVESTMENT-CODE.
125100210928           MOVE PLACEMENT-DATE OF TRANS
125200210928             TO WS-CURR-TRANS-PLACEMENT-DATE.
125300210928           MOVE TRANS-NO OF TRANS TO WS-CURR-TRANS-TRANS-NO.
125400210928           MOVE "Y" TO WS-GET-LOAD-STRUCTURE.
125500210928           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
125600210928
125700210928R11593     IF REDEMPTION-TRANSACTION
125800210928R11593        COMPUTE WS-CURR-TRANS-GROSS-AMT ROUNDED =
125900210928R11593                ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R *
126000210928R11593                UNIT-PRICE OF TRANS
126100210928R11593     END-IF.
126200210928           MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R
126300210928             TO WS-CURR-ORIG-UNIT-BAL.
126400210928
126500210928           PERFORM SET-INTERNAL-ARRAY-POINTER THRU SIAP-EXIT.
126600210928           IF ARRAY-POINTER-NOT-FOUND
126700210928              GO TO DAFP-0010
126800210928           END-IF.
126900210928
127000210928           IF BUY-TRANSACTION
12710021092826151         OR MAN-FEE-REB-TRANSACTION
127200210928              MOVE "Y" TO WS-GET-LOAD-STRUCTURE
127300210928              PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT
127400210928              IF FRONT-END
127500210928                 MOVE WS-CURR-TRANS-NET-AMT TO WS-CURR-TRANS-AMT-CUR
127600210928              ELSE
127700210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-CURR-TRANS-AMT-CUR
127800210928              END-IF
127900210928
128000210928R13394* If TRANSFER-AMT-EXISTS is TRUE, GBV should be coming from
128100210928R13394* the Trans-GBV-Transfer file
128200210928R13394        IF TRANSFER-AMT-EXISTS
128300210928R13394           MOVE GUAR-BASE-VALUE OF TRANS-GBV-TRANSFER
128400210928R13394             TO WS-CURR-TRANS-AMT-CUR
128500210928R13394        END-IF
128600210928
128700210928              IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
128800210928                 MOVE CURRENCY-DDS OF INVESTMENT TO WS-EXCH-CURRENCY
128900210928                 MOVE WS-CURR-TRANS-PLACEMENT-DATE
129000210928                   TO WS-EXCH-PLACEMENT-DATE
129100210928                 MOVE WS-CURR-TRANS-TRANS-NO TO WS-EXCH-TRANS-NO
129200210928                 MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
129300210928                 PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
129400210928                 COMPUTE WS-CURR-TRANS-AMT ROUNDED =
129500210928                         WS-CURR-TRANS-AMT-CUR / WS-EXCH-RATE-VALUE
129600210928              ELSE
129700210928                 MOVE WS-CURR-TRANS-AMT-CUR TO WS-CURR-TRANS-AMT
129800210928              END-IF
129900210928R11622*       ADD WS-CURR-TRANS-UNIT-AMT
130000210928R11622        ADD WS-CURR-ORIG-UNIT-BAL
130100210928               TO WS-ARRAY-INVR-UNIT-BAL
130200210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
130300210928
130400210928              ADD WS-CURR-TRANS-AMT
130500210928               TO WS-ARRAY-INVR-GBV
130600210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
130700210928
130800210928              ADD WS-CURR-TRANS-AMT-CUR
130900210928               TO WS-ARRAY-INVR-GBV-CUR
131000210928                  OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
131100210928
131200210928              PERFORM UPD-ACC-CON-INV-BUY THRU UACIB-EXIT
131300210928      *----------------
131400210928      * RFS40872 Begins
131500210928      *----------------
131600210928              IF COMM-EFFECT-DATE >= COMM-PROCESS-DATE
131700210928                 ADD WS-CURR-TRANS-AMT
131800210928                   TO GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-R
131900210928                 ADD WS-CURR-TRANS-AMT-CUR
132000210928                   TO GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DTL-R
132100210928              END-IF
132200210928      *----------------
132300210928      * RFS40872 Ends
132400210928      *----------------
132500210928              REWRITE TRANS-CONT-DTL-R-REC
132600210928              GO TO DAFP-0010
132700210928           END-IF.
132800210928
132801211007111744        INITIALIZE ln_InvArraySize
132802211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
132803211007
132900210928           SET OLD-INVRIDX TO INVRIDX.
133000210928           INITIALIZE WS-OTHER-VARIABLES WS-ACC-CONT-INV-ARRAYX.
133001211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
133002211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
133003211007111744     INITIALIZE WS-ARRAY-ACCOUNT-NO(IVS-CNT1)
133004211007111744                WS-ARRAY-CONTRACT-NO(IVS-CNT1)
133005211007111744                WS-ARRAY-INVESTMENT-CODE(IVS-CNT1)
133006211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
133007211007111744                WS-ARRAY-BEFORE-MV(IVS-CNT1)
133008211007111744                WS-ARRAY-BEFORE-GBV(IVS-CNT1)
133009211007111744                WS-ARRAY-BEFORE-NDV(IVS-CNT1)
133010211007111744                WS-ARRAY-AFTER-MV(IVS-CNT1)
133011211007111744                WS-ARRAY-INV-EXCH-RATE(IVS-CNT1)
133012211007111744     END-PERFORM
133013211007
133100210928           PERFORM CALC-CONTRACT-MARKET-VALUE THRU CCMV-EXIT.
133200210928
13330021092826151** Don't update GBV if this is a transaction on exclude table
13340021092826151      IF EXCLUDE-TRANS-FLAG = "Y"
13350021092826151         SET INVRIDX TO OLD-INVRIDX
13360021092826151         MOVE "N" TO WS-FIRST-RECALC-PASS
13370021092826151         GO TO DAFP-0010
13380021092826151      END-IF.
133900210928
134000210928           MOVE "N" TO WS-TRANSFER-GBV.
134100210928           IF SWITCH-IN-TRANSACTION
13420021092816512         MOVE CONTRACT-NO OF TRANS-CONTRACT-DTL-R
13430021092816512              TO WS-TO-CONTRACT-NO
134400210928              PERFORM GET-SEG-TRANSFER-PARAMETERS THRU GSTP-EXIT
134500210928           END-IF.
134600210928           PERFORM CALC-NEW-CHANGE-GBV THRU CNCG-EXIT.
134700210928           PERFORM RECALC-NETDEP-GBV-VALUES THRU RNGV-EXIT.
134800210928R12702     PERFORM CHECK-NDV-GBV-ROUNDING THRU CNGR-EXIT.
134900210928           SET INVRIDX TO OLD-INVRIDX.
135000210928
135100210928           MOVE "N" TO WS-FIRST-RECALC-PASS.
135200210928
135300210928           GO TO DAFP-0010.
135400210928
135500210928       DAFP-EXIT.
135600210928           EXIT.
135700210928      /
135800210928       SET-INTERNAL-ARRAY-POINTER.
135900210928           MOVE "N" TO WS-ARRAY-POINTER.
136000210928           SET INVRIDX TO 1.
136100210928
136200210928           SEARCH WS-ACC-CONT-INV-RESET-ARRAY VARYING INVRIDX
136300210928           WHEN WS-ARRAY-INVR-ACCOUNT-NO(INVRIDX) = COMM-ACCOUNT-NO AND
136400210928              WS-ARRAY-INVR-INVEST-CODE(INVRIDX) = CURR-INVESTMENT-CODE
136500210928              MOVE "Y" TO WS-ARRAY-POINTER
136600210928              GO TO SIAP-EXIT
136700210928           WHEN WS-ARRAY-INVR-ACCOUNT-NO(INVRIDX) = 0 OR
136800210928                WS-ARRAY-INVR-INVEST-CODE(INVRIDX) = " "
136900210928              GO TO SIAP-EXIT
137000210928           END-SEARCH.
137100210928
137200210928       SIAP-EXIT.
137300210928           EXIT.
137400210928      /
137500210928       GET-OPEN-UNIT-BALANCE.
137600210928      * RFS63488 - START
137700210928
137800210928      *    INITIALIZE MFATRNP OF TRANS-R-REC.
137900210928      *    MOVE CURR-ACCOUNT-NO TO ACCOUNT-NO OF TRANS-R.
138000210928      *    MOVE CURR-INVESTMENT-CODE TO INVESTMENT-CODE OF TRANS-R.
138100210928      *    MOVE COMM-PROCESS-DATE TO PROCESS-DATE OF TRANS-R.
138200210928      *    MOVE ZEROES TO TRANS-PROC-SEQ-NO OF TRANS-R
138300210928      *                   PLACEMENT-DATE OF TRANS-R
138400210928      *                   TRANS-NO OF TRANS-R
138500210928      *                   WS-TRANS-COU T.
138600210928      *
138700210928      *    START TRANS-R
138800210928      *          KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
138900210928      *          INVALID KEY
139000210928      *          GO TO GOUB-EXIT.
139100210928
139200210928
139300210928           INITIALIZE WS-COMMVAR.
139400210928
139500210928           MOVE CURR-ACCOUNT-NO      TO WS-ACCOUNT-NO.
139600210928           MOVE CURR-CONTRACT-NO     TO WS-CONTRACT-NO.
139700210928           MOVE CURR-INVESTMENT-CODE TO WS-INVESTMENT-CODE.
139800210928           MOVE lncc_R               TO WS-MODE.
139900210928           MOVE COMM-EFFECT-DATE     TO WS-TRADE-DATE.
140000210928
140100210928           CALL "FXGETFMV" USING WS-ACCOUNT-NO,
140200210928                                 WS-TRADE-DATE,
140300210928                                 WS-FMV-AMT,
140400210928                                 WS-MODE,
140500210928                                 WS-CONTRACT-NO,
140600210928                                 WS-INVESTMENT-CODE,
140700210928                                 WS-UNIT-AMOUNT.
140800210928
140900210928           MOVE WS-UNIT-AMOUNT       TO CURR-OPENING-UNIT-BAL.
141000210928
141100210928
141200210928
141300210928      *GOUB-0010.
141400210928      *    READ TRANS-R NEXT RECORD
141500210928      *         AT END
141600210928      *         GO TO GOUB-EXIT.
141700210928      *
141800210928      *    IF ACCOUNT-NO OF TRANS-R NOT = CURR-ACCOUNT-NO
141900210928      *       GO TO GOUB-EXIT
142000210928      *    END-IF.
142100210928      *
142200210928      *    IF INVESTMENT-CODE OF TRANS-R NOT = CURR-INVESTMENT-CODE
142300210928      *       GO TO GOUB-EXIT
142400210928      *    END-IF.
142500210928
142600210928      *    IF PROCESS-DATE OF TRANS-R > COMM-PROCESS-DATE OR
142700210928      *       PROCESS-DATE OF TRANS-R < COMM-EFFECT-DATE
142800210928      *       GO TO GOUB-EXIT
142900210928      *    END-IF.
143000210928      *
143100210928      *    MOVE "N" TO WS-NEED-GBV-FLAG.
143200210928      *    IF PROCESS-DATE OF TRANS-R = COMM-EFFECT-DATE
143300210928      *       MOVE "Y" TO WS-NEED-GBV-FLAG
143400210928      *    END-IF.
143500210928
143600210928      *    MOVE TRANS-TYPE-CODE OF TRANS-R
143700210928      *      TO TRANS-CATEGORY.
143800210928      *    MOVE TRANS-STATUS-CODE OF TRANS-R
143900210928      *      TO TRANS-STATUS-CATEGORY.
144000210928      *    MOVE REVERSE OF TRANS-R
144100210928      *      TO TRANS-REVERSE-CATEGORY.
144200210928
144300210928      *    IF TRANS-REVERSED
144400210928      *       GO TO GOUB-0010
144500210928      *    END-IF.
144600210928
144700210928      *    IF NOT HISTORY
144800210928      *       GO TO GOUB-0010
144900210928      *    END-IF.
145000210928
145100210928      *    IF NOT VALID-TRANSACTION
145200210928      *       GO TO GOUB-0010
145300210928      *    END-IF.
145400210928
145500210928      *    INITIALIZE MFATRCODP OF TRANS-CONT-DTL-R-REC.
145600210928      *    MOVE PLACEMENT-DATE OF TRANS-R
145700210928      *      TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-R.
145800210928      *    MOVE TRANS-NO OF TRANS-R
145900210928      *      TO TRANS-NO OF TRANS-CONTRACT-DTL-R.
146000210928      *    MOVE CURR-CONTRACT-NO
146100210928      *      TO CONTRACT-NO OF TRANS-CONTRACT-DTL-R.
146200210928
146300210928      *    READ TRANS-CONTRACT-DTL-R
146400210928      *         INVALID KEY
146500210928      *         GO TO GOUB-0010.
146600210928
146700210928      *    IF REVERSED-DDS OF TRANS-CONTRACT-DTL-R = "Y"
146800210928      *       GO TO GOUB-0010
146900210928      *    END-IF.
147000210928
147100210928      *    IF NEEDS-GBV-AMOUNT AND WS-TRANS-COUNT NOT = 0
147200210928      *       MOVE GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-R
147300210928      *         TO CURR-GUAR-BASE-VALUE-BEF
147400210928      *       GO TO GOUB-EXIT
147500210928      *    END-IF.
147600210928
14770021092826151** Check if the transaction is in exclude transaction table and
14780021092826151** it is a MFR transaction, don't udpate unit balance.
147900210928
14800021092826151 *    MOVE MFATRNP OF TRANS-R-REC
14810021092826151 *      TO MFATRNP OF TRANS-REC.
14820021092826151 *    PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
14830021092826151 *    IF EXCLUDE-TRANS-FLAG NOT = "Y" AND
14840021092826151 *       MAN-FEE-REB-TRANSACTION
14850021092826151 *       GO TO GOUB-0010
14860021092826151 *    END-IF.
14870021092826151 *    INITIALIZE MFATRNP OF TRANS-REC.
148800210928
148900210928      *    IF PURCHASE-TRANSACTION
14900021092826151 *       OR MAN-FEE-REB-TRANSACTION
149100210928      *       SUBTRACT ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R
149200210928      *           FROM CURR-OPENING-UNIT-BAL
149300210928      *    ELSE
149400210928      *       ADD ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R
149500210928      *        TO CURR-OPENING-UNIT-BAL
149600210928      *    END-IF.
149700210928
149800210928      *    ADD 1 TO WS-TRANS-COUNT.
149900210928
150000210928      *    GO TO GOUB-0010.
150100210928
150200210928      * RFS63488 - END
150300210928
150400210928       GOUB-EXIT.
150500210928           EXIT.
150600210928
150700210928      /
150800210928       GET-TRANS-GBV-BEF-RESET.
150900210928           INITIALIZE MFATRNP OF TRANS-GBV-REC.
151000210928           MOVE CURR-ACCOUNT-NO TO ACCOUNT-NO OF TRANS-GBV.
151100210928           MOVE CURR-INVESTMENT-CODE TO INVESTMENT-CODE OF TRANS-GBV.
151200210928           MOVE WS-NEXT-PROCESS-DATE TO PROCESS-DATE OF TRANS-GBV.
151300210928           MOVE ZEROES TO TRANS-PROC-SEQ-NO OF TRANS-GBV
151400210928                          PLACEMENT-DATE OF TRANS-GBV
151500210928                          TRANS-NO OF TRANS-GBV.
151600210928
151700210928           START TRANS-GBV
151800210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
151900210928                 INVALID KEY
152000210928                 GO TO GTGBR-EXIT.
152100210928
152200210928       GTGBR-0010.
152300210928           READ TRANS-GBV NEXT RECORD
152400210928                AT END
152500210928                GO TO GTGBR-EXIT.
152600210928
152700210928           IF ACCOUNT-NO OF TRANS-GBV NOT = CURR-ACCOUNT-NO
152800210928              GO TO GTGBR-EXIT
152900210928           END-IF.
153000210928
153100210928           IF INVESTMENT-CODE OF TRANS-GBV NOT = CURR-INVESTMENT-CODE
153200210928              GO TO GTGBR-EXIT
153300210928           END-IF.
153400210928
153500210928           IF PROCESS-DATE OF TRANS-GBV > COMM-EFFECT-DATE
153600210928              GO TO GTGBR-0010
153700210928           END-IF.
153800210928
153900210928           MOVE TRANS-TYPE-CODE OF TRANS-GBV
154000210928             TO TRANS-CATEGORY.
154100210928           MOVE TRANS-STATUS-CODE OF TRANS-GBV
154200210928             TO TRANS-STATUS-CATEGORY.
154300210928           MOVE REVERSE OF TRANS-GBV
154400210928             TO TRANS-REVERSE-CATEGORY.
154500210928
154600210928           IF TRANS-REVERSED
154700210928              GO TO GTGBR-0010
154800210928           END-IF.
154900210928
155000210928           IF NOT HISTORY
155100210928              GO TO GTGBR-0010
155200210928           END-IF.
155300210928
155400210928           IF NOT VALID-TRANSACTION
155500210928              GO TO GTGBR-0010
155600210928           END-IF.
155700210928
155800210928           INITIALIZE MFATRCODP OF TRANS-CONT-DTL-R-REC.
155900210928           MOVE PLACEMENT-DATE OF TRANS-GBV
156000210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DTL-R.
156100210928           MOVE TRANS-NO OF TRANS-GBV
156200210928             TO TRANS-NO OF TRANS-CONTRACT-DTL-R.
156300210928           MOVE CURR-CONTRACT-NO
156400210928             TO CONTRACT-NO OF TRANS-CONTRACT-DTL-R.
156500210928
156600210928           READ TRANS-CONTRACT-DTL-R
156700210928                INVALID KEY
156800210928                GO TO GTGBR-0010.
156900210928
157000210928           IF REVERSED-DDS OF TRANS-CONTRACT-DTL-R = "Y"
157100210928              GO TO GTGBR-0010
157200210928           END-IF.
157300210928
157400210928           MOVE GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-R
157500210928             TO CURR-GUAR-BASE-VALUE-BEF.
157600210928           MOVE GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DTL-R
157700210928             TO CURR-GUAR-BASE-VAL-CUR-BEF.
157800210928
157900210928      *    GO TO GTGBR-0010.
158000210928
158100210928       GTGBR-EXIT.
158200210928           EXIT.
158300210928      /
158400210928       UPD-ACC-CON-INV-BUY.
158500210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-REC.
158600210928           MOVE CURR-ACCOUNT-NO
158700210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
158800210928           MOVE CURR-CONTRACT-NO
158900210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
159000210928           MOVE CURR-INVESTMENT-CODE
159100210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
159200210928
159300210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
159400210928                INVALID KEY
159500210928                GO TO UACIB-EXIT.
159600210928
159700210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
159800210928             TO OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
159900210928           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
160000210928             TO OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
160100210928
160200210928           MOVE WS-ARRAY-INVR-GBV-CUR
160300210928             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
160400210928             TO GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
160500210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
160600210928              MOVE WS-ARRAY-INVR-GBV-CUR
160700210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
160800210928                TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
160900210928           ELSE
161000210928              MOVE WS-ARRAY-INVR-GBV
161100210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
161200210928                TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
161300210928           END-IF.
161400210928
161500210928           REWRITE ACC-CON-INV-REC.
161600210928
161700210928       UACIB-EXIT.
161800210928           EXIT.
161900210928      /
162000210928       CALC-CONTRACT-MARKET-VALUE.
162100210928
162200210928           SET INVRIDX TO 1.
162300210928           SET INVRIDX DOWN BY 1.
162400210928
162500210928           SET CONTIDX TO 1.
162600210928           SET CONTIDX DOWN BY 1.
162700210928
162800210928       CCMV-0010.
162900210928           SET INVRIDX UP BY 1.
163000210928
163100210928           IF WS-ARRAY-INVR-ACCOUNT-NO
163200210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
163300210928              WS-ARRAY-INVR-CONTRACT-NO
163400210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
163500210928              WS-ARRAY-INVR-RESET-NO
163600210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = 0 OR
163700210928              WS-ARRAY-INVR-INVEST-CODE
163800210928                 OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) = " "
163900210928              GO TO CCMV-EXIT.
164000210928
164100210928           MOVE "N" TO WS-DIFF-INVESTMENT-FLAG.
164200210928           IF CURR-INVESTMENT-CODE NOT =
164300210928              WS-ARRAY-INVR-INVEST-CODE OF
164400210928                 WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
164500210928              MOVE "Y" TO WS-DIFF-INVESTMENT-FLAG
164600210928           END-IF.
164700210928
164800210928           MOVE CURR-INVESTMENT-CODE TO WS-OLD-CURR-INVESTMENT-CODE.
164900210928           MOVE WS-ARRAY-INVR-INVEST-CODE
165000210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
165100210928             TO CURR-INVESTMENT-CODE
165200210928                WS-CONT-INVESTMENT-CODE.
165300210928           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
165400210928           MOVE WS-OLD-CURR-INVESTMENT-CODE TO CURR-INVESTMENT-CODE.
165500210928
165600210928           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
165700210928              MOVE CURRENCY-DDS OF INVESTMENT TO WS-EXCH-CURRENCY
165800210928              MOVE WS-CURR-TRANS-PLACEMENT-DATE
165900210928                   TO WS-EXCH-PLACEMENT-DATE
166000210928              MOVE WS-CURR-TRANS-TRANS-NO TO WS-EXCH-TRANS-NO
166100210928              MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
166200210928              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
166300210928              IF WS-EXCH-RATE-VALUE = 0 OR
166400210928                 WS-EXCHANGE-FOUND NOT = "Y"
166500210928                 MOVE "06" TO WS-REJECTION-CODE
166600210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
166700210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
166800210928                 MOVE WS-EXCH-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
166900210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
167000210928                 MOVE WS-EXCH-TRANS-NO TO WS-MISC-INFO-2-KEY-2
167100210928                 PERFORM LOG-ERROR THRU LER-EXIT
167200210928                 GO TO CCMV-EXIT
167300210928              END-IF
167400210928           ELSE
167500210928              MOVE "Y" TO WS-EXCHANGE-FOUND
167600210928              MOVE 1.0 TO WS-EXCH-RATE-VALUE
167700210928           END-IF.
167800210928
167900210928           IF CURR-INVESTMENT-CODE NOT = WS-CONT-INVESTMENT-CODE
168000210928              PERFORM GET-INVESTMENT-MARKET-VALUE THRU GIMV-EXIT
168100210928              IF WS-PRICE-FOUND NOT = "Y" OR
168200210928                 WS-INV-UNIT-PRICE = 0
168300210928R11622           PERFORM GET-LAST-UNIT-PRICE THRU GLUP-EXIT
168400210928R11622           IF WS-PRICE-FOUND NOT = "Y" OR
168500210928R11622              WS-INV-UNIT-PRICE = 0
168600210928                 MOVE "05" TO WS-REJECTION-CODE
168700210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
168800210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
168900210928                 MOVE WS-EXCH-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
169000210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
169100210928                 MOVE WS-EXCH-TRANS-NO TO WS-MISC-INFO-2-KEY-2
169200210928                 PERFORM LOG-ERROR THRU LER-EXIT
169300210928                 GO TO CCMV-EXIT
169400210928R11622           END-IF
169500210928              END-IF
169600210928           ELSE
169700210928              MOVE WS-CURR-TRANS-UNIT-PRICE TO WS-INV-UNIT-PRICE
169800210928           END-IF.
169900210928
170000210928       CCMV-0020.
170100210928           MOVE WS-ARRAY-INVR-UNIT-BAL
170200210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
170300210928             TO WS-INV-OPENING-UNIT-BAL.
170400210928
170500210928      ** Calculate the market value of the investment before this trade.
170600210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
170700210928              COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
170800210928                      WS-INV-OPENING-UNIT-BAL * WS-INV-UNIT-PRICE
170900210928           ELSE
171000210928              COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
171100210928                      WS-INV-OPENING-UNIT-BAL *
171200210928                      WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
171300210928           END-IF.
171400210928
171500210928      * Get the GBV of the current account/contract/investment
171600210928           IF FIRST-RECALC-PASS
171700210928              MOVE WS-ARRAY-INVR-GBV
171800210928                   OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
171900210928                TO WS-INV-BEF-GBV
172000210928           ELSE
172100210928           MOVE WS-ARRAY-INVR-ACCOUNT-NO
172200210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
172300210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
172400210928           MOVE WS-ARRAY-INVR-CONTRACT-NO
172500210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
172600210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
172700210928           MOVE WS-ARRAY-INVR-INVEST-CODE
172800210928                OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
172900210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-SWI
173000210928
173100210928           READ ACCOUNT-CONTRACT-INVEST-SWI
173200210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
173300210928                TO WS-INV-BEF-GBV
173400210928           END-IF.
173500210928
173600210928           IF CURR-INVESTMENT-CODE = WS-CONT-INVESTMENT-CODE
173700210928              IF NOT SWITCH-IN-TRANSACTION
173800210928R11622*          SUBTRACT WS-CURR-TRANS-UNIT-AMT FROM
173900210928R11622           SUBTRACT WS-CURR-ORIG-UNIT-BAL FROM
174000210928                          WS-ARRAY-INVR-UNIT-BAL
174100210928                             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
174200210928              ELSE
174300210928R11622*          ADD WS-CURR-TRANS-UNIT-AMT
174400210928R11622           ADD WS-CURR-ORIG-UNIT-BAL
174500210928                       TO WS-ARRAY-INVR-UNIT-BAL
174600210928                             OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX)
174700210928              END-IF
174800210928           END-IF.
174900210928
175000210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
175100210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
175200210928                 WS-ARRAY-INVR-UNIT-BAL
175300210928                    OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) *
175400210928                       WS-INV-UNIT-PRICE
175500210928           ELSE
175600210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
175700210928                 WS-ARRAY-INVR-UNIT-BAL
175800210928                    OF WS-ACC-CONT-INV-RESET-ARRAY(INVRIDX) *
175900210928                       WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
176000210928           END-IF.
176100210928
17620021092826151** Only updates unit/MV if this is a transaction on exclude table
17630021092826151      IF EXCLUDE-TRANS-FLAG = "Y"
17640021092826151         GO TO CCMV-0010
17650021092826151      END-IF.
176600210928
176700210928           ADD WS-INV-BEF-GBV TO WS-CURR-CONTRACT-GBV-BEF.
176800210928           ADD WS-INV-BEF-MARKET-VALUE TO WS-CONT-INV-MARKET-VALUE.
176900210928           ADD WS-INV-AFT-MARKET-VALUE TO WS-CURR-CONTRACT-MV-AFT.
177000210928
177100210928           SET CONTIDX UP BY 1.
177200210928      * RFS49699 - Array logging logic
177300210928
177400210928           IF CONTIDX  > WS-ARRAY2-MAX-USED
177500210928               MOVE CONTIDX                TO WS-ARRAY2-MAX-USED
177600210928           END-IF.
177700210928
177800210928      * RFS49699 - End
177801211007      * RFS1117445 start
177802211007           IF CONTIDX >  ln_InvArraySize
177803211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
177804211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(CONTIDX)
177805211007                      WS-ARRAY-CONTRACT-NO(CONTIDX)
177806211007                      WS-ARRAY-INVESTMENT-CODE(CONTIDX)
177807211007                      WS-ARRAY-INV-CURR-CODE(CONTIDX)
177808211007                      WS-ARRAY-BEFORE-MV(CONTIDX)
177809211007                      WS-ARRAY-BEFORE-GBV(CONTIDX)
177810211007                      WS-ARRAY-BEFORE-NDV(CONTIDX)
177811211007                      WS-ARRAY-AFTER-MV(CONTIDX)
177812211007                      WS-ARRAY-INV-EXCH-RATE(CONTIDX)
177813211007           END-IF
177814211007      *    RFS1117445 End
177815211007
177900210928           MOVE CURR-ACCOUNT-NO TO WS-ARRAY-ACCOUNT-NO(CONTIDX).
178000210928           MOVE WS-CONT-INVESTMENT-CODE
178100210928                TO WS-ARRAY-INVESTMENT-CODE(CONTIDX).
178200210928           MOVE CURR-CONTRACT-NO TO WS-ARRAY-CONTRACT-NO(CONTIDX).
178300210928           MOVE CURRENCY-DDS OF INVESTMENT
178400210928                TO WS-ARRAY-INV-CURR-CODE(CONTIDX).
178500210928           MOVE WS-INV-BEF-MARKET-VALUE TO WS-ARRAY-BEFORE-MV(CONTIDX).
178600210928           MOVE WS-INV-BEF-GBV TO WS-ARRAY-BEFORE-GBV(CONTIDX).
178700210928           MOVE WS-INV-AFT-MARKET-VALUE TO WS-ARRAY-AFTER-MV(CONTIDX).
178800210928           MOVE WS-EXCH-RATE-VALUE TO WS-ARRAY-INV-EXCH-RATE(CONTIDX).
178900210928
179000210928           ADD 1 TO WS-CONT-INV-ARRAY-COUNT.
179100210928
179200210928           GO TO CCMV-0010.
179300210928
179400210928       CCMV-EXIT.
179500210928           EXIT.
179600210928      /
179700210928       CALC-NEW-CHANGE-GBV.
179800210928
179900210928      ** Get the change in NDV/GBV from the out transaction
180000210928           IF WS-TRANSFER-GBV = "Y" AND SWITCH-IN-TRANSACTION
180100210928              MOVE ZEROES TO WS-SWO-NDV-CHANGE WS-SWO-GBV-CHANGE
180200210928              PERFORM GET-NDV-GBV-CHANGE THRU GNGC-EXIT
180300210928           END-IF.
180400210928
180500210928      ** Calculate the GBV change
180600210928RF8092     IF REDEMPTION-TRANSACTION
180700210928              IF WS-CONT-INV-MARKET-VALUE NOT = 0
180800210928              COMPUTE WS-GBV-CHANGE ROUNDED = WS-CURR-CONTRACT-GBV-BEF *
180900210928                      WS-CURR-TRANS-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
181000210928              ELSE
181100210928               MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GBV-CHANGE
181200210928              END-IF
181300210928           ELSE
181400210928              IF WS-TRANSFER-GBV = "N" AND PURCHASE-TRANSACTION
181500210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-GBV-CHANGE
181600210928              ELSE
181700210928                 IF WS-TRANSFER-GBV = "Y" AND PURCHASE-TRANSACTION
181800210928                    MOVE WS-SWO-GBV-CHANGE TO WS-GBV-CHANGE
181900210928                 END-IF
182000210928              END-IF
182100210928RF8092     END-IF.
182200210928
182300210928           IF SWITCH-OUT OR TRANSFER-OUT
182400210928              MOVE WS-GBV-CHANGE TO WS-SWO-GBV-CHANGE
182500210928                                    WS-GBV-CHANGE-AMT
182600210928           END-IF.
182700210928
182800210928           IF SWITCH-IN OR TRANSFER-IN
182900210928              ADD WS-GBV-CHANGE TO WS-CURR-CONTRACT-GBV-BEF
183000210928                  GIVING WS-CURR-CONTRACT-GBV-AFT
183100210928           ELSE
183200210928              SUBTRACT WS-GBV-CHANGE FROM WS-CURR-CONTRACT-GBV-BEF
183300210928                  GIVING WS-CURR-CONTRACT-GBV-AFT
183400210928           END-IF.
183500210928
183600210928       CNCG-EXIT.
183700210928           EXIT.
183800210928      /
183900210928       GET-NDV-GBV-CHANGE.
18400021092816512 * Get the fee charges for the out transaction.
18410021092816512      MOVE 0 TO WS-DEDUCTION-AMT.
18420021092816512      MOVE PLACEMENT-DATE OF TRANS-OFFSET
18430021092816512           TO WS-TRN-PLACEMENT-DATE.
18440021092816512      MOVE TRANS-NO       OF TRANS-OFFSET TO WS-TRN-TRANS-NO.
18450021092816512      MOVE PROCESS-DATE   OF TRANS-OFFSET TO WS-TRN-PROCESS-DATE.
18460021092816512      PERFORM GET-DEDUCTION-AMT THRU GDA-EXIT.
184700210928
184800210928           INITIALIZE MFATRCTGP OF TRANS-CONTRACT-TGT-REC.
184900210928           MOVE WS-CURR-TRANS-PLACEMENT-DATE
185000210928             TO PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET2.
185100210928           MOVE WS-CURR-TRANS-TRANS-NO
185200210928             TO TRANS-NO-2 OF TRANS-CONTRACT-TARGET2.
185300210928           MOVE CURR-CONTRACT-NO
185400210928             TO CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET2.
185500210928
185600210928           START TRANS-CONTRACT-TARGET2
185700210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
185800210928                 INVALID KEY
18590021092816512 *          GO TO GNGC-EXIT.
18600021092816512            GO TO GNGC-0500.
186100210928
186200210928       GNGC-0010.
186300210928           READ TRANS-CONTRACT-TARGET2 NEXT RECORD
186400210928                AT END
18650021092816512 *         GO TO GNGC-EXIT.
18660021092816512           GO TO GNGC-0500.
186700210928
186800210928           IF WS-CURR-TRANS-PLACEMENT-DATE NOT =
186900210928              PLACEMENT-DATE-2 OF TRANS-CONTRACT-TARGET2 OR
187000210928              WS-CURR-TRANS-TRANS-NO NOT =
187100210928              TRANS-NO-2 OF TRANS-CONTRACT-TARGET2 OR
187200210928              CURR-CONTRACT-NO NOT =
187300210928              CONTRACT-NO-2 OF TRANS-CONTRACT-TARGET2
18740021092816512 *       GO TO GNGC-EXIT
18750021092816512         GO TO GNGC-0500
187600210928           END-IF.
187700210928
187800210928           INITIALIZE MFATRCODP OF TRANS-CON-DTL-REC.
187900210928           MOVE PLACEMENT-DATE OF TRANS-CONTRACT-TARGET2
188000210928             TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS.
188100210928           MOVE TRANS-NO OF TRANS-CONTRACT-TARGET2
188200210928             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
188300210928           MOVE CONTRACT-NO OF TRANS-CONTRACT-TARGET2
188400210928             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
188500210928
188600210928           READ TRANS-CONTRACT-DETAILS
188700210928                INVALID KEY
18880021092816512 *         GO TO GNGC-EXIT.
18890021092816512           GO TO GNGC-0500.
189000210928
189100210928           IF WS-DEDUCTION-AMT > 0
18920021092816512           GO TO GNGC-0020.
189300210928
189400210928           ADD NDV-CHANGE OF TRANS-CONTRACT-DETAILS
189500210928             TO WS-SWO-NDV-CHANGE.
189600210928           ADD GBV-CHANGE OF TRANS-CONTRACT-DETAILS
189700210928             TO WS-SWO-GBV-CHANGE.
189800210928
189900210928           GO TO GNGC-0010.
190000210928
190100210928       GNGC-0020.
190200210928
190300210928           COMPUTE WS-OUT-TRANS-GROSS ROUNDED =
190400210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
190500210928                   UNIT-PRICE OF TRANS-OFFSET.
190600210928
190700210928      * Apply the deductions on the out-side of the transaction
190800210928           COMPUTE WS-DEDUCTION-PROP ROUNDED =
190900210928                   WS-OUT-TRANS-GROSS / GROSS-AMT OF TRANS-OFFSET
191000210928                   * WS-DEDUCTION-AMT.
191100210928
191200210928           COMPUTE WS-DEDUCTION-GBV-CHANGE ROUNDED =
191300210928                  WS-DEDUCTION-PROP *
191400210928                  GBV-CHANGE OF TRANS-CONTRACT-DETAILS  /
191500210928                  WS-OUT-TRANS-GROSS.
191600210928
191700210928           COMPUTE WS-SWO-GBV-CHANGE ROUNDED
191800210928                 = WS-SWO-GBV-CHANGE +
191900210928                   GBV-CHANGE OF TRANS-CONTRACT-DETAILS -
192000210928                   WS-DEDUCTION-GBV-CHANGE.
192100210928
192200210928           COMPUTE WS-DEDUCTION-NDV-CHANGE ROUNDED =
192300210928                  WS-DEDUCTION-PROP *
192400210928                  NDV-CHANGE OF TRANS-CONTRACT-DETAILS  /
192500210928                  WS-OUT-TRANS-GROSS.
192600210928
192700210928           COMPUTE WS-SWO-NDV-CHANGE ROUNDED
192800210928                 = WS-SWO-NDV-CHANGE +
192900210928                   NDV-CHANGE OF TRANS-CONTRACT-DETAILS -
193000210928                   WS-DEDUCTION-NDV-CHANGE.
193100210928
193200210928           GO TO GNGC-0010.
193300210928
193400210928       GNGC-0500.
19350021092816512 * Get the fee charges for the IN  transaction.
19360021092816512      MOVE 0 TO WS-DEDUCTION-AMT.
19370021092816512      MOVE PLACEMENT-DATE OF TRANS
19380021092816512           TO WS-TRN-PLACEMENT-DATE.
19390021092816512      MOVE TRANS-NO       OF TRANS        TO WS-TRN-TRANS-NO.
19400021092816512      MOVE PROCESS-DATE   OF TRANS        TO WS-TRN-PROCESS-DATE.
19410021092816512      PERFORM GET-DEDUCTION-AMT THRU GDA-EXIT.
19420021092816512
19430021092816512      IF WS-DEDUCTION-AMT <= 0
194400210928              GO TO GNGC-EXIT.
194500210928
194600210928           COMPUTE WS-IN-TRANS-GROSS ROUNDED =
194700210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DTL-R   *
194800210928                   UNIT-PRICE OF TRANS.
194900210928
195000210928           COMPUTE WS-DEDUCTION-PROP ROUNDED =
195100210928                   WS-IN-TRANS-GROSS / NET-AMT OF TRANS
195200210928                   * WS-DEDUCTION-AMT.
195300210928
195400210928           COMPUTE WS-DEDUCTION-GBV-CHANGE ROUNDED =
195500210928                  WS-DEDUCTION-PROP * WS-SWO-GBV-CHANGE /
195600210928                  WS-IN-TRANS-GROSS.
195700210928
195800210928           COMPUTE WS-SWO-GBV-CHANGE ROUNDED
195900210928                 = WS-SWO-GBV-CHANGE -
196000210928                   WS-DEDUCTION-GBV-CHANGE.
196100210928
196200210928           COMPUTE WS-DEDUCTION-NDV-CHANGE ROUNDED =
196300210928                  WS-DEDUCTION-PROP * WS-SWO-NDV-CHANGE /
196400210928                  WS-IN-TRANS-GROSS.
196500210928
196600210928           COMPUTE WS-SWO-NDV-CHANGE ROUNDED
196700210928                 = WS-SWO-NDV-CHANGE -
196800210928                   WS-DEDUCTION-NDV-CHANGE.
196900210928       GNGC-EXIT.
197000210928           EXIT.
197100210928      /
197200210928       RECALC-NETDEP-GBV-VALUES.
197300210928
197400210928           IF WS-REJECTION-CODE NOT = " " AND "00"
197500210928              GO TO RNGV-EXIT
197600210928           END-IF.
197700210928
197800210928           INITIALIZE WS-CONT-INV-COUNT WS-INV-GBV-PERCENT-TOTAL
197900210928                                        WS-INV-NDV-PERCENT-TOTAL
198000210928R12702                                  WS-CONT-NDV-AFT-TOTAL
198100210928R12702                                  WS-CONT-GBV-AFT-TOTAL.
198200210928           SET CONTIDX TO 1.
198300210928           SET CONTIDX DOWN BY 1.
198400210928
198500210928       RNGV-NEXT.
198600210928           SET CONTIDX UP BY 1.
198601211007
198602211007111744     IF  CONTIDX > WS-CONT-INV-ARRAY-COUNT
198603211007111744        GO TO RNGV-EXIT
198604211007111744     END-IF
198605211007
198700210928           IF WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
198800210928              IS EQUAL TO 0 OR
198900210928              WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
199000210928              IS EQUAL TO 0 OR
199100210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
199101211007              IS EQUAL TO " "  OR
199102211007111744        CONTIDX > WS-CONT-INV-ARRAY-COUNT
199300210928              GO TO RNGV-EXIT
199400210928           END-IF.
199500210928
199600210928       RNGV-PROCESS.
199700210928           INITIALIZE MFAACCCIP OF ACC-CON-INV-REC.
199800210928           MOVE WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
199900210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
200000210928           MOVE WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
200100210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
200200210928           MOVE WS-ARRAY-INVESTMENT-CODE
200300210928             OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
200400210928             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
200500210928
200600210928           READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
200700210928                INVALID KEY
200800210928                GO TO RNGV-NEXT.
200900210928
201000210928RF8092     IF SWITCH-IN OR TRANSFER-IN
201100210928              IF CURR-INVESTMENT-CODE =
201200210928                 WS-ARRAY-INVESTMENT-CODE
201300210928                    OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
201400210928                 IF WS-TRANSFER-GBV = "N"
201500210928                    MOVE WS-CURR-TRANS-GROSS-AMT TO WS-INV-GBV-AFT
201600210928                                                    WS-GBV-CHANGE-AMT
201700210928                 ELSE
201800210928                    MOVE WS-SWO-GBV-CHANGE TO WS-INV-GBV-AFT
201900210928                                              WS-GBV-CHANGE-AMT
202000210928                 END-IF
202100210928                 MOVE WS-SWO-NDV-CHANGE TO WS-INV-NDV-AFT
202200210928                 ADD WS-ARRAY-BEFORE-GBV
202300210928                    OF WS-ACC-CONT-INV-ARRAY(CONTIDX) TO WS-INV-GBV-AFT
202400210928                 ADD WS-ARRAY-BEFORE-NDV
202500210928                    OF WS-ACC-CONT-INV-ARRAY(CONTIDX) TO WS-INV-NDV-AFT
202600210928                 MOVE "Y" TO WS-RECORD-FOUND
202700210928                 GO TO RNGV-INFUND
202800210928              ELSE
202900210928                 MOVE "N" TO WS-RECORD-FOUND
203000210928                 GO TO RNGV-NEXT
203100210928              END-IF
203200210928RF8092     END-IF.
203300210928           ADD 1 TO WS-CONT-INV-COUNT.
203400210928
203500210928           IF PURCHASE-TRANSACTION AND WS-CURR-CONTRACT-GBV-BEF = 0 AND
203600210928              WS-ARRAY-INVESTMENT-CODE
203700210928                OF WS-ACC-CONT-INV-ARRAY(CONTIDX) = CURR-INVESTMENT-CODE
203800210928              IF SWITCH-IN OR TRANSFER-IN
203900210928                 MOVE WS-SWO-GBV-CHANGE TO WS-INV-GBV-AFT
204000210928              ELSE
204100210928                 MOVE WS-CURR-TRANS-GROSS-AMT TO WS-INV-GBV-AFT
204200210928              END-IF
204300210928           ELSE
204400210928R12387        IF WS-CURR-CONTRACT-MV-AFT NOT = 0
204500210928              COMPUTE WS-INV-GBV-PERCENT ROUNDED =
204600210928                   WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
204700210928R12387        ELSE
204800210928R12387           MOVE 0 TO WS-INV-GBV-PERCENT
204900210928R12387        END-IF
205000210928
205100210928           ADD WS-INV-GBV-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
205200210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
205300210928              WS-INV-GBV-PERCENT-TOTAL NOT = 1.000 AND
205400210928              WS-INV-GBV-PERCENT-TOTAL NOT = 0
205500210928              SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
205600210928                       GIVING WS-DUMMY-PERCENT
205700210928              ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
205800210928R12454        ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
205900210928XXXXX2     ELSE
206000210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
206100210928                (WS-INV-GBV-PERCENT-TOTAL = 0.999 OR
206200210928                 WS-INV-GBV-PERCENT-TOTAL > 1.000)
206300210928                 SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
206400210928                          GIVING WS-DUMMY-PERCENT
206500210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
206600210928R12454           ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
206700210928XXXXX2        END-IF
206800210928           END-IF
206900210928
207000210928           COMPUTE WS-INV-GBV-AFT ROUNDED =
207100210928                   WS-CURR-CONTRACT-GBV-AFT * WS-INV-GBV-PERCENT
207200210928           END-IF.
207300210928
207400210928      * FOR NDV
207500210928           IF PURCHASE-TRANSACTION AND WS-CURR-CONTRACT-NDV-BEF = 0
207600210928              IF NOT SWITCH-IN
207700210928                 MOVE WS-CURR-CONTRACT-MV-AFT TO WS-INV-NDV-AFT
207800210928              ELSE
207900210928                 MOVE WS-SWO-NDV-CHANGE TO WS-INV-NDV-AFT
208000210928              END-IF
208100210928           ELSE
208200210928R12387        IF WS-CURR-CONTRACT-MV-AFT NOT = 0
208300210928                 COMPUTE WS-INV-NDV-PERCENT ROUNDED =
208400210928                   WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
208500210928R12387        ELSE
208600210928R12387           MOVE 0 TO WS-INV-NDV-PERCENT
208700210928R12387        END-IF
208800210928
208900210928           ADD WS-INV-NDV-PERCENT TO WS-INV-NDV-PERCENT-TOTAL
209000210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
209100210928              WS-INV-NDV-PERCENT-TOTAL NOT = 1.00 AND
209200210928              WS-INV-NDV-PERCENT-TOTAL NOT = 0
209300210928              SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
209400210928                       GIVING WS-DUMMY-PERCENT
209500210928              ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
209600210928R12454        ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT-TOTAL
209700210928XXXXX2     ELSE
209800210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
209900210928                (WS-INV-NDV-PERCENT-TOTAL = 0.999 OR
210000210928                 WS-INV-NDV-PERCENT-TOTAL > 1.000)
210100210928                 SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
210200210928                          GIVING WS-DUMMY-PERCENT
210300210928                 ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
210400210928R12454           ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT-TOTAL
210500210928XXXXX2        END-IF
210600210928           END-IF
210700210928
210800210928           COMPUTE WS-INV-NDV-AFT ROUNDED =
210900210928                   WS-CURR-CONTRACT-NDV-AFT * WS-INV-NDV-PERCENT
211000210928           END-IF.
211100210928
211200210928       RNGV-INFUND.
211300210928           IF WS-ARRAY-INV-CURR-CODE(CONTIDX) = UNITRAX-BASE-CURRENCY
211400210928              MOVE WS-INV-GBV-AFT TO WS-INV-GBV-AFT-CUR
211500210928              MOVE WS-INV-NDV-AFT TO WS-INV-NDV-AFT-CUR
211600210928           ELSE
211700210928              COMPUTE WS-INV-GBV-AFT-CUR ROUNDED =
211800210928                      WS-INV-GBV-AFT * WS-ARRAY-INV-EXCH-RATE(CONTIDX)
211900210928              COMPUTE WS-INV-NDV-AFT-CUR ROUNDED =
212000210928                      WS-INV-NDV-AFT * WS-ARRAY-INV-EXCH-RATE(CONTIDX)
212100210928           END-IF.
212200210928
212300210928           IF WS-INV-GBV-AFT IS NEGATIVE AND
212400210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
212500210928              IS EQUAL TO CURR-INVESTMENT-CODE
212600210928              MOVE 0 TO WS-INV-GBV-AFT
212700210928                        WS-INV-GBV-AFT-CUR
212800210928           END-IF.
212900210928
213000210928           IF WS-INV-NDV-AFT IS NEGATIVE AND
213100210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
213200210928              IS EQUAL TO CURR-INVESTMENT-CODE
213300210928              MOVE 0 TO WS-INV-NDV-AFT
213400210928                        WS-INV-NDV-AFT-CUR
213500210928           END-IF.
213600210928
213700210928      * Update the Old NDV and GBV only if the transaction pertains that
213800210928      * the right fund in the contract.
213900210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
214000210928              IS EQUAL TO CURR-INVESTMENT-CODE
214100210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
214200210928             TO OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
214300210928           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
214400210928             TO OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
214500210928           END-IF.
214600210928
214700210928      ** Update the Trans-Contract-Details record with the new GBV
214800210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
214900210928              IS EQUAL TO CURR-INVESTMENT-CODE
215000210928              MOVE WS-INV-GBV-AFT
215100210928                TO GUAR-BASE-VALUE OF TRANS-CONTRACT-DTL-R
215200210928      * Store the value of the change in GBV for trade reversal
215300210928              IF SWITCH-IN-TRANSACTION OR REDEMPTION-TRANSACTION
215400210928                 MOVE WS-GBV-CHANGE-AMT
215500210928                   TO GBV-CHANGE OF TRANS-CONTRACT-DTL-R
215600210928              ELSE
215700210928                 MOVE WS-INV-GBV-AFT-CUR
215800210928                   TO GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DTL-R
215900210928              END-IF
216000210928              REWRITE TRANS-CONT-DTL-R-REC
216100210928           END-IF.
216200210928
216300210928           MOVE WS-INV-GBV-AFT
216400210928                TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT.
216500210928           MOVE WS-INV-GBV-AFT-CUR
216600210928                TO GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT.
216700210928
216800210928R12702     IF REDEMPTION-TRANSACTION
216900210928R12702        ADD WS-INV-GBV-AFT TO WS-CONT-GBV-AFT-TOTAL
217000210928R12702*       ADD WS-INV-NDV-AFT TO WS-CONT-NDV-AFT-TOTAL
217100210928R12702     END-IF.
217200210928
217300210928           REWRITE ACC-CON-INV-REC.
217400210928
217500210928           GO TO RNGV-NEXT.
217600210928
217700210928       RNGV-EXIT.
217800210928           EXIT.
217900210928      /
218000210928       CHECK-NDV-GBV-ROUNDING.
218100210928           IF PURCHASE-TRANSACTION
218200210928              GO TO CNGR-EXIT
218300210928           END-IF.
218400210928
218500210928           MOVE "N" TO WS-NDV-DIFF-FLAG
218600210928                       WS-GBV-DIFF-FLAG.
218700210928           MOVE 0   TO WS-NDV-DIFF-AMOUNT
218800210928                       WS-GBV-DIFF-AMOUNT.
218900210928           MOVE "Y" TO WS-NDV-UPDATE-FLAG
219000210928                       WS-GBV-UPDATE-FLAG.
219100210928
219200210928           IF WS-CURR-CONTRACT-GBV-AFT NOT = WS-CONT-GBV-AFT-TOTAL
219300210928              MOVE "Y" TO WS-GBV-DIFF-FLAG
219400210928              SUBTRACT WS-CONT-GBV-AFT-TOTAL
219500210928                  FROM WS-CURR-CONTRACT-GBV-AFT
219600210928                GIVING WS-GBV-DIFF-AMOUNT
219700210928           END-IF.
219800210928
219900210928           IF GBV-DIFFERENCE-FOUND
220000210928              GO TO CNGR-0010
220100210928           END-IF.
220200210928
220300210928           GO TO CNGR-EXIT.
220400210928
220500210928       CNGR-0010.
220600210928           INITIALIZE MFAACCCIP OF ACCOUNT-CONTRACT-INVEST.
220700210928           MOVE CURR-ACCOUNT-NO
220800210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST.
220900210928           MOVE CURR-CONTRACT-NO
221000210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST.
221100210928           MOVE SPACES TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST.
221200210928
221300210928           START ACCOUNT-CONTRACT-INVEST
221400210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
221500210928                 INVALID KEY
221600210928                 GO TO CNGR-EXIT.
221700210928
221800210928       CNGR-0020.
221900210928           READ ACCOUNT-CONTRACT-INVEST NEXT RECORD
222000210928                AT END
222100210928                GO TO CNGR-EXIT.
222200210928
222300210928           IF CURR-ACCOUNT-NO NOT =
222400210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST OR
222500210928              CURR-CONTRACT-NO NOT =
222600210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST
222700210928              GO TO CNGR-EXIT
222800210928           END-IF.
222900210928
223000210928           IF OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST = 0 OR
223100210928              CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST = 0
223200210928              GO TO CNGR-0020
223300210928           END-IF.
223400210928
223500210928           IF GBV-DIFFERENCE-FOUND AND
223600210928              GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST = 0
223700210928              GO TO CNGR-0020
223800210928           END-IF.
223900210928
224000210928           IF GBV-DIFFERENCE-FOUND AND GBV-NOT-UPDATED
224100210928              ADD WS-GBV-DIFF-AMOUNT
224200210928                  TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST
224300210928                     GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST
224400210928              MOVE "N" TO WS-GBV-UPDATE-FLAG
224500210928              REWRITE ACCT-CONT-INVEST-REC
224600210928                      INVALID KEY
224700210928                      MOVE "Y" TO WS-GBV-UPDATE-FLAG
224800210928              END-REWRITE
224900210928           END-IF.
225000210928
225100210928           IF (GBV-DIFFERENCE-FOUND AND GBV-NOT-UPDATED)
225200210928               GO TO CNGR-0020
225300210928           END-IF.
225400210928
225500210928       CNGR-EXIT.
225600210928           EXIT.
225700210928      /
225800210928       GET-INVESTMENT-MARKET-VALUE.
225900210928           INITIALIZE MFAINVUPP OF INVESTMENT-UNIT-PRICE.
226000210928
226100210928           MOVE WS-CONT-INVESTMENT-CODE
226200210928                TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE.
226300210928           MOVE WS-CURR-TRANS-TRADE-DATE
226400210928                TO TRADE-DATE OF INVESTMENT-UNIT-PRICE.
226500210928           MOVE "Y" TO DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE.
226600210928
226700210928           READ INVESTMENT-UNIT-PRICE
226800210928           INVALID KEY
226900210928           GO TO GIMV-0010.
227000210928
227100210928           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
227200210928                TO WS-INV-UNIT-PRICE.
227300210928
227400210928           MOVE "Y" TO WS-PRICE-FOUND.
227500210928
227600210928           GO TO GIMV-EXIT.
227700210928
227800210928       GIMV-0010.
227900210928           MOVE " " TO DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE.
228000210928           READ INVESTMENT-UNIT-PRICE
228100210928           INVALID KEY
228200210928           MOVE "N" TO WS-PRICE-FOUND
228300210928           GO TO GIMV-EXIT.
228400210928
228500210928           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
228600210928                TO WS-INV-UNIT-PRICE.
228700210928
228800210928           MOVE "Y" TO WS-PRICE-FOUND.
228900210928
229000210928       GIMV-EXIT.
229100210928           EXIT.
229200210928      /
229300210928R11622 GET-LAST-UNIT-PRICE.
229400210928R11622     MOVE "N" TO WS-PRICE-FOUND.
229500210928R11622
229600210928R11622     INITIALIZE MFAINVUPP OF INVESTMENT-LAST-PRICE-REC.
229700210928R11622     MOVE WS-CONT-INVESTMENT-CODE
229800210928R11622       TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-LAST.
229900210928R11622     MOVE WS-CURR-TRANS-TRADE-DATE
230000210928R11622       TO TRADE-DATE OF INVESTMENT-UNIT-PRICE-LAST.
230100210928R11622
230200210928R11622     START INVESTMENT-UNIT-PRICE-LAST
230300210928R11622           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
230400210928R11622           INVALID KEY
230500210928R11622           GO TO GLUP-EXIT.
230600210928R11622
230700210928R11622 GLUP-0010.
230800210928R11622     READ INVESTMENT-UNIT-PRICE-LAST PRIOR RECORD
230900210928R11622          AT END
231000210928R11622          GO TO GLUP-EXIT.
231100210928R11622
231200210928R11622     IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-LAST NOT =
231300210928R11622        WS-CONT-INVESTMENT-CODE
231400210928R11622        GO TO GLUP-EXIT
231500210928R11622     END-IF.
231600210928R11622
231700210928R11622     IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE-LAST NOT = " "
231800210928R11622        GO TO GLUP-0010
231900210928R11622     END-IF.
232000210928R11622
232100210928R11622     MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE-LAST
232200210928R11622       TO WS-INV-UNIT-PRICE.
232300210928R11622
232400210928R11622     MOVE "Y" TO WS-PRICE-FOUND.
232500210928R11622
232600210928R11622 GLUP-EXIT.
232700210928R11622     EXIT.
232800210928      /
232900210928       GET-INVESTMENT-CURRENCY.
233000210928           MOVE CURR-INVESTMENT-CODE
233100210928             TO INVESTMENT-CODE OF INVESTMENT.
233200210928
233300210928           READ INVESTMENT.
233400210928
233500210928           IF WS-GET-LOAD-STRUCTURE = "Y"
233600210928              MOVE LOAD-STRUCTURE OF INVESTMENT TO WS-LOAD-STRUCTURE
233700210928              MOVE "N" TO WS-GET-LOAD-STRUCTURE
233800210928           END-IF.
233900210928
234000210928       GIC-EXIT.
234100210928           EXIT.
234200210928      /
234300210928       GET-EXCHANGE-RATE-2.
234400210928
234500210928           IF WS-DIFF-INVESTMENT-FLAG = "Y"
234600210928              GO TO GER2-0010.
234700210928
234800210928           INITIALIZE MFATREXRP OF TRANS-EXCHANGE-RATE-2-REC.
234900210928           MOVE WS-EXCH-PLACEMENT-DATE
235000210928                             TO PLACEMENT-DATE
235100210928                             OF TRANS-EXCHANGE-RATE-2.
235200210928           MOVE WS-EXCH-TRANS-NO
235300210928                             TO TRANS-NO
235400210928                             OF TRANS-EXCHANGE-RATE-2.
235500210928
235600210928           READ TRANS-EXCHANGE-RATE-2
235700210928           INVALID KEY
235800210928           GO TO GER2-0010.
235900210928
236000210928           IF CURRENCY-DDS OF TRANS-EXCHANGE-RATE-2 NOT =
236100210928              WS-EXCH-CURRENCY
236200210928             GO TO GER2-0010
236300210928           END-IF.
236400210928
236500210928           IF EXCHANGE-RATE OF TRANS-EXCHANGE-RATE-2 = 0
236600210928              GO TO GER2-0010
236700210928           END-IF.
236800210928
236900210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
237000210928           MOVE EXCHANGE-RATE OF TRANS-EXCHANGE-RATE-2
237100210928                             TO WS-EXCH-RATE-VALUE.
237200210928           GO TO GER2-EXIT.
237300210928
237400210928       GER2-0010.
237500210928
237600210928           INITIALIZE MFAEXRHMP OF EXCHANGE-RATE-M-2.
237700210928           MOVE WS-EXCH-TRADE-DATE
237800210928                             TO TRADE-DATE OF EXCHANGE-RATE-M-2.
237900210928           MOVE WS-EXCH-CURRENCY
238000210928                             TO CURRENCY-DDS OF EXCHANGE-RATE-M-2.
238100210928           MOVE PROG-EXCHANGE-RATE-TYPE
238200210928                             TO EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M-2.
238300210928
238400210928           READ EXCHANGE-RATE-M-2
238500210928           INVALID KEY
238600210928             GO TO GER2-EXIT.
238700210928
238800210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
238900210928           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-2
239000210928                             TO WS-EXCH-RATE-VALUE.
239100210928
239200210928       GER2-EXIT.
239300210928           EXIT.
239400210928      /
239500210928       LOG-ERROR.
239600210928           INITIALIZE MFACTERRP OF CONTRACT-ERROR-LOG.
239700210928
239800210928           IF COMM-REJECTION-CODE = SPACES OR "00"
239900210928             MOVE WS-REJECTION-CODE TO COMM-REJECTION-CODE
240000210928           END-IF.
240100210928
240200210928           ACCEPT WS-SYSTIME-LONG FROM TIME.
240300210928           CALL "GETDAT" USING WS-SYSDATE-N.
240400210928
240500210928           MOVE WS-REJECTION-CODE
240600210928                             TO REJECTION-CODE OF CONTRACT-ERROR-LOG.
240700210928           MOVE INVESTOR-NO  OF ACCOUNT
240800210928                             TO INVESTOR-NO OF CONTRACT-ERROR-LOG.
240900210928           MOVE ACCOUNT-NO   OF ACCOUNT-CONTRACT-INV-RESET
241000210928                             TO ACCOUNT-NO OF CONTRACT-ERROR-LOG.
241100210928
241200210928           MOVE CONTRACT-NO  OF ACCOUNT-CONTRACT-INV-RESET
241300210928                             TO CONTRACT-NO OF CONTRACT-ERROR-LOG.
241400210928           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
241500210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG.
241600210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
241700210928                             TO INVESTMENT-CODE
241800210928                             OF CONTRACT-ERROR-LOG.
241900210928
242000210928           MOVE COMM-CALLER-ID-CODE TO CALLER-ID-CODE
242100210928                             OF CONTRACT-ERROR-LOG.
242200210928           MOVE PROG-ID-CODE TO PROGRAM-ID-CODE
242300210928                             OF CONTRACT-ERROR-LOG.
242400210928           MOVE COMM-USER    TO AUDIT-USER OF CONTRACT-ERROR-LOG.
242500210928
242600210928           MOVE WS-MISC-INFO-AREA
242700210928                             TO MISC-INFO OF CONTRACT-ERROR-LOG.
242800210928           MOVE WS-SYSDATE-N TO AUDIT-DATE OF CONTRACT-ERROR-LOG.
242900210928           MOVE WS-SYSTIME-LONG-N
243000210928                             TO LOG-TIME OF CONTRACT-ERROR-LOG.
243100210928
243200210928           WRITE CONT-ERR-LOG-REC.
243300210928
243400210928           MOVE SPACES         TO WS-MISC-INFO-AREA.
243500210928
243600210928       LER-EXIT.
243700210928           EXIT.
243800210928      /
243900210928       COPY CPYSEGRTNC.
244000210928       COPY CPYEXCLTRN.
24410021092816512  COPY CPYTRNDAMT.
244200210928      /
244300210928       INITIAL-LOGIC.
244400210928
244500210928           MOVE SPACES       TO COMM-REJECTION-CODE.
244600210928           MOVE LOW-VALUES   TO CURR-CONTROLS
244700210928                                PREV-CONTROLS.
244800210928
244900210928           IF COMM-OPEN-FILES NOT = "Y" AND
245000210928              OPEN-FILES-ONCE NOT = "Y"
245100210928             GO TO INL-0010
245200210928           END-IF.
245300210928
245400210928           OPEN INPUT  INVESTMENT-UNIT-PRICE
245500210928                       BUSINESS-DAYS
245600210928                       ACCOUNT
245700210928                       INVESTMENT
245800210928                       PROGRAM-EXCHANGE-RATE
245900210928                       EXCHANGE-RATE-M-2
246000210928                       CURRENCY-CODE
246100210928                       ACCOUNT-CONTRACT-INVEST-SWI
246200210928                       ACCOUNT-CONTRACT-INVEST-R
246300210928                       ACCOUNT-CONTRACT
246400210928                       ACCOUNT-CONTRACT-RESET
246500210928                       ACCOUNT-CONTRACT-INV-RESET
246600210928                       TRANS-EXCHANGE-RATE-2
246700210928                       TRANS-R
246800210928                       TRANS
246900210928                       TRANS-GBV
247000210928                       TRANS-DAILY-PROC-SEQ
247100210928                       TRANS-TARGET
247200210928                       TRANS-TARGET-2
247300210928                       ACCOUNT-NOMINEE
247400210928                       TRANS-OFFSET
247500210928                       SEG-TRANSFER-OPTIONS
247600210928                       TRANS-CONTRACT-DETAILS
247700210928R11255                 ACCOUNT-ATTRIBUTES
247800210928R11255                 EXCLUDE-TRANS
247900210928R11622                 INVESTMENT-UNIT-PRICE-LAST
248000210928R13394                 TRANS-GBV-TRANSFER
248100210928R13306                 SEG-SWITCH-TRF-OPT
248200210928R13306                 TRANS-CONTRACT-TARGET2
24830021092816512                  TRANS-CHARGES
24840021092816512                  TRANS-SEG-DEDUCTION-CODES
248500210928110904                 INVESTMENT-STRUCTURE-XREF
248600210928180708                 TRANS-MISC-DETAILS
248700210928180708                 TRANS-REDEM-DETAILS
248800210928                 I-O   ACCOUNT-CONTRACT-INVESTMENT
248900210928                       TRANS-CONTRACT-DTL-R
249000210928R12702                 ACCOUNT-CONTRACT-INVEST
249100210928                       CONTRACT-ERROR-LOG.
249200210928
249300210928           MOVE "N"          TO OPEN-FILES-ONCE.
249400210928
249500210928       INL-0010.
249600210928
249700210928           IF UNITRAX-BASE-CURRENCY   NOT = SPACES AND
249800210928              PROG-EXCHANGE-RATE-TYPE NOT = SPACES
249900210928             GO TO INL-EXIT
250000210928           END-IF.
250100210928
250200210928           PERFORM GET-BASE-CURRENCY
250300210928                             THRU GBC-EXIT.
250400210928
250500210928           PERFORM GET-EXCHANGE-RATE-TYPE
250600210928                             THRU GERT-EXIT.
250700210928
250800210928       INL-EXIT.
250900210928           EXIT.
251000210928      /
251100210928       GET-BASE-CURRENCY.
251200210928           MOVE LOW-VALUES   TO CURRENCY-DDS OF CURRENCY-CODE.
251300210928
251400210928           START CURRENCY-CODE
251500210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
251600210928           INVALID KEY
251700210928             MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
251800210928             GO TO GBC-EXIT.
251900210928
252000210928       GBC-0010.
252100210928
252200210928           READ CURRENCY-CODE NEXT RECORD
252300210928             AT END
252400210928             MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
252500210928             GO TO GBC-EXIT.
252600210928
252700210928           IF BASE-CURRENCY  OF CURRENCY-CODE NOT = "Y"
252800210928             GO TO GBC-0010.
252900210928
253000210928           MOVE CURRENCY-DDS OF CURRENCY-CODE
253100210928                             TO UNITRAX-BASE-CURRENCY.
253200210928
253300210928       GBC-EXIT.
253400210928           EXIT.
253500210928      /
253600210928       GET-EXCHANGE-RATE-TYPE.
253700210928
253800210928           MOVE "SEGCALCV"   TO PROGRAM-CODE
253900210928                             OF PROGRAM-EXCHANGE-RATE.
254000210928           MOVE "DEFAULT"    TO PROGRAM-ACTION
254100210928                             OF PROGRAM-EXCHANGE-RATE.
254200210928
254300210928           READ PROGRAM-EXCHANGE-RATE
254400210928           INVALID KEY
254500210928             MOVE "06"       TO COMM-REJECTION-CODE
254600210928             MOVE HIGH-VALUES TO CURR-CONTROLS
254700210928             GO TO GERT-EXIT.
254800210928
254900210928           MOVE EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
255000210928                             TO PROG-EXCHANGE-RATE-TYPE.
255100210928
255200210928       GERT-EXIT.
255300210928           EXIT.
255400210928
255500210928       END-JOB.
255600210928
255700210928      * RFS49699 - Begin
255800210928
255900210928           MOVE "LOGARR"               to Pass-Screen-Code.
256000210928           MOVE "LOGARR"               to Pass-Edit-Code.
256100210928           MOVE "N"                    to Pass-Level-Code.
256200210928
256300210928           call "FXSCEDTAL1" using Pass-Screen-Code
256400210928                                   Pass-Edit-Code
256500210928                                   Pass-Level-Code
256600210928                                   Retn-Edit-Allowed-Flag.
256700210928
256800210928
256900210928           IF Retn-Edit-Allowed
257000210928               PERFORM ARRAY-LOGGING     THRU ARL-EXIT
257100210928           END-IF.
257200210928
257300210928      * RFS49699 - End
257400210928
257500210928           IF SQL-FILE-NOT-OPEN
257600210928              GO TO EOJ-EXIT
257700210928           END-IF.
257800210928
257900210928           EXEC SQL
258000210928                CLOSE SEGEXTSQ
258100210928           END-EXEC.
258200210928
258300210928           EXEC SQL
258400210928                WHENEVER SQLERROR GOTO EOJ-EXIT
258500210928           END-EXEC.
258600210928
258700210928           EXEC SQL
258800210928                WHENEVER NOT FOUND GOTO EOJ-EXIT
258900210928           END-EXEC.
259000210928
259100210928       EOJ-EXIT.
259200210928           EXIT.
259300210928
259400210928      * RFS49699 - Begin call array logging if on!
259500210928
259600210928       ARRAY-LOGGING.
259700210928
259800210928           MOVE "SEGRECALCP"           TO  pp-Program-Name.
259900210928
260000210928           MOVE WS-ARRAY1-NAME         TO  pp-Array-Name.
260100210928           SET  WS-ARR-ACCCRP          TO  TRUE.
260200210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
260300210928           MOVE WS-ARRAY1-MAX          TO  pp-Max-Size.
260400210928           MOVE WS-ARRAY1-MAX-USED     TO  pp-Max-Size-Used.
260500210928           MOVE SPACES                 TO  rp-Err-Flag.
260600210928
260700210928           CALL "FXLOGAU"      using PR-FXLOGAU.
260800210928
260900210928           MOVE WS-ARRAY2-NAME         TO  pp-Array-Name.
261000210928           SET  WS-ARR-ACCCIP          TO  TRUE.
261100210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
261200210928           MOVE WS-ARRAY2-MAX          TO  pp-Max-Size.
261300210928           MOVE WS-ARRAY2-MAX-USED     TO  pp-Max-Size-Used.
261400210928           MOVE SPACES                 TO  rp-Err-Flag.
261500210928
261600210928           CALL "FXLOGAU"      using PR-FXLOGAU.
261700210928
261800210928
261900210928       ARL-EXIT.
262000210928           EXIT.
262100210928
262200210928      * RFS49699 - End
262300210928
262400210928      * ---------------------------------
262500210928       VCA-GET-NEXT-BUSINESS-DATE.
262600210928      * ---------------------------------
262700210928           MOVE COMM-EFFECT-DATE     TO
262800210928                                 BUSINESS-DAY OF BUSINESS-DAYS.
262900210928
263000210928           START BUSINESS-DAYS
263100210928             KEY IS GREATER THAN EXTERNALLY-DESCRIBED-KEY
263200210928               INVALID KEY
263300210928                 CONTINUE
263400210928               NOT INVALID KEY
263500210928                 SET SW01-STS-OK     TO TRUE
263600210928                 PERFORM VCAA-NEXT-BUSINESS-DATE
263700210928                                           UNTIL NOT SW01-STS-OK
263800210928           END-START.
263900210928      * ---------------------------------
264000210928       VCAA-NEXT-BUSINESS-DATE.                                         RFS8712
264100210928      * ---------------------------------
264200210928            READ BUSINESS-DAYS NEXT RECORD
264300210928              AT END
264400210928                  SET SW01-STS-END                        TO TRUE
264500210928              NOT AT END
264600210928                  IF ALLOW-TRADING OF BUSINESS-DAYS = "Y"
264700210928                      MOVE BUSINESS-DAY OF BUSINESS-DAYS  TO
264800210928                                           WS-NEXT-PROCESS-DATE
264900210928                      SET SW01-STS-FOUND                  TO TRUE
265000210928                  END-IF
265100210928            END-READ.
265200210928      * ---------------------------------
