000100210928      * %ATTR DBGVIEW(*LIST)
000200210928       IDENTIFICATION DIVISION.
000300210928       PROGRAM-ID.    SEGRVSTRNV.
000400210928       AUTHOR.        REECE TAM.
000500210928       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000600210928       DATE-WRITTEN.  NOVEMBER 1998.
000700210928       DATE-COMPILED.
000800210928      *******************************************************************
000900210928      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
001000210928      *******************************************************************
001100210928      *            * yyyy/mm/dd   *
001200210928      * R SALIRE   * 2001/02/06   * RFS 8781 - Net Dep Value/Guar. Base
001300210928      *            *              * Value should not be changed during
001400210928      *            *              * switch.
001500210928      * B Mitchell * 2001/07/18   * RFS 8092 - Remove hardcoding for
001600210928      *            *              * GBV & NDP and use new table driven
001700210928      *            *              * logic.
001800210928      * F Haji     * 2001/09/04   * RFS 11255 - This RFS is Phase 2 of
001900210928      *            *              * RFS 8092. Exclude any transacaction
002000210928      *            *              * that meet the criteria on the
002100210928      *            *              * Exclude Transactions table
002200210928      *            *              * (i.e. AWD's and Buy-"top-up")
002300210928      *            *              * from GBV calculation.
002400210928      * R SALIRE   * 2001/09/25   * RFS 11593 - Fix for full and partial
002500210928      *            *              * depletion of contracts.  Gross-Amt
002600210928      *            *              * of the trade should be the Orig-Unit-Bal
002700210928      *            *              * of Trans-Contract-Details times the
002800210928      *            *              * Unit-Price of the trade.
002900210928      * F Haji     * 2001/09/27   * RFS 11112 - By pass death reversal
003000210928      *            *              * transactions so the GBV and NDV are
003100210928      *            *              * not doubled.
003200210928      * R SALIRE   * 2001/10/11   * RFS 11622 - Use the unit-price prior
003300210928      *            *              * to trade-date of transaction if the
003400210928      *            *              * price on the trade-date doesn't exists.
003500210928      * R SALIRE   * 2001/10/16   * RFS 11698 - Recompile.
003600210928      *            *              * Changes made to copybook CPYSEGRTNE.
003700210928      *            *              * This will handle switches or transfers
003800210928      *            *              * from Non-Seg to Seg or vice-versa.
003900210928      * R SALIRE   * 2001/11/14   * RFS 12089 - Partial and full switch
004000210928      *            *              * for one fund on the same day resulting
004100210928      *            *              * incorrect GBV.
004200210928      *            *              * RFS 12145 - Recompile.
004300210928      *            *              * Changes made to copybook CPYSEGRTNE.
004400210928      * R SALIRE   * 2001/12/27   * RFS 12454 - Switches within the same
004500210928      *            *              * contract make GBV change.
004600210928      *            *              * Have to ensure that the percentage
004700210928      *            *              * total would equal to 100 percent.
004800210928      * R SALIRE   * 2002/01/31   * RFS 12702 - GBV is rounding incorrectly
004900210928      *            *              * with switch transactions.
005000210928      * Fatema Haji*  2002/03/21  *  RFS 13331 - recompile
005100210928      * R SALIRE   * 2002/05/13   * RFS 13394 - New functionality to carry
005200210928      *            *              * over contract NDV/GBV onto Unitrax.
005300210928      * R SALIRE   * 2002/07/24   * RFS 14177 - Reversal of TRO/TRI does
005400210928      *            *              * not return correct NDV/GBV.
005500210928      * R Salire   * 2002/08/07   * RFS 14600 - Recompile
005600210928      * R SALIRE   * 2002/08/12   * RFS 13306 - Transfer in kind func
005700210928      * R SALIRE   * 2002/09/03   * RFS 14814 - Fix to 13394
005800210928      *            *              * Reversal of BUY encounters Dcml Data Err
005900210928      * C. Carino  * 2002/10/03   * RFS 14407 - recompile for          *
006000210928      *                           *  ACCOUNT-ATTRIBUTE (MFAACCATP)
006100210928      * Daisy Ly   * 2003/08/21   * RFS 16512 -update the              *
006200210928      *            *              *  ws-to-contract-no before call
006300210928      *            *              *  the seg-transfer-parameters rtn
006400210928      * Bud Kovacs * 2003/11/24   * RFS 19446                          *
006500210928      *            *              * -Recompile only because of file    *
006600210928      *            *              *  investment-seg (changed).         *
006700210928      * Fatema Haji*  2004/01/07  * RFS 19318 - recompile
006800210928      * Daisy Ly   * 2004/01/24   * RFS 17973 - apply GBV calculation  *
006900210928      *            *              *  to GDV field
007000210928      * Fatema Haji* 2004/04/29   * RFS 21458 - Modified so when an all
007100210928      *            *              * unit reversal is done the GBV,NDV
007200210928      *            *              * and GDV are reported correctly.
007300210928      * E. Salvador* 2004/05/11   * RFS 20516 - Use Direct Method for
007400210928      *            *              *   Accounts identified as Pre-1999.
007500210928      * Daisy Ly   * 2004/07/08   * RFS 23118 - recompile for copy
007600210928      *            *              * book change CPYSEGRTNC
007700210928      *            *              *
007800210928      * Lev O      *  2005/05/26  * RFS24943 - Gross value reduction
007900210928      *            *              * of the NDV and/or GBV values at the
008000210928      *            *              * contract level Direct Method
008100210928      *            *              * calculation.
008200210928      * Frank Hong * 2005/06/02   * RFS 26151.
008300210928      *            *              * Modify the program to take into
008400210928      *            *              * account the number of units of transactions
008500210928      *            *              * that are in Exclude Transactions table
008600210928      *            *              * (RFEXCTRN) without affecting the Guaranteed
008700210928      *            *              * Base Value (GBV), Net Deposit Value (NDV),
008800210928      *            *              * Guaranteed Death Value (GDV) of the contract
008900210928      *            *              *
009000210928      * Lev O      *  2005/07/27  * RFS29028 - Fix rounding issue while
009100210928      *            *              * re-distributing GBV,NDV.
009200210928      * Esin A.    *  2007/03/09  * RFS 40576 - Recompile only.
009300210928      * Ewa K.     *  2007/03/20  * RFS 38037 - Close files added by
009400210928      *            *              * RFS11255, ACCOUNT-ATTRIBUTES &      contract
009500210928      *            *              * EXCLUDE-TRANS - defect38037.13      contract
009600210928      * Pawel A.   *  2007/11/12  * RFS 45592 - Defect on Death
009700210928      *            *              * reversal.                           contract
009800210928      * Frank Hong *  2007/12/14  * RFS 46519.
009900210928      *            *              * Remove TRANS-CONTRACT-TARGET
010000210928      *            *              * from CLOSE list since it is opened
010100210928      *            *              * conditionally.
010200210928      * Emman. Yala* 2008/01/10   * RFS47227 - Recompile.
010300210928      * Bojana J.  * 2008/05/06   * RFS 51776 - Recompile.
010400210928      * Bojana J.  *  2008/05/14  * RFS 47405 - Include CPGLWBRULE copy book.
010500210928      * Daniel M.  *  2008/05/14  * RFS 47405 - Include CPGLWBCKTT copy book.
010600210928      * Daniel M.  *  2008/06/19  * RFS 46707 - Recompile changes to CPGLWBRULE.
010700210928      * Sanjeev P. * 2008/06/26   * RFS 48640 - Recompile.
010800210928      * Emma. Yala *  2008/08/06  * RFS 54603 - GBV & NDV not correct
010900210928      *            *              * when multiple SW and fund has low
011000210928      *            *              * ratio of MV. Extended decimal place
011100210928      *            * yyyy/mm/dd   *
011200210928      * J O'Callaghan * 2008/04/17  * RFS49699 - Array logging info
011300210928      * Fatema Haji* 2008/08/18   * RFS 55960 - Recompile.
011400210928      * Sanjeev P  *  2008/12/11  * RFS49898 - New DMD Maturity Option.
011500210928      * Gary Xia   *  2009/06/17  * RFS57388 - Remove obsolete code.
011600210928      * Jess       *  2009/10/02  * RFS74468 - Initialize field causing
011700210928      *  Maquirang *              *            data decimal error.
011800210928      * Pawel A    *  2010/07/30  * RFS84063 - Recompile (CPEXCLTRN)
011900210928      * Emman. Yala*  2011/02/23  * RFS91599 - Recompile (MFAACCCRP)80605
012000210928      * Thilaga K  * 2012/08/13   * RFS107585- Added var lc-transferGDV
012100210928      * Raj Kumar A* 2012/08/07 * RFS107585 - Carry over the GDV,GBV
012200210928      *            *            * if the GDV,GBV switch is set to "Y"
012300210928      *            *            * in RFSGTRFO
012400210928      * Ambikapathy* 2012/12/14   * RFS112135 - Recompile for MFASGSTOP
012500210928      * Abhisek M  * 2013/04/01   * RFS120002 - Recompile for MFATRACXP
012600210928      * PREMIL K   * 2013/07/17   * RFS110904 - PREFORM GDV RESET AND
012700210928      *                           * REVERSE RESET.
012800210928      * Andy Chan  * 2013/09/04   * RFS127677 - Fix Parm
012900210928      * Andy Chan  * 2013/08/29   * RFS127401 - Recompile due to CPYEXCLTRN
013000210928      * Thilaga K   * 2014/01/21 * RFS133150 - Recompile for MFATRCODP
013100210928      * Shu Yin    * 2014/05/13   * RFS136670 - Include FEE txn as valid
013200210928      * Manjusha V * 2014/04/01  * RFS129902 - Recompile for CPGLWBRULEd
013300210928      * Kamal T    * 2014/06/17  * RFS118472 - Recompile for CPGLWBRULE
013400210928      * Vinsfy J   * 2014/06/17  * RFS136634 - Recompile
013500210928      * Nagamnai S * 2014/08/13  * RFS139007 - Recompile for CPGLWBRULE
013600210928      * Geethanjali* 2016/07/28   * RFS159011 - Adjust GBV, GMV and GDV
013700210928      * T G        *              * after cash distribution
013800210928      * Geethanjali* 2017/02/08   * RFS167725 - Reversal of segregated
013900210928      *            *              * fund transaction goes to MSGW
014000210928      * Joel Dsouza* 2017/02/27   * RFS168151 - User's session goes
014100210928      *            *              * into MSGW when processing reversals
014200210928      *            *              * for Switch transactions.
014300210928      * Geethanjali* 2017/04/24   * RFS168841 - Incorrect Maturity
014400210928      *            *              * and Death Benefit Guarantee Amounts.
014500210928      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
014600210928      * Vignesh    *  2020/06/25  * RFS183812 - Recompile for MFASGSTOP
014700210928      * Vignesh    * 2020/07/10   * RFS185171 - GLWB Bonus Lif Max
014800210928      *            *              * alignment GPP
014900210928      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
015000210928      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
015100210928      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
015200210928      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
015300210928      * Kavin      * 2021/01/05   * RFS180708 - Added MFATRNMSCP file
015400210928      * Bagathsingh* 2021/03/29   * RFS187205 - Fix for allowing -ve    *
015500210928      *            *              * guarantee amount for SELL txns      *
015600210928      *            *              * on SEG funds                        *
015700210928      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
015701211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
015702211007      *            *              * Array from 100 to 1000
015703211007      *            *              * Tagged as 111744
015800210928      *******************************************************************
015900210928      *===============================================================*
016000210928      * Important: IMPORTANT TO ALL PROGRAMMERS
016100210928      *
016200210928      * If any programmer creates, changes or deletes an array in this
016300210928      * programs please add the logic to support the array logging process!
016400210928      *
016500210928      * View the WS-ARRAY-LOG-MISC variables and the code associated with
016600210928      * RFS49699.
016700210928      *
016800210928      * This change is for audit purposes, it logs the
016900210928      * name of the array, max size, size used. At the end of
017000210928      * this program the array information is passed to FXLOGUA pgm,
017100210928      * which write this information to the MFALOGAUP array audit file!
017200210928      *
017300210928      *===============================================================*
017400210928       ENVIRONMENT DIVISION.
017500210928       CONFIGURATION SECTION.
017600210928       SOURCE-COMPUTER. IBM-AS400.
017700210928       OBJECT-COMPUTER. IBM-AS400.
017800210928       SPECIAL-NAMES.
017900210928           LOCAL-DATA IS WS-LOCAL.
018000210928      /
018100210928       INPUT-OUTPUT SECTION.
018200210928       FILE-CONTROL.
018300210928
018400210928           SELECT  TRANS
018500210928                   ASSIGN TO DATABASE-MFATRNP
018600210928                   ORGANIZATION IS INDEXED
018700210928                   ACCESS IS DYNAMIC
018800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018900210928      /
019000210928           SELECT  TRANS-R
019100210928                   ASSIGN TO DATABASE-MFATRNLN
019200210928                   ORGANIZATION IS INDEXED
019300210928                   ACCESS IS DYNAMIC
019400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
019500210928                   WITH DUPLICATES.
019600210928      /
019700210928           SELECT  TRANS-EXCHANGE-RATE
019800210928                   ASSIGN TO DATABASE-MFATREXRP
019900210928                   ORGANIZATION IS INDEXED
020000210928                   ACCESS IS DYNAMIC
020100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020200210928      /
020300210928           SELECT  TRANS-CONTRACT-DETAILS
020400210928                   ASSIGN TO DATABASE-MFATRCODP
020500210928                   ORGANIZATION IS INDEXED
020600210928                   ACCESS IS DYNAMIC
020700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020800210928
020900210928      * RFS24943 - Begin
021000210928           SELECT  TRANS-CONT-DTL-SWI
021100210928                   ASSIGN TO DATABASE-MFATRCODP
021200210928                   ORGANIZATION IS INDEXED
021300210928                   ACCESS IS DYNAMIC
021400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021500210928      * RFS24943 - End
021600210928      /
021700210928           SELECT  TRANS-CON-DTL-PURCHASE
021800210928                   ASSIGN TO DATABASE-MFATRCODP
021900210928                   ORGANIZATION IS INDEXED
022000210928                   ACCESS IS DYNAMIC
022100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022200210928      /
022300210928           SELECT  ACCOUNT-CONTRACT-INVESTMENT
022400210928                   ASSIGN TO DATABASE-MFAACCCIP
022500210928                   ORGANIZATION IS INDEXED
022600210928                   ACCESS IS DYNAMIC
022700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022800210928      /
022900210928           SELECT  ACCOUNT-CONTRACT-INV-RESET
023000210928                   ASSIGN TO DATABASE-MFAACCCIRA
023100210928                   ORGANIZATION IS INDEXED
023200210928                   ACCESS IS DYNAMIC
023300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023400210928      /
023500210928           SELECT  ACCOUNT-CONTRACT-RESET
023600210928                   ASSIGN TO DATABASE-MFAACCCRP
023700210928                   ORGANIZATION IS INDEXED
023800210928                   ACCESS IS DYNAMIC
023900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024000210928      /
024100210928           SELECT  ACCOUNT
024200210928                   ASSIGN TO DATABASE-MFAACCNTP
024300210928                   ORGANIZATION IS INDEXED
024400210928                   ACCESS IS DYNAMIC
024500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024600210928      /
024700210928RF8092     SELECT  ACCOUNT-NOMINEE
024800210928RF8092             ASSIGN TO DATABASE-MFAACCNMP
024900210928RF8092             ORGANIZATION IS INDEXED
025000210928RF8092             ACCESS IS DYNAMIC
025100210928RF8092             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025200210928      /
025300210928RF8092     SELECT  TRANS-OFFSET
025400210928RF8092             ASSIGN TO DATABASE-MFATRNP
025500210928RF8092             ORGANIZATION IS INDEXED
025600210928RF8092             ACCESS IS DYNAMIC
025700210928RF8092             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025800210928      /
025900210928           SELECT  INVESTMENT
026000210928                   ASSIGN TO DATABASE-MFAINVP
026100210928                   ORGANIZATION IS INDEXED
026200210928                   ACCESS IS DYNAMIC
026300210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
026400210928      /
026500210928           SELECT  PROGRAM-EXCHANGE-RATE
026600210928                   ASSIGN TO DATABASE-MFAPRGERP
026700210928                   ORGANIZATION IS INDEXED
026800210928                   ACCESS IS DYNAMIC
026900210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
027000210928      /
027100210928           SELECT  EXCHANGE-RATE-M
027200210928                   ASSIGN TO DATABASE-MFAEXRHMP
027300210928                   ORGANIZATION IS INDEXED
027400210928                   ACCESS IS DYNAMIC
027500210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
027600210928      /
027700210928           SELECT  CURRENCY-CODE
027800210928                   ASSIGN TO DATABASE-MFACURP
027900210928                   ORGANIZATION IS INDEXED
028000210928                   ACCESS IS DYNAMIC
028100210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028200210928      /
028300210928           SELECT  CONTRACT-ERROR-LOG
028400210928                   ASSIGN TO DATABASE-MFACTERRP
028500210928                   ORGANIZATION IS INDEXED
028600210928                   ACCESS IS DYNAMIC
028700210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
028800210928                   WITH DUPLICATES.
028900210928      /
029000210928           SELECT  TRANS-TARGET
029100210928                   ASSIGN TO DATABASE-MFATRNTGP
029200210928                   ORGANIZATION IS INDEXED
029300210928                   ACCESS IS DYNAMIC
029400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029500210928      /
029600210928           SELECT  ACCOUNT-CONTRACT-INVEST-SWI
029700210928                   ASSIGN TO DATABASE-MFAACCCIP
029800210928                   ORGANIZATION IS INDEXED
029900210928                   ACCESS IS DYNAMIC
030000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
030100210928      /
030200210928           SELECT  TRANS-EXCHANGE-RATE-2
030300210928                   ASSIGN TO DATABASE-MFATREXRP
030400210928                   ORGANIZATION IS INDEXED
030500210928                   ACCESS IS DYNAMIC
030600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
030700210928      /
030800210928           SELECT  EXCHANGE-RATE-M-2
030900210928                   ASSIGN TO DATABASE-MFAEXRHMP
031000210928                   ORGANIZATION IS INDEXED
031100210928                   ACCESS IS DYNAMIC
031200210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031300210928      /
031400210928RF9332     SELECT  INVESTMENT-SEG
031500210928RF9332             ASSIGN TO DATABASE-MFAINVSGP
031600210928RF9332             ORGANIZATION IS INDEXED
031700210928RF9332             ACCESS IS DYNAMIC
031800210928RF9332             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031900210928      /
032000210928RF9332     SELECT  INVESTMENT-UNIT-PRICE
032100210928RF9332             ASSIGN TO DATABASE-MFAINVUPP
032200210928RF9332             ORGANIZATION IS INDEXED
032300210928RF9332             ACCESS IS DYNAMIC
032400210928RF9332             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
032500210928      /
032600210928           SELECT  TRANS-TARGET-2
032700210928                   ASSIGN TO DATABASE-MFATRNTGLA
032800210928                   ORGANIZATION IS INDEXED
032900210928                   ACCESS IS DYNAMIC
033000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
033100210928      /
033200210928R11255     SELECT  EXCLUDE-TRANS
033300210928R11255             ASSIGN TO DATABASE-MFAEXTRNP
033400210928R11255             ORGANIZATION IS INDEXED
033500210928R11255             ACCESS IS DYNAMIC
033600210928R11255             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
033700210928      /
033800210928R11255     SELECT  ACCOUNT-ATTRIBUTES
033900210928R11255             ASSIGN TO DATABASE-MFAACCATP
034000210928R11255             ORGANIZATION IS INDEXED
034100210928R11255             ACCESS IS DYNAMIC
034200210928R11255             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
034300210928      /
034400210928R11622     SELECT  INVESTMENT-UNIT-PRICE-LAST
034500210928R11622             ASSIGN TO DATABASE-MFAINVUPLB
034600210928R11622             ORGANIZATION IS INDEXED
034700210928R11622             ACCESS IS DYNAMIC
034800210928R11622             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
034900210928R11622                    WITH DUPLICATES.
035000210928      /
035100210928R12702     SELECT  ACCOUNT-CONTRACT-INVEST
035200210928R12702             ASSIGN TO DATABASE-MFAACCCIP
035300210928R12702             ORGANIZATION IS INDEXED
035400210928R12702             ACCESS IS DYNAMIC
035500210928R12702             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
035600210928      /
035700210928R13394     SELECT  TRANS-GBV-TRANSFER
035800210928R13394             ASSIGN TO DATABASE-MFATRACXP
035900210928R13394             ORGANIZATION IS INDEXED
036000210928R13394             ACCESS IS DYNAMIC
036100210928R13394             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
036200210928
036300210928R13306     SELECT  SEG-SWITCH-TRF-OPT
036400210928R13306             ASSIGN TO DATABASE-MFASGSTOP
036500210928R13306             ORGANIZATION IS INDEXED
036600210928R13306             ACCESS IS DYNAMIC
036700210928R13306             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
036800210928
036900210928R13306     SELECT  TRANS-CONTRACT-TARGET2
037000210928R13306             ASSIGN TO DATABASE-MFATRCTGLA
037100210928R13306             ORGANIZATION IS INDEXED
037200210928R13306             ACCESS IS DYNAMIC
037300210928R13306             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
037400210928
037500210928      * RFS24943 - Begin
037600210928           SELECT  TRANS-CONTRACT-TARGET
037700210928                   ASSIGN TO DATABASE-MFATRCTGP
037800210928                   ORGANIZATION IS INDEXED
037900210928                   ACCESS IS DYNAMIC
038000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
038100210928      * RFS24943 - End
038200210928
038300210928      *RFS110904 - START
038400210928           SELECT  INVESTMENT-STRUCTURE-XREF
038500210928                   ASSIGN TO DATABASE-MFAINVSXP
038600210928                   ORGANIZATION IS INDEXED
038700210928                   ACCESS IS DYNAMIC
038800210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
038900210928      *RFS110904 - END
039000210928
039100210928      *RFS159011 - START
039200210928           SELECT  TRANS-DISTR-DETAILS
039300210928                   ASSIGN TO DATABASE-MFATRNDDP
039400210928                   ORGANIZATION IS INDEXED
039500210928                   ACCESS IS DYNAMIC
039600210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
039700210928      *RFS159011 - ENDS
039800210928
039900210928      *RFS180708 - Start
040000210928           SELECT  TRANS-MISC-DETAILS
040100210928                   ASSIGN TO DATABASE-MFATRNMSCP
040200210928                   ORGANIZATION IS INDEXED
040300210928                   ACCESS IS DYNAMIC
040400210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
040500210928
040600210928           SELECT  TRANS-REDEM-DETAILS
040700210928                   ASSIGN TO DATABASE-MFATRNREP
040800210928                   ORGANIZATION IS INDEXED
040900210928                   ACCESS IS DYNAMIC
041000210928                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
041100210928      *RFS180708 - End
041200210928
041300210928       DATA DIVISION.
041400210928       FILE SECTION.
041500210928       FD  TRANS
041600210928           LABEL RECORDS ARE STANDARD.
041700210928       01  TRANS-REC.             COPY DD-ALL-FORMATS OF MFATRNP.
041800210928      /
041900210928       FD  TRANS-R
042000210928           LABEL RECORDS ARE STANDARD.
042100210928       01  TRANS-R-REC.           COPY DD-ALL-FORMATS OF MFATRNLN.
042200210928      /
042300210928       FD  TRANS-EXCHANGE-RATE
042400210928           LABEL RECORDS ARE STANDARD.
042500210928       01  TRANS-EXCH-RATE-REC.   COPY DD-ALL-FORMATS OF MFATREXRP.
042600210928      /
042700210928       FD  TRANS-CONTRACT-DETAILS
042800210928           LABEL RECORDS ARE STANDARD.
042900210928       01  TRANS-CON-DTL-REC.     COPY DD-ALL-FORMATS OF MFATRCODP.
043000210928      /
043100210928      * RFS24943 - Begin
043200210928       FD  TRANS-CONT-DTL-SWI
043300210928           LABEL RECORDS ARE STANDARD.
043400210928       01  TRANS-CONT-DTL-SWI-REC. COPY DD-ALL-FORMATS OF MFATRCODP.
043500210928      * RFS24943 - End
043600210928      /
043700210928       FD  TRANS-CON-DTL-PURCHASE
043800210928           LABEL RECORDS ARE STANDARD.
043900210928       01  TRANS-CON-DTL-PUR-REC. COPY DD-ALL-FORMATS OF MFATRCODP.
044000210928      /
044100210928       FD  ACCOUNT-CONTRACT-INVESTMENT
044200210928           LABEL RECORDS ARE STANDARD.
044300210928       01  ACC-CON-INV-REC.       COPY DD-ALL-FORMATS OF MFAACCCIP.
044400210928      /
044500210928       FD  ACCOUNT-CONTRACT-INV-RESET
044600210928           LABEL RECORDS ARE STANDARD.
044700210928       01  ACC-CON-INV-RESET-REC. COPY DD-ALL-FORMATS OF MFAACCCIRA.
044800210928      /
044900210928       FD  ACCOUNT-CONTRACT-RESET
045000210928           LABEL RECORDS ARE STANDARD.
045100210928       01  ACC-CON-RESET-REC.     COPY DD-ALL-FORMATS OF MFAACCCRP.
045200210928      /
045300210928       FD  ACCOUNT
045400210928           LABEL RECORDS ARE STANDARD.
045500210928       01  ACCOUNT-REC.           COPY DD-ALL-FORMATS OF MFAACCNTP.
045600210928      /
045700210928RF8092 FD  ACCOUNT-NOMINEE
045800210928RF8092     LABEL RECORDS ARE STANDARD.
045900210928RF8092 01  ACCOUNT-NOMINEE-REC.   COPY DD-ALL-FORMATS OF MFAACCNMP.
046000210928      /
046100210928RF8092 FD  TRANS-OFFSET
046200210928RF8092     LABEL RECORDS ARE STANDARD.
046300210928RF8092 01  TRANS-2-REC.           COPY DD-ALL-FORMATS OF MFATRNP.
046400210928      /
046500210928       FD  INVESTMENT
046600210928           LABEL RECORDS ARE STANDARD.
046700210928       01  INVESTMENT-REC.        COPY DD-ALL-FORMATS OF MFAINVP.
046800210928      /
046900210928       FD  PROGRAM-EXCHANGE-RATE
047000210928           LABEL RECORDS ARE STANDARD.
047100210928       01  PROG-EXCH-RATE-REC.    COPY DD-ALL-FORMATS OF MFAPRGERP.
047200210928      /
047300210928       FD  EXCHANGE-RATE-M
047400210928           LABEL RECORDS ARE STANDARD.
047500210928       01  EXCHANGE-RATE-M-REC.   COPY DD-ALL-FORMATS OF MFAEXRHMP.
047600210928      /
047700210928       FD  CURRENCY-CODE
047800210928           LABEL RECORDS ARE STANDARD.
047900210928       01  CURRENCY-CODE-REC.     COPY DD-ALL-FORMATS OF MFACURP.
048000210928      /
048100210928       FD  CONTRACT-ERROR-LOG
048200210928           LABEL RECORDS ARE STANDARD.
048300210928       01  CONT-ERR-LOG-REC.      COPY DD-ALL-FORMATS OF MFACTERRP.
048400210928      /
048500210928       FD  TRANS-TARGET
048600210928           LABEL RECORDS ARE STANDARD.
048700210928       01  TRANS-TARGET-REC.
048800210928                                  COPY DD-ALL-FORMATS OF MFATRNTGP.
048900210928      /
049000210928       FD  ACCOUNT-CONTRACT-INVEST-SWI
049100210928           LABEL RECORDS ARE STANDARD.
049200210928       01  ACC-CON-INV-SWI-REC.   COPY DD-ALL-FORMATS OF MFAACCCIP.
049300210928      /
049400210928       FD  TRANS-EXCHANGE-RATE-2
049500210928           LABEL RECORDS ARE STANDARD.
049600210928       01  TRANS-EXCHANGE-RATE-2-REC. COPY DD-ALL-FORMATS OF MFATREXRP.
049700210928      /
049800210928       FD  EXCHANGE-RATE-M-2
049900210928           LABEL RECORDS ARE STANDARD.
050000210928       01  EXCHANGE-RATE-M-2-REC.   COPY DD-ALL-FORMATS OF MFAEXRHMP.
050100210928      /
050200210928RF9332 FD  INVESTMENT-SEG
050300210928RF9332     LABEL RECORDS ARE STANDARD.
050400210928RF9332 01  INVESTMENT-SEG-REC.    COPY DD-ALL-FORMATS OF MFAINVSGP.
050500210928      /
050600210928RF9332 FD  INVESTMENT-UNIT-PRICE
050700210928RF9332     LABEL RECORDS ARE STANDARD.
050800210928RF9332 01  INVESTMENT-UNIT-PRICE-REC. COPY DD-ALL-FORMATS OF MFAINVUPP.
050900210928      /
051000210928       FD  TRANS-TARGET-2
051100210928           LABEL RECORDS ARE STANDARD.
051200210928       01  TRANS-TARGET-2-REC.        COPY DD-ALL-FORMATS OF MFATRNTGLA.
051300210928      /
051400210928R11255 FD  ACCOUNT-ATTRIBUTES
051500210928R11255     LABEL RECORDS ARE STANDARD.
051600210928R11255 01  ACCOUNT-ATT-REC.           COPY DD-ALL-FORMATS OF MFAACCATP.
051700210928      /
051800210928R11255 FD  EXCLUDE-TRANS
051900210928R11255     LABEL RECORDS ARE STANDARD.
052000210928R11255 01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
052100210928      /
052200210928R11622 FD  INVESTMENT-UNIT-PRICE-LAST
052300210928R11622     LABEL RECORDS ARE STANDARD.
052400210928R11622 01  INVESTMENT-LAST-PRICE-REC. COPY DD-ALL-FORMATS OF MFAINVUPLB.
052500210928      /
052600210928R12702 FD  ACCOUNT-CONTRACT-INVEST
052700210928R12702     LABEL RECORDS ARE STANDARD.
052800210928R12702 01  ACCT-CONT-INVEST-REC.      COPY DD-ALL-FORMATS OF MFAACCCIP.
052900210928      /
053000210928R13394 FD  TRANS-GBV-TRANSFER
053100210928R13394     LABEL RECORDS ARE STANDARD.
053200210928R13394 01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
053300210928
053400210928R13306 FD  SEG-SWITCH-TRF-OPT
053500210928R13306     LABEL RECORDS ARE STANDARD.
053600210928R13306 01  SEG-SWITCH-TRF-OPT-REC.    COPY DD-ALL-FORMATS OF MFASGSTOP.
053700210928
053800210928R13306 FD  TRANS-CONTRACT-TARGET2
053900210928R13306     LABEL RECORDS ARE STANDARD.
054000210928R13306 01  TRANS-CONTRACT-TGT-REC.   COPY DD-ALL-FORMATS OF MFATRCTGLA.
054100210928
054200210928      * RFS24943 - Begin
054300210928       FD  TRANS-CONTRACT-TARGET
054400210928           LABEL RECORDS ARE STANDARD.
054500210928       01  TRANS-CONTRACT-TARGET-REC.
054600210928               COPY DD-ALL-FORMATS OF MFATRCTGP.
054700210928
054800210928      * RFS24943 - End
054900210928
055000210928      *RFS110904 - START
055100210928       FD  INVESTMENT-STRUCTURE-XREF
055200210928           LABEL RECORDS ARE STANDARD.
055300210928       01  INV-STRU-XREF-REC. COPY DD-ALL-FORMATS OF MFAINVSXP.
055400210928
055500210928      *RFS110904 - END
055600210928
055700210928      *RFS159011 - START
055800210928       FD  TRANS-DISTR-DETAILS
055900210928           LABEL RECORDS ARE STANDARD.
056000210928       01  TRANS-DISTR-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNDDP.
056100210928      *RFS159011 - END
056200210928
056300210928      *RFS180708 - Start
056400210928       FD  TRANS-MISC-DETAILS
056500210928           LABEL RECORDS ARE STANDARD.
056600210928       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
056700210928
056800210928       FD  TRANS-REDEM-DETAILS
056900210928           LABEL RECORDS ARE STANDARD.
057000210928       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
057100210928      *RFS180708 - End
057200210928
057300210928       WORKING-STORAGE SECTION.
057400210928
057500210928       01  CURR-CONTROLS.
057600210928          03 CURR-LEVEL1.
057700210928            05 CURR-LEVEL2.
057800210928               07 CURR-LEVEL3.
057900210928                  09 CURR-LEVEL4.
058000210928                     11 CURR-ACCOUNT-NO   PIC 9(9).
058100210928                  09 CURR-INVESTMENT-CODE PIC X(5).
058200210928               07 CURR-CONTRACT-NO        PIC 9(9).
058300210928            05 CURR-PLACEMENT-DATE        PIC 9(8).
058400210928            05 CURR-TRANS-NO              PIC 9(9).
058500210928
058600210928       01  PREV-CONTROLS.
058700210928          03 PREV-LEVEL1.
058800210928            05 PREV-LEVEL2.
058900210928               07 PREV-LEVEL3.
059000210928                  09 PREV-LEVEL4.
059100210928                     11 PREV-ACCOUNT-NO   PIC 9(9).
059200210928                  09 PREV-INVESTMENT-CODE PIC X(5).
059300210928               07 PREV-CONTRACT-NO        PIC 9(9).
059400210928            05 PREV-PLACEMENT-DATE        PIC 9(8).
059500210928            05 PREV-TRANS-NO              PIC 9(9).
059600210928
059700210928       01  PROG-ID-CODE              PIC X(10) VALUE "SEGCALCVAL".
059800210928
059900210928       01  OPEN-FILES-ONCE           PIC X(1)  VALUE "Y".
060000210928
060100210928       01  EXCLUDE-TRANS-FLAG        PIC X(1).
060200210928
060300210928       01  UNITRAX-BASE-CURRENCY     PIC X(3)  VALUE " ".
060400210928
060500210928       01  PROG-EXCHANGE-RATE-TYPE   PIC X     VALUE " ".
060600210928
060700210928      * RFS24943 - Begin
060800210928       01 WS-SWI-VARS.
060900210928         05 WS-SWI-PLACEMENT-DATE      PIC 9(08) VALUE 0.
061000210928         05 WS-SWI-TRANS-NO            PIC 9(09) VALUE 0.
061100210928
061200210928         05 WS-SWI-INVESTMENT-CODE     PIC X(05) VALUE " ".
061300210928         05 WS-SWI-CONTRACT-NO         PIC 9(09) VALUE 0.
061400210928         05 WS-SWI-ACCOUNT-NO          PIC 9(09) VALUE 0.
061500210928         05 WS-SWI-ORIG-UNIT-BAL       PIC S9(11)V9(3) COMP-3.
061600210928         05 WS-SWI-TRANS-UNITS         PIC S9(11)V9(3) COMP-3.
061700210928
061800210928         05 WS-SWI-TRANS-TYPE-CODE     PIC X(03) VALUE SPACES.
061900210928
062000210928      *RFS159011 - STARTS
062100210928       01 WS-DISTR-VARS.
062200210928         05 lc_DistrOptionCode         PIC X(01) VALUE " ".
062300210928         05 lc_C                       PIC X(01) VALUE "C".
062400210928         05 lc_R                       PIC X(01) VALUE "R".
062500210928      *RFS159011 - ENDS
062600210928
062700210928      *RFS168841 - STARTS
062800210928       01 li_CurrUnitBal               PIC S9(10)V9(3) COMP-3.
062900210928       01 li_NewGBV                    PIC S9(11)V9(2) COMP-3.
063000210928       01 li_GBVChange                 PIC S9(11)V9(2) COMP-3.
063100210928       01 li_ResidualGBV               PIC S9(11)V9(2) COMP-3.
063200210928      *RFS168841 - ENDS
063300210928
063400210928      * RFS29028 - Begin
063500210928      * Some data to be saved
063600210928       01 WS-ACCOUNT-CONTRACT-INV-SAV.
063700210928         COPY DD-ALL-FORMATS OF MFAACCCIP.
063800210928      * RFS29028 - End
063900210928
064000210928       01 SW-REVISED-METHOD-FLAG       PIC 1 VALUE B'0'.
064100210928         88 SW-REVISED-METHOD-NOT-USED VALUE B'0'.
064200210928         88 SW-REVISED-METHOD-USED     VALUE B'1'.
064300210928
064400210928       01 SW-TRANS-CONTRACT-SWI-FLAG       PIC X(01).
064500210928         88 SW-TRANS-CONTRACT-SWI-OK       VALUE SPACE.
064600210928         88 SW-TRANS-CONTRACT-SWI-FAIL     VALUE "7".
064700210928
064800210928       01 SW-TEMP-FLAG                   PIC X(01) VALUE SPACES.
064900210928            88 SW-TEMP-OK                  VALUE SPACES.
065000210928            88 SW-TEMP-FAIL                VALUE "Y".
065100210928            88 SW-TEMP-FOUND               VALUE "F".
065200210928            88 SW-TEMP-END                 VALUE "E".
065300210928
065400210928       01  SCREEN-EDITS-ALLOWED-REC.
065500210928                        COPY DD-ALL-FORMATS OF MFAEDTSCP.
065600210928
065700210928       01  WS-SCREEN-EDITS-ALLOWED.
065800210928         05 WS-SEA-EDIT-SQLLOG         PIC X(1) VALUE "N".
065900210928         05 WS-SEA-RETURN-CODE         PIC X(2) VALUE "00".
066000210928
066100210928       01  WS-SCREEN-EDITS-ALLOWED.
066200210928         05 WS-ACCCDTL-SCREEN-CODE   PIC X(8)     VALUE "ACCCDTL".
066300210928         05 WS-DMCCON-EDIT-CODE      PIC X(8)     VALUE "DMCCON" .
066400210928         05 WS-DMCCON-LEVEL-CODE     PIC X(1)     VALUE "A".
066500210928      * RFS24943 - End
066600210928
066700210928      *RFS187205 Start
066800210928      *   for screen edit code NGGUAR
066900210928       01 WS-EDIT-NGGUAR           PIC X(1).
067000210928          88 WS-EDIT-NGGUAR-YES     VALUE "Y".
067100210928          88 WS-EDIT-NGGUAR-NO      VALUE "N".
067200210928      *RFS187205 End
067300210928
067400210928107585 01 lc-TransferGDV              PIC X(01).
067500210928      * RFS24943 - Begin
067600210928       01 SW-STS-FLAG                     PIC X(01).
067700210928         88 SW-STS-OK                     VALUE SPACES.
067800210928         88 SW-STS-END                    VALUE "7".
067900210928
068000210928       01 SW-ACC-CON-FLAG                 PIC X(01).
068100210928         88 SW-ACC-CON-OK                 VALUE SPACES.
068200210928         88 SW-ACC-CON-FAIL               VALUE "7".
068300210928
068400210928       01 SW-TRN-CON-FLAG                 PIC X(01).
068500210928         88 SW-TRN-CON-OK                 VALUE SPACES.
068600210928         88 SW-TRN-CON-FAIL               VALUE "7".
068700210928
068800210928      * RFS29028 - Begin
068900210928       01 SW1-ACC-CON-FLAG          PIC X(01) VALUE SPACES.
069000210928         88 SW1-ACC-CON-OK      VALUE SPACES.
069100210928         88 SW1-ACC-CON-READ    VALUE "3".
069200210928         88 SW1-ACC-CON-REWRITE VALUE "4".
069300210928      *
069400210928       01 lt-min-max-delta-vars.
069500210928         03 lt-max-delta-gbv       PIC S9(03) COMP-3 VALUE  1.0.
069600210928         03 lt-max-delta-ndv       PIC S9(03) COMP-3 VALUE  1.0.
069700210928
069800210928         03 lt-min-delta-gbv       PIC S9(03) COMP-3 VALUE -1.0.
069900210928         03 lt-min-delta-ndv       PIC S9(03) COMP-3 VALUE -1.0.
070000210928      * RFS29028 - End
070100210928
070200210928      * RFS 110904 - START
070300210928       01 LC-INVSTRUCTURECODE          PIC X(5).
070400210928127401 01 lc-GuarBenefitEligible       PIC X(5).
070500210928      * RFS 110904 - END
070600210928
070700210928       01 LT-LITERALS.
070800210928         03 LT-Y                       PIC X(01)    VALUE "Y".
070900210928         03 LT-N                       PIC X(01)    VALUE "N".
071000210928
071100210928       01 DSP-VARS.
071200210928         03 DSP-ACCOUNT-NO         PIC -9(08)9.
071300210928         03 DSP-CONTRACT-NO        PIC -9(08)9.
071400210928         03 DSP-PLACEMENT-DATE     PIC -9(08)9.
071500210928         03 DSP-TRANS-NO           PIC -9(08)9.
071600210928
071700210928       01 WS-TEMP-VARS.
071800210928         03 WS-TEMP-ACCOUNT-NO         PIC S9(09).
071900210928         03 WS-TEMP-CONTRACT-NO        PIC S9(09).
072000210928         03 WS-TEMP-INVESTMENT-CODE    PIC X(05).
072100210928         03 WS-TEMP-ORIG-UNIT-BAL      PIC S9(11)V9(03) COMP-3.
072200210928
072300210928      * Error Codes, Uniquely Identify where the error happened
072400210928       01 WS-ERR-CODE                 PIC X(02) VALUE SPACES.
072500210928          88 WS-ERR-OK                          VALUE SPACES.
072600210928          88 WS-ERR-10                          VALUE "10".
072700210928          88 WS-ERR-11                          VALUE "11".
072800210928          88 WS-ERR-12                          VALUE "12".
072900210928      * RFS24943 - End
073000210928
073100210928       01  WS-MISC-FIELDS.
073200210928           05 WS-REJECTION-CODE        PIC X(3).
073300210928           05 WS-EXCHANGE-FOUND        PIC X(1).
073400210928           05 WS-FIRST-READ-SW         PIC X(1) VALUE "Y".
073500210928      * RFS 20516 - Start
073600210928           05 WS-USE-DIRECT            PIC X(1) VALUE " ".
073700210928           05 WS-PRE-1999              PIC X(1) VALUE " ".
073800210928      * RFS 20516 - End
073900210928
074000210928      * RFS24943 - Begin
074100210928      * Curr-unit-balance of Account-Contract of Acc Contract-Inv-t
074200210928           05 WS-RDM-CURR-UNIT-BAL     PIC S9(11)V9(3) COMP-3.
074300210928      * Total Units in the contract
074400210928           05 WS-RDM-TOT-CURR-UNIT-BAL PIC S9(11)V9(3) COMP-3.
074500210928           05 WS-RDM-TOT-UNITS          PIC S9(11)V9(3) COMP-3.
074600210928
074700210928           05 WS-RDM-TOT-GBV           PIC S9(11)V9(2) COMP-3.
074800210928           05 WS-RDM-TOT-NDV           PIC S9(11)V9(2) COMP-3.
074900210928      * GBV that is going to be brought over
075000210928           05 WS-GBV-OVER              PIC S9(11)V9(2) COMP-3.
075100210928           05 WS-NDV-OVER              PIC S9(11)V9(2) COMP-3.
075200210928
075300210928           05 WS-TRANS-CHARGES         PIC S9(11)V9(2) COMP-3.
075400210928           05 WS-TRANS-CHARGES-IN      PIC S9(11)V9(2) COMP-3.
075500210928
075600210928      * RFS24943 - End
075700210928
075800210928      * RFS29028 - Begin
075900210928           05 WS-CALC-TOT-GBV    PIC S9(11)V9(2) COMP-3 VALUE 0.
076000210928           05 WS-CALC-TOT-NDV    PIC S9(11)V9(2) COMP-3 VALUE 0.
076100210928
076200210928      * To keep reconciliation amount
076300210928           05 WS-DELTA-TOT-GBV   PIC S9(11)V9(2) COMP-3 VALUE 0.
076400210928           05 WS-DELTA-TOT-NDV   PIC S9(11)V9(2) COMP-3 VALUE 0.
076500210928
076600210928      * RFS29028 - End
076700210928
076800210928           05 WS-AVAILABLE-UNITS       PIC S9(10)V9(3) COMP-3.
076900210928           05 WS-UNITS-USED            PIC S9(10)V9(3) COMP-3.
077000210928           05 WS-REQUIRED-UNITS        PIC S9(10)V9(3) COMP-3.
077100210928           05 WS-CURR-UNIT-BAL         PIC S9(10)V9(3) COMP-3.
077200210928
077300210928           05 WS-OLD-NET-DEP-VALUE     PIC S9(11)V9(2) COMP-3.
077400210928           05 WS-OLD-GUAR-BASE-VALUE   PIC S9(11)V9(2) COMP-3.
07750021092817973      05 WS-OLD-GUAR-DEATH-VALUE  PIC S9(11)V9(2) COMP-3.
077600210928           05 WS-NEW-NET-DEP-VALUE     PIC S9(11)V9(2) COMP-3.
077700210928           05 WS-NEW-GUAR-BASE-VALUE   PIC S9(11)V9(2) COMP-3.
07780021092817973      05 WS-NEW-GUAR-DEATH-VALUE  PIC S9(11)V9(2) COMP-3.
077900210928
078000210928           05 WS-OLD-NET-DEP-VAL-CUR   PIC S9(11)V9(2) COMP-3.
078100210928           05 WS-OLD-GUAR-BASE-VAL-CUR PIC S9(11)V9(2) COMP-3.
07820021092817973      05 WS-OLD-GUAR-DEATH-VAL-CUR  PIC S9(11)V9(2) COMP-3.
078300210928           05 WS-NEW-NET-DEP-VAL-CUR   PIC S9(11)V9(2) COMP-3.
078400210928           05 WS-NEW-GUAR-BASE-VAL-CUR PIC S9(11)V9(2) COMP-3.
07850021092817973      05 WS-NEW-GUAR-DEATH-VAL-CUR  PIC S9(11)V9(2) COMP-3.
078600210928RF9332     05 WS-NEW-OPENING-UNIT-BAL  PIC S9(10)V9(3) COMP-3.
078700210928
078800210928      * RFS24943 - Begin
078900210928           05 WS-EDIT-DMCCON           PIC  X(1) VALUE SPACES.
079000210928             88 WS-EDIT-DMCCON-NO      VALUE SPACES.
079100210928             88 WS-EDIT-DMCCON-YES     VALUE "Y".
079200210928      * RFS24943 - End
079300210928
079400210928      * Exchange variables
079500210928
079600210928           05 WS-EXCH-PLACEMENT-DATE   PIC S9(10)      COMP-3.
079700210928           05 WS-EXCH-TRANS-NO         PIC S9(10)      COMP-3.
079800210928           05 WS-EXCH-CURRENCY         PIC X(3).
079900210928           05 WS-EXCH-TRADE-DATE       PIC 9(8).
080000210928           05 WS-EXCH-RATE             PIC S9(2)V9(7)  COMP-3.
080100210928
080200210928      * Current incoming trans
080300210928
080400210928           05 WS-CURR-TRANS-TRADE-DATE PIC 9(8).
080500210928           05 WS-CURR-TRANS-PROCESS-DATE PIC 9(8).
080600210928           05 WS-CURR-TRANS-EXCH-RATE  PIC S9(2)V9(7)  COMP-3.
080700210928           05 WS-CURR-TRANS-PRICE      PIC S9(5)V9(4)  COMP-3.
080800210928RF8781     05 WS-CURR-AVE-UNIT-COST    PIC S9(5)V9(4)  COMP-3.
080900210928RF8781     05 WS-CURR-AVE-EXCH-RATE    PIC S9(2)V9(7)  COMP-3.
081000210928           05 WS-CURR-TRANS-AMT-CUR    PIC S9(11)V9(2) COMP-3.
081100210928           05 WS-CURR-TRANS-AMT        PIC S9(11)V9(2) COMP-3.
08120021092817973      05 WS-CURR-TRANS-AMT-CUR-GDV   PIC S9(11)V9(2) COMP-3.
08130021092817973      05 WS-CURR-TRANS-AMT-GDV    PIC S9(11)V9(2) COMP-3.
081400210928RF9332     05 WS-CURR-TRANS-UNITS      PIC S9(10)V9(3) COMP-3.
081500210928RF9332     05 WS-CURR-ORIG-UNIT-BAL    PIC S9(10)V9(3) COMP-3.
081600210928RF9332     05 WS-CURR-TRADE-GROSS-AMT  PIC S9(11)V9(2) COMP-3.
081700210928      * begin R74468
081800210928RF9332*    05 WS-CURR-TRANS-GROSS      PIC S9(11)V9(2) COMP-3.
081900210928RF9332     05 WS-CURR-TRANS-GROSS      PIC S9(11)V9(2) COMP-3 VALUE 0.
08200021092817973 *    05 WS-CURR-TRADE-GROSS-AMT-GDV  PIC S9(11)V9(2) COMP-3.
08210021092817973    05 WS-CURR-TRADE-GROSS-AMT-GDV PIC S9(11)V9(2) COMP-3 VALUE 0.
08220021092817973 *    05 WS-CURR-TRANS-GROSS-GDV      PIC S9(11)V9(2) COMP-3.
08230021092817973    05 WS-CURR-TRANS-GROSS-GDV     PIC S9(11)V9(2) COMP-3 VALUE 0.
082400210928      * end   R74468
082500210928
082600210928      * FIFO Purchase trans for redemption
082700210928
082800210928           05 WS-PUR-TRANS-EXCH-RATE   PIC S9(2)V9(7)  COMP-3.
082900210928           05 WS-PUR-TRANS-AMT-CUR     PIC S9(11)V9(2) COMP-3.
083000210928           05 WS-PUR-TRANS-AMT         PIC S9(11)V9(2) COMP-3.
083100210928
083200210928
083300210928           05 WS-SYSDATE.
083400210928              10 WS-SYSDATE-CC       PIC 99.
083500210928              10 WS-SYSDATE-YMD.
083600210928                 15 WS-SYSDATE-YY    PIC 99.
083700210928                 15 WS-SYSDATE-MM    PIC 99.
083800210928                 15 WS-SYSDATE-DD    PIC 99.
083900210928           05 WS-SYSDATE-N REDEFINES WS-SYSDATE
084000210928                                     PIC 9(8).
084100210928
084200210928           05 WS-SYSTIME-LONG.
084300210928              10 WS-SYSTIME.
084400210928                 15 WS-SYSTIME-HH    PIC 99.
084500210928                 15 WS-SYSTIME-MI    PIC 99.
084600210928                 15 WS-SYSTIME-SS    PIC 99.
084700210928              10 WS-SYSTIME-N REDEFINES WS-SYSTIME
084800210928                                     PIC 9(6).
084900210928              10 WS-SYSTIME-2 REDEFINES WS-SYSTIME
085000210928                                     PIC 9(4).
085100210928              10 WS-SYSTIME-HS       PIC 99.
085200210928
085300210928            05 WS-SYSTIME-LONG-N REDEFINES WS-SYSTIME-LONG
085400210928                                     PIC 9(8).
085500210928
085600210928            05 WS-MISC-INFO-AREA       PIC X(40).
085700210928
085800210928            05 WS-MISC-INFO-1 REDEFINES WS-MISC-INFO-AREA.
085900210928              10 WS-MISC-INFO-1-NAME   PIC X(20).
086000210928              10 WS-MISC-INFO-1-UNIT   PIC -9(10).9(3).
086100210928
086200210928            05 WS-MISC-INFO-2 REDEFINES WS-MISC-INFO-AREA.
086300210928              10 WS-MISC-INFO-2-NAME   PIC X(11).
086400210928              10 WS-MISC-INFO-2-NKEY-1 PIC X(6).
086500210928              10 WS-MISC-INFO-2-KEY-1  PIC 9(8).
086600210928              10 WS-MISC-INFO-2-NKEY-2 PIC X(6).
086700210928              10 WS-MISC-INFO-2-KEY-2  PIC 9(9).
086800210928
086900210928RF8781      05 WS-OTHER-VARIABLES.
087000210928              10 WS-AVERAGE-UNIT-COST       PIC S9(05)V9(4) COMP-3
087100210928                                            VALUE ZEROES.
087200210928              10 WS-AVERAGE-EXCHANGE-RATE   PIC S9(02)V9(7) COMP-3
087300210928                                            VALUE ZEROES.
087400210928              10 WS-CURR-UNIT-BAL-DLYHST    PIC S9(10)V9(3) COMP-3.
087500210928              10 WS-DUMMY-AVE-UNIT-COST     PIC S9(05)V9(7) COMP-3.
087600210928RF8781        10 WS-EXCH-RATE-VALUE         PIC S9(02)V9(7) COMP-3.
087700210928              10 WS-UPDATE-FILE             PIC X.
087800210928              10 WS-CURR-TRANS-GBV-AMT-CUR  PIC S9(11)V9(2) COMP-3.
087900210928              10 WS-CURR-TRANS-GBV-AMT      PIC S9(11)V9(2) COMP-3.
08800021092817973         10 WS-CURR-TRANS-GDV-AMT-CUR  PIC S9(11)V9(2) COMP-3.
08810021092817973         10 WS-CURR-TRANS-GDV-AMT      PIC S9(11)V9(2) COMP-3.
088200210928      * RFS24943 - Begin
088300210928              10 WS-TRANS-TARGET-FOUND      PIC X(01) VALUE "N".
088400210928      * RFS24943 - End
088500210928
088600210928RF9332 01 WS-ACC-CONT-INV-ARRAYX.
088601211007111744*   05 WS-ACC-CONT-INV-ARRAY OCCURS 100 TIMES INDEXED BY CONTIDX.
088602211007111744    05 WS-ACC-CONT-INV-ARRAY OCCURS 1 TO 1000 TIMES DEPENDING ON
088603211007111744                       ln_InvArraySize INDEXED BY CONTIDX.
088800210928              10 WS-ARRAY-ACCOUNT-NO        PIC 9(09).
088900210928              10 WS-ARRAY-CONTRACT-NO       PIC X(09).
089000210928              10 WS-ARRAY-INVESTMENT-CODE   PIC X(05).
089100210928              10 WS-ARRAY-INV-CURR-CODE     PIC X(03).
089200210928              10 WS-ARRAY-BEFORE-MV         PIC S9(11)V9(2) COMP-3.
089300210928              10 WS-ARRAY-BEFORE-GBV        PIC S9(11)V9(2) COMP-3.
08940021092817973         10 WS-ARRAY-BEFORE-GDV        PIC S9(11)V9(2) COMP-3.
089500210928              10 WS-ARRAY-BEFORE-NDV        PIC S9(11)V9(2) COMP-3.
089600210928              10 WS-ARRAY-AFTER-MV          PIC S9(11)V9(2) COMP-3.
089700210928              10 WS-ARRAY-INV-EXCH-RATE     PIC S9(2)V9(7) COMP-3.
089800210928
089900210928      * RFS49699 - Begin
090000210928
090100210928       01 WS-ARRAY-LOG-MISC.
090200210928           05 WS-ARRAY1-NAME           PIC X(32)
090300210928                               VALUE "WS-ACC-CONT-INV-ARRAY".
090400210928           05 WS-ARRAY1-MAX            PIC 9(09)
090500210928                               VALUE 100.
090600210928           05 WS-ARRAY1-MAX-USED       PIC 9(09)
090700210928                               VALUE 0.
090800210928
090900210928      * RFS49699 - End
091000210928
091100210928       01 WS-VARS-4ROUNDING.
091200210928          05 WS-CONT-NDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
091300210928          05 WS-CONT-GBV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
09140021092817973     05 WS-CONT-GDV-AFT-TOTAL          PIC S9(11)V9(2) COMP-3.
091500210928          05 WS-NDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
091600210928          05 WS-GBV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
09170021092817973     05 WS-GDV-DIFF-AMOUNT             PIC S9(11)V9(2) COMP-3.
091800210928
09190021092817973  01 WS-DEATH-PERCENT                  PIC S9(3)V9(2).
09200021092817973  01 WS-CALC-GDV                       PIC X(01).
092100210928       01 WS-CALC-METHOD                    PIC X(01).
092200210928       01 WS-BUY-CALC-P-FLAG                PIC X(01).
092300210928       01 WS-GET-LOAD-STRUCTURE             PIC X(01).
092400210928       01 WS-LEVEL-88.
092500210928          05 WS-LOAD-STRUCTURE              PIC X.
092600210928             88 FRONT-END                   VALUE "F".
092700210928          05 WS-NDV-DIFF-FLAG               PIC X(01).
092800210928             88 NDV-DIFFERENCE-FOUND        VALUE "Y".
092900210928          05 WS-GBV-DIFF-FLAG               PIC X(01).
093000210928             88 GBV-DIFFERENCE-FOUND        VALUE "Y".
09310021092817973     05 WS-GDV-DIFF-FLAG               PIC X(01).
09320021092817973        88 GDV-DIFFERENCE-FOUND        VALUE "Y".
093300210928          05 WS-NDV-UPDATE-FLAG             PIC X(01).
093400210928             88 NDV-NOT-UPDATED             VALUE "Y".
093500210928          05 WS-GBV-UPDATE-FLAG             PIC X(01).
093600210928             88 GBV-NOT-UPDATED             VALUE "Y".
09370021092817973     05 WS-GDV-UPDATE-FLAG             PIC X(01).
09380021092817973        88 GDV-NOT-UPDATED             VALUE "Y".
093900210928R13394    05 WS-XFER-AMT-EXISTS-FLAG        PIC X(01).
094000210928R13394       88 TRANSFER-AMT-EXISTS         VALUE "Y".
094100210928
094200210928       01 WS-OTHER-VARIABLES-2.
094300210928          05 WS-DIFF-INVESTMENT-FLAG        PIC X(01).
094400210928          05 WS-OLD-CURR-INVESTMENT-CODE    PIC X(05).
094500210928          05 WS-CONT-INVESTMENT-CODE        PIC X(05).
094600210928          05 WS-PRICE-FOUND                 PIC X(01).
094700210928          05 WS-REQUIRED-UNITSP             PIC S9(10)V9(3) COMP-3.
094800210928          05 WS-INV-UNIT-PRICE              PIC S9(5)V9(4) COMP-3.
094900210928          05 WS-INV-BEF-MARKET-VALUE        PIC S9(11)V9(2) COMP-3.
095000210928          05 WS-INV-AFT-MARKET-VALUE        PIC S9(11)V9(2) COMP-3.
095100210928          05 WS-CONT-INV-MARKET-VALUE       PIC S9(12)V9(2) COMP-3.
095200210928          05 WS-CURR-CONTRACT-MV-AFT        PIC S9(12)V9(2) COMP-3.
095300210928          05 WS-INV-BEF-GBV                 PIC S9(11)V9(2) COMP-3.
09540021092817973     05 WS-INV-BEF-GDV                 PIC S9(11)V9(2) COMP-3.
095500210928          05 WS-INV-BEF-NDV                 PIC S9(11)V9(2) COMP-3.
095600210928          05 WS-CURR-CONTRACT-GBV-BEF       PIC S9(12)V9(2) COMP-3.
095700210928          05 WS-CURR-CONTRACT-GBV-AFT       PIC S9(12)V9(2) COMP-3.
09580021092817973     05 WS-CURR-CONTRACT-GDV-BEF       PIC S9(12)V9(2) COMP-3.
09590021092817973     05 WS-CURR-CONTRACT-GDV-AFT       PIC S9(12)V9(2) COMP-3.
096000210928          05 WS-CURR-CONTRACT-NDV-BEF       PIC S9(12)V9(2) COMP-3.
096100210928          05 WS-CURR-CONTRACT-NDV-AFT       PIC S9(12)V9(2) COMP-3.
096200210928          05 WS-GBV-CHANGE                  PIC S9(11)V9(2) COMP-3.
096300210928      *R54603 Extended decim places from 3 to 8 for all Percent Fields
09640021092854603     05 WS-INV-GBV-PERCENT             PIC S9(2)V9(8) COMP-3.
09650021092854603     05 WS-INV-GBV-PERCENT-TOTAL       PIC S9(2)V9(8) COMP-3.
09660021092817973     05 WS-GDV-CHANGE                  PIC S9(11)V9(2) COMP-3.
09670021092854603     05 WS-INV-GDV-PERCENT             PIC S9(2)V9(8) COMP-3.
09680021092854603     05 WS-INV-GDV-PERCENT-TOTAL       PIC S9(2)V9(8) COMP-3.
096900210928          05 WS-NDV-CHANGE                  PIC S9(11)V9(2) COMP-3.
09700021092854603     05 WS-INV-NDV-PERCENT             PIC S9(2)V9(8) COMP-3.
09710021092854603     05 WS-INV-NDV-PERCENT-TOTAL       PIC S9(2)V9(8) COMP-3.
097200210928          05 WS-INV-GBV-AFT                 PIC S9(11)V9(2) COMP-3.
097300210928          05 WS-INV-GBV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
09740021092817973     05 WS-INV-GDV-AFT                 PIC S9(11)V9(2) COMP-3.
09750021092817973     05 WS-INV-GDV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
097600210928          05 WS-INV-NDV-AFT                 PIC S9(11)V9(2) COMP-3.
097700210928          05 WS-INV-NDV-AFT-CUR             PIC S9(11)V9(2) COMP-3.
097800210928          05 WS-NDV-AMOUNT-DIFF             PIC S9(02)V9(2) COMP-3.
097900210928          05 WS-GBV-AMOUNT-DIFF             PIC S9(02)V9(2) COMP-3.
09800021092817973     05 WS-GDV-AMOUNT-DIFF             PIC S9(02)V9(2) COMP-3.
098100210928          05 WS-CONT-INV-ARRAY-COUNT        PIC S9(03) COMP-3.
098200210928          05 WS-CONT-INV-COUNT              PIC S9(03) COMP-3.
09830021092854603     05 WS-DUMMY-PERCENT               PIC S9(2)V9(8) COMP-3.
098400210928RF9332
098500210928RF8092 01 WS-OTHER-VARIABLES3.
098600210928RF8092    05 WS-FROM-ACCOUNT-TYPE        PIC X(05).
098700210928RF8092    05 WS-FROM-NOM-ACCOUNT-TYPE    PIC X(05).
098800210928RF8092    05 WS-FROM-TRANS-TYPE-CODE     PIC X(03).
098900210928RF8092    05 WS-TO-ACCOUNT-TYPE          PIC X(05).
099000210928RF8092    05 WS-TO-NOM-ACCOUNT-TYPE      PIC X(05).
099100210928RF8092    05 WS-TO-TRANS-TYPE-CODE       PIC X(03).
099200210928RF8092    05 WS-TRANS-ORIGIN-CODE        PIC X(03).
099300210928RF8092    05 WS-CONTR-REDEM-CODE         PIC X(06).
099400210928RF8092    05 WS-FROM-PLACEMENT-DATE      PIC S9(09) COMP-3.
099500210928RF8092    05 WS-FROM-TRANS-NO            PIC S9(09) COMP-3.
099600210928RF8092    05 WS-TO-PLACEMENT-DATE        PIC S9(09) COMP-3.
099700210928RF8092    05 WS-TO-TRANS-NO              PIC S9(09) COMP-3.
099800210928RF8092    05 WS-FROM-ACCOUNT-NO          PIC S9(09) COMP-3.
099900210928RF8092    05 WS-TO-ACCOUNT-NO            PIC S9(09) COMP-3.
100000210928RF8092    05 WS-FROM-CONTRACT-NO         PIC 9(09).
100100210928RF8092    05 WS-TO-CONTRACT-NO           PIC 9(09).
100200210928RF8092    05 WS-TRANSFER-GBV             PIC X(01).
10030021092816512     05 WS-FROM-GROSS-AMT           PIC S9(11)V9(2) COMP-3.
100400210928
100500210928      /
100600210928R11255 01 WS-OTHER-VARIABLES4.
100700210928R11255    05 WS-EX-ACCOUNT-TYPE          PIC X(05).
100800210928R11255    05 WS-EX-NOM-ACCOUNT-TYPE      PIC X(05).
100900210928R11255    05 WS-EX-TRANS-TYPE-CODE       PIC X(03).
101000210928R11255    05 WS-EX-TRANS-ORIGIN-CODE     PIC X(03).
101100210928R11255    05 WS-EX-REVERSAL-CODE         PIC X(04).
101200210928R11255    05 WS-EX-ACCOUNT-ATT-CODE      PIC X(05).
101300210928
101400210928      *------------------------------------------------*
101500210928      * LEVEL 88 ELEMENTS                              *
101600210928      *------------------------------------------------*
101700210928       01 TRANSACTION-CATEGORIES.
101800210928          05 TRANS-CATEGORY              PIC X(3).
101900210928             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI"
102000210928                                                "SSD" "SSU" "BFW" "BAJ".
102100210928             88 PURCHASE-ADJUSTMENT      VALUES "BAJ".
102200210928             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
102300210928             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO"
102400210928                                                "TFE" "CQD" "FEE" "SAJ".
102500210928             88 REDEMPTION-ADJUSTMENT    VALUES "SAJ".
102600210928             88 FEE-TRANSACTION          VALUES "TFE" "FEE".
102700210928             88 SWITCH-OUT-TRANSACTION   VALUES "SWO" "TRO".
102800210928             88 DISTRIBUTION-TRANSACTION VALUES "INC" "CPG" "INT" "MFR".
102900210928             88 INCOME-TRANSACTION       VALUES "INC".
103000210928             88 CAPITAL-GAIN-TRANSACTION VALUES "CPG".
103100210928             88 INTEREST-TRANSACTION     VALUES "INT".
103200210928             88 MAN-FEE-REB-TRANSACTION  VALUES "MFR".
103300210928             88 BFW-TRANSACTION          VALUES "BFW".
103400210928             88 ADDITION-TRANSACTION     VALUES "BUY" "INC" "CPG"
103500210928                                                "SWI" "TRI" "INT"
103600210928                                                "MFR" "SSD" "SSU" "BAJ"
103700210928                                                "BFW".
103800210928             88 REDUCTION-TRANSACTION    VALUES "SEL" "SWO" "TRO"
103900210928                                                "TFE" "CQD" "FEE" "SAJ".
104000210928             88 VALID-TRANSACTION        VALUES "BUY" "SEL" "SWI"
10410021092826151                                           "MFR"
104200210928136670                                          "FEE"
104300210928159011                                          "INC" "CPG" "INT"
104400210928                                                "SWO" "TRI" "TRO".
104500210928RF8781       88 SWITCH-OUT               VALUE  "SWO".
104600210928RF8781       88 SWITCH-IN                VALUE  "SWI".
104700210928RF8781       88 TRANSFER-OUT             VALUE  "TRO".
104800210928RF8781       88 TRANSFER-IN              VALUE  "TRI".
104900210928RF8781       88 BUY-TRANSACTION          VALUE  "BUY".
105000210928             88 SELL-TRANSACTION         VALUE  "SEL".
105100210928
105200210928          05 TRANS-CATEGORY-R            PIC X(3).
105300210928             88 PURCHASE-TRANSACTION-R   VALUES "BUY" "SWI" "TRI".
105400210928             88 DISTRIBUTION-TRANSACTION-R VALUES "INC" "CPG"
105500210928                                                      "INT" "MFR".
10560021092826151**      88 VALID-TRANSACTION-R      VALUES "BUY" "SWI" "TRI".
10570021092826151        88 VALID-TRANSACTION-R      VALUES "BUY" "SWI" "TRI" "MFR".
105800210928             88 TRANSFER-OUT-R           VALUE "TRO".
105900210928
106000210928       01 TRANSACTION-STATUS-CATEGORIES.
106100210928          05 TRANS-STATUS-CATEGORY       PIC X(3).
106200210928             88 HISTORY                  VALUES "HST" "HSC".
106300210928             88 HISTORY-CONVERSION       VALUES "HSC".
106400210928             88 PENDING                  VALUES "PND" "VER".
106500210928             88 CONTRACTED               VALUES "CON".
106600210928             88 UNCONFIRMED              VALUES "UNC".
106700210928             88 CANCELLED                VALUES "CAN".
106800210928             88 SETTLED                  VALUES "SET".
106900210928             88 RVSD                     VALUES "RVS".
107000210928
107100210928          05 TRANS-STATUS-CATEGORY-R     PIC X(3).
107200210928             88 HISTORY-R                VALUES "HST" "HSC".
107300210928
107400210928       01 TRANSACTION-REVERSE-CATEGORIES.
107500210928          05 TRANS-REVERSE-CATEGORY      PIC X(1).
107600210928             88 TRANS-REVERSED           VALUES "Y".
107700210928
107800210928          05 TRANS-REVERSE-CATEGORY-R    PIC X(1).
107900210928             88 TRANS-REVERSED-R         VALUES "Y".
108000210928
108100210928       01 PRIOR-RESET-AREA.
108200210928          05 PRIOR-RESET-NUMBER          PIC S9(5) COMP.
108300210928          05 PRIOR-RESET-FLAG            PIC X(1).
108400210928             88 PRIOR-RESET-EXISTS       VALUES "Y".
108500210928             88 NO-PRIOR-RESET           VALUES "N".
108600210928          05 PRIOR-RESET-INFO-FLAG       PIC X(1).
108700210928             88 PRIOR-RESET-RETRIEVED    VALUES "Y".
108800210928          05 PRIOR-RESET-UNIT-PRICE      PIC S9(5)V9(4) COMP-3.
108900210928          05 PRIOR-RESET-EXCH-RATE       PIC S9(2)V9(7) COMP-3.
109000210928
109100210928      /
109200210928180708 01 WS-PLACEMENTDATE           PIC S9(09) VALUE 0.
109300210928180708 01 WS-TRANSNO                 PIC S9(09) VALUE 0.
109400210928
109401211007      * RFS1117445 - START
109402211007       01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
109403211007       01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
109404211007       01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
109405211007      * RFS1117445 - END
109500210928      * RFS24943 - Begin
109600210928      * ---------------------------------
109700210928      * Copybook - start
109800210928      * ---------------------------------
109900210928      * Get TRANS charges copybook
110000210928       COPY CPTRNCHR.
110100210928
110200210928      * Get GBV, NDV Totals per account-contract
110300210928       COPY CPGBVNDVT.
110400210928R47405 COPY CPGLWBRULE.
11050021092884063 *COPY CPGLWBCKTT.
11060021092884063  COPY CPCKFEETRN.
110700210928      * RFS49699 - Begin
110800210928
110900210928      *  screen edits allowed
111000210928           copy CPSCEDTAL1.
111100210928
111200210928      *  log array info
111300210928           copy CPFXLOGAU.
111400210928
111500210928      *  log array table name
111600210928           copy CPFXLOGAT.
111700210928
111800210928      * RFS49699 - End
111900210928
112000210928      * ---------------------------------
112100210928      * Copybook - end
112200210928      * ---------------------------------
112300210928      * RFS24943 - End
112400210928
112500210928       LINKAGE SECTION.
112600210928        01 COMM-AREA                     PIC X(200).
112700210928
112800210928        01 COMM-AREA-BUFFER REDEFINES COMM-AREA.
112900210928           03 COMM-REJECTION-CODE        PIC X(3).
113000210928           03 COMM-USER                  PIC X(10).
113100210928           03 COMM-CALLER-ID-CODE        PIC X(10).
113200210928
113300210928           03 COMM-ACTION                PIC X(10).
113400210928      * 'DAILY HST' = process daily history transaction.
113500210928      * 'RE-CALC  ' = re-calculates transactions of a fund between
113600210928      *               start date & stop date
113700210928
113800210928           03 COMM-OPEN-FILES            PIC X(1).
113900210928      * 'Y' = open files, otherwise skip open files
114000210928
114100210928           03 COMM-PROCESS-DATE          PIC 9(8).
114200210928           03 COMM-ACCOUNT-NO            PIC 9(9).
114300210928           03 COMM-CONTRACT-NO           PIC 9(9).
114400210928           03 COMM-REQ-FUND              PIC X(5).
114500210928RF9332     03 COMM-PLACEMENT-DATE        PIC 9(9).
114600210928RF9332     03 COMM-TRANS-NO              PIC 9(9).
114700210928
114800210928110904 01 ACCOUNT-CONTRACT.
114900210928110904    05 GUAR-Benefit-Eligible       PIC X(1).
115000210928      /
115100210928127401*PROCEDURE DIVISION USING COMM-AREA.
115200210928127401 PROCEDURE DIVISION USING COMM-AREA,  ACCOUNT-CONTRACT.
115300210928       MAINLINE.
115400210928           PERFORM INITIAL-LOGIC     THRU INL-EXIT.
115500210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
115600210928              GO TO ML-1200.
115700210928       ML-0010.
115800210928           PERFORM GET-CURRENT-RECORD THRU GCR-EXIT.
115900210928       ML-0020.
116000210928           IF PREV-LEVEL1 IS EQUAL TO CURR-LEVEL1
116100210928              GO TO ML-1100.
116200210928           IF PREV-CONTROLS IS EQUAL TO LOW-VALUES
116300210928              GO TO ML-0040.
116400210928       ML-0030.
116500210928           PERFORM LEVEL-SUMMARY-1    THRU LS1-EXIT.
116600210928           IF PREV-LEVEL2 IS EQUAL TO CURR-LEVEL2
116700210928              GO TO ML-0100.
116800210928           PERFORM LEVEL-SUMMARY-2    THRU LS2-EXIT.
116900210928       ML-0035.
117000210928           IF PREV-LEVEL3 IS EQUAL TO CURR-LEVEL3
117100210928              GO TO ML-0060.
117200210928           PERFORM LEVEL-SUMMARY-3    THRU LS3-EXIT.
117300210928       ML-0037.
117400210928           IF PREV-LEVEL4 IS EQUAL TO CURR-LEVEL4
117500210928              GO TO ML-0050.
117600210928           PERFORM LEVEL-SUMMARY-4    THRU LS4-EXIT.
117700210928       ML-0040.
117800210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
117900210928              GO TO ML-1200.
118000210928       ML-0045.
118100210928           PERFORM LEVEL-REINIT-4     THRU LR4-EXIT.
118200210928       ML-0050.
118300210928           PERFORM LEVEL-REINIT-3     THRU LR3-EXIT.
118400210928       ML-0060.
118500210928           PERFORM LEVEL-REINIT-2     THRU LR2-EXIT.
118600210928       ML-0100.
118700210928           PERFORM LEVEL-REINIT-1     THRU LR1-EXIT.
118800210928           MOVE CURR-CONTROLS         TO PREV-CONTROLS.
118900210928       ML-1100.
119000210928           PERFORM DETAIL-PROCESSING  THRU DPR-EXIT.
119100210928           MOVE HIGH-VALUES TO CURR-CONTROLS.
119200210928           GO TO ML-0010.
119300210928       ML-1200.
119400210928           PERFORM END-JOB            THRU EOJ-EXIT.
119500210928           GOBACK.
119600210928
119700210928      /
119800210928       GET-CURRENT-RECORD.
119900210928
120000210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
120100210928              GO TO GCR-EXIT
120200210928           END-IF.
120300210928
120400210928           EVALUATE COMM-ACTION
120500210928
120600210928           WHEN "RVS TRADE"
120700210928             PERFORM GET-DAILY-HST-RECORD
120800210928                                       THRU GDHR-EXIT
120900210928           WHEN OTHER
121000210928             MOVE HIGH-VALUES  TO CURR-CONTROLS
121100210928
121200210928           END-EVALUATE.
121300210928
121400210928       GCR-EXIT.
121500210928           EXIT.
121600210928
121700210928      /
121800210928       GET-DAILY-HST-RECORD.
121900210928
122000210928RF9332     INITIALIZE MFATRNP OF TRANS-REC.
122100210928RF9332     MOVE COMM-PLACEMENT-DATE
122200210928RF9332       TO PLACEMENT-DATE OF TRANS-REC.
122300210928RF9332     MOVE COMM-TRANS-NO
122400210928RF9332       TO TRANS-NO OF TRANS-REC.
122500210928
122600210928       GDHR-0010.
122700210928           READ TRANS
122800210928           INVALID KEY
122900210928           MOVE HIGH-VALUES  TO CURR-CONTROLS
123000210928           GO TO GDHR-EXIT.
123100210928
123200210928
123300210928      * RFS 11255 Begins --------
123400210928
123500210928180708     INITIALIZE WS-PLACEMENTDATE WS-TRANSNO.
123600210928180708     MOVE PLACEMENT-DATE OF TRANS  TO WS-PLACEMENTDATE.
123700210928180708     MOVE TRANS-NO OF TRANS        TO WS-TRANSNO.
123800210928           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
123900210928
124000210928      * If exclude-trans-flag = 'Y' bypass the trans otherwise
124100210928      * process the trans.
124200210928
12430021092826151**    IF EXCLUDE-TRANS-FLAG = "Y"
12440021092826151**       MOVE HIGH-VALUES TO CURR-CONTROLS
12450021092826151**       GO TO GDHR-EXIT
12460021092826151**    END-IF.
124700210928
124800210928      * RFS 11255 Ends ----------
124900210928
125000210928           MOVE TRANS-TYPE-CODE OF TRANS
125100210928                              TO TRANS-CATEGORY.
125200210928
125300210928           MOVE TRANS-STATUS-CODE OF TRANS
125400210928                              TO TRANS-STATUS-CATEGORY.
125500210928
125600210928           MOVE REVERSE       OF TRANS
125700210928                              TO TRANS-REVERSE-CATEGORY.
125800210928
12590021092826151      IF EXCLUDE-TRANS-FLAG NOT = "Y" AND
12600021092826151         MAN-FEE-REB-TRANSACTION
12610021092826151         MOVE HIGH-VALUES TO CURR-CONTROLS
12620021092826151         GO TO GDHR-EXIT
12630021092826151      END-IF.
126400210928
126500210928           IF NOT HISTORY
126600210928              MOVE HIGH-VALUES TO CURR-CONTROLS
126700210928             GO TO GDHR-EXIT
126800210928           END-IF.
126900210928
127000210928           IF NOT VALID-TRANSACTION
127100210928              MOVE HIGH-VALUES TO CURR-CONTROLS
127200210928             GO TO GDHR-EXIT
127300210928           END-IF.
127400210928
127500210928      * rfs 11112 begins ***************
127600210928      * RFS 45592 Begin
127700210928      *    IF TRANS-ORIGIN-CODE OF TRANS = 'DTH'
127800210928      *      MOVE HIGH-VALUES TO CURR-CONTROLS
127900210928      *      GO TO GDHR-EXIT
128000210928      *    END-IF.
128100210928      * RFS 45592 End
128200210928      * rfs 11112 ends *****************
128300210928
128400210928           IF PLACEMENT-DATE OF TRANS NOT = COMM-PLACEMENT-DATE OR
128500210928              TRANS-NO OF TRANS NOT = COMM-TRANS-NO
128600210928              MOVE HIGH-VALUES TO CURR-CONTROLS
128700210928              GO TO GDHR-EXIT.
128800210928
128900210928       GDHR-0020.
129000210928           MOVE PLACEMENT-DATE OF TRANS
129100210928                             TO PLACEMENT-DATE
129200210928                             OF TRANS-CONTRACT-DETAILS.
129300210928           MOVE TRANS-NO     OF TRANS
129400210928                             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
129500210928           MOVE COMM-CONTRACT-NO
129600210928                             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
129700210928
129800210928       GDHR-0030.
129900210928           READ TRANS-CONTRACT-DETAILS
130000210928                INVALID KEY
130100210928                MOVE HIGH-VALUES TO CURR-CONTROLS
130200210928                GO TO GDHR-EXIT.
130300210928
130400210928           IF PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS NOT =
130500210928              PLACEMENT-DATE OF TRANS OR
130600210928              TRANS-NO       OF TRANS-CONTRACT-DETAILS NOT =
130700210928              TRANS-NO       OF TRANS
130800210928              MOVE HIGH-VALUES TO CURR-CONTROLS
130900210928             GO TO GDHR-EXIT
131000210928           END-IF.
131100210928
131200210928R12702     MOVE "N" TO WS-TRANSFER-GBV.
131300210928107585     MOVE "N" TO lc-TransferGDV.
131400210928R13306     IF SWITCH-IN-TRANSACTION
13150021092816512         MOVE CONTRACT-NO OF TRANS-CONTRACT-DETAILS
13160021092816512              TO WS-TO-CONTRACT-NO
131700210928RF8092        PERFORM GET-SEG-TRANSFER-PARAMETERS THRU GSTP-EXIT
131800210928R12702     END-IF.
131900210928
132000210928           MOVE ACCOUNT-NO   OF TRANS
132100210928                             TO CURR-ACCOUNT-NO.
132200210928           MOVE INVESTMENT-CODE OF TRANS
132300210928                             TO CURR-INVESTMENT-CODE.
132400210928      * get the load structure of the fund; if front-end, net-amt
132500210928      * will be used else gross-amt (for purchases only)
132600210928           MOVE "Y" TO WS-GET-LOAD-STRUCTURE.
132700210928           PERFORM LEVEL-REINIT-3 THRU LR3-EXIT.
132800210928
132900210928           MOVE CONTRACT-NO  OF TRANS-CONTRACT-DETAILS
133000210928                             TO CURR-CONTRACT-NO.
133100210928           MOVE PLACEMENT-DATE OF TRANS
133200210928                             TO CURR-PLACEMENT-DATE.
133300210928           MOVE TRANS-NO     OF TRANS
133400210928                             TO CURR-TRANS-NO.
133500210928           MOVE TRADE-DATE   OF TRANS
133600210928                             TO WS-CURR-TRANS-TRADE-DATE.
133700210928           MOVE PROCESS-DATE OF TRANS
133800210928                             TO WS-CURR-TRANS-PROCESS-DATE.
133900210928           MOVE UNIT-PRICE   OF TRANS
134000210928                             TO WS-CURR-TRANS-PRICE.
134100210928RF9332     MOVE UNIT-AMT     OF TRANS
134200210928RF9332                       TO WS-CURR-TRANS-UNITS.
134300210928
134400210928R13394* Get the NDV/GBV from Trans-GBV-Transfer if it exists
134500210928           MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
134600210928           INITIALIZE MFATRACXP OF TRANS-GBV-TRANSFER-REC.
134700210928           IF BUY-TRANSACTION
134800210928R49898        OR SWITCH-IN-TRANSACTION
134900210928              MOVE PLACEMENT-DATE OF TRANS
135000210928                TO PLACEMENT-DATE OF TRANS-GBV-TRANSFER
135100210928              MOVE TRANS-NO OF TRANS
135200210928                TO TRANS-NO OF TRANS-GBV-TRANSFER
135300210928
135400210928              READ TRANS-GBV-TRANSFER
135500210928                   INVALID KEY
135600210928R14814             GO TO GDHR-0035
135700210928              END-READ
135800210928
135900210928              MOVE "Y" TO WS-XFER-AMT-EXISTS-FLAG
136000210928R13394     END-IF.
136100210928
136200210928R14814 GDHR-0035.
136300210928R14814     IF TRANSFER-AMT-EXISTS
136400210928R14814        GO TO GDHR-0040
136500210928R14814     END-IF.
136600210928
136700210928           IF FRONT-END AND (BUY-TRANSACTION OR TRANSFER-IN)
136800210928              MOVE NET-AMT OF TRANS TO WS-CURR-TRANS-GROSS
13690021092817973         MOVE GDV-CHANGE OF TRANS-CONTRACT-DETAILS
13700021092817973           TO WS-CURR-TRANS-GROSS-GDV
137100210928           ELSE
137200210928RF9332        MOVE GROSS-AMT OF TRANS TO WS-CURR-TRANS-GROSS
13730021092817973                                    WS-CURR-TRANS-GROSS-GDV
137400210928           END-IF.
137500210928
137600210928           IF BUY-TRANSACTION OR TRANSFER-IN
13770021092817973         MOVE GDV-CHANGE OF TRANS-CONTRACT-DETAILS
13780021092817973           TO WS-CURR-TRANS-GROSS-GDV
137900210928           END-IF.
138000210928
138100210928       GDHR-0040.
138200210928           MOVE AVERAGE-UNIT-COST OF TRANS-CONTRACT-DETAILS
138300210928                TO WS-CURR-AVE-UNIT-COST.
138400210928           MOVE AVERAGE-EXCHANGE-RATE OF TRANS-CONTRACT-DETAILS
138500210928                TO WS-CURR-AVE-EXCH-RATE.
138600210928           MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
138700210928                TO WS-CURR-ORIG-UNIT-BAL.
138800210928
138900210928      *RFS159011 - STARTS
139000210928           MOVE Spaces  TO lc_DistrOptionCode
139100210928           IF DISTRIBUTION-TRANSACTION
139200210928167725     AND NOT MAN-FEE-REB-TRANSACTION
139300210928             PERFORM FETCH-DISTRIBUTION-TYPE
139400210928             IF lc_DistrOptionCode = lc_C
139500210928             AND EXCLUDE-TRANS-FLAG = "N"
139600210928                MOVE GROSS-AMT OF TRANS TO WS-CURR-TRANS-GROSS
139700210928                MOVE GDV-CHANGE OF TRANS-CONTRACT-DETAILS TO
139800210928                                WS-CURR-TRANS-GROSS-GDV
139900210928             END-IF
140000210928           END-IF
140100210928      *RFS159011 - ENDS
140200210928
140300210928R11593     IF REDEMPTION-TRANSACTION
140400210928R11593        COMPUTE WS-CURR-TRANS-GROSS ROUNDED =
140500210928R11593                ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
140600210928R11593                UNIT-PRICE OF TRANS
14070021092817973         MOVE WS-CURR-TRANS-GROSS TO WS-CURR-TRANS-GROSS-GDV
140800210928R11593     END-IF.
140900210928
141000210928       GDHR-EXIT.
141100210928           EXIT.
141200210928
141300210928      /
141400210928       CALC-PROPORTIONAL-GBV.
141500210928RF9332     PERFORM LEVEL-REINIT-4 THRU LR4-EXIT.
141600210928           PERFORM CALC-CONTRACT-MARKET-VALUE THRU CCMV-EXIT.
141700210928           PERFORM CALC-NEW-CHANGE-GBV THRU CNCG-EXIT.
141800210928       CPG-EXIT.
141900210928           EXIT.
142000210928
142100210928      /
142200210928       CALC-CONTRACT-MARKET-VALUE.
142300210928           MOVE CURR-ACCOUNT-NO
142400210928                TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-SWI.
142500210928           MOVE CURR-CONTRACT-NO
142600210928                TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-SWI.
142700210928           MOVE SPACES
142800210928                TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-SWI.
142900210928
143000210928           START ACCOUNT-CONTRACT-INVEST-SWI WITH NO LOCK
143100210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
143200210928           INVALID KEY
143300210928           GO TO CCMV-EXIT.
143400210928
143500210928           SET CONTIDX TO 1.
143600210928           SET CONTIDX DOWN BY 1.
143700210928
143800210928       CCMV-0010.
143900210928           READ ACCOUNT-CONTRACT-INVEST-SWI NEXT RECORD WITH NO LOCK
144000210928           AT END
144100210928           GO TO CCMV-EXIT.
144200210928
144300210928           IF CURR-ACCOUNT-NO NOT =
144400210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-SWI OR
144500210928              CURR-CONTRACT-NO NOT =
144600210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-SWI
144700210928              GO TO CCMV-EXIT
144800210928           END-IF.
144900210928
145000210928           MOVE "N" TO WS-DIFF-INVESTMENT-FLAG.
145100210928           IF CURR-INVESTMENT-CODE NOT =
145200210928              INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-SWI
145300210928              MOVE "Y" TO WS-DIFF-INVESTMENT-FLAG
145400210928           END-IF.
145500210928
145600210928       CCMV-0020.
145700210928           MOVE CURR-INVESTMENT-CODE TO WS-OLD-CURR-INVESTMENT-CODE.
145800210928           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-SWI
145900210928                TO CURR-INVESTMENT-CODE
146000210928                   WS-CONT-INVESTMENT-CODE.
146100210928           PERFORM LEVEL-REINIT-3 THRU LR3-EXIT.
146200210928           MOVE WS-OLD-CURR-INVESTMENT-CODE TO CURR-INVESTMENT-CODE.
146300210928
146400210928       CCMV-0030.
146500210928           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
146600210928              MOVE CURRENCY-DDS OF INVESTMENT TO WS-EXCH-CURRENCY
146700210928              MOVE CURR-PLACEMENT-DATE TO WS-EXCH-PLACEMENT-DATE
146800210928              MOVE CURR-TRANS-NO TO WS-EXCH-TRANS-NO
146900210928              MOVE WS-CURR-TRANS-TRADE-DATE TO WS-EXCH-TRADE-DATE
147000210928              PERFORM GET-EXCHANGE-RATE-2 THRU GER2-EXIT
147100210928              IF WS-EXCH-RATE-VALUE = 0 OR
147200210928                 WS-EXCHANGE-FOUND NOT = "Y"
147300210928                 MOVE "06" TO WS-REJECTION-CODE
147400210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
147500210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
147600210928                 MOVE CURR-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
147700210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
147800210928                 MOVE CURR-TRANS-NO TO WS-MISC-INFO-2-KEY-2
147900210928                 PERFORM LOG-ERROR THRU LER-EXIT
148000210928                 GO TO CCMV-EXIT
148100210928              END-IF
148200210928           END-IF.
148300210928
148400210928       CCMV-0040.
148500210928           IF CURR-INVESTMENT-CODE NOT = WS-CONT-INVESTMENT-CODE
148600210928XXXXXX        IF OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI = 0
148700210928XXXXXX           MOVE 0 TO WS-INV-UNIT-PRICE
148800210928XXXXXX           MOVE 1 TO WS-EXCH-RATE-VALUE
148900210928XXXXXX           GO TO CCMV-0050
149000210928XXXXXX        ELSE
149100210928              PERFORM GET-INVESTMENT-MARKET-VALUE THRU GIMV-EXIT
149200210928              IF WS-PRICE-FOUND NOT = "Y" OR
149300210928                 WS-INV-UNIT-PRICE = 0
149400210928R11622           PERFORM GET-LAST-UNIT-PRICE THRU GLUP-EXIT
149500210928R11622           IF WS-PRICE-FOUND NOT = "Y" OR
149600210928R11622              WS-INV-UNIT-PRICE = 0
149700210928                 MOVE "05" TO WS-REJECTION-CODE
149800210928                 MOVE "PUR.TRANS-P" TO WS-MISC-INFO-2-NAME
149900210928                 MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
150000210928                 MOVE CURR-PLACEMENT-DATE TO WS-MISC-INFO-2-KEY-1
150100210928                 MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
150200210928                 MOVE CURR-TRANS-NO TO WS-MISC-INFO-2-KEY-2
150300210928                 PERFORM LOG-ERROR THRU LER-EXIT
150400210928                 GO TO CCMV-EXIT
150500210928                 END-IF
150600210928              END-IF
150700210928              END-IF
150800210928           END-IF.
150900210928
151000210928      ** Add the units of the trade to opening-unit-balance of investmnt
151100210928      ** to determine the market value prior to the trade.
151200210928
151300210928       CCMV-0050.
151400210928           IF CURR-INVESTMENT-CODE NOT = WS-CONT-INVESTMENT-CODE
151500210928              IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
151600210928                 COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
151700210928                   OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI *
151800210928                   WS-INV-UNIT-PRICE
151900210928              ELSE
152000210928                  COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
152100210928                   OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI *
152200210928                         WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
152300210928              END-IF
152400210928           ELSE
152500210928              IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
152600210928                 COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
152700210928                   OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI *
152800210928                         WS-CURR-TRANS-PRICE
152900210928                 MOVE WS-CURR-TRANS-GROSS TO WS-CURR-TRADE-GROSS-AMT
15300021092817973            MOVE WS-CURR-TRANS-GROSS-GDV
15310021092817973              TO WS-CURR-TRADE-GROSS-AMT-GDV
153200210928              ELSE
153300210928                 COMPUTE WS-INV-BEF-MARKET-VALUE ROUNDED =
153400210928                   OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI *
153500210928                         WS-CURR-TRANS-PRICE / WS-EXCH-RATE-VALUE
153600210928                 COMPUTE WS-CURR-TRADE-GROSS-AMT ROUNDED =
153700210928                         WS-CURR-TRANS-GROSS / WS-EXCH-RATE-VALUE
15380021092817973            COMPUTE WS-CURR-TRADE-GROSS-AMT-GDV ROUNDED =
15390021092817973                    WS-CURR-TRANS-GROSS-GDV / WS-EXCH-RATE-VALUE
154000210928              END-IF
154100210928           END-IF.
154200210928
154300210928       CCMV-0060.
154400210928           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
154500210928              MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
154600210928                   TO WS-INV-BEF-GBV
15470021092817973         MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
15480021092817973              TO WS-INV-BEF-GDV
154900210928              MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
155000210928                   TO WS-INV-BEF-NDV
155100210928           ELSE
155200210928              MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST-SWI
155300210928                   TO WS-INV-BEF-GBV
15540021092817973         MOVE GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST-SWI
15550021092817973              TO WS-INV-BEF-GDV
155600210928              MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST-SWI
155700210928                   TO WS-INV-BEF-NDV
155800210928           END-IF.
155900210928
156000210928           IF CURR-INVESTMENT-CODE = WS-CONT-INVESTMENT-CODE
156100210928              IF REDEMPTION-TRANSACTION
156200210928              ADD WS-CURR-ORIG-UNIT-BAL TO
156300210928                  OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI
156400210928              ELSE
156500210928              SUBTRACT WS-CURR-ORIG-UNIT-BAL FROM
156600210928                  OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI
156700210928              END-IF
156800210928              MOVE WS-CURR-TRANS-PRICE TO WS-INV-UNIT-PRICE
156900210928           END-IF.
157000210928
157100210928           IF OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI < 0
157200210928              MOVE 0 TO OPENING-UNIT-BALANCE
157300210928                     OF ACCOUNT-CONTRACT-INVEST-SWI
157400210928           END-IF.
157500210928
157600210928       CCMV-0070.
157700210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
157800210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
157900210928                  OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI *
158000210928                      WS-INV-UNIT-PRICE
158100210928           ELSE
158200210928              COMPUTE WS-INV-AFT-MARKET-VALUE ROUNDED =
158300210928                  OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI *
158400210928                      WS-INV-UNIT-PRICE / WS-EXCH-RATE-VALUE
158500210928           END-IF.
158600210928
158700210928           ADD WS-INV-BEF-GBV TO WS-CURR-CONTRACT-GBV-BEF.
15880021092817973      ADD WS-INV-BEF-GDV TO WS-CURR-CONTRACT-GDV-BEF.
158900210928           ADD WS-INV-BEF-NDV TO WS-CURR-CONTRACT-NDV-BEF.
159000210928           ADD WS-INV-BEF-MARKET-VALUE TO WS-CONT-INV-MARKET-VALUE.
159100210928           ADD WS-INV-AFT-MARKET-VALUE TO WS-CURR-CONTRACT-MV-AFT.
159200210928
159300210928       CCMV-0080.
159400210928           SET CONTIDX UP BY 1.
159500210928      * RFS49699 - Array logging logic
159600210928
159700210928           IF CONTIDX > WS-ARRAY1-MAX-USED
159800210928               MOVE CONTIDX                TO WS-ARRAY1-MAX-USED
159900210928           END-IF.
160000210928
160100210928      * RFS49699 - End
160101211007      * RFS1117445 - START
160102211007           IF CONTIDX >  ln_InvArraySize
160103211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
160104211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(CONTIDX)
160105211007                      WS-ARRAY-CONTRACT-NO(CONTIDX)
160106211007                      WS-ARRAY-INVESTMENT-CODE(CONTIDX)
160107211007                      WS-ARRAY-INV-CURR-CODE(CONTIDX)
160108211007                      WS-ARRAY-BEFORE-MV(CONTIDX)
160109211007                      WS-ARRAY-BEFORE-GBV(CONTIDX)
160110211007                      WS-ARRAY-BEFORE-GDV(CONTIDX)
160111211007                      WS-ARRAY-BEFORE-NDV(CONTIDX)
160112211007                      WS-ARRAY-AFTER-MV(CONTIDX)
160113211007                      WS-ARRAY-INV-EXCH-RATE(CONTIDX)
160114211007           END-IF
160115211007      *    RFS1117445 End
160116211007
160200210928           MOVE CURR-ACCOUNT-NO TO WS-ARRAY-ACCOUNT-NO(CONTIDX).
160300210928           MOVE WS-CONT-INVESTMENT-CODE
160400210928                TO WS-ARRAY-INVESTMENT-CODE(CONTIDX).
160500210928           MOVE CURR-CONTRACT-NO TO WS-ARRAY-CONTRACT-NO(CONTIDX).
160600210928           MOVE CURRENCY-DDS OF INVESTMENT
160700210928                TO WS-ARRAY-INV-CURR-CODE(CONTIDX).
160800210928           MOVE WS-INV-BEF-MARKET-VALUE TO WS-ARRAY-BEFORE-MV(CONTIDX).
160900210928           MOVE WS-INV-BEF-GBV TO WS-ARRAY-BEFORE-GBV(CONTIDX).
16100021092817973      MOVE WS-INV-BEF-GDV TO WS-ARRAY-BEFORE-GDV(CONTIDX).
161100210928           MOVE WS-INV-BEF-NDV TO WS-ARRAY-BEFORE-NDV(CONTIDX).
161200210928           MOVE WS-INV-AFT-MARKET-VALUE TO WS-ARRAY-AFTER-MV(CONTIDX).
161300210928           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
161400210928              MOVE WS-EXCH-RATE-VALUE TO WS-ARRAY-INV-EXCH-RATE(CONTIDX)
161500210928           ELSE
161600210928              MOVE 1.0 TO WS-ARRAY-INV-EXCH-RATE(CONTIDX)
161700210928           END-IF.
161800210928
161900210928           ADD 1 TO WS-CONT-INV-ARRAY-COUNT.
162000210928
162100210928           GO TO CCMV-0010.
162200210928
162300210928       CCMV-EXIT.
162400210928           EXIT.
162500210928
162600210928      /
162700210928       GET-INVESTMENT-MARKET-VALUE.
162800210928           INITIALIZE MFAINVUPP OF INVESTMENT-UNIT-PRICE.
162900210928
163000210928           MOVE WS-CONT-INVESTMENT-CODE
163100210928                TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE.
163200210928           MOVE WS-CURR-TRANS-TRADE-DATE
163300210928                TO TRADE-DATE OF INVESTMENT-UNIT-PRICE.
163400210928           MOVE " " TO DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE.
163500210928
163600210928           READ INVESTMENT-UNIT-PRICE
163700210928           INVALID KEY
163800210928           GO TO GIMV-0010.
163900210928
164000210928           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
164100210928                TO WS-INV-UNIT-PRICE.
164200210928
164300210928           MOVE "Y" TO WS-PRICE-FOUND.
164400210928
164500210928           GO TO GIMV-EXIT.
164600210928
164700210928       GIMV-0010.
164800210928           MOVE "Y" TO DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE.
164900210928           READ INVESTMENT-UNIT-PRICE
165000210928           INVALID KEY
165100210928           MOVE "N" TO WS-PRICE-FOUND
165200210928           GO TO GIMV-EXIT.
165300210928
165400210928           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
165500210928                TO WS-INV-UNIT-PRICE.
165600210928
165700210928           MOVE "Y" TO WS-PRICE-FOUND.
165800210928
165900210928       GIMV-EXIT.
166000210928           EXIT.
166100210928
166200210928      /
166300210928R11622 GET-LAST-UNIT-PRICE.
166400210928R11622     MOVE "N" TO WS-PRICE-FOUND.
166500210928R11622
166600210928R11622     INITIALIZE MFAINVUPP OF INVESTMENT-LAST-PRICE-REC.
166700210928R11622     MOVE WS-CONT-INVESTMENT-CODE
166800210928R11622       TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-LAST.
166900210928R11622     MOVE WS-CURR-TRANS-TRADE-DATE
167000210928R11622       TO TRADE-DATE OF INVESTMENT-UNIT-PRICE-LAST.
167100210928R11622
167200210928R11622     START INVESTMENT-UNIT-PRICE-LAST
167300210928R11622           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
167400210928R11622           INVALID KEY
167500210928R11622           GO TO GLUP-EXIT.
167600210928R11622
167700210928R11622 GLUP-0010.
167800210928R11622     READ INVESTMENT-UNIT-PRICE-LAST PRIOR RECORD
167900210928R11622          AT END
168000210928R11622          GO TO GLUP-EXIT.
168100210928R11622
168200210928R11622     IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE-LAST NOT =
168300210928R11622        WS-CONT-INVESTMENT-CODE
168400210928R11622        GO TO GLUP-EXIT
168500210928R11622     END-IF.
168600210928R11622
168700210928R11622     IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE-LAST NOT = " "
168800210928R11622        GO TO GLUP-0010
168900210928R11622     END-IF.
169000210928R11622
169100210928R11622     MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE-LAST
169200210928R11622       TO WS-INV-UNIT-PRICE.
169300210928R11622
169400210928R11622     MOVE "Y" TO WS-PRICE-FOUND.
169500210928R11622
169600210928R11622 GLUP-EXIT.
169700210928R11622     EXIT.
169800210928
169900210928      /
170000210928       CALC-NEW-CHANGE-GBV.
170100210928
170200210928           IF WS-REJECTION-CODE NOT = " " AND "00"
170300210928              GO TO CNCG-EXIT
170400210928           END-IF.
170500210928
170600210928      ** Calculate the GBV change
170700210928           IF WS-BUY-CALC-P-FLAG = "Y"
170800210928              MOVE WS-CURR-TRANS-GROSS TO WS-NDV-CHANGE
170900210928                                          WS-GBV-CHANGE
17100021092817973         MOVE WS-CURR-TRANS-GROSS-GDV TO WS-GDV-CHANGE
171100210928              GO TO CNCG-0010
171200210928           END-IF.
171300210928
171400210928159011     IF lc_DistrOptionCode = lc_C
171500210928159011        GO TO CNCG-0010
171600210928159011     END-IF.
171700210928
171800210928           IF WS-CONT-INV-MARKET-VALUE NOT = 0
171900210928      * RFS 107585 Begins
172000210928      *    IF WS-TRANSFER-GBV = "Y"
172100210928      *    COMPUTE WS-GBV-CHANGE ROUNDED = WS-CURR-CONTRACT-GBV-BEF *
172200210928      *            WS-CURR-TRADE-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
17230021092817973 *    COMPUTE WS-GDV-CHANGE ROUNDED = WS-CURR-CONTRACT-GDV-BEF *
17240021092817973 *         WS-CURR-TRADE-GROSS-AMT-GDV / WS-CONT-INV-MARKET-VALUE
172500210928      *    ELSE
172600210928      * NOT TRANSFER GBV BUT NEED TO CHECK IF REDEMPTION TRANS
172700210928      *     IF REDEMPTION-TRANSACTION
172800210928      *      COMPUTE WS-GBV-CHANGE ROUNDED = WS-CURR-CONTRACT-GBV-BEF *
172900210928      *             WS-CURR-TRADE-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
17300021092817973 *      COMPUTE WS-GDV-CHANGE ROUNDED = WS-CURR-CONTRACT-GDV-BEF *
17310021092817973 *          WS-CURR-TRADE-GROSS-AMT-GDV / WS-CONT-INV-MARKET-VALUE
173200210928      *      ELSE
173300210928      *        MOVE WS-CURR-TRADE-GROSS-AMT TO WS-GBV-CHANGE
17340021092817973 *        MOVE WS-CURR-TRADE-GROSS-AMT-GDV TO WS-GDV-CHANGE
173500210928      *      END-IF
173600210928      *    END-IF
173700210928           IF WS-TRANSFER-GBV = "Y"
173800210928             COMPUTE WS-GBV-CHANGE ROUNDED = WS-CURR-CONTRACT-GBV-BEF *
173900210928                   WS-CURR-TRADE-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
174000210928           END-IF
174100210928           IF lc-TransferGDV = "Y"
174200210928             COMPUTE WS-GDV-CHANGE ROUNDED = WS-CURR-CONTRACT-GDV-BEF *
174300210928                WS-CURR-TRADE-GROSS-AMT-GDV / WS-CONT-INV-MARKET-VALUE
174400210928           END-IF
174500210928           IF REDEMPTION-TRANSACTION
174600210928            IF WS-TRANSFER-GBV = "N"
174700210928             COMPUTE WS-GBV-CHANGE ROUNDED = WS-CURR-CONTRACT-GBV-BEF *
174800210928                    WS-CURR-TRADE-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
174900210928            END-IF
175000210928            IF lc-TransferGDV = "N"
175100210928             COMPUTE WS-GDV-CHANGE ROUNDED = WS-CURR-CONTRACT-GDV-BEF *
175200210928                 WS-CURR-TRADE-GROSS-AMT-GDV / WS-CONT-INV-MARKET-VALUE
175300210928            END-IF
175400210928           ELSE
175500210928            IF WS-TRANSFER-GBV = "N"
175600210928               MOVE WS-CURR-TRADE-GROSS-AMT TO WS-GBV-CHANGE
175700210928            END-IF
175800210928            IF lc-TransferGDV = "N"
175900210928               MOVE WS-CURR-TRADE-GROSS-AMT-GDV TO WS-GDV-CHANGE
176000210928            END-IF
176100210928           END-IF
176200210928      * RFS 107585 Ends
176300210928           ELSE
176400210928              MOVE WS-CURR-TRADE-GROSS-AMT TO WS-GBV-CHANGE
17650021092817973         MOVE WS-CURR-TRADE-GROSS-AMT-GDV TO WS-GDV-CHANGE
176600210928           END-IF.
176700210928
176800210928      ** Calculate the GBV change
176900210928           IF WS-CONT-INV-MARKET-VALUE NOT = 0
177000210928            IF WS-TRANSFER-GBV = "Y"
177100210928            COMPUTE WS-NDV-CHANGE ROUNDED = WS-CURR-CONTRACT-NDV-BEF *
177200210928                   WS-CURR-TRADE-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
177300210928           ELSE
177400210928      * NOT TRANSFER GBV BUT NEED TO CHECK IF REDEMPTION TRANS
177500210928            IF REDEMPTION-TRANSACTION
177600210928            COMPUTE WS-NDV-CHANGE ROUNDED = WS-CURR-CONTRACT-NDV-BEF *
177700210928                   WS-CURR-TRADE-GROSS-AMT / WS-CONT-INV-MARKET-VALUE
177800210928             ELSE
177900210928               MOVE WS-CURR-TRADE-GROSS-AMT TO WS-NDV-CHANGE
178000210928             END-IF
178100210928            END-IF
178200210928           ELSE
178300210928                MOVE WS-CURR-TRADE-GROSS-AMT TO WS-NDV-CHANGE
178400210928           END-IF.
178500210928
178600210928       CNCG-0010.
178700210928XXXXX2     IF SWITCH-IN-TRANSACTION OR REDEMPTION-TRANSACTION
178800210928159011     OR lc_DistrOptionCode = lc_C
178900210928              MOVE NDV-CHANGE OF TRANS-CONTRACT-DETAILS
179000210928                TO WS-NDV-CHANGE
179100210928              MOVE GBV-CHANGE OF TRANS-CONTRACT-DETAILS
179200210928                TO WS-GBV-CHANGE
17930021092817973         MOVE GDV-CHANGE OF TRANS-CONTRACT-DETAILS
17940021092817973           TO WS-GDV-CHANGE
179500210928XXXXX2     END-IF.
179600210928
179700210928      ** Calculate the NEW GBV of the contract
179800210928           IF REDEMPTION-TRANSACTION
179900210928159011     OR lc_DistrOptionCode = lc_C
180000210928              ADD WS-GBV-CHANGE TO WS-CURR-CONTRACT-GBV-BEF
180100210928                       GIVING WS-CURR-CONTRACT-GBV-AFT
18020021092817973         ADD WS-GDV-CHANGE TO WS-CURR-CONTRACT-GDV-BEF
18030021092817973                  GIVING WS-CURR-CONTRACT-GDV-AFT
180400210928           ELSE
180500210928              SUBTRACT WS-GBV-CHANGE FROM WS-CURR-CONTRACT-GBV-BEF
180600210928                  GIVING WS-CURR-CONTRACT-GBV-AFT
18070021092817973         SUBTRACT WS-GDV-CHANGE FROM WS-CURR-CONTRACT-GDV-BEF
18080021092817973             GIVING WS-CURR-CONTRACT-GDV-AFT
180900210928      *RFS187205-STARTS
181000210928      *       IF WS-CURR-CONTRACT-GBV-AFT IS NEGATIVE
181100210928              IF (WS-CURR-CONTRACT-GBV-AFT IS NEGATIVE
181200210928                  AND WS-EDIT-NGGUAR-NO )
181300210928      *RFS187205-ENDS
181400210928                 MOVE 0 TO WS-CURR-CONTRACT-GBV-AFT
181500210928              END-IF
181600210928      *RFS187205-STARTS
18170021092817973 *       IF WS-CURR-CONTRACT-GDV-AFT IS NEGATIVE
181800210928              IF (WS-CURR-CONTRACT-GDV-AFT IS NEGATIVE
181900210928                  AND WS-EDIT-NGGUAR-NO )
182000210928      *RFS187205-ENDS
18210021092817973            MOVE 0 TO WS-CURR-CONTRACT-GDV-AFT
182200210928              END-IF
182300210928           END-IF.
182400210928
182500210928      ** Calculate the NEW NDV of the contract
182600210928           IF REDEMPTION-TRANSACTION
182700210928159011     OR lc_DistrOptionCode = lc_C
182800210928              ADD WS-NDV-CHANGE TO WS-CURR-CONTRACT-NDV-BEF
182900210928                       GIVING WS-CURR-CONTRACT-NDV-AFT
183000210928           ELSE
183100210928              SUBTRACT WS-NDV-CHANGE FROM WS-CURR-CONTRACT-NDV-BEF
183200210928                  GIVING WS-CURR-CONTRACT-NDV-AFT
183300210928      *RFS187205-STARTS
183400210928      *       IF WS-CURR-CONTRACT-NDV-AFT IS NEGATIVE
183500210928              IF (WS-CURR-CONTRACT-NDV-AFT IS NEGATIVE
183600210928                  AND WS-EDIT-NGGUAR-NO )
183700210928      *RFS187205-ENDS
183800210928                 MOVE 0 TO WS-CURR-CONTRACT-NDV-AFT
183900210928              END-IF
184000210928           END-IF.
184100210928
184200210928       CNCG-EXIT.
184300210928           EXIT.
184400210928
184500210928      /
184600210928       RECALC-NETDEP-GBV-VALUES.
184700210928
184800210928      *RFS168151 BEGINS
184900210928R12702     INITIALIZE WS-CONT-GBV-AFT-TOTAL
185000210928R12702                WS-CONT-NDV-AFT-TOTAL
18510021092817973                 WS-CONT-GDV-AFT-TOTAL
185200210928                      WS-CONT-INV-COUNT
185300210928                      WS-INV-GBV-PERCENT-TOTAL
18540021092817973                 WS-INV-GDV-PERCENT-TOTAL
185500210928                      WS-INV-NDV-PERCENT-TOTAL.
185600210928      *RFS168151 End
185700210928
185800210928
185900210928           IF WS-REJECTION-CODE NOT = " " AND "00"
186000210928              GO TO RNGV-EXIT
186100210928           END-IF.
186200210928
186300210928      *RFS168151 BEGINS
186400210928R12702*    INITIALIZE WS-CONT-GBV-AFT-TOTAL
186500210928R12702*               WS-CONT-NDV-AFT-TOTAL
18660021092817973 *               WS-CONT-GDV-AFT-TOTAL
186700210928      *               WS-CONT-INV-COUNT
186800210928      *               WS-INV-GBV-PERCENT-TOTAL
18690021092817973 *               WS-INV-GDV-PERCENT-TOTAL
187000210928      *               WS-INV-NDV-PERCENT-TOTAL.
187100210928      *RFS168151 ENDS
187200210928
187300210928           SET CONTIDX TO 1.
187400210928           SET CONTIDX DOWN BY 1.
187500210928
187600210928       RNGV-NEXT.
187700210928           SET CONTIDX UP BY 1.
187701211007
187702211007111744     IF CONTIDX > WS-CONT-INV-ARRAY-COUNT
187703211007111744        GO TO RNGV-EXIT
187704211007111744     END-IF
187705211007
187800210928           IF WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
187900210928              IS EQUAL TO 0 OR
188000210928              WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
188100210928              IS EQUAL TO " " OR
188200210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
188201211007              IS EQUAL TO " " OR
188202211007111744        CONTIDX > WS-CONT-INV-ARRAY-COUNT
188400210928              GO TO RNGV-EXIT
188500210928           END-IF.
188600210928
188700210928       RNGV-PROCESS.
188800210928           INITIALIZE MFAACCCIP OF ACCOUNT-CONTRACT-INVEST-SWI.
188900210928           MOVE WS-ARRAY-ACCOUNT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
189000210928                TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST-SWI.
189100210928           MOVE WS-ARRAY-CONTRACT-NO OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
189200210928                TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST-SWI.
189300210928           MOVE WS-ARRAY-INVESTMENT-CODE
189400210928                OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
189500210928                TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST-SWI.
189600210928
189700210928           READ ACCOUNT-CONTRACT-INVEST-SWI WITH NO LOCK
189800210928           INVALID KEY
189900210928           GO TO RNGV-NEXT.
190000210928
190100210928           ADD 1 TO WS-CONT-INV-COUNT.
190200210928
190300210928RF8092     IF (SWITCH-IN OR TRANSFER-IN)
190400210928RF8092       IF WS-ARRAY-INVESTMENT-CODE(CONTIDX)
190500210928                IS EQUAL TO CURR-INVESTMENT-CODE
190600210928                SUBTRACT WS-GBV-CHANGE FROM
190700210928                WS-ARRAY-BEFORE-GBV(CONTIDX) GIVING WS-INV-GBV-AFT
19080021092817973           SUBTRACT WS-GDV-CHANGE FROM
19090021092817973           WS-ARRAY-BEFORE-GDV(CONTIDX) GIVING WS-INV-GDV-AFT
191000210928                SUBTRACT WS-NDV-CHANGE FROM
191100210928                WS-ARRAY-BEFORE-NDV(CONTIDX) GIVING WS-INV-NDV-AFT
191200210928                GO TO RNGV-0005
191300210928               ELSE
191400210928                GO TO RNGV-NEXT
191500210928             END-IF
191600210928           END-IF.
191700210928
191800210928      * RFS 159011 - Starts
191900210928           IF lc_DistrOptionCode = lc_C
192000210928              IF CURR-INVESTMENT-CODE =
192100210928                 WS-ARRAY-INVESTMENT-CODE
192200210928                    OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
192300210928                 COMPUTE WS-INV-GBV-AFT = WS-GBV-CHANGE +
192400210928                 GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
192500210928                 COMPUTE WS-INV-GDV-AFT = WS-GDV-CHANGE +
192600210928                 GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
192700210928                 COMPUTE WS-INV-NDV-AFT = WS-NDV-CHANGE +
192800210928                 NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
192900210928                 GO TO RNGV-0005
193000210928              ELSE
193100210928                 MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
193200210928                                            TO WS-INV-GBV-AFT
193300210928                 MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
193400210928                                            TO WS-INV-GDV-AFT
193500210928                 MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
193600210928                                            TO WS-INV-NDV-AFT
193700210928                 GO TO RNGV-0005
193800210928              END-IF
193900210928           END-IF
194000210928      * RFS 159011 - Ends
194100210928
194200210928      ** Calculate the NEW Guaranteed Base Value of the investment
194300210928           IF WS-CURR-CONTRACT-MV-AFT NOT = 0
194400210928           COMPUTE WS-INV-GBV-PERCENT ROUNDED =
194500210928                   WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
19460021092817973      COMPUTE WS-INV-GDV-PERCENT ROUNDED =
19470021092817973              WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
194800210928           ELSE
194900210928              MOVE 0 TO WS-INV-GBV-PERCENT
19500021092817973                   WS-INV-GDV-PERCENT
195100210928           END-IF.
195200210928
195300210928           ADD WS-INV-GBV-PERCENT TO WS-INV-GBV-PERCENT-TOTAL.
19540021092817973      ADD WS-INV-GDV-PERCENT TO WS-INV-GDV-PERCENT-TOTAL.
195500210928
195600210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
195700210928              WS-INV-GBV-PERCENT-TOTAL NOT = 1.000 AND
195800210928              WS-INV-GBV-PERCENT-TOTAL NOT = 0
195900210928              SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
196000210928                       GIVING WS-DUMMY-PERCENT
196100210928              ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
196200210928R12454        ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
196300210928XXXXX2     ELSE
196400210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
196500210928                (WS-INV-GBV-PERCENT-TOTAL = 0.999 OR
196600210928                 WS-INV-GBV-PERCENT-TOTAL > 1.000)
196700210928                 SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
196800210928                          GIVING WS-DUMMY-PERCENT
196900210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
197000210928R12454           ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT-TOTAL
197100210928XXXXX2        END-IF
197200210928      *       ADD 0.01 TO WS-INV-GBV-PERCENT
197300210928           END-IF.
197400210928
197500210928           COMPUTE WS-INV-GBV-AFT ROUNDED =
197600210928                   WS-CURR-CONTRACT-GBV-AFT * WS-INV-GBV-PERCENT.
197700210928
19780021092817973 * rfs 17973 - begin
197900210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
198000210928              WS-INV-GDV-PERCENT-TOTAL NOT = 1.000 AND
198100210928              WS-INV-GDV-PERCENT-TOTAL NOT = 0
198200210928              SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
198300210928                       GIVING WS-DUMMY-PERCENT
198400210928              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
198500210928              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
198600210928           ELSE
198700210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
198800210928                (WS-INV-GDV-PERCENT-TOTAL = 0.999 OR
198900210928                 WS-INV-GDV-PERCENT-TOTAL > 1.000)
199000210928                 SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
199100210928                          GIVING WS-DUMMY-PERCENT
199200210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
199300210928                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT-TOTAL
199400210928              END-IF
199500210928           END-IF.
199600210928
199700210928           COMPUTE WS-INV-GDV-AFT ROUNDED =
199800210928                   WS-CURR-CONTRACT-GDV-AFT * WS-INV-GDV-PERCENT.
19990021092817973 * rfs 17973 - end
200000210928
200100210928      ** Calculate the NEW Net Deposit Value of the investment
200200210928           IF WS-CURR-CONTRACT-MV-AFT NOT = 0
200300210928           COMPUTE WS-INV-NDV-PERCENT ROUNDED =
200400210928                   WS-ARRAY-AFTER-MV(CONTIDX) / WS-CURR-CONTRACT-MV-AFT
200500210928           ELSE
200600210928              MOVE 0 TO WS-INV-NDV-PERCENT
200700210928           END-IF.
200800210928
200900210928           ADD WS-INV-NDV-PERCENT TO WS-INV-NDV-PERCENT-TOTAL.
201000210928
201100210928           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
201200210928              WS-INV-NDV-PERCENT-TOTAL NOT = 1.000 AND
201300210928              WS-INV-NDV-PERCENT-TOTAL NOT = 0
201400210928              SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
201500210928                       GIVING WS-DUMMY-PERCENT
201600210928              ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
201700210928R12454        ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT-TOTAL
201800210928XXXXX2     ELSE
201900210928              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
202000210928                (WS-INV-NDV-PERCENT-TOTAL = 0.999 OR
202100210928                 WS-INV-NDV-PERCENT-TOTAL > 1.000)
202200210928                 SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
202300210928                          GIVING WS-DUMMY-PERCENT
202400210928                 ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
202500210928R12454           ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT-TOTAL
202600210928XXXXX2        END-IF
202700210928           END-IF.
202800210928
202900210928           COMPUTE WS-INV-NDV-AFT ROUNDED =
203000210928                   WS-CURR-CONTRACT-NDV-AFT * WS-INV-NDV-PERCENT.
203100210928
203200210928      * If no more units in the contract, move the old GBV's and NDV's
203300210928      * of the contract investment to the new GBV's and NDV's
203400210928           IF WS-CONT-INV-MARKET-VALUE = 0 AND
203500210928              WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
203600210928              IS EQUAL TO CURR-INVESTMENT-CODE
203700210928              AND REDEMPTION-TRANSACTION
203800210928R21458*       MOVE OLD-NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
203900210928R21458        MOVE WS-NDV-CHANGE
204000210928                TO WS-INV-NDV-AFT
204100210928R21458*       MOVE OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
204200210928R21458        MOVE WS-GBV-CHANGE
204300210928                TO WS-INV-GBV-AFT
204400210928R21458*       MOVE OLD-GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI
204500210928R21458        MOVE WS-GDV-CHANGE
20460021092817973           TO WS-INV-GDV-AFT
204700210928R21458*       MOVE OLD-NET-DEPOSIT-VALUE-CUR
204800210928R21458*            OF ACCOUNT-CONTRACT-INVEST-SWI
204900210928R21458        MOVE WS-NDV-CHANGE
205000210928                TO WS-INV-NDV-AFT-CUR
205100210928R21458*       MOVE OLD-GUAR-BASE-VALUE-CUR
205200210928R21458*            OF ACCOUNT-CONTRACT-INVEST-SWI
205300210928R21458        MOVE WS-GBV-CHANGE
205400210928                TO WS-INV-GBV-AFT-CUR
205500210928R21458*       MOVE OLD-GUAR-DEATH-VALUE-CUR
205600210928R21458*            OF ACCOUNT-CONTRACT-INVEST-SWI
205700210928R21458        MOVE WS-GDV-CHANGE
20580021092817973           TO WS-INV-GDV-AFT-CUR
205900210928              GO TO RNGV-0010
206000210928           END-IF.
206100210928
206200210928       RNGV-0005.
206300210928           IF SWITCH-IN
206400210928              GO TO RNGV-0006
206500210928           END-IF.
206600210928
206700210928      *RFS187205-STARTS
206800210928      *    IF WS-INV-GBV-AFT IS NEGATIVE OR
206900210928      *       CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-SWI = 0
207000210928           IF ((WS-INV-GBV-AFT IS NEGATIVE
207100210928              AND WS-EDIT-NGGUAR-NO ) OR
207200210928              CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-SWI = 0 )
207300210928      *RFS187205-ENDS
207400210928              MOVE 0 TO WS-INV-GBV-AFT
207500210928           END-IF.
207600210928
207700210928      *RFS187205-STARTS
20780021092817973 *    IF WS-INV-GDV-AFT IS NEGATIVE OR
20790021092817973 *       CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-SWI = 0
208000210928           IF ((WS-INV-GDV-AFT IS NEGATIVE
208100210928              AND WS-EDIT-NGGUAR-NO ) OR
208200210928              CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-SWI = 0 )
208300210928      *RFS187205-ENDS
20840021092817973         MOVE 0 TO WS-INV-GDV-AFT
20850021092817973      END-IF.
208600210928
208700210928      *RFS187205-STARTS
208800210928      *    IF WS-INV-NDV-AFT IS NEGATIVE OR
208900210928      *       CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-SWI = 0
209000210928           IF ((WS-INV-NDV-AFT IS NEGATIVE
209100210928              AND WS-EDIT-NGGUAR-NO ) OR
209200210928              CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST-SWI = 0 )
209300210928      *RFS187205-ENDS
209400210928              MOVE 0 TO WS-INV-NDV-AFT
209500210928           END-IF.
209600210928
209700210928       RNGV-0006.
209800210928           IF WS-ARRAY-INV-CURR-CODE(CONTIDX) = UNITRAX-BASE-CURRENCY
209900210928              MOVE WS-INV-GBV-AFT TO WS-INV-GBV-AFT-CUR
21000021092817973         MOVE WS-INV-GDV-AFT TO WS-INV-GDV-AFT-CUR
210100210928              MOVE WS-INV-NDV-AFT TO WS-INV-NDV-AFT-CUR
210200210928           ELSE
210300210928              COMPUTE WS-INV-GBV-AFT-CUR ROUNDED =
210400210928                      WS-INV-GBV-AFT / WS-ARRAY-INV-EXCH-RATE(CONTIDX)
21050021092817973         COMPUTE WS-INV-GDV-AFT-CUR ROUNDED =
21060021092817973                 WS-INV-GDV-AFT / WS-ARRAY-INV-EXCH-RATE(CONTIDX)
210700210928              COMPUTE WS-INV-NDV-AFT-CUR ROUNDED =
210800210928                      WS-INV-NDV-AFT / WS-ARRAY-INV-EXCH-RATE(CONTIDX)
210900210928           END-IF.
211000210928
211100210928       RNGV-0010.
211200210928185171     IF EXCLUDE-TRANS-FLAG = "Y" AND EXCLUSION-RULE = '01'
21130021092826151         GO TO RNGV-0020
21140021092826151      END-IF.
211500210928
211600210928           MOVE WS-INV-GBV-AFT
211700210928                TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI.
21180021092817973      MOVE WS-INV-GDV-AFT
21190021092817973           TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI.
212000210928           MOVE WS-INV-NDV-AFT
212100210928                TO NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVEST-SWI.
212200210928           MOVE WS-INV-GBV-AFT-CUR
212300210928                TO GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST-SWI.
21240021092817973      MOVE WS-INV-GDV-AFT-CUR
21250021092817973           TO GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST-SWI.
212600210928           MOVE WS-INV-NDV-AFT-CUR
212700210928                TO NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST-SWI.
212800210928
21290021092826151  RNGV-0020.
213000210928      ** Update the SEL, TRO or SWO transaction
213100210928      ** in Trans-Contract-Details and also the units-used of
213200210928      ** previous purchase transactions
213300210928           IF WS-ARRAY-INVESTMENT-CODE OF WS-ACC-CONT-INV-ARRAY(CONTIDX)
213400210928              IS EQUAL TO CURR-INVESTMENT-CODE
213500210928              IF REDUCTION-TRANSACTION
213600210928                 PERFORM UPD-UNITS-USED-PREV-BUYS THRU UUUPB-EXIT
213700210928                 IF WS-REJECTION-CODE NOT = " "
213800210928                    GO TO RNGV-EXIT
213900210928                 ELSE
214000210928                    ADD WS-CURR-ORIG-UNIT-BAL TO
214100210928                     OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI
214200210928                 END-IF
214300210928              ELSE
214400210928                 SUBTRACT WS-CURR-ORIG-UNIT-BAL FROM
214500210928                     OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST-SWI
214600210928              END-IF
214700210928           END-IF.
214800210928
214900210928R12702     IF REDEMPTION-TRANSACTION
215000210928159011     OR lc_DistrOptionCode = lc_C
215100210928R12702        ADD WS-INV-GBV-AFT TO WS-CONT-GBV-AFT-TOTAL
21520021092817973         ADD WS-INV-GDV-AFT TO WS-CONT-GDV-AFT-TOTAL
215300210928R12702        ADD WS-INV-NDV-AFT TO WS-CONT-NDV-AFT-TOTAL
215400210928R12702     END-IF.
215500210928
215600210928           REWRITE ACC-CON-INV-SWI-REC.
215700210928
215800210928RF8092     IF WS-TRANSFER-GBV = "N" AND
215900210928107585        lc-TransferGDV  = "N" AND
216000210928RF8092        (SWITCH-IN OR TRANSFER-IN)
216100210928RF8092        GO TO RNGV-EXIT.
216200210928
216300210928           GO TO RNGV-NEXT.
216400210928
216500210928       RNGV-EXIT.
216600210928           EXIT.
216700210928
216800210928      /
216900210928R12702 CHECK-NDV-GBV-ROUNDING.
217000210928
217100210928           IF PURCHASE-TRANSACTION
217200210928185171      OR (EXCLUDE-TRANS-FLAG = "Y" AND EXCLUSION-RULE = '01')
217300210928              GO TO CNGR-EXIT
217400210928           END-IF.
217500210928
217600210928           MOVE "N" TO WS-NDV-DIFF-FLAG
217700210928                       WS-GDV-DIFF-FLAG
217800210928                       WS-GBV-DIFF-FLAG.
217900210928           MOVE 0   TO WS-NDV-DIFF-AMOUNT
218000210928                       WS-GDV-DIFF-AMOUNT
218100210928                       WS-GBV-DIFF-AMOUNT.
218200210928           MOVE "Y" TO WS-NDV-UPDATE-FLAG
218300210928                       WS-GDV-UPDATE-FLAG
218400210928                       WS-GBV-UPDATE-FLAG.
218500210928
218600210928           IF WS-CURR-CONTRACT-NDV-AFT NOT = WS-CONT-NDV-AFT-TOTAL
218700210928              MOVE "Y" TO WS-NDV-DIFF-FLAG
218800210928              SUBTRACT WS-CONT-NDV-AFT-TOTAL
218900210928                  FROM WS-CURR-CONTRACT-NDV-AFT
219000210928                GIVING WS-NDV-DIFF-AMOUNT
219100210928           END-IF.
219200210928
219300210928           IF WS-CURR-CONTRACT-GBV-AFT NOT = WS-CONT-GBV-AFT-TOTAL
219400210928              MOVE "Y" TO WS-GBV-DIFF-FLAG
219500210928              SUBTRACT WS-CONT-GBV-AFT-TOTAL
219600210928                  FROM WS-CURR-CONTRACT-GBV-AFT
219700210928                GIVING WS-GBV-DIFF-AMOUNT
219800210928           END-IF.
219900210928
22000021092817973      IF WS-CURR-CONTRACT-GDV-AFT NOT = WS-CONT-GDV-AFT-TOTAL
22010021092817973         MOVE "Y" TO WS-GDV-DIFF-FLAG
22020021092817973         SUBTRACT WS-CONT-GDV-AFT-TOTAL
22030021092817973             FROM WS-CURR-CONTRACT-GDV-AFT
22040021092817973           GIVING WS-GDV-DIFF-AMOUNT
22050021092817973      END-IF.
220600210928
220700210928           IF NDV-DIFFERENCE-FOUND OR GBV-DIFFERENCE-FOUND
22080021092817973         OR GDV-DIFFERENCE-FOUND
220900210928              GO TO CNGR-0010
221000210928           END-IF.
221100210928
221200210928           GO TO CNGR-EXIT.
221300210928
221400210928       CNGR-0010.
221500210928           INITIALIZE MFAACCCIP OF ACCOUNT-CONTRACT-INVEST.
221600210928           MOVE CURR-ACCOUNT-NO
221700210928             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST.
221800210928           MOVE CURR-CONTRACT-NO
221900210928             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST.
222000210928           MOVE SPACES TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVEST.
222100210928
222200210928           START ACCOUNT-CONTRACT-INVEST
222300210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
222400210928                 INVALID KEY
222500210928                 GO TO CNGR-EXIT.
222600210928
222700210928       CNGR-0020.
222800210928           READ ACCOUNT-CONTRACT-INVEST NEXT RECORD
222900210928                AT END
223000210928                GO TO CNGR-EXIT.
223100210928
223200210928           IF CURR-ACCOUNT-NO NOT =
223300210928              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVEST OR
223400210928              CURR-CONTRACT-NO NOT =
223500210928              CONTRACT-NO OF ACCOUNT-CONTRACT-INVEST
223600210928              GO TO CNGR-EXIT
223700210928           END-IF.
223800210928
223900210928           IF OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVEST = 0 OR
224000210928              CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVEST = 0
224100210928              GO TO CNGR-0020
224200210928           END-IF.
224300210928
224400210928           IF NDV-DIFFERENCE-FOUND AND
22450021092854603 *       NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVEST = 0
22460021092854603         NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVEST <= 0
224700210928              GO TO CNGR-0020
224800210928           END-IF.
224900210928
225000210928           IF NDV-DIFFERENCE-FOUND AND NDV-NOT-UPDATED
225100210928              ADD WS-NDV-DIFF-AMOUNT
225200210928                  TO NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVEST
225300210928                     NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST
225400210928              MOVE "N" TO WS-NDV-UPDATE-FLAG
225500210928              REWRITE ACCT-CONT-INVEST-REC
225600210928                      INVALID KEY
225700210928                      MOVE "Y" TO WS-NDV-UPDATE-FLAG
225800210928              END-REWRITE
225900210928           END-IF.
226000210928
226100210928           IF GBV-DIFFERENCE-FOUND AND
22620021092854603 *       GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST = 0
22630021092854603         GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST <= 0
226400210928              GO TO CNGR-0020
226500210928           END-IF.
226600210928
226700210928           IF GBV-DIFFERENCE-FOUND AND GBV-NOT-UPDATED
226800210928              ADD WS-GBV-DIFF-AMOUNT
226900210928                  TO GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVEST
227000210928                     GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST
227100210928              MOVE "N" TO WS-GBV-UPDATE-FLAG
227200210928              REWRITE ACCT-CONT-INVEST-REC
227300210928                      INVALID KEY
227400210928                      MOVE "Y" TO WS-GBV-UPDATE-FLAG
227500210928              END-REWRITE
227600210928           END-IF.
227700210928
22780021092817973 * rfs 17973 - begin
227900210928           IF GDV-DIFFERENCE-FOUND AND
22800021092854603 *       GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST = 0
22810021092854603         GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST <= 0
228200210928              GO TO CNGR-0020
228300210928           END-IF.
228400210928
228500210928           IF GDV-DIFFERENCE-FOUND AND GDV-NOT-UPDATED
228600210928              ADD WS-GDV-DIFF-AMOUNT
228700210928                  TO GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVEST
228800210928                     GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVEST
228900210928              MOVE "N" TO WS-GDV-UPDATE-FLAG
229000210928              REWRITE ACCT-CONT-INVEST-REC
229100210928                      INVALID KEY
229200210928                      MOVE "Y" TO WS-GDV-UPDATE-FLAG
229300210928              END-REWRITE
229400210928           END-IF.
22950021092817973 * rfs 17973 - end
229600210928
229700210928           IF (NDV-DIFFERENCE-FOUND AND NDV-NOT-UPDATED) OR
229800210928              (GBV-DIFFERENCE-FOUND AND GBV-NOT-UPDATED)
22990021092817973          OR (GDV-DIFFERENCE-FOUND AND GDV-NOT-UPDATED)
230000210928               GO TO CNGR-0020
230100210928           END-IF.
230200210928
230300210928       CNGR-EXIT.
230400210928R12702     EXIT.
230500210928
230600210928      /
230700210928       UPD-UNITS-USED-PREV-BUYS.
230800210928
230900210928           IF WS-REJECTION-CODE NOT = SPACES AND "00"
231000210928              GO TO UUUPB-EXIT
231100210928           END-IF.
231200210928
231300210928           INITIALIZE MFATRNP OF TRANS-R-REC
231400210928                                 WS-AVAILABLE-UNITS
231500210928                                 WS-UNITS-USED
231600210928                                 WS-PUR-TRANS-AMT
231700210928                                 WS-PUR-TRANS-AMT-CUR.
231800210928           MOVE CURR-ACCOUNT-NO TO ACCOUNT-NO OF TRANS-R.
231900210928           MOVE CURR-INVESTMENT-CODE TO INVESTMENT-CODE OF TRANS-R.
232000210928           MOVE 999999999 TO PROCESS-DATE OF TRANS-R.
232100210928           MOVE 9999      TO TRANS-PROC-SEQ-NO OF TRANS-R.
232200210928           MOVE ZEROS TO TRADE-DATE OF TRANS-R
232300210928                         PLACEMENT-DATE OF TRANS-R
232400210928                         TRANS-NO OF TRANS-R.
232500210928
232600210928           START TRANS-R
232700210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
232800210928           INVALID KEY
232900210928           GO TO UUUPB-0090.
233000210928
233100210928       UUUPB-0010.
233200210928           READ TRANS-R NEXT RECORD
233300210928           AT END
233400210928           GO TO UUUPB-0090.
233500210928
233600210928           IF WS-REQUIRED-UNITSP = 0
233700210928              GO TO UUUPB-0090
233800210928           END-IF.
233900210928
234000210928           IF ACCOUNT-NO OF TRANS-R NOT = CURR-ACCOUNT-NO
234100210928              GO TO UUUPB-0090
234200210928           END-IF.
234300210928
234400210928           IF INVESTMENT-CODE OF TRANS-R NOT = CURR-INVESTMENT-CODE
234500210928              GO TO UUUPB-0090
234600210928           END-IF.
234700210928
234800210928       UUUPB-0020.
234900210928
235000210928           MOVE TRANS-TYPE-CODE OF TRANS-R TO TRANS-CATEGORY-R.
235100210928           MOVE TRANS-STATUS-CODE OF TRANS-R TO TRANS-STATUS-CATEGORY-R.
235200210928           MOVE REVERSE OF TRANS-R TO TRANS-REVERSE-CATEGORY-R.
235300210928
235400210928           IF TRANS-REVERSED-R
235500210928              GO TO UUUPB-0010
235600210928           END-IF.
235700210928
235800210928           IF NOT HISTORY-R
235900210928              GO TO UUUPB-0010
236000210928           END-IF.
236100210928
236200210928           IF NOT VALID-TRANSACTION-R
236300210928              GO TO UUUPB-0010
236400210928           END-IF.
236500210928
236600210928      * RFS 20516 - Start
236700210928           IF WS-PRE-1999 = "Y"
236800210928              MOVE ZEROS TO WS-REQUIRED-UNITSP
236900210928              GO TO UUUPB-0010
237000210928           END-IF.
237100210928      * RFS 20516 - End
237200210928
237300210928       UUUPB-0030.
237400210928           MOVE PLACEMENT-DATE OF TRANS-R
237500210928                TO PLACEMENT-DATE OF TRANS-CON-DTL-PURCHASE.
237600210928           MOVE TRANS-NO OF TRANS-R
237700210928                TO TRANS-NO OF TRANS-CON-DTL-PURCHASE.
237800210928           MOVE CURR-CONTRACT-NO
237900210928                TO CONTRACT-NO OF TRANS-CON-DTL-PURCHASE.
238000210928
238100210928           READ TRANS-CON-DTL-PURCHASE WITH NO LOCK
238200210928           INVALID KEY
238300210928           GO TO UUUPB-0010.
238400210928
238500210928           IF REVERSED-DDS OF TRANS-CON-DTL-PURCHASE = "Y"
238600210928              GO TO UUUPB-0010
238700210928           END-IF.
238800210928
238900210928           SUBTRACT UNITS-USED OF TRANS-CON-DTL-PURCHASE
239000210928                    FROM ORIG-UNIT-BAL OF TRANS-CON-DTL-PURCHASE
239100210928                    GIVING WS-AVAILABLE-UNITS.
239200210928
239300210928       UUUPB-0040.
239400210928           IF NOT PURCHASE-TRANSACTION-R
239500210928              MOVE AVERAGE-UNIT-COST OF TRANS-CON-DTL-PURCHASE
239600210928                   TO WS-AVERAGE-UNIT-COST
239700210928              MOVE AVERAGE-EXCHANGE-RATE OF TRANS-CON-DTL-PURCHASE
239800210928                   TO WS-AVERAGE-EXCHANGE-RATE
239900210928           ELSE
240000210928              MOVE 0 TO WS-AVERAGE-UNIT-COST
240100210928                        WS-AVERAGE-EXCHANGE-RATE
240200210928           END-IF
240300210928
240400210928           IF WS-CONT-INV-MARKET-VALUE IS EQUAL TO 0 AND
240500210928              WS-CALC-METHOD NOT = "P"
240600210928           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
240700210928              MOVE CURRENCY-DDS OF INVESTMENT
240800210928                              TO WS-EXCH-CURRENCY
240900210928              MOVE PLACEMENT-DATE OF TRANS-R
241000210928                              TO WS-EXCH-PLACEMENT-DATE
241100210928              MOVE TRANS-NO   OF TRANS-R
241200210928                              TO WS-EXCH-TRANS-NO
241300210928              MOVE TRADE-DATE OF TRANS-R
241400210928                              TO WS-EXCH-TRADE-DATE
241500210928              PERFORM GET-EXCHANGE-RATE
241600210928                              THRU GER-EXIT
241700210928           ELSE
241800210928              MOVE "Y"        TO WS-EXCHANGE-FOUND
241900210928              MOVE 1.0        TO WS-EXCH-RATE
242000210928           END-IF
242100210928
242200210928           IF WS-EXCHANGE-FOUND NOT = "Y" OR
242300210928              WS-EXCH-RATE          = ZEROS
242400210928              MOVE "06"       TO WS-REJECTION-CODE
242500210928              MOVE "PUR.TRANS-"
242600210928                              TO WS-MISC-INFO-2-NAME
242700210928              MOVE "PLADT:"   TO WS-MISC-INFO-2-NKEY-1
242800210928              MOVE PLACEMENT-DATE OF TRANS-R
242900210928                             TO WS-MISC-INFO-2-KEY-1
243000210928              MOVE "TRNNO:"   TO WS-MISC-INFO-2-NKEY-2
243100210928              MOVE TRANS-NO   OF TRANS-R
243200210928                              TO WS-MISC-INFO-2-KEY-2
243300210928              PERFORM LOG-ERROR THRU LER-EXIT
243400210928              GO TO UUUPB-0090
243500210928           END-IF
243600210928           END-IF.
243700210928
243800210928       UUUPB-0050.
243900210928           MOVE "N" TO WS-UPDATE-FILE.
244000210928           IF WS-REQUIRED-UNITSP NOT = 0
244100210928              MOVE "Y" TO WS-UPDATE-FILE
244200210928           END-IF.
244300210928
244400210928RF9332     IF WS-AVAILABLE-UNITS >= 0 AND WS-REQUIRED-UNITSP NOT = 0
244500210928              IF UNITS-USED OF TRANS-CON-DTL-PURCHASE >=
244600210928                 WS-REQUIRED-UNITSP
244700210928                 MOVE WS-REQUIRED-UNITSP TO WS-UNITS-USED
244800210928                 MOVE 0 TO WS-REQUIRED-UNITSP
244900210928              ELSE
245000210928                 MOVE UNITS-USED OF TRANS-CON-DTL-PURCHASE
245100210928                     TO WS-UNITS-USED
245200210928RF9332           SUBTRACT UNITS-USED OF TRANS-CON-DTL-PURCHASE
245300210928RF9332               FROM WS-REQUIRED-UNITSP
245400210928              END-IF
245500210928           ELSE
245600210928              MOVE ORIG-UNIT-BAL OF TRANS-CON-DTL-PURCHASE
245700210928                   TO WS-UNITS-USED
245800210928RF9332     END-IF.
245900210928
246000210928       UUUPB-0060.
246100210928           IF WS-CONT-INV-MARKET-VALUE IS EQUAL TO 0 AND
246200210928              WS-CALC-METHOD NOT = "P"
246300210928              IF WS-AVERAGE-EXCHANGE-RATE NOT = 0 AND
246400210928                 WS-AVERAGE-EXCHANGE-RATE NOT = 1
246500210928                 MOVE WS-AVERAGE-EXCHANGE-RATE TO WS-PUR-TRANS-EXCH-RATE
246600210928              ELSE
246700210928                 MOVE WS-EXCH-RATE TO WS-PUR-TRANS-EXCH-RATE
246800210928              END-IF
246900210928
247000210928              COMPUTE WS-PUR-TRANS-AMT-CUR ROUNDED =
247100210928                   WS-UNITS-USED * UNIT-PRICE OF TRANS-R
247200210928
247300210928              IF WS-AVERAGE-UNIT-COST NOT = 0
247400210928                 COMPUTE WS-PUR-TRANS-AMT-CUR ROUNDED =
247500210928                   WS-UNITS-USED * WS-AVERAGE-UNIT-COST
247600210928              END-IF
247700210928
247800210928              IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
247900210928                 MOVE WS-PUR-TRANS-AMT-CUR TO WS-PUR-TRANS-AMT
248000210928              ELSE
248100210928                 IF WS-AVERAGE-UNIT-COST NOT = 0
248200210928                    COMPUTE WS-PUR-TRANS-AMT ROUNDED =
248300210928                       WS-UNITS-USED * WS-AVERAGE-UNIT-COST /
248400210928                       WS-PUR-TRANS-EXCH-RATE
248500210928                 ELSE
248600210928                    COMPUTE WS-PUR-TRANS-AMT ROUNDED =
248700210928                       WS-UNITS-USED * UNIT-PRICE OF TRANS-R /
248800210928                       WS-PUR-TRANS-EXCH-RATE
248900210928                 END-IF
249000210928              END-IF
249100210928
249200210928              ADD WS-PUR-TRANS-AMT-CUR TO WS-NEW-NET-DEP-VAL-CUR
249300210928              ADD WS-PUR-TRANS-AMT     TO WS-NEW-NET-DEP-VALUE
249400210928
249500210928              IF PRIOR-RESET-EXISTS
249600210928                 COMPUTE WS-PUR-TRANS-AMT-CUR ROUNDED =
249700210928                         WS-UNITS-USED * PRIOR-RESET-UNIT-PRICE
249800210928
249900210928                 IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
250000210928                    MOVE WS-PUR-TRANS-AMT-CUR TO WS-PUR-TRANS-AMT
250100210928                 ELSE
250200210928                    COMPUTE WS-PUR-TRANS-AMT ROUNDED =
250300210928                            WS-UNITS-USED * PRIOR-RESET-UNIT-PRICE /
250400210928                            PRIOR-RESET-EXCH-RATE
250500210928                 END-IF
250600210928              END-IF
250700210928              ADD WS-PUR-TRANS-AMT-CUR TO WS-NEW-GUAR-BASE-VAL-CUR
250800210928              ADD WS-PUR-TRANS-AMT     TO WS-NEW-GUAR-BASE-VALUE
250900210928           END-IF.
251000210928
251100210928       UUUPB-0070.
251200210928           IF WS-UPDATE-FILE IS EQUAL TO "Y"
251300210928              SUBTRACT WS-UNITS-USED FROM
251400210928                       UNITS-USED OF TRANS-CON-DTL-PURCHASE
251500210928           END-IF.
251600210928           MOVE 0 TO WS-UNITS-USED.
251700210928           REWRITE TRANS-CON-DTL-PUR-REC.
251800210928
251900210928           GO TO UUUPB-0010.
252000210928
252100210928       UUUPB-0090.
252200210928      *    IF WS-REQUIRED-UNITSP NOT = ZEROS
252300210928      *       MOVE "11" TO WS-REJECTION-CODE
252400210928      *       MOVE "REQUIRED-UNITS" TO WS-MISC-INFO-1-NAME
252500210928      *       MOVE WS-REQUIRED-UNITSP
252600210928      *                       TO WS-MISC-INFO-1-UNIT
252700210928      *       PERFORM LOG-ERROR THRU LER-EXIT
252800210928      *    END-IF.
252900210928
253000210928       UUUPB-EXIT.
253100210928           EXIT.
253200210928
253300210928      /
253400210928RF9332 GET-CALC-METHOD.
253500210928
253600210928RF9332     INITIALIZE MFAINVSGP OF INVESTMENT-SEG.
253700210928RF9332     MOVE CURR-INVESTMENT-CODE
253800210928RF9332          TO INVESTMENT-CODE OF INVESTMENT-SEG.
253900210928RF9332
254000210928RF9332     READ INVESTMENT-SEG
254100210928RF9332     INVALID KEY
254200210928RF9332     MOVE "S" TO WS-CALC-METHOD
254300210928RF9332     GO TO GCM-EXIT.
254400210928RF9332
254500210928RF9332     MOVE CALC-METHOD OF INVESTMENT-SEG-REC TO WS-CALC-METHOD.
25460021092817973 *57388  MOVE "N" TO WS-CALC-GDV.
25470021092817973 *57388  IF GDV-SCHED-CODE OF INVESTMENT-SEG-REC NOT = SPACES
25480021092817973 *57388     MOVE "Y" TO WS-CALC-GDV
25490021092817973 *57388  END-IF.
255000210928
255100210928      * RFS 20516 - Start
255200210928           MOVE CURR-ACCOUNT-NO
255300210928                TO ACCOUNT-NO OF ACCOUNT-ATTRIBUTES.
255400210928           MOVE "PRE99"
255500210928                TO ACCOUNT-ATTRIBUTE-CODE OF ACCOUNT-ATTRIBUTES.
255600210928           READ ACCOUNT-ATTRIBUTES
255700210928                INVALID KEY
255800210928                    MOVE "N" TO WS-USE-DIRECT
255900210928                NOT INVALID KEY
256000210928                    MOVE "Y" TO WS-PRE-1999
256100210928                    MOVE "Y" TO WS-USE-DIRECT.
256200210928
256300210928           IF WS-USE-DIRECT = "Y"
256400210928              MOVE "S" TO WS-CALC-METHOD
256500210928           END-IF.
256600210928      * RFS 20516 - End
256700210928RF9332
256800210928RF9332 GCM-EXIT.
256900210928RF9332     EXIT.
257000210928
257100210928      /
257200210928       LEVEL-REINIT-1.
257300210928           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
257400210928             MOVE CURRENCY-DDS OF INVESTMENT
257500210928                             TO WS-EXCH-CURRENCY
257600210928             MOVE CURR-PLACEMENT-DATE
257700210928                             TO WS-EXCH-PLACEMENT-DATE
257800210928             MOVE CURR-TRANS-NO
257900210928                             TO WS-EXCH-TRANS-NO
258000210928             MOVE WS-CURR-TRANS-TRADE-DATE
258100210928                             TO WS-EXCH-TRADE-DATE
258200210928
258300210928             PERFORM GET-EXCHANGE-RATE
258400210928                             THRU GER-EXIT
258500210928           ELSE
258600210928             MOVE "Y"        TO WS-EXCHANGE-FOUND
258700210928             MOVE 1.0        TO WS-EXCH-RATE
258800210928           END-IF.
258900210928
259000210928           IF WS-EXCHANGE-FOUND NOT = "Y" OR
259100210928              WS-EXCH-RATE          = ZEROS
259200210928             MOVE "06"       TO WS-REJECTION-CODE
259300210928             PERFORM LOG-ERROR THRU LER-EXIT
259400210928             GO TO LR1-EXIT
259500210928           END-IF.
259600210928
259700210928           MOVE WS-EXCH-RATE TO WS-CURR-TRANS-EXCH-RATE.
259800210928
259900210928       LR1-EXIT.
260000210928           EXIT.
260100210928
260200210928      /
260300210928       GET-EXCHANGE-RATE.
260400210928
260500210928           MOVE "N"          TO WS-EXCHANGE-FOUND.
260600210928
260700210928           MOVE WS-EXCH-PLACEMENT-DATE
260800210928                             TO PLACEMENT-DATE
260900210928                             OF TRANS-EXCHANGE-RATE.
261000210928           MOVE WS-EXCH-TRANS-NO
261100210928                             TO TRANS-NO
261200210928                             OF TRANS-EXCHANGE-RATE.
261300210928
261400210928           READ TRANS-EXCHANGE-RATE
261500210928           INVALID KEY
261600210928           GO TO GER-0010.
261700210928
261800210928           IF CURRENCY-DDS OF TRANS-EXCHANGE-RATE NOT =
261900210928              WS-EXCH-CURRENCY
262000210928             GO TO GER-0010
262100210928           END-IF.
262200210928
262300210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
262400210928           MOVE EXCHANGE-RATE OF TRANS-EXCHANGE-RATE
262500210928                             TO WS-EXCH-RATE.
262600210928           GO TO GER-EXIT.
262700210928
262800210928       GER-0010.
262900210928
263000210928           MOVE WS-EXCH-TRADE-DATE
263100210928                             TO TRADE-DATE OF EXCHANGE-RATE-M.
263200210928           MOVE WS-EXCH-CURRENCY
263300210928                             TO CURRENCY-DDS OF EXCHANGE-RATE-M.
263400210928           MOVE PROG-EXCHANGE-RATE-TYPE
263500210928                             TO EXCHANGE-RATE-TYPE
263600210928                             OF EXCHANGE-RATE-M.
263700210928
263800210928           READ EXCHANGE-RATE-M
263900210928           INVALID KEY
264000210928             GO TO GER-EXIT.
264100210928
264200210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
264300210928           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M
264400210928                             TO WS-EXCH-RATE.
264500210928
264600210928       GER-EXIT.
264700210928           EXIT.
264800210928
264900210928      /
265000210928       GET-EXCHANGE-RATE-2.
265100210928
265200210928           IF WS-DIFF-INVESTMENT-FLAG = "Y"
265300210928              GO TO GER2-0010.
265400210928
265500210928           INITIALIZE MFATREXRP OF TRANS-EXCHANGE-RATE-2-REC.
265600210928           MOVE WS-EXCH-PLACEMENT-DATE
265700210928                             TO PLACEMENT-DATE
265800210928                             OF TRANS-EXCHANGE-RATE-2.
265900210928           MOVE WS-EXCH-TRANS-NO
266000210928                             TO TRANS-NO
266100210928                             OF TRANS-EXCHANGE-RATE-2.
266200210928
266300210928           READ TRANS-EXCHANGE-RATE-2
266400210928           INVALID KEY
266500210928           GO TO GER2-0010.
266600210928
266700210928           IF CURRENCY-DDS OF TRANS-EXCHANGE-RATE-2 NOT =
266800210928              WS-EXCH-CURRENCY
266900210928             GO TO GER2-0010
267000210928           END-IF.
267100210928
267200210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
267300210928           MOVE EXCHANGE-RATE OF TRANS-EXCHANGE-RATE-2
267400210928                             TO WS-EXCH-RATE-VALUE.
267500210928           GO TO GER2-EXIT.
267600210928
267700210928       GER2-0010.
267800210928
267900210928           INITIALIZE MFAEXRHMP OF EXCHANGE-RATE-M-2.
268000210928           MOVE WS-EXCH-TRADE-DATE
268100210928                             TO TRADE-DATE OF EXCHANGE-RATE-M-2.
268200210928           MOVE WS-EXCH-CURRENCY
268300210928                             TO CURRENCY-DDS OF EXCHANGE-RATE-M-2.
268400210928           MOVE PROG-EXCHANGE-RATE-TYPE
268500210928                             TO EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M-2.
268600210928
268700210928           READ EXCHANGE-RATE-M-2
268800210928           INVALID KEY
268900210928             GO TO GER2-EXIT.
269000210928
269100210928           MOVE "Y"          TO WS-EXCHANGE-FOUND.
269200210928           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M-2
269300210928                             TO WS-EXCH-RATE-VALUE.
269400210928
269500210928       GER2-EXIT.
269600210928           EXIT.
269700210928
269800210928      /
269900210928       LEVEL-SUMMARY-1.
270000210928
270100210928       LS1-EXIT.
270200210928           EXIT.
270300210928
270400210928      /
270500210928       LEVEL-REINIT-2.
270600210928
270700210928           PERFORM GET-CALC-METHOD THRU GCM-EXIT.
270800210928           INITIALIZE           PRIOR-RESET-AREA
270900210928
271000210928           MOVE SPACES       TO WS-REJECTION-CODE.
271100210928
271200210928           MOVE ZEROS        TO WS-OLD-NET-DEP-VALUE
271300210928                                WS-OLD-GUAR-BASE-VALUE
27140021092817973                           WS-OLD-GUAR-DEATH-VALUE
271500210928                                WS-NEW-NET-DEP-VALUE
271600210928                                WS-NEW-GUAR-BASE-VALUE
27170021092817973                           WS-NEW-GUAR-DEATH-VALUE
271800210928                                WS-OLD-NET-DEP-VAL-CUR
271900210928                                WS-OLD-GUAR-BASE-VAL-CUR
27200021092817973                           WS-OLD-GUAR-DEATH-VAL-CUR
272100210928                                WS-NEW-NET-DEP-VAL-CUR
272200210928                                WS-NEW-GUAR-BASE-VAL-CUR
27230021092817973                           WS-NEW-GUAR-DEATH-VAL-CUR
272400210928RF9332                          WS-NEW-OPENING-UNIT-BAL
272500210928RF9332                          WS-CURR-CONTRACT-GBV-BEF
27260021092817973                           WS-CURR-CONTRACT-GDV-BEF
272700210928RF9332                          WS-CURR-CONTRACT-NDV-BEF
272800210928RF8781                          WS-AVERAGE-UNIT-COST
272900210928RF8781                          WS-AVERAGE-EXCHANGE-RATE.
273000210928
273100210928           IF WS-CALC-METHOD NOT = "P"
273200210928              MOVE 0 TO WS-CONT-INV-MARKET-VALUE
273300210928           END-IF.
273400210928
273500210928           IF COMM-ACTION = "RVS TRADE"
273600210928
273700210928             MOVE 0 TO WS-CURR-UNIT-BAL-DLYHST
273800210928             MOVE CURR-ACCOUNT-NO
273900210928                             TO ACCOUNT-NO
274000210928                             OF ACCOUNT-CONTRACT-INVESTMENT
274100210928             MOVE CURR-CONTRACT-NO
274200210928                             TO CONTRACT-NO
274300210928                             OF ACCOUNT-CONTRACT-INVESTMENT
274400210928             MOVE CURR-INVESTMENT-CODE
274500210928                             TO INVESTMENT-CODE
274600210928                             OF ACCOUNT-CONTRACT-INVESTMENT
274700210928
274800210928             READ ACCOUNT-CONTRACT-INVESTMENT WITH NO LOCK
274900210928RF8781            INVALID KEY
275000210928RF8781            CONTINUE
275100210928RF8781       END-READ
275200210928
275300210928168841       INITIALIZE li_CurrUnitBal, li_NewGBV
275400210928
275500210928RF8781       MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
275600210928RF8781                       TO WS-CURR-UNIT-BAL-DLYHST
275700210928168841       MOVE WS-CURR-UNIT-BAL-DLYHST TO li_CurrUnitBal
275800210928RF9332       MOVE OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT
275900210928RF9332                       TO WS-NEW-OPENING-UNIT-BAL
276000210928
276100210928             MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
276200210928                             TO WS-NEW-NET-DEP-VALUE
276300210928             MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
276400210928                             TO WS-NEW-GUAR-BASE-VALUE
276500210928168841       MOVE WS-NEW-GUAR-BASE-VALUE TO li_NewGBV
27660021092817973        MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
27670021092817973                        TO WS-NEW-GUAR-DEATH-VALUE
276800210928
276900210928             MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
277000210928                             TO WS-NEW-NET-DEP-VAL-CUR
277100210928             MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
277200210928                             TO WS-NEW-GUAR-BASE-VAL-CUR
27730021092817973        MOVE GUAR-DEATH-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
27740021092817973                        TO WS-NEW-GUAR-DEATH-VAL-CUR
277500210928           ELSE
277600210928             IF COMM-ACTION = "RE-CALC"
277700210928               MOVE 1        TO WS-CURR-UNIT-BAL-DLYHST
277800210928             END-IF
277900210928           END-IF.
278000210928
278100210928           PERFORM INIT-ERROR-LOG
278200210928                             THRU IEL-EXIT.
278300210928
278400210928           MOVE "N" TO WS-BUY-CALC-P-FLAG.
278500210928           IF WS-CALC-METHOD = "P" AND BUY-TRANSACTION
278600210928              MOVE "Y" TO WS-BUY-CALC-P-FLAG
278700210928           END-IF.
278800210928
278900210928       LR2-EXIT.
279000210928           EXIT.
279100210928
279200210928      /
279300210928       LEVEL-SUMMARY-2.
279400210928
279500210928      * RFS24943 - Begin
279600210928      * Skip the paragraph if new revised method calculation have
279700210928      * been used: all calculations and updates already done.
279800210928           IF SW-REVISED-METHOD-USED
279900210928             GO TO LS2-EXIT
280000210928           END-IF
280100210928
280200210928      * RFS24943 - End
280300210928      * RFS 11255 Begins --------
28040021092826151**    IF CURR-CONTROLS = HIGH-VALUES AND EXCLUDE-TRANS-FLAG = "Y"
28050021092826151**       GO TO LS2-EXIT
28060021092826151**    END-IF.
280700210928      * RFS 11255 Ends ----------
280800210928
280900210928      *RFS168841 - STARTS
281000210928RF8902*    IF NOT BUY-TRANSACTION AND WS-CALC-METHOD = "P"
281100210928RF9332*       GO TO LS2-EXIT
281200210928RF9332*    END-IF.
281300210928           IF ((NOT BUY-TRANSACTION AND WS-CALC-METHOD = "P") OR
281400210928           (BUY-TRANSACTION AND WS-CALC-METHOD = "P" AND li_CurrUnitBal
281500210928           = 0 AND li_ResidualGBV NOT = 0))
281600210928              GO TO LS2-EXIT
281700210928           END-IF.
281800210928      *RFS168841 - ENDS
281900210928
282000210928159011     IF lc_DistrOptionCode = lc_C
282100210928159011        GO TO LS2-EXIT
282200210928159011     END-IF.
282300210928
282400210928      * Skip update data if error
282500210928           IF WS-REJECTION-CODE NOT = SPACES AND "00"
282600210928             GO TO LS2-0010
282700210928           END-IF.
282800210928
282900210928           IF COMM-ACTION = "RVS TRADE"
283000210928
283100210928185171     IF EXCLUDE-TRANS-FLAG NOT = "Y" OR
283200210928185171      ( EXCLUDE-TRANS-FLAG = "Y"
283300210928185171         AND EXCLUSION-RULE = '02')
283400210928             MOVE WS-NEW-NET-DEP-VALUE
283500210928                             TO NET-DEPOSIT-VALUE
283600210928                             OF ACCOUNT-CONTRACT-INVESTMENT
283700210928             MOVE WS-NEW-GUAR-BASE-VALUE
283800210928                             TO GUAR-BASE-VALUE
283900210928                             OF ACCOUNT-CONTRACT-INVESTMENT
28400021092817973        MOVE WS-NEW-GUAR-DEATH-VALUE
28410021092817973                        TO GUAR-DEATH-VALUE
28420021092817973                        OF ACCOUNT-CONTRACT-INVESTMENT
284300210928             MOVE WS-NEW-NET-DEP-VAL-CUR
284400210928                             TO NET-DEPOSIT-VALUE-CUR
284500210928                             OF ACCOUNT-CONTRACT-INVESTMENT
284600210928             MOVE WS-NEW-GUAR-BASE-VAL-CUR
284700210928                             TO GUAR-BASE-VALUE-CUR
284800210928                             OF ACCOUNT-CONTRACT-INVESTMENT
28490021092817973        MOVE WS-NEW-GUAR-DEATH-VAL-CUR
28500021092817973                        TO GUAR-DEATH-VALUE-CUR
28510021092817973                        OF ACCOUNT-CONTRACT-INVESTMENT
28520021092826151       END-IF
285300210928
285400210928RF9332       MOVE WS-NEW-OPENING-UNIT-BAL
285500210928RF9332                       TO OPENING-UNIT-BALANCE
285600210928RF9332                       OF ACCOUNT-CONTRACT-INVESTMENT
285700210928           END-IF.
285800210928
285900210928       LS2-0010.
286000210928
286100210928           IF COMM-ACTION = "RVS TRADE"
286200210928             REWRITE ACC-CON-INV-REC
286300210928           END-IF.
286400210928
286500210928       LS2-EXIT.
286600210928           EXIT.
286700210928
286800210928      /
286900210928       LEVEL-REINIT-3.
287000210928
287100210928           MOVE CURR-INVESTMENT-CODE
287200210928                             TO INVESTMENT-CODE OF INVESTMENT.
287300210928           READ INVESTMENT.
287400210928
287500210928           IF WS-GET-LOAD-STRUCTURE = "Y"
287600210928              MOVE LOAD-STRUCTURE OF INVESTMENT TO WS-LOAD-STRUCTURE
287700210928              MOVE "N" TO WS-GET-LOAD-STRUCTURE
287800210928           END-IF.
287900210928
288000210928       LR3-EXIT.
288100210928           EXIT.
288200210928
288300210928      /
288400210928       LEVEL-SUMMARY-3.
288500210928
288600210928       LS3-EXIT.
288700210928           EXIT.
288800210928
288900210928      /
289000210928       LEVEL-REINIT-4.
289100210928
289200210928           MOVE CURR-ACCOUNT-NO
289300210928                             TO ACCOUNT-NO OF ACCOUNT.
289400210928           READ ACCOUNT.
28950021092817973 *    IF WS-CALC-GDV = "Y"
28960021092817973 *       CALL "SEGDTHPER" USING CURR-ACCOUNT-NO,
28970021092817973 *                              CURR-CONTRACT-NO
28980021092817973 *                              CURR-INVESTMENT-CODE
28990021092817973 *                              WS-DEATH-PERCENT
29000021092817973 *       CANCEL "SEGDTHPER"
29010021092817973 *    END-IF.
290200210928
290300210928       LR4-EXIT.
290400210928           EXIT.
290500210928
290600210928      /
290700210928       LEVEL-SUMMARY-4.
290800210928
290900210928       LS4-EXIT.
291000210928           EXIT.
291100210928
291200210928      /
291300210928       DETAIL-PROCESSING.
291400210928
291500210928           EVALUATE COMM-ACTION
291600210928
291700210928           WHEN "RVS TRADE"
291800210928             PERFORM DETAIL-DAILY-HST-PROCESSING
291900210928                                       THRU DDHP-EXIT
292000210928           WHEN OTHER
292100210928           MOVE HIGH-VALUES  TO CURR-CONTROLS
292200210928
292300210928           END-EVALUATE.
292400210928
292500210928       DPR-EXIT.
292600210928           EXIT.
292700210928
292800210928      /
292900210928       DETAIL-DAILY-HST-PROCESSING.
293000210928
293100210928           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
293200210928              GO TO DDHP-EXIT
293300210928           END-IF.
293400210928
293500210928      * Skip update data if error
293600210928           IF WS-REJECTION-CODE NOT = SPACES AND "00"
293700210928             GO TO DDHP-EXIT
293800210928           END-IF.
293900210928
294000210928168841     INITIALIZE li_GBVChange, li_ResidualGBV.
294100210928RF9332     MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
294200210928RF9332          TO WS-REQUIRED-UNITSP.
294300210928168841     MOVE GBV-CHANGE OF TRANS-CONTRACT-DETAILS TO li_GBVChange
294400210928168841     COMPUTE li_ResidualGBV = (li_NewGBV - li_GBVChange)
294500210928
294600210928      * RFS24943 - Begin
294700210928      * The revised direct method only applies to transactions which
294800210928      * are not defined in the exclude transaction table.
294900210928
295000210928           SET SW-REVISED-METHOD-NOT-USED      TO TRUE
295100210928           IF WS-EDIT-DMCCON-YES    AND
295200210928              WS-PRE-1999  = LT-Y   AND
295300210928      * RFS29028 - Begin
295400210928              EXCLUDE-TRANS-FLAG NOT = LT-Y
295500210928      * RFS29028 - End
295600210928             SET SW-REVISED-METHOD-USED      TO TRUE
295700210928             PERFORM Get-Revised-Direct-Method
295800210928             GO TO DDHP-EXIT
295900210928           END-IF.
296000210928      * RFS24943 - End
296100210928
296200210928      * Proportionate Method Calculation
296300210928      *RFS168841 - STARTS
296400210928RF8092*    IF NOT BUY-TRANSACTION AND WS-CALC-METHOD = "P"
296500210928           IF ((NOT BUY-TRANSACTION AND WS-CALC-METHOD = "P")
296600210928           OR
296700210928           (BUY-TRANSACTION AND WS-CALC-METHOD = "P"
296800210928           AND li_CurrUnitBal = 0 AND li_ResidualGBV NOT = 0 ))
296900210928      *RFS168841 - ENDS
296901211007111744        INITIALIZE ln_InvArraySize
296902211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
297000210928RF9332        INITIALIZE WS-OTHER-VARIABLES-2
297100210928RF9332                   WS-ACC-CONT-INV-ARRAYX WS-REJECTION-CODE
297101211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
297102211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
297103211007111744     INITIALIZE WS-ARRAY-ACCOUNT-NO(IVS-CNT1)
297104211007111744                WS-ARRAY-CONTRACT-NO(IVS-CNT1)
297105211007111744                WS-ARRAY-INVESTMENT-CODE(IVS-CNT1)
297106211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
297107211007111744                WS-ARRAY-BEFORE-MV(IVS-CNT1)
297108211007111744                WS-ARRAY-BEFORE-GBV(IVS-CNT1)
297109211007111744                WS-ARRAY-BEFORE-GDV(IVS-CNT1)
297110211007111744                WS-ARRAY-BEFORE-NDV(IVS-CNT1)
297111211007111744                WS-ARRAY-AFTER-MV(IVS-CNT1)
297112211007111744                WS-ARRAY-INV-EXCH-RATE(IVS-CNT1)
297113211007111744     END-PERFORM
297200210928RF9332        MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
297300210928RF9332          TO WS-REQUIRED-UNITSP
297400210928RF9332        PERFORM CALC-PROPORTIONAL-GBV THRU CPG-EXIT
297500210928RF9332        PERFORM RECALC-NETDEP-GBV-VALUES THRU RNGV-EXIT
297600210928R12702        PERFORM CHECK-NDV-GBV-ROUNDING THRU CNGR-EXIT
297700210928RF9332        GO TO DDHP-EXIT
297800210928RF9332     END-IF.
297900210928
298000210928      * Standard Method Calculation
298100210928           PERFORM CALC-NET-AND-GUAR-VALUE
298200210928                             THRU CNAG-EXIT.
298300210928
298400210928      * Skip update data if error
298500210928           IF WS-REJECTION-CODE NOT = SPACES AND "00"
298600210928             GO TO DDHP-EXIT
298700210928           END-IF.
298800210928
298900210928       DDHP-EXIT.
299000210928           EXIT.
299100210928
299200210928      * RFS24943 - Begin
299300210928      * ---------------------------------
299400210928       Get-Revised-Direct-Method.
299500210928      * ---------------------------------
299600210928      * Do Calculation for GBV/NDV using Revised Direct Method
299700210928
299800210928      * Read appropriate Trans Contract detail record
299900210928           PERFORM GET-TRANS-CONTRACT-DTL
300000210928
300100210928           PERFORM CALC-GBV-NDV-CHANGE
300200210928
300300210928           PERFORM Get-Revised-Direct-Method-DET.
300400210928      * ---------------------------------
300500210928       CALC-GBV-NDV-CHANGE.
300600210928      * ---------------------------------
300700210928      * Initialize some vars and Calculate Current Gross Amount
300800210928      * (to be used in calculation GBV/NDV)
300900210928           INITIALIZE WS-GBV-CHANGE
301000210928                      WS-NDV-CHANGE
301100210928                      WS-CURR-ORIG-UNIT-BAL
301200210928
301300210928      * RFS29028 - Begin
301400210928      * Initialize Calculated value used for reconciliation
301500210928           INITIALIZE WS-CALC-TOT-GBV
301600210928                      WS-CALC-TOT-NDV
301700210928                      WS-DELTA-TOT-GBV
301800210928                      WS-DELTA-TOT-NDV
301900210928      * RFS29028 - End
302000210928      * Calculate/Get Current data
302100210928
302200210928           MOVE ORIG-UNIT-BAL OF TRANS-CON-DTL-PURCHASE TO
302300210928                                               WS-CURR-ORIG-UNIT-BAL
302400210928           MOVE GBV-CHANGE    OF TRANS-CON-DTL-PURCHASE TO
302500210928                                               WS-GBV-CHANGE
302600210928           MOVE NDV-CHANGE    OF TRANS-CON-DTL-PURCHASE TO
302700210928                                               WS-NDV-CHANGE.
302800210928      * ---------------------------------
302900210928       Get-Revised-Direct-Method-DET.
303000210928      * ---------------------------------
303100210928      * Detail -
303200210928      *   Calculation for GBV/NDV using Revised Direct Method
303300210928
303400210928      * Move Current Data to temporary variables which will be used
303500210928      * in Get-totals paragraph and in other paragraphs
303600210928
303700210928           MOVE CURR-ACCOUNT-NO       TO WS-TEMP-ACCOUNT-NO
303800210928           MOVE CURR-CONTRACT-NO      TO WS-TEMP-CONTRACT-NO
303900210928           MOVE CURR-INVESTMENT-CODE  TO WS-TEMP-INVESTMENT-CODE
304000210928
304100210928           MOVE WS-CURR-ORIG-UNIT-BAL TO WS-TEMP-ORIG-UNIT-BAL
304200210928
304300210928           PERFORM GET-TOTALS
304400210928
304500210928      * Apply GBV,NDV Change to the totals GBV,NDV
304600210928           PERFORM RE-CALC-TOT-GBV-NDV
304700210928
304800210928           PERFORM Update-GBV-NDV-Main.
304900210928      * ---------------------------------
305000210928       GET-TRANS-CONTRACT-DTL.
305100210928      * ---------------------------------
305200210928      * Need to read appropriate TRANS Contract detail record
305300210928           MOVE CURR-PLACEMENT-DATE   TO
305400210928                        PLACEMENT-DATE OF TRANS-CON-DTL-PURCHASE
305500210928           MOVE CURR-TRANS-NO         TO
305600210928                        TRANS-NO       OF TRANS-CON-DTL-PURCHASE
305700210928           MOVE CURR-CONTRACT-NO      TO
305800210928                        CONTRACT-NO    OF TRANS-CON-DTL-PURCHASE
305900210928
306000210928           READ TRANS-CON-DTL-PURCHASE WITH NO LOCK
306100210928             INVALID KEY
306200210928               MOVE CURR-PLACEMENT-DATE   TO DSP-PLACEMENT-DATE
306300210928               MOVE CURR-TRANS-NO         TO DSP-TRANS-NO
306400210928               MOVE CURR-CONTRACT-NO      TO DSP-CONTRACT-NO
306500210928               DISPLAY "TRANS-CON-DTL-PURCHASE not found ! "
306600210928               DISPLAY "Pl Date:" DSP-PLACEMENT-DATE
306700210928                       " Tr No:"  DSP-TRANS-NO
306800210928                       " Contr No:" DSP-CONTRACT-NO
306900210928               INITIALIZE MFATRCODP OF TRANS-CON-DTL-PURCHASE
307000210928           END-READ.
307100210928      * ---------------------------------
307200210928       RE-CALC-TOT-GBV-NDV.
307300210928      * ---------------------------------
307400210928      * Totals for GBV and NDV need to be re-calculated
307500210928      * before Updates will take place
307600210928
307700210928      * Note: This is reversal, so DO ADD for Reductions
307800210928      *
307900210928           IF REDUCTION-TRANSACTION
308000210928             COMPUTE WS-RDM-TOT-GBV = WS-RDM-TOT-GBV + WS-GBV-CHANGE
308100210928             COMPUTE WS-RDM-TOT-NDV = WS-RDM-TOT-NDV + WS-NDV-CHANGE
308200210928           ELSE
308300210928             COMPUTE WS-RDM-TOT-GBV = WS-RDM-TOT-GBV - WS-GBV-CHANGE
308400210928             COMPUTE WS-RDM-TOT-NDV = WS-RDM-TOT-NDV - WS-NDV-CHANGE
308500210928           END-IF.
308600210928
308700210928      * Make sure the result (GBV, NDV) is not negative
308800210928           IF WS-RDM-TOT-GBV < 0
308900210928             MOVE 0            TO WS-RDM-TOT-GBV
309000210928           END-IF
309100210928
309200210928           IF WS-RDM-TOT-NDV < 0
309300210928             MOVE 0            TO WS-RDM-TOT-NDV
309400210928           END-IF.
309500210928      * ---------------------------------
309600210928       GET-TOTALS.
309700210928      * ---------------------------------
309800210928      *
309900210928      * Get total opening-unit-balance,
310000210928      * total GBV and total NDV in Account, Contract
310100210928      *
310200210928           MOVE WS-TEMP-ACCOUNT-NO      TO
310300210928                PASS-ACCOUNT-NO     OF COMM-CPGBVNDVT-PARAMETERS
310400210928           MOVE WS-TEMP-CONTRACT-NO     TO
310500210928                PASS-CONTRACT-NO    OF COMM-CPGBVNDVT-PARAMETERS
310600210928
310700210928           SET PASS-ACTION-GETDTA OF COMM-CPGBVNDVT-PARAMETERS TO TRUE
310800210928           CALL "FXGBVNDVT"  USING COMM-CPGBVNDVT-PARAMETERS.
310900210928
311000210928           MOVE RETN-RDM-TOT-CURR-UNIT-BAL TO
311100210928                                       WS-RDM-TOT-CURR-UNIT-BAL
311200210928           MOVE RETN-RDM-TOT-UNITS  TO WS-RDM-TOT-UNITS
311300210928           MOVE RETN-RDM-TOT-NDV    TO WS-RDM-TOT-NDV
311400210928           MOVE RETN-RDM-TOT-GBV    TO WS-RDM-TOT-GBV.
311500210928
311600210928      * Include/Exclude Units of the trade from the totals
311700210928      * Note: This is reversal, so need to ADD (!) units for redemption
311800210928      * and subtract units otherwise.
311900210928           EVALUATE TRUE
312000210928             WHEN REDEMPTION-TRANSACTION
312100210928               COMPUTE WS-RDM-TOT-UNITS =
312200210928                       WS-RDM-TOT-UNITS + WS-TEMP-ORIG-UNIT-BAL
312300210928             WHEN OTHER
312400210928               COMPUTE WS-RDM-TOT-UNITS =
312500210928                       WS-RDM-TOT-UNITS - WS-TEMP-ORIG-UNIT-BAL
312600210928
312700210928               IF WS-RDM-TOT-UNITS < 0
312800210928                 MOVE 0       TO WS-RDM-TOT-UNITS
312900210928               END-IF
313000210928           END-EVALUATE.
313100210928      * ---------------------------------
313200210928       Update-GBV-NDV-Main.
313300210928      * ---------------------------------
313400210928      * Update GBV, NDV in ACCOUNT-CONTRACT-INVESTMENT
313500210928      *
313600210928      * RFS29028 - Begin
313700210928           INITIALIZE MFAACCCIP OF WS-ACCOUNT-CONTRACT-INV-SAV
313800210928      * RFS29028 - End
313900210928
314000210928           MOVE WS-TEMP-ACCOUNT-NO          TO
314100210928                     ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
314200210928           MOVE WS-TEMP-CONTRACT-NO         TO
314300210928                     CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
314400210928           INITIALIZE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
314500210928
314600210928           START ACCOUNT-CONTRACT-INVESTMENT
314700210928                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
314800210928             INVALID KEY
314900210928               MOVE WS-TEMP-ACCOUNT-NO   TO DSP-ACCOUNT-NO
315000210928               MOVE WS-TEMP-CONTRACT-NO  TO DSP-CONTRACT-NO
315100210928               DISPLAY "No data for the Acc No: " DSP-ACCOUNT-NO
315200210928                       " Contract No: "           DSP-CONTRACT-NO
315300210928                       " Inv Code: "           WS-TEMP-INVESTMENT-CODE
315400210928             NOT INVALID KEY
315500210928               SET SW-STS-OK               TO TRUE
315600210928               PERFORM NEXT-ACCOUNT-CONTRACT-INV UNTIL NOT SW-STS-OK
315700210928      * RFS29028 - Begin
315800210928      * Now do reconciliation
315900210928               PERFORM RECONCILE-TOT-GBV-NDV
316000210928      * RFS29028 - End
316100210928           END-START.
316200210928      * ---------------------------------
316300210928       NEXT-ACCOUNT-CONTRACT-INV.
316400210928      * ---------------------------------
316500210928      * Read Next record from ACCOUNT-CONTRACT-INVESTMENT and
316600210928      * do calculations
316700210928
316800210928           READ ACCOUNT-CONTRACT-INVESTMENT NEXT
316900210928            AT END
317000210928              SET SW-STS-END          TO TRUE
317100210928            NOT AT END
317200210928              PERFORM CHECK-ACCOUNT-CONTRACT-LEVEL
317300210928              IF SW-STS-OK
317400210928                PERFORM UPD-ACCOUNT-CONTRACT-INV-Main
317500210928              END-IF
317600210928           END-READ.
317700210928      * ---------------------------------
317800210928       CHECK-ACCOUNT-CONTRACT-LEVEL.
317900210928      * ---------------------------------
318000210928      * Check, if finished to read current portion
318100210928      * of the Current Account Contract.
318200210928
318300210928           IF WS-TEMP-ACCOUNT-NO NOT =
318400210928                  ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT   OR
318500210928              WS-TEMP-CONTRACT-NO NOT =
318600210928                  CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
318700210928            SET SW-STS-END          TO TRUE
318800210928           END-IF.
318900210928      * ---------------------------------
319000210928       UPD-ACCOUNT-CONTRACT-INV-Main.
319100210928      * ---------------------------------
319200210928      * Populate and Update Account-Contract-Investment
319300210928
319400210928      * The flag will be used to indicate, if Update of the
319500210928      * ACCOUNT-CONTRACT-INVESTMENT is OK.
319600210928
319700210928           SET SW-ACC-CON-OK     TO TRUE
319800210928
319900210928      * Do Not Skip Calculations for Distributions ...
320000210928           PERFORM CALC-RDM-CURR-UNIT-BAL
320100210928           PERFORM CALC-GBV-NDV-PER-INVESTMENT
320200210928
320300210928      * Do not check COMM-ACTION :
320400210928      * program come here only if COMM-ACTION = 'RFS TRADE'
320500210928
320600210928           PERFORM FILL-ACCOUNT-CONTRACT-INV
320700210928
320800210928           PERFORM UPD-ACCOUNT-CONTRACT-INV.
320900210928      * ---------------------------
321000210928       CALC-RDM-CURR-UNIT-BAL.
321100210928      * ---------------------------------
321200210928      *
321300210928      * Do Calculation WS-RDM-CURR-UNIT-BAL, based on transaction type
321400210928      * and current investment code ...
321500210928      *
321600210928
321700210928      * Populate Current Unit Balance from Opening unit balance:
321800210928
321900210928           MOVE OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT TO
322000210928                WS-RDM-CURR-UNIT-BAL
322100210928
322200210928      * Populate 'NEW' values of ACCOUNT-CONTRACT-INVESTMENT
322300210928      * These 'NEW' values will be re-calculated and place back to
322400210928      * ACCOUNT-CONTRACT-INVESTMENT
322500210928
322600210928           PERFORM SAVE-NEW-VALUES
322700210928
322800210928      * Recalculate Units for the Current Investment :
322900210928      * Note: This is reversal, so need to ADD (!) units for redemption
323000210928      * and subtract units otherwise.
323100210928
323200210928           IF INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT =
323300210928              WS-TEMP-INVESTMENT-CODE
323400210928            EVALUATE TRUE
323500210928             WHEN REDEMPTION-TRANSACTION
323600210928               COMPUTE WS-RDM-CURR-UNIT-BAL =
323700210928                 OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT +
323800210928                 WS-TEMP-ORIG-UNIT-BAL
323900210928
324000210928               COMPUTE WS-NEW-OPENING-UNIT-BAL =
324100210928                 OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT +
324200210928                 WS-TEMP-ORIG-UNIT-BAL
324300210928
324400210928             WHEN OTHER
324500210928               COMPUTE WS-RDM-CURR-UNIT-BAL =
324600210928                 OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT -
324700210928                 WS-TEMP-ORIG-UNIT-BAL
324800210928
324900210928                 IF WS-RDM-CURR-UNIT-BAL < 0
325000210928                   MOVE 0  TO WS-RDM-CURR-UNIT-BAL
325100210928                 END-IF
325200210928
325300210928               COMPUTE WS-NEW-OPENING-UNIT-BAL =
325400210928                 OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT -
325500210928                 WS-TEMP-ORIG-UNIT-BAL
325600210928
325700210928               IF WS-NEW-OPENING-UNIT-BAL < 0
325800210928                 MOVE 0    TO WS-NEW-OPENING-UNIT-BAL
325900210928               END-IF
326000210928
326100210928             END-EVALUATE
326200210928           END-IF.
326300210928      * ---------------------------------
326400210928       SAVE-NEW-VALUES.
326500210928      * ---------------------------------
326600210928      * Save New values ...
326700210928
326800210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT     TO
326900210928                WS-NEW-GUAR-BASE-VALUE
327000210928           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT TO
327100210928                WS-NEW-GUAR-BASE-VAL-CUR
327200210928
327300210928           MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT   TO
327400210928                WS-NEW-NET-DEP-VALUE
327500210928           MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT TO
327600210928                WS-NEW-NET-DEP-VAL-CUR
327700210928
327800210928      * Save     Opening Unit Balance
327900210928           MOVE OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT TO
328000210928                WS-NEW-OPENING-UNIT-BAL.
328100210928      * ---------------------------------
328200210928       CALC-GBV-NDV-PER-INVESTMENT.
328300210928      * ---------------------------------
328400210928      * Calculate New Guaranted Base Value (GBV) and NDV
328500210928           IF WS-RDM-TOT-UNITS = 0
328600210928             COMPUTE WS-NEW-GUAR-BASE-VALUE = 0.0
328700210928             COMPUTE WS-NEW-NET-DEP-VALUE   = 0.0
328800210928           ELSE
328900210928             COMPUTE WS-NEW-GUAR-BASE-VALUE ROUNDED =
329000210928                WS-RDM-TOT-GBV *
329100210928                WS-RDM-CURR-UNIT-BAL / WS-RDM-TOT-UNITS
329200210928
329300210928             COMPUTE WS-NEW-NET-DEP-VALUE   ROUNDED =
329400210928                WS-RDM-TOT-NDV *
329500210928                WS-RDM-CURR-UNIT-BAL / WS-RDM-TOT-UNITS
329600210928           END-IF
329700210928
329800210928      * Apply Exchange Rate to the result
329900210928
330000210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
330100210928             COMPUTE WS-NEW-GUAR-BASE-VAL-CUR = WS-NEW-GUAR-BASE-VALUE
330200210928             COMPUTE WS-NEW-NET-DEP-VAL-CUR   = WS-NEW-NET-DEP-VALUE
330300210928           ELSE
330400210928             COMPUTE WS-NEW-GUAR-BASE-VAL-CUR ROUNDED =
330500210928                       WS-NEW-GUAR-BASE-VALUE *
330600210928                       WS-EXCH-RATE-VALUE
330700210928             COMPUTE WS-NEW-NET-DEP-VAL-CUR   ROUNDED =
330800210928                       WS-NEW-NET-DEP-VALUE *
330900210928                       WS-EXCH-RATE-VALUE
331000210928           END-IF.
331100210928      * ---------------------------------
331200210928       FILL-ACCOUNT-CONTRACT-INV.
331300210928      * ---------------------------------
331400210928      * Fill ACCOUNT-CONTRACT-INVESTMENT record with new data
331500210928
331600210928      * Populate OLD values ...
331700210928           MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
331800210928              TO OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
331900210928           MOVE GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
332000210928              TO OLD-GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
332100210928
332200210928           MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
332300210928              TO OLD-NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
332400210928           MOVE NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
332500210928              TO OLD-NET-DEPOSIT-VALUE-CUR OF
332600210928                     ACCOUNT-CONTRACT-INVESTMENT
332700210928
332800210928      * Populate New values ...
332900210928
333000210928           MOVE WS-NEW-GUAR-BASE-VALUE       TO
333100210928                GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
333200210928      * RFS29028 - Begin
333300210928           COMPUTE WS-CALC-TOT-GBV =
333400210928                WS-CALC-TOT-GBV + WS-NEW-GUAR-BASE-VALUE
333500210928      * RFS29028 - End
333600210928
333700210928           MOVE WS-NEW-GUAR-BASE-VAL-CUR     TO
333800210928                GUAR-BASE-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
333900210928
334000210928           MOVE WS-NEW-NET-DEP-VALUE         TO
334100210928                NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
334200210928      * RFS29028 - Begin
334300210928           COMPUTE WS-CALC-TOT-NDV =
334400210928                WS-CALC-TOT-NDV + WS-NEW-NET-DEP-VALUE
334500210928      * RFS29028 - End
334600210928           MOVE WS-NEW-NET-DEP-VAL-CUR       TO
334700210928                NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
334800210928
334900210928      * Populate Opening Unit Balance
335000210928           MOVE WS-NEW-OPENING-UNIT-BAL      TO
335100210928                OPENING-UNIT-BALANCE OF ACCOUNT-CONTRACT-INVESTMENT.
335200210928      * ---------------------------------
335300210928       UPD-ACCOUNT-CONTRACT-INV.
335400210928      * ---------------------------------
335500210928           REWRITE ACC-CON-INV-REC
335600210928             INVALID KEY
335700210928               SET WS-ERR-11                                   TO TRUE
335800210928               SET SW-ACC-CON-FAIL                             TO TRUE
335900210928               MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT  TO
336000210928                    DSP-ACCOUNT-NO
336100210928               MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT TO
336200210928                    DSP-CONTRACT-NO
336300210928               DISPLAY "Error rewriting ACC-CON-INV-REC. Err:"
336400210928                        WS-ERR-CODE
336500210928               DISPLAY "Acc No: " DSP-ACCOUNT-NO
336600210928                       " Contract No: " DSP-CONTRACT-NO
336700210928      * RFS29028 - Begin Save key for the First (!) transaction with
336800210928      *                  Units > 0
336900210928             NOT INVALID KEY
337000210928               PERFORM SAVE-ACC-CON-INV-KEYS
337100210928      * RFS29028 - End
337200210928           END-REWRITE.
337300210928
337400210928      * RFS29028 - Begin
337500210928      * ---------------------------------
337600210928       SAVE-ACC-CON-INV-KEYS.
337700210928      * ---------------------------------
337800210928      * Save key for the First (!) transaction with Units > 0
337900210928           IF ACCOUNT-NO OF WS-ACCOUNT-CONTRACT-INV-SAV = 0 AND
338000210928              OPENING-UNIT-BALANCE OF ACC-CON-INV-REC > 0
338100210928             MOVE ACC-CON-INV-REC   TO WS-ACCOUNT-CONTRACT-INV-SAV
338200210928           END-IF.
338300210928      * RFS29028 - End
338400210928
338500210928      * RFS29028 - Begin
338600210928      * ---------------------------------
338700210928       RECONCILE-TOT-GBV-NDV.
338800210928      * ---------------------------------
338900210928      * Update Account-contract-investment and
339000210928      * Trans-contract-details with reconciliated data
339100210928           COMPUTE WS-DELTA-TOT-GBV = WS-RDM-TOT-GBV - WS-CALC-TOT-GBV
339200210928           COMPUTE WS-DELTA-TOT-NDV = WS-RDM-TOT-NDV - WS-CALC-TOT-NDV
339300210928
339400210928           IF (WS-DELTA-TOT-GBV NOT = 0.0    OR
339500210928               WS-DELTA-TOT-NDV NOT = 0.0)
339600210928             PERFORM RECONCILE-ACCOUNT-CONTRACT-INV
339700210928           END-IF.
339800210928
339900210928           INITIALIZE WS-DELTA-TOT-GBV
340000210928                      WS-DELTA-TOT-NDV.
340100210928      * ---------------------------------
340200210928       RECONCILE-ACCOUNT-CONTRACT-INV.
340300210928      * ---------------------------------
340400210928      * If any transaction was updated then Account No will not be 0
340500210928      *
340600210928           SET SW1-ACC-CON-OK           TO TRUE
340700210928
340800210928           IF ACCOUNT-NO OF WS-ACCOUNT-CONTRACT-INV-SAV NOT = 0
340900210928             MOVE WS-ACCOUNT-CONTRACT-INV-SAV TO
341000210928                             ACC-CON-INV-REC
341100210928             READ ACCOUNT-CONTRACT-INVESTMENT
341200210928               INVALID KEY
341300210928                 DISPLAY "Error reading from TRANS-CON-DTL"
341400210928                 SET SW1-ACC-CON-READ           TO TRUE
341500210928               NOT INVALID KEY
341600210928                 PERFORM REWR-ACCOUNT-CONTRACT-INV
341700210928               END-READ
341800210928           END-IF.
341900210928      * ---------------------------------
342000210928       REWR-ACCOUNT-CONTRACT-INV.
342100210928      * ---------------------------------
342200210928      * Do rounding reconciliation only if Delta is very small
342300210928           IF WS-DELTA-TOT-GBV > lt-min-delta-gbv  AND
342400210928              WS-DELTA-TOT-GBV < lt-max-delta-gbv
342500210928
342600210928             ADD WS-DELTA-TOT-GBV TO
342700210928                GUAR-BASE-VALUE       OF ACCOUNT-CONTRACT-INVESTMENT
342800210928                GUAR-BASE-VALUE-CUR   OF ACCOUNT-CONTRACT-INVESTMENT
342900210928           END-IF
343000210928
343100210928           IF WS-DELTA-TOT-NDV > lt-min-delta-ndv  AND
343200210928              WS-DELTA-TOT-NDV < lt-max-delta-ndv
343300210928             ADD WS-DELTA-TOT-NDV TO
343400210928                NET-DEPOSIT-VALUE     OF ACCOUNT-CONTRACT-INVESTMENT
343500210928                NET-DEPOSIT-VALUE-CUR OF ACCOUNT-CONTRACT-INVESTMENT
343600210928           END-IF
343700210928
343800210928           REWRITE ACC-CON-INV-REC
343900210928             INVALID KEY
344000210928               DISPLAY "Error rewriting to ACC-CON-INV-REC "
344100210928               SET SW1-ACC-CON-REWRITE    TO TRUE
344200210928           END-REWRITE.
344300210928
344400210928      * RFS29028 - End
344500210928      * ---------------------------------
344600210928      * RFS24943 - End
344700210928      * ---------------------------------
344800210928      /
344900210928       CALC-NET-AND-GUAR-VALUE.
345000210928
345100210928      *    Update curr-unit-bal for RE-CALC only
345200210928           MOVE 0 TO WS-DUMMY-AVE-UNIT-COST WS-CURR-TRANS-AMT-CUR.
34530021092817973      MOVE 0 TO WS-CURR-TRANS-AMT-CUR-GDV.
345400210928           IF COMM-ACTION = "RVS TRADE"
345500210928             IF REDUCTION-TRANSACTION
345600210928               ADD WS-CURR-ORIG-UNIT-BAL TO WS-NEW-OPENING-UNIT-BAL
345700210928             ELSE
345800210928               SUBTRACT WS-CURR-ORIG-UNIT-BAL FROM
345900210928                        WS-NEW-OPENING-UNIT-BAL
346000210928             END-IF
346100210928
346200210928RF8781       IF WS-CURR-AVE-UNIT-COST NOT = 0
346300210928                COMPUTE WS-DUMMY-AVE-UNIT-COST ROUNDED =
346400210928                   NET-DEPOSIT-VALUE-CUR OF TRANS-CONTRACT-DETAILS /
346500210928                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
346600210928             END-IF
346700210928             IF WS-CURR-AVE-EXCH-RATE NOT = 0
346800210928                MOVE WS-CURR-AVE-EXCH-RATE TO WS-CURR-TRANS-EXCH-RATE
346900210928             END-IF
347000210928           END-IF.
347100210928
347200210928       CNAG-0010.
347300210928
347400210928R13394*    IF BUY-TRANSACTION AND TRANSFER-AMT-EXISTS    R49898
347500210928R49898     IF (BUY-TRANSACTION OR SWITCH-IN-TRANSACTION)
347600210928R49898        AND TRANSFER-AMT-EXISTS
347700210928              GO TO CNAG-0020
347800210928R13394     END-IF.
347900210928
348000210928      *    Calculate trans amount in the fund currency & base currency
348100210928      * RFS 107585 Begins
348200210928RF8092*    IF WS-TRANSFER-GBV = "Y"
348300210928           IF lc-TransferGDV  = "Y"
348400210928      * RFS 107585 Ends
348500210928              IF WS-CURR-AVE-UNIT-COST NOT = 0
348600210928                 COMPUTE WS-CURR-TRANS-AMT-CUR ROUNDED =
348700210928                    ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
348800210928                    WS-CURR-AVE-UNIT-COST
34890021092817973            MOVE WS-CURR-TRANS-AMT-CUR
34900021092817973              TO WS-CURR-TRANS-AMT-CUR-GDV
349100210928              ELSE
349200210928                 IF WS-DUMMY-AVE-UNIT-COST NOT = 0
349300210928                    COMPUTE WS-CURR-TRANS-AMT-CUR ROUNDED =
349400210928                      ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
349500210928                      WS-DUMMY-AVE-UNIT-COST
34960021092817973            MOVE WS-CURR-TRANS-AMT-CUR
34970021092817973              TO WS-CURR-TRANS-AMT-CUR-GDV
349800210928                 ELSE
349900210928                     MOVE WS-CURR-TRANS-GROSS TO WS-CURR-TRANS-AMT-CUR
35000021092817973                MOVE WS-CURR-TRANS-GROSS-GDV
35010021092817973                  TO WS-CURR-TRANS-AMT-CUR-GDV
350200210928                 END-IF
350300210928              END-IF
350400210928           END-IF.
350500210928
350600210928      * RFS 107585 Begins
350700210928      *    IF WS-TRANSFER-GBV = "N"
350800210928           IF lc-TransferGDV  = "N"
350900210928      * RFS 107585 Ends
351000210928              IF REDUCTION-TRANSACTION
351100210928                 IF WS-DUMMY-AVE-UNIT-COST NOT = 0
351200210928                    COMPUTE WS-CURR-TRANS-AMT-CUR ROUNDED =
351300210928                      ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
351400210928                      WS-DUMMY-AVE-UNIT-COST
35150021092817973               MOVE WS-CURR-TRANS-AMT-CUR
35160021092817973                 TO WS-CURR-TRANS-AMT-CUR-GDV
351700210928                 ELSE
351800210928                    IF WS-CURR-AVE-UNIT-COST NOT = 0
351900210928                       COMPUTE WS-CURR-TRANS-AMT-CUR ROUNDED =
352000210928                          ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
352100210928                          WS-CURR-AVE-UNIT-COST
35220021092817973               MOVE WS-CURR-TRANS-AMT-CUR
35230021092817973                 TO WS-CURR-TRANS-AMT-CUR-GDV
352400210928                    ELSE
352500210928                       MOVE WS-CURR-TRANS-GROSS TO WS-CURR-TRANS-AMT-CUR
35260021092817973                  MOVE WS-CURR-TRANS-GROSS-GDV
35270021092817973                    TO WS-CURR-TRANS-AMT-CUR-GDV
352800210928                    END-IF
352900210928                 END-IF
353000210928              ELSE
353100210928                 MOVE WS-CURR-TRANS-GROSS TO WS-CURR-TRANS-AMT-CUR
35320021092817973            MOVE WS-CURR-TRANS-GROSS-GDV
35330021092817973              TO WS-CURR-TRANS-AMT-CUR-GDV
353400210928              END-IF
353500210928           END-IF.
353600210928
353700210928       CNAG-0020.
353800210928R13394*    IF BUY-TRANSACTION AND TRANSFER-AMT-EXISTS    * R49898
353900210928R49898     IF (BUY-TRANSACTION OR SWITCH-IN-TRANSACTION)
354000210928R49898        AND TRANSFER-AMT-EXISTS
354100210928              MOVE NET-DEPOSIT-VALUE OF TRANS-GBV-TRANSFER
354200210928                TO WS-CURR-TRANS-AMT-CUR
354300210928
354400210928              IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
354500210928                 MOVE WS-CURR-TRANS-AMT-CUR TO WS-CURR-TRANS-AMT
35460021092817973            MOVE WS-CURR-TRANS-AMT-CUR-GDV
35470021092817973              TO WS-CURR-TRANS-AMT-GDV
354800210928              ELSE
354900210928                 COMPUTE WS-CURR-TRANS-AMT ROUNDED =
355000210928                         WS-CURR-TRANS-AMT-CUR / WS-CURR-TRANS-EXCH-RATE
35510021092817973            COMPUTE WS-CURR-TRANS-AMT-GDV ROUNDED =
35520021092817973                    WS-CURR-TRANS-AMT-CUR-GDV /
35530021092817973                    WS-CURR-TRANS-EXCH-RATE
355400210928              END-IF
355500210928              GO TO CNAG-0030
355600210928R13394     END-IF.
355700210928
355800210928           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
355900210928             MOVE WS-CURR-TRANS-AMT-CUR
356000210928                             TO WS-CURR-TRANS-AMT
35610021092817973        MOVE WS-CURR-TRANS-AMT-CUR-GDV
35620021092817973                        TO WS-CURR-TRANS-AMT-GDV
356300210928           ELSE
356400210928              IF WS-DUMMY-AVE-UNIT-COST NOT = 0
356500210928              COMPUTE WS-CURR-TRANS-AMT ROUNDED =
356600210928                       ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
356700210928                       WS-DUMMY-AVE-UNIT-COST / WS-CURR-TRANS-EXCH-RATE
35680021092817973            MOVE WS-CURR-TRANS-AMT
35690021092817973              TO WS-CURR-TRANS-AMT-GDV
357000210928              ELSE
357100210928              IF WS-CURR-AVE-UNIT-COST NOT = 0
357200210928                 COMPUTE WS-CURR-TRANS-AMT ROUNDED =
357300210928                       ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
357400210928                       WS-CURR-AVE-UNIT-COST / WS-CURR-TRANS-EXCH-RATE
35750021092817973            MOVE WS-CURR-TRANS-AMT
35760021092817973              TO WS-CURR-TRANS-AMT-GDV
357700210928              ELSE
357800210928                 COMPUTE WS-CURR-TRANS-AMT ROUNDED =
357900210928                       WS-CURR-TRANS-GROSS / WS-CURR-TRANS-EXCH-RATE
35800021092817973            COMPUTE WS-CURR-TRANS-AMT-GDV ROUNDED =
35810021092817973                WS-CURR-TRANS-GROSS-GDV / WS-CURR-TRANS-EXCH-RATE
358200210928             END-IF
358300210928            END-IF
358400210928           END-IF.
358500210928
358600210928R13394 CNAG-0030.
35870021092817973      IF BUY-TRANSACTION
35880021092817973         MOVE GDV-CHANGE OF TRANS-CONTRACT-DETAILS
35890021092817973           TO WS-CURR-TRANS-GDV-AMT-CUR
35900021092817973      END-IF.
359100210928R13394     IF BUY-TRANSACTION AND TRANSFER-AMT-EXISTS
359200210928R13394        MOVE GUAR-BASE-VALUE OF TRANS-GBV-TRANSFER
359300210928R13394          TO WS-CURR-TRANS-GBV-AMT-CUR
359400210928
359500210928              IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
359600210928                 MOVE WS-CURR-TRANS-GBV-AMT-CUR TO WS-CURR-TRANS-GBV-AMT
35970021092817973            MOVE WS-CURR-TRANS-GDV-AMT-CUR TO WS-CURR-TRANS-GDV-AMT
359800210928              ELSE
359900210928                 COMPUTE WS-CURR-TRANS-GBV-AMT ROUNDED =
360000210928                    WS-CURR-TRANS-GBV-AMT-CUR / WS-CURR-TRANS-EXCH-RATE
36010021092817973            COMPUTE WS-CURR-TRANS-GDV-AMT ROUNDED =
36020021092817973               WS-CURR-TRANS-GDV-AMT-CUR / WS-CURR-TRANS-EXCH-RATE
360300210928              END-IF
360400210928R13394     END-IF.
360500210928
360600210928      *    Update net-deposit-value and guaranteed-base-value
360700210928       CNAG-0040.
360800210928           IF REDUCTION-TRANSACTION
360900210928             IF WS-CALC-METHOD NOT = "P"
361000210928                PERFORM GET-PRIOR-RESET-INFO THRU GPRI-EXIT
361100210928             END-IF
361200210928             PERFORM UPD-UNITS-USED-PREV-BUYS THRU UUUPB-EXIT
361300210928           ELSE
361400210928             IF WS-CURR-UNIT-BAL-DLYHST = 0
361500210928                MOVE ZEROES TO WS-NEW-NET-DEP-VAL-CUR
361600210928                               WS-NEW-NET-DEP-VALUE
361700210928                               WS-NEW-GUAR-BASE-VAL-CUR
361800210928                               WS-NEW-GUAR-BASE-VALUE
36190021092817973                          WS-NEW-GUAR-DEATH-VAL-CUR
36200021092817973                          WS-NEW-GUAR-DEATH-VALUE
362100210928                               WS-NEW-OPENING-UNIT-BAL
362200210928             ELSE
362300210928                SUBTRACT WS-CURR-TRANS-AMT-CUR
362400210928                                 FROM WS-NEW-NET-DEP-VAL-CUR
362500210928                SUBTRACT WS-CURR-TRANS-AMT
362600210928                                 FROM WS-NEW-NET-DEP-VALUE
362700210928
362800210928                IF BUY-TRANSACTION AND TRANSFER-AMT-EXISTS
362900210928                SUBTRACT WS-CURR-TRANS-GBV-AMT-CUR
363000210928                                 FROM WS-NEW-GUAR-BASE-VAL-CUR
363100210928                SUBTRACT WS-CURR-TRANS-GBV-AMT
363200210928                                 FROM WS-NEW-GUAR-BASE-VALUE
36330021092817973              SUBTRACT WS-CURR-TRANS-GDV-AMT-CUR
36340021092817973                  FROM WS-NEW-GUAR-DEATH-VAL-CUR
36350021092817973              SUBTRACT WS-CURR-TRANS-GDV-AMT
363600210928                       FROM WS-NEW-GUAR-DEATH-VALUE
363700210928                ELSE
363800210928                SUBTRACT WS-CURR-TRANS-AMT-CUR
363900210928                                 FROM WS-NEW-GUAR-BASE-VAL-CUR
364000210928                SUBTRACT WS-CURR-TRANS-AMT
364100210928                                 FROM WS-NEW-GUAR-BASE-VALUE
36420021092817973               SUBTRACT WS-CURR-TRANS-AMT-CUR-GDV
36430021092817973                   FROM WS-NEW-GUAR-DEATH-VAL-CUR
36440021092817973               SUBTRACT WS-CURR-TRANS-AMT-GDV
364500210928                        FROM WS-NEW-GUAR-DEATH-VALUE
364600210928                END-IF
364700210928             END-IF
364800210928           END-IF.
364900210928
365000210928      * RFS 20516 - Start
365100210928           IF WS-PRE-1999 = "Y"
365200210928              PERFORM RETURN-PRE99-NDV-GBV THRU RPNG-EXIT
365300210928           END-IF
365400210928      * RFS 20516 - End
365500210928
365600210928      *RFS187205-STARTS
365700210928      *    IF WS-NEW-NET-DEP-VALUE IS NEGATIVE
365800210928           IF (WS-NEW-NET-DEP-VALUE IS NEGATIVE
365900210928               AND WS-EDIT-NGGUAR-NO )
366000210928      *RFS187205-END
366100210928              MOVE 0 TO WS-NEW-NET-DEP-VALUE
366200210928           END-IF.
366300210928      *RFS187205-STARTS
366400210928      *    IF WS-NEW-NET-DEP-VAL-CUR IS NEGATIVE
366500210928           IF (WS-NEW-NET-DEP-VAL-CUR IS NEGATIVE
366600210928               AND WS-EDIT-NGGUAR-NO )
366700210928      *RFS187205-END
366800210928              MOVE 0 TO WS-NEW-NET-DEP-VAL-CUR
366900210928           END-IF.
367000210928      *RFS187205-STARTS
367100210928      *    IF WS-NEW-GUAR-BASE-VAL-CUR IS NEGATIVE
367200210928           IF (WS-NEW-GUAR-BASE-VAL-CUR IS NEGATIVE
367300210928               AND WS-EDIT-NGGUAR-NO )
367400210928      *RFS187205-END
367500210928              MOVE 0 TO WS-NEW-GUAR-BASE-VAL-CUR
367600210928           END-IF.
367700210928      *RFS187205-STARTS
367800210928      *    IF WS-NEW-GUAR-BASE-VALUE IS NEGATIVE
367900210928           IF (WS-NEW-GUAR-BASE-VALUE IS NEGATIVE
368000210928               AND WS-EDIT-NGGUAR-NO )
368100210928      *RFS187205-END
368200210928              MOVE 0 TO WS-NEW-GUAR-BASE-VALUE
368300210928           END-IF.
368400210928
368500210928      *RFS187205-STARTS
36860021092817973 *    IF WS-NEW-GUAR-DEATH-VAL-CUR IS NEGATIVE
368700210928           IF (WS-NEW-GUAR-DEATH-VAL-CUR IS NEGATIVE
368800210928               AND WS-EDIT-NGGUAR-NO )
368900210928      *RFS187205-END
36900021092817973         MOVE 0 TO WS-NEW-GUAR-DEATH-VAL-CUR
36910021092817973      END-IF.
369200210928      *RFS187205-STARTS
36930021092817973 *    IF WS-NEW-GUAR-DEATH-VALUE IS NEGATIVE
369400210928           IF (WS-NEW-GUAR-DEATH-VALUE IS NEGATIVE
369500210928               AND WS-EDIT-NGGUAR-NO )
369600210928      *RFS187205-END
36970021092817973         MOVE 0 TO WS-NEW-GUAR-DEATH-VALUE
36980021092817973      END-IF.
369900210928
370000210928       CNAG-EXIT.
370100210928           EXIT.
370200210928
370300210928      /
370400210928      * RFS 20516 - Start
370500210928       RETURN-PRE99-NDV-GBV.
370600210928
370700210928           IF REDUCTION-TRANSACTION
370800210928      *** Return the Net Deposit Value from the current ndv-change
370900210928              ADD NDV-CHANGE OF TRANS-CONTRACT-DETAILS
371000210928                             TO WS-NEW-NET-DEP-VAL-CUR
371100210928              ADD NDV-CHANGE OF TRANS-CONTRACT-DETAILS
371200210928                             TO WS-NEW-NET-DEP-VALUE
371300210928      *** Return the Guar Base Value from the current gbv-change
371400210928              ADD GBV-CHANGE OF TRANS-CONTRACT-DETAILS
371500210928                             TO WS-NEW-GUAR-BASE-VAL-CUR
371600210928              ADD GBV-CHANGE OF TRANS-CONTRACT-DETAILS
371700210928                             TO WS-NEW-GUAR-BASE-VALUE
371800210928      *** Return the Guar Death Value from the current gdv-change
371900210928              ADD GDV-CHANGE OF TRANS-CONTRACT-DETAILS
372000210928                             TO WS-NEW-GUAR-DEATH-VAL-CUR
372100210928              ADD GDV-CHANGE OF TRANS-CONTRACT-DETAILS
372200210928                             TO WS-NEW-GUAR-DEATH-VALUE
372300210928           END-IF.
372400210928
372500210928           IF SWITCH-IN-TRANSACTION
372600210928      *** Reduce the Net Deposit Value with the current ndv-change
372700210928              SUBTRACT NDV-CHANGE OF TRANS-CONTRACT-DETAILS
372800210928                                  FROM WS-NEW-NET-DEP-VAL-CUR
372900210928              SUBTRACT NDV-CHANGE OF TRANS-CONTRACT-DETAILS
373000210928                                  FROM WS-NEW-NET-DEP-VALUE
373100210928      *** Reduce the Guar Base Value with the current gbv-change
373200210928              SUBTRACT GBV-CHANGE OF TRANS-CONTRACT-DETAILS
373300210928                                  FROM WS-NEW-GUAR-BASE-VAL-CUR
373400210928              SUBTRACT GBV-CHANGE OF TRANS-CONTRACT-DETAILS
373500210928                                  FROM WS-NEW-GUAR-BASE-VALUE
373600210928      *** Reduce the Guar Death Value with the current gdv-change
373700210928              SUBTRACT GDV-CHANGE OF TRANS-CONTRACT-DETAILS
373800210928                                  FROM WS-NEW-GUAR-DEATH-VAL-CUR
373900210928              SUBTRACT GDV-CHANGE OF TRANS-CONTRACT-DETAILS
374000210928                                  FROM WS-NEW-GUAR-DEATH-VALUE
374100210928           END-IF.
374200210928
374300210928       RPNG-EXIT.
374400210928           EXIT.
374500210928      * RFS 20516 - End
374600210928
374700210928      /
374800210928       GET-PRIOR-RESET-INFO.
374900210928
375000210928           IF PRIOR-RESET-FLAG NOT = SPACES
375100210928              GO TO GPRI-EXIT
375200210928           END-IF.
375300210928
375400210928           MOVE "N"            TO PRIOR-RESET-FLAG.
375500210928
375600210928           IF PRIOR-RESET-NUMBER = 0
375700210928              GO TO GPRI-EXIT
375800210928           END-IF.
375900210928
376000210928       GPRI-0010.
376100210928
376200210928           MOVE CURR-ACCOUNT-NO
376300210928                               TO ACCOUNT-NO
376400210928                               OF ACCOUNT-CONTRACT-INV-RESET.
376500210928           MOVE CURR-CONTRACT-NO
376600210928                               TO CONTRACT-NO
376700210928                               OF ACCOUNT-CONTRACT-INV-RESET.
376800210928           MOVE CURR-INVESTMENT-CODE
376900210928                               TO INVESTMENT-CODE
377000210928                               OF ACCOUNT-CONTRACT-INV-RESET.
377100210928           MOVE PRIOR-RESET-NUMBER
377200210928                               TO RESET-NUMBER
377300210928                               OF ACCOUNT-CONTRACT-INV-RESET.
377400210928
377500210928           READ ACCOUNT-CONTRACT-INV-RESET
377600210928           INVALID KEY
377700210928             MOVE "05"       TO WS-REJECTION-CODE
377800210928             MOVE PRIOR-RESET-NUMBER
377900210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG
378000210928             MOVE "PRIOR RESET IS NOT FOUND"
378100210928                             TO WS-MISC-INFO-AREA
378200210928             PERFORM LOG-ERROR THRU LER-EXIT
378300210928             GO TO GPRI-EXIT.
378400210928
378500210928       GPRI-0020.
378600210928
378700210928           MOVE CURR-ACCOUNT-NO
378800210928                               TO ACCOUNT-NO
378900210928                               OF ACCOUNT-CONTRACT-RESET.
379000210928           MOVE CURR-CONTRACT-NO
379100210928                               TO CONTRACT-NO
379200210928                               OF ACCOUNT-CONTRACT-RESET.
379300210928           MOVE PRIOR-RESET-NUMBER
379400210928                               TO RESET-NUMBER
379500210928                               OF ACCOUNT-CONTRACT-RESET.
379600210928
379700210928           READ ACCOUNT-CONTRACT-RESET.
379800210928
379900210928           IF REVERSED-DDS OF ACCOUNT-CONTRACT-INV-RESET = "Y" OR
380000210928              RESET-PROCESSED OF ACCOUNT-CONTRACT-INV-RESET NOT = "Y"
380100210928           OR (RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "D" OR "M")
380200210928             PERFORM GET-PRIOR-TO-PRIOR-RESET
380300210928                             THRU GPTP-EXIT
380400210928             GO TO GPRI-EXIT
380500210928           END-IF.
380600210928
380700210928       GPRI-0030.
380800210928
380900210928           IF UNIT-PRICE OF ACCOUNT-CONTRACT-INV-RESET = ZEROS
381000210928             MOVE "05"       TO WS-REJECTION-CODE
381100210928             MOVE PRIOR-RESET-NUMBER
381200210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG
381300210928             MOVE "PRIOR RESET PRICE IS 0"
381400210928                             TO WS-MISC-INFO-AREA
381500210928             PERFORM LOG-ERROR THRU LER-EXIT
381600210928             GO TO GPRI-EXIT
381700210928           END-IF.
381800210928
381900210928           IF EXCHANGE-RATE OF ACCOUNT-CONTRACT-INV-RESET = ZEROS
382000210928             MOVE "06"       TO WS-REJECTION-CODE
382100210928             MOVE PRIOR-RESET-NUMBER
382200210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG
382300210928             MOVE "PRIOR RESET EXCHANGE IS 0"
382400210928                             TO WS-MISC-INFO-AREA
382500210928             PERFORM LOG-ERROR THRU LER-EXIT
382600210928             GO TO GPRI-EXIT
382700210928           END-IF.
382800210928
382900210928       GPRI-0040.
383000210928
383100210928           MOVE "Y"            TO PRIOR-RESET-FLAG,
383200210928                                  PRIOR-RESET-INFO-FLAG.
383300210928           MOVE UNIT-PRICE     OF ACCOUNT-CONTRACT-INV-RESET
383400210928                               TO PRIOR-RESET-UNIT-PRICE.
383500210928           MOVE EXCHANGE-RATE  OF ACCOUNT-CONTRACT-INV-RESET
383600210928                               TO PRIOR-RESET-EXCH-RATE.
383700210928
383800210928       GPRI-EXIT.
383900210928           EXIT.
384000210928
384100210928      /
384200210928       GET-PRIOR-TO-PRIOR-RESET.
384300210928
384400210928           MOVE "N"            TO PRIOR-RESET-FLAG.
384500210928
384600210928           MOVE CURR-ACCOUNT-NO
384700210928                               TO ACCOUNT-NO
384800210928                               OF ACCOUNT-CONTRACT-INV-RESET.
384900210928           MOVE CURR-CONTRACT-NO
385000210928                               TO CONTRACT-NO
385100210928                               OF ACCOUNT-CONTRACT-INV-RESET.
385200210928           MOVE CURR-INVESTMENT-CODE
385300210928                               TO INVESTMENT-CODE
385400210928                               OF ACCOUNT-CONTRACT-INV-RESET.
385500210928           MOVE PRIOR-RESET-NUMBER
385600210928                               TO RESET-NUMBER
385700210928                               OF ACCOUNT-CONTRACT-INV-RESET.
385800210928
385900210928           START ACCOUNT-CONTRACT-INV-RESET
386000210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
386100210928           INVALID KEY
386200210928             GO TO GPTP-EXIT.
386300210928
386400210928       GPTP-0010.
386500210928
386600210928           READ ACCOUNT-CONTRACT-INV-RESET PRIOR RECORD
386700210928           AT END
386800210928             GO TO GPTP-EXIT.
386900210928
387000210928           IF ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
387100210928              CURR-ACCOUNT-NO
387200210928             GO TO GPTP-EXIT
387300210928           END-IF.
387400210928
387500210928           IF CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET NOT =
387600210928              CURR-CONTRACT-NO
387700210928             GO TO GPTP-EXIT
387800210928           END-IF.
387900210928
388000210928           IF INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET NOT =
388100210928              CURR-INVESTMENT-CODE
388200210928             GO TO GPTP-EXIT
388300210928           END-IF.
388400210928
388500210928           IF REVERSED-DDS OF ACCOUNT-CONTRACT-INV-RESET = "Y"
388600210928             GO TO GPTP-0010
388700210928           END-IF.
388800210928
388900210928           IF RESET-PROCESSED OF ACCOUNT-CONTRACT-INV-RESET NOT = "Y"
389000210928             GO TO GPTP-0010
389100210928           END-IF.
389200210928
389300210928       GPTP-0020.
389400210928
389500210928           MOVE CURR-ACCOUNT-NO
389600210928                               TO ACCOUNT-NO
389700210928                               OF ACCOUNT-CONTRACT-RESET.
389800210928           MOVE CURR-CONTRACT-NO
389900210928                               TO CONTRACT-NO
390000210928                               OF ACCOUNT-CONTRACT-RESET.
390100210928           MOVE RESET-NUMBER   OF ACCOUNT-CONTRACT-INV-RESET
390200210928                               TO RESET-NUMBER
390300210928                               OF ACCOUNT-CONTRACT-RESET.
390400210928
390500210928           READ ACCOUNT-CONTRACT-RESET.
390600210928
390700210928           IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = "D" OR "M"
390800210928             GO TO GPTP-0010
390900210928           END-IF.
391000210928
391100210928       GPTP-0030.
391200210928
391300210928           IF UNIT-PRICE OF ACCOUNT-CONTRACT-INV-RESET = ZEROS
391400210928             MOVE "05"       TO WS-REJECTION-CODE
391500210928             MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
391600210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG
391700210928             MOVE "PRIOR RESET PRICE IS 0"
391800210928                             TO WS-MISC-INFO-AREA
391900210928             PERFORM LOG-ERROR THRU LER-EXIT
392000210928             GO TO GPTP-EXIT
392100210928           END-IF.
392200210928
392300210928           IF EXCHANGE-RATE OF ACCOUNT-CONTRACT-INV-RESET = ZEROS
392400210928             MOVE "06"       TO WS-REJECTION-CODE
392500210928             MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
392600210928                             TO RESET-NUMBER OF CONTRACT-ERROR-LOG
392700210928             MOVE "PRIOR RESET EXCHANGE IS 0"
392800210928                             TO WS-MISC-INFO-AREA
392900210928             PERFORM LOG-ERROR THRU LER-EXIT
393000210928             GO TO GPTP-EXIT
393100210928           END-IF.
393200210928
393300210928       GPTP-0040.
393400210928
393500210928           MOVE "Y"            TO PRIOR-RESET-FLAG,
393600210928                                  PRIOR-RESET-INFO-FLAG.
393700210928           MOVE UNIT-PRICE     OF ACCOUNT-CONTRACT-INV-RESET
393800210928                               TO PRIOR-RESET-UNIT-PRICE.
393900210928           MOVE EXCHANGE-RATE  OF ACCOUNT-CONTRACT-INV-RESET
394000210928                               TO PRIOR-RESET-EXCH-RATE.
394100210928
394200210928       GPTP-EXIT.
394300210928           EXIT.
394400210928
394500210928      /
394600210928      *COPY CPYSEGRTNE.
394700210928       COPY CPYSEGRTNC.
394800210928
394900210928      /
395000210928       INIT-ERROR-LOG.
395100210928
395200210928           INITIALIZE MFACTERRP OF CONTRACT-ERROR-LOG.
395300210928
395400210928           MOVE INVESTOR-NO    OF ACCOUNT
395500210928                               TO INVESTOR-NO OF CONTRACT-ERROR-LOG.
395600210928           MOVE CURR-ACCOUNT-NO
395700210928                               TO ACCOUNT-NO OF CONTRACT-ERROR-LOG.
395800210928           MOVE CURR-CONTRACT-NO
395900210928                               TO CONTRACT-NO OF CONTRACT-ERROR-LOG.
396000210928
396100210928           MOVE CURR-INVESTMENT-CODE
396200210928                               TO INVESTMENT-CODE
396300210928                               OF CONTRACT-ERROR-LOG.
396400210928           MOVE CURR-PLACEMENT-DATE
396500210928                               TO PLACEMENT-DATE OF CONTRACT-ERROR-LOG.
396600210928           MOVE CURR-TRANS-NO  TO TRANS-NO OF CONTRACT-ERROR-LOG.
396700210928
396800210928           MOVE COMM-CALLER-ID-CODE TO CALLER-ID-CODE
396900210928                               OF CONTRACT-ERROR-LOG.
397000210928           MOVE PROG-ID-CODE   TO PROGRAM-ID-CODE
397100210928                               OF CONTRACT-ERROR-LOG.
397200210928           MOVE COMM-USER      TO AUDIT-USER OF CONTRACT-ERROR-LOG.
397300210928
397400210928       IEL-EXIT.
397500210928           EXIT.
397600210928
397700210928      /
397800210928       LOG-ERROR.
397900210928
398000210928           IF COMM-REJECTION-CODE = SPACES OR "00"
398100210928             MOVE WS-REJECTION-CODE TO COMM-REJECTION-CODE
398200210928           END-IF.
398300210928
398400210928           ACCEPT WS-SYSTIME-LONG FROM TIME.
398500210928           CALL "GETDAT" USING WS-SYSDATE-N.
398600210928
398700210928           MOVE WS-REJECTION-CODE
398800210928                               TO REJECTION-CODE OF CONTRACT-ERROR-LOG.
398900210928           MOVE WS-MISC-INFO-AREA
399000210928                               TO MISC-INFO OF CONTRACT-ERROR-LOG.
399100210928           MOVE WS-SYSDATE-N   TO AUDIT-DATE OF CONTRACT-ERROR-LOG.
399200210928           MOVE WS-SYSTIME-LONG-N
399300210928                               TO LOG-TIME OF CONTRACT-ERROR-LOG.
399400210928
399500210928           WRITE CONT-ERR-LOG-REC.
399600210928
399700210928           MOVE SPACES         TO WS-MISC-INFO-AREA.
399800210928
399900210928       LER-EXIT.
400000210928           EXIT.
400100210928
400200210928      /
400300210928       COPY CPYEXCLTRN.
400400210928
400500210928      /
400600210928       INITIAL-LOGIC.
400700210928
400800210928           MOVE SPACES       TO COMM-REJECTION-CODE.
400900210928           MOVE LOW-VALUES   TO CURR-CONTROLS
401000210928                                PREV-CONTROLS.
401100210928           INITIALIZE WS-OTHER-VARIABLES.
401200210928
401300210928      * RFS24943 - Begin
401400210928      * Get Edit code for DMCCON ...
401500210928
401600210928           INITIALIZE MFAEDTSCP OF SCREEN-EDITS-ALLOWED-REC
401700210928           MOVE WS-ACCCDTL-SCREEN-CODE TO
401800210928                        SCREEN-CODE OF SCREEN-EDITS-ALLOWED-REC
401900210928           MOVE WS-DMCCON-EDIT-CODE    TO
402000210928                        EDIT-CODE OF SCREEN-EDITS-ALLOWED-REC
402100210928           MOVE WS-DMCCON-LEVEL-CODE   TO
402200210928                        LEVEL-CODE OF SCREEN-EDITS-ALLOWED-REC
402300210928           PERFORM GET-SCREEN-EDITS-ALLOWED
402400210928
402500210928           IF WS-SEA-RETURN-CODE = "00"
402600210928             SET WS-EDIT-DMCCON-YES    TO TRUE
402700210928           END-IF
402800210928
402900210928      * RFS24943 - End
403000210928      *RFS187205 Start
403100210928           INITIALIZE MFAEDTSCP OF SCREEN-EDITS-ALLOWED-REC
403200210928           MOVE "ACCCDTL" TO
403300210928                SCREEN-CODE OF SCREEN-EDITS-ALLOWED-REC
403400210928           MOVE "NGGUAR" TO
403500210928                EDIT-CODE OF SCREEN-EDITS-ALLOWED-REC
403600210928           MOVE "C" TO
403700210928               LEVEL-CODE OF SCREEN-EDITS-ALLOWED-REC
403800210928           SET WS-EDIT-NGGUAR-NO TO TRUE
403900210928           PERFORM GET-SCREEN-EDITS-ALLOWED
404000210928
404100210928           IF WS-SEA-RETURN-CODE = "00"
404200210928              SET WS-EDIT-NGGUAR-YES TO TRUE
404300210928           END-IF
404400210928      *RFS187205 End
404500210928
404600210928
404700210928
404800210928RF8781     OPEN INPUT  EXCHANGE-RATE-M-2
404900210928      * RFS24943 - Begin
405000210928                       TRANS-CONT-DTL-SWI
405100210928      * RFS24943 - End
405200210928RF8781                 TRANS-TARGET
405300210928RF8781                 TRANS-EXCHANGE-RATE-2
405400210928RF9332                 INVESTMENT-SEG
405500210928RF9332                 INVESTMENT-UNIT-PRICE
405600210928RF8092                 ACCOUNT-NOMINEE
405700210928RF8092                 TRANS-OFFSET
405800210928                       TRANS-TARGET-2
405900210928R11255                 ACCOUNT-ATTRIBUTES
406000210928R11255                 EXCLUDE-TRANS
406100210928R11622                 INVESTMENT-UNIT-PRICE-LAST
406200210928R13394                 TRANS-GBV-TRANSFER
406300210928R13306                 SEG-SWITCH-TRF-OPT
406400210928R13306                 TRANS-CONTRACT-TARGET2
406500210928110904                 INVESTMENT-STRUCTURE-XREF
406600210928180708                 TRANS-MISC-DETAILS
406700210928180708                 TRANS-REDEM-DETAILS
406800210928159011                 TRANS-DISTR-DETAILS
406900210928RF8781          I-O    ACCOUNT-CONTRACT-INVEST-SWI
407000210928RF8781                 ACCOUNT-CONTRACT-INVEST.
407100210928
407200210928           IF COMM-OPEN-FILES NOT = "Y" AND
407300210928              OPEN-FILES-ONCE NOT = "Y"
407400210928             GO TO INL-0010
407500210928           END-IF.
407600210928
407700210928           IF COMM-ACTION = "RVS TRADE"
407800210928             OPEN INPUT TRANS
407900210928                        TRANS-R
408000210928           END-IF.
408100210928
408200210928           OPEN INPUT  ACCOUNT
408300210928                       INVESTMENT
408400210928                       TRANS-EXCHANGE-RATE
408500210928                       PROGRAM-EXCHANGE-RATE
408600210928                       EXCHANGE-RATE-M
408700210928                       CURRENCY-CODE
408800210928                       ACCOUNT-CONTRACT-INV-RESET
408900210928                       ACCOUNT-CONTRACT-RESET
409000210928                       TRANS-CONTRACT-DETAILS
409100210928      * RFS24943 - Begin
409200210928                       TRANS-CONTRACT-TARGET
409300210928      * RFS24943 - End
409400210928                I-O    ACCOUNT-CONTRACT-INVESTMENT
409500210928                       TRANS-CON-DTL-PURCHASE
409600210928                       CONTRACT-ERROR-LOG.
409700210928
409800210928           MOVE "N"          TO OPEN-FILES-ONCE.
409900210928
410000210928       INL-0010.
410100210928
410200210928           IF UNITRAX-BASE-CURRENCY   NOT = SPACES AND
410300210928              PROG-EXCHANGE-RATE-TYPE NOT = SPACES
410400210928             GO TO INL-EXIT
410500210928           END-IF.
410600210928
410700210928           PERFORM GET-BASE-CURRENCY
410800210928                             THRU GBC-EXIT.
410900210928
411000210928           PERFORM GET-EXCHANGE-RATE-TYPE
411100210928                             THRU GERT-EXIT.
411200210928
411300210928       INL-EXIT.
411400210928           EXIT.
411500210928
411600210928      * RFS24943 - Begin
411700210928      * ---------------------------------
411800210928       GET-SCREEN-EDITS-ALLOWED.
411900210928      * ---------------------------------
412000210928            CALL "FXSCEDTALW" USING SCREEN-EDITS-ALLOWED-REC,
412100210928                                    WS-SEA-EDIT-SQLLOG,
412200210928                                    WS-SEA-RETURN-CODE.
412300210928      * RFS24943 - End
412400210928
412500210928      /
412600210928       GET-BASE-CURRENCY.
412700210928
412800210928           MOVE LOW-VALUES   TO CURRENCY-DDS OF CURRENCY-CODE.
412900210928
413000210928           START CURRENCY-CODE
413100210928           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
413200210928           INVALID KEY
413300210928             MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
413400210928             GO TO GBC-EXIT.
413500210928
413600210928       GBC-0010.
413700210928
413800210928           READ CURRENCY-CODE NEXT RECORD
413900210928             AT END
414000210928             MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
414100210928             GO TO GBC-EXIT.
414200210928
414300210928           IF BASE-CURRENCY  OF CURRENCY-CODE NOT = "Y"
414400210928             GO TO GBC-0010.
414500210928
414600210928           MOVE CURRENCY-DDS OF CURRENCY-CODE
414700210928                             TO UNITRAX-BASE-CURRENCY.
414800210928
414900210928       GBC-EXIT.
415000210928           EXIT.
415100210928      /
415200210928       GET-EXCHANGE-RATE-TYPE.
415300210928
415400210928           MOVE PROG-ID-CODE TO PROGRAM-CODE
415500210928                             OF PROGRAM-EXCHANGE-RATE.
415600210928           MOVE "DEFAULT"    TO PROGRAM-ACTION
415700210928                             OF PROGRAM-EXCHANGE-RATE.
415800210928
415900210928           READ PROGRAM-EXCHANGE-RATE
416000210928           INVALID KEY
416100210928             MOVE "06"       TO COMM-REJECTION-CODE
416200210928             MOVE HIGH-VALUES TO CURR-CONTROLS
416300210928             GO TO GERT-EXIT.
416400210928
416500210928           MOVE EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
416600210928                             TO PROG-EXCHANGE-RATE-TYPE.
416700210928
416800210928       GERT-EXIT.
416900210928           EXIT.
417000210928      /
417100210928       END-JOB.
417200210928
417300210928RF8781     CLOSE       ACCOUNT-CONTRACT-INVEST-SWI
417400210928      * RFS24943 - Begin
417500210928                       TRANS-CONT-DTL-SWI
41760021092846519 *                TRANS-CONTRACT-TARGET
417700210928      * RFS24943 - End
417800210928R38037                 ACCOUNT-ATTRIBUTES
417900210928R38037                 EXCLUDE-TRANS
418000210928RF8781                 EXCHANGE-RATE-M-2
418100210928RF8781                 TRANS-TARGET
418200210928RF9332                 INVESTMENT-SEG
418300210928RF9332                 INVESTMENT-UNIT-PRICE
418400210928RF8781                 TRANS-EXCHANGE-RATE-2
418500210928                       ACCOUNT-NOMINEE
418600210928                       TRANS-OFFSET
418700210928                       TRANS-TARGET-2
418800210928R11622                 INVESTMENT-UNIT-PRICE-LAST
418900210928R12702                 ACCOUNT-CONTRACT-INVEST
419000210928R13394                 TRANS-GBV-TRANSFER
419100210928                       SEG-SWITCH-TRF-OPT
419200210928110904                 INVESTMENT-STRUCTURE-XREF
419300210928180708                 TRANS-MISC-DETAILS
419400210928180708                 TRANS-REDEM-DETAILS
419500210928159011                 TRANS-DISTR-DETAILS
419600210928                       TRANS-CONTRACT-TARGET2.
419700210928
419800210928      * RFS49699 - Begin
419900210928
420000210928           MOVE "LOGARR"               to Pass-Screen-Code.
420100210928           MOVE "LOGARR"               to Pass-Edit-Code.
420200210928           MOVE "N"                    to Pass-Level-Code.
420300210928
420400210928           call "FXSCEDTAL1" using Pass-Screen-Code
420500210928                                   Pass-Edit-Code
420600210928                                   Pass-Level-Code
420700210928                                   Retn-Edit-Allowed-Flag.
420800210928
420900210928           cancel "FXSCEDTAL1".
421000210928
421100210928           IF Retn-Edit-Allowed
421200210928               PERFORM ARRAY-LOGGING     THRU ARL-EXIT
421300210928           END-IF.
421400210928
421500210928      * RFS49699 - End
421600210928
421700210928       EOJ-EXIT.
421800210928           EXIT.
421900210928      * RFS49699 - Begin call array logging if on!
422000210928
422100210928       ARRAY-LOGGING.
422200210928
422300210928           MOVE "SEGRVSTRNV"           TO  pp-Program-Name.
422400210928
422500210928           MOVE WS-ARRAY1-NAME         TO  pp-Array-Name.
422600210928           SET  WS-ARR-ACCCIP          TO  TRUE.
422700210928           MOVE WS-FXLOGAT             TO  pp-Array-Edit-Code.
422800210928           MOVE WS-ARRAY1-MAX          TO  pp-Max-Size.
422900210928           MOVE WS-ARRAY1-MAX-USED     TO  pp-Max-Size-Used.
423000210928           MOVE SPACES                 TO  rp-Err-Flag.
423100210928
423200210928           CALL "FXLOGAU"      using PR-FXLOGAU.
423300210928
423400210928           CANCEL "FXLOGAU".
423500210928
423600210928       ARL-EXIT.
423700210928           EXIT.
423800210928
423900210928      * RFS49699 - End
424000210928      *RFS159011 - STARTS
424100210928       FETCH-DISTRIBUTION-TYPE.
424200210928           MOVE PLACEMENT-DATE OF TRANS TO
424300210928                PLACEMENT-DATE OF TRANS-DISTR-DETAILS
424400210928           MOVE TRANS-NO OF TRANS TO
424500210928                TRANS-NO OF TRANS-DISTR-DETAILS
424600210928           READ TRANS-DISTR-DETAILS
424700210928167725*      AT END
424800210928167725       INVALID KEY
424900210928                MOVE SPACES to lc_DistrOptionCode
425000210928167725*      NOT AT END
425100210928167725       NOT INVALID KEY
425200210928                MOVE DISTR-OPTION-CODE OF TRANS-DISTR-DETAILS
425300210928                            TO lc_DistrOptionCode
425400210928           END-READ.
425500210928      *RFS159011 - ENDS
425600210928
