000100990615     /***************************************************************/
000200990615
000300011206     A          R SFR26SUM
000400011206     A            F0000          3A         ALIAS(TYPE_OF_DATA)
000500011206
000600011206     A            F0001         10A         ALIAS(TRUST_ID_NO)
000700011206
000800011206     A            F0002          2A         ALIAS(TYPE_OF_FILE)
000900011206
001000011206     A            F0003          4A         ALIAS(TRUST_FILE_NO)
001100011206
001200011206     A            F0004          4S         ALIAS(TAX_YEAR)
001300011206
001400011206     A            F0005          9A         ALIAS(FILLER_9)
001500011206
001600011206     A            F0006          9S         ALIAS(TOTAL_SLIPS)
001700011206
001800011217     A            F0007         60A         ALIAS(PAYER_NAME)
001900011206
002000011217     A            F0008          1A         ALIAS(FILLER_1)
002100011206
002200011217     A            F0009         30A         ALIAS(PAYER_ADDR1)
002300011206
002400011217     A            F0010         30A         ALIAS(PAYER_ADDR2)
002500011206
002600011217     A            F0011         30A         ALIAS(PAYER_CITY)
002700011206
002800011217     A            F0012         20A         ALIAS(PAYER_PROV_CNTRY)
002900011206
003000011217     A            F0013          6A         ALIAS(PAYER_POSTAL)
003100011206
003200011217     A            F0014         10A         ALIAS(QC_ENTERPRISE_NO)
003300011206
003400011217     A            F0015         12A         ALIAS(FILLER_12)
003500011206
003600011221     A            F0016         15S 2       ALIAS(TOT_AMT_PAID)
003700011206
003800011221     A            F0017         15S 2       ALIAS(TOT_CREDIT_AMT)
003900011206
004000181121     A            F0018         15S 2       ALIAS(TOT_REDEM_AMT)
004100011206
004200011217     A            F0019         15A         ALIAS(FILLER_15)
004300011206
004400011221     A            F0020         15S 2       ALIAS(SPECIAL_INC)
004500011206
004601181119     A            F0021         15A         ALIAS(FILLER_16)
004602181119
004603181119     A            F0022         15S 2       ALIAS(TOT_BOXD_AMT)
004604181119
004606181119     A            F0023         15A         ALIAS(FILLER_17)
004607181119
004608181119     A            F0024         15S 2       ALIAS(BOX_G_TAX)
004700011206
004701181119     A            F0025        195A         ALIAS(FILLER_195)
