000100170721      * %ATTR DBGVIEW(*SOURCE)
000200170721       IDENTIFICATION DIVISION.
00030017072140800 *PROGRAM-ID.    SRVCALC2.
00040017072140800  PROGRAM-ID.    SRVTRAPP.
000500170721       AUTHOR.        JEWELSTONE SYSTEMS INC.
000600170721       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000700170721       DATE-WRITTEN.  SEPTEMBER 1994.
000800180921       DATE-COMPILED.
000900170721      *******************************************************************
001000170721      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE
001100170721      *******************************************************************
001200170721      * Reece Tam  * 1996/07/18   * Copy from SRVCALC for rewritting.
001300170721      * Daisy Ly   * 1999/02/03   * RFS# 4550
001400170721      *            *              *  Expand the WS-DI-RATES-ENTRY from
001500170721      *            *              *   20000 to 25000
001600170721      * Daisy Ly   * 1999/10/28   * RFS 5772 - Expand the INVESTMENT
001700170721      *            *              *  array from 300 to 400  and
001800170721      *            *              *  WS-DI-RATES-ENTRY to
001900170721      *            *              *    from 25000 to 30000
002000170721      * Daisy Ly   * 1999/11/04   * RFS 5779 - only load investment
002100170721      *            *              *  if TRAILER-SCHEDULE-CODE not equal
002200170721      *            *              *  to " " to investment array
002300170721      * T HAMID    * 1999/11/29   * RFS 5492 - Calculate Dealer service
002400170721      *            *              * fee only if the frequency corr to
002500170721      *            *              * the frequency passed.
002600170721      * Dino Dervic* 2000/06/19   * RFS 7280 - Add COPY DRLEAPLS, CALL
002700170721      *                           * "DRLEAP" ..., 88 level field
002800170721      *                           * IS-LEAP-YEAR and related code. Add
002900170721      *                           * MOVE WS-BEGIN-YY TO DLP-YEAR.
003000170721      * B Mitchell * 2001/01/15   * RFS 6780 - To add new 6 char
003100170721      *            *              * dealer-rep-code processing.
003200170721      *            *  RFS 9300    * RFS# 9300 Changes were also applied
003300170721      *            *              * in this RFS that were to increase
003400170721      *            *              * all referneces to investment-code
003500170721      *            *              * to 700.
003600170721      * Lev        * 2001/08/13   * RFS10040 - Recompile,
003700170721      *            *              * New fields in DEALER-COMMISSIONS
003800170721      * Reece Tam  * 2001/09/18   * RFS10664 - Add daily accrual.
003900170721      *            *              * RFS10953 - Skip output of Trailer
004000170721      *            *              * Payment rec if Edit Code SRVZRO
004100170721      *            *              * exists and trailer rate is zero.
004200170721      * R MIGUEL   * 2002/03/25   * RFS 13374 - INCREASE ARRAY SIZE
004300170721      *            *              * OF INVESTMENT TO 1000.
004400170721      ******************************************************************
004500170721      * T Punzalan *  2002/06/13  *13895*- recompiled, changed        *
004600170721      *            *              *     *  TRAILER-PAYMENT format     *
004700170721      ******************************************************************
004800170721      * Daisy Ly   * 2003/06/10   * rfs 17743 - recompile for
004900170721      *            *              * investment-trailer-schedule
005000170721      *            *              *   (MFAINVTSP)
005100170721      *---------------------------------------------------------------*
005200170721      * Ernesto S. * 2004/04/15   * RFS 18615 - Compute the Average   *
005300170721      *            *              * Assets by summing up the Daily    *
005400170721      *            *              * Value Actual for each day within  *
005500170721      *            *              * the period and divide it by the   *
005600170721      *            *              * number of days in that period and *
005700170721      *            *              * populate the new Average-Assets   *
005800170721      *            *              * field of TRAILER-PAYMENT record.  *
005900170721      *---------------------------------------------------------------*
006000170721      * Bud Kovacs * 2004/04/16   * RFS-21886 - Recompile only        *
006100170721      * Bud Kovacs * 2004/05/10   * RFS-21203 - Addition of Split
006200170721      *            *              *  Service Fees by Rep
006300170721      *            *              * - Addition call to Screen Edits
006400170721      *            *              *  Allowed "CAPFEE'
006500170721      *            *              * - Bypass processing of dealer when
006600170721      *            *              *  comm-bonus source = "E" and
006700170721      *            *              *  screen edit code "DLRSPT is found
006800170721      * Daisy Ly   * 2004/06/08   * RFS-22684 - Recompile only
006900170721      ************** RE-APPLY 19162
007000170721      * Daisy Ly   * 2004/11/07   * RFS 19162 - Add Tiered Trailer Fee nt
007100170721      *            *              * Functionality.
007200170721      *            * 2004/12/01   * fix rounding issues for MFATRAVP   nt
007300170721      *            *              * and MFATRAPP
007400170721      *            * 2005/01/26   * rfs 26386 - not use the formual    nt
007500170721      *            *              *  new = fix + variabe if investment
007600170721      *            *              * not setup for tiered trailer fee
007700170721      *****************************************************************
007800170721      * L. Wong    * 2005/03/16   * RFS 26845 - Bug Fix (RFS 21203)
007900170721      *            *              * Service Fee payments generated for
008000170721      *            *              * dealers with COMM-BONUS-SOURCE ="E"
008100170721      *            *              * when it shouldn't.
008200170721      * Fatema Haji* 2005/02/02   * RFS 26108 - Incorrect varible rate
008300170721      *            *              * is being displayed DELSFVST and
008400170721      *            *              * DERSFVST screens.
008500170721      * Fatima Y.  * 2005/03/29   * RFS 25827 - Correct Rounding issues
008600170721      *            *              * on DELSFLST and DERSFLST screens.
008700170721      * Reece Tam  * 2005/05/16   * RFS 25827 - Correct logic and fix
008800170721      *            *              * rounding for variable assets.
008900170721      * Reece Tam  * 2005/05/26   * RFS 25827 - fix rounding for
009000170721      *            *              * variable assets so that DELSFVST
009100170721      *            *              * and DELSFLST, and DERSFVST and
009200170721      *            *              * DERSFLST screens can reconcile.
009300170721      * Reece Tam  * 2005/07/25   * RFS 28871 - Add client IAF for
009400170721      *            *              * grandfather.
009500170721      * Z. Ahmed   * 2005/09/16   * RFS 29586 - Add client GWD for
009600170721      *            *              * grandfather.
009700170721      * F.Haji     * 2005/12/15   * RFS 29449 - Correct the Average
009800170721      *            *              * Assets for quarterly dealers.
009900170721      * P.Anielski * 2005/03/16   * RFS 33507 - Correct the Average
010000170721      *            *              * Assets for quarterly and monthly
010100170721      *            *              * dealers. Introduces new variable
010200170721      *            *              * Ws-Set-Days. This variable keeps
010300170721      *            *              * # of days caculated by the program
010400170721      *            *              * and will be used when dealer is not
010500170721      *            *              * calculated quarterly
010600170721      * Richard S  * 2007/06/08   * RFS 42554 - Recompile only
010700170721      * Kahkashan P* 2007/01/02   * RFS 37142 - update the distributionnt
010800170721      *            *              * variable units in mfadeadvp for
010900170721      *            *              * client with edit code 'DSTVAR'
011000170721      *            *              * setup
011100170721      *            *              * Fix compile with serverity > 10
011200170721      * Ade A      * 2007/03/20   * RFS 37142 tierd trailer fee
011300170721      * Ade A      * 2007/04/25   * RFs 40128 . Fix the MFATRAPP
011400170721      *            *              * Quarterly Average Assets issue
011500170721      * Emma. Yala * 2008/01/15   * RFS47438 - Recompile only
011600170721      *            *              *  - Initialize Dead & Trap files
011700170721      * Frank Hong * 2008/04/06   * RFS40800.
011800170721      *            *              * This program replaces SRVCALC2.
011900170721      * Richard S  * 2008/04/22   * RFS51370.
012000170721      *            *              * Payout regular/standard units even
012100170721      *            *              * if eligible-for-payment = 'N'
012200170721      *            *              * because of daily threshold not met.
012300170721      * Emma. Yala * 2008/04/28   * RFS50587 - Calculate average assets
012400170721      *            *              * even if the trailer rate is 0%
012500170721      * Richard S  * 2008/05/12   * RFS51999.
012600170721      *            *              * Fix logic in bypassing E dealers.
012700170721      * Emma. Yala * 2008/07/10   * RFS52545 - Bug: Tiered Srv fee not
012800170721      *            *              * generated for variable rate when
012900170721      *            *              * sched is attached to fix rate of 0
013000170721      * Waldi R.   * 2009/01/07   * RFS60213 - Recalculate market value
013100170721      *            *              * buckets for the records where the
013200170721      *            *              * price was not available at the time
013300170721      *            *              * when SRVDAILY generated them.
013400170721      * Brad Doyle * 2009/02/26   * RFS64445 - Correct array overflow
013500170721      * Tony Pallie* 2009/03/12   * RFS64527 Increase Array Size
013600170721      *            *              * Investment Accrual Entry
013700170721      * Meynard B  * 2009/02/26   * RFS68287 - Reinstate RFS64445 changes
013800170721      * Meynard B  * 2009/05/13   * RFS50475 - Override Trailer-Sched-Code
013900170721      *            *              * with code from Dealer-Invest-Serv-Fee
014000170721      * Meynard B  * 2009/06/11   * RFS50475.8 - Handle case where no Trailer
014100170721      *            *              * Schedule Code override exist for Dealer/
014200170721      *            *              * Investment. Retain code on record.
014300170721      * Abdi Hassan* 2009/12/18   * RFS67590 - Recompile for MFAIVNVTVP
014400170721      *            *              * table expansion
014500170721      * Waldi R.   * 2011/03/28   * RFS94351 - Recompile only
014600170721      *            *              *
014700170721      * Rekha      * 2011/04/08   * RFS91255 - generate service fee
014800170721      *            *              * at the investment level and a new
014900170721      *            *              * level account-no is added to the
015000170721      *            *              * program
015100170721      * Lev O.     * 2013/01/07   * RFS115839 - Increase Array Size
015200170721      *            *              * upto 210000.
015300170721      * Ashmitha   * 2013/03/14   * RFS120000:
015400170721      *            *              * Recompile for MFATRSCDP file
015500170721      *            *              * changes.
015600170721      * Vinsfy J.  * 2013/03/15   * RFS112945 - Trailer commissions.
015700170721      * Andy Chan  * 2013/08/09   * RFS125759 - Fix more than 1 roll issue
015800170721      * Praveen E  * 2013/10/31   * RFS129430 - Fixed-Currency field not
015900170721      *            *              * Populated in the account Trailer fee
016000170721      *            *              * Table
016100170721      * Kiruthika  * 2014/09/24   * RFS139475 - JOBSRVFEE in Message
016200170721      * Rajendran  *              * Wait on: UATITO3
016300170721      * Sushmita J * 2014/10/16   * RFS141635 - Recompile for MFADEADVP.
016400170721      * Kamal T    * 2014/10/31   * RFS130093 - Modifications to tiered
016500170721      *            *              * trailer functionality to accrue at
016600170721      *            *              * the account investment level
016700170721      * Kamal T    * 2015/03/02   * RFS145455 - Incorrect assets when Rep
016800170721      *            *              * change occurs within accrual period
016900170721      * Kamal T    * 2015/04/01   * RFS146447 - Modified logic for tiered
017000170721      *            *              * and grandfathered assets to capture
017100170721      *            *              * corrrect AUM in MFATRAPAP
017200170721      * Manjusha V * 2015/05/08   * RFS146251 Recompile for MFATRAPAP
017300170721      *            *              * and MFADEADSP.
017400170721      * Manjusha V   * 2015/04/27 * RFS145730 ESG25 - Modify to capture
017500170721      *              *            * Dealer-Account-No in MFADEADSP
017600170721      *              *            * and MFATRAPAP.
017700170721      * Phil C     * 2015/06/10   * RFS148182 - Increase array field size
017800170721      *                           * from 4 to 5 to load entire array.
017900170721      * Arthy K    * 2016/02/03   * RFS154537 - Fix for LSP and SSP file
018000170721      *                           * discrepancies.
018100170721      * Kamal T    * 2016/03/07   * RFS152311 - Performace tuning of
018200170721      *            *              *             JOBSRVFEE
018300170721      * Vinsfy J   * 2016/05/30   * RFS160162 - Discrepancy in TRAPP and
018400170721      *            *              * TRAPAP.
018500170721      * Emmanuel Y * 2016/07/14   * RFS160475- Align also GF Amts SS/LSd
018600170721      * Emmanuel Y * 2016/08/17   * RFS162565- Align also Var amounts  d
018700170721      *            *              * when applicable                    d
018800170721      * Vinsfy J   * 2016/12/12   * RFS161783 - Inactive funds shows up
018900170721      *            *              * with assets in trailer payment.
019000170721      * Arthy K    * 2017/02/01   * RFS164537 - Recompile for MFAINVTSP*
019100170721      * Arthy K    * 2017/04/24   * RFS167811 - Trailer fee calculation
019200170721      *            *              * based on Prorated basis
019300170721      * Arthy K    * 2017/07/05   * RFS169622 - Fix for Service fee amount
019400170721      *            *              * for period of investment in an account
019500170721      *            *              * reported negative.
019600170721      * Janapriya J* 2017/07/17   * RFS168505-Service Fee Report had
019700170721      *            *              * incorrect values for the Number of
019800170721      *            *              * Accounts column.
019900170918      * Aarthi M   * 2017/09/18   * RFS173261 - Fix Assets in TRAILER
020000170918      *            *              * ACCOUNT.
020100171121      * Aarthi M   * 2017/11/09   * RFS173258 - Account Level Service Fee
020200171121      *            *              * calculated for a Rep is incorrect.
020300180410      * Lavanya V  * 2018/04/10   * RFS1002037 Recompile Only
020400180912      * Gomathi S  * 2018/09/12   * RFS1003172 - Discrepancy on variable
020500180912      *            *              * Assests calculation thru the trailer
020600181026      *            *              * fees being paid.
020700200522      * Arthy K    * 2020/05/22   * RFS1081324 - Fix for INTER-TERM file
020800200717      *            *              * generated with no records
020900200727      * Mayilsamy D* 2020/07/13   * RFS185175 - Modified to support
021000200718      *            *              * Trailer Fees calculation based on
021100200718      *            *              * calendar years.
021200210120      * Jebastin  S* 2021/01/20   * RFS1021251- Adjust dealer payment
021300210120      *            *              * of last account if last account not
021400210129      *            *              * enough to cover NEgative adjustment
021500210510      * Jebastin  S* 2021/05/10   * RFS1113297- Fix for MFAINVTVP.
021501211019      * Aarthi M   * 2021/10/11   * RFS1115236 - Service Fee not paid
021502211019      *            *              * under specific conditions.
021503211019      *            *              * if the last Dealer/Rep/Investment
021504211019      *            *              * only has one Account & Investment
021505211019      *            *              * is setup with a holding period
021506211019      *            *              * schedule code.
021600170721      *****************************************************************
021700170721       ENVIRONMENT DIVISION.
021800170721       CONFIGURATION SECTION.
021900170721       SOURCE-COMPUTER. IBM-AS400.
022000170721       OBJECT-COMPUTER. IBM-AS400.
022100170721       SPECIAL-NAMES. LOCAL-DATA IS WS-LOCAL
022200170721D19162*40800          DATA-AREA IS WS-DTAARA-MFACMPCDP
02230020060540800                 DATA-AREA IS WS-DTAARA-MFASFPARM.
022400170721      /
022500170721       INPUT-OUTPUT SECTION.
022600170721       FILE-CONTROL.
022700170721
022800170721           SELECT  DEALER-REP-DLY-SRV-FEE
022900170721                   ASSIGN TO DATABASE-MFADEADSP
023000170721                   ORGANIZATION IS INDEXED
023100170721                   ACCESS IS DYNAMIC
023200170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023300170721
023400170721           SELECT  INVESTMENT
023500170721                   ASSIGN TO DATABASE-MFAINVP
023600170721                   ORGANIZATION IS INDEXED
023700170721                   ACCESS IS DYNAMIC
023800170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023900170721
024000170721           SELECT  INVESTMENT-TRAILER-SCHEDULE
024100170721                   ASSIGN TO DATABASE-MFAINVTSP
024200170721                   ORGANIZATION IS INDEXED
024300170721                   ACCESS IS DYNAMIC
024400170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024500170721
024600170721           SELECT  TRAILER-RATE-SCHEDULE
024700170721                   ASSIGN TO DATABASE-MFATRSCDP
024800170721                   ORGANIZATION IS INDEXED
024900170721                   ACCESS IS DYNAMIC
025000170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025100170721
025200170721           SELECT  TRAILER-PAYMENT
025300170721                   ASSIGN TO DATABASE-MFATRAPP
025400170721                   ORGANIZATION IS INDEXED
025500170721                   ACCESS IS DYNAMIC
025600170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
025700170721
025800170721           SELECT  DEALER-INVEST-SERVICE-FEE
025900170721                   ASSIGN TO DATABASE-MFADEAISP
026000170721                   ORGANIZATION IS INDEXED
026100170721                   ACCESS IS DYNAMIC
026200170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
026300170721
026400170721           SELECT  DEALER-COMMISSIONS
026500170721                   ASSIGN TO DATABASE-MFADEACMP
026600170721                   ORGANIZATION IS INDEXED
026700170721                   ACCESS IS DYNAMIC
026800170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
026900170721                   FILE STATUS IS WS-FILE-STATUS.
027000170721
027100170721R10953     SELECT  SCREEN-EDITS-ALLOWED
027200170721R10953             ASSIGN TO DATABASE-MFAEDTSCP
027300170721R10953             ORGANIZATION IS INDEXED
027400170721R10953             ACCESS IS DYNAMIC
027500170721R10953             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
027600170721R10953             FILE STATUS IS WS-FILE-STATUS.
027700170721R10953
027800170721
027900170721D19162     SELECT  INVESTMENT-TRAILER-VAR-SCHED
028000170721  ¦                ASSIGN TO DATABASE-MFAINVTVP
028100170721  ¦                ORGANIZATION IS INDEXED
028200170721  ¦                ACCESS IS DYNAMIC
028300170721  ¦                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
028400170721  ¦                FILE STATUS IS WS-FILE-STATUS.
028500170721  ¦
028600170721D19162     SELECT  TRAILER-RATE-VAR-SCHEDULE
028700170721D19162             ASSIGN TO DATABASE-MFATRSCVP
028800170721D19162             ORGANIZATION IS INDEXED
028900170721D19162             ACCESS IS DYNAMIC
029000170721D19162             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
029100170721  ¦                FILE STATUS IS WS-FILE-STATUS.
029200170721  ¦
029300170721D19162     SELECT  DEALER-REP-DLY-SRV-VAR
029400170721  ¦                ASSIGN TO DATABASE-MFADEADVP
029500170721  ¦                ORGANIZATION IS INDEXED
029600170721  ¦                ACCESS IS DYNAMIC
029700170721  ¦                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
029800170721  ¦                FILE STATUS IS WS-FILE-STATUS.
029900170721  ¦
030000170721  ¦        SELECT  TRAILER-PAYMENT-VAR
030100170721  ¦                ASSIGN TO DATABASE-MFATRAVP
030200170721  ¦                ORGANIZATION IS INDEXED
030300170721  ¦                ACCESS IS DYNAMIC
030400170721  ¦                RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
030500170721D19162             FILE STATUS IS WS-FILE-STATUS.
030600170721
030700170721R10664     SELECT  SRV-FEE-EXTRACT
030800170721R10664             ASSIGN TO DATABASE-SRVPSELP
030900170721R10664             ORGANIZATION IS INDEXED
031000170721R10664             ACCESS IS DYNAMIC
031100170721R10664             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
031200170721R10664             FILE STATUS IS WS-FILE-STATUS.
031300170721R10664
031400170721      ** RFS 60213 - begins.
031500170721           SELECT  INVESTMENT-UNIT-PRICE
031600170721                   ASSIGN TO DATABASE-MFAINVUPLB
031700170721                   ORGANIZATION IS INDEXED
031800170721                   ACCESS IS DYNAMIC
031900170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
032000170721                   WITH DUPLICATES.
032100170721      ** RFS 60213 - ends.
032200170721
032300170721      /
032400170721      * RFS91255 - Start
032500170721           SELECT  TRAILER-ACCOUNT-PAYMENT
032600170721                   ASSIGN TO DATABASE-MFATRAPAP
032700170721                   ORGANIZATION IS INDEXED
032800170721                   ACCESS IS DYNAMIC
032900170721                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
033000170721      * RFS91255 - End
033100170721      /
033200170721       DATA DIVISION.
033300170721       FILE SECTION.
033400170721       FD  DEALER-REP-DLY-SRV-FEE
033500170721           LABEL RECORDS ARE STANDARD.
033600170721       01  DEALER-REP-DLY-SRV-FEE-REC.
033700170721                                  COPY DD-ALL-FORMATS OF MFADEADSP.
033800170721      /
033900170721       FD  INVESTMENT
034000170721           LABEL RECORDS ARE STANDARD.
034100170721       01  IVS-REC.               COPY DD-ALL-FORMATS OF MFAINVP.
034200170721      /
034300170721       FD  INVESTMENT-TRAILER-SCHEDULE
034400170721           LABEL RECORDS ARE STANDARD.
034500170721       01  ITS-REC.               COPY DD-ALL-FORMATS OF MFAINVTSP.
034600170721      /
034700170721       FD  TRAILER-RATE-SCHEDULE
034800170721           LABEL RECORDS ARE STANDARD.
034900170721       01  TRS-REC.               COPY DD-ALL-FORMATS OF MFATRSCDP.
035000170721      /
035100170721       FD  TRAILER-PAYMENT
035200170721           LABEL RECORDS ARE STANDARD.
035300170721       01  TRAILER-REC.           COPY DD-ALL-FORMATS OF MFATRAPP.
035400170721      /
035500170721       FD  DEALER-INVEST-SERVICE-FEE
035600170721           LABEL RECORDS ARE STANDARD.
035700170721       01  DISF-REC.              COPY DD-ALL-FORMATS OF MFADEAISP.
035800170721      /
035900170721       FD  DEALER-COMMISSIONS
036000170721           LABEL RECORDS ARE STANDARD.
036100170721       01  DEALER-COMMISSIONS-REC. COPY DD-ALL-FORMATS OF MFADEACMP.
036200170721      /
036300170721R10953 FD  SCREEN-EDITS-ALLOWED
036400170721R10953     LABEL RECORDS ARE STANDARD.
036500170721R10953 01  SCREEN-EDITS-ALLOWED-REC.
036600170721R10953                             COPY DD-ALL-FORMATS OF MFAEDTSCP.
036700170721      /
036800170721D19162 FD  INVESTMENT-TRAILER-VAR-SCHED
036900170721  ¦        LABEL RECORDS ARE STANDARD.
037000170721  ¦    01  INVEST-TRAILER-VAR-SCHED-REC.
037100170721  ¦               COPY DD-ALL-FORMATS OF MFAINVTVP.
037200170721      /
037300170721D19162 FD  TRAILER-RATE-VAR-SCHEDULE
037400170721D19162     LABEL RECORDS ARE STANDARD.
037500170721D19162 01  TRAILER-RATE-VAR-SCHEDULE-REC.
037600170721                      COPY DD-ALL-FORMATS OF MFATRSCVP.
037700170721  ¦   /
037800170721  ¦    FD  DEALER-REP-DLY-SRV-VAR
037900170721  ¦        LABEL RECORDS ARE STANDARD.
038000170721  ¦    01  DEALER-REP-DLY-SRV-VAR-REC.
038100170721  ¦           COPY DD-ALL-FORMATS OF MFADEADVP.
038200170721  ¦   /
038300170721  ¦    FD  TRAILER-PAYMENT-VAR
038400170721  ¦        LABEL RECORDS ARE STANDARD.
038500170721D19162 01  TRL-PAY-VAR-REC.         COPY DD-ALL-FORMATS OF MFATRAVP.
038600170721      /
038700170721R10664 FD  SRV-FEE-EXTRACT
038800170721R10664     LABEL RECORDS ARE STANDARD.
038900170721R10664 01  SRV-FEE-EXTRACT-REC.
039000170721R10664                            COPY DD-ALL-FORMATS OF MFADEADSP.
039100170721R10664/
039200170721      ** RFS 60213 - begins.
039300170721       FD  INVESTMENT-UNIT-PRICE
039400170721           LABEL RECORDS ARE STANDARD.
039500170721       01  IUP-REC.               COPY DD-ALL-FORMATS OF MFAINVUPLB.
039600170721      /
039700170721      ** RFS 60213 - ends.
039800170721
039900170721      * RFS91255 - Start
040000170721        FD  TRAILER-ACCOUNT-PAYMENT
040100170721            LABEL RECORDS ARE STANDARD.
040200170721        01  TRAILER-ACCOUNT-REC.   COPY DD-ALL-FORMATS OF MFATRAPAP.
040300170721      * RFS91255 - End
040400170721
040500170721       WORKING-STORAGE SECTION.
040600170721
040700170721       01  CURR-CONTROLS.
040800170721          03 CURR-LEVEL1.
040900170721      * RFS91255 - Start
041000170721            04 CURR-LEVEL2.
041100170721               05 CURR-LEVEL3.
041200170721                 06 CURR-DEALER-CODE       PIC X(4).
041300170721                 06 CURR-REP-CODE          PIC X(6).
041400170721               05 CURR-INVESTMENT-CODE     PIC X(5).
041500170721            04 CURR-ACCOUNT-NO             PIC S9(9).
041600170721      * RFS91255 - End
041700170721145730 01  CURR-DEALER-ACCOUNT-NO           PIC X(15).
041800170721
041900170721       01  PREV-CONTROLS.
042000170721          03 PREV-LEVEL1.
042100170721      * RFS91255 - Start
042200170721            04 PREV-LEVEL2.
042300170721               05 PREV-LEVEL3.
042400170721                 06 PREV-DEALER-CODE      PIC X(4).
042500170721                 06 PREV-REP-CODE         PIC X(6).
042600170721               05 PREV-INVESTMENT-CODE    PIC X(5).
042700170721            04 PREV-ACCOUNT-NO            PIC S9(9).
042800170721      * RFS91255 - End
042900170721145730 01  PREV-DEALER-ACCOUNT-NO           PIC X(15).
043000170721
043100170721       COPY DRLEAPLS.
043200170721
043300170721       01  WS-MISC-FIELDS.
043400170721           05 WS-FILE-STATUS         PIC XX.
043500170721           05 WS-DLR-CODE            PIC X(4) VALUE SPACES.
043600170721           05 WS-PROCESS-DEALER      PIC X(1)        VALUE "Y".
043700170721           05 WS-LAST-DATE-PROCESS   PIC X(1)        VALUE "Y".
043800170721           05 WS-DLY-TRAILER         PIC 9(9)V999999 VALUE 0 COMP-3.
04390017072140800      05 WS-DLY-TRAILER-GF      PIC 9(9)V999999 VALUE 0 COMP-3.
044000170721           05 WS-DLY-STRAILER        PIC 9(9)V999999 VALUE 0 COMP-3.
044100170721           05 WS-TOT-TRAILER         PIC 9(9)V999999 VALUE 0 COMP-3.
044200170721           05 WS-TOT-STRAILER        PIC 9(9)V999999 VALUE 0 COMP-3.
044300170721           05 WS-FIRST-READ-SW       PIC X(1)        VALUE "Y".
044400170721           05 WS-DEALER-LEVEL-RATES
044500170721                                     PIC X(1)        VALUE "N".
044600170721           05 WS-REWRITE-DLY-SRV-FEE PIC X(1).
044700170721      *RFS-21203 - Begin
044800170721           05 WS-BYPASS-DEALER           PIC X(1)   VALUE "N".
044900170721      *RFS-21203 - End
045000170721      * RFS18615 - Start
045100170721           05 WS-DAYS                PIC S9(8) COMP-3.
045200170721           05 WS-FILE-STATUS-FILE    PIC X(20).
045300170721           05 WS-ERROR-LINE          PIC X(80).
04540017072140800 *    05 WS-PROGRAM-ID-CODE     PIC X(10) VALUE "SRVCALC2".
04550017072140800      05 WS-PROGRAM-ID-CODE     PIC X(10) VALUE "SRVTRAPP".
045600170721r29449     05 Ws-Qtr-Days            PIC S9(8) COMP-3.
045700170721r33507     05 Ws-Set-Days            PIC S9(8) COMP-3.
045800170721           05 Ws-time                PIC S9(8) VALUE 0.
045900170721 37142     05 lc_SqlErrStatement     PIC X(25)   VALUE " ".
04600017072140800      05 WS-DI-TRAIL-RATE       PIC 9(4)V99999.
04610017072140800      05 WS-IA-TRAIL-RATE       PIC 9(4)V99999.
04620017072140800      05 lc_MFASFPARM.
04630017072140800         07  FILLER             PIC X(19) VALUE SPACE.
04640017072140800         07  lc_GrandFatherFlag PIC X(01).
04650017072140800             88 Ws-GrandFather-Client VALUE "G".
04660017072150475a     05 lc_DealerCode          PIC X(04) VALUE SPACE.
04670017072150475a     05 lc_InvestmentCode      PIC X(05) VALUE SPACE.
04680017072150475a     05 lc_TrailerSchedCode    PIC X(04) VALUE SPACE.
046900170721      *RFS91255 - Start
047000170721           05 PREV-DAILY-VALUE-ACTUAL PIC 9(9)V999999 VALUE 0 COMP-3.
047100170721           05 PREV-DAILY-VALUE-ACTUAL-GF PIC 9(9)V999999 VALUE 0
047200170721                                                     COMP-3.
047300170721           05 PREV-UNITS             PIC 9(10)V999 VALUE 0 COMP-3.
047400170721      *RFS112945 - Begin
047500170721           05  lc_DiDlrCode          PIC X(04) VALUE SPACE.
047600170721           05  lc_DeadspDlrCode      PIC X(04) VALUE SPACE.
047700170721           05  lc_DlrTrFreqCode      PIC X(02) VALUE SPACE.
047800170721           05  lc_TrlFreq            PIC X(02) VALUE SPACE.
047900170721           05  li_PaymentFreq        PIC S9(03) VALUE 0.
048000170721      *RFS112945 - End
048100170721      *RFS91255 - End
048200170721125759     05  li_PaymentFreq2       PIC S9(03) VALUE 0.
048300200525      *RFS 1081324 Begin
048400200605           05 PREV-GROSS-TRL-AMT     PIC S9(9)V999999 COMP-3 Value 0.
048500200605           05 PREV-GROSS-TRL-AMT-GF  PIC S9(9)V999999 COMP-3 Value 0.
048600200605           05 PREV-NO-OF-ACCOUNTS    PIC S9(5) VALUE 0.
048700200605           05 PREV-ASSETS            PIC S9(11)V9(2) COMP-3 Value 0.
048800200605           05 PREV-ASSETS-GF         PIC S9(11)V9(2) COMP-3 Value 0.
048900200605           05 PREV-UNIT-BAL          PIC S9(9)V999 Comp-3 Value 0.
049000200605           05 PREV-AVG-ASSETS        PIC S9(11)V9(6) Comp-3 Value 0.
049100200605           05 PREV-AVG-ASSETS-GF     PIC S9(11)V9(6) Comp-3 Value 0.
049200200605           05 PREV-GROSS-TRL-AMT-FIX PIC S9(9)V999999 Comp-3 Value 0.
049300200605           05 PREV-AVG-ASSETS-FIX    PIC S9(11)V9(6) Comp-3 Value 0.
049400200605           05 PREV-AVG-ASSETS-VAR    PIC S9(11)V9(6) Comp-3 Value 0.
049500200605           05 PREV-ASSETS-FIX        PIC S9(11)V9(2) COMP-3 Value 0.
049600210510      * RFS 1113297 - Begins
049700210510           05 lc_CalcVarUnit         PIC X(1) value space.
049800210510      * RFS 1113297 - Ends
049900200525      *RFS 1081324 End
050000170721
050100170721      *RFS50475 Add - Beg
050200170721       01  lc_ScreenAllowed_ALDTTF.
050300170721           05 lc_ALDTTF_ScreenCode        PIC X(8) VALUE "ACCCDTL "    .
050400170721           05 lc_ALDTTF_EditCode          PIC X(6) VALUE "ALDTTF".
050500170721           05 lc_ALDTTF_EditLevel         PIC X(1) VALUE "A".
050600170721           05 lc_ALDTTF_RtnFlag           PIC X.
050700170721              88 lb_ALDTTF_EditYes           Value "Y".
050800170721              88 lb_ALDTTF_EditNo            Value "N".
050900170721       01  lncc_Constants.
051000170721           05 lncc_V                      PIC X(1) VALUE "V".
051100170721130093     05 lncc_Y                      PIC X(1) VALUE "Y".
051200170721      *RFS50475 Add - End
051300170721
051400170721145455 01 lc_AccrualAsOfLastDate      PIC X.
051500170721145455     88 lb_AccrualAsOfLastDateYes   Value "Y".
051600170721145455     88 lb_AccrualAsOfLastDateNo    Value "N".
051700170721      * RFS152311 - Begin
051800170721       01 lnc_FirstPassFlag           PIC X.
051900170721           88 lb_FirstPassYes             Value "Y".
052000170721           88 lb_FirstPassNo              Value "N".
052100170721       01  li_CurrIndexPointer          PIC 9(05) VALUE 0.
052200170721      * RFS152311 - End
052300170721      *RFS91255 - Start
052400170721       01  lc-ACCOUNT-ACCRUAL-ARRAY.
052500170721           05 li-AA-ACCOUNT-NO         PIC S9(9).
052600170721           05 lc-AA-INVESTMENT-CODE    PIC X(5).
052700170721           05 lc-AA-CURRENCY-CODE      PIC X(3).
052800170721           05 li-AA-COUNTER            PIC 9(9) Binary.
052900170721           05 li-AA-ACCRUED            PIC 9(9)V999999 Comp-3.
053000170721           05 li-AA-ACCRUED-GF         PIC 9(9)V999999 Comp-3.
053100170721           05 li-AA-ACCRUED-FIX        PIC 9(9)V999999 Comp-3.
053200170721           05 li-AA-ACCRUED-VAR        PIC 9(9)V999999 Comp-3.
053300170721           05 li-AA-ASSETS             PIC 9(9)V99 Comp-3.
053400170721      * RFS146447 - Begin
053500170721           05 li-ASSETS-VAR            PIC 9(9)V99 Comp-3.
053600170721           05 li-ASSETS-FIX            PIC 9(9)V99 Comp-3.
053700170721           05 li-ASSETS-GF             PIC 9(9)V99 Comp-3.
053800170721      * RFS146447 - End
053900170721           05 li-AA-UNIT-BAL           PIC 9(9)V999 Comp-3.
054000170721           05 li-AA-UNIT-PRICE         PIC 9(4)V9999 Comp-3.
054100170721           05 li-AA-LAST-TDATE         PIC 9(8) Binary.
054200170721
054300170721       01  lc-ScreenAllowed_SRVFEA.
054400170721130093*    05 lc_SRVFEA_ScreenCode     PIC X(8) VALUE "SRVDAILY".
054500170721130093*    05 lc_SRVFEA_EditCode       PIC X(6) VALUE "SRVFEA".
054600170721130093*    05 lc_SRVFEA_EditLevel      PIC X(1) VALUE "A".
054700170721           05 lc_SRVFEA_RtnFlag        PIC X.
054800170721              88 lb_SRVFEA_EditYes              VALUE "Y".
054900170721              88 lb_SRVFEA_EditNo               VALUE "N".
055000170721      *RFS91255 - End
055100170721
055200170721      **  Parms to call CALCDUR to get duration between 2 dates
055300170721       01 CALCDUR-PARM               PIC X(100).
055400170721       01 CALCDUR-PARM-BUFFER REDEFINES CALCDUR-PARM.
055500170721          03 CALCDUR-START-DATE      PIC S9(8).
055600170721          03 CALCDUR-END-DATE        PIC S9(8).
055700170721          03 CALCDUR-YEARS           PIC S9(8).
055800170721          03 CALCDUR-MONTHS          PIC S9(8).
055900170721          03 CALCDUR-DAYS            PIC S9(8).
056000170721          03 CALCDUR-RETURN-CODE     PIC X(3).
056100170721      * RFS18615 - End
056200170721
056300170721R10664  01 DA-DAILY-ACCRUAL-VARIABLES.
056400170721R10664     05 DA-INVESTMENT-CODE    PIC X(5).
056500170721R10664     05 DA-INV-CURRENCY       PIC X(3).
056600170721R10664     05 DA-DEALER-CODE        PIC X(4).
056700170721R10664     05 DA-DEALER-CURRENCY    PIC X(3).
056800170721R10664     05 DA-DEALER-FRQ         PIC X(2).
056900170721
057000170721R10953
057100170721R10953  01 SRVCALC-SCREEN-CODE      PIC X(10)     VALUE "SRVCALC".
057200170721R10953  01 SRVZRO-EDIT-CODE         PIC X(10)     VALUE "SRVZRO".
057300170721R10953  01 DEALER-LEVEL-CODE        PIC X(1)      VALUE "D".
057400170721R10953  01 SRVZRO-BYPASS-FLAG       PIC X(1).
057500170721R10953     88 SRVZRO-BYPASS-YES     VALUE "Y".
057600170721R10953     88 SRVZRO-BYPASS-NO      VALUE "N".
057700170721
057800170721        01 WS-INVESTMENT-ACCRUAL-ARRAY.
057900170721RF6780*    05 WS-INVESTMENT-ACCRUAL-ENTRY OCCURS 600 TIMES
058000170721      * RFS 13374 BEGIN
058100170721      *    05 WS-INVESTMENT-ACCRUAL-ENTRY OCCURS 700 TIMES
058200170721R64527*    05 WS-INVESTMENT-ACCRUAL-ENTRY OCCURS 1300 TIMES
058300170721      * RFS64445 - Begin
058400170721      *    05 WS-INVESTMENT-ACCRUAL-ENTRY OCCURS 1000 TIMES
058500170721      * RFS139475 - Begin
058600170721      *    05 WS-INVESTMENT-ACCRUAL-ENTRY OCCURS 2220 TIMES
058700170721           05 WS-INVESTMENT-ACCRUAL-ENTRY OCCURS 5000 TIMES
058800170721      * RFS139475 - End
058900170721      * RFS64445 - End
059000170721152311*                                   INDEXED BY IACIDX.
059100170721152311                                    INDEXED BY IACIDX,
059200170721152311                                               IACIDXL.
059300170721      * RFS 13374 END
059400170721              07 WS-IA-INVESTMENT-CODE    PIC X(5).
059500170721              07 WS-IA-CURRENCY-CODE      PIC X(3).
059600170721              07 WS-IA-PROCESSED          PIC X(1).
059700170721
059800170721      * * * * 07 WS-IA-COUNTER            PIC 9(9).
059900170721      * * * * 07 WS-IA-ACCRUED            PIC 9(9)V999999.
06000017072140800 * * * * 07 WS-IA-ACCRUED-GF         PIC 9(9)V999999.
060100170721D19162* * * * 07 WS-IA-ACCRUED-FIX        PIC 9(9)V999999.
060200170721D19162* * * * 07 WS-IA-ACCRUED-VAR        PIC 9(9)V999999.
060300170721      * * * * 07 WS-IA-ASSETS             PIC 9(9)V99.
06040017072140800 * * * * 07 WS-IA-ASSETS-GF          PIC 9(9)V99.
060500170721D19162* * * * 07 WS-IA-ASSETS-FIX         PIC 9(9)V99.
060600170721D19162* * * * 07 WS-IA-ASSETS-VAR         PIC 9(9)V99.
060700170721      * * * * 07 WS-IA-UNIT-BAL           PIC 9(9)V999.
060800170721      * * * * 07 WS-IA-UNIT-PRICE         PIC 9(4)V9999.
060900170721      * * * * 07 WS-IA-LAST-TDATE         PIC 9(8).                     R64445
061000170721
061100170721      * * * * 07 WS-IA-TRAIL-T-RATE       PIC 9(4)V99999.               R64445
061200170721      * * * * 07 WS-IA-TRAIL-T-THRESHOLD  PIC 9(9)V99.                  R64445
061300170721      * * * * 07 WS-IA-TRAIL-S-RATE       PIC 9(4)V99999.               R64445
061400170721      * * * * 07 WS-IA-TRAIL-S-THRESHOLD  PIC 9(9)V99.                  R64445
06150017072140800 * * * * 07 WS-IA-TRAIL-H-RATE       PIC 9(4)V99999.               R64445
06160017072140800 * * * * 07 WS-IA-TRAIL-H-THRESHOLD  PIC 9(9)V99.                  R64445
061700170721
061800170721              07 WS-IA-COUNTER            PIC 9(9) Binary.              R64445
061900170721              07 WS-IA-ACCRUED            PIC 9(9)V999999 Comp-3.       R64445
06200017072140800         07 WS-IA-ACCRUED-GF         PIC 9(9)V999999 Comp-3.       R64445
062100170721D19162        07 WS-IA-ACCRUED-FIX        PIC 9(9)V999999 Comp-3.       R64445
062200170721D19162        07 WS-IA-ACCRUED-VAR        PIC 9(9)V999999 Comp-3.       R64445
062300170721              07 WS-IA-ASSETS             PIC 9(9)V99 Comp-3.           R64445
06240017072140800         07 WS-IA-ASSETS-GF          PIC 9(9)V99 Comp-3.           R64445
062500170721D19162        07 WS-IA-ASSETS-FIX         PIC 9(9)V99 Comp-3.           R64445
062600170721D19162        07 WS-IA-ASSETS-VAR         PIC 9(9)V99 Comp-3.           R64445
062700170721              07 WS-IA-UNIT-BAL           PIC 9(9)V999 Comp-3.          R64445
062800170721              07 WS-IA-UNIT-PRICE         PIC 9(4)V9999 Comp-3.         R64445
062900170721              07 WS-IA-LAST-TDATE         PIC 9(8) Binary.              R64445
063000170721
063100170721              07 WS-IA-TRAIL-T-RATE       PIC 9(4)V99999 Binary.        R64445
063200170721              07 WS-IA-TRAIL-T-THRESHOLD  PIC 9(9)V99 Comp-3.           R64445
063300170721              07 WS-IA-TRAIL-S-RATE       PIC 9(4)V99999 Binary.        R64445
063400170721              07 WS-IA-TRAIL-S-THRESHOLD  PIC 9(9)V99 Comp-3.           R64445
063500200803      *RFS185175-Starts
063600200803              07 WS-IA-TRAIL-S-ASSETS-RULE PIC X(1).
063700200803      *RFS185175-Ends
063800170721              07 WS-IA-TRAIL-H-RATE       PIC 9(4)V99999 Comp-3.        R64445
063900170721              07 WS-IA-TRAIL-H-THRESHOLD  PIC 9(9)V99 Comp-3.           R64445
064000170721167811        07 WS-IA-TRAIL-P-RATE       PIC 9(4)V99999 Comp-3.        R64445
064100170721167811        07 WS-IA-TRAIL-P-THRESHOLD  PIC 9(9)V99 Comp-3.           R64445
064200170721
064300170721R10953        07 WS-IA-DEALER-LEVEL-RATES PIC X(1).
064400170721
064500170721      * RFS18615 - Start
06460017072125827 * * * * 07 WS-IA-TOTAL-ASSETS       PIC 9(11)V9(6).               R64445
06470017072140800 * * * * 07 WS-IA-TOTAL-ASSETS-GF    PIC 9(11)V9(6).               R64445
064800170721              07 WS-IA-TOTAL-ASSETS       PIC 9(11)V9(6) Comp-3.        R64445
064900170721              07 WS-IA-TOTAL-ASSETS-GF    PIC 9(11)V9(6) Comp-3.        R64445
065000170721      * RFS18615 - End
065100170721
06520017072125827 * * * * 07 WS-IA-TOTAL-ASSETS-FIX   PIC 9(11)V9(6).               R64445
06530017072125827 * * * * 07 WS-IA-TOTAL-ASSETS-VAR   PIC 9(11)V9(6).               R64445
065400170721D19162* * * * 07 WS-IA-TRAIL-V-RATE       PIC 9(4)V9999999.             R64445
065500170721
065600170721              07 WS-IA-TOTAL-ASSETS-FIX   PIC 9(11)V9(6) Comp-3.        R64445
065700170721              07 WS-IA-TOTAL-ASSETS-VAR   PIC 9(11)V9(6) Comp-3.        R64445
065800170721              07 WS-IA-TRAIL-V-RATE       PIC 9(4)V9999999 Comp-3.      R64445
065900170721
066000170721D19162        07 WS-IA-VAR-SCHED-CODE     PIC X(4).
066100170721
066200170721D19162* * * * 07 WS-IA-VAR-EFFECT-DATE    PIC 9(8).                     R64445
066300170721D19162* * * * 07 WS-IA-VAR-START-DATE     PIC 9(8).                     R64445
066400170721D19162* * * * 07 WS-IA-VAR-DATE-PREPARED  PIC 9(8).                     R64445
066500170721
066600170721              07 WS-IA-VAR-EFFECT-DATE    PIC 9(8) Binary.              R64445
066700170721              07 WS-IA-VAR-START-DATE     PIC 9(8) Binary.              R64445
066800170721              07 WS-IA-VAR-DATE-PREPARED  PIC 9(8) Binary.              R64445
066900210510      * RFS 1113297 - Begins
067000210510              07 WS-IA-VAR-CALC-FEE           PIC X(1).
067100210510      * RFS 1113297 - Ends
067200170721      * RFS139475 - Start
067300170721D19196*       07 WS-INV-LMT-DAYS-ENTRY    OCCURS 100 TIMES
067400170721              07 WS-INV-LMT-DAYS-ENTRY    OCCURS 20 TIMES
067500170721      * RFS139475 - End
067600170721                                                    INDEXED BY LMTIDX.
067700170721D19162           10 WS-INV-LMT-SCHED           PIC X(4).
067800170721
067900170721D19162* * * *    10 WS-INV-LMT-DAYS            PIC S9(5).               R64445
06800017072125827 * * * *    10 WS-INV-LMT-ASSETS          PIC 9(11)V9(6).          R64445
06810017072137142 * * * *    10 li_InvLmtAssetsDist     PIC 9(11)V9(6).             R64445
06820017072137142 * * * *    10 li_InvLmtDistUnits      PIC 9(11)V9(3).             R64445
06830017072125827 * * * *    10 WS-INV-LMT-TOT-ASSETS      PIC 9(11)V9(6).          R64445
068400170721D19162* * * *    10 WS-INV-LMT-NO-ACCT         PIC 9(9).                R64445
068500170721D19162* * * *    10 WS-INV-LMT-FEE-AMT         PIC 9(9)V999999.         R64445
06860017072137142 * * * *    10 li_InvLmtFeeDistAmt        PIC 9(9)V999999.         R64445
068700170721D19162* * * *    10 WS-INV-LMT-RATE            PIC 9(4)V9(6).           R64445
068800170721
068900170721D19162           10 WS-INV-LMT-DAYS            PIC S9(5) Comp-3.        R64445
06900017072125827            10 WS-INV-LMT-ASSETS          PIC 9(11)V9(6) Comp-3.   R64445
06910017072137142            10 li_InvLmtAssetsDist     PIC 9(11)V9(6) Comp-3.      R64445
06920017072137142            10 li_InvLmtDistUnits      PIC 9(11)V9(3) Comp-3.      R64445
06930017072125827            10 WS-INV-LMT-TOT-ASSETS      PIC 9(11)V9(6) Comp-3.   R64445
069400170721D19162           10 WS-INV-LMT-NO-ACCT         PIC 9(9) Binary.         R64445
069500170721D19162           10 WS-INV-LMT-FEE-AMT         PIC 9(9)V999999 Comp-3.  R64445
06960017072137142            10 li_InvLmtFeeDistAmt        PIC 9(9)V999999 Comp-3.  R64445
069700170721D19162           10 WS-INV-LMT-RATE            PIC 9(4)V9(6) Comp-3.    R64445
069800170721      *RFS112945 - Begin
069900170721              07  li_IaHoldingPeriod           PIC 9(03).
070000170721              07  lc_IaFrequency               PIC X(02).
070100170721              07  lc_IaRateType                PIC X(01).
070200170721      *RFS112945 - End
070300170721
070400170721D19162 01  WS-VARIABLE-RATE-ARRAY.
070500170721      * RFS115839 - Begin
070600170721D19162***  05 WS-VR-RATES-ENTRY OCCURS 70000 TIMES
070700170721D19162     05 WS-VR-RATES-ENTRY OCCURS 210000 TIMES
070800170721      * RFS115839 - End
070900170721  ¦                          ASCENDING KEY IS WS-VR-SCHEDULE-CODE,
071000170721  ¦                          ASCENDING KEY IS WS-VR-LIMIT-DAYS
071100170721  ¦                                        INDEXED BY VARIDX.
071200170721D19162        09 WS-VR-SCHEDULE-CODE          PIC X(4) VALUE HIGH-VALUE.
071300170721      * RFS148182 - Begin
071400170721D19162***     09 WS-VR-LIMIT-DAYS             PIC 9(4) VALUE 9999.
071500170721              09 WS-VR-LIMIT-DAYS             PIC 9(5) VALUE 99999.
071600170721      * RFS148182 - End
071700170721D19162        09 WS-VR-RATE                   PIC 9(4)V9(6) VALUE 0.
071800200720      * RFS185175-Starts
071900200720              09 WS-VR-ASSETS-RULE            PIC X(1) VALUE " ".
072000200720              09 WS-VR-TRACK-METHOD           PIC X(1) VALUE " ".
072100200720      * RFS185175-Ends
072200170721
072300170721       01  WS-DEALER-INVEST-TRAILER-ARRAY.
072400170721      * RFS115839 - Begin
072500170721      ***  05 WS-DI-RATES-ENTRY OCCURS 70000 TIMES INDEXED BY DIIDX.   ,
072600170721           05 WS-DI-RATES-ENTRY OCCURS 210000 TIMES INDEXED BY DIIDX.  ,
072700170721      * RFS115839 - End
072800170721              09 WS-DI-DEALER-CODE             PIC X(4).
072900170721              09 WS-DI-INVESTMENT-CODE         PIC X(5).
073000170721      *RFS 167811-Begin
073100170721      *       09 WS-DI-TRAIL-T-RATE            PIC 9(4)V99999.
073200170721      *       09 WS-DI-TRAIL-T-THRESHOLD       PIC 9(9)V99.
073300170721              09 WS-DI-TRAIL-T-RATE            PIC 9(4)V99999 Comp-3.
073400170721              09 WS-DI-TRAIL-T-THRESHOLD       PIC 9(9)V99 Comp-3.
07350017072140800 *       09 WS-DI-TRAIL-S-RATE            PIC 9(4)V99999.
07360017072140800 *       09 WS-DI-TRAIL-S-THRESHOLD       PIC 9(9)V99.
073700170721              09 WS-DI-TRAIL-S-RATE            PIC 9(4)V99999 Comp-3.
073800170721              09 WS-DI-TRAIL-S-THRESHOLD       PIC 9(9)V99 Comp-3.
073900200803      *RFS185175-Starts
074000200803              09 WS-DI-S-ASSETS-RULE           PIC X(1).
074100200803      *RFS185175-Ends
07420017072140800 *       09 WS-DI-TRAIL-H-RATE            PIC 9(4)V99999.
07430017072140800 *       09 WS-DI-TRAIL-H-THRESHOLD       PIC 9(9)V99.
074400170721              09 WS-DI-TRAIL-H-RATE            PIC 9(4)V99999 Comp-3.
074500170721              09 WS-DI-TRAIL-H-THRESHOLD       PIC 9(9)V99 Comp-3.
074600170721167811        09 WS-DI-TRAIL-P-RATE            PIC 9(4)V99999 Comp-3.
074700170721167811        09 WS-DI-TRAIL-P-THRESHOLD       PIC 9(9)V99 Comp-3.
074800170721      *RFS 167811-End
074900170721      *RFS112945 - Begin
075000170721              09  li_DiHoldingPeriod           PIC 9(03).
075100170721              09  lc_DiFrequency               PIC X(02).
075200170721              09  lc_DiRateType                PIC X(01).
075300170721      *RFS112945 - End
075400170721
075500170721       01  WS-TRANS-STATUS.
075600170721           05 WS-TRANS-STATUS-88   PIC X(3).
075700170721              88 HISTORY           VALUES "HST" "HSC".
075800170721              88 REVERSAL          VALUES "RVS".
075900170721
076000170721       01  WS-TRANS-TYPE.
076100170721           05 WS-TRANS-TYPE-88     PIC X(3).
076200170721              88 REDEMPTION        VALUES "SEL" "SWO" "TRO" "CQD"
076300170721                                          "TFE" "FEE" "SAJ".
076400170721
076500170721D19162*40800 01 WS-MANAGEMENT-COMPANY-CODE.
076600170721  ¦   *40800    05 WS-COMPANY-CODE            PIC  X(03) VALUE " ".
076700170721  ¦   *40800 88 WS-GRANDFATHER-CLIENT              VALUE "AIC", "TAI",
076800170721  ¦   *40800                                       "ADE", "BPI", "JHI",
076900170721R28871*40800                                       "IAF",
077000170721R29586*40800                                       "GWD",
077100170721D19162*40800                                       "GGF", "MLA".
077200170721        01 WS-QBEGIN.
077300170721           03 WS-QBEGIN-YY              PIC 9(4) VALUE 0.
077400170721           03 WS-QBEGIN-MM              PIC 9(2) VALUE 0.
077500170721           03 WS-QBEGIN-DD              PIC 9(2) VALUE 0.
077600170721        01 WS-QBEGIN-N REDEFINES WS-QBEGIN
077700170721                                        PIC 9(8).
077800170721
077900170721        01 WS-QEND.
078000200526      *RFS 1081324 Begin
078100200526      *    03 WS-QEND-YY                PIC 9(4) VALUE 0.
078200200526      *    03 WS-QEND-MM                PIC 9(2) VALUE 0.
078300200526      *    03 WS-QEND-DD                PIC 9(2) VALUE 0.
078400200526           03 WS-QEND-YY                PIC S9(4) VALUE 0.
078500200526           03 WS-QEND-MM                PIC S9(2) VALUE 0.
078600200526           03 WS-QEND-DD                PIC S9(2) VALUE 0.
078700200526      *RFS 1081324 End
078800170721        01 WS-QEND-N   REDEFINES WS-QEND
078900170721                                        PIC 9(8).
079000170721
079100170721        01 WS-MONTH-STR-DATE            PIC 9(8).
079200170721        01 WS-MONTH-STR-DATE-N REDEFINES WS-MONTH-STR-DATE.
079300170721           03 WS-MONTH-STR-DATE-YYYY    PIC 9(4).
079400170721           03 WS-MONTH-STR-DATE-MM      PIC 9(2).
079500170721           03 WS-MONTH-STR-DATE-DD      PIC 9(2).
079600170721
079700170721        01 WS-QUARTER-STR-DATE            PIC 9(8).
079800170721        01 WS-QUARTER-STR-DATE-N REDEFINES WS-QUARTER-STR-DATE.
079900170721           03 WS-QUARTER-STR-DATE-YYYY    PIC 9(4).
080000170721           03 WS-QUARTER-STR-DATE-MM      PIC 9(2).
080100170721           03 WS-QUARTER-STR-DATE-DD      PIC 9(2).
080200170721
080300170721        01 WS-QUARTER-STR-DATE-7          PIC 9(8).
080400170721        01 WS-QUARTER-STR-DATE-7-N REDEFINES WS-QUARTER-STR-DATE-7.
080500170721           03 WS-QUARTER-STR-DATE-7-YYYY  PIC 9(4).
080600170721           03 WS-QUARTER-STR-DATE-7-MM    PIC 9(2).
080700170721           03 WS-QUARTER-STR-DATE-7-DD    PIC 9(2).
080800170721
080900170721        01 WS-LAST-MONTH-END            PIC 9(8).
081000170721        01 WS-LAST-MONTH-END-N REDEFINES WS-LAST-MONTH-END.
081100170721           03 WS-LAST-MONTH-END-YYYY    PIC 9(4).
081200170721           03 WS-LAST-MONTH-END-MM      PIC 9(2).
081300170721           03 WS-LAST-MONTH-END-DD      PIC 9(2).
081400170721
081500170721        01 WS-LAST-QUARTER-END            PIC 9(8).
081600170721        01 WS-LAST-QUARTER-END-N REDEFINES WS-LAST-QUARTER-END.
081700170721           03 WS-LAST-QUARTER-END-YYYY    PIC 9(4).
081800170721           03 WS-LAST-QUARTER-END-MM      PIC 9(2).
081900170721           03 WS-LAST-QUARTER-END-DD      PIC 9(2).
082000170721
082100170721        01 WS-LAST-QUARTER-END-7          PIC 9(8).
082200170721        01 WS-LAST-QUARTER-END-7-N REDEFINES WS-LAST-QUARTER-END-7.
082300170721           03 WS-LAST-QUARTER-END-7-YYYY  PIC 9(4).
082400170721           03 WS-LAST-QUARTER-END-7-MM    PIC 9(2).
082500170721           03 WS-LAST-QUARTER-END-7-DD    PIC 9(2).
082600170721
082700170721        01 WS-BEGIN-DATE-PASS             PIC 9(8).
082800170721        01 WS-BEGIN-DATE-PASS-N REDEFINES WS-BEGIN-DATE-PASS.
082900170721           03 WS-BEGIN-DATE-PASS-YYYY-MM  PIC 9(6).
083000170721           03 WS-BEGIN-DATE-PASS-DD       PIC 9(2).
083100170721
083200170721        01 WS-END-DATE-PASS             PIC 9(8).
083300170721        01 WS-END-DATE-PASS-N REDEFINES WS-END-DATE-PASS.
083400170721           03 WS-END-DATE-PASS-YYYY-MM  PIC 9(6).
083500170721           03 WS-END-DATE-PASS-DD       PIC 9(2).
083600170721
083700170721D19162  01 WS-VARIABLE-MISC-FIELDS.
083800170721D19162     05 WS-MODULE-ID                 PIC X(10).
083900170721  ¦        05 WS-MODULE-AUTH-SRVVAR        PIC X.
084000170721  ¦        05 WS-INV-TRL-SCHED             PIC X(4).
084100170721  ¦        05 WS-INV-TRL-VAR-SCHED         PIC X(4).
084200170721  ¦        05 WS-DTL-TRAILER-VAR           PIC 9(9)V9(6)   COMP-3.
084300170721  ¦        05 WS-DLY-TRAILER-VAR           PIC 9(9)V9(6)   COMP-3.
08440017072126386      05 WS-NEW-TRAILER-AMT           PIC 9(9)V9(6)   COMP-3.
084500170721154537     05 WS-NEW-TRAILER-AMT2          PIC 9(9)V9(2)   COMP-3.
084600170721154537     05 WS-NEW-TRAILER-AMT6          PIC 9(9)V9(6)   COMP-3.
084700171121      *RFS173258 - Starts
084800171121154537*    05 WS-VARIANCE-AMT              PIC 9(9)V9(2)   COMP-3.
084900171121           05 WS-VARIANCE-AMT              PIC S9(9)V9(2)  COMP-3.
085000171121      *RFS173258 - Ends
085100170721160475     05 WS-NEW-TRAILER-AMT2-GF       PIC 9(9)V9(2)   COMP-3.
085200170721160475     05 WS-NEW-TRAILER-AMT6-GF       PIC 9(9)V9(6)   COMP-3.
085300171121      *RFS173258 - Starts
085400171121160475*    05 WS-VARIANCE-AMT-GF           PIC 9(9)V9(2)   COMP-3.
085500171121           05 WS-VARIANCE-AMT-GF           PIC S9(9)V9(2)  COMP-3.
085600171121      *RFS173258 - Ends
085700170721162565     05 WS-VARIANCE-AMT-VR           PIC S9(9)V9(2)  COMP-3.
085800210129      *RFS1021251 - Begins
085900201211           05 WS-VARIANCE-AMT-VR2          PIC S9(9)V9(2)  COMP-3.
086000201211      *RFS1021251 - Ends
086100170721X19162     05 WS-VAR-TRAILER-AMT           PIC 9(9)V9(2)   COMP-3.
086200170721
086300170721      * Rfs 37142 Begins
086400170721           05 li_Sf_Amt_Dist_var           PIC 9(9)V9(6)   COMP-3.
086500170721           05 li_DlyTrailerDistVar         PIC 9(9)V9(6)   COMP-3.
086600170721      * Rfs 37142 ends
086700170721
086800170721
086900170721      * rfs 25827 - start
087000170721      *  rfs 37142 begin -initialise ws-var-assets
087100170721X19162     05 WS-VAR-ASSETS            PIC 9(11)V9(2) COMP-3 Value 0.
087200170721X19162*    05 WS-VAR-ASSETS            PIC 9(11)V9(2) COMP-3.
087300170721      *  rfs 37142 end
087400170721RT    *    05 WS-VAR-ASSETS            PIC 9(11)V9(6) COMP-3.
087500170721RT    * rfs 25827 - end
087600170721D19162     05 WS-VARIABLE-RATE             PIC 9(4)V9(6).
087700170721D19162     05 WS-DLY-TRAILER-FIX           PIC 9(9)V9(6)   COMP-3.
087800200720      *RFS185175-Starts
087900200720           05 WS-ASSETS-RULE               PIC X(1).
088000200720           05 WS-TRACK-METHOD              PIC X(1).
088100200720      *RFS185175-Ends
088200170721
08830017072140800  01  Flag.
08840017072140800      03  lb_CalcTrailForTRateFlag    PIC 1.
08850017072140800          88  lb_CalcTrailForTRateYes VALUE B"1".
08860017072140800          88  lb_CalcTrailForTRateNo  VALUE B"0".
08870017072140800      03  lb_CalcTrailForSRateFlag    PIC 1.
08880017072140800          88  lb_CalcTrailForSRateYes VALUE B"1".
08890017072140800          88  lb_CalcTrailForSRateNo  VALUE B"0".
08900017072140800      03  lb_CalcTrailForHRateFlag    PIC 1.
08910017072140800          88  lb_CalcTrailForHRateYes VALUE B"1".
08920017072140800          88  lb_CalcTrailForHRateNo  VALUE B"0".
08930017072140800      03  lb_DISrateFoundFlag         PIC 1.
08940017072140800          88  lb_DISrateFoundYes      VALUE B"1".
08950017072140800          88  lb_DISrateFoundNo       VALUE B"0".
089600170721167811     03  lb_CalcTrailForPRateFlag    PIC 1.
089700170721167811         88  lb_CalcTrailForPRateYes VALUE B"1".
089800170721167811         88  lb_CalcTrailForPRateNo  VALUE B"0".
089900170721167811     03  lb_DIPrateFoundFlag         PIC 1.
090000170721167811         88  lb_DIPrateFoundYes      VALUE B"1".
090100170721167811         88  lb_DIPrateFoundNo       VALUE B"0".
090200170721
090300170721R10664 01 WS-LOCAL-DATA-AREA.
090400170721R10664   05 PASS-DLYACCRUAL            PIC X(1).
090500170721R10664   05 PASS-FRQ                   PIC X(2).
090600170721R10664   05 PASS-MONTH-END             PIC X(1).
090700170721R10664   05 PASS-MONTH-START-DATE-X    PIC X(8).
090800170721R10664   05 PASS-MONTH-START-DATE REDEFINES PASS-MONTH-START-DATE-X
090900170721R10664                                 PIC S9(8).
091000170721R10664   05 PASS-MONTH-END-DATE-X      PIC X(8).
091100170721R10664   05 PASS-MONTH-END-DATE REDEFINES PASS-MONTH-END-DATE-X
091200170721R10664                                 PIC S9(8).
091300170721R10664   05 PASS-QUARTER-END           PIC X(1).
091400170721R10664   05 PASS-QUARTER-START-DATE-X  PIC X(8).
091500170721R10664   05 PASS-QUARTER-START-DATE REDEFINES PASS-QUARTER-START-DATE-X
091600170721R10664                                 PIC S9(8).
091700170721R10664   05 PASS-QUARTER-END-DATE-X    PIC X(8).
091800170721R10664   05 PASS-QUARTER-END-DATE REDEFINES PASS-QUARTER-END-DATE-X
091900170721R10664                                 PIC S9(8).
092000170721R10664
092100170721      *RFS-21203 - Begin
092200170721
092300170721       01 DLRSPT-SCREEN-CODE    PIC X(8) VALUE "CAPFEE".
092400170721       01 CAPFEE-EDIT-CODE      PIC X(6) VALUE "DLRSPT".
092500170721       01 DLR-LEVEL-CODE        PIC X(1) VALUE "D".
092600170721       01 CAPFEE-BYPASS-FLAG    PIC X(1).
092700170721          88 CAPFEE-BYPASS-YES      VALUE "Y".
092800170721          88 CAPFEE-BYPASS-NO       VALUE "N".
092900170721
093000170721      *RFS-21203 - End
093100170721
093200170721       01 ln_Daily_Value_Actual_Var_Tot   PIC 9(9)V9(6)   COMP-3.
093300170721       01 ln_Daily_Value_Base_Var_Tot     PIC 9(9)V9(6)   COMP-3.
093400170721130093 01 li_TotalAssets              PIC S9(11)V9(2) COMP-3 Value 0.
093500170721130093 01 li_TotalAssetsVar           PIC S9(11)V9(2) COMP-3 Value 0.
093600170721130093 01 li_TotalAssetsFix           PIC S9(11)V9(2) COMP-3 Value 0.
093700170721130093 01 li_TotalAssetsGf            PIC S9(11)V9(2) COMP-3 Value 0.
093800170721145455 01 ln_TotalNoOfAccounts        PIC 9(5) VALUE 0.
093900200525      *RFS 1081324 Begin
094000200525       01 lc_InvestmentCode1          PIC X(05) VALUE SPACE.
094100200525       01 lc_CurrencyCode1            PIC X(03) VALUE SPACE.
094200200526       01 li_Count                    PIC S9(5) VALUE 0.
094300200525      *RFS 1081324 End
094400170721      *****
094500170721      *****  COPY THE PROCESS-DATE
094600170721      *****
094700170721             COPY PRCDTWS.
094800170721
094900170721
09500017072150475a* Copy SQLSTATE working variables
09510017072150475a COPY CPYSQLFLD.
095200170721           EXEC SQL
095300170721              INCLUDE SQLCA
095400170721           END-EXEC.
095500170721
095600170721       LINKAGE SECTION.
095700170721        01 COMM-DATE                    PIC 9(16).
095800170721        01 COMM-DATE-N REDEFINES COMM-DATE.
095900170721           03 COMM-QBEGIN               PIC 9(8).
096000170721           03 COMM-QBEGIN-N REDEFINES COMM-QBEGIN.
096100170721              05 COMM-QBEGIN-YYYY-MM    PIC 9(6).
096200170721              05 COMM-QBEGIN-YYYY-MM-N  REDEFINES COMM-QBEGIN-YYYY-MM.
096300170721                 07 COMM-QBEGIN-YYYY    PIC 9(4).
096400170721                 07 COMM-QBEGIN-MM      PIC 9(2).
096500170721              05 COMM-QBEGIN-DD         PIC 9(2).
096600170721           03 COMM-QEND                 PIC 9(8).
096700170721           03 COMM-QEND-N REDEFINES COMM-QEND.
096800170721              05 COMM-QEND-YYYY-MM      PIC 9(6).
096900170721              05 COMM-QEND-YYYY-MM-N REDEFINES COMM-QEND-YYYY-MM.
097000170721                 07 COMM-QEND-YYYY      PIC 9(4).
097100170721                 07 COMM-QEND-MM        PIC 9(2).
097200170721              05 COMM-QEND-DD           PIC 9(2).
097300170721        01 COMM-MTHEND                  PIC X(1).
097400170721        01 COMM-QTREND                  PIC X(1).
097500170721        01 COMM-Q7                      PIC X(1).
097600170721
097700170721       PROCEDURE DIVISION USING COMM-DATE,
097800170721                                COMM-MTHEND,
097900170721                                COMM-QTREND,
098000170721                                COMM-Q7.
098100170721
098200170721       MAINLINE.
098300170721D19162*40800DISPLAY "START SRVCALC2".
09840017072140800      ACCEPT WS-TIME FROM TIME.
09850017072140800      DISPLAY "START SRVTRAPP..." WS-TIME.
098600170721           PERFORM INITIAL-LOGIC     THRU INL-EXIT.
098700170721           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
098800170721              GO TO ML-1200.
098900170721       ML-0010.
099000170721           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
099100170721       ML-0020.
099200170721           IF PREV-LEVEL1 IS EQUAL TO CURR-LEVEL1
099300170721              GO TO ML-1100.
099400170721           IF PREV-CONTROLS IS EQUAL TO LOW-VALUES
099500170721              GO TO ML-0040.
099600170721       ML-0030.
099700170721R91255*    PERFORM LEVEL-SUMMARY-1     THRU LS1-EXIT.
099800170721R91255     PERFORM LEVEL-SUMMARY-1     THRU LS1-EXIT.
099900170721           IF PREV-LEVEL2 IS EQUAL TO CURR-LEVEL2
100000170721              GO TO ML-0100.
100100170721           PERFORM LEVEL-SUMMARY-2     THRU LS2-EXIT.
100200170721R91255     IF PREV-LEVEL3 IS EQUAL TO CURR-LEVEL3
100300170721R91255        GO TO ML-0045.
100400170721       ML-0040.
100500170721           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
100600170721              GO TO ML-1200.
100700170721R91255 ML-0045.
100800170721R91255     PERFORM LEVEL-REINIT-3      THRU LR3-EXIT.
100900170721       ML-0050.
101000170721           PERFORM LEVEL-REINIT-2      THRU LR2-EXIT.
101100170721       ML-0100.
101200170721           PERFORM LEVEL-REINIT-1      THRU LR1-EXIT.
101300170721           MOVE CURR-CONTROLS          TO PREV-CONTROLS.
101400170721145730     MOVE CURR-DEALER-ACCOUNT-NO TO PREV-DEALER-ACCOUNT-NO
101500170721       ML-1100.
101600170721           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
101700170721           GO TO ML-0010.
101800170721       ML-1200.
101900170721           PERFORM END-JOB             THRU EOJ-EXIT.
102000170721D19162*40800DISPLAY "END SRVCALC2".
10210017072140800      ACCEPT WS-TIME FROM TIME.
10220017072140800      DISPLAY "END SRVTRAPP..." WS-TIME.
102300170721           STOP RUN.
102400170721
102500170721      /
102600170721       GET-CURRENT-RECORD.
102700170721
102800170721      * RFS91255 - Start
102900170721           IF  lb_SRVFEA_EditYes AND
103000170721               PREV-CONTROLS IS NOT EQUAL TO LOW-VALUES
103100170721               COMPUTE PREV-DAILY-VALUE-ACTUAL      =
103200170721               DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
103300170721               COMPUTE PREV-DAILY-VALUE-ACTUAL-GF      =
103400170721               DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE
103500170721               COMPUTE PREV-UNITS = UNITS OF DEALER-REP-DLY-SRV-FEE
103600170721           END-IF.
103700170721      * RFS91255 - End
103800170721
103900170721R10664* Daily accrual?
104000170721
104100170721
104200170721R10664     IF PASS-DLYACCRUAL NOT = "Y"
104300170721R10664        GO TO GCR-NON-DAILY-ACCRUAL.
104400170721R10664
104500170721R10664 GCR-DA-READ.
104600170721R10664
104700170721R10664     READ SRV-FEE-EXTRACT NEXT RECORD
104800170721R10664     AT END
104900200525      *RFS 1081324 Begin
105000200525           IF lb_FirstPassYes
105100200604              SET IACIDXL TO IACIDX
105200200525           END-IF
105300200525      *RFS 1081324 End
105400170721R10664     MOVE HIGH-VALUES  TO CURR-CONTROLS
105500170721R10664     GO TO GCR-EXIT.
105600170721R10664
105700170721R10664     INITIALIZE MFADEADSP OF DEALER-REP-DLY-SRV-FEE.
105800170721R10664     MOVE CORR  MFADEADSP OF SRV-FEE-EXTRACT TO
105900170721R10664                MFADEADSP OF DEALER-REP-DLY-SRV-FEE.
106000170721R10664
106100170721R10664     READ DEALER-REP-DLY-SRV-FEE
106200170721R10664     INVALID KEY
106300170721R10664       GO TO GCR-DA-READ.
106400170721R10664
106500170721R10664     GO TO GCR-CONT.
106600170721R10664
106700170721R10664 GCR-NON-DAILY-ACCRUAL.
106800170721R10664
106900170721           READ DEALER-REP-DLY-SRV-FEE NEXT RECORD
107000170721           AT END
107100170721           MOVE HIGH-VALUES  TO CURR-CONTROLS
107200170721           GO TO GCR-EXIT.
107300170721
107400170721R10664 GCR-CONT.
107500170721R10664
107600170721  |
107700170721  |   * Must include the last record of the period
107800170721  ¦        IF ELIGIBLE-FOR-PAYMENT OF DEALER-REP-DLY-SRV-FEE NOT = "Y"
107900170721r51370     AND DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE = 0
108000170721  ¦        AND PROCESS-DATE OF DEALER-REP-DLY-SRV-FEE NOT = COMM-QEND
108100170721  ¦          GO TO GET-CURRENT-RECORD
108200170721  ¦        END-IF.
108300170721  ¦
108400170721152311     SET IACIDXL TO IACIDX.
108500170721           IF INVESTMENT-CODE OF DEALER-REP-DLY-SRV-FEE =
108600170721              CURR-INVESTMENT-CODE
108700170721             GO TO GCR-INVESTMENT-FOUND
108800170721           END-IF.
108900170721
109000170721           SET IACIDX        TO 1.
109100170721      *    SET IACIDX        DOWN BY 1.
109200170721
109300170721           SEARCH WS-INVESTMENT-ACCRUAL-ENTRY VARYING IACIDX
109400170721           WHEN WS-IA-INVESTMENT-CODE(IACIDX) IS EQUAL
109500170721           INVESTMENT-CODE OF DEALER-REP-DLY-SRV-FEE
109600170721             GO TO GCR-INVESTMENT-FOUND
109700170721           WHEN WS-IA-INVESTMENT-CODE(IACIDX) = SPACES
109800170721             GO TO GET-CURRENT-RECORD.
109900170721
110000170721
110100170721       GCR-INVESTMENT-FOUND.
110200170721
110300170721           MOVE DEALER-CODE OF DEALER-REP-DLY-SRV-FEE
110400170721                             TO CURR-DEALER-CODE.
110500170721
110600170721           MOVE DEALER-REP-CODE OF DEALER-REP-DLY-SRV-FEE
110700170721                             TO CURR-REP-CODE.
110800170721
110900170721           MOVE INVESTMENT-CODE OF DEALER-REP-DLY-SRV-FEE
111000170721                             TO CURR-INVESTMENT-CODE.
111100170721
111200170721R91255     MOVE ACCOUNT-NO      OF DEALER-REP-DLY-SRV-FEE
111300170721R91255                       TO CURR-ACCOUNT-NO.
111400170721145730     MOVE DEALER-ACCOUNT-NO  OF DEALER-REP-DLY-SRV-FEE
111500170721145730                       TO CURR-DEALER-ACCOUNT-NO.
111600170721
111700170721       GCR-EXIT.
111800170721           EXIT.
111900170721
112000170721      /
112100170721       DETAIL-PROCESSING.
112200170721
112300170721      * RFS-21203 - Begin
112400170721      * Bypass processing of the Dealer when Commission Bonus Source
112500170721      * = "E" and and Split Service Fees by Rep "CAPFEE" = "Y
112600170721           IF WS-BYPASS-DEALER = "Y"
112700170721              GO TO DPR-EXIT
112800170721           END-IF.
112900170721      * RFS-21203 - End
113000170721
113100170721      * For the records where the price was not available at the
113200170721      * time when they were written to MFADEADSP, check the price
113300170721      * again and if different recalculate the market value buckets
11340017072160213      IF PASS-DLYACCRUAL = "Y"  AND
11350017072160213         REVIEW-FLAG OF DEALER-REP-DLY-SRV-FEE = "Y"
11360017072160213            PERFORM Check_Price
11370017072160213      END-IF.
113800170721
113900170721           MOVE ZEROES       TO WS-DLY-TRAILER.
11400017072140800      MOVE ZEROES       TO WS-DLY-TRAILER-GF.
114100170721D19162     MOVE ZEROES       TO WS-DLY-TRAILER-VAR
114200170721D19162                          WS-DLY-TRAILER-FIX.
114300170721           MOVE "N"          TO WS-REWRITE-DLY-SRV-FEE.
114400170721
11450017072140800      SET lb_CalcTrailForTRateNo
11460017072140800          lb_CalcTrailForSRateNo
114700170721167811         lb_CalcTrailForPRateNo
11480017072140800          lb_CalcTrailForHRateNo TO TRUE.
114900170721
11500017072140800 *    IF WS-DEALER-LEVEL-RATES IS EQUAL TO "N"
11510017072140800 *    AND WS-IA-TRAIL-T-THRESHOLD(IACIDX) IS EQUAL 0
11520017072140800 *       GO TO DPR-CALC-SF-AMT
11530017072140800 *    END-IF.
115400170721
11550017072140800 *    IF WS-DEALER-LEVEL-RATES IS EQUAL TO "Y"
11560017072140800 *    AND WS-DI-TRAIL-T-THRESHOLD(DIIDX) IS EQUAL TO 0
11570017072140800 *       GO TO DPR-CALC-SF-AMT
11580017072140800 *    END-IF.
115900170721
116000170721           IF WS-DEALER-LEVEL-RATES IS EQUAL TO "N"
11610017072140800 *    AND DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE LESS THAN
11620017072140800 *      WS-IA-TRAIL-T-THRESHOLD(IACIDX)
11630017072140800         IF DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE >=
11640017072140800            WS-IA-TRAIL-T-THRESHOLD(IACIDX) AND
11650017072140800            WS-IA-TRAIL-T-RATE(IACIDX) > 0
11660017072140800            SET lb_CalcTrailForTRateYes TO TRUE
11670017072140800         END-IF
11680017072140800         IF DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE >=
11690017072140800            WS-IA-TRAIL-S-THRESHOLD(IACIDX) AND
11700017072140800            WS-IA-TRAIL-S-RATE(IACIDX) > 0
11710017072140800            SET lb_CalcTrailForSRateYes TO TRUE
11720017072140800         END-IF
11730017072140800         IF DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE >=
11740017072140800            WS-IA-TRAIL-H-THRESHOLD(IACIDX) AND
11750017072140800            WS-IA-TRAIL-H-RATE(IACIDX) > 0
11760017072140800            SET lb_CalcTrailForHRateYes TO TRUE
11770017072140800         END-IF
117800170721      * RFS167811-Begin
117900170721              IF DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE >=
118000170721                 WS-IA-TRAIL-P-THRESHOLD(IACIDX) AND
118100170721                 WS-IA-TRAIL-P-RATE(IACIDX) > 0
118200170721                 SET lb_CalcTrailForPRateYes TO TRUE
118300170721              END-IF
118400170721      * RFS167811-End
118500170721
11860017072140800 *       GO TO DPR-REWRITE
118700170721           END-IF.
118800170721
118900170721           IF WS-DEALER-LEVEL-RATES IS EQUAL TO "Y"
11900017072140800 *    AND DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE LESS THAN
11910017072140800 *    WS-DI-TRAIL-T-THRESHOLD(DIIDX)
11920017072140800         IF DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE >=
11930017072140800            WS-DI-TRAIL-T-THRESHOLD(DIIDX) AND
11940017072140800            WS-DI-TRAIL-T-RATE(DIIDX) > 0
11950017072140800            SET lb_CalcTrailForTRateYes TO TRUE
11960017072140800         END-IF
11970017072140800         IF DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE >=
11980017072140800            WS-DI-TRAIL-S-THRESHOLD(DIIDX) AND
11990017072140800            WS-DI-TRAIL-S-RATE(DIIDX) > 0
12000017072140800            SET lb_CalcTrailForSRateYes TO TRUE
12010017072140800         END-IF
12020017072140800         IF DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE >=
12030017072140800            WS-DI-TRAIL-H-THRESHOLD(DIIDX) AND
12040017072140800            WS-DI-TRAIL-H-RATE(DIIDX) > 0
12050017072140800            SET lb_CalcTrailForHRateYes TO TRUE
12060017072140800         END-IF
120700170721      * RFS167811-Begin
120800170721              IF DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE >=
120900170721                 WS-DI-TRAIL-P-THRESHOLD(DIIDX) AND
121000170721                 WS-DI-TRAIL-P-RATE(DIIDX) > 0
121100170721                 SET lb_CalcTrailForPRateYes TO TRUE
121200170721              END-IF
121300170721      * RFS167811-End
121400170721
12150017072140800 *       GO TO DPR-REWRITE
121600170721           END-IF.
121700170721
12180017072140800      IF WS-GRANDFATHER-CLIENT AND
12190017072140800        (WS-DI-TRAIL-S-RATE(DIIDX) > 0 OR
12200017072140800         WS-IA-TRAIL-S-RATE(IACIDX) > 0)
12210017072140800         SET lb_CalcTrailForSRateYes TO TRUE
12220017072140800      END-IF.
122300170721
12240017072140800 *52545 IF lb_CalcTrailForTRateNo AND
12250017072140800 *52545  lb_CalcTrailForSRateNo AND
12260017072140800 *52545  lb_CalcTrailForHRateNo
12270017072140800 *52545  GO TO DPR-REWRITE
12280017072140800 *52545 END-IF.
122900170721
123000170721       DPR-CALC-SF-AMT.
123100170721
123200170721           IF ELIGIBLE-FOR-PAYMENT OF DEALER-REP-DLY-SRV-FEE NOT = "Y"
123300170721R51370       AND (NOT Ws-GrandFather-Client
123400170721R51370         OR DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE = 0)
123500170721             GO TO DPR-REWRITE
123600170721           END-IF.
123700170721
123800170721R51370* The condition below will control the calculation of srvc fees
123900170721R51370* for non-grandfathered units even if the eligible for payment
124000170721R51370* is NO.  This is how logic before rewrite works.
124100170721R51370     IF ELIGIBLE-FOR-PAYMENT OF DEALER-REP-DLY-SRV-FEE NOT = "Y"
124200170721R51370        AND Ws-GrandFather-Client
124300170721R51370        GO TO DPR-CALC-REG-UNITS
124400170721R51370     END-IF.
124500170721
12460017072140800      IF lb_CalcTrailForTRateYes
12470017072140800         PERFORM CalcTrailerGrandFather
12480017072140800      END-IF.
124900170721
125000170721       DPR-CALC-REG-UNITS.
12510017072140800      IF lb_CalcTrailForSRateYes
12520017072140800         MOVE WS-DI-TRAIL-S-RATE(DIIDX) TO WS-DI-TRAIL-RATE
12530017072140800         MOVE WS-IA-TRAIL-S-RATE(IACIDX) TO WS-IA-TRAIL-RATE
125400170721      *RFS112945 - Begin
125500170721              IF IS-LEAP-YEAR
125600170721                 MOVE 366 TO li_PaymentFreq
125700170721              ELSE
125800170721                 MOVE 365 TO li_PaymentFreq
125900170721              END-IF
126000170721      *RFS112945 - End
126100200803      *RFS185175-Starts
12620020080340800 *       PERFORM CalcTrailerFromRate
126300200803              IF (WS-DEALER-LEVEL-RATES = "Y" AND
126400200803                  WS-DI-S-ASSETS-RULE(DIIDX) = "1")
126500200803                  OR
126600200803                 (WS-DEALER-LEVEL-RATES = "N" AND
126700200803                  WS-IA-TRAIL-S-ASSETS-RULE(IACIDX) = "1")
126800200803                  PERFORM CalcTrailerFromRateYr
126900200803              ELSE
127000200803                  PERFORM CalcTrailerFromRate
127100200803              END-IF
127200200803      *RFS185175-Ends
12730017072140800      END-IF.
127400170721      * RFS 167811-Begin
127500170721
127600170721           IF lb_CalcTrailForPRateYes
127700170721              MOVE WS-DI-TRAIL-P-RATE(DIIDX) TO WS-DI-TRAIL-RATE
127800170721              MOVE WS-IA-TRAIL-P-RATE(IACIDX) TO WS-IA-TRAIL-RATE
127900170721              IF IS-LEAP-YEAR
128000170721                 MOVE 366 TO li_PaymentFreq
128100170721              ELSE
128200170721                 MOVE 365 TO li_PaymentFreq
128300170721              END-IF
128400170721              PERFORM CalcTrailerFromRate
128500170721           END-IF.
128600170721      * RFS 167811-End
128700170721
12880017072140800      IF lb_CalcTrailForHRateYes
12890017072140800         MOVE WS-DI-TRAIL-H-RATE(DIIDX) TO WS-DI-TRAIL-RATE
12900017072140800         MOVE WS-IA-TRAIL-H-RATE(IACIDX) TO WS-IA-TRAIL-RATE
129100170721      *RFS112945 - Begin
129200170721              IF lc_DiFrequency(DIIDX) NOT= SPACES
129300170721                 MOVE lc_DiFrequency(DIIDX) TO lc_TrlFreq
129400170721              ELSE
129500170721                 MOVE lc_IaFrequency(IACIDX) TO lc_TrlFreq
129600170721              END-IF
129700170721
129800170721              IF lc_TrlFreq NOT= SPACES
129900170721                 EXEC SQL
130000170721                   SELECT COALESCE(PAYMENTS_PER_ANNUM,0)
130100170721                   INTO :li_PaymentFreq
130200170721                   FROM MFAFRECDP
130300170721                   WHERE FREQUENCY_CODE= :lc_TrlFreq
130400170721                 END-EXEC
130500170721              ELSE
130600170721125759           Move 0 to li_PaymentFreq2
130700170721                 MOVE DEALER-CODE OF DEALER-REP-DLY-SRV-FEE
130800170721                                            TO lc_DeadspDlrCode
130900170721                 EXEC SQL
131000170721                   SELECT COALESCE(PAYMENTS_PER_ANNUM,0)
131100170721125759             INTO :li_PaymentFreq2
131200170721125759*******      INTO :li_PaymentFreq
131300170721                   FROM MFAFRECDP CDP
131400170721                   INNER JOIN MFADEACMP CMP  ON
131500170721                   CDP.FREQUENCY_CODE = CMP.SRV_FREQUENCY_CODE
131600170721                   WHERE CMP.DEALER_CODE = :lc_DeadspDlrCode
131700170721125759               AND CMP.CURRENCY = "CAD"
131800170721                 END-EXEC
131900170721125759           IF li_PaymentFreq2 = 0
132000170721125759           EXEC SQL
132100170721125759             SELECT COALESCE(PAYMENTS_PER_ANNUM,0)
132200170721125759             INTO :li_PaymentFreq2
132300170721125759             FROM MFAFRECDP CDP
132400170721125759             INNER JOIN MFADEACMP CMP  ON
132500170721125759             CDP.FREQUENCY_CODE = CMP.SRV_FREQUENCY_CODE
132600170721125759             WHERE CMP.DEALER_CODE = :lc_DeadspDlrCode
132700170721125759               AND CMP.CURRENCY = "USD"
132800170721125759           END-EXEC
132900170721125759           End-If
133000170721125759           If li_PaymentFreq2 > 0
133100170721125759              Move li_PaymentFreq2 to li_PaymentFreq
133200170721125759           End-If
133300170721              END-IF
133400170721      *RFS112945 - End
13350017072140800         PERFORM CalcTrailerFromRate
13360017072140800      END-IF.
133700170721
13380017072140800 *    IF WS-DEALER-LEVEL-RATES = "Y"
13390017072140800 *      IF IS-LEAP-YEAR
13400017072140800 *         COMPUTE WS-DLY-TRAILER ROUNDED =
13410017072140800 *         ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
13420017072140800 *         * WS-DI-TRAIL-T-RATE(DIIDX)) * .00273224)
13430017072140800 *      ELSE
13440017072140800 *         COMPUTE WS-DLY-TRAILER ROUNDED =
13450017072140800 *         ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
13460017072140800 *         * WS-DI-TRAIL-T-RATE(DIIDX)) * .002739726)
13470017072140800 *    ELSE
13480017072140800 *      IF IS-LEAP-YEAR
13490017072140800 *         COMPUTE WS-DLY-TRAILER ROUNDED =
13500017072140800 *           ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
13510017072140800 *           * WS-IA-TRAIL-T-RATE(IACIDX)) * .00273224)
13520017072140800 *      ELSE
13530017072140800 *         COMPUTE WS-DLY-TRAILER ROUNDED =
13540017072140800 *           ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
13550017072140800 *           * WS-IA-TRAIL-T-RATE(IACIDX)) * .002739726)
13560017072140800 *    END-IF.
135700170721
135800170721******* rfs 19162 - begin
135900170721D19162*40800IF WS-MODULE-AUTH-SRVVAR NOT = "Y" OR WS-GRANDFATHER-CLIENT
13600017072140800      IF WS-MODULE-AUTH-SRVVAR NOT = "Y"
136100170721  ¦           GO TO DPR-UPDATE.
136200170721  ¦
136300210510      * RFS 1113297 - BEgins
136400210510  ¦   *    IF WS-IA-VAR-DATE-PREPARED(IACIDX) NOT = 0   AND
136500210510  ¦   *       WS-IA-VAR-START-DATE(IACIDX)    NOT = 0   AND
136600210510  ¦   *       PROCESS-DATE OF DEALER-REP-DLY-SRV-FEE >=
136700210510  ¦   *                       WS-IA-VAR-START-DATE(IACIDX)
136800210510  ¦        IF ((WS-IA-VAR-DATE-PREPARED(IACIDX) NOT = 0   AND
136900210510  ¦           WS-IA-VAR-START-DATE(IACIDX)    NOT = 0   AND
137000210510  ¦           PROCESS-DATE OF DEALER-REP-DLY-SRV-FEE >=
137100210510  ¦                           WS-IA-VAR-START-DATE(IACIDX))
137200210510              OR  WS-IA-VAR-CALC-FEE(IACIDX) = "Y")
137300210510  ¦   * RFS 1113297 - Ends
137400170721D19162        PERFORM CALC-FIX-UNITS          THRU CFU-EXIT
137500170721
137600170721      * RFS 60213 - begins.
137700170721              IF PASS-DLYACCRUAL = "Y"  AND
137800170721                 REVIEW-FLAG OF DEALER-REP-DLY-SRV-FEE = "Y"
137900170721                   MOVE 0 TO ln_Daily_Value_Actual_Var_Tot
138000170721                             ln_Daily_Value_Base_Var_Tot
138100170721              END-IF
138200170721      * RFS 60213 - ends.
138300170721
138400170721D19162        PERFORM CALC-VARIABLE-UNITS     THRU CVU-EXIT
138500170721
138600170721      * RFS 60213 - begins.
138700170721              IF PASS-DLYACCRUAL = "Y"  AND
138800170721                 REVIEW-FLAG OF DEALER-REP-DLY-SRV-FEE = "Y"
138900170721
139000170721                 IF ln_daily_Value_Actual_Var_Tot NOT = 0
139100170721                    MOVE ln_Daily_Value_Actual_Var_Tot TO
139200170721                       DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-FEE
139300170721                 END-IF
139400170721
139500170721                 IF ln_daily_Value_Base_Var_Tot NOT = 0
139600170721                    MOVE ln_Daily_Value_Base_Var_Tot TO
139700170721                         DAILY-VALUE-BASE-VAR OF DEALER-REP-DLY-SRV-FEE
139800170721                 END-IF
139900170721
140000170721                 IF DAILY-VALUE-ACTUAL-VAR
140100170721                    OF DEALER-REP-DLY-SRV-FEE  NOT = 0  AND
140200170721                    DAILY-VALUE-ACTUAL-FIX
140300170721                    OF DEALER-REP-DLY-SRV-FEE  NOT = 0
140400170721
140500170721                 COMPUTE DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE =
140600170721                     DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-FEE +
140700170721                     DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
140800170721
140900170721                 COMPUTE DAILY-VALUE-BASE   OF DEALER-REP-DLY-SRV-FEE =
141000170721                       DAILY-VALUE-BASE-VAR OF DEALER-REP-DLY-SRV-FEE +
141100170721                       DAILY-VALUE-BASE-FIX OF DEALER-REP-DLY-SRV-FEE
141200170721                 END-IF
141300170721              END-IF
141400170721      * RFS 60213 - ends.
141500170721
141600170721D19162        COMPUTE WS-DLY-TRAILER
141700170721  ¦                 = WS-DLY-TRAILER-FIX +  WS-DLY-TRAILER-VAR
141800170721D19162        ADD WS-DLY-TRAILER-FIX TO WS-IA-ACCRUED-FIX(IACIDX)
141900170721D19162        ADD WS-DLY-TRAILER-VAR TO WS-IA-ACCRUED-VAR(IACIDX)
142000170721D19162        ADD DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-FEE
142100170721D19162         TO WS-IA-TOTAL-ASSETS-VAR(IACIDX)
142200170721D19162        ADD DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
142300170721D19162         TO WS-IA-TOTAL-ASSETS-FIX(IACIDX)
142400170721D19162     END-IF.
142500170721D19162 DPR-UPDATE.
142600170721******* rfs 19162 - end
142700170721
142800170721      * RFS50587 moved the lines below to the Rewrite section to make
142900170721      * sure to calculate average assets even if Trailer rate is 0%
143000170721           ADD WS-DLY-TRAILER TO WS-IA-ACCRUED(IACIDX).
143100170721      *R91255 Starts
143200170721           ADD WS-DLY-TRAILER     TO li-AA-ACCRUED
143300170721           ADD WS-DLY-TRAILER-GF  TO li-AA-ACCRUED-GF
143400170721           ADD WS-DLY-TRAILER-VAR TO li-AA-ACCRUED-VAR
143500170721           ADD WS-DLY-TRAILER-FIX TO li-AA-ACCRUED-FIX
143600170721      *R91255 End
143700170721      * RFS18615 - Start
14380017072150587 *    ADD DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
14390017072150587 *                           TO WS-IA-TOTAL-ASSETS(IACIDX).
144000170721      * RFS18615 - End
14410017072140800      ADD WS-DLY-TRAILER-GF TO WS-IA-ACCRUED-GF(IACIDX).
14420017072150587 *    ADD DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE
14430017072150587 *                              TO WS-IA-TOTAL-ASSETS-GF(IACIDX).
144400170721
144500170721       DPR-REWRITE.
144600170721      * RFS50587 starts
144700170721           ADD DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
144800170721                                  TO WS-IA-TOTAL-ASSETS(IACIDX).
144900170721           ADD DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE
145000170721                                     TO WS-IA-TOTAL-ASSETS-GF(IACIDX).
145100170721      * RFS50587 ends
145200170721
145300170721           IF SF-AMT OF DEALER-REP-DLY-SRV-FEE NOT = WS-DLY-TRAILER
14540017072140800      OR SF-AMT-GF OF DEALER-REP-DLY-SRV-FEE NOT =
14550017072140800         WS-DLY-TRAILER-GF
145600170721             MOVE "Y"         TO WS-REWRITE-DLY-SRV-FEE
145700170721           END-IF.
145800170721
145900170721******* rfs 19162 - start
146000170721D19162*40800IF WS-MODULE-AUTH-SRVVAR NOT = "Y" OR WS-GRANDFATHER-CLIENT
14610017072140800      IF WS-MODULE-AUTH-SRVVAR NOT = "Y"
146200170721D19162        GO TO DPR-REWRITE-2.
146300170721
146400170721D19162     IF (SF-AMT-FIX OF DEALER-REP-DLY-SRV-FEE NOT =
146500170721  ¦             WS-DLY-TRAILER-FIX)
146600170721  ¦        OR (SF-AMT-VAR OF DEALER-REP-DLY-SRV-FEE NOT =
146700170721  ¦             WS-DLY-TRAILER-VAR)
146800170721  ¦           MOVE "Y"         TO WS-REWRITE-DLY-SRV-FEE
146900170721D19162     END-IF.
147000170721
147100170721D19162 DPR-REWRITE-2.
147200170721******* rfs 19162 - end
147300170721
147400170721           IF WS-REWRITE-DLY-SRV-FEE NOT = "Y"
147500170721              GO TO DPR-END-FEE
147600170721           END-IF.
147700170721
147800170721           MOVE WS-DLY-TRAILER TO SF-AMT OF DEALER-REP-DLY-SRV-FEE.
14790017072140800      MOVE WS-DLY-TRAILER-GF TO SF-AMT-GF
14800017072140800                                OF DEALER-REP-DLY-SRV-FEE.
148100170721
148200170721D19162*40800IF WS-MODULE-AUTH-SRVVAR = "Y" AND
148300170721D19162*40800  NOT WS-GRANDFATHER-CLIENT
14840017072140800      IF WS-MODULE-AUTH-SRVVAR = "Y"
148500170721D19162        MOVE WS-DLY-TRAILER-FIX
148600170721D19162          TO SF-AMT-FIX OF DEALER-REP-DLY-SRV-FEE
148700170721D19162        MOVE WS-DLY-TRAILER-VAR
148800170721D19162          TO SF-AMT-VAR OF DEALER-REP-DLY-SRV-FEE
148900170721D19162     END-IF.
149000170721
149100170721      * RFS18615 - Start
149200170721      ***  REWRITE DEALER-REP-DLY-SRV-FEE-REC.
149300170721           REWRITE DEALER-REP-DLY-SRV-FEE-REC
149400170721           INVALID KEY
149500170721              MOVE "99" TO WS-FILE-STATUS
149600170721              MOVE "DLR-REP-DLY-SRV-FEE "
149700170721                        TO WS-FILE-STATUS-FILE
149800170721              PERFORM LOG-FILE-STATUS.
149900170721      * RFS18615 - End
150000170721
150100170721       DPR-END-FEE.
150200170721
150300170721      * RFS145455 - Begin
150400170721           SET lb_AccrualAsOfLastDateNo TO TRUE.
150500170721
150600170721           MOVE PROCESS-DATE OF DEALER-REP-DLY-SRV-FEE
150700170721                             TO li-AA-LAST-TDATE.
150800170721
150900170721
151000170721           COMPUTE li-AA-ASSETS ROUNDED =
151100170721               DAILY-VALUE-ACTUAL    OF DEALER-REP-DLY-SRV-FEE.
151200170721
151300170721      * RFS146447 - Begin
151400170721
151500170721           COMPUTE li-ASSETS-VAR ROUNDED =
151600170721               DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-FEE.
151700170721
151800170721           COMPUTE li-ASSETS-FIX ROUNDED =
151900170721               DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE.
152000170721
152100170721           COMPUTE li-ASSETS-GF  ROUNDED =
152200170721               DAILY-VALUE-ACTUAL-GF  OF DEALER-REP-DLY-SRV-FEE.
152300170721
152400170721      * RFS146447 - End
152500170721           MOVE UNITS        OF DEALER-REP-DLY-SRV-FEE
152600170721                             TO li-AA-UNIT-BAL.
152700170721
152800170721           MOVE UNIT-PRICE   OF DEALER-REP-DLY-SRV-FEE
152900170721                             TO li-AA-UNIT-PRICE.
153000170721      * RFS145455 - End
153100170721           IF PROCESS-DATE OF DEALER-REP-DLY-SRV-FEE NOT =
153200170721              COMM-QEND
153300170721             GO TO DPR-EXIT
153400170721           END-IF.
153500170721
153600170721D19162*40800IF WS-MODULE-AUTH-SRVVAR = "Y" AND
153700170721      *40800  NOT WS-GRANDFATHER-CLIENT
153800170721D19162     IF WS-MODULE-AUTH-SRVVAR = "Y"
153900170721D19162*       MOVE DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-FEE
154000170721D19162*                      TO WS-IA-ASSETS-VAR(IACIDX)
154100170721X19182*       MOVE WS-VAR-ASSETS
154200170721X19162*         TO WS-IA-ASSETS-VAR(IACIDX)
15430017072125827 *       MOVE DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
15440017072125827 *                      TO WS-IA-ASSETS-FIX(IACIDX)
15450017072125827         COMPUTE WS-IA-ASSETS-FIX(IACIDX) ROUNDED =
15460017072125827              DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
154700170721D19162     END-IF.
154800170721      * RFS91255 - Start
154900170721      *    MOVE NO-OF-ACCOUNTS OF DEALER-REP-DLY-SRV-FEE
155000170721      *                      TO WS-IA-COUNTER(IACIDX).
155100170721           IF  lb_SRVFEA_EditNo
155200170721
155300170721               MOVE NO-OF-ACCOUNTS OF DEALER-REP-DLY-SRV-FEE
155400170721                             TO WS-IA-COUNTER(IACIDX)
155500170721
155600170721               MOVE UNITS OF DEALER-REP-DLY-SRV-FEE
155700170721                             TO WS-IA-UNIT-BAL(IACIDX)
155800170721           END-IF.
155900170721      * RFS91255 - End
156000170721
156100170721
15620017072125827 *    MOVE DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
156300170721  ¦   *                      TO WS-IA-ASSETS(IACIDX).
156400170721      *RFS91255 - Start
156500170721           IF  lb_SRVFEA_EditNo
156600170721  ¦        COMPUTE WS-IA-ASSETS(IACIDX) ROUNDED =
15670017072125827       DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
15680017072140800      COMPUTE WS-IA-ASSETS-GF(IACIDX) ROUNDED =
15690017072140800       DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE
157000170721           END-IF.
157100170721      *RFS91255 - End
157200170721
157300170721           MOVE UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE
157400170721                             TO WS-IA-UNIT-PRICE(IACIDX).
157500170721
157600170721           MOVE PROCESS-DATE OF DEALER-REP-DLY-SRV-FEE
157700170721                             TO WS-IA-LAST-TDATE(IACIDX).
157800170721      *RFS91255 - Start
157900170721      * RFS145455 - Begin
158000170721      * Moving the below statements before process-date check
158100170721      * to prevent incorrect assets when rep changes
158200170721      *    MOVE PROCESS-DATE OF DEALER-REP-DLY-SRV-FEE
158300170721      *                      TO li-AA-LAST-TDATE.
158400170721      *
158500170721           SET lb_AccrualAsOfLastDateYes TO TRUE.
158600170721
158700170721      *    COMPUTE li-AA-ASSETS ROUNDED =
158800170721      *        DAILY-VALUE-ACTUAL    OF DEALER-REP-DLY-SRV-FEE.
158900170721      *
159000170721      *    MOVE UNITS        OF DEALER-REP-DLY-SRV-FEE
159100170721      *                      TO li-AA-UNIT-BAL.
159200170721      *
159300170721      *    MOVE UNIT-PRICE   OF DEALER-REP-DLY-SRV-FEE
159400170721      *                      TO li-AA-UNIT-PRICE.
159500170721      * RFS145455 - End
159600170721
159700170721      * RFS152311 - Begin
159800170721      * Comment out below as lc-AA-CURRENCY-CODE is not referenced
159900170721      *    IF  CURR-INVESTMENT-CODE = WS-IA-INVESTMENT-CODE(IACIDX)
160000170721      *        MOVE WS-IA-CURRENCY-CODE(IACIDX)
160100170721      *                      TO lc-AA-CURRENCY-CODE
160200170721      *    END-IF.
160300170721      * RFS152311 - End
160400170721      *RFS91255 - End
160500170721
160600170721       DPR-EXIT.
160700170721           EXIT.
160800170721
160900170721      /
161000170721      *RFS91255 - Start
161100170721
161200170721       LEVEL-SUMMARY-1.
161300170721152311     SET li_CurrIndexPointer TO IACIDX.
161400170721161783     SET IACIDX TO IACIDXL.
161500170721161783     SET lb_FirstPassNo TO TRUE.
161600170721
161700170721           IF  lb_SRVFEA_EditNo
161800170721               GO TO LS1-EXIT
161900170721           End-IF.
162000170721
162100170721           IF  WS-BYPASS-DEALER = "Y"
162200170721               GO TO LS1-EXIT
162300170721           End-IF.
162400170721
162500170721      *RFS112945- Begin
162600170721      *    IF  li-AA-ACCRUED = 0 and li-AA-ASSETS = 0
162700170721           IF  (li-AA-ACCRUED = 0 and li-AA-ASSETS = 0
162800170721160475          AND li-AA-ACCRUED-GF = 0
162900170721                AND lb_CalcTrailForHRateNo)
163000170721      *RFS112945- End
163100170721               GO TO LS1-EXIT
163200170721           END-IF.
163300170721
163400170721      * RFS152311 - Begin
163500170721      *    SET IACIDX        TO 1.
163600170721      *
163700170721      *    SEARCH WS-INVESTMENT-ACCRUAL-ENTRY VARYING IACIDX
163800170721      *    WHEN WS-IA-INVESTMENT-CODE(IACIDX) IS EQUAL
163900170721      *    PREV-INVESTMENT-CODE
164000170721
164100170721161783*    SET IACIDX TO IACIDXL.
164200170721      * RFS152311 - Begin
164300170721           ADD 1 TO WS-IA-COUNTER(IACIDX)
164400170721           COMPUTE WS-IA-ASSETS(IACIDX) ROUNDED  =
164500170721           WS-IA-ASSETS(IACIDX) +  PREV-DAILY-VALUE-ACTUAL
164600170721
164700170721           COMPUTE WS-IA-ASSETS-GF(IACIDX) ROUNDED =
164800170721           WS-IA-ASSETS-GF(IACIDX)  +  PREV-DAILY-VALUE-ACTUAL-GF
164900170721
165000170721           COMPUTE WS-IA-UNIT-BAL(IACIDX)  ROUNDED =
165100170721           WS-IA-UNIT-BAL(IACIDX)   +  PREV-UNITS
165200170721152311*    END-SEARCH
165300170721      *RFS161783- Moved in the beginning of this routine.
165400170721152311*    SET lb_FirstPassNo TO TRUE.
165500170721      *RFS161783- End
165600170721
165700170721130093     SET LMTIDX TO 0.
165800170721           INITIALIZE MFATRAPAP OF TRAILER-ACCOUNT-REC.
165900170721           MOVE "N"        TO TRAILER-RECORD-TYPE-CODE
166000170721                                    OF TRAILER-ACCOUNT-REC.
166100170721           MOVE 1          TO NO-OF-ACCOUNTS OF TRAILER-ACCOUNT-REC.
166200170721           MOVE WS-QEND-YY TO YEAR  OF TRAILER-ACCOUNT-REC.
166300170721           MOVE WS-QEND-MM TO MONTH OF TRAILER-ACCOUNT-REC.
166400170721129430*    MOVE lc-AA-CURRENCY-CODE TO CURRENCY-DDS
166500170721129430*                             OF TRAILER-ACCOUNT-REC.
166600170721129430     MOVE WS-IA-CURRENCY-CODE(IACIDX) TO CURRENCY-DDS
166700170721129430                              OF TRAILER-ACCOUNT-REC.
166800170721           MOVE PREV-DEALER-CODE  TO DEALER-CODE
166900170721                                    OF TRAILER-ACCOUNT-REC
167000170721           MOVE PREV-REP-CODE TO DEALER-REP-CODE
167100170721                                    OF TRAILER-ACCOUNT-REC.
167200170721
167300170721           MOVE PREV-INVESTMENT-CODE TO INVESTMENT-CODE
167400170721                                    OF TRAILER-ACCOUNT-REC.
167500170721           MOVE PREV-ACCOUNT-NO TO ACCOUNT-NO
167600170721                                    OF TRAILER-ACCOUNT-REC.
167700170721145730     MOVE PREV-DEALER-ACCOUNT-NO TO DEALER-ACCOUNT-NO
167800170721145730                              OF TRAILER-ACCOUNT-REC.
167900170721              COMPUTE WS-NEW-TRAILER-AMT
168000170721130093*             = li-AA-ACCRUED -
168100170721130093              = li-AA-ACCRUED
168200170721130093*               li-AA-ACCRUED-FIX -
168300170721130093*               li-AA-ACCRUED-VAR
168400170721160162*    COMPUTE GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC ROUNDED =
168500170721160162     COMPUTE GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC =
168600170721           WS-NEW-TRAILER-AMT.
168700170721
168800170721           MOVE GROSS-TRAILER-AMT   OF TRAILER-ACCOUNT-REC TO
168900170721                    NET-TRAILER-AMT OF TRAILER-ACCOUNT-REC.
169000170721           MOVE "N"    TO ELIGIBLE-FOR-PAYMENT
169100170721                                    OF TRAILER-ACCOUNT-REC.
169200170721           MOVE li-AA-ASSETS TO ASSETS
169300170721                                    OF TRAILER-ACCOUNT-REC.
169400170721           MOVE li-AA-UNIT-BAL TO UNIT-BAL
169500170721                                    OF TRAILER-ACCOUNT-REC.
169600170721
169700170721           MOVE li-AA-UNIT-PRICE TO UNIT-PRICE
169800170721                                    OF TRAILER-ACCOUNT-REC.
169900170721           MOVE li-AA-LAST-TDATE TO LAST-TRADE-DATE
170000170721                                    OF TRAILER-ACCOUNT-REC.
170100170721
170200170721      * RFS130093 - Begin
170300170721           MOVE li-AA-ACCRUED-VAR TO GROSS-TRAILER-AMT-VAR
170400170721                                    OF TRAILER-ACCOUNT-REC.
170500170721           MOVE GROSS-TRAILER-AMT-VAR   OF TRAILER-ACCOUNT-REC TO
170600170721                    NET-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC.
170700170721
170800170721           MOVE li-AA-ACCRUED-FIX TO GROSS-TRAILER-AMT-FIX
170900170721                                    OF TRAILER-ACCOUNT-REC.
171000170721           MOVE GROSS-TRAILER-AMT-FIX   OF TRAILER-ACCOUNT-REC TO
171100170721                    NET-TRAILER-AMT-FIX OF TRAILER-ACCOUNT-REC.
171200170721
171300170721           MOVE li-AA-ACCRUED-GF  TO GROSS-TRAILER-AMT-GF
171400170721                                    OF TRAILER-ACCOUNT-REC.
171500170721           MOVE GROSS-TRAILER-AMT-GF    OF TRAILER-ACCOUNT-REC TO
171600170721                    NET-TRAILER-AMT-GF  OF TRAILER-ACCOUNT-REC.
171700170721
171800170721146447*    MOVE WS-IA-ASSETS-FIX(IACIDX)
171900170721146447     MOVE li-ASSETS-FIX
172000170721                              TO ASSETS-FIX OF TRAILER-ACCOUNT-REC.
172100170721
172200170721146447*    MOVE WS-IA-ASSETS-GF(IACIDX)
172300170721146447     MOVE li-ASSETS-GF
172400170721                              TO ASSETS-GF  OF TRAILER-ACCOUNT-REC.
172500170721
172600170721146447     MOVE li-ASSETS-VAR
172700170721146447                        TO ASSETS-VAR OF TRAILER-ACCOUNT-REC.
172800170721
172900170721           COMPUTE AVERAGE-ASSETS-FIX OF TRAILER-ACCOUNT-REC ROUNDED =
173000170721                   WS-IA-TOTAL-ASSETS-FIX(IACIDX) / WS-DAYS.
173100170721
173200170721           COMPUTE AVERAGE-ASSETS-GF  OF TRAILER-ACCOUNT-REC ROUNDED =
173300170721                   WS-IA-TOTAL-ASSETS-GF(IACIDX)  / WS-DAYS.
173400170721
173500170721           COMPUTE AVERAGE-ASSETS-VAR OF TRAILER-ACCOUNT-REC ROUNDED =
173600170721                   WS-IA-TOTAL-ASSETS-VAR(IACIDX) / WS-DAYS.
173700170721
173800170721       LS1-0010.
173900170721      * RFS146447 - Begin
174000170721      *    SET LMTIDX UP BY 1.
174100170721      *    IF LMTIDX > 20  OR  WS-INV-LMT-SCHED(IACIDX, LMTIDX) = " "
174200170721      *       GO TO LS1-0020.
174300170721      *
174400180920      *    ADD WS-INV-LMT-ASSETS(IACIDX, LMTIDX) TO
174500170721      *         ASSETS-VAR OF TRAILER-ACCOUNT-REC.
174600170721      *
174700170721      *    GO TO LS1-0010.
174800170721
174900170721           IF ASSETS-VAR OF TRAILER-ACCOUNT-REC NOT = 0 OR
175000170721              ASSETS-FIX OF TRAILER-ACCOUNT-REC NOT = 0
175100170721           COMPUTE ASSETS OF TRAILER-ACCOUNT-REC
175200170721              = ASSETS-VAR OF TRAILER-ACCOUNT-REC +
175300170721                ASSETS-FIX OF TRAILER-ACCOUNT-REC
175400170721           END-IF.
175500170721
175600170721      * RFS146447 - End
175700170721
175800170721       LS1-0020.
175900170721
176000170721130093* Sum up the Assets, Assets var, Assets fix & Assets Gf
176100170721130093* to retain the Mfatrapp totals for these - as if it's
176200170721130093* not broken down by account
176300170721      * RFS145455 - Begin
176400170721      *    Compute li_TotalAssets = li_TotalAssets +
176500170721      *                             Assets of Trailer-account-rec.
176600170721      *    Compute li_TotalAssetsVar = li_TotalAssetsVar +
176700170721      *                             Assets-var of Trailer-account-rec.
176800170721      *    Compute li_TotalAssetsFix = li_TotalAssetsFix +
176900170721      *                             Assets-fix of Trailer-account-rec.
177000170721      *    Compute li_TotalAssetsGF  = li_TotalAssetsGF  +
177100170721      *                             Assets-gf of Trailer-account-rec.
177200170918
177300170919      *RFS173261 - Starts
177400170918           IF lb_CalcTrailForPRateYes
177500170918              COMPUTE ASSETS OF TRAILER-ACCOUNT-REC ROUNDED =
177600170918                  ( li-AA-UNIT-BAL * li-AA-UNIT-PRICE )
177700170918           END-IF.
177800170919      *RFS173261 -Ends
177900170918
178000170721           IF lb_AccrualAsOfLastDateYes
178100170721            Compute li_TotalAssets = li_TotalAssets +
178200170721                                    Assets of Trailer-account-rec
178300170721            Compute li_TotalAssetsVar = li_TotalAssetsVar +
178400170721                                    Assets-var of Trailer-account-rec
178500170721            Compute li_TotalAssetsFix = li_TotalAssetsFix +
178600170721                                    Assets-fix of Trailer-account-rec
178700170721            Compute li_TotalAssetsGF  = li_TotalAssetsGF  +
178800170721                                    Assets-gf of Trailer-account-rec
178900170721            Compute ln_TotalNoOfAccounts = ln_TotalNoOfAccounts +
179000170721                                No-of-accounts of Trailer-account-rec
179100170721           END-IF.
179200170721      * RFS145455 - End
179300170721      * RFS130093 - End
179400170721
179500170721154537     PERFORM ALIGN_SS_LS.
179600170721169622     PERFORM FIX-NEGATIVE-AMT.
179700170721           WRITE TRAILER-ACCOUNT-REC
179800170721           INVALID KEY
179900170721              MOVE "99" TO WS-FILE-STATUS
180000170721              MOVE "TRAILER-ACCOUNT-PAYMENT"
180100170721                        TO WS-FILE-STATUS-FILE
180200170721              PERFORM LOG-FILE-STATUS.
180300170721
180400170721           MOVE ZEROES TO   li-AA-ACCRUED
180500170721                            li-AA-ACCRUED-GF
180600170721                            li-AA-ACCRUED-FIX
180700170721                            li-AA-ACCRUED-VAR.
180800170721
180900170721       LS1-EXIT.
181000170721           EXIT.
181100170721
181200170721      *RFS91255 - End
181300170721      /
181400170721       LEVEL-SUMMARY-2.
181500170721      * Summary for Dealer Rep
181600170721
181700170721           SET IACIDX TO 1.
181800170721           SET IACIDX DOWN BY 1.
181900170721
182000170721       LS2-0010.
182100170721152311*    SET IACIDX UP BY 1.
182200170721152311     SET IACIDX TO IACIDXL.
182300170721
182301211019      *RFS1115236 - Starts
182302211019           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
182303211019             SET li_CurrIndexPointer TO IACIDX
182304211019           END-IF
182305211019      *RFS1115236 - Ends
182306211019
182400170721           IF WS-IA-INVESTMENT-CODE(IACIDX) IS EQUAL TO SPACES
182500170721             GO TO LS2-EXIT
182600170721           END-IF.
182700170721
182800170721
182900170721           IF WS-IA-PROCESSED(IACIDX) NOT = "Y"
183000170721152311*      GO TO LS2-0010
183100170721152311       GO TO LS2-EXIT
183200170721           END-IF.
183300170721
183400170721
183500170721           IF WS-IA-ASSETS(IACIDX)  IS EQUAL TO 0 AND
183600170721              WS-IA-ACCRUED(IACIDX) IS EQUAL TO 0
18370017072140800         AND WS-IA-ASSETS-GF(IACIDX)  = 0
18380017072140800         AND WS-IA-ACCRUED-GF(IACIDX) = 0
183900170721112945        AND lb_CalcTrailForHRateNo
184000170721152311*       GO TO LS2-0010
184100170721152311        GO TO LS2-EXIT
184200170721           END-IF.
184300170721R47438     INITIALIZE MFATRAPP OF TRAILER-REC.
184400170721
184500170721           MOVE "N"           TO TRAILER-RECORD-TYPE-CODE
184600170721                                 OF TRAILER-REC.
184700170721           MOVE WS-QEND-YY    TO YEAR OF TRAILER-REC.
184800170721           MOVE WS-QEND-MM    TO MONTH OF TRAILER-REC.
184900170721           MOVE WS-IA-CURRENCY-CODE(IACIDX)
185000170721                              TO CURRENCY-DDS OF TRAILER-REC.
185100170721           MOVE PREV-DEALER-CODE
185200170721                              TO DEALER-CODE  OF TRAILER-REC.
185300170721           MOVE PREV-REP-CODE
185400170721                              TO DEALER-REP-CODE OF TRAILER-REC.
185500170721           MOVE WS-IA-INVESTMENT-CODE(IACIDX)
185600170721                              TO INVESTMENT-CODE OF TRAILER-REC.
185700200525      *RFS 1081324 Begin
185800200525           Move INVESTMENT-CODE OF TRAILER-REC TO lc_InvestmentCode1
185900200525           Move CURRENCY-DDS OF TRAILER-REC    TO lc_CurrencyCode1
186000200525
186100200605           EXEC SQL
186200200605             SELECT Count(1)
186300200605               INTO :li_Count
186400200605               FROM MFATRAPP
186500200605             WHERE
186600200605             DEALER_CODE               = :PREV-DEALER-CODE      AND
186700200605             DEALER_REP_CODE           = :PREV-REP-CODE         AND
186800200605             TRAILER_RECORD_TYPE_CODE  = "N"                    AND
186900200605             INVESTMENT_CODE           = :lc_InvestmentCode1    AND
187000200605             CURRENCY                  = :lc_CurrencyCode1      AND
187100200605             YEAR                      = :WS-QEND-YY            AND
187200200605             MONTH                     = :WS-QEND-MM
187300200605           END-EXEC
187400200605
187500200605           IF li_Count > 0
187600200605
187700200525             EXEC SQL
187800200605               SELECT
187900200605                      GROSS_TRAILER_AMT,
188000200605                      GROSS_TRAILER_AMT_GF,
188100200605                      NO_OF_ACCOUNTS,
188200200605                      ASSETS,
188300200605                      ASSETS_GF,
188400200605                      UNIT_BAL,
188500200605                      AVERAGE_ASSETS,
188600200605                      AVERAGE_ASSETS_GF,
188700200605                      GROSS_TRAILER_AMT_FIX,
188800200605                      AVERAGE_ASSETS_FIX,
188900200605                      AVERAGE_ASSETS_VAR,
189000200605                      ASSETS_FIX
189100200605                 INTO
189200200605                      :PREV-GROSS-TRL-AMT,
189300200605                      :PREV-GROSS-TRL-AMT-GF,
189400200605                      :PREV-NO-OF-ACCOUNTS,
189500200605                      :PREV-ASSETS,
189600200605                      :PREV-ASSETS-GF,
189700200605                      :PREV-UNIT-BAL,
189800200605                      :PREV-AVG-ASSETS ,
189900200605                      :PREV-AVG-ASSETS-GF,
190000200605                      :PREV-GROSS-TRL-AMT-FIX,
190100200605                      :PREV-AVG-ASSETS-FIX,
190200200605                      :PREV-AVG-ASSETS-VAR,
190300200605                      :PREV-ASSETS-FIX
190400200525                 FROM MFATRAPP
190500200525               WHERE
190600200525               DEALER_CODE               = :PREV-DEALER-CODE      AND
190700200525               DEALER_REP_CODE           = :PREV-REP-CODE         AND
190800200525               TRAILER_RECORD_TYPE_CODE  = "N"                    AND
190900200525               INVESTMENT_CODE           = :lc_InvestmentCode1    AND
191000200525               CURRENCY                  = :lc_CurrencyCode1      AND
191100200525               YEAR                      = :WS-QEND-YY            AND
191200200525               MONTH                     = :WS-QEND-MM
191300200525             END-EXEC
191400200605
191500200605             PERFORM Recalc-Trailer-Payment
191600200605
191700200605             END-IF.
191800200525      *RFS 1081324 End
191900170721           COMPUTE GROSS-TRAILER-AMT OF TRAILER-REC ROUNDED =
192000170721                   WS-IA-ACCRUED(IACIDX).
19210017072140800      COMPUTE GROSS-TRAILER-AMT-GF OF TRAILER-REC ROUNDED =
19220017072140800              WS-IA-ACCRUED-GF(IACIDX).
192300170721
192400170721      * RFS18615 - Start
192500170721           COMPUTE AVERAGE-ASSETS OF TRAILER-REC ROUNDED =
192600170721                   WS-IA-TOTAL-ASSETS(IACIDX) / WS-DAYS.
192700170721      * RFS18615 - End
19280017072140800      COMPUTE AVERAGE-ASSETS-GF OF TRAILER-REC ROUNDED =
19290017072140800              WS-IA-TOTAL-ASSETS-GF(IACIDX) / WS-DAYS.
193000170721
193100170721           MOVE GROSS-TRAILER-AMT OF TRAILER-REC
193200170721                              TO NET-TRAILER-AMT OF TRAILER-REC.
19330017072140800      MOVE GROSS-TRAILER-AMT-GF OF TRAILER-REC
19340017072140800                         TO NET-TRAILER-AMT-GF OF TRAILER-REC.
193500170721           MOVE ZEROES        TO GROSS-TRAILER-AMT-NEW OF TRAILER-REC
193600170721                                 NET-TRAILER-AMT-NEW OF TRAILER-REC.
193700170721      * RFS145455 - Begin
193800170721      *    MOVE WS-IA-COUNTER(IACIDX)
193900170721           MOVE ln_TotalNoOfAccounts
194000170721      * RFS145455 - End
194100170721                              TO NO-OF-ACCOUNTS OF TRAILER-REC.
194200170721           MOVE "N"           TO ELIGIBLE-FOR-PAYMENT OF TRAILER-REC.
194300170721130093* begin
194400170721130093*    MOVE WS-IA-ASSETS(IACIDX)
194500170721130093     MOVE li_TotalAssets
194600170721                              TO ASSETS OF TRAILER-REC.
194700170721130093*    MOVE WS-IA-ASSETS-GF(IACIDX)
194800170721130093     MOVE li_TotalAssetsGF
19490017072140800                         TO ASSETS-GF OF TRAILER-REC.
195000170721130093* end
195100170721           MOVE WS-IA-UNIT-BAL(IACIDX)
195200170721                              TO UNIT-BAL OF TRAILER-REC.
195300170721           MOVE WS-IA-UNIT-PRICE(IACIDX)
195400170721                              TO UNIT-PRICE OF TRAILER-REC.
195500170721           MOVE WS-IA-LAST-TDATE(IACIDX)
195600170721                              TO LAST-TRADE-DATE OF TRAILER-REC.
195700170721
195800170721******* rfs 19162 - begin
195900170721D19162*40800IF WS-MODULE-AUTH-SRVVAR NOT = "Y" OR WS-GRANDFATHER-CLIENT
19600017072140800      IF WS-MODULE-AUTH-SRVVAR NOT = "Y"
196100170721D19162        GO TO LS2-0500.
196200170721  ¦
196300170721  ¦        COMPUTE GROSS-TRAILER-AMT-FIX OF TRAILER-REC ROUNDED =
196400170721  ¦                WS-IA-ACCRUED-FIX(IACIDX).
196500170721  ¦        COMPUTE AVERAGE-ASSETS-FIX OF TRAILER-REC ROUNDED =
196600170721  ¦                WS-IA-TOTAL-ASSETS-FIX(IACIDX) / WS-DAYS.
196700170721  ¦
196800170721X19162*    COMPUTE GROSS-TRAILER-AMT-VAR OF TRAILER-REC ROUNDED =
196900170721X19162*            WS-IA-ACCRUED-VAR(IACIDX).
197000170721D19162     COMPUTE AVERAGE-ASSETS-VAR OF TRAILER-REC ROUNDED =
197100170721  ¦                WS-IA-TOTAL-ASSETS-VAR(IACIDX) / WS-DAYS.
197200170721  ¦
197300170721  ¦        MOVE GROSS-TRAILER-AMT-FIX OF TRAILER-REC
197400170721  ¦                           TO NET-TRAILER-AMT-FIX OF TRAILER-REC.
197500170721X19162*    MOVE GROSS-TRAILER-AMT-VAR OF TRAILER-REC
197600170721X19162*                       TO NET-TRAILER-AMT-VAR OF TRAILER-REC.
197700170721130093* begin
197800170721  ¦   *    MOVE WS-IA-ASSETS-FIX(IACIDX)
197900170721130093     MOVE li_TotalAssetsFix
198000170721130093* end
198100170721  ¦                           TO ASSETS-FIX OF TRAILER-REC.
198200170721X19162*    MOVE WS-IA-ASSETS-VAR(IACIDX)
198300170721X19162*                       TO ASSETS-VAR OF TRAILER-REC.
198400170721
198500170721D19162 LS2-0500.
198600170721******* rfs 19162 - end
198700170721
198800170721R10953*    Skip Traler Payment record?
198900170721R10953
199000170721R10953     IF SRVZRO-BYPASS-YES                           AND
199100170721R10953        WS-IA-DEALER-LEVEL-RATES (IACIDX) NOT = "Y" AND
199200170721D19162        WS-IA-TRAIL-V-RATE (IACIDX) = 0             AND
199300170721R10953        WS-IA-TRAIL-T-RATE (IACIDX) = 0             AND
19940017072140800         WS-IA-TRAIL-H-RATE (IACIDX) = 0             AND
199500170721167811        WS-IA-TRAIL-P-RATE (IACIDX) = 0             AND
199600170721R10953        WS-IA-TRAIL-S-RATE (IACIDX) = 0
199700170721R10953        GO TO LS2-CONT.
199800170721
199900170721      * RFS 26845 - Begins
200000170721      * Bypass write of Trailer Payment when Commission-Bonus-Source
200100170721      * = "E" and and Split Service Fees by Rep "CAPFEE" = "Y"
200200170721           IF WS-BYPASS-DEALER = "Y"
200300170721              GO TO LS2-CONT
200400170721           END-IF.
200500170721      * RFS 26845 - Ends
200600170721
200700170721D19162*40800IF WS-MODULE-AUTH-SRVVAR = "Y" AND NOT WS-GRANDFATHER-CLIENT
20080017072140800      IF WS-MODULE-AUTH-SRVVAR = "Y"
200900170721   |          PERFORM WRITE-TRAP-V     THRU WTV-EXIT
201000170721X19162        MOVE WS-VAR-TRAILER-AMT
201100170721X19162          TO GROSS-TRAILER-AMT-VAR OF TRAILER-REC
201200170721X19162             NET-TRAILER-AMT-VAR OF TRAILER-REC
201300170721RT    * rfs 25827 - start
201400170721130093* begin
201500170721X19162*       MOVE WS-VAR-ASSETS
201600170721130093        MOVE li_TotalAssetsVar
201700170721130093* end
201800170721X19162          TO ASSETS-VAR OF TRAILER-REC
201900170721RT    *         COMPUTE ASSETS-VAR OF TRAILER-REC ROUNDED =
202000170721RT    *                 WS-VAR-ASSETS
202100170721RT    * rfs 25827 - end
202200170721
202300170721      *** fix rounding issues
202400170721      *** re-calc the new amount without fix and var
20250017072126386         COMPUTE WS-NEW-TRAILER-AMT
20260017072126386               = WS-IA-ACCRUED(IACIDX) -
20270017072126386                 WS-IA-ACCRUED-FIX(IACIDX) -
20280017072126386                 WS-IA-ACCRUED-VAR(IACIDX)
20290017072126386         COMPUTE GROSS-TRAILER-AMT OF TRAILER-REC
20300017072126386              ROUNDED = WS-NEW-TRAILER-AMT
203100170721
203200170721X19162        COMPUTE GROSS-TRAILER-AMT OF TRAILER-REC
203300170721X19162             = GROSS-TRAILER-AMT-FIX OF TRAILER-REC  +
203400170721                     GROSS-TRAILER-AMT-VAR OF TRAILER-REC
20350017072126386                + GROSS-TRAILER-AMT OF TRAILER-REC
203600170721
203700170721X19162        MOVE GROSS-TRAILER-AMT OF TRAILER-REC
203800170721X19162          TO NET-TRAILER-AMT   OF TRAILER-REC
203900170721
20400017072126386         IF ASSETS-VAR OF TRAILER-REC NOT = 0 OR
20410017072126386            ASSETS-FIX OF TRAILER-REC NOT = 0
204200170721X19162        COMPUTE ASSETS OF TRAILER-REC
204300170721X19162           = ASSETS-VAR OF TRAILER-REC +
204400170721                   ASSETS-FIX OF TRAILER-REC
20450017072126386         END-IF
204600170721D19162     END-IF.
204700170721
204800170721162565     PERFORM ALIGN_LAST_ROUNDING
204900170721      * RFS18615 - Start
205000170721      ***  WRITE TRAILER-REC.
205100200604      *RFS 1081324 Begin
205200200604           IF li_Count NOT = 0
205300200604           REWRITE TRAILER-REC
205400200604           INVALID KEY
205500200604              MOVE "99" TO WS-FILE-STATUS
205600200604              MOVE "TRAILER-PAYMENT     "
205700200604                        TO WS-FILE-STATUS-FILE
205800200604              PERFORM LOG-FILE-STATUS
205900200604           ELSE
206000170721           WRITE TRAILER-REC
206100170721           INVALID KEY
206200170721              MOVE "99" TO WS-FILE-STATUS
206300170721              MOVE "TRAILER-PAYMENT     "
206400170721                        TO WS-FILE-STATUS-FILE
206500200605              PERFORM LOG-FILE-STATUS
206600200605      *       PERFORM LOG-FILE-STATUS.
206700200605           END-IF.
206800200605      *RFS 1081324 End
206900170721      * RFS18615 - End
207000170721
207100170721R10953 LS2-CONT.
207200170721R10953
207300170721X19162     MOVE 0 TO WS-VAR-ASSETS
207400170721130093               li_TotalAssets
207500170721130093               li_TotalAssetsVar
207600170721130093               li_TotalAssetsFix
207700170721130093               li_TotalAssetsGF
207800170721145455               ln_TotalNoOfAccounts
207900170721154537               WS-NEW-TRAILER-AMT2
208000170721154537               WS-NEW-TRAILER-AMT6
208100170721154537               WS-VARIANCE-AMT
208200170721160475               WS-NEW-TRAILER-AMT2-GF
208300170721160475               WS-NEW-TRAILER-AMT6-GF
208400170721160475               WS-VARIANCE-AMT-GF
208500170721X19162               WS-VAR-TRAILER-AMT.
208600170721152311*    GO TO LS2-0010.
208700170721
208800170721       LS2-EXIT.
208900170721           EXIT.
209000170721
209100170721      /
209200170721       LEVEL-REINIT-1.
209300170721      * Initialization for investment
209400170721
209500170721      * RFS152311 - Begin
209600170721      *    SET IACIDX        TO 1.
209700170721      *    SEARCH WS-INVESTMENT-ACCRUAL-ENTRY VARYING IACIDX
209800170721      *    WHEN WS-IA-INVESTMENT-CODE(IACIDX) IS EQUAL
209900170721      *    INVESTMENT-CODE OF DEALER-REP-DLY-SRV-FEE
210000170721      *      MOVE "Y"        TO WS-IA-PROCESSED(IACIDX)
210100170721      *    GO TO LR1-0010.
210200170721
210300170721           IF lb_FirstPassNo
210400170721            SET IACIDX  TO  li_CurrIndexPointer
210500170721           END-IF.
210600170721
210700170721           MOVE lncc_Y   TO  WS-IA-PROCESSED(IACIDX).
210800170721
210900170721      * RFS152311 - End
211000170721       LR1-0010.
211100170721      * RFS152311 - Begin
211200170721           IF CURR-DEALER-CODE = PREV-DEALER-CODE AND
211300170721              CURR-INVESTMENT-CODE = PREV-INVESTMENT-CODE
211400170721             GO TO LR1-EXIT
211500170721           END-IF.
211600170721      * RFS152311 - End
211700170721
211800170721           MOVE "N"     TO WS-DEALER-LEVEL-RATES.
211900170721
212000170721
212100170721           SET DIIDX TO 1.
212200170721           SEARCH WS-DI-RATES-ENTRY VARYING DIIDX
212300170721           WHEN CURR-DEALER-CODE IS EQUAL WS-DI-DEALER-CODE(DIIDX) AND
212400170721                INVESTMENT-CODE OF DEALER-REP-DLY-SRV-FEE EQUAL
212500170721                WS-DI-INVESTMENT-CODE(DIIDX)
212600170721                MOVE "Y"     TO WS-DEALER-LEVEL-RATES
212700170721R10953          GO TO LR1-0020
212800170721           WHEN WS-DI-DEALER-CODE(DIIDX) IS EQUAL SPACES
212900170721R10953          GO TO LR1-0020.
213000170721
213100170721R10953 LR1-0020.
213200170721R10953
213300170721R10953     MOVE WS-DEALER-LEVEL-RATES
213400170721R10953                       TO WS-IA-DEALER-LEVEL-RATES (IACIDX).
213500170721
213600170721       LR1-EXIT.
213700170721           EXIT.
213800170721
213900170721      /
214000170721       LEVEL-REINIT-2.
214100170721
214200170721      *RFS-21203 - Begin
214300170721      * Bypass processing Dealer if Commission Bonus Source is = "E"
214400170721      * and Split Service Fees by Rep "CAPFEE" = "Y"
214500170721
214600170721      * RFS 29449 - Begin
214700170721      * The Dealer-Commissions file will be read here to determine
214800170721      * the frequency code of the dealer.
214900170721
215000170721R51999     MOVE "N" TO  WS-BYPASS-DEALER.
215100170721           Perform Dealer-Commissions-Rtn Thru Dcr-Exit.
215200170721           If Srv-Frequency-Code = 'QT'
215300170721              Move Ws-Qtr-Days to Ws-Days
215400170721Ade   *       Display "Ws-Qtr-Days :" Ws-Qtr-Days
215500170721      * RFS 33507 Begin
215600170721           Else
215700170721Ade   *       Display "Ws-Set-Days :" Ws-Set-Days
215800170721              Move Ws-Set-Days to Ws-Days
215900170721      * RFS 33507 End
216000170721           End-If.
216100170721
216200170721      * RFS 29449 - End
216300170721
216400170721           IF CAPFEE-BYPASS-YES
216500170721R51999*       MOVE "N" TO  WS-BYPASS-DEALER
216600170721      *       PERFORM DEALER-COMMISSIONS-RTN THRU DCR-EXIT
216700170721              IF WS-BYPASS-DEALER = "Y"
216800170721                 GO TO LR2-EXIT
216900170721              END-IF
217000170721           END-IF.
217100170721
217200170721      *RFS-21203 - End
217300170721
217400170721      * Initialization for Dealer Rep
217500170721
217600170721      * RFS152311 - Begin
217700170721           IF lb_FirstPassYes
217800170721            GO TO LR2-EXIT
217900170721           END-IF.
218000170721      * RFS152311 - Begin
218100170721           SET IACIDX TO 1.
218200170721           SET IACIDX DOWN BY 1.
218300170721
218400170721       LR2-0010.
218500170721
218600170721152311*    SET IACIDX UP BY 1.
218700170721152311     SET IACIDX TO IACIDXL.
218800170721
218900170721           IF WS-IA-INVESTMENT-CODE(IACIDX) IS EQUAL TO SPACES
219000170721             GO TO LR2-EXIT
219100170721           END-IF.
219200170721
219300170721           MOVE SPACES        TO WS-IA-PROCESSED(IACIDX).
219400170721R10953     MOVE SPACES        TO WS-IA-DEALER-LEVEL-RATES(IACIDX).
219500170721           MOVE ZEROES        TO WS-IA-ACCRUED(IACIDX)
21960017072140800                            WS-IA-ACCRUED-GF(IACIDX)
219700170721      * RFS18615 - Start
219800170721                                 WS-IA-TOTAL-ASSETS(IACIDX)
21990017072140800                            WS-IA-TOTAL-ASSETS-GF(IACIDX)
220000170721      * RFS18615 - End
220100170721D19162                           WS-IA-ACCRUED-FIX(IACIDX)
220200170721D19162                           WS-IA-ACCRUED-VAR(IACIDX)
220300170721D19162                           WS-IA-ASSETS-FIX(IACIDX)
220400170721D19162                           WS-IA-ASSETS-VAR(IACIDX)
220500170721D19162                           WS-IA-TOTAL-ASSETS-FIX(IACIDX)
220600170721D19162                           WS-IA-TOTAL-ASSETS-VAR(IACIDX)
220700170721D19162                           WS-IA-TRAIL-V-RATE(IACIDX)
22080017072191255                            WS-IA-COUNTER(IACIDX)
220900170721                                 WS-IA-ASSETS(IACIDX)
22100017072140800                            WS-IA-ASSETS-GF(IACIDX)
221100170721                                 WS-IA-UNIT-BAL(IACIDX)
221200170721                                 WS-IA-UNIT-PRICE(IACIDX)
221300170721                                 WS-IA-LAST-TDATE(IACIDX).
221400170721
221500170721152311     IF WS-MODULE-AUTH-SRVVAR = lncc_Y
221600170721D19162     PERFORM VARYING LMTIDX    FROM 1 BY 1
221700170721      *RFS139475 - Start
221800170721  ¦   *            UNTIL LMTIDX > 100
221900170721                   UNTIL LMTIDX > 20
222000170721      *RFS139475 - Ends
222100170721  ¦             INITIALIZE WS-INV-LMT-DAYS-ENTRY(IACIDX, LMTIDX)
222200170721      * RFS152311 - Begin
222300170721D19162*    END-PERFORM.
222400170721           END-PERFORM
222500170721           END-IF.
222600170721
222700170721      *    GO TO LR2-0010.
222800170721      * RFS152311 - End
222900170721
223000170721       LR2-EXIT.
223100170721           EXIT.
223200170721
223300170721      /
223400170721      *RFS91255 - Start
223500170721       LEVEL-REINIT-3.
223600170721
223700170721           INITIALIZE lc-ACCOUNT-ACCRUAL-ARRAY.
223800170721
223900170721       LR3-EXIT.
224000170721           EXIT.
224100170721
224200170721      *RFS91255 - End
224300170721      /
224400170721       INITIAL-LOGIC.
224500170721      ********************************************************
224600170721      *     I N I T I A L   L O G I C   R O U T I N E        *
224700170721      ********************************************************
224800170721
224900170721R10664     INITIALIZE DA-DAILY-ACCRUAL-VARIABLES.
225000170721R10664     ACCEPT WS-LOCAL-DATA-AREA FROM WS-LOCAL.
225100170721R10664
225200170721      * RFS18615 - Start
225300170721      *****
225400170721      *****  Get the Number of Days within the Period.
225500170721      *****
225600170721           INITIALIZE CALCDUR-PARM-BUFFER.
225700170721
225800170721           MOVE COMM-QBEGIN TO CALCDUR-START-DATE.
225900170721           MOVE COMM-QEND   TO CALCDUR-END-DATE.
226000170721
226100170721           CALL "CALCDUR" USING CALCDUR-PARM.
226200170721           CANCEL "CALCDUR".
226300170721
226400170721      * RFS33507 Begin
226500170721           COMPUTE Ws-Set-Days = CALCDUR-DAYS + 1.
226600170721           Move Ws-Set-Days to Ws-Days.
226700170721      * RFS33507 End
226800170721      * RFS18615 - End
226900170721
227000170721152311     SET lb_FirstPassYes TO TRUE.
227100170721152311     INITIALIZE li_CurrIndexPointer.
227200170721152311     SET IACIDX        TO 1.
227300170721
227400170721D19162     INITIALIZE WS-VARIABLE-MISC-FIELDS.
227500170721
227600170721D19162*40800ACCEPT WS-MANAGEMENT-COMPANY-CODE FROM WS-DTAARA-MFACMPCDP
227700170721D19162*40800                    FOR "MFACMPCDP".
22780017072140800      ACCEPT lc_MFASFPARM FROM WS-DTAARA-MFASFPARM
22790017072140800                           FOR "MFASFPARM".
228000170721
228100170721D19162     MOVE "SRVVAR" TO WS-MODULE-ID.
228200170721D19162     CALL "JOBCHKAUT" USING WS-MODULE-ID, WS-MODULE-AUTH-SRVVAR.
228300170721
228400170721      *****
228500170721      *****  GET THE PROCESS DATE
228600170721      *****
228700170721            CALL "MKPRCDT" USING PROCESS-DATE-DATA-AREA.
228800170721            CANCEL "MKPRCDT".
228900170721
229000170721           MOVE PDDA-MONTH-STR-DATE    TO  WS-MONTH-STR-DATE.
229100170721           MOVE PDDA-QUARTER-STR-DATE  TO  WS-QUARTER-STR-DATE.
229200170721           MOVE PDDA-QUARTER-STR-DATE-7
229300170721                                       TO  WS-QUARTER-STR-DATE-7.
229400170721           MOVE PDDA-LAST-MONTH-END    TO  WS-LAST-MONTH-END.
229500170721           MOVE PDDA-LAST-QUARTER-END  TO  WS-LAST-QUARTER-END.
229600170721           MOVE PDDA-LAST-QUARTER-END-7
229700170721                                       TO  WS-LAST-QUARTER-END-7.
229800170721           MOVE COMM-QBEGIN            TO  WS-BEGIN-DATE-PASS.
229900170721           MOVE COMM-QEND              TO  WS-END-DATE-PASS.
230000170721
230100170721      * RFS29449 - Start
230200170721      *****
230300170721      *****  Get the Number of Days within the Quarter.
230400170721      *****
230500170721           Initialize Calcdur-Parm-Buffer.
230600170721
230700170721           Move Ws-Quarter-Str-Date to Calcdur-Start-Date
230800170721
230900170721      * Rfs 40128 Fix the wrong quarter end date resulting
231000170721      * in wrong number of days being used for a quarter ending
231100170721      * on a non business day
231200170721      *
231300170721      *    Move Ws-Last-Quarter-End to Calcdur-End-Date
231400170721           MOVE Comm-Qend   TO Calcdur-End-Date.
231500170721      * Rfs 40128 Ends
231600170721
231700170721           Call "CALCDUR" using Calcdur-Parm.
231800170721           Cancel "CALCDUR".
231900170721
232000170721           Compute Ws-Qtr-Days = Calcdur-Days + 1.
232100170721
232200170721      * RFS29449 - End
232300170721
232400170721           IF COMM-QEND   IS NOT EQUAL TO  WS-LAST-MONTH-END
232500170721               MOVE "N"                TO  COMM-MTHEND.
232600170721
232700170721           IF COMM-QEND   IS NOT EQUAL TO  WS-LAST-QUARTER-END
232800170721               MOVE "N"                TO  COMM-QTREND.
232900170721
233000170721           IF COMM-QEND   IS NOT EQUAL TO  WS-LAST-QUARTER-END-7
233100170721               MOVE "N"                TO  COMM-Q7.
233200170721
233300170721      * CHECK IF MONTH END DATE AND QUARTER END DATE IS THE SAME
233400170721
233500170721           IF COMM-MTHEND     IS EQUAL TO  "Y" AND
233600170721              COMM-QEND       IS EQUAL TO  PDDA-LAST-QUARTER-END
233700170721              MOVE "Y"                 TO  COMM-QTREND.
233800170721
233900170721      * OPEN FILES AND INITIALIZE ACCUMULATORS
234000170721
234100170721           OPEN INPUT  INVESTMENT
234200170721                       INVESTMENT-TRAILER-SCHEDULE
234300170721D19162                 INVESTMENT-TRAILER-VAR-SCHED
234400170721D19162                 TRAILER-RATE-VAR-SCHEDULE
234500170721                       TRAILER-RATE-SCHEDULE
234600170721                       DEALER-INVEST-SERVICE-FEE
234700170721                       DEALER-COMMISSIONS
234800170721R10953                 SCREEN-EDITS-ALLOWED
234900170721R60213                 INVESTMENT-UNIT-PRICE
235000170721                I-O    DEALER-REP-DLY-SRV-FEE
235100170721D19162                 DEALER-REP-DLY-SRV-VAR
235200170721                       TRAILER-PAYMENT-VAR
235300170721R91255*                TRAILER-PAYMENT.
235400170721R91255                 TRAILER-PAYMENT
235500170721R91255                 TRAILER-ACCOUNT-PAYMENT.
235600170721
235700170721R10664     IF PASS-DLYACCRUAL = "Y"
235800170721R10664       OPEN I-O SRV-FEE-EXTRACT.
235900170721R10953*    Check Edit Code SRVZRO for Trailer Payment record bypass
236000170721R10953
236100170721R10953     INITIALIZE MFAEDTSCP OF SCREEN-EDITS-ALLOWED.
236200170721R10953     MOVE SRVCALC-SCREEN-CODE
236300170721R10953                        TO SCREEN-CODE OF SCREEN-EDITS-ALLOWED.
236400170721R10953     MOVE SRVZRO-EDIT-CODE
236500170721R10953                        TO EDIT-CODE OF SCREEN-EDITS-ALLOWED.
236600170721R10953     MOVE DEALER-LEVEL-CODE
236700170721R10953                        TO LEVEL-CODE OF SCREEN-EDITS-ALLOWED.
236800170721R10953
236900170721R10953     READ SCREEN-EDITS-ALLOWED
237000170721R10953     INVALID KEY
237100170721R10953       MOVE "N"         TO SRVZRO-BYPASS-FLAG
237200170721R10953     NOT INVALID KEY
237300170721R10953       MOVE "Y"         TO SRVZRO-BYPASS-FLAG.
237400170721
237500170721      *RFS50475 Add - Beg
237600170721           Initialize lc_ALDTTF_RtnFlag.
237700170721           CALL "FXSCEDTAL1" USING lc_ALDTTF_ScreenCode
237800170721                                   lc_ALDTTF_EditCode
237900170721                                   lc_ALDTTF_EditLevel
238000170721                                   lc_ALDTTF_RtnFlag.
238100170721           CANCEL "FXSCEDTAL1".
238200170721      *RFS50475 Add - End
238300170721
238400170721      * RFS130093 - Begin
238500170721      * Comment out logic to check SRVFEA
238600170721      *RFS91255 - Start
238700170721      *    Call "FXSCEDTAL1" USING lc_SRVFEA_ScreenCode
238800170721      *                            lc_SRVFEA_EditCode
238900170721      *                            lc_SRVFEA_EditLevel
239000170721      *                            lc_SRVFEA_RtnFlag.
239100170721      *    CANCEL "FXSCEDTAL1".
239200170721      *RFS91255 - End
239300170721           MOVE lncc_Y TO lc_SRVFEA_RtnFlag.
239400170721      * RFS130093 - End
239500170721
239600170721           MOVE COMM-QBEGIN   TO WS-QBEGIN.
239700170721           MOVE ZEROES        TO WS-QBEGIN-DD.
239800170721           MOVE COMM-QEND     TO WS-QEND.
239900170721           MOVE 99            TO WS-QEND-DD.
240000170721           MOVE WS-QBEGIN-YY  TO DLP-YEAR.
240100170721
240200170721      * RFS-21203 - Begin
240300170721      *Use the function FXSCEDTALW to check if Split Service Fee's
240400170721      * by Rep should be used
240500170721
240600170721           MOVE "N" TO CAPFEE-BYPASS-FLAG.
240700170721
240800170721           INITIALIZE MFAEDTSCP OF SCREEN-EDITS-ALLOWED.
240900170721
241000170721           MOVE DLRSPT-SCREEN-CODE TO
241100170721                SCREEN-CODE OF SCREEN-EDITS-ALLOWED.
241200170721           MOVE CAPFEE-EDIT-CODE TO
241300170721                EDIT-CODE   OF SCREEN-EDITS-ALLOWED.
241400170721           MOVE DLR-LEVEL-CODE TO
241500170721                LEVEL-CODE  OF SCREEN-EDITS-ALLOWED-REC.
241600170721
241700170721           READ SCREEN-EDITS-ALLOWED
241800170721             INVALID KEY
241900170721              MOVE "N"         TO CAPFEE-BYPASS-FLAG
242000170721             NOT INVALID KEY
242100170721              MOVE "Y"         TO CAPFEE-BYPASS-FLAG.
242200170721
242300170721      * RFS-21203 - End
242400170721
242500170721      ****************************************************************
242600170721      *  INPUT:  DLP-YEAR                                            *
242700170721      * OUTPUT:  DLP-IS-LEAP-SW (Y|N)                                *
242800170721      ****************************************************************
242900170721           CALL "DRLEAP" USING DR-LEAP-PARMS.
243000170721
243100170721           PERFORM LOAD-DEALER-RATE-ARRAY
243200170721                             THRU LDR-EXIT.
243300210510      * RFS 1113297 - BEgins
243400210510           IF WS-MODULE-AUTH-SRVVAR = "Y"
243500210510               PERFORM LOAD-VARIABLE-ARRAY THRU LVA-EXIT.
243600210510      * RFS 1113297 - Ends
243700170721           PERFORM LOAD-ACCRUAL-ARRAY
243800170721                             THRU LAA-EXIT.
243900170721
244000210510      * RFS 1113297 - BEgins
244100170721D19162*40800IF WS-MODULE-AUTH-SRVVAR = "Y" AND NOT WS-GRANDFATHER-CLIENT
24420021051040800 *    IF WS-MODULE-AUTH-SRVVAR = "Y"
244300210510D19162*        PERFORM LOAD-VARIABLE-ARRAY THRU LVA-EXIT.
244400210510      * RFS 1113297 - Ends
244500170721
244600170721           CLOSE       INVESTMENT
244700170721                       INVESTMENT-TRAILER-SCHEDULE
244800170721D19162                 INVESTMENT-TRAILER-VAR-SCHED
244900170721D19162                 TRAILER-RATE-VAR-SCHEDULE
245000170721                       TRAILER-RATE-SCHEDULE
245100170721                       DEALER-INVEST-SERVICE-FEE.
245200170721
245300170721           MOVE LOW-VALUES   TO CURR-CONTROLS
245400170721                                PREV-CONTROLS.
245500170721      *RFS-21203 - Begin
245600170721      *    INITIALIZE MFADEACMP OF DEALER-COMMISSIONS-REC.
245700170721      *RFS-21203 - End
245800170721
245900170721       INL-EXIT.
246000170721           EXIT.
246100170721
246200170721      /
246300170721       END-JOB.
246400170721
246500170721           CLOSE       DEALER-REP-DLY-SRV-FEE
246600170721                       DEALER-COMMISSIONS
246700170721R60213                 INVESTMENT-UNIT-PRICE
246800170721R10953                 SCREEN-EDITS-ALLOWED
246900170721D19162                 DEALER-REP-DLY-SRV-VAR
247000170721                       TRAILER-PAYMENT-VAR
247100170721R91255*                TRAILER-PAYMENT.
247200170721R91255                 TRAILER-PAYMENT
247300170721R91255                 TRAILER-ACCOUNT-PAYMENT.
247400170721
247500170721R10664     IF PASS-DLYACCRUAL = "Y"
247600170721R10664        CLOSE    SRV-FEE-EXTRACT.
247700170721
247800170721       EOJ-EXIT.
247900170721           EXIT.
248000170721
248100170721      /
248200170721       LOAD-DEALER-RATE-ARRAY.
248300170721
248400170721      ** INITIALIZE
248500170721           INITIALIZE WS-DEALER-INVEST-TRAILER-ARRAY.
248600170721
248700170721           MOVE LOW-VALUES     TO DEALER-CODE
248800170721                                  OF DEALER-INVEST-SERVICE-FEE
248900170721                                  INVESTMENT-CODE
249000170721                                  OF DEALER-INVEST-SERVICE-FEE.
249100170721
249200170721           START DEALER-INVEST-SERVICE-FEE
249300170721           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
249400170721           INVALID KEY
249500170721           MOVE HIGH-VALUES    TO CURR-CONTROLS
249600170721           GO TO LDR-EXIT.
249700170721
249800170721           SET DIIDX           TO 1.
249900170721           SET DIIDX           DOWN BY 1.
250000170721
250100170721       LDR-0020.
250200170721
250300170721           READ DEALER-INVEST-SERVICE-FEE NEXT RECORD
250400170721           AT END
250500170721           GO TO LDR-EXIT.
250600170721
250700170721RF5779     MOVE INVESTMENT-CODE OF DEALER-INVEST-SERVICE-FEE
250800170721RF5779                        TO  INVESTMENT-CODE OF ITS-REC.
250900170721RF5779     READ INVESTMENT-TRAILER-SCHEDULE
251000170721RF5779     INVALID KEY
251100170721RF5779     GO TO LDR-0020.
251200170721RF5779
251300170721RF5779     IF TRAILER-SCHEDULE-CODE OF ITS-REC IS EQUAL TO " "
251400170721RF5779     GO TO LDR-0020.
251500170721
25160017072140800      MOVE TRAILER-SCHEDULE-CODE OF DISF-REC
25170017072140800                          TO TRAILER-SCHEDULE-CODE
25180017072140800                          OF TRAILER-RATE-SCHEDULE.
25190017072140800      MOVE "H"            TO TRAILER-RATE-TYPE
25200017072140800                          OF TRAILER-RATE-SCHEDULE.
252100170721
25220017072140800      READ TRAILER-RATE-SCHEDULE
25230017072140800      INVALID KEY
25240017072140800        CONTINUE
25250017072140800      NOT INVALID KEY
25260017072140800        SET DIIDX UP BY 1
25270017072140800        COMPUTE WS-DI-TRAIL-H-RATE(DIIDX)
25280017072140800                            = TRAILER-RATE OF TRS-REC / 100
25290017072140800        MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
25300017072140800                            TO WS-DI-TRAIL-H-THRESHOLD(DIIDX)
25310017072140800        MOVE DEALER-CODE OF DISF-REC
25320017072140800                            TO WS-DI-DEALER-CODE(DIIDX)
253300170721112945                              lc_DiDlrCode
25340017072140800        MOVE INVESTMENT-CODE OF DISF-REC
25350017072140800                            TO WS-DI-INVESTMENT-CODE(DIIDX)
253600170721      *RFS112945- Begin
253700170721             MOVE HOLDING-PERIOD    OF TRS-REC
253800170721                                 TO li_DiHoldingPeriod(DIIDX)
253900170721             MOVE TRAILER-RATE-TYPE OF TRS-REC
254000170721                                 TO lc_DiRateType(DIIDX)
254100170721             MOVE FREQUENCY         OF TRS-REC
254200170721                                 TO lc_DiFrequency(DIIDX)
254300170721             IF lc_DiFrequency(DIIDX) = SPACES
254400170721               EXEC SQL
254500170721                 SELECT  COALESCE(SRV_FREQUENCY_CODE, " ")
254600170721                 INTO :lc_DlrTrFreqCode
254700170721                 FROM MFADEACMP
254800170721                 WHERE DEALER_CODE= :lc_DiDlrCode
254900170721125759             AND Currency = "CAD"
255000170721               END-EXEC
255100170721125759         If lc_DlrTrFreqCode = Spaces
255200170721125759         EXEC SQL
255300170721125759           SELECT  COALESCE(SRV_FREQUENCY_CODE, " ")
255400170721125759           INTO :lc_DlrTrFreqCode
255500170721125759           FROM MFADEACMP
255600170721125759           WHERE DEALER_CODE= :lc_DiDlrCode
255700170721125759             AND Currency = "USD"
255800170721125759         END-EXEC
255900170721125759         End-If
256000170721               MOVE lc_DlrTrFreqCode  TO lc_DiFrequency(DIIDX)
256100170721             END-IF
256200170721      *RFS112945- End
25630017072140800        GO TO LDR-0020
25640017072140800      END-READ.
256500170721
25660017072140800      MOVE TRAILER-SCHEDULE-CODE OF DISF-REC
25670017072140800                          TO TRAILER-SCHEDULE-CODE
25680017072140800                          OF TRAILER-RATE-SCHEDULE.
25690017072140800      MOVE "S"            TO TRAILER-RATE-TYPE
25700017072140800                          OF TRAILER-RATE-SCHEDULE.
257100170721
25720017072140800      SET lb_DISrateFoundNo TO TRUE.
257300170721
25740017072140800      READ TRAILER-RATE-SCHEDULE
25750017072140800      INVALID KEY
25760017072140800        CONTINUE
25770017072140800      NOT INVALID KEY
25780017072140800        SET DIIDX UP BY 1
25790017072140800        SET lb_DISrateFoundYes TO TRUE
25800017072140800        COMPUTE WS-DI-TRAIL-S-RATE(DIIDX)
25810017072140800                            = TRAILER-RATE OF TRS-REC / 100
25820017072140800        MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
25830017072140800                            TO WS-DI-TRAIL-S-THRESHOLD(DIIDX)
25840017072140800        MOVE DEALER-CODE OF DISF-REC
25850017072140800                            TO WS-DI-DEALER-CODE(DIIDX)
25860017072140800        MOVE INVESTMENT-CODE OF DISF-REC
25870017072140800                            TO WS-DI-INVESTMENT-CODE(DIIDX)
258800200803      *RFS185175-Starts
258900200803             MOVE ASSETS-RULE OF TRS-REC
259000200803                                 TO WS-DI-S-ASSETS-RULE(DIIDX)
259100200803      *RFS185175-Ends
25920017072140800      END-READ.
259300170721
259400170721           MOVE TRAILER-SCHEDULE-CODE OF DISF-REC
259500170721                               TO TRAILER-SCHEDULE-CODE
259600170721                               OF TRAILER-RATE-SCHEDULE.
259700170721           MOVE "T"            TO TRAILER-RATE-TYPE
259800170721                               OF TRAILER-RATE-SCHEDULE.
259900170721
260000170721           READ TRAILER-RATE-SCHEDULE
26010017072140800      INVALID KEY
26020017072140800        GO TO LDR-0020
26030017072140800      NOT INVALID KEY
26040017072140800        IF lb_DISrateFoundNo
26050017072140800           SET DIIDX UP BY 1
26060017072140800        END-IF
26070017072140800        COMPUTE WS-DI-TRAIL-T-RATE(DIIDX)
26080017072140800                            = TRAILER-RATE OF TRS-REC / 100
26090017072140800        MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
26100017072140800                            TO WS-DI-TRAIL-T-THRESHOLD(DIIDX)
26110017072140800        MOVE DEALER-CODE OF DISF-REC
26120017072140800                            TO WS-DI-DEALER-CODE(DIIDX)
26130017072140800        MOVE INVESTMENT-CODE OF DISF-REC
26140017072140800                            TO WS-DI-INVESTMENT-CODE(DIIDX)
26150017072140800      END-READ.
26160017072140800 *    INVALID KEY
26170017072140800 *    GO TO LDR-0020.
261800170721
26190017072140800 *    SET DIIDX UP BY 1.
262000170721
26210017072140800 *    MOVE DEALER-CODE OF DISF-REC
26220017072140800 *                        TO WS-DI-DEALER-CODE(DIIDX).
26230017072140800 *    MOVE INVESTMENT-CODE OF DISF-REC
26240017072140800 *                        TO WS-DI-INVESTMENT-CODE(DIIDX).
26250017072140800 *    COMPUTE WS-DI-TRAIL-T-RATE(DIIDX)
26260017072140800 *                        = TRAILER-RATE OF TRS-REC / 100.
26270017072140800 *    MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
26280017072140800 *                        TO WS-DI-TRAIL-T-THRESHOLD(DIIDX).
262900170721      * RFS167811-Begin
263000170721           MOVE TRAILER-SCHEDULE-CODE OF DISF-REC
263100170721                               TO TRAILER-SCHEDULE-CODE
263200170721                               OF TRAILER-RATE-SCHEDULE.
263300170721           MOVE "P"            TO TRAILER-RATE-TYPE
263400170721                               OF TRAILER-RATE-SCHEDULE.
263500170721
263600170721           SET lb_DIPrateFoundNo TO TRUE.
263700170721
263800170721           READ TRAILER-RATE-SCHEDULE
263900170721           INVALID KEY
264000170721             CONTINUE
264100170721           NOT INVALID KEY
264200170721             SET DIIDX UP BY 1
264300170721             SET lb_DIPrateFoundYes TO TRUE
264400170721             COMPUTE WS-DI-TRAIL-P-RATE(DIIDX)
264500170721                                 = TRAILER-RATE OF TRS-REC / 100
264600170721             MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
264700170721                                 TO WS-DI-TRAIL-P-THRESHOLD(DIIDX)
264800170721             MOVE DEALER-CODE OF DISF-REC
264900170721                                 TO WS-DI-DEALER-CODE(DIIDX)
265000170721             MOVE INVESTMENT-CODE OF DISF-REC
265100170721                                 TO WS-DI-INVESTMENT-CODE(DIIDX)
265200170721           END-READ.
265300170721      * RFS167811-End
265400170721
265500170721           GO TO LDR-0020.
265600170721
265700170721       LDR-EXIT.
265800170721           EXIT.
265900170721
266000170721      /
266100170721       LOAD-ACCRUAL-ARRAY.
266200170721
266300170721           INITIALIZE WS-INVESTMENT-ACCRUAL-ARRAY.
266400170721
266500170721           MOVE LOW-VALUES     TO INVESTMENT-CODE OF INVESTMENT.
266600170721
266700170721           START INVESTMENT
266800170721           KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
266900170721           INVALID KEY
267000170721           MOVE HIGH-VALUES    TO CURR-CONTROLS
267100170721           GO TO LAA-EXIT.
267200170721
267300170721           SET IACIDX TO 1.
267400170721           SET IACIDX DOWN BY 1.
267500170721
267600170721       LAA-0020.
267700170721
267800170721           READ INVESTMENT NEXT RECORD
267900170721           AT END
268000170721           GO TO LAA-EXIT.
268100170721
268200170721D19162     MOVE SPACES TO WS-INV-TRL-SCHED
268300170721D19162                    WS-INV-TRL-VAR-SCHED.
268400170721RF5779     MOVE INVESTMENT-CODE OF INVESTMENT
268500170721RF5779                        TO  INVESTMENT-CODE OF ITS-REC.
268600170721RF5779     READ INVESTMENT-TRAILER-SCHEDULE
268700170721RF5779     INVALID KEY
268800170721D19162       INITIALIZE MFAINVTSP OF ITS-REC
268900170721  ¦        NOT INVALID KEY
269000170721  ¦          MOVE TRAILER-SCHEDULE-CODE OF ITS-REC
269100170721  ¦            TO WS-INV-TRL-SCHED
269200170721  ¦        END-READ.
269300170721  ¦
269400170721D19162*40800IF WS-MODULE-AUTH-SRVVAR NOT = "Y"  OR WS-GRANDFATHER-CLIENT
26950017072140800      IF WS-MODULE-AUTH-SRVVAR NOT = "Y"
269600170721  ¦           GO TO LAA-0030.
269700170721  ¦
269800170721  ¦        MOVE INVESTMENT-CODE OF INVESTMENT
269900170721  ¦             TO INVESTMENT-CODE OF INVESTMENT-TRAILER-VAR-SCHED.
270000170721  ¦        READ INVESTMENT-TRAILER-VAR-SCHED
270100170721  ¦        INVALID KEY
270200170721D19162       INITIALIZE MFAINVTVP OF INVEST-TRAILER-VAR-SCHED-REC
270300170721  ¦        NOT INVALID KEY
270400170721  ¦          MOVE TRAILER-SCHEDULE-CODE OF INVESTMENT-TRAILER-VAR-SCHED
270500170721  ¦            TO WS-INV-TRL-VAR-SCHED
270600170721  ¦        END-READ.
270700170721  ¦    LAA-0030.
270800170721  ¦        IF WS-INV-TRL-SCHED = " " AND WS-INV-TRL-VAR-SCHED = " "
270900170721  ¦           GO TO LAA-0020
271000170721D19162     END-IF.
271100170721
271200170721           SET IACIDX          UP BY 1.
271300170721
271400170721           MOVE CURRENCY-DDS OF INVESTMENT
271500170721                               TO WS-IA-CURRENCY-CODE(IACIDX).
271600170721           MOVE INVESTMENT-CODE OF INVESTMENT
271700170721                               TO WS-IA-INVESTMENT-CODE(IACIDX).
271800170721D19162*    MOVE TRAILER-SCHEDULE-CODE OF ITS-REC
271900170721D19162*                        TO TRAILER-SCHEDULE-CODE
272000170721
272100170721D19162*40800IF WS-MODULE-AUTH-SRVVAR = "Y"  AND
272200170721      *40800     NOT WS-GRANDFATHER-CLIENT
272300170721D19162     IF WS-MODULE-AUTH-SRVVAR = "Y"
272400170721D19162        MOVE WS-INV-TRL-VAR-SCHED
272500170721D19162          TO WS-IA-VAR-SCHED-CODE(IACIDX)
272600170721D19162        MOVE EFFECT-DATE OF INVESTMENT-TRAILER-VAR-SCHED
272700170721D19162          TO WS-IA-VAR-EFFECT-DATE(IACIDX)
272800170721      *       DISPLAY START-DATE OF INVESTMENT-TRAILER-VAR-SCHED
272900170721D19162        MOVE START-DATE OF INVESTMENT-TRAILER-VAR-SCHED
273000170721D19162          TO WS-IA-VAR-START-DATE(IACIDX)
273100170721D19162        MOVE DATE-PREPARED OF INVESTMENT-TRAILER-VAR-SCHED
273200170721D19162          TO WS-IA-VAR-DATE-PREPARED(IACIDX)
273300210510      * RFS 1113297 - Begins
273400210510              PERFORM  SEARCH-VAR-SCHED-METHOD
273500210510              MOVE lc_CalcVarUnit TO  WS-IA-VAR-CALC-FEE(IACIDX)
273600210510      * RFS 1113297 - Ends
273700170721D19162     END-IF.
273800170721
27390017072140800      IF WS-INV-TRL-SCHED NOT = SPACES
27400017072140800         MOVE WS-INV-TRL-SCHED
27410017072140800           TO TRAILER-SCHEDULE-CODE OF TRAILER-RATE-SCHEDULE
27420017072140800         MOVE "H"            TO TRAILER-RATE-TYPE
27430017072140800                              OF TRAILER-RATE-SCHEDULE
27440017072140800         READ TRAILER-RATE-SCHEDULE
27450017072140800         NOT INVALID KEY
27460017072140800           COMPUTE WS-IA-TRAIL-H-RATE(IACIDX)
27470017072140800                               = TRAILER-RATE OF TRS-REC / 100
27480017072140800           MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
27490017072140800                               TO WS-IA-TRAIL-H-THRESHOLD(IACIDX)
275000170721      *RFS112945 - Begin
275100170721                MOVE HOLDING-PERIOD    OF TRS-REC
275200170721                                    TO li_IaHoldingPeriod(IACIDX)
275300170721                MOVE TRAILER-RATE-TYPE OF TRS-REC
275400170721                                    TO lc_IaRateType(IACIDX)
275500170721                MOVE FREQUENCY         OF TRS-REC
275600170721                                    TO lc_IaFrequency(IACIDX)
275700170721      *RFS112945 - End
27580017072140800           GO TO LAA-0020
27590017072140800         INVALID KEY
27600017072140800           CONTINUE
27610017072140800         END-READ
27620017072140800      END-IF.
276300170721
276400170721D19162     IF WS-INV-TRL-SCHED NOT = SPACES
276500170721D19162        MOVE WS-INV-TRL-SCHED
276600170721D19162          TO TRAILER-SCHEDULE-CODE OF TRAILER-RATE-SCHEDULE
276700170721              MOVE "T"            TO TRAILER-RATE-TYPE
276800170721                                   OF TRAILER-RATE-SCHEDULE
276900170721D19162     ELSE
277000170721D19162        MOVE WS-INV-TRL-VAR-SCHED
277100170721D19162          TO TRAILER-SCHEDULE-CODE OF TRAILER-RATE-SCHEDULE
277200170721D19162        MOVE "V"            TO TRAILER-RATE-TYPE
277300170721D19162                             OF TRAILER-RATE-SCHEDULE
277400170721D19162     END-IF.
277500170721D19162
277600170721
277700170721           READ TRAILER-RATE-SCHEDULE
27780017072140800      NOT INVALID KEY
27790017072140800          COMPUTE WS-IA-TRAIL-T-RATE(IACIDX)
27800017072140800                              = TRAILER-RATE OF TRS-REC / 100
27810017072140800          MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
27820017072140800                              TO WS-IA-TRAIL-T-THRESHOLD(IACIDX)
278300170721           INVALID KEY
27840017072140800          CONTINUE.
27850017072140800 *    GO TO LAA-0020.
278600170721
27870017072140800 *    COMPUTE WS-IA-TRAIL-T-RATE(IACIDX)
27880017072140800 *                        = TRAILER-RATE OF TRS-REC / 100.
27890017072140800 *    MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
27900017072140800 *                        TO WS-IA-TRAIL-T-THRESHOLD(IACIDX).
279100170721
279200170721           MOVE TRAILER-SCHEDULE-CODE OF ITS-REC
279300170721                               TO TRAILER-SCHEDULE-CODE
279400170721                               OF TRAILER-RATE-SCHEDULE.
279500170721           MOVE "S"            TO TRAILER-RATE-TYPE
279600170721                               OF TRAILER-RATE-SCHEDULE.
279700170721
279800170721           READ TRAILER-RATE-SCHEDULE
279900170721           INVALID KEY
280000170721      * RFS167811-Begin
280100170721              CONTINUE
280200170721      *    GO TO LAA-0020.
280300170721           NOT INVALID KEY
280400170721
280500170721           COMPUTE WS-IA-TRAIL-S-RATE(IACIDX)
280600170721                               = TRAILER-RATE OF TRS-REC / 100
280700170721           MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
280800170721                               TO WS-IA-TRAIL-S-THRESHOLD(IACIDX)
280900200803      *RFS185175-Starts
281000200803           MOVE ASSETS-RULE OF TRS-REC
281100200803                               TO WS-IA-TRAIL-S-ASSETS-RULE(IACIDX)
281200200803      *RFS185175-Ends
281300170721           END-READ.
281400170721
281500170721           MOVE TRAILER-SCHEDULE-CODE OF ITS-REC
281600170721                               TO TRAILER-SCHEDULE-CODE
281700170721                               OF TRAILER-RATE-SCHEDULE.
281800170721           MOVE "P"            TO TRAILER-RATE-TYPE
281900170721                               OF TRAILER-RATE-SCHEDULE.
282000170721
282100170721           READ TRAILER-RATE-SCHEDULE
282200170721           INVALID KEY
282300170721           GO TO LAA-0020.
282400170721
282500170721           COMPUTE WS-IA-TRAIL-P-RATE(IACIDX)
282600170721                               = TRAILER-RATE OF TRS-REC / 100.
282700170721           MOVE QUALIFYING-DOLLAR-AMT OF TRS-REC
282800170721                               TO WS-IA-TRAIL-P-THRESHOLD(IACIDX).
282900170721      * RFS167811-End
283000170721           GO TO LAA-0020.
283100170721
283200170721       LAA-EXIT.
283300170721           EXIT.
283400170721
283500170721      * RFS18615 - Start
283600170721      /
283700170721       LOG-FILE-STATUS.
283800170721      *****************************
283900170721      *  LOG FILE STATUS ROUTINE  *
284000170721      *****************************
284100170721           MOVE SPACES TO WS-ERROR-LINE.
284200170721           STRING "PROGRAM "                DELIMITED BY SIZE
284300170721                  WS-PROGRAM-ID-CODE        DELIMITED BY " "
284400170721                  " "                       DELIMITED BY SIZE
284500170721                  "ERROR OCCURRED ON FILE " DELIMITED BY SIZE
284600170721                  WS-FILE-STATUS-FILE       DELIMITED BY "  "
284700170721                  ". FILE STATUS VALUE "    DELIMITED BY SIZE
284800170721                  WS-FILE-STATUS            DELIMITED BY SIZE
284900170721                     INTO WS-ERROR-LINE.
285000170721           DISPLAY WS-ERROR-LINE.
285100170721       LFS-EXIT.
285200170721           EXIT.
285300170721      * RFS18615 - End
285400170721
285500170721      *RFS-21203 - Begin
285600170721      * Check Commission Bonus Source on Dealer Commissions
285700170721
285800170721       DEALER-COMMISSIONS-RTN.
285900170721
286000170721           INITIALIZE MFADEACMP OF DEALER-COMMISSIONS-REC.
286100170721
286200170721           MOVE CURR-DEALER-CODE TO DEALER-CODE  OF DEALER-COMMISSIONS.
286300170721           MOVE "CAD"            TO CURRENCY-DDS OF DEALER-COMMISSIONS.
286400170721
286500170721           READ DEALER-COMMISSIONS
286600170721            INVALID KEY GO TO DCR-EXIT
286700170721           END-READ.
286800170721
286900170721           IF COMM-BONUS-SOURCE OF DEALER-COMMISSIONS = "E"
287000170721              MOVE "Y" TO  WS-BYPASS-DEALER
287100170721           END-IF.
287200170721
287300170721       DCR-EXIT.
287400170721           EXIT.
287500170721
287600170721      *RFS-21203 - End
287700170721
287800170721**********************************************************************
287900170721D19162*RFS-19162 - start
288000170721  ¦    LOAD-VARIABLE-ARRAY.
288100170721  ¦   *    INITIALIZE WS-VARIABLE-RATE-ARRAY.
288200170721  ¦
288300170721  ¦        MOVE LOW-VALUES
288400170721  ¦          TO TRAILER-SCHEDULE-CODE OF TRAILER-RATE-VAR-SCHEDULE.
288500170721  ¦        MOVE 0
288600170721D19162       TO LOWER-LIMIT-DAYS      OF TRAILER-RATE-VAR-SCHEDULE.
288700170721  ¦
288800170721  ¦        START TRAILER-RATE-VAR-SCHEDULE
288900170721  ¦          KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
289000170721  ¦          INVALID KEY
289100170721  ¦            GO TO LVA-EXIT
289200170721  ¦        END-START.
289300170721  ¦        SET VARIDX TO 0.
289400170721D19162 LVA-0100.
289500170721  ¦        READ TRAILER-RATE-VAR-SCHEDULE NEXT
289600170721  ¦          AT END
289700170721  ¦             GO TO LVA-EXIT
289800170721  ¦        END-READ.
289900170721  ¦        SET VARIDX UP BY 1.
290000170721  ¦        MOVE TRAILER-SCHEDULE-CODE OF TRAILER-RATE-VAR-SCHEDULE
290100170721  ¦          TO WS-VR-SCHEDULE-CODE(VARIDX).
290200170721  ¦        MOVE LOWER-LIMIT-DAYS      OF TRAILER-RATE-VAR-SCHEDULE
290300170721  ¦          TO WS-VR-LIMIT-DAYS(VARIDX).
290400170721D19162     COMPUTE WS-VR-RATE(VARIDX)
290500170721  ¦             = TRAILER-RATE-VAR OF TRAILER-RATE-VAR-SCHEDULE / 100.
290600200720      *RFS185175-Starts
290700200720           MOVE TRAILER-SCHEDULE-CODE OF TRAILER-RATE-VAR-SCHEDULE
290800200720                               TO TRAILER-SCHEDULE-CODE
290900200720                               OF TRAILER-RATE-SCHEDULE.
291000200720           MOVE "V"            TO TRAILER-RATE-TYPE
291100200720                               OF TRAILER-RATE-SCHEDULE.
291200200720
291300200720           READ TRAILER-RATE-SCHEDULE
291400200720           INVALID KEY
291500200720             CONTINUE
291600200720           NOT INVALID KEY
291700200720             MOVE ASSETS-RULE OF TRAILER-RATE-SCHEDULE
291800200720                                 TO WS-VR-ASSETS-RULE(VARIDX).
291900200720             MOVE TRACKING-METHOD OF TRAILER-RATE-SCHEDULE
292000200720                                 TO WS-VR-TRACK-METHOD(VARIDX).
292100200720      *RFS185175-Ends
292200170721  ¦        GO TO LVA-0100.
292300170721  ¦    LVA-EXIT.
292400170721D19162     EXIT.
292500170721  ¦   *--------------------------------------------------------------*
292600170721  ¦   * Calcualte Fix Amount.                                        *
292700170721  ¦   *--------------------------------------------------------------*
292800170721  ¦    CALC-FIX-UNITS.
292900170721  ¦
293000170721  ¦        IF WS-DEALER-LEVEL-RATES = "Y"
293100170721  ¦          IF IS-LEAP-YEAR
293200170721  ¦            COMPUTE WS-DLY-TRAILER-FIX ROUNDED =
293300170721D19162           ((DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
293400170721  ¦   *40800     * WS-DI-TRAIL-T-RATE(DIIDX)) * .00273224)
29350017072140800            * WS-DI-TRAIL-S-RATE(DIIDX)) * .00273224)
293600170721  ¦          ELSE
293700170721  ¦            COMPUTE WS-DLY-TRAILER-FIX ROUNDED =
293800170721  ¦              ((DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
293900170721D19162*40800     * WS-DI-TRAIL-T-RATE(DIIDX)) * .002739726)
29400017072140800            * WS-DI-TRAIL-S-RATE(DIIDX)) * .002739726)
294100170721  ¦          END-IF
294200170721  ¦        ELSE
294300170721  ¦          IF IS-LEAP-YEAR
294400170721  ¦            COMPUTE WS-DLY-TRAILER-FIX ROUNDED =
294500170721  ¦              ((DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
294600170721  |   *40800     * WS-IA-TRAIL-T-RATE(IACIDX)) * .00273224)
29470017072140800            * WS-IA-TRAIL-S-RATE(IACIDX)) * .00273224)
294800170721  ¦          ELSE
294900170721D19162         COMPUTE WS-DLY-TRAILER-FIX ROUNDED =
295000170721  ¦              ((DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
295100170721  ¦   *40800     * WS-IA-TRAIL-T-RATE(IACIDX)) * .002739726)
29520017072140800            * WS-IA-TRAIL-S-RATE(IACIDX)) * .002739726)
295300170721  ¦          END-IF
295400170721  ¦        END-IF.
295500170721  ¦    CFU-EXIT.
295600170721  ¦        EXIT.
295700170721D19162*--------------------------------------------------------------*
295800170721  ¦   * Calcualte Variable Amount.                                   *
295900170721  ¦   *--------------------------------------------------------------*
296000170721  ¦    CALC-VARIABLE-UNITS.
296100170721  ¦        INITIALIZE                  WS-DTL-TRAILER-VAR.
29620017072137142      INITIALIZE                  li_Sf_Amt_Dist_var.
296300170721
296400170721  ¦
296500170721  ¦   * Retreive Dealer-Rep-Dly-Srv-Var.
296600170721  ¦        INITIALIZE     MFADEADVP OF DEALER-REP-DLY-SRV-VAR-REC.
296700170721  ¦        MOVE CURR-DEALER-CODE
296800170721  ¦          TO DEALER-CODE         OF DEALER-REP-DLY-SRV-VAR.
296900170721  ¦        MOVE CURR-REP-CODE
297000170721  ¦          TO DEALER-REP-CODE     OF DEALER-REP-DLY-SRV-VAR.
297100170721D19162     MOVE CURR-INVESTMENT-CODE
297200170721  ¦          TO INVESTMENT-CODE     OF DEALER-REP-DLY-SRV-VAR.
297300170721  ¦        MOVE PROCESS-DATE        OF DEALER-REP-DLY-SRV-FEE
297400170721  ¦          TO PROCESS-DATE        OF DEALER-REP-DLY-SRV-VAR.
297500170721      * RFS130093 - Begin
297600170721           MOVE CURR-ACCOUNT-NO
297700170721             TO ACCOUNT-NO          OF DEALER-REP-DLY-SRV-VAR.
297800170721      * RFS130093 - End
297900170721  ¦        MOVE ZEROES
298000170721  ¦          TO LOWER-LIMIT-DAYS    OF DEALER-REP-DLY-SRV-VAR.
298100170721  ¦
298200170721  ¦        START DEALER-REP-DLY-SRV-VAR
298300170721  ¦          KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
298400170721  ¦          INVALID KEY GO TO CVU-EXIT
298500170721  ¦        END-START.
298600170721D19162
298700170721  ¦    READ-NEXT-VARIABLE.
298800170721  ¦        READ DEALER-REP-DLY-SRV-VAR NEXT RECORD
298900170721  ¦          AT END
299000170721  ¦             GO TO CVU-EXIT
299100170721  ¦        END-READ.
299200170721  ¦
299300170721  ¦        IF DEALER-CODE      OF DEALER-REP-DLY-SRV-VAR     NOT =
299400170721  ¦           CURR-DEALER-CODE                                    OR
299500170721  ¦           DEALER-REP-CODE  OF DEALER-REP-DLY-SRV-VAR     NOT =
299600170721  ¦           CURR-REP-CODE                                       OR
299700170721  ¦           INVESTMENT-CODE  OF DEALER-REP-DLY-SRV-VAR     NOT =
299800170721  ¦           CURR-INVESTMENT-CODE                                OR
299900170721130093        ACCOUNT-NO      OF DEALER-REP-DLY-SRV-VAR      NOT =
300000170721130093        CURR-ACCOUNT-NO                                     OR
300100170721D19162        PROCESS-DATE     OF DEALER-REP-DLY-SRV-VAR     NOT =
300200170721  ¦           PROCESS-DATE     OF DEALER-REP-DLY-SRV-FEE
300300170721  ¦          GO TO CVU-EXIT
300400170721  ¦        END-IF.
300500170721  ¦
30060017072160213      IF PASS-DLYACCRUAL = "Y" AND
30070017072160213         REVIEW-FLAG OF DEALER-REP-DLY-SRV-FEE = "Y"     AND
30080017072160213         UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE NOT =
30090017072160213         UNIT-PRICE OF DEALER-REP-DLY-SRV-VAR
30100017072160213            PERFORM Recalc_MFADEADVP_Buckets
30110017072160213      END-IF.
301200170721
301300170721  ¦        SET VARIDX TO 0.
30140017072150475a     Perform ChkTrailerSchedCodeOverride.
301500170721  ¦        SEARCH ALL WS-VR-RATES-ENTRY
301600170721  ¦           AT END
301700170721  ¦                MOVE 0 TO WS-VARIABLE-RATE
301800200720      *RFS185175-Starts
301900200720                   MOVE " " TO WS-TRACK-METHOD
302000200720                   MOVE " " TO WS-ASSETS-RULE
302100200720      *RFS185175-Ends
302200170721D19162        WHEN WS-VR-SCHEDULE-CODE(VARIDX) =
30230017072150475d*            TRAILER-SCHEDULE-CODE OF DEALER-REP-DLY-SRV-VAR
30240017072150475a             lc_TrailerSchedCode
302500170721  ¦            AND WS-VR-LIMIT-DAYS(VARIDX)   =
302600170721  ¦                LOWER-LIMIT-DAYS      OF DEALER-REP-DLY-SRV-VAR
302700170721  ¦                MOVE WS-VR-RATE(VARIDX) TO WS-VARIABLE-RATE
302800200720      *RFS185175-Starts
302900200720                   MOVE WS-VR-ASSETS-RULE(VARIDX)  TO WS-ASSETS-RULE
303000200720                   MOVE WS-VR-TRACK-METHOD(VARIDX) TO WS-TRACK-METHOD
303100200720      *RFS185175-Ends
303200170721  ¦        END-SEARCH.
303300170721  ¦
303400200720      *RFS185175-Starts
303500200720           IF WS-TRACK-METHOD = "1" AND WS-ASSETS-RULE = "1"
303600200720             COMPUTE WS-DTL-TRAILER-VAR ROUNDED =
303700200720            ((DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-VAR
303800200720               * WS-VARIABLE-RATE) / 12)
303900200720
304000200720             COMPUTE li_Sf_Amt_Dist_var ROUNDED =
304100200720            ((DAILY-VALUE-ACTUAL-DIST-VAR OF DEALER-REP-DLY-SRV-VAR
304200200720               * WS-VARIABLE-RATE) / 12 )
304300200720           ELSE
304400200720      *RFS185175-Ends
304500170721  ¦        IF IS-LEAP-YEAR
304600170721  ¦          COMPUTE WS-DTL-TRAILER-VAR ROUNDED =
304700170721  ¦         ((DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-VAR
304800170721  ¦            * WS-VARIABLE-RATE) * .00273224)
304900170721
305000170721      * Rfs 37142 Begins
305100170721             COMPUTE li_Sf_Amt_Dist_var ROUNDED =
305200170721            ((DAILY-VALUE-ACTUAL-DIST-VAR OF DEALER-REP-DLY-SRV-VAR
305300170721               * WS-VARIABLE-RATE) * .00273224)
305400170721      * Rfs 37142 Ends
305500170721
305600170721  ¦        ELSE
305700170721D19162       COMPUTE WS-DTL-TRAILER-VAR ROUNDED =
305800170721  ¦         ((DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-VAR
305900170721  ¦            * WS-VARIABLE-RATE) *  .002739726)
306000170721
306100170721      * Rfs 37142 Begins
306200170721             COMPUTE li_Sf_Amt_Dist_var ROUNDED =
306300170721            ((DAILY-VALUE-ACTUAL-DIST-VAR OF DEALER-REP-DLY-SRV-VAR
306400170721               * WS-VARIABLE-RATE) * .002739726)
306500170721      * Rfs 37142 Ends
306600200720      *RFS185175-Starts
306700200720           END-IF
306800200720      *RFS185175-Ends
306900170721           END-IF.
307000170721  ¦
307100170721  ¦        IF WS-IA-TRAIL-V-RATE(IACIDX) = 0
307200170721D19162        MOVE WS-VARIABLE-RATE TO WS-IA-TRAIL-V-RATE(IACIDX).
307300170721  ¦
307400170721  ¦        ADD WS-DTL-TRAILER-VAR   TO WS-DLY-TRAILER-VAR.
30750017072137142      ADD li_Sf_Amt_Dist_var   TO li_DlyTrailerDistVar.
307600170721  ¦
307700170721  ¦        IF SF-AMT-VAR OF DEALER-REP-DLY-SRV-VAR     NOT =
307800170721  ¦           WS-DTL-TRAILER-VAR
307900170721R26108       COMPUTE WS-VARIABLE-RATE = WS-VARIABLE-RATE * 100
308000170721             MOVE WS-VARIABLE-RATE
308100170721               TO TRAILER-RATE-VAR OF DEALER-REP-DLY-SRV-VAR
308200170721  ¦          MOVE WS-DTL-TRAILER-VAR
308300170721  ¦            TO SF-AMT-VAR OF DEALER-REP-DLY-SRV-VAR
308400170721
30850017072137142       MOVE  li_Sf_Amt_Dist_var To
30860017072137142             SF-AMT-DIST-VAR OF DEALER-REP-DLY-SRV-VAR
308700170721
30880017072150475a      MOVE lc_TrailerSchedCode To
30890017072150475a             TRAILER-SCHEDULE-CODE OF DEALER-REP-DLY-SRV-VAR
309000170721
309100170721  ¦          REWRITE DEALER-REP-DLY-SRV-VAR-REC
309200170721  ¦           INVALID KEY
309300170721  ¦           MOVE "99" TO WS-FILE-STATUS
309400170721  ¦           MOVE "DLR-REP-DLY-SRV-FEE-VAR "
309500170721  ¦                     TO WS-FILE-STATUS-FILE
309600170721  ¦           PERFORM LOG-FILE-STATUS THRU LFS-EXIT
309700170721  ¦          END-REWRITE
309800170721  ¦        END-IF.
309900170721  ¦
310000170721D19162     SET LMTIDX TO 1.
310100170721           SEARCH WS-INV-LMT-DAYS-ENTRY VARYING LMTIDX
310200170721             WHEN WS-INV-LMT-SCHED(IACIDX, LMTIDX) =
310300170721                     TRAILER-SCHEDULE-CODE OF DEALER-REP-DLY-SRV-VAR
310400170721              AND WS-INV-LMT-DAYS(IACIDX, LMTIDX) =
310500170721                     LOWER-LIMIT-DAYS OF DEALER-REP-DLY-SRV-VAR
310600170721
310700170721                  ADD WS-DTL-TRAILER-VAR
310800170721                      TO WS-INV-LMT-FEE-AMT (IACIDX, LMTIDX)
310900170721                  ADD DAILY-VALUE-ACTUAL-VAR OF
311000170721                                   DEALER-REP-DLY-SRV-VAR
311100170721                      TO WS-INV-LMT-TOT-ASSETS (IACIDX, LMTIDX)
311200170721      * Rfs 37142 Begins
311300170721                  ADD li_Sf_Amt_Dist_var
311400170721                      TO li_InvLmtFeeDistAmt (IACIDX, LMTIDX)
311500170721      * Rfs 37142 Ends
311600170721                  IF PROCESS-DATE OF DEALER-REP-DLY-SRV-VAR = COMM-QEND
31170017072125827                MOVE DAILY-VALUE-ACTUAL-VAR OF
311800170721  ¦                                DEALER-REP-DLY-SRV-VAR
311900170721  ¦                   TO WS-INV-LMT-ASSETS (IACIDX, LMTIDX)
312000170721
312100170721RT¦  **            COMPUTE WS-INV-LMT-ASSETS (IACIDX, LMTIDX) ROUNDED =
312200170721RT¦  **               DAILY-VALUE-ACTUAL-VAR OF
31230017072125827**                            DEALER-REP-DLY-SRV-VAR
312400170721
312500170721      * Rfs 37142 Begins
312600170721                      MOVE DAILY-VALUE-ACTUAL-DIST-VAR OF
312700170721                                   DEALER-REP-DLY-SRV-VAR
312800170721                        TO li_InvLmtAssetsDist (IACIDX, LMTIDX)
312900170721
313000170721                      MOVE DIST-UNITS-VAR OF
313100170721                                   DEALER-REP-DLY-SRV-VAR
313200170721                        TO li_InvLmtDistUnits (IACIDX, LMTIDX)
313300170721      * Rfs 37142 Ends
313400170721                     MOVE NO-OF-ACCOUNTS      OF
313500170721                                   DEALER-REP-DLY-SRV-VAR
313600170721                       TO WS-INV-LMT-NO-ACCT (IACIDX, LMTIDX)
313700181015      *RFS1003172 - Starts
313800181015                  ELSE
313900181015                     MOVE DAILY-VALUE-ACTUAL-VAR OF
314000181015                                   DEALER-REP-DLY-SRV-VAR
314100181015                      TO WS-INV-LMT-ASSETS(IACIDX, LMTIDX)
314200181026      *RFS1003172 - Ends
314300170721                  END-IF
314400170721             WHEN WS-INV-LMT-SCHED(IACIDX, LMTIDX) = SPACES
314500170721                  MOVE TRAILER-SCHEDULE-CODE OF
314600170721                                   DEALER-REP-DLY-SRV-VAR
314700170721                       TO WS-INV-LMT-SCHED (IACIDX, LMTIDX)
314800170721                  MOVE LOWER-LIMIT-DAYS OF DEALER-REP-DLY-SRV-VAR
314900170721                    TO WS-INV-LMT-DAYS(IACIDX, LMTIDX)
315000170721                  MOVE WS-VARIABLE-RATE
315100170721                       TO WS-INV-LMT-RATE (IACIDX, LMTIDX)
315200170721                  ADD WS-DTL-TRAILER-VAR
315300170721                      TO WS-INV-LMT-FEE-AMT (IACIDX, LMTIDX)
315400170721                  ADD DAILY-VALUE-ACTUAL-VAR OF
315500170721                                   DEALER-REP-DLY-SRV-VAR
315600170721                      TO WS-INV-LMT-TOT-ASSETS (IACIDX, LMTIDX)
315700170721      * Rfs 37142 Begins
315800170721                  ADD li_Sf_Amt_Dist_var
315900170721                      TO li_InvLmtFeeDistAmt (IACIDX, LMTIDX)
316000170721      * Rfs 37142 Ends
316100170721
316200170721                  IF PROCESS-DATE OF DEALER-REP-DLY-SRV-VAR = COMM-QEND
316300170721                     MOVE DAILY-VALUE-ACTUAL-VAR OF
316400170721                                   DEALER-REP-DLY-SRV-VAR
316500170721                      TO WS-INV-LMT-ASSETS (IACIDX, LMTIDX)
316600170721
316700170721      * Rfs 37142 Begins
316800170721                     MOVE DAILY-VALUE-ACTUAL-DIST-VAR OF
316900170721                                   DEALER-REP-DLY-SRV-VAR
317000170721                      TO li_InvLmtAssetsDist (IACIDX, LMTIDX)
317100170721                     MOVE DIST-UNITS-VAR OF
317200170721                                   DEALER-REP-DLY-SRV-VAR
317300170721                      TO li_InvLmtDistUnits (IACIDX, LMTIDX)
317400170721      * Rfs 37142 Ends
317500170721
317600170721                     MOVE NO-OF-ACCOUNTS      OF
317700170721                                   DEALER-REP-DLY-SRV-VAR
317800170721                       TO WS-INV-LMT-NO-ACCT (IACIDX, LMTIDX)
317900181015      *RFS1003172 - Starts
318000181015                  ELSE
318100181015                     MOVE DAILY-VALUE-ACTUAL-VAR OF
318200181015                                   DEALER-REP-DLY-SRV-VAR
318300181015                      TO WS-INV-LMT-ASSETS(IACIDX, LMTIDX)
318400181015      *RFS1003172 - Ends
318500170721                  END-IF
318600170721           END-SEARCH.
318700170721
318800170721           GO TO READ-NEXT-VARIABLE.
318900170721       CVU-EXIT.
319000170721           EXIT.
319100170721      *RFS50475 Add - Begin
319200170721      *----------------------------------------------------------------*
319300170721       ChkTrailerSchedCodeOverride.
319400170721      *----------------------------------------------------------------*
319500170721           If lb_ALDTTF_EditYes
319600170721504758       Move Trailer-Schedule-Code of Dealer-Rep-Dly-Srv-Var to
319700170721504758          lc_TrailerSchedCode
319800170721             Move Dealer-Code    of Dealer-Rep-Dly-Srv-Var to
319900170721                lc_DealerCode
320000170721             Move Investment-Code of Dealer-Rep-Dly-Srv-Var to
320100170721                lc_InvestmentCode
320200170721             Exec sql
320300170721                select coalesce(Trscdp.Trailer_Schedule_Code,"    ")
320400170721                into :lc_TrailerSchedCode
320500170721                from Mfadeaisp Deaisp
320600170721                left outer join Mfatrscdp Trscdp on
320700170721                     Trscdp.Trailer_Schedule_Code =
320800170721                     Deaisp.Trailer_Schedule_Code
320900170721                where Deaisp.Dealer_Code = :lc_DealerCode and
321000170721                      Deaisp.Investment_Code = :lc_InvestmentCode and
321100170721                      Trscdp.Trailer_Rate_Type = :lncc_V
321200170721             End-exec
321300170721                If lc_TrailerSchedCode equal space
321400170721                 Move Trailer-Schedule-Code of Dealer-Rep-Dly-Srv-Var to
321500170721                    lc_TrailerSchedCode
321600170721                End-if
321700170721           Else
321800170721             Move Trailer-Schedule-Code of Dealer-Rep-Dly-Srv-Var to
321900170721                lc_TrailerSchedCode
322000170721           End-if.
322100170721
322200170721      *--------------------------------------------------------------*
322300170721      * Calcualte Total Variable.                                    *
322400170721      *--------------------------------------------------------------*
322500170721
322600170721       WRITE-TRAP-V.
322700170721           SET LMTIDX TO 0.
322800170721
322900170721           INITIALIZE MFATRAVP OF TRAILER-PAYMENT-VAR.
323000170721           MOVE DEALER-CODE   OF TRAILER-REC
323100170721                TO DEALER-CODE  OF TRL-PAY-VAR-REC.
323200170721           MOVE DEALER-REP-CODE OF TRAILER-REC
323300170721                TO DEALER-REP-CODE OF TRL-PAY-VAR-REC.
323400170721           MOVE TRAILER-RECORD-TYPE-CODE OF TRAILER-REC
323500170721                TO TRAILER-RECORD-TYPE-CODE OF TRL-PAY-VAR-REC.
323600170721           MOVE INVESTMENT-CODE OF TRAILER-REC
323700170721                TO INVESTMENT-CODE OF TRL-PAY-VAR-REC.
323800170721           MOVE CURRENCY-DDS    OF TRAILER-REC
323900170721                TO CURRENCY-DDS OF    TRL-PAY-VAR-REC.
324000170721           MOVE YEAR            OF TRAILER-REC
324100170721                TO YEAR         OF    TRL-PAY-VAR-REC.
324200170721           MOVE MONTH           OF TRAILER-REC
324300170721                TO MONTH        OF    TRL-PAY-VAR-REC.
324400170721           MOVE ELIGIBLE-FOR-PAYMENT OF TRAILER-REC
324500170721                TO ELIGIBLE-FOR-PAYMENT-VAR OF  TRL-PAY-VAR-REC.
324600170721
324700170721       WTV-NEXT-REC.
324800170721           SET LMTIDX UP BY 1.
324900170721139475*    IF LMTIDX > 100 OR  WS-INV-LMT-SCHED(IACIDX, LMTIDX) = " "
325000170721139475     IF LMTIDX > 20  OR  WS-INV-LMT-SCHED(IACIDX, LMTIDX) = " "
325100170721              GO TO WTV-EXIT.
325200170721
325300170721           MOVE WS-INV-LMT-DAYS(IACIDX, LMTIDX)
325400170721                TO LOWER-LIMIT-DAYS OF TRL-PAY-VAR-REC.
325500170721RT    * rfs 25827 - start comment begin
325600170721RT    *    MOVE WS-INV-LMT-ASSETS(IACIDX, LMTIDX)
325700170721RT    *         TO ASSETS-VAR OF TRL-PAY-VAR-REC.
325800170721RT    * rfs 25827 - start comment end
325900170721      * RFS168505 - start
326000170721RT    *    COMPUTE ASSETS-VAR OF TRL-PAY-VAR-REC ROUNDED =
326100170721RT    *            WS-INV-LMT-ASSETS(IACIDX, LMTIDX).
326200181015      *RFS1003172 - Starts
326300181015      *    COMPUTE ASSETS-VAR OF TRL-PAY-VAR-REC ROUNDED =
326400181015      *            WS-IA-TOTAL-ASSETS-VAR(IACIDX).
326500181015           COMPUTE ASSETS-VAR OF TRL-PAY-VAR-REC ROUNDED =
326600181023                   WS-INV-LMT-ASSETS(IACIDX, LMTIDX).
326700181015      *RFS1003172 - Ends
326800170721      * RFS168505 - End
326900170721RT    * rfs 25827 - start comment begin
327000170721X19162*RT  ADD  WS-INV-LMT-ASSETS(IACIDX, LMTIDX)
327100170721X19162*RT    TO WS-VAR-ASSETS.
327200170721RT    * rfs 25827 - start comment end
327300170721RT         ADD  ASSETS-VAR OF TRL-PAY-VAR-REC
327400181013RT           TO WS-VAR-ASSETS.
327500170721
327600170721      * Rfs37142 Begins
327700170721           COMPUTE ASSETS-DIST-VAR OF TRL-PAY-VAR-REC ROUNDED =
327800170721                   li_InvLmtAssetsDist (IACIDX, LMTIDX).
327900170721
328000170721           COMPUTE DIST-UNITS-VAR OF TRL-PAY-VAR-REC ROUNDED  =
328100170721                   li_InvLmtDistUnits (IACIDX, LMTIDX).
328200170721      * Rfs37142 Ends
328300170721           MOVE WS-INV-LMT-SCHED (IACIDX, LMTIDX)
328400170721                TO TRAILER-SCHEDULE-CODE OF TRL-PAY-VAR-REC.
328500170721           MOVE WS-INV-LMT-RATE  (IACIDX, LMTIDX)
328600170721                TO TRAILER-RATE-VAR OF TRL-PAY-VAR-REC.
328700170721      *RFS168505 -Start
328800170721      *    MOVE WS-INV-LMT-NO-ACCT  (IACIDX, LMTIDX)
328900170721      *         TO NO-OF-ACCOUNTS OF TRL-PAY-VAR-REC.
329000170721           MOVE ln_TotalNoOfAccounts
329100170721                TO NO-OF-ACCOUNTS OF TRL-PAY-VAR-REC.
329200170721      *RFS168505 -Ends.
329300170721           COMPUTE GROSS-TRAILER-AMT-VAR OF TRL-PAY-VAR-REC ROUNDED
329400170721                 = WS-INV-LMT-FEE-AMT(IACIDX, LMTIDX).
329500170721           MOVE GROSS-TRAILER-AMT-VAR OF TRL-PAY-VAR-REC
329600170721                TO NET-TRAILER-AMT-VAR OF TRL-PAY-VAR-REC.
329700170721D19162     COMPUTE AVERAGE-ASSETS-VAR OF TRL-PAY-VAR-REC ROUNDED
329800170721D19162           = WS-INV-LMT-TOT-ASSETS(IACIDX, LMTIDX) / WS-DAYS.
329900170721X19162     ADD  GROSS-TRAILER-AMT-VAR OF TRL-PAY-VAR-REC
330000170721X19162       TO WS-VAR-TRAILER-AMT.
330100170721
330200170721      *Rfs 37142  Begins - clarify with RichardS
330300170721           COMPUTE GROSS-TRAILER-AMT-DIST-VAR OF TRL-PAY-VAR-REC ROUNDED
330400170721                 = li_InvLmtFeeDistAmt(IACIDX, LMTIDX).
330500170721           MOVE GROSS-TRAILER-AMT-DIST-VAR OF TRL-PAY-VAR-REC
330600170721                TO NET-TRAILER-AMT-DIST-VAR OF TRL-PAY-VAR-REC.
330700170721      *Rfs 37142  Ends - clarify with RichardS
330800170721
330900170721           WRITE TRL-PAY-VAR-REC
331000170721           INVALID KEY
331100170721              MOVE "99" TO WS-FILE-STATUS
331200170721              MOVE "TRAILER-PAYMENT-VAR "
331300170721                        TO WS-FILE-STATUS-FILE
331400170721              PERFORM LOG-FILE-STATUS  THRU LFS-EXIT
331500170721           END-WRITE.
331600170721           GO TO WTV-NEXT-REC.
331700170721
331800170721       WTV-EXIT.
331900170721           EXIT.
332000170721
332100170721**********************************************************************
332200170721D19162*RFS-19162 - end
332300170721
33240017072140800  CalcTrailerFromRate.
332500170721
33260017072140800      IF WS-DEALER-LEVEL-RATES = "Y"
33270017072140800         IF IS-LEAP-YEAR
33280017072140800            COMPUTE WS-DLY-TRAILER ROUNDED =
33290017072140800            ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
333000170721      *RFS112945-Begin
33310017072140800 *          * WS-DI-TRAIL-RATE) * .00273224)
33320017072140800            * WS-DI-TRAIL-RATE) / li_PaymentFreq)
333300170721      *RFS112945-End
33340017072140800         ELSE
33350017072140800            COMPUTE WS-DLY-TRAILER ROUNDED =
33360017072140800            ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
333700170721      *RFS112945-Begin
33380017072140800 *          * WS-DI-TRAIL-RATE) * .002739726)
33390017072140800            * WS-DI-TRAIL-RATE) / li_PaymentFreq)
334000170721      *RFS112945-End
33410017072140800         END-IF
33420017072140800      ELSE
33430017072140800         IF IS-LEAP-YEAR
33440017072140800            COMPUTE WS-DLY-TRAILER ROUNDED =
33450017072140800            ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
334600170721      *RFS112945-Begin
33470017072140800 *          * WS-IA-TRAIL-RATE) * .00273224)
33480017072140800            * WS-IA-TRAIL-RATE) / li_PaymentFreq)
334900170721      *RFS112945-End
33500017072140800         ELSE
33510017072140800            COMPUTE WS-DLY-TRAILER ROUNDED =
33520017072140800            ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
335300170721      *RFS112945-Begin
33540017072140800 *          * WS-IA-TRAIL-RATE) * .002739726)
33550017072140800            * WS-IA-TRAIL-RATE) / li_PaymentFreq)
335600170721      *RFS112945-End
33570017072140800        END-IF
33580017072140800      END-IF.
335900200803      *RFS185175-Starts
336000200803       CalcTrailerFromRateYr.
336100200803           IF WS-DEALER-LEVEL-RATES = "Y"
336200200803              COMPUTE WS-DLY-TRAILER ROUNDED =
336300200803              ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
336400200803              * WS-DI-TRAIL-RATE) / 12)
336500200803           ELSE
336600200803              COMPUTE WS-DLY-TRAILER ROUNDED =
336700200803              ((DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
336800200803              * WS-IA-TRAIL-RATE) / 12)
336900200803           END-IF.
337000200803      *RFS185175-Ends
337100170721
33720017072140800  CalcTrailerGrandFather.
337300170721
33740017072140800      IF WS-DEALER-LEVEL-RATES = "Y"
33750017072140800         IF IS-LEAP-YEAR
33760017072140800            COMPUTE WS-DLY-TRAILER-GF ROUNDED =
33770017072140800            ((DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE
33780017072140800            * WS-DI-TRAIL-T-RATE(DIIDX)) * .00273224)
33790017072140800         ELSE
33800017072140800            COMPUTE WS-DLY-TRAILER-GF ROUNDED =
33810017072140800            ((DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE
33820017072140800            * WS-DI-TRAIL-T-RATE(DIIDX)) * .002739726)
33830017072140800         END-IF
33840017072140800      ELSE
33850017072140800        IF IS-LEAP-YEAR
33860017072140800           COMPUTE WS-DLY-TRAILER-GF ROUNDED =
33870017072140800             ((DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE
33880017072140800             * WS-IA-TRAIL-T-RATE(IACIDX)) * .00273224)
33890017072140800        ELSE
33900017072140800           COMPUTE WS-DLY-TRAILER-GF ROUNDED =
33910017072140800             ((DAILY-VALUE-ACTUAL-GF OF DEALER-REP-DLY-SRV-FEE
33920017072140800             * WS-IA-TRAIL-T-RATE(IACIDX)) * .002739726)
33930017072140800        END-IF
33940017072140800      END-IF.
339500170721
339600170721      * RFS 60213 - begins.
339700170721       Check_Price.
339800170721
339900170721           MOVE INVESTMENT-CODE  OF  DEALER-REP-DLY-SRV-FEE
340000170721             TO INVESTMENT-CODE  OF  INVESTMENT-UNIT-PRICE.
340100170721
340200170721           MOVE PROCESS-DATE     OF  DEALER-REP-DLY-SRV-FEE
340300170721             TO TRADE-DATE       OF  INVESTMENT-UNIT-PRICE.
340400170721
340500170721           START INVESTMENT-UNIT-PRICE
340600170721           KEY IS GREATER  THAN EXTERNALLY-DESCRIBED-KEY
340700170721             INVALID KEY
340800170721               READ INVESTMENT-UNIT-PRICE LAST RECORD
340900170721                 AT END
341000170721                    CONTINUE
341100170721                 NOT AT END
341200170721                    IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE =
341300170721                       INVESTMENT-CODE OF DEALER-REP-DLY-SRV-FEE  AND
341400170721                       UNIT-PRICE OF INVESTMENT-UNIT-PRICE NOT =
341500170721                       UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE
341600170721                         PERFORM Recalc_MFADEADSP_Buckets
341700170721                    END-IF
341800170721               END-READ
341900170721             NOT INVALID KEY
342000170721               READ INVESTMENT-UNIT-PRICE PRIOR RECORD
342100170721                 AT END
342200170721                    CONTINUE
342300170721                 NOT AT END
342400170721                    IF INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE =
342500170721                       INVESTMENT-CODE OF DEALER-REP-DLY-SRV-FEE  AND
342600170721                       UNIT-PRICE OF INVESTMENT-UNIT-PRICE NOT =
342700170721                       UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE
342800170721                         PERFORM Recalc_MFADEADSP_Buckets
342900170721                    END-IF
343000170721               END-READ
343100170721           END-START.
343200170721
343300170721       Recalc_MFADEADSP_Buckets.
343400170721
343500170721           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE TO
343600170721                UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE.
343700170721
343800170721           IF UNITS OF DEALER-REP-DLY-SRV-FEE NOT = 0
343900170721              COMPUTE DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE
344000170721                      ROUNDED = (UNITS  OF DEALER-REP-DLY-SRV-FEE *
344100170721                                 UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE)
344200170721              MOVE DAILY-VALUE-ACTUAL OF DEALER-REP-DLY-SRV-FEE  TO
344300170721                   DAILY-VALUE-BASE   OF DEALER-REP-DLY-SRV-FEE
344400170721              IF EXCHANGE-RATE OF DEALER-REP-DLY-SRV-FEE NOT = 0  AND 1
344500170721                 COMPUTE DAILY-VALUE-BASE OF DEALER-REP-DLY-SRV-FEE
344600170721                 ROUNDED = DAILY-VALUE-BASE OF
344700170721                           DEALER-REP-DLY-SRV-FEE /
344800170721                           EXCHANGE-RATE OF DEALER-REP-DLY-SRV-FEE
344900170721              END-IF
345000170721           END-IF.
345100170721
345200170721           IF UNITS-FIX  OF DEALER-REP-DLY-SRV-FEE NOT = 0
345300170721              COMPUTE DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE
345400170721                      ROUNDED = (UNITS-FIX  OF DEALER-REP-DLY-SRV-FEE *
345500170721                                 UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE)
345600170721              MOVE DAILY-VALUE-ACTUAL-FIX OF DEALER-REP-DLY-SRV-FEE  TO
345700170721                   DAILY-VALUE-BASE-FIX   OF DEALER-REP-DLY-SRV-FEE
345800170721              IF EXCHANGE-RATE OF DEALER-REP-DLY-SRV-FEE NOT = 0 AND 1
345900170721                 COMPUTE DAILY-VALUE-BASE-FIX OF DEALER-REP-DLY-SRV-FEE
346000170721                 ROUNDED = DAILY-VALUE-BASE-FIX OF
346100170721                           DEALER-REP-DLY-SRV-FEE /
346200170721                           EXCHANGE-RATE OF DEALER-REP-DLY-SRV-FEE
346300170721              END-IF
346400170721           END-IF.
346500170721
346600170721           IF UNITS-GF   OF DEALER-REP-DLY-SRV-FEE NOT = 0
346700170721              COMPUTE DAILY-VALUE-ACTUAL-GF  OF DEALER-REP-DLY-SRV-FEE
346800170721                      ROUNDED = (UNITS-GF   OF DEALER-REP-DLY-SRV-FEE *
346900170721                                 UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE)
347000170721              MOVE DAILY-VALUE-ACTUAL-GF  OF DEALER-REP-DLY-SRV-FEE  TO
347100170721                   DAILY-VALUE-BASE-GF    OF DEALER-REP-DLY-SRV-FEE
347200170721              IF EXCHANGE-RATE OF DEALER-REP-DLY-SRV-FEE NOT = 0 AND 1
347300170721                 COMPUTE DAILY-VALUE-BASE-GF  OF DEALER-REP-DLY-SRV-FEE
347400170721                 ROUNDED = DAILY-VALUE-BASE-GF  OF
347500170721                           DEALER-REP-DLY-SRV-FEE /
347600170721                           EXCHANGE-RATE OF DEALER-REP-DLY-SRV-FEE
347700170721              END-IF
347800170721           END-IF.
347900170721
348000170721           REWRITE DEALER-REP-DLY-SRV-FEE-REC
348100170721           INVALID KEY
348200170721              MOVE "99" TO WS-FILE-STATUS
348300170721              MOVE "DLR-REP-DLY-SRV-FEE " TO WS-FILE-STATUS-FILE
348400170721              PERFORM LOG-FILE-STATUS
348500170721           END-REWRITE.
348600170721
348700170721       Recalc_MFADEADVP_Buckets.
348800170721
348900170721           MOVE UNIT-PRICE OF DEALER-REP-DLY-SRV-FEE TO
349000170721                UNIT-PRICE OF DEALER-REP-DLY-SRV-VAR.
349100170721
349200170721           IF UNITS-VAR OF DEALER-REP-DLY-SRV-VAR NOT = 0
349300170721              COMPUTE DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-VAR
349400170721                      ROUNDED = (UNITS-VAR  OF DEALER-REP-DLY-SRV-VAR *
349500170721                                 UNIT-PRICE OF DEALER-REP-DLY-SRV-VAR)
349600170721
349700170721              COMPUTE ln_Daily_Value_Actual_Var_Tot =
349800170721                      ln_Daily_Value_Actual_Var_Tot  +
349900170721                      DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-VAR
350000170721
350100170721              MOVE DAILY-VALUE-ACTUAL-VAR OF DEALER-REP-DLY-SRV-VAR  TO
350200170721                   DAILY-VALUE-BASE-VAR   OF DEALER-REP-DLY-SRV-VAR
350300170721
350400170721              IF EXCHANGE-RATE OF DEALER-REP-DLY-SRV-VAR NOT = 0  AND 1
350500170721                 COMPUTE DAILY-VALUE-BASE-VAR OF DEALER-REP-DLY-SRV-VAR
350600170721                 ROUNDED = DAILY-VALUE-BASE-VAR OF
350700170721                           DEALER-REP-DLY-SRV-VAR /
350800170721                           EXCHANGE-RATE OF DEALER-REP-DLY-SRV-VAR
350900170721
351000170721                 COMPUTE ln_Daily_Value_Base_Var_Tot =
351100170721                         ln_Daily_Value_Base_Var_Tot  +
351200170721                         DAILY-VALUE-BASE-VAR OF DEALER-REP-DLY-SRV-VAR
351300170721
351400170721              END-IF
351500170721           END-IF.
351600170721
351700170721           IF DIST-UNITS-VAR OF DEALER-REP-DLY-SRV-VAR NOT = 0
351800170721              COMPUTE DAILY-VALUE-ACTUAL-DIST-VAR  OF
351900170721                      DEALER-REP-DLY-SRV-VAR
352000170721              ROUNDED = (DIST-UNITS-VAR  OF DEALER-REP-DLY-SRV-VAR *
352100170721                              UNIT-PRICE OF DEALER-REP-DLY-SRV-VAR)
352200170721
352300170721              MOVE DAILY-VALUE-ACTUAL-DIST-VAR OF
352400170721                   DEALER-REP-DLY-SRV-VAR  TO
352500170721                   DAILY-VALUE-BASE-DIST-VAR OF DEALER-REP-DLY-SRV-VAR
352600170721
352700170721              IF EXCHANGE-RATE OF DEALER-REP-DLY-SRV-VAR NOT = 0  AND 1
352800170721                 COMPUTE DAILY-VALUE-BASE-DIST-VAR OF
352900170721                         DEALER-REP-DLY-SRV-VAR
353000170721                 ROUNDED = DAILY-VALUE-BASE-DIST-VAR OF
353100170721                           DEALER-REP-DLY-SRV-VAR /
353200170721                           EXCHANGE-RATE OF DEALER-REP-DLY-SRV-VAR
353300170721              END-IF
353400170721           END-IF.
353500170721      * RFS 60213 - ends.
353600170721      *Rfs154537 - Begin
353700170721       ALIGN_SS_LS.
353800170721           ADD WS-NEW-TRAILER-AMT TO WS-NEW-TRAILER-AMT2,
353900170721                                     WS-NEW-TRAILER-AMT6.
354000170721           COMPUTE WS-VARIANCE-AMT ROUNDED =  (WS-NEW-TRAILER-AMT6 -
354100170721                                               WS-NEW-TRAILER-AMT2)
354200170721           ADD WS-VARIANCE-AMT TO
354300170721                               GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC,
354400171121      *RFS173258 - Starts
354500171121                               NET-TRAILER-AMT OF TRAILER-ACCOUNT-REC.
354600171121      *                        NET-TRAILER-AMT OF TRAILER-ACCOUNT-REC,
354700171121      *                        WS-NEW-TRAILER-AMT2
354800171121           IF GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC >= 0
354900171121                 ADD WS-VARIANCE-AMT TO WS-NEW-TRAILER-AMT2
355000171121           END-IF.
355100171121      *RFS173258 - Ends
355200170721      *Rfs154537 - End
355300170721      *RFS162565 Starts
355400170721           IF WS-MODULE-AUTH-SRVVAR NOT = "Y"
355500170721           AND (GROSS-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC) > 0
355600170721              COMPUTE GROSS-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC =
355700170721                      GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC -
355800170721                      GROSS-TRAILER-AMT-FIX OF TRAILER-ACCOUNT-REC
355900170721              MOVE GROSS-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC TO
356000170721                     NET-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC
356100170721           END-IF.
356200170721      *RFS162565 Ends
356300170721
356400170721      *RFS160475 Starts
356500170721           IF li-AA-ACCRUED-GF NOT= 0
356600170721              ADD li-AA-ACCRUED-GF   TO WS-NEW-TRAILER-AMT2-GF,
356700170721                                        WS-NEW-TRAILER-AMT6-GF
356800170721              COMPUTE WS-VARIANCE-AMT-GF ROUNDED =
356900170721                   (WS-NEW-TRAILER-AMT6-GF - WS-NEW-TRAILER-AMT2-GF)
357000170721              ADD WS-VARIANCE-AMT-GF TO
357100170721                           GROSS-TRAILER-AMT-GF OF TRAILER-ACCOUNT-REC ,
357200170721                           NET-TRAILER-AMT-GF OF TRAILER-ACCOUNT-REC
357300170721                           WS-NEW-TRAILER-AMT2-GF
357400170721           END-IF.
357500170721      *RFS160475 Ends
357600170721      *RFS162565 - Begin
357700170721       ALIGN_LAST_ROUNDING.
357800170721           COMPUTE WS-VARIANCE-AMT-VR =
357900170721              GROSS-TRAILER-AMT OF TRAILER-REC - WS-NEW-TRAILER-AMT2
358000201211      * RFS1021251 - Begins
358100210120           IF GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC = 0
358200210119              COMPUTE GROSS-TRAILER-AMT OF TRAILER-REC   =
358300210119                      GROSS-TRAILER-AMT OF TRAILER-REC   -
358400210121                      WS-VARIANCE-AMT-VR
358500210119              MOVE    GROSS-TRAILER-AMT OF TRAILER-REC
358600210119                                        TO NET-TRAILER-AMT
358700210119                                        OF TRAILER-REC
358800210119           ELSE
358900210119            IF WS-VARIANCE-AMT-VR >=0
359000210119               ADD WS-VARIANCE-AMT-VR TO
359100210119                            GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC   ,
359200210119                            NET-TRAILER-AMT OF TRAILER-ACCOUNT-REC
359300210119
359400210119            ELSE
359500210119                COMPUTE WS-VARIANCE-AMT-VR2 = WS-VARIANCE-AMT-VR * -1
359600210119                IF GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC
359700210119                         >= WS-VARIANCE-AMT-VR2
359800210120                   COMPUTE GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC
359900210120                       =   GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC
360000210120                       -   WS-VARIANCE-AMT-VR2
360100210120                   MOVE    GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC
360200210120                                             TO NET-TRAILER-AMT
360300210119                                             OF TRAILER-ACCOUNT-REC
360400210120                ELSE
360500210120                   COMPUTE GROSS-TRAILER-AMT OF TRAILER-REC
360600210120                       =   GROSS-TRAILER-AMT OF TRAILER-REC
360700210120                       -   GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC
360800210120                   MOVE    GROSS-TRAILER-AMT OF TRAILER-REC
360900210120                                             TO NET-TRAILER-AMT
361000210120                                             OF TRAILER-REC
361100210119                   MOVE    0                 TO  GROSS-TRAILER-AMT
361200210119                                             OF TRAILER-ACCOUNT-REC
361300210119                   MOVE    0                 TO  NET-TRAILER-AMT
361400210119                                             OF TRAILER-ACCOUNT-REC
361500210119                END-IF
361600210119            END-IF
361700201211      * RFS1021251 - Ends
361800210120      * RFS1021251 - Begins
361900210120      *    IF WS-VARIANCE-AMT-VR NOT= 0
362000210129      *         ADD WS-VARIANCE-AMT-VR TO
362100210129      *                     GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC   ,
362200210129      *                      NET-TRAILER-AMT OF TRAILER-ACCOUNT-REC
362300210129169622*        PERFORM FIX-NEGATIVE-AMT
362400201211      * RFS1021251 - Ends
362500170721               REWRITE TRAILER-ACCOUNT-REC
362600170721               INVALID KEY
362700170721                 MOVE "99" TO WS-FILE-STATUS
362800170721                 MOVE "TRAILER-ACCOUNT-REWR"
362900170721                        TO WS-FILE-STATUS-FILE
363000170721                 PERFORM LOG-FILE-STATUS
363100170721           END-IF.
363200170721      *RFS162565 - End.
363300170721
363400170721      *RFS169622 - Begin
363500170721
363600170721       FIX-NEGATIVE-AMT.
363700170721
363800170721           IF GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC < 0
363900170721              MOVE 0 TO GROSS-TRAILER-AMT OF TRAILER-ACCOUNT-REC
364000170721           END-IF.
364100170721
364200170721           IF NET-TRAILER-AMT OF TRAILER-ACCOUNT-REC < 0
364300170721              MOVE 0 TO NET-TRAILER-AMT OF TRAILER-ACCOUNT-REC
364400170721           END-IF.
364500170721
364600170721           IF WS-NEW-TRAILER-AMT2 < 0
364700170721              MOVE 0 TO WS-NEW-TRAILER-AMT2
364800170721           END-IF.
364900170721
365000170721           IF GROSS-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC < 0
365100170721              MOVE 0 TO GROSS-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC
365200170721           END-IF.
365300170721
365400170721           IF NET-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC < 0
365500170721              MOVE 0 TO NET-TRAILER-AMT-VAR OF TRAILER-ACCOUNT-REC
365600170721           END-IF.
365700170721
365800170721           IF GROSS-TRAILER-AMT-FIX OF TRAILER-ACCOUNT-REC < 0
365900170721              MOVE 0 TO GROSS-TRAILER-AMT-FIX OF TRAILER-ACCOUNT-REC
366000170721           END-IF.
366100170721
366200170721           IF NET-TRAILER-AMT-FIX OF TRAILER-ACCOUNT-REC < 0
366300170721              MOVE 0 TO NET-TRAILER-AMT-FIX OF TRAILER-ACCOUNT-REC
366400170721           END-IF.
366500170721
366600170721           IF GROSS-TRAILER-AMT-GF OF TRAILER-ACCOUNT-REC < 0
366700170721              MOVE 0 TO GROSS-TRAILER-AMT-GF OF TRAILER-ACCOUNT-REC
366800170721           END-IF.
366900170721
367000170721           IF NET-TRAILER-AMT-GF OF TRAILER-ACCOUNT-REC < 0
367100170721              MOVE 0 TO NET-TRAILER-AMT-GF OF TRAILER-ACCOUNT-REC
367200170721           END-IF.
367300170721
367400170721           IF WS-NEW-TRAILER-AMT2-GF < 0
367500170721              MOVE 0 TO WS-NEW-TRAILER-AMT2-GF
367600170721           END-IF.
367700170721
367800170721      *RFS169622 - End
367900200525      *RFS 1081324 Begin
368000200605       Recalc-Trailer-Payment.
368100200605           ADD PREV-GROSS-TRL-AMT     TO WS-IA-ACCRUED(IACIDX).
368200200605           ADD PREV-GROSS-TRL-AMT-GF  TO WS-IA-ACCRUED-GF(IACIDX).
368300200605           ADD PREV-NO-OF-ACCOUNTS    TO ln_TotalNoOfAccounts.
368400200605           ADD PREV-ASSETS            TO li_TotalAssets.
368500200605           ADD PREV-ASSETS-GF         TO li_TotalAssetsGF.
368600200605           ADD PREV-UNIT-BAL          TO WS-IA-UNIT-BAL(IACIDX).
368700200605           ADD PREV-AVG-ASSETS        TO WS-IA-TOTAL-ASSETS(IACIDX).
368800200605           ADD PREV-AVG-ASSETS-GF     TO WS-IA-TOTAL-ASSETS-GF(IACIDX).
368900200605           ADD PREV-GROSS-TRL-AMT-FIX TO WS-IA-ACCRUED-FIX(IACIDX)
369000200605           ADD PREV-AVG-ASSETS-FIX    TO WS-IA-TOTAL-ASSETS-FIX(IACIDX)
369100200605           ADD PREV-AVG-ASSETS-VAR    TO WS-IA-TOTAL-ASSETS-VAR(IACIDX)
369200200605           ADD PREV-ASSETS-FIX        TO li_TotalAssetsFix
369300200605      *RFS 1081324 End
369400210510      *RFS 1113297 - Begins
369500210510       SEARCH-VAR-SCHED-METHOD
369600210510           SET VARIDX TO 0.
369700210510           SEARCH ALL WS-VR-RATES-ENTRY
369800210510              AT END
369900210510                   MOVE 'N' TO lc_CalcVarUnit
370000210510              WHEN WS-VR-SCHEDULE-CODE(VARIDX) =
370100210510                   WS-INV-TRL-VAR-SCHED
370200210510                     IF WS-VR-ASSETS-RULE(VARIDX) = "1"
370300210510                         AND WS-VR-TRACK-METHOD(VARIDX) = "1"
370400210510                         MOVE 'Y' TO lc_CalcVarUnit
370500210510                     END-IF
370600210510                END-SEARCH.
370700210510      *RFS 1113297 - Ends
