000100021001       IDENTIFICATION DIVISION.
000200021001       PROGRAM-ID.     STMCNFPRT.
000300021001       INSTALLATION.   Jewelstone Systems Inc.
000400021001       AUTHOR.         Jewelstone Systems Inc.
000500021001       DATE-WRITTEN.   October 1, 2002.
000600021001       DATE-COMPILED.
000700021001
000800021001      ******************************************************************
000900021001      *                                                                *
001000021001      *    STMCNFPRT:  Statement and Confirmation - Standard Form      *
001100021001      *                                                                *
001200021001      *    PURPOSE:    To format and print Statement and Confirm       *
001300021001      *                using the standard format and the Jewelstone    *
001400021001      *                Statement File (MFASTMTFP).                     *
001500021001      *                                                                *
001600021001      *    LEVELS:      1. INVESTOR-NO                                 *
001700021001      *                 2. ACCOUNT                                     *
001800021001      *                                                                *
001900021001      *    FILES:      (I) MFAACOJLA   Investor Join
002000021001      *                (I) MFACURP     Currency Code                   *
002100021001      *                (I) MFADEAMIP   Dealer Mailing Instruction      *
002200021001      *                (I) MFADEAP     Dealer                          *
002300021001      *                (I) MFADEAREP   Dealer Representative           *
002400021001      *                (I) MFADERMIP   Dealer Representative Mailing   *
002500021001      *                                Instruction                     *
002600021001      *                (I) MFADRADRP   Dealer Representative Address   *
002700021001      *                (I) MFAINADDP   Institution Address             *
002800021001      *                (I) MFAINSBRP   Institution Branch              *
002900021001      *                (I) MFAINVP     Investment                      *
003000021001      *                (I) MFANMTPYP   Nominee Account Type Descr
003100021002      *                (I) MFAACCTYP   Account Type BK
003200021001      *                (I) MFANOMMIP   Nominee Mailing Instruction     *
003300021001      *                (I) MFASTMMSP   Statement Message               *
003400021001      *                (O) MFASTMPDP   Statement Print Header          *
003500021001      *                (O) MFASTMPHP   Statement Print Detail          *
003600021001      *                (I) MFASTMEXP   Statement Extract Data          *
003700021001      *                (O) PRINTER     Control Report                  *
003800021001      *                                                                *
003900021001      *    CREATED:    21/NOV/97 (HS)                                  *
004000021001      *    CHANGED:    13/FEB/98 (MFH)                                 *
004100021001      *                                                                *
004200021001      ******************************************************************
004300021001      /
004400021001      ******************************************************************
004500021001      *                                                                *
004600021001      *    C H A N G E   H I S T O R Y                                 *
004700021001      *                                                                *
004800021001      ******************************************************************
004900021001      ******************************************************************
005000021001      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
005100021001      ******************************************************************
005200021101      *            *              *
005300021101      * B.LU       * 2002/11/01   * RFS14849                           *
005400021101      *            *              * -Moved Trans Type column two       *
005500021101      *            *              * spaces to the right.
005600030508      ******************************************************************
005700030319      * B.LU       * 2003/03/19   * RFS16256  RECOMPILE.
005800030508      ******************************************************************
005900030325      * B.LU       * 2003/03/25   * RFS16633  RECOMPILE.
006000030623      ******************************************************************
006100030623      * O.McMillan * 2003/06/17   * RFS17217  RECOMPILE.
006200021001      ******************************************************************
006300030508      * Odette     * 2003/05/08   * RFS17165  MFASTMEXP expanded from
006400030528      * McMillan   *              * 1100 to 1350.  Change work areas.
006500030508      ******************************************************************
006600030624      * Odette     * 2003/06/04   * RFS16881  Recompile.
006700030624      * McMillan   *              *
006800030624      ******************************************************************
006900030822      * Odette     * 2003/08/22   * RFS18091  Recompile for addition
007000030822      * McMillan   *              * of Section 17 to CPYJSISTMT.
007100030822      ******************************************************************
007200030825      * Odette     * 2003/08/25   * RFS17380  Recompile for additional
007300030825      * McMillan   *              * fields in Section 05 of CPYJSISTMT.
007400030825      ******************************************************************
007500031003      * Odette     * 2003/09/22   * RFS 18653 - Recompile.
007600031003      * McMillan   *              * Moved Section 17 rec counter field
007700031003      *            *              * in Section 99 to bottom of rec.
007800031003      ******************************************************************
007900031002      * B.LU       * 2003/10/02   * RFS17527  Recompile.
008000031002      ******************************************************************
008100031015      * ALI.A      * 2003/10/15   * RFS17626  Recompile.
008200031015      ******************************************************************
008300031020      * ALI.A      * 2003/10/20   * RFS18667  Recompile.
008400031020      ******************************************************************
008500031021      * ALI.A      * 2003/10/21   * RFS18312  Recompile.
008600031021      ******************************************************************
008700031121      * ALI.A      * 2003/11/21   * RFS18515  Recompile.
008800031121      ******************************************************************
008900031125      * ALI.A      * 2003/11/21   * RFS18814  Recompile.
009000031125      ******************************************************************
009100040217      * ALI.A      * 2004/02/17   * RFS19444  Recompile.
009200040217      ******************************************************************
009300040406      * ALI.A      * 2004/04/06   * RFS20870  Recompile.
009400040406      ******************************************************************
009500040414      * ALI.A      * 2004/04/14   * RFS20758  Recompile.
009600040414      ******************************************************************
009700040514      * Odette     *  2004/04/27  * RFS21714 - Recompile
009800040514      * Aguinaldo- *              * Add new fields to Section 10 to
009900040514      * McMillan   *              * indicate if Dealer, Rep or Nominee
010000040514      *            *              * is/isn't suppressed.
010100040531      ******************************************************************
010200040531      * Reece Tam  * 2004/05/31   * RFS20804  Recompile - CPYLADASTMT.
010300040514      ******************************************************************
010400040908      * B.LU       * 2004/09/08   * RFS18924
010500040908      *            *              * -Recompile - CPYJSISTMT.
010600040908      ******************************************************************
010700041012      * B.LU       * 2004/10/12   * RFS22856
010800041012      *            *              * -Recompile - CPYJSISTMT.
010900041012      ******************************************************************
011000041025      * ALI.A      * 2004/10/25   * RFS18780
011100041025      *            *              * -Recompile - CPYJSISTMT.
011200041025      ******************************************************************
011300041028      * ALI.A      * 2004/10/28   * RFS21715
011400041028      *            *              * -Recompile - CPYJSISTMT.
011500041028      ******************************************************************
011600041220      * B.LU       * 2004/12/20   * RFS24514 -RECOMPILE - CPYJSISTMT.
011700041220      ******************************************************************
011800050429      * CHANDANA R * 2005/03/09   * RFS26213 -RECOMPILE - CPYJSISTMT
011900050429      ******************************************************************
012000050921      * ADE ADEYEMI* 2005/09/08   * RFS29550 -RECOMPILE - CPYJSISTMT
012100050921      ******************************************************************
012200051002      * ADE ADEYEMI* 2005/09/28   * RFS30065 -RECOMPILE - CPYJSISTMT
012300051002      ******************************************************************
012400050920      * Ali.A      * 2005/09/18   * RFS28931 -RECOMPILE - CPYJSISTMT
012500050920      ******************************************************************
012600050926      * C.LENTINI  * 2005/09/26   * RFS28692 -RECOMPILE - CPYJSISTMT
012700050926      ******************************************************************
012800050926      * Geeta S.   * 2005/09/15   * RFS 28107: Recompile for CPYJSISTMT
012900050926      ******************************************************************
013000060628      * B.LU       * 2006/06/28   * RFS35042 -Process Section 21
013100060618      ******************************************************************
013200060818      * Raymond Mui* 2006/08/18   * RFS34848 -RECOMPILE - CPYJSISTMT
013300060818      *                           *                     - CPYLDASTMT
013400060818      ******************************************************************
013500061024      * L. Wong    * 2006/10/24   * RFS36342 - Recompile - CPYJSISTMT,
013600061024      *            *              *                        CPYLDASTMT.
013700080620      ******************************************************************
013800080620      * Bathuu L   * 2008/06/20   * RFS50993 -RECOMPILE - CPYJSISTMT.
013900061024      ******************************************************************
014000090223      * TONY PALLIE* 2009/02/23   *RFS64527 - MAX ARRAY SIZE.
014100090915      ******************************************************************
014200090915      * Richard G. * 2009/08/13   * RFS72304 Initialize Var Array
014300090223      ******************************************************************
014400091111      * Andy Lo    * 2009/11/11   * RFS69515 -RECOMPILE - CPYJSISTMT
014500091111      *                           *                     - CPYLDASTMT
014600091125      *                           *           Process section 63
014700091111      ******************************************************************
014800100308      * A. Lo      * 2010/03/08   * RFS78161 -Recompile - CPYJSISTMT.
014900100308      ***************************************************************
015000100409      * A. Lo      * 2010/03/08   * RFS74626 -Recompile - CPYJSISTMT.
015100100308      ***************************************************************
015200120127      * Rekha S    * 2012/01/27   * RFS93662 -Recompile - CPYJSISTMT.
015300120912      ******************************************************************
015400120912      * Suresh G.  * 2012/09/12   * RFS112003-Recompile for CPYJSISTMT.
015500120912      ******************************************************************
015600130408      * Andy Chan  * 2013/04/08   * RFS117038-Add Section 22
015700130408      ******************************************************************
015800130529      * NOBLE T .  * 2013/05/29   * RFS121116-RECOMPILE FOR CPYLDASTMT.
015900130529      ******************************************************************
016000130905      * PRAVEEN E  * 2013/09/05   *RFS123925 RECOMPIL ONLY - CPYJSISTMT*
016100140519      * NOBLE T    * 2014/05/02   * RFS130239 - RECOMPILE - CPYJSISTMT *
016200140418      ******************************************************************
016300140418      *SANGEETHA V  * 2014/03/25 * RFS129378 - RECOMPILE FOR CPYJSISTMT*
016400140624      * JEYARAJAN  * 2014/06/24   * RFS132121 - INTRODUCE A NEW FIELD  *
016500140624      *            *              * TO HANDLE THE ERROR ON SEC 16      *
016600130905      ******************************************************************
016700140814      * Suresh G.  * 2012/09/12   * RFS133489-Recompile for CPYJSISTMT.
016800141007      * JEYARAJAN  * 2014/10/07   * RFS141165 - Jobconfirm MSW
016900150216      * POOJA K    * 2015/02/16  * RFS 143392 - RECOMPILE FOR CPYJSISTMT
017000150330      * POOJA K    * 2015/03/27  * RFS 144030 - RECOMPILE FOR CPYJSISTMT
017100150424      * POOJA K    * 2015/04/21  * RFS 142884 - RECOMPILE FOR CPYJSISTMT
017200150511      * POOJA K    * 2015/05/08  * RFS 144587 - RECOMPILE FOR CPYJSISTMT
017300190619      * MAYILSAMY D* 2019/06/18   * RFS183449 - Populate account type  *
017400190619      *            *              * code based upon investor language  *
017500190905      *            *              * in statement extract               *
017501190924      * Arthy K    * 2019/09/03   * RFS1018431 - Rollback changes done *
017502190924      *            *              * in RFS: 183449                     *
017503190924      * Arthy K    * 2019/09/24   * RFS184715 - Put back changes in RFS*
017504190924      *            *              * 183449 with additional logic of    *
017505190924      *            *              * new edit code 'STMATL'             *
017506211019      * Surendran C* 2021/10/19   * RFS186592 -RECOMPILE FOR CPYJSISTMT*
017600140814      ******************************************************************
017700021001      /
017800021001       ENVIRONMENT DIVISION.
017900021001
018000021001      ******************************************************************
018100021001      *                                                                *
018200021001      *    E N V I R O N M E N T   D I V I S I O N                     *
018300021001      *                                                                *
018400021001      ******************************************************************
018500021001
018600021001       CONFIGURATION SECTION.
018700190722
018800021001      ******************************************************************
018900021001      *                                                                *
019000021001      *    C O N F I G U R A T I O N   S E C T I O N                   *
019100021001      *                                                                *
019200021001      ******************************************************************
019300021001
019400021001       SOURCE-COMPUTER.    AS-400.
019500021001       OBJECT-COMPUTER.    AS-400.
019600021001
019700021001       SPECIAL-NAMES.
019800021001
019900021001      *****
020000021001      *****    Special Names.
020100021001      *****
020200021001
020300021001           LOCAL-DATA          IS  WS-LOCAL.
020400021001      /
020500021001       INPUT-OUTPUT SECTION.
020600021001
020700021001      ******************************************************************
020800021001      *                                                                *
020900021001      *    I N P U T   /   O U T P U T   S E C T I O N                 *
021000021001      *                                                                *
021100021001      ******************************************************************
021200021001
021300021001       FILE-CONTROL.
021400021001
021500021001      *****
021600021001      *****    FILE CONTROL.
021700021001      *****
021800021001      /
021900021001           SELECT DEALER-MAILING-INSTR
022000021001               ASSIGN          TO  DATABASE-MFADEAMIP
022100021001               ORGANIZATION    IS  INDEXED
022200021001               ACCESS          IS  DYNAMIC
022300021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
022400021001               FILE STATUS     IS  WS-FILSTAT.
022500021001
022600021001           SELECT DEALER-FILE
022700021001               ASSIGN          TO  DATABASE-MFADEAP
022800021001               ORGANIZATION    IS  INDEXED
022900021001               ACCESS          IS  RANDOM
023000021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
023100021001               FILE STATUS     IS  WS-FILSTAT.
023200021001
023300021001           SELECT DEALER-REP-FILE
023400021001               ASSIGN          TO  DATABASE-MFADEAREP
023500021001               ORGANIZATION    IS  INDEXED
023600021001               ACCESS          IS  RANDOM
023700021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
023800021001               FILE STATUS     IS  WS-FILSTAT.
023900021001
024000021001           SELECT DEALER-REP-MAILING-INSTR
024100021001               ASSIGN          TO  DATABASE-MFADERMIP
024200021001               ORGANIZATION    IS  INDEXED
024300021001               ACCESS          IS  DYNAMIC
024400021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
024500021001               FILE STATUS     IS  WS-FILSTAT.
024600021001
024700021001           SELECT  INVESTOR-JOIN
024800021001                   ASSIGN          TO  DATABASE-MFAACOJLA
024900021001                   ORGANIZATION    IS  INDEXED
025000021001                   ACCESS          IS  DYNAMIC
025100021001                   RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
025200021001                                 WITH  DUPLICATES.
025300021001
025400021001           SELECT DEALER-REP-ADDRESS
025500021001               ASSIGN          TO  DATABASE-MFADRADRP
025600021001               ORGANIZATION    IS  INDEXED
025700021001               ACCESS          IS  RANDOM
025800021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
025900021001               FILE STATUS     IS  WS-FILSTAT.
026000021001
026100021001           SELECT INSTITUTION-ADDRESS
026200021001               ASSIGN          TO  DATABASE-MFAINADDP
026300021001               ORGANIZATION    IS  INDEXED
026400021001               ACCESS          IS  RANDOM
026500021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
026600021001               FILE STATUS     IS  WS-FILSTAT.
026700021001
026800021001           SELECT INSTITUTION-BRANCH
026900021001               ASSIGN          TO  DATABASE-MFAINSBRP
027000021001               ORGANIZATION    IS  INDEXED
027100021001               ACCESS          IS  RANDOM
027200021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
027300021001               FILE STATUS     IS  WS-FILSTAT.
027400021001
027500021001           SELECT NOMINEE-ACCOUNT-TYPE-DESCR
027600021001               ASSIGN          TO  DATABASE-MFANMTPYP
027700021001               ORGANIZATION    IS  INDEXED
027800021001               ACCESS          IS  DYNAMIC
027900021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
028000190614      *RFS183449-Starts
028100190614           SELECT  ACCOUNT-FILE-2
028200190614                   ASSIGN          TO  DATABASE-MFAACCNTP
028300190614                   ORGANIZATION    IS  INDEXED
028400190614                   ACCESS          IS  DYNAMIC
028500190614                   RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
028600190614      *RFS183449-Ends
028700021001
028800021001           SELECT ACCOUNT-TYPE-BK
028900021001               ASSIGN          TO  DATABASE-MFAACCTYP
029000021001               ORGANIZATION    IS  INDEXED
029100021001               ACCESS          IS  SEQUENTIAL
029200021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
029300021001
029400021001           SELECT NOMINEE-MAILING-INSTRUCTIONS
029500021001               ASSIGN          TO  DATABASE-MFANOMMIP
029600021001               ORGANIZATION    IS  INDEXED
029700021001               ACCESS          IS  DYNAMIC
029800021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
029900021001               FILE STATUS     IS  WS-FILSTAT.
030000021001
030100021001           SELECT STMT-MSG-FILE
030200021001               ASSIGN          TO  DATABASE-MFASTMMSP
030300021001               ORGANIZATION    IS  INDEXED
030400021001               ACCESS          IS  DYNAMIC
030500021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
030600021001               FILE STATUS     IS  WS-FILSTAT.
030700021001
030800021001           SELECT STMT-PRT-DTL-FILE
030900021001               ASSIGN          TO  DATABASE-MFASTMPDP
031000021001               ORGANIZATION    IS  INDEXED
031100021001               ACCESS          IS  DYNAMIC
031200021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
031300021001               FILE STATUS     IS  WS-FILSTAT.
031400021001
031500021001           SELECT STMT-PRT-HDR-FILE
031600021001               ASSIGN          TO  DATABASE-MFASTMPHP
031700021001               ORGANIZATION    IS  INDEXED
031800021001               ACCESS          IS  DYNAMIC
031900021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
032000021001               FILE STATUS     IS  WS-FILSTAT.
032100021001
032200021001           SELECT STMT-DTA-FILE
032300021001               ASSIGN          TO  DATABASE-MFASTMEXP
032400021001               ORGANIZATION    IS  INDEXED
032500021001               ACCESS          IS  SEQUENTIAL
032600021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
032700021001               FILE STATUS     IS  WS-FILSTAT.
032800021001
032900021001           SELECT CURRENCY-FILE
033000021001               ASSIGN          TO  DATABASE-MFACURP
033100021001               ORGANIZATION    IS  INDEXED
033200021001               ACCESS          IS  SEQUENTIAL
033300021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
033400021001               FILE STATUS     IS  WS-FILSTAT.
033500021001
033600021001           SELECT INVESTMENT-FILE
033700021001               ASSIGN          TO  DATABASE-MFAINVP
033800021001               ORGANIZATION    IS  INDEXED
033900021001               ACCESS          IS  SEQUENTIAL
034000021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY
034100021001               FILE STATUS     IS  WS-FILSTAT.
034200021001
034300021002           SELECT  INVESTMENT-NAME
034400021002                   ASSIGN TO DATABASE-MFAINVNMP
034500021002                   ORGANIZATION IS INDEXED
034600021002                   ACCESS IS DYNAMIC
034700021002                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
034800021002
034900021002           SELECT PRODUCT-TYPE-CODES
035000021001               ASSIGN          TO  DATABASE-MFAPRTCDP
035100021001               ORGANIZATION    IS  INDEXED
035200021001               ACCESS          IS  DYNAMIC
035300021001               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
035400021001
035500021001           SELECT PRINT-FILE
035600021001               ASSIGN          TO  PRINTER-QPRINT.
035700021001      /
035800021001       DATA DIVISION.
035900021001
036000021001      ******************************************************************
036100021001      *                                                                *
036200021001      *    D A T A   D I V I S I O N                                   *
036300021001      *                                                                *
036400021001      ******************************************************************
036500021001
036600021001       FILE SECTION.
036700021001
036800021001      ******************************************************************
036900021001      *                                                                *
037000021001      *    F I L E   S E C T I O N                                     *
037100021001      *                                                                *
037200021001      ******************************************************************
037300021001      /
037400021001      ******************************************************************
037500021001      *                                                                *
037600021001      *    MFADEAMIP:  Dealer Mailing Instruction                      *
037700021001      *                                                                *
037800021001      ******************************************************************
037900021001
038000021001       FD  DEALER-MAILING-INSTR
038100021001           LABEL RECORDS      ARE  OMITTED.
038200021001
038300021001       01  DEALER-MAILING-INSTR-RECD.  COPY DD-ALL-FORMATS
038400021001                                           OF  MFADEAMIP.
038500021001      /
038600021001      ******************************************************************
038700021001      *                                                                *
038800021001      *    MFADEAP:    Dealer                                          *
038900021001      *                                                                *
039000021001      ******************************************************************
039100021001
039200021001       FD  DEALER-FILE
039300021001           LABEL RECORDS      ARE  OMITTED.
039400021001
039500021001       01  DEALER-RECD.                COPY DD-ALL-FORMATS
039600021001                                           OF  MFADEAP.
039700021001      /
039800021001      ******************************************************************
039900021001      *                                                                *
040000021001      *    MFADEAREP:  Dealer Representative                           *
040100021001      *                                                                *
040200021001      ******************************************************************
040300021001
040400021001       FD  DEALER-REP-FILE
040500021001           LABEL RECORDS      ARE  OMITTED.
040600021001
040700021001       01  DEALER-REP-RECD.            COPY DD-ALL-FORMATS
040800021001                                           OF  MFADEAREP.
040900021001      /
041000021001      ******************************************************************
041100021001      *                                                                *
041200021001      *    MFADERMIP:  Dealer Representative Mailing Instruction       *
041300021001      *                                                                *
041400021001      ******************************************************************
041500021001
041600021001       FD  DEALER-REP-MAILING-INSTR
041700021001           LABEL RECORDS      ARE  OMITTED.
041800021001
041900021001       01  DLRREP-MAILING-INSTR-RECD.  COPY DD-ALL-FORMATS
042000021001                                           OF  MFADERMIP.
042100021001      /
042200021001      ******************************************************************
042300021001      *                                                                *
042400021001      *    MFADRADRP:  Dealer Representative Address                   *
042500021001      *                                                                *
042600021001      ******************************************************************
042700021001
042800021001       FD  DEALER-REP-ADDRESS
042900021001           LABEL RECORDS      ARE  OMITTED.
043000021001
043100021001       01  DEALER-REP-ADDRESS-RECD.    COPY DD-ALL-FORMATS
043200021001                                           OF  MFADRADRP.
043300021001      /
043400021001      ******************************************************************
043500021001      *                                                                *
043600021001      *    MFAINADDP:  Institution Address                             *
043700021001      *                                                                *
043800021001      ******************************************************************
043900021001
044000021001       FD  INSTITUTION-ADDRESS
044100021001           LABEL RECORDS      ARE  OMITTED.
044200021001
044300021001       01  INSTITUTION-ADDRESS-RECD.   COPY DD-ALL-FORMATS
044400021001                                           OF  MFAINADDP.
044500021001      /
044600021001      ******************************************************************
044700021001      *                                                                *
044800021001      *    MFAINSBRP:  Institution Branch                              *
044900021001      *                                                                *
045000021001      ******************************************************************
045100021001
045200021001       FD  INSTITUTION-BRANCH
045300021001           LABEL RECORDS      ARE  OMITTED.
045400021001
045500021001       01  INSTITUTION-BRANCH-RECD.    COPY DD-ALL-FORMATS
045600021001                                           OF  MFAINSBRP.
045700021001      /
045800021001      ****************************************************************
045900021001      *                                                              *
046000021001      *  MFAACOJLA:    Investor Join                                 *
046100021001      *                                                              *
046200021001      ****************************************************************
046300021001
046400021001       FD  INVESTOR-JOIN
046500021001           LABEL RECORDS      ARE  STANDARD.
046600021001
046700021001       01  INVESTOR-J-REC.             COPY DD-ALL-FORMATS
046800021001                                            OF MFAACOJLA.
046900021001      /
047000021001      *****************************************************************
047100021001      *                                                               *
047200021001      *    MFANMTPYP:  Nominee Account Type Descr                     *
047300021001      *                                                               *
047400021001      *****************************************************************
047500021001
047600021001       FD  NOMINEE-ACCOUNT-TYPE-DESCR
047700021001           LABEL RECORDS ARE STANDARD.
047800021001
047900021001       01  NOMINEE-ACCOUNT-TYPE-DESCR-REC.
048000021001                               COPY DD-ALL-FORMATS OF MFANMTPYP.
048100190614
048200190614      *RFS183449-Starts
048300190614       FD  ACCOUNT-FILE-2
048400190614           LABEL RECORDS      ARE  STANDARD.
048500190614
048600190619       01  ACCOUNT-REC-2.
048700190619       COPY DD-ALL-FORMATS OF MFAACCNTP.
048800190619
048900190614      *RFS183449-Ends
049000021001
049100021001      ******************************************************************
049200021001      *                                                                *
049300021001      *    MFAACTYLP:  Account Type File                               *
049400021001      *                                                                *
049500021001      ******************************************************************
049600021001      /
049700021001       FD  ACCOUNT-TYPE-BK
049800021001           LABEL RECORDS      ARE  STANDARD.
049900021001
050000021001       01  ACCOUNT-TYPE-BK-REC.        COPY DD-ALL-FORMATS
050100021001                                            OF MFAACCTYP.
050200021001      ******************************************************************
050300021001      *                                                                *
050400021001      *    MFANOMMIP:  Nominee Mailing Instruction                     *
050500021001      *                                                                *
050600021001      ******************************************************************
050700021001
050800021001       FD  NOMINEE-MAILING-INSTRUCTIONS
050900021001           LABEL RECORDS      ARE  OMITTED.
051000021001
051100021001       01  NOMINEE-MAILING-INST-RECD.  COPY DD-ALL-FORMATS
051200021001                                           OF  MFANOMMIP.
051300021001      /
051400021001      ******************************************************************
051500021001      *                                                                *
051600021001      *    MFASTMMSP:  Statement Message                               *
051700021001      *                                                                *
051800021001      ******************************************************************
051900021001
052000021001       FD  STMT-MSG-FILE
052100021001           LABEL RECORDS      ARE  OMITTED.
052200021001
052300021001       01  STMT-MSG-RECD.              COPY DD-ALL-FORMATS
052400021001                                           OF  MFASTMMSP.
052500021001      /
052600021001      ******************************************************************
052700021001      *                                                                *
052800021001      *    MFASTMPDP:  Statement Print Detail                          *
052900021001      *                                                                *
053000021001      ******************************************************************
053100021001
053200021001       FD  STMT-PRT-DTL-FILE
053300021001           LABEL RECORDS      ARE  OMITTED.
053400021001
053500021001       01  STMT-PRT-DTL-RECD.          COPY DD-ALL-FORMATS
053600021001                                           OF  MFASTMPDP.
053700021001      /
053800021001      ******************************************************************
053900021001      *                                                                *
054000021001      *    MFASTMPHP:  Statement Print Header                          *
054100021001      *                                                                *
054200021001      ******************************************************************
054300021001
054400021001       FD  STMT-PRT-HDR-FILE
054500021001           LABEL RECORDS      ARE  OMITTED.
054600021001
054700021001       01  STMT-PRT-HDR-RECD.          COPY DD-ALL-FORMATS
054800021001                                           OF  MFASTMPHP.
054900021001      /
055000021001      ******************************************************************
055100021001      *                                                                *
055200021001      *    MFASTMEXP:  Statement Extract Data                          *
055300021001      *                                                                *
055400021001      ******************************************************************
055500021001
055600021001       FD  STMT-DTA-FILE
055700021001           LABEL RECORDS      ARE  OMITTED.
055800021001
055900021001       01  STMT-DTA-RECD.              COPY DD-ALL-FORMATS
056000021001                                       OF MFASTMEXP.
056100021001      /
056200021001      ******************************************************************
056300021001      *                                                                *
056400021001      *    MFACURP:    Currency                                        *
056500021001      *                                                                *
056600021001      ******************************************************************
056700021001
056800021001       FD  CURRENCY-FILE
056900021001           LABEL RECORDS      ARE  OMITTED.
057000021001
057100021001       01  CURRENCY-RECD.              COPY DD-ALL-FORMATS
057200021001                                       OF MFACURP.
057300021001      /
057400021001      ******************************************************************
057500021001      *                                                                *
057600021001      *    MFAINVP:    Investment                                      *
057700021001      *                                                                *
057800021001      ******************************************************************
057900021001
058000021001       FD  INVESTMENT-FILE
058100021001           LABEL RECORDS      ARE  OMITTED.
058200021001
058300021001       01  INVESTMENT-REC.             COPY DD-ALL-FORMATS
058400021001                                       OF MFAINVP.
058500021002      /
058600021002       FD  INVESTMENT-NAME
058700021002           LABEL RECORDS ARE STANDARD.
058800021002       01  INVESTMENT-NAME-REC.   COPY DD-ALL-FORMATS OF MFAINVNMP.
058900021001      /
059000021002       FD  PRODUCT-TYPE-CODES
059100021001           LABEL RECORDS      ARE  STANDARD.
059200021001
059300021001       01  PRODUCT-TYPE-CODES-REC.     COPY DD-ALL-FORMATS
059400021001                                            OF MFAPRTCDP.
059500021001      /
059600021001      ******************************************************************
059700021001      *                                                                *
059800021001      *    QPRINT:     Control Report                                  *
059900021001      *                                                                *
060000021001      ******************************************************************
060100021001
060200021001       FD  PRINT-FILE
060300021001           LABEL RECORDS      ARE  OMITTED.
060400021001
060500021001       01  PRINT-RECD                  PICTURE X(150).
060600021001      /
060700021001       WORKING-STORAGE SECTION.
060800021001
060900021001      ******************************************************************
061000021001      *                                                                *
061100021001      *    W O R K I N G   S T O R A G E   S E C T I O N               *
061200021001      *                                                                *
061300021001      ******************************************************************
061400021001      /
061500021001       01  WS-LOCAL-DATA-AREA.         COPY CPYLDASTMT.
061600021001      /
061700021001       01  WS-DEAMLGINS-REC.           COPY DD-ALL-FORMATS
061800021001                                           OF  MFADEAMIP.
061900021001      /
062000021001       01  WS-DERMLGINS-REC.           COPY DD-ALL-FORMATS
062100021001                                           OF  MFADERMIP.
062200021001      /
062300021001       01  WS-NOMMLGINS-REC.           COPY DD-ALL-FORMATS
062400021001                                           OF  MFANOMMIP.
062500021001      /
062600021001                                       COPY CPYJSISTMT.
062700021001      /
062800021001      ******************************************************************
062900021001      *                                                                *
063000021001      *    I N V E S T O R   I N F O R M A T I O N   T A B L E         *
063100021001      *                                                                *
063200021001      ******************************************************************
063300021001       01  WS-INVESTOR-INFO-TBL.
063400030528R17165     03  WS-INVESTOR-INFO   PIC X(1350)    OCCURS 50 TIMES
063500021001                                                 INDEXED BY II.
063600021002      /
063700021001      ******************************************************************
063800021001      *                                                                *
063900021001      *    D E A L E R       I N F O R M A T I O N   T A B L E         *
064000021001      *                                                                *
064100021001      ******************************************************************
064200021001       01  WS-DEALER-INFO-TBL.
064300030528R17165     03  WS-DEALER-INFO     PIC X(1350)    OCCURS 50 TIMES
064400021001                                                 INDEXED BY DI.
064500021001
064600021002      *****************************************************************
064700021001      *
064800021001      *    G   I   C        I N F O R M A T I O N   T A B L E
064900021001      *
065000021001      *****************************************************************
065100021001       01  WS-GIC-INFO-TBL.
065200030528R17165     03  WS-GIC-INFO     PIC X(1350)       OCCURS 100 TIMES
065300021001                                                 INDEXED BY GIC.
065400021001
065500021001      *****************************************************************
065600021001      * A C C O U N T   F U N D   D E T A I L S   T A B L E
065700021001      *****************************************************************
065800021001       01  WS-ACCOUNT-FUND-TABLE.
065900030528R17165     03  WS-ACCOUNT-FUND-DETAILS  PIC X(1350) OCCURS 100 TIMES
066000021001                                                    INDEXED BY AFD.
066100021001
066200021001      *****************************************************************
066300021001      * A C C O U N T   G I C     D E T A I L S   T A B L E
066400021001      *****************************************************************
066500021001       01  WS-ACCOUNT-GIC-TABLE.
066600030528R17165     03  WS-ACCOUNT-GIC-DETAILS  PIC X(1350) OCCURS 100 TIMES
066700021001                                                    INDEXED BY AGD.
066800021001
066900021001      *****************************************************************
067000021001      * A C C O U N T   D I I     D E T A I L S   T A B L E
067100021001      *****************************************************************
067200021001       01  WS-ACCOUNT-DII-TABLE.
067300030528R17165     03  WS-ACCOUNT-DII-DETAILS  PIC X(1350) OCCURS 100 TIMES
067400021002                                                    INDEXED BY ADID.
067500021001
067600030528R17165 01  WS-ACCOUNT-FUND-DETAILS-TEMP  PIC X(1350).
067700021001
067800021001      ******************************************************************
067900021001      *                                                                *
068000021001      *    S T A T E M E N T   S A V E   P A G E                       *
068100021001      *                                                                *
068200021001      ******************************************************************
068300021001
068400021001       01  WS-STATEMENT-PAGE.
068500021001           03  WS-STMTPGE-LNE          OCCURS  88  TIMES
068600021001                                       INDEXED BY  SPL
068700021001                                       PICTURE X(150).
068800021001
068900021001      *****
069000021001      *****    Standard Version
069100021001      *****
069200021001
069300021001       01  WS-STATEMENT-PAGE-R         REDEFINES WS-STATEMENT-PAGE.
069400021001           03  FILLER                  PICTURE X(5400).
069500021001           03  WS-STMTPGE-DTL          PICTURE X(6600).
069600021001           03  WS-STMTPGE-MSG          PICTURE X(1050).
069700021001           03  FILLER                  PICTURE X(150).
069800021001
069900021001      /
070000021001      ******************************************************************
070100021001      *                                                                *
070200021001      *    S T A T E M E N T   M E S S A G E   S A V E   A R E A       *
070300021001      *                                                                *
070400021001      ******************************************************************
070500021001
070600021001       01  WS-STATEMENT-PAGE-MESSAGE.
070700021001           03  WS-STMTPGE-MSGLNE       OCCURS  7 TIMES
070800021001                                       INDEXED BY  SPML
070900021001                                       PICTURE X(150).
071000021001      /
071100021001      ******************************************************************
071200021001      *                                                                *
071300021001      *    S T A T E M E N T   H E A D I N G   P R I N T   L I N E S   *
071400021001      *                                                                *
071500021001      ******************************************************************
071600021001
071700021001      *****
071800021001      *****    The statement heading lines will be re-defined
071900021001      *****
072000021001      /
072100021001       01  STMT-HDG-01.
072200021001           03  FILLER                  PICTURE X(78).
072300021001           03  SH01-LIT1               PICTURE X(20).
072400021001           03  FILLER                  PICTURE X(1).
072500021001           03  SH01-START-DATE         PICTURE XXXX/XX/XX.
072600021001           03  FILLER                  PICTURE X(1).
072700021001           03  SH01-LIT2               PICTURE X(2).
072800021001           03  FILLER                  PICTURE X(1).
072900021001           03  SH01-END-DATE           PICTURE XXXX/XX/XX.
073000021001           03  FILLER                  PICTURE X(27).
073100021001
073200021001       01  STMT-HDG-01-V5-R            REDEFINES STMT-HDG-01.
073300021002           03  FILLER                  PICTURE X(90).
073400021001           03  FILLER                  PICTURE X(2).
073500021002           03  SH01V5-START-DATE-DD    PICTURE X(2).
073600021002           03  SH01V5-LIT1             PICTURE X(1).
073700021002           03  SH01V5-START-DATE-MM    PICTURE X(2).
073800021002           03  SH01V5-LIT2             PICTURE X(1).
073900021002           03  SH01V5-START-DATE-YY    PICTURE X(4).
074000021001           03  FILLER                  PICTURE X(1).
074100021002           03  SH01V5-LIT3             PICTURE X(1).
074200021001           03  FILLER                  PICTURE X(1).
074300021002           03  SH01V5-END-DATE-DD      PICTURE X(2).
074400021002           03  SH01V5-LIT4             PICTURE X(1).
074500021002           03  SH01V5-END-DATE-MM      PICTURE X(2).
074600021002           03  SH01V5-LIT5             PICTURE X(1).
074700021002           03  SH01V5-END-DATE-YY      PICTURE X(4).
074800021002           03  FILLER                  PICTURE X(35).
074900021001
075000021001       01  STMT-HDG-ACCNT-NO.
075100021002           03  FILLER                  PICTURE X(23).
075200021004           03  SHACCNT-ACCNO           PICTURE ZZZZZZZZ9.
075300021001           03  FILLER                  PICTURE X(98).
075400021001      /
075500021001       01  STMT-HDG-02.
075600021001           03  FILLER                  PICTURE X(8).
075700021001           03  SH02-INVESTOR-NAME      PICTURE X(45).
075800021001           03  FILLER                  PICTURE X(15).
075900021001           03  SH02-LIT                PICTURE X(15).
076000021001           03  FILLER                  PICTURE X(27).
076100021001           03  SH02-PGE-LIT1           PICTURE X(4).
076200021001           03  FILLER                  PICTURE X(3).
076300021001           03  SH02-PGENO              PICTURE ZZ9.
076400021001           03  FILLER                  PICTURE X(30).
076500021001
076600021001       01  STMT-HDG-02-V5-R            REDEFINES STMT-HDG-02.
076700021002           03  FILLER                  PICTURE X(2).
076800021001           03  SH02V5-INVESTOR-NAME    PICTURE X(45).
076900021001           03  FILLER                  PICTURE X(99).
077000021001      /
077100021001       01  STMT-HDG-EXTRA.
077200021001           03  FILLER                  PICTURE X(8).
077300021001           03  SHEX-INVESTOR-ADDRESS1  PICTURE X(40).
077400021001           03  FILLER                  PICTURE X(102).
077500021001
077600021002       01  STMT-HDG-EXTRA-V5-R         REDEFINES STMT-HDG-EXTRA.
077700021002           03  FILLER                  PICTURE X(2).
077800021001           03  SHEXV5-INVESTOR-ADDRESS1  PICTURE X(40).
077900021001           03  FILLER                  PICTURE X(60).
078000021001           03  SHEXV5-PGE-LIT1         PICTURE X(4).
078100021001           03  FILLER                  PICTURE X(1).
078200021001           03  SHEXV5-PGENO            PICTURE X(3).
078300021001           03  FILLER                  PICTURE X(36).
078400021001      /
078500021001       01  STMT-HDG-03.
078600021001           03  FILLER                  PICTURE X(8).
078700021001           03  SH03-INVESTOR-ADDRESS2  PICTURE X(40).
078800021001           03  FILLER                  PICTURE X(30).
078900021001           03  SH03-LIT1               PICTURE X(17).
079000021001           03  FILLER                  PICTURE X(1).
079100021001           03  SH03-DEALER             PICTURE X(4).
079200021001           03  FILLER                  PICTURE X(2).
079300021001           03  SH03-DEALER-NAMES       PICTURE X(35).
079400021001           03  FILLER                  PICTURE X(13).
079500021001
079600021001       01  STMT-HDG-03-V5-R            REDEFINES STMT-HDG-03.
079700021002           03  FILLER                    PICTURE X(2).
079800021001           03  SH03V5-INVESTOR-ADDRESS2  PICTURE X(40).
079900021001           03  FILLER                    PICTURE X(104).
080000021001      /
080100021001       01  STMT-HDG-04.
080200021001           03  FILLER                  PICTURE X(8).
080300021001           03  SH04-INVESTOR-ADDRESS3  PICTURE X(40).
080400021001           03  FILLER                  PICTURE X(30).
080500021001           03  SH04-LIT1               PICTURE X(17).
080600021001           03  FILLER                  PICTURE X(1).
080700021001           03  SH04-REPNO              PICTURE X(6).
080800021001           03  FILLER                  PICTURE X(1).
080900021001           03  SH04-REP-NAME           PICTURE X(40).
081000021001           03  FILLER                  PICTURE X(7).
081100021001
081200021001       01  STMT-HDG-04-V5-R            REDEFINES STMT-HDG-04.
081300021002           03  FILLER                    PICTURE X(2).
081400021001           03  SH04V5-INVESTOR-ADDRESS3  PICTURE X(40).
081500021001           03  FILLER                    PICTURE X(84).
081600021001      /
081700021001       01  STMT-HDG-05.
081800021001           03  FILLER                  PICTURE X(8).
081900021001           03  SH05-INVESTOR-ADDRESS4  PICTURE X(40).
082000021001           03  FILLER                  PICTURE X(30).
082100021001           03  SH05-LIT1               PICTURE X(17).
082200021001           03  FILLER                  PICTURE X(1).
082300021001           03  SH05-BRANCH-ADDR1       PICTURE X(40).
082400021001           03  FILLER                  PICTURE X(14).
082500021001
082600021001       01  STMT-HDG-05-V5-R            REDEFINES STMT-HDG-05.
082700021002           03  FILLER                    PICTURE X(2).
082800021001           03  SH05V5-INVESTOR-ADDRESS4  PICTURE X(40).
082900021001           03  FILLER                    PICTURE X(84).
083000021001      /
083100021001       01  STMT-HDG-06.
083200021001           03  FILLER                  PICTURE X(8).
083300021001           03  SH06-INVESTOR-ADDRESS5  PICTURE X(40).
083400021001           03  FILLER                  PICTURE X(48).
083500021001           03  SH06-BRANCH-ADDR2       PICTURE X(40).
083600021001           03  FILLER                  PICTURE X(14).
083700021001
083800021001       01  STMT-HDG-06-V5-R            REDEFINES STMT-HDG-06.
083900021002           03  FILLER                    PICTURE X(2).
084000021001           03  SH06V5-INVESTOR-ADDRESS5  PICTURE X(40).
084100021001           03  FILLER                    PICTURE X(84).
084200021001      /
084300021001       01  STMT-HDG-07.
084400021001           03  FILLER                  PICTURE X(8).
084500021001           03  SH07-POSTAL-CODE        PICTURE X(10).
084600021001           03  FILLER                  PICTURE X(78).
084700021001           03  SH07-BRANCH-ADDR3       PICTURE X(40).
084800021001           03  FILLER                  PICTURE X(14).
084900021001
085000021001       01  STMT-HDG-07-V5-R            REDEFINES STMT-HDG-07.
085100021002           03  FILLER                    PICTURE X(2).
085200021001           03  SH07V5-POSTAL-CODE        PICTURE X(10).
085300021003           03  FILLER                    PICTURE X(138).
085400021003      /
085500021003       01  STMT-HDG-08.
085600021003           03  FILLER                  PICTURE X(95).
085700021003           03  SH08-PGE-LIT            PICTURE X(11).
085800021003           03  FILLER                  PICTURE X(1).
085900021003           03  SH08-PGENO              PICTURE ZZ9.
086000021003           03  FILLER                  PICTURE X(40).
086100021003
086200021003       01  STMT-HDG-08-V5-R            REDEFINES STMT-HDG-08.
086300021003           03  FILLER                  PICTURE X(95).
086400021003           03  SH08V5-PGE-LIT          PICTURE X(11).
086500021003           03  FILLER                  PICTURE X(1).
086600021003           03  SH08V5-PGENO            PICTURE ZZ9.
086700021003           03  FILLER                  PICTURE X(40).
086800021001      /
086900021001      ******************************************************************
087000021001      *                                                                *
087100021001      *    S T A T E M E N T   D E T A I L   P R I N T   L I N E S     *
087200021001      *                                                                *
087300021001      ******************************************************************
087400021001
087500021001      *****
087600021001      *****    The statement detail lines will be re-defined
087700021001      *****
087800021001
087900021001       01  STMT-DTL-01.
088000021001           03  FILLER                  PICTURE X(12).
088100021001           03  SD01-INVESTMENT-NAME    PICTURE X(35).
088200021001           03  FILLER                  PICTURE X(2).
088300021001           03  SD01-CURRENCY           PICTURE X(3).
088400021001           03  FILLER                  PICTURE X(98).
088500021001      /
088600021001       01  STMT-DTL-02.
088700021001           03  SD02-LIT1.
088800021001               05  SD02-TRADE-DATE     PICTURE XXXX/XX/XX.
088900021001           03  FILLER                  PICTURE X(2).
089000021001           03  SD02-TRANS-TYPE         PICTURE X(25).
089100021001           03  SD02-GROSS              PICTURE $$$,$$$,$$$,$$9.99.
089200021001           03  SD02-GROSS-SIGN         PICTURE X(1).
089300021001           03  SD02-DEDUCTIONS         PICTURE $$$,$$$,$$$.99
089400021001                                       BLANK WHEN ZERO.
089500021001           03  SD02-DEDUCTIONS-SIGN    PICTURE X(1).
089600021001           03  FILLER                  PICTURE X(2).
089700021001           03  SD02-NET                PICTURE $$$$,$$$,$$9.99.
089800021001           03  SD02-NET-SIGN           PICTURE X(1).
089900021001           03  FILLER                  PICTURE X(3).
090000021001           03  SD02-UNIT-PRICE         PICTURE ZZ,ZZZ.9999.
090100021001           03  SD02-UNIT-PRICE-SIGN    PICTURE X(1).
090200021001           03  FILLER                  PICTURE X(2).
090300021001           03  SD02-NO-OF-UNITS        PICTURE ZZZ,ZZZ,ZZ9.999.
090400021001           03  SD02-NO-OF-UNITS-SIGN   PICTURE X(1).
090500021001           03  FILLER                  PICTURE X(28).
090600021001
090700021001       01  STMT-DTL-02-V5-R          REDEFINES STMT-DTL-02.
090800021001           03  FILLER                  PICTURE X(2).
090900021002           03  SD02V5-INVESTMENT-NAME  PICTURE X(15).
091000021002           03  FILLER                  PICTURE X(14).
091100021002           03  SD02V5-TRADE-DATE-DD    PICTURE X(2).
091200021002           03  SD02V5-LIT1             PICTURE X(1).
091300021002           03  SD02V5-TRADE-DATE-MM    PICTURE X(2).
091400021002           03  SD02V5-LIT2             PICTURE X(1).
091500021002           03  SD02V5-TRADE-DATE-YY    PICTURE X(4).
091600021002           03  FILLER                  PICTURE X(5).
091700021002           03  SD02V5-SETTL-DATE-DD    PICTURE X(2).
091800021002           03  SD02V5-LIT3             PICTURE X(1).
091900021002           03  SD02V5-SETTL-DATE-MM    PICTURE X(2).
092000021002           03  SD02V5-LIT4             PICTURE X(1).
092100021002           03  SD02V5-SETTL-DATE-YY    PICTURE X(4).
092200021002           03  FILLER                  PICTURE X(3).
092300021101R14849     03  FILLER                  PICTURE X(2).
092400021101      *    03  SD02V5-TRANS-TYPE       PICTURE X(12).
092500021101R14849     03  SD02V5-TRANS-TYPE       PICTURE X(10).
092600021002           03  SD02V5-GROSS            PICTURE Z,ZZZ,ZZZ,ZZZ.99.
092700021001           03  SD02V5-GROSS-SIGN       PICTURE X(1).
092800021002           03  FILLER                  PICTURE X(2).
092900021001           03  SD02V5-UNIT-PRICE       PICTURE ZZ,ZZZ.9999.
093000021001           03  SD02V5-UNIT-PRICE-SIGN  PICTURE X(1).
093100021002           03  SD02V5-NO-OF-UNITS      PICTURE ZZ,ZZZ,ZZZ,ZZ9.
093200021001           03  SD02V5-NO-OF-UNITS-SIGN PICTURE X(1).
093300021002           03  SD02V5-UNIT-BALANCE     PICTURE ZZ,ZZZ,ZZZ,ZZ9.
093400021001           03  SD02V5-UNIT-BALANCE-SIGN   PICTURE X(1).
093500021001           03  FILLER                  PICTURE X(10).
093600021003      /
093700021003       01  STMT-DTL-03.
093800021003           03  FILLER                  PICTURE X(2).
093900021003           03  SD03-CONTINUE-ON1       PICTURE X(32).
094000021003           03  SD03-CONTINUE-ON2       PICTURE X(32).
094100021003           03  FILLER                  PICTURE X(84).
094200021003
094300021003       01  STMT-DTL-03-V5-R          REDEFINES STMT-DTL-03.
094400021003           03  FILLER                  PICTURE X(2).
094500021003           03  SD03V5-CONTINUE-ON1     PICTURE X(32).
094600021003           03  SD03V5-CONTINUE-ON2     PICTURE X(32).
094700021003           03  FILLER                  PICTURE X(84).
094800021003      /
094900021003       01  STMT-DTL-04.
095000021003           03  FILLER                  PICTURE X(2).
095100021003           03  SD04-CONTINUE-FROM1     PICTURE X(32).
095200021003           03  SD04-CONTINUE-FROM1     PICTURE X(32).
095300021003           03  FILLER                  PICTURE X(84).
095400021003
095500021003       01  STMT-DTL-04-V5-R          REDEFINES STMT-DTL-04.
095600021003           03  FILLER                  PICTURE X(2).
095700021003           03  SD04V5-CONTINUE-FROM1   PICTURE X(32).
095800021003           03  SD04V5-CONTINUE-FROM2   PICTURE X(32).
095900021003           03  FILLER                  PICTURE X(84).
096000021003      ******************************************************************
096100021003      *                                                                *
096200021003      *    S T A T E M E N T   H E A D I N G   L I T E R A L S         *
096300021003      *                                                                *
096400021003      ******************************************************************
096500021003
096600021003       01  WS-TOP-LITS.
096700021003
096800021003      ****
096900021003      ****      E N G L I S H
097000021003      ****
097100021003           05  WS-PAGE-LIT-E            PIC X(11)  VALUE "Page/Seite:".
097200021003           05  WS-CONTINUE-FROM-LIT1-E  PIC X(32)
097300021003                              VALUE "Continued from previous page / F".
097400021003           05  WS-CONTINUE-FROM-LIT2-E  PIC X(32)
097500021003                              VALUE "ortsetzung der vorherigen Seite ".
097600021003           05  WS-CONTINUE-ON-LIT1-E  PIC X(32)
097700021003                              VALUE "Continued on the next page / For".
097800021003           05  WS-CONTINUE-ON-LIT2-E  PIC X(32)
097900021003                              VALUE "tsetzung auf der naechsten Seite".
098000021003
098100021003      ****    F R E N C H
098200021003      ****
098300021003           05  WS-PAGE-LIT-F            PIC X(11)  VALUE "Page/Seite:".
098400021003
098500021003       01  WS-LITS                      REDEFINES WS-TOP-LITS.
098600021003           05 WS-LL                     OCCURS 2 TIMES
098700021003                                        INDEXED BY SSL.
098800021003            10  WS-PAGE-LIT              PIC X(11).
098900021003
099000021001      /
099100021001      ******************************************************************
099200021001      *                                                                *
099300021001      *    S T A T E M E N T   M E S S A G E   P R I N T   L I N E S   *
099400021001      *                                                                *
099500021001      ******************************************************************
099600021001
099700021001       01  STMT-MSG-01.
099800021001           03  FILLER                  PICTURE X(7).
099900021001           03  SM01-STATEMENT-MESSAGE  PICTURE X(115).
100000021001           03  FILLER                  PICTURE X(28).
100100021001      /
100200021001      ******************************************************************
100300021001      *                                                                *
100400021001      *    S T A T E M E N T   L I T E R A L S   ( C U R R E N C Y )   *
100500021001      *                                                                *
100600021001      ******************************************************************
100700021001
100800021001       01  WS-CURRENCY-TBL.
100900021001           03  WS-SC-CAD.
101000021001               05  FILLER              PICTURE X(3)        VALUE "CAD".
101100021001               05  FILLER              PICTURE X(30)       VALUE
101200021001                   "CANADIAN (CAD) DOLLAR TOTAL   ".
101300021001               05  FILLER              PICTURE X(30)       VALUE
101400021001                   "TOTAL DOLLARS CANADIENS       ".
101500021002               05  FILLER              PICTURE X(22).
101600021001           03  WS-SC-USD.
101700021001               05  FILLER              PICTURE X(3)        VALUE "USD".
101800021001               05  FILLER              PICTURE X(30)       VALUE
101900021001                   "US (USD) DOLLAR TOTAL         ".
102000021001               05  FILLER              PICTURE X(30)       VALUE
102100021001                   "TOTAL DOLLARS AMERICAINS      ".
102200021002               05  FILLER              PICTURE X(22).
102300021001
102400021001       01  WS-CURRENCY-TBL-R           REDEFINES WS-CURRENCY-TBL.
102500021001           03  WS-SC-ENTRY             OCCURS   2  TIMES
102600021001                                       INDEXED BY  SC.
102700021001             04  WS-SC-CURRENCY        PICTURE X(3).
102800021001             04  WS-SC-CURRDESC        OCCURS   2  TIMES
102900021001                                       INDEXED BY  SCL
103000021001                                       PICTURE X(30).
103100021001             04  WS-SC-MARKET-VALUE    PICTURE S9(11)V9(2)  COMP-3.
103200021002             04  WS-SC-MARKET-VALUE-GIC-DII
103300021001                                       PICTURE S9(11)V9(2)  COMP-3.
103400021002             04  WS-SC-MARKET-VALUE-FUND
103500021001                                       PICTURE S9(11)V9(2)  COMP-3.
103600021001             04  WS-SC-RPTIND          PICTURE X(1).
103700021001      /
103800021001       01  WS-STMT-INVESTOR-ACCOUNT-TBL.
103900021001
104000021001      ******************************************************************
104100021001      *                                                                *
104200021001      *    S T A T E M E N T   I N V E S T O R / A C C O U N T   T B L *
104300021001      *                                                                *
104400021001      ******************************************************************
104500021001
104600021001           03  WS-SIA-ENT              OCCURS        1000  TIMES
104700021001                                       ASCENDING KEY   IS  WS-SIA-ACCT
104800021001                                       INDEXED         BY  SIA
104900021001                                                           SIA1
105000021001                                                           SIA2.
105100021001               05  WS-SIA-ACCT         PICTURE X(9).
105200021001               05  WS-SIA-DLRACCTNO    PICTURE X(15).
105300021001               05  WS-SIA-NOMCDE       PICTURE X(5).
105400021001               05  WS-SIA-NOMNAM       PICTURE X(35).
105500021001               05  WS-SIA-NOMACCT      PICTURE X(15).
105600021001               05  WS-SIA-REGCTB       PICTURE 9(9)V9(2)   COMP-3.
105700021001               05  WS-SIA-REGCTBSGN    PICTURE X(1).
105800021001               05  WS-SIA-ENTEREDBY    PICTURE X(10).
105900021002               05  WS-SIA-MAIL-FLAG    PICTURE X(1).
106000021001      /
106100021001       01  WS-STMT-ACCOUNT-FUND-TABLE.
106200021001
106300021001      ******************************************************************
106400021001      *                                                                *
106500021001      *    S T A T E M E N T   A C C O U N T / F U N D   T A B L E     *
106600021001      *                                                                *
106700021001      ******************************************************************
106800021001
106900021001           03  WS-STMT-ACCOUNT-FUND    OCCURS 100  TIMES
107000021001                                       INDEXED BY SAF.
107100021001               05  WS-SAF-ACB-UNIT-PRICE
107200021001                                       PICTURE S9(5)V9(4)  COMP-3.
107300021001               05  WS-SAF-ACB-UNIT-PRICE-SIGN
107400021001                                       PICTURE X(1).
107500021001               05  WS-SAF-CURRENCY     PICTURE X(3).
107600021001               05  WS-SAF-FUND-NO      PICTURE X(8).
107700021001               05  WS-SAF-INVESTMENT-NAME
107800021001                                       PICTURE X(35).
107900021001               05  WS-SAF-LAST-UNIT-PRICE
108000021001                                       PICTURE S9(5)V9(4)  COMP-3.
108100021001               05  WS-SAF-LAST-UNIT-PRICE-SIGN
108200021001                                       PICTURE X(1).
108300021001               05  WS-SAF-MARKET-VALUE PICTURE S9(11)V9(2)  COMP-3.
108400021001               05  WS-SAF-MARKET-VALUE-SIGN
108500021001                                       PICTURE X(1).
108600021001               05  WS-SAF-NO-OF-UNITS  PICTURE S9(10)V9(3) COMP-3.
108700021001               05  WS-SAF-NO-OF-UNITS-SIGN
108800021001                                       PICTURE X(1).
108900021001      /
109000021001      *  US CURRENCY DETAIL TABLE  *
109100021001
109200021001       01  US-TABLE.
109300021001           03  WS-US-DATA          OCCURS 50 TIMES
109400021001                                   INDEXED BY SN.
109500021001
109600021001              05 W-SS07-ACB-UNIT-PRICE         PIC ZZ,ZZZ.9999.
109700021001              05 W-SS07-ACB-UNIT-PRICE-SIGN    PIC X.
109800021001              05 W-SS07-INVESTMENT-NAME        PIC X(35).
109900021001              05 W-SS07-CURRENCY               PIC X(3).
110000021001              05 W-SS07-LAST-UNIT-PRICE        PIC ZZ,ZZZ.9999.
110100021001              05 W-SS07-LAST-UNIT-PRICE-SIGN   PIC X.
110200021001              05 W-SS07-NO-OF-UNITS            PIC ZZZ,ZZZ,ZZZ.999.
110300021001              05 W-SS07-NO-OF-UNITS-SIGN       PIC X.
110400021001              05 W-SS07-MARKET-VALUE           PIC $$$,$$$,$$$,$$$.99.
110500021001              05 W-SS07-MARKET-VALUE-SIGN      PIC X.
110600021001
110700021001      *****
110800021001      *****    Account Type Table contains only two fields.
110900021001      *****
111000021001
111100021001       01  WS-ACCTYP-TBL.
111200021001           04  WS-ACCTYP-ENT         OCCURS  50  TIMES
111300021001                                     INDEXED BY  AT1.
111400021001               05  WS-AT-CODE          PICTURE X(5).
111500021001               05  WS-AT-RULE          PICTURE X(1).
111600021001
111700021001       01  WS-AT-LST               PICTURE S9(3)   COMP-3.
111800021001       01  WS-AT-MAX               PICTURE S9(3)   COMP-3
111900021001                                                           VALUE 50.
112000021001      *****
112100021001      *****    Investment Code Table.
112200021001      *****    - This table will only support two languages, the first
112300021001      *****      entry is English and the second entry is French.
112400021001      *****
112500021002
112600090824R72304 01  ARYSIZ-1                   PIC S9(9).
112700021002       01  WS-INVCDE-TBL.
112800090223      * RFS 64527 START
112900090223      *    04  WS-INVCDE-ENT         OCCURS 1000 TIMES
113000090223      *                              ASCENDING KEY   IS  WS-IC-FUND
113100090223      *                              INDEXED BY  IC
113200090223      *                                          ICG
113300090223      *                                          ICT.
113400090824R72304***  04  ARYSIZ-1                PIC S9(9).
113500090223           04  WS-INVCDE-ENT         OCCURS 1 TO 30000
113600090223                                     DEPENDING ON ARYSIZ-1
113700090313                                     ASCENDING KEY   IS  WS-IC-FUND
113800090223                                     INDEXED BY IC
113900090223                                                ICG
114000090223                                                ICT.
114100090223      * RFS 64527 END
114200090822R72304*        05  WS-IC-FUND          PICTURE X(5).
114300090822R72304*        05  WS-IC-CODE          PICTURE X(5).
114400090822R72304*        05  WS-IC-PROD          PICTURE X(3).
114500090822R72304*        05  WS-IC-NAME          OCCURS   2  TIMES
114600090822R72304*                                INDEXED BY  ICL
114700090822R72304*                                PICTURE X(15).
114800090822R72304*        05  WS-IC-RULE          PICTURE X(1).
114900090822R72304       10 WS-INVCDE-ELEM.
115000090822R72304         20  WS-IC-FUND          PICTURE X(5).
115100090822R72304         20  WS-IC-CODE          PICTURE X(5).
115200090822R72304         20  WS-IC-PROD          PICTURE X(3).
115300090822R72304         20  WS-IC-NAME          OCCURS   2  TIMES
115400090822R72304                                 INDEXED BY  ICL
115500090822R72304                                 PICTURE X(15).
115600090822R72304         20  WS-IC-RULE          PICTURE X(1).
115700021001       01  WS-IC-LST               PICTURE S9(4)       COMP-3.
115800021001       01  WS-IC-MAX               PICTURE S9(4)       COMP-3
115900021002                                                       VALUE 1000.
116000021001      /
116100021001      ******************************************************************
116200021001      *                                                                *
116300021001      *    H E A D I N G   P R I N T   L I N E S                       *
116400021001      *                                                                *
116500021001      ******************************************************************
116600021001
116700021001       01  HEADING-LINE-1.
116800021001           05  FILLER                  PICTURE X(11)       VALUE
116900021001               "DATE     : ".
117000021001           03  HL1-YY                  PICTURE 9(2).
117100021001           03  FILLER                  PICTURE X(1)        VALUE "/".
117200021001           03  HL1-MM                  PICTURE 9(2).
117300021001           03  FILLER                  PICTURE X(1)        VALUE "/".
117400021001           03  HL1-DD                  PICTURE 9(2).
117500021001           03  FILLER                  PICTURE X(95)       VALUE SPACES.
117600021001           03  FILLER                  PICTURE X(6)        VALUE
117700021001               "TIME: ".
117800021001           03  HL1-TIME                PICTURE 99B99B99B99.
117900021001           03  HL1-TIME-R              REDEFINES HL1-TIME.
118000021001               05  FILLER              PICTURE X(8).
118100021001               05  HL1-TIME-DOT        PICTURE X(1).
118200021001               05  FILLER              PICTURE X(2).
118300021001           03  FILLER                  PICTURE X(19)       VALUE SPACES.
118400021001
118500021001       01  HEADING-LINE-2.
118600021001           03  FILLER                  PICTURE X(11)       VALUE
118700021001               "REPORT NO: ".
118800021001           03  FILLER                  PICTURE X(10)       VALUE
118900021007               "STMCNFPRT ".
119000021001           03  FILLER                  PICTURE X(15)       VALUE SPACES.
119100021001           03  FILLER                  PICTURE X(33)       VALUE
119200021001               "CONFIRMATION PRINT CONTROL REPORT".
119300021001           03  FILLER                  PICTURE X(45)       VALUE SPACES.
119400021001           03  FILLER                  PICTURE X(5)        VALUE
119500021001               "PAGE:".
119600021001           03  FILLER                  PICTURE X(8)        VALUE SPACES.
119700021001           03  HL2-PGECNT              PICTURE ZZZZ9.
119800021001           03  FILLER                  PICTURE X(18)       VALUE SPACES.
119900021001
120000021001       01  HEADING-LINE-3.
120100021001           03  FILLER                  PICTURE X(3)        VALUE SPACES.
120200021001           03  FILLER                  PICTURE X(9)        VALUE
120300021001               "INVESTOR#".
120400021001           03  FILLER                  PICTURE X(1)        VALUE SPACES.
120500021001           03  FILLER                  PICTURE X(9)        VALUE
120600021001               "ACCOUNT  ".
120700021001           03  FILLER                  PICTURE X(1)        VALUE SPACES.
120800021001           03  FILLER                  PICTURE X(9)        VALUE
120900021001               "SECTION  ".
121000021001           03  FILLER                  PICTURE X(1)        VALUE SPACES.
121100021001           03  FILLER                  PICTURE X(3)        VALUE "LNG".
121200021001           03  FILLER                  PICTURE X(1)        VALUE SPACES.
121300021001           03  FILLER                  PICTURE X(6)        VALUE
121400021001               "DEALER".
121500021001           03  FILLER                  PICTURE X(1)        VALUE SPACES.
121600021001           03  FILLER                  PICTURE X(5)        VALUE
121700021001               "REP. ".
121800021001           03  FILLER                  PICTURE X(1)        VALUE SPACES.
121900021001           03  FILLER                  PICTURE X(50)       VALUE
122000021001               "MESSAGE                                           ".
122100021001           03  FILLER                  PICTURE X(50)       VALUE SPACES.
122200021001
122300021001      /
122400021001      ******************************************************************
122500021001      *                                                                *
122600021001      *    E R R O R   P R I N T   L I N E S
122700021001      *                                                                *
122800021001      ******************************************************************
122900021001
123000021001       01  ERROR-LINE-1.
123100021001           03  FILLER                  PICTURE X(3).
123200021001           03  EL1-INVESTOR-NO         PICTURE 9(9).
123300021001           03  FILLER                  PICTURE X(1).
123400021001           03  EL1-ACCOUNT             PICTURE 9(9).
123500021001           03  FILLER                  PICTURE X(1).
123600021001           03  EL1-SECTION-NO          PICTURE 9(2).
123700021001           03  EL1-SECTION-LITDSH      PICTURE X(1).
123800021001           03  EL1-SECTION-SEQUENCE    PICTURE 9(6).
123900021001           03  FILLER                  PICTURE X(2).
124000021001           03  EL1-LANGUAGE-CODE       PICTURE X(1).
124100021001           03  FILLER                  PICTURE X(2).
124200021001           03  EL1-DEALER              PICTURE X(4).
124300021001           03  FILLER                  PICTURE X(3).
124400021001           03  EL1-DEALER-REP-CODE     PICTURE X(5).
124500021001           03  FILLER                  PICTURE X(1).
124600021001           03  EL1-MSG                 PICTURE X(50).
124700021001           03  FILLER                  PICTURE X(50).
124800021001
124900021001      /
125000021001      ******************************************************************
125100021001      *                                                                *
125200021001      *    C O N T R O L   P R I N T   L I N E S                       *
125300021001      *                                                                *
125400021001      ******************************************************************
125500021001
125600021001       01  CONTROL-LINE-1.
125700021001           03  FILLER                  PICTURE X(3).
125800021001           03  CL1-LIT                 PICTURE X(50) JUST RIGHT.
125900021001           03  FILLER                  PICTURE X(1).
126000021001           03  CL1-CNT                 PICTURE ZZZ,ZZZ,ZZ9.
126100021001           03  FILLER                  PICTURE X(85).
126200021001
126300021001       01  CONTROL-LINE-2.
126400021001           03  FILLER                  PICTURE X(3)        VALUE SPACES.
126500021001           03  FILLER                  PICTURE X(43)       VALUE
126600021001               "CONFIRMATIONS FOR MANAGEMENT COMPANY CODE: ".
126700021001           03  CL2-MANAGEMENT-COMPANY-CODE
126800021001                                       PICTURE X(3).
126900021001           03  FILLER                  PICTURE X(101)      VALUE SPACES.
127000021001      /
127100021001       01  WS-PGM-DEFIND-WORK-ITEMS.
127200021001
127300021001      ******************************************************************
127400021001      *                                                                *
127500021001      *    P R O G R A M   D E F I N E D   W O R K   I T E M S         *
127600021001      *                                                                *
127700021001      ******************************************************************
127800021001           03  WS-B-CURRENCY           PICTURE X(3).
127900021001
128000021001           03  WS-M-DATE               PICTURE XX/XX/XX.
128100021007           03  WS-AT-FUND-CODE.
128200021001               05 WS-AT-FUND-MGMT-CDE  PICTURE X(3).
128300021001               05 WS-AT-INDUSTRY-CODE  PICTURE X(5).
128400021007           03  WS-PRODUCT-TYPE-RULE    PICTURE X(1).
128500021001
128600021001      *****
128700021001      *****    Control Report Counters.
128800021001      *****
128900021001
129000021001           03  WS-STMT-DTA-BCNT        PICTURE S9(7)       COMP-3.
129100021001           03  WS-STMT-DTA-BCNT-00     PICTURE S9(7)       COMP-3.
129200021001           03  WS-STMT-DTA-BCNT-05     PICTURE S9(7)       COMP-3.
129300021001           03  WS-STMT-DTA-BCNT-10     PICTURE S9(7)       COMP-3.
129400021002           03  WS-STMT-DTA-BCNT-12     PICTURE S9(7)       COMP-3.
129500021001           03  WS-STMT-DTA-BCNT-15     PICTURE S9(7)       COMP-3.
129600140624132121     03  WS-STMT-DTA-BCNT-16     PICTURE S9(7)       COMP-3.
129700021001           03  WS-STMT-DTA-BCNT-20     PICTURE S9(7)       COMP-3.
129800060618R35042     03  WS-STMT-DTA-BCNT-21     PICTURE S9(7)       COMP-3.
129900021002           03  WS-STMT-DTA-BCNT-25     PICTURE S9(7)       COMP-3.
130000130408117038     03  WS-STMT-DTA-BCNT-22     PICTURE S9(7)       COMP-3.
130100021001           03  WS-STMT-DTA-BCNT-30     PICTURE S9(7)       COMP-3.
130200021001           03  WS-STMT-DTA-BCNT-35     PICTURE S9(7)       COMP-3.
130300021002           03  WS-STMT-DTA-BCNT-40     PICTURE S9(7)       COMP-3.
130400021002           03  WS-STMT-DTA-BCNT-43     PICTURE S9(7)       COMP-3.
130500021002           03  WS-STMT-DTA-BCNT-45     PICTURE S9(7)       COMP-3.
130600021001           03  WS-STMT-DTA-BCNT-50     PICTURE S9(7)       COMP-3.
130700021001           03  WS-STMT-DTA-BCNT-60     PICTURE S9(7)       COMP-3.
130800021001           03  WS-STMT-DTA-BCNT-62     PICTURE S9(7)       COMP-3.
130900091125R69515     03  WS-STMT-DTA-BCNT-63     PICTURE S9(7)       COMP-3.
131000021002           03  WS-STMT-DTA-BCNT-67     PICTURE S9(7)       COMP-3.
131100021001           03  WS-STMT-DTA-BCNT-70     PICTURE S9(7)       COMP-3.
131200021001           03  WS-STMT-DTA-BCNT-82     PICTURE S9(7)       COMP-3.
131300021001           03  WS-STMT-DTA-BCNT-84     PICTURE S9(7)       COMP-3.
131400021002           03  WS-STMT-DTA-BCNT-90     PICTURE S9(7)       COMP-3.
131500021001           03  WS-STMT-DTA-RCNT        PICTURE S9(7)       COMP-3.
131600021001           03  WS-STMT-DTA-SCNT-01     PICTURE S9(7)       COMP-3.
131700021001           03  WS-STMT-DTA-SCNT-05     PICTURE S9(7)       COMP-3.
131800021001           03  WS-STMT-DTA-SCNT-10     PICTURE S9(7)       COMP-3.
131900021001           03  WS-STMT-DTA-SCNT-20     PICTURE S9(7)       COMP-3.
132000021001           03  WS-STMT-DTA-SCNT-80     PICTURE S9(7)       COMP-3.
132100021001           03  WS-STMT-DTA-SCNT-84     PICTURE S9(7)       COMP-3.
132200021001           03  WS-STMT-PRT-DTL-WCNT    PICTURE S9(7)       COMP-3.
132300021001           03  WS-STMT-PRT-HDR-WCNT    PICTURE S9(7)       COMP-3.
132400021001
132500021001      *****
132600021001      *****    Control Report Literals.
132700021001      *****
132800021001
132900021001           03  WS-STMT-DTA-BLIT        PICTURE X(50)       VALUE
133000021001               "STATEMENT DATA RECS BYPASSED:                     ".
133100021001           03  WS-STMT-DTA-BLIT-00     PICTURE X(50)       VALUE
133200021001               "STATEMENT DATA (DELIVERY INFO) RECS BYPASSED:     ".
133300021001           03  WS-STMT-DTA-BLIT-01     PICTURE X(50)       VALUE
133400021001               "STATEMENT DATA (INVESTOR INFO   ) RECS BYPASSED:  ".
133500021001           03  WS-STMT-DTA-BLIT-05     PICTURE X(50)       VALUE
133600021001               "STATEMENT DATA (DEALER) RECS BYPASSED:            ".
133700021001           03  WS-STMT-DTA-BLIT-10     PICTURE X(50)       VALUE
133800021001               "STATEMENT DATA (INVESTOR SUMMARY) RECS BYPASSED:  ".
133900021002           03  WS-STMT-DTA-BLIT-12     PICTURE X(50)       VALUE
134000021001               "STATEMENT DATA (INVESTOR SUMMARY SEC2) BYPASSED:  ".
134100021001           03  WS-STMT-DTA-BLIT-15     PICTURE X(50)       VALUE
134200021001               "STATEMENT DATA (ACCT ASSET CLASS) RECS BYPASSED:  ".
134300021001           03  WS-STMT-DTA-BLIT-20     PICTURE X(50)       VALUE
134400021001               "STATEMENT DATA (ACCOUNT DETAIL) RECS BYPASSED:    ".
134500060618R35042     03  WS-STMT-DTA-BLIT-21     PICTURE X(50)       VALUE
134600060623R35042         "STATEMENT DATA (ACCOUNT ADDITIONAL INFO) BYPASSED:".
134700021002           03  WS-STMT-DTA-BLIT-25     PICTURE X(50)       VALUE
134800021001               "STATEMENT DATA (ACCOUNT GIC DETAIL) RECS BYPASSED:".
134900130408117038     03  WS-STMT-DTA-BLIT-22     PICTURE X(50)       VALUE
135000130408117038         "STATEMENT DATA (ACCOUNT ADD DETAIL) RECS BYPASSED:".
135100021001           03  WS-STMT-DTA-BLIT-30     PICTURE X(50)       VALUE
135200021001               "STATEMENT DATA (ACC PERF) RECS BYPASSED:          ".
135300021001           03  WS-STMT-DTA-BLIT-35     PICTURE X(50)       VALUE
135400021001               "STATEMENT DATA (ACC FUND PERF) RECS BYPASSED:     ".
135500021002           03  WS-STMT-DTA-BLIT-40     PICTURE X(50)       VALUE
135600021001               "STATEMENT DATA (SEG FUND CONTR DTL) RECS BYPASSED:".
135700021001           03  WS-STMT-DTA-BLIT-43     PICTURE X(50)       VALUE
135800021001               "STATEMENT DATA (SEG FUND INVES DTL) RECS BYPASSED:".
135900021001           03  WS-STMT-DTA-BLIT-45     PICTURE X(50)       VALUE
136000021002               "STATEMENT DATA (ANNUITANT DTL) RECS BYPASSED:     ".
136100021001           03  WS-STMT-DTA-BLIT-50     PICTURE X(50)       VALUE
136200021001               "STATEMENT DATA (ROLLOVER) RECS BYPASSED:          ".
136300021001           03  WS-STMT-DTA-BLIT-60     PICTURE X(50)       VALUE
136400021001               "STATEMENT DATA (RRIF DETAIL) RECS BYPASSED:       ".
136500021001           03  WS-STMT-DTA-BLIT-62     PICTURE X(50)       VALUE
136600021001               "STATEMENT DATA (RESP DETAIL) RECS BYPASSED:       ".
136700091125R69515     03  WS-STMT-DTA-BLIT-63     PICTURE X(50)       VALUE
136800091125R69515         "STATEMENT DATA (RDSP) RECS BYPASSED:              ".
136900021001           03  WS-STMT-DTA-BLIT-67     PICTURE X(50)       VALUE
137000021001               "STATEMENT DATA (BENEFICIARY INFOR) RECS BYPASSED  ".
137100021001           03  WS-STMT-DTA-BLIT-70     PICTURE X(50)       VALUE
137200021001               "STATEMENT DATA (SYSTEM PLAN INFO) RECS BYPASSED:  ".
137300021001           03  WS-STMT-DTA-BLIT-82     PICTURE X(50)       VALUE
137400021001               "STATEMENT DATA (ACCT TRAN INST DTL) RECS BYPASSED:".
137500021001           03  WS-STMT-DTA-BLIT-84     PICTURE X(50)       VALUE
137600021001               "STATEMENT DATA (RESP 84           ) RECS BYPASSED:".
137700021002           03  WS-STMT-DTA-BLIT-90     PICTURE X(50)       VALUE
137800021001               "STATEMENT DATA (RESET CONTRACT  ) RECS BYPASSED:  ".
137900021001           03  WS-STMT-DTA-RLIT        PICTURE X(50)       VALUE
138000021001               "STATEMENT DATA RECS READ:                         ".
138100021001           03  WS-STMT-DTA-SLIT-01     PICTURE X(50)       VALUE
138200021001               "STATEMENT DATA (INVESTOR INFO) RECS SELECTED:     ".
138300021001           03  WS-STMT-DTA-SLIT-05     PICTURE X(50)       VALUE
138400021001               "STATEMENT DATA (DEALER) RECS SELECTED:            ".
138500021001           03  WS-STMT-DTA-SLIT-10     PICTURE X(50)       VALUE
138600021001               "STATEMENT DATA (INVESTOR SUMMARY) RECS SELECTED:  ".
138700021001           03  WS-STMT-DTA-SLIT-20     PICTURE X(50)       VALUE
138800021001               "STATEMENT DATA (ACCOUNT DETAIL) RECS SELECTED:    ".
138900021001           03  WS-STMT-DTA-SLIT-80     PICTURE X(50)       VALUE
139000021001               "STATEMENT DATA (ACCT. TRANSACTION) RECS SELECTED: ".
139100021001           03  WS-STMT-DTA-SLIT-84     PICTURE X(50)       VALUE
139200021001               "STATEMENT DATA (RESP 84          ) RECS SELECTED: ".
139300021001           03  WS-STMT-PRT-DTL-WLIT    PICTURE X(50)       VALUE
139400021001               "STATEMENT PRINT DETAIL RECS WRITTEN:              ".
139500021001           03  WS-STMT-PRT-HDR-WLIT    PICTURE X(50)       VALUE
139600021001               "STATEMENT PRINT HEADER RECS WRITTEN:              ".
139700021001
139800021001      *****
139900021001      *****    Error Messages.
140000021001      *****
140100021001
140200021001           03  WS-MSGS.
140300021001               05  WS-MSG-01           PICTURE X(50)       VALUE
140400021001                   "MFASTMTFP SECTION-NO INVALID, RECORD BYPASSED     ".
140500021001               05  WS-MSG-02           PICTURE X(50)       VALUE
140600021001                   "ACCOUNT DETAIL SECTION-NO INVALID, RECORD BYPASSED".
140700021001               05  WS-MSG-03           PICTURE X(50)       VALUE
140800021001                   "ACCOUNT DETAIL CONTAINS INVALID CURRENCY          ".
140900021001               05  WS-MSG-04           PICTURE X(50)       VALUE
141000021001                   "PROGRAM CURRENCY MAXIMUM EXCEEDED                 ".
141100021001               05  WS-MSG-05           PICTURE X(50)       VALUE
141200021001                   "WARNING: MISSING ACCT DTL REC FOR ACCT TRANS FUND ".
141300021001               05  WS-MSG-06           PICTURE X(50)       VALUE
141400021001                   "STATEMENT PRINT HEADER RECORD WRITE FAILED, ABORT ".
141500021001               05  WS-MSG-07           PICTURE X(50)       VALUE
141600021001                   "STATEMENT PRINT DETAIL RECORD WRITE FAILED, ABORT ".
141700021001               05  WS-MSG-08           PICTURE X(50)       VALUE
141800021001                   "MISSING INVESTOR INFORMATION RECORD FOR ACCOUNT   ".
141900021001               05  WS-MSG-09           PICTURE X(50)       VALUE
142000021001                   "MISSING DEALER RECORD FOR ACCOUNT                 ".
142100021001               05  WS-MSG-10           PICTURE X(50)       VALUE
142200021001                   "MISSING ACCOUNT DETAIL RECORD FOR ACCOUNT         ".
142300021001               05  WS-MSG-11           PICTURE X(50)       VALUE
142400021001                   "PROGRAM ACCOUNT MAXIMUM EXCEEDED                  ".
142500021001               05  WS-MSG-12           PICTURE X(50)       VALUE
142600021001                   "WARNING: NOMINEE ACCOUNT WITH NO NOMINEE DATA     ".
142700021001               05  WS-MSG-13           PICTURE X(50)       VALUE
142800021001                   "WARNING: NON-NOMINEE ACCOUNT WITH NOMINEE DATA    ".
142900021001           03  WS-MSGS-R               REDEFINES WS-MSGS.
143000021001               05  WS-MSG              OCCURS  13  TIMES
143100021001                                       INDEXED BY  MSG
143200021001                                       PICTURE X(50).
143300021001
143400021001      *****
143500021001      *****    Format Account Type Description Routine Work Items.
143600021001      *****
143700021001
143800021001           03  WS-ACTTYPGRP            PICTURE X(1).
143900021001
144000021001           03  WS-ACTTYPIN.
144100021001               05  WS-ACTTYPIN-PFX     PICTURE X(35).
144200021001               05  WS-ACTTYPIN-SFX     PICTURE X(2).
144300021001
144400021001           03  WS-ACTTYPLCK            PICTURE X(1).
144500021001           03  WS-ACTTYPLIT1           PICTURE X(13).
144600021001           03  WS-ACTTYPLIT2           PICTURE X(13).
144700021001           03  WS-ACTTYPLIT3           PICTURE X(13).
144800021001           03  WS-ACTTYPLNG            PICTURE X(1).
144900021001           03  WS-ACTTYPNOM            PICTURE X(1).
145000021001           03  WS-ACTTYPOUT            PICTURE X(80).
145100021001           03  WS-ACTTYPSHT            PICTURE X(5).
145200021001           03  WS-ACTTYPSPS            PICTURE X(1).
145300021007           03  WS-NOMACTTYPOUT         PICTURE X(80).
145400021007           03  WS-NOMACTTYPLIT1        PICTURE X(13).
145500021001
145600021001      *****
145700021001      *****    Index/Subscript Related Items.
145800021001      *****
145900021001
146000021001           03  WS-SAF-LST              PICTURE S9(3)       COMP-3.
146100021001           03  WS-SAF-MAX              PICTURE S9(3)       COMP-3.
146200021001           03  WS-SC-MAX               PICTURE S9(3)       COMP-3.
146300021001           03  WS-SIA-LST              PICTURE S9(5)       COMP-3.
146400021001           03  WS-SIA-MAX              PICTURE S9(5)       COMP-3.
146500021001           03  WS-SPL                  PICTURE S9(3)       COMP-3.
146600021001           03  WS-SPL-DTLFST           PICTURE S9(3)       COMP-3.
146700021001           03  WS-SPL-DTLLST           PICTURE S9(3)       COMP-3.
146800021001           03  WS-SPL-DTLMAX           PICTURE S9(3)       COMP-3.
146900021001           03  WS-SPL-DTLTST           PICTURE S9(3)       COMP-3.
147000021001           03  WS-SPL-HDGFST           PICTURE S9(3)       COMP-3.
147100021001           03  WS-SPL-MAX              PICTURE S9(3)       COMP-3.
147200021001           03  WS-SPL-SH02             PICTURE S9(3)       COMP-3.
147300021001           03  WS-SPML-MAX             PICTURE S9(3)       COMP-3.
147400021001           03  WS-II-LST               PICTURE S9(3)       COMP-3.
147500021001           03  WS-II-MAX               PICTURE S9(3)       COMP-3.
147600021002           03  WS-DI-LST               PICTURE S9(3)       COMP-3.
147700021001           03  WS-DI-MAX               PICTURE S9(3)       COMP-3.
147800021002           03  WS-GIC-LST              PICTURE S9(3)       COMP-3.
147900021001           03  WS-GIC-MAX              PICTURE S9(3)       COMP-3.
148000021001           03  WS-AFD-LST              PICTURE S9(3)       COMP-3.
148100021001           03  WS-AFD-MAX              PICTURE S9(3)       COMP-3.
148200021001           03  WS-AGD-LST              PICTURE S9(3)       COMP-3.
148300021001           03  WS-AGD-MAX              PICTURE S9(3)       COMP-3.
148400021001           03  WS-ADID-LST             PICTURE S9(3)       COMP-3.
148500021002           03  WS-ADID-MAX             PICTURE S9(3)       COMP-3.
148600021001
148700021001      *****
148800021001      *****    Non-Numeric Items.
148900021001      *****
149000021001
149100021001           03  WS-ENTERED-BY           PICTURE X(10).
149200021001           03  WS-ADRTMP               PICTURE X(40).
149300021001           03  WS-BRANCH-ADDR1         PICTURE X(40).
149400021001           03  WS-BRANCH-ADDR2         PICTURE X(40).
149500021001           03  WS-BRANCH-ADDR3         PICTURE X(40).
149600021001           03  WS-BRANCH-ADDR4         PICTURE X(40).
149700021001           03  WS-BRANCH-ADDR5         PICTURE X(40).
149800021002           03  WS-MAILING-ADDRESS-INDICATOR PIC X(1).
149900021002           03  WS-DATE-SUM-05A              PIC X(1).
150000021001
150100021001           03  WS-DATE.
150200021001               05  WS-DATE-YY          PICTURE 9(2).
150300021001               05  WS-DATE-MM          PICTURE 9(2).
150400021001               05  WS-DATE-DD          PICTURE 9(2).
150500021001
150600021001           03  WS-DEALER-ACCOUNT-NO    PICTURE X(15).
150700021001           03  WS-DEALER-NAME          PICTURE X(35).
150800021001           03  WS-DEALER-REP-NAMES     PICTURE X(51).
150900021001
151000021001           03  WS-FAX.
151100021001             04  WS-SH-FAX-01-03       PICTURE 9(3).
151200021001             04  WS-SH-FAX-04-10       PICTURE 9(7).
151300021001             04  WS-SH-FAX-04-10-R     REDEFINES WS-SH-FAX-04-10.
151400021001               05  WS-SH-FAX-04-06     PICTURE X(3).
151500021001               05  WS-SH-FAX-07-10     PICTURE X(4).
151600021001
151700021001           03  WS-FILSTAT              PICTURE X(2).
151800021001
151900021001           03  WS-FUND-NO.
152000021001               05  WS-MANAGEMENT-COMPANY-CODE
152100021001                                       PICTURE X(3).
152200021001               05  FILLER              PICTURE X(5).
152300021001
152400021001           03  WS-NOMINEE              PICTURE X(53).
152500021001           03  WS-NOMINEE-CODE         PICTURE X(5).
152600021001           03  WS-NOMINEE-NAME         PICTURE X(37).
152700021001           03  WS-NOMINEES-ACCT-NO     PICTURE X(15).
152800021002           03  WS-INVESTMENT-NAME-SH   PICTURE X(15) VALUE " ".
152900021001
153000021001           03  WS-PHONE.
153100021001             04  WS-SH-PHONE-01-03     PICTURE 9(3).
153200021001             04  WS-SH-PHONE-04-10     PICTURE 9(7).
153300021001             04  WS-SH-PHONE-04-10-R   REDEFINES WS-SH-PHONE-04-10.
153400021001               05  WS-SH-PHONE-04-06   PICTURE X(3).
153500021001               05  WS-SH-PHONE-07-10   PICTURE X(4).
153600021001
153700021001           03  WS-PHONE-2.
153800021001             04  WS-SH-PHONE2-01-03    PICTURE 9(3).
153900021001             04  WS-SH-PHONE2-04-10    PICTURE 9(7).
154000021001             04  WS-SH-PHONE2-04-10-R  REDEFINES WS-SH-PHONE2-04-10.
154100021001               05  WS-SH-PHONE2-04-06  PICTURE X(3).
154200021001               05  WS-SH-PHONE2-07-10  PICTURE X(4).
154300021001
154400021001           03  WS-POSTAL.
154500021001               05  WS-POSTAL1          PICTURE X(3).
154600021001               05  WS-POSTAL2          PICTURE X(7).
154700021001
154800021001           03  WS-POSTAL-OUT.
154900021001               05  WS-POSTAL-OUT1      PICTURE X(3).
155000021001               05  FILLER              PICTURE X(1).
155100021001               05  WS-POSTAL-OUT2      PICTURE X(6).
155200021001
155300021001           03  WS-REP-NAME             PICTURE X(40).
155400021001
155500021001           03  WS-SH02-SIN-NO.
155600021001               05  SH02-SIN-NO-1-3     PICTURE X(3).
155700021001               05  SH02-SIN-NO-LITDSH1 PICTURE X(1).
155800021001               05  SH02-SIN-NO-4-6     PICTURE X(3).
155900021001               05  SH02-SIN-NO-LITDSH2 PICTURE X(1).
156000021001               05  SH02-SIN-NO-7-9     PICTURE X(3).
156100021001
156200021001           03  WS-SH04-INVESTOR-ADDRESS1.
156300021001               05  SH04-POSTAL-CODE    PICTURE X(10).
156400021001               05  FILLER              PICTURE X(30).
156500021001
156600021001           03  WS-SH05-INVESTOR-ADDRESS2.
156700021001               05  SH05-POSTAL-CODE    PICTURE X(10).
156800021001               05  FILLER              PICTURE X(30).
156900021001
157000021001           03  WS-SH06-INVESTOR-ADDRESS3.
157100021001               05  SH6-POSTAL-CODE     PICTURE X(10).
157200021001               05  FILLER              PICTURE X(30).
157300021001
157400021001           03  WS-SH07-INVESTOR-ADDRESS4.
157500021001               05  SH7-POSTAL-CODE     PICTURE X(10).
157600021001               05  FILLER              PICTURE X(30).
157700021001
157800021001           03  WS-SH08-INVESTOR-ADDRESS5.
157900021001               05  SH08-POSTAL-CODE    PICTURE X(10).
158000021001               05  FILLER              PICTURE X(30).
158100021001
158200021001           03  WS-SH09-POSTAL-CODE     PICTURE X(10).
158300021001           03  WS-SH10-LIT1X           PICTURE X(47).
158400021001
158500021001           03  WS-SH10-PHONE.
158600021001               05  SH10-PHONE-LITLB    PICTURE X(1).
158700021001               05  SH10-PHONE-01-03    PICTURE X(3).
158800021001               05  SH10-PHONE-LITRB    PICTURE X(1).
158900021001               05  FILLER              PICTURE X(1).
159000021001               05  SH10-PHONE-04-06    PICTURE X(3).
159100021001               05  SH10-PHONE-LITDSH   PICTURE X(1).
159200021001               05  SH10-PHONE-07-10    PICTURE X(4).
159300021001
159400021001           03  WS-SH10V1-PHONE.
159500021001               05  SH10V1-PHONE-LITLB    PICTURE X(1).
159600021001               05  SH10V1-PHONE-01-03    PICTURE X(3).
159700021001               05  SH10V1-PHONE-LITRB    PICTURE X(1).
159800021001               05  FILLER                PICTURE X(1).
159900021001               05  SH10V1-PHONE-04-06    PICTURE X(3).
160000021001               05  SH10V1-PHONE-LITDSH   PICTURE X(1).
160100021001               05  SH10V1-PHONE-07-10    PICTURE X(4).
160200021001
160300021002           03  WS-SH10V4-PHONE.
160400021001               05  SH10V4-PHONE-LITLB    PICTURE X(1).
160500021001               05  SH10V4-PHONE-01-03    PICTURE X(3).
160600021001               05  SH10V4-PHONE-LITRB    PICTURE X(1).
160700021001               05  FILLER                PICTURE X(1).
160800021001               05  SH10V4-PHONE-04-06    PICTURE X(3).
160900021001               05  SH10V4-PHONE-LITDSH   PICTURE X(1).
161000021002               05  SH10V4-PHONE-07-10    PICTURE X(4).
161100021001
161200021001           03  WS-SH11-NOMINEE         PICTURE X(53).
161300021001
161400021001           03  WS-SH11-FAX.
161500021001               05  SH11-FAX-LITLB      PICTURE X(1).
161600021001               05  SH11-FAX-01-03      PICTURE X(3).
161700021001               05  SH11-FAX-LITRB      PICTURE X(1).
161800021001               05  FILLER              PICTURE X(1).
161900021001               05  SH11-FAX-04-06      PICTURE X(3).
162000021001               05  SH11-FAX-LITDSH     PICTURE X(1).
162100021001               05  SH11-FAX-07-10      PICTURE X(4).
162200021001
162300021001           03  WS-SIN-NO.
162400021001               05  WS-SIN-NO-1-3       PICTURE X(3).
162500021001               05  WS-SIN-NO-4-6       PICTURE X(3).
162600021001               05  WS-SIN-NO-7-9       PICTURE X(3).
162700021001
162800021002           03  WS-II-START-DATE           PICTURE X(8).
162900021002           03  WS-II-START-DATE-R      REDEFINES WS-II-START-DATE.
163000021002               05  WS-II-START-DATE-CCYY  PICTURE X(4).
163100021002               05  WS-II-START-DATE-MM    PICTURE X(2).
163200021002               05  WS-II-START-DATE-DD    PICTURE X(2).
163300021002
163400021002           03  WS-II-END-DATE             PICTURE X(8).
163500021002           03  WS-II-END-DATE-R      REDEFINES WS-II-END-DATE.
163600021002               05  WS-II-END-DATE-CCYY     PICTURE X(4).
163700021002               05  WS-II-END-DATE-MM       PICTURE X(2).
163800021002               05  WS-II-END-DATE-DD       PICTURE X(2).
163900021001
164000021002           03  WS-TRADE-DATE               PICTURE X(8).
164100021002           03  WS-TRADE-DATE-R      REDEFINES WS-TRADE-DATE.
164200021002               05  WS-TRADE-DATE-CCYY      PICTURE X(4).
164300021002               05  WS-TRADE-DATE-MM        PICTURE X(2).
164400021002               05  WS-TRADE-DATE-DD        PICTURE X(2).
164500021002
164600021002           03  WS-PROCESS-DATE             PICTURE X(8).
164700021002           03  WS-PROCESS-DATE-R    REDEFINES WS-PROCESS-DATE.
164800021002               05  WS-PROCESS-DATE-CCYY    PICTURE X(4).
164900021002               05  WS-PROCESS-DATE-MM      PICTURE X(2).
165000021002               05  WS-PROCESS-DATE-DD      PICTURE X(2).
165100021002
165200021002           03  WS-TRANS-TYPE           PICTURE X(3).
165300021001               88  PURCHASE-TRANSACTION                    VALUE "BAJ"
165400021001                                                                 "BFW"
165500021001                                                                 "BUY"
165600021001                                                                 "CPG"
165700021001                                                                 "INC"
165800021001                                                                 "INT"
165900021001                                                                 "MFR"
166000021001                                                                 "SWI"
166100021001                                                                 "TRI".
166200021001               88  REDEMPTION-TRANSACTION                  VALUE "CQD"
166300021001                                                                 "FEE"
166400021001                                                                 "SAJ"
166500021001                                                                 "SEL"
166600021001                                                                 "CPL"
166700021001                                                                 "SWO"
166800021001                                                                 "TFE"
166900021001                                                                 "TRO".
167000021002           03  WS-SETTL-AMT            PICTURE 9(11)V9(2).
167100021001           03  WS-SETTL-AMT-SIGN       PICTURE X(1).
167200021015           03  WS-UNIT-PRICE           PICTURE S9(5)V9(4).
167300021001           03  WS-UNIT-PRICE-SIGN      PICTURE X(1).
167400021001           03  WS-NO-OF-UNITS          PICTURE 9(9).
167500021001           03  WS-NO-OF-UNITS-SIGN     PICTURE X(1).
167600021001           03  WS-UNIT-BALANCE         PICTURE 9(9).
167700021001           03  WS-UNIT-BALANCE-SIGN    PICTURE X(1).
167800021001
167900021001      *****
168000021001      *****    Non-Numeric Literals.
168100021001      *****
168200021001
168300021001           03  WS-ACCOUNT-TYPE-SHORT-TOTAL
168400021001                                       PICTURE X(5)        VALUE
168500021001               "TOTAL".
168600021001           03  WS-ACCOUNT-TYPE-TOTAL   PICTURE X(35)       VALUE
168700021001               "TOTAL                              ".
168800021001           03  WS-INVESTMENT-NAME-TOTAL
168900021001                                       PICTURE X(35)       VALUE
169000021001               "TOTAL                              ".
169100021001
169200021001      *****
169300021001      *****    Numeric Items.
169400021001      *****
169500021001
169600021001
169700021003           03  WS-ACTUAL-CAPITAL       PICTURE 9(11)V9(2).
169800021001
169900021001           03  WS-LNECNT               PICTURE S9(3)       COMP-3.
170000021001           03  WS-LNEMAX               PICTURE S9(3)       COMP-3.
170100021001           03  WS-PGECNT               PICTURE S9(5)       COMP-3.
170200021001
170300021001           03  WS-REG-CTB-CUR          PICTURE 9(9)V9(2)   COMP-3.
170400021001           03  WS-REG-CTB-CUR-SIGN     PICTURE X(1).
170500021001
170600021001           03  WS-SH-PGENO             PICTURE S9(3)       COMP-3.
1707000210021002  *    03  WS-STMTVRSN             PICTURE S9(3)       COMP-3.
170800021001           03  WS-STMTVRSN             PICTURE X(1).
170900021001
171000021001      *****
171100021001      *****    Switches.
171200021001      *****
171300021001
171400021001           03  WS-BYPPRT-SW            PICTURE X(1).
171500021001           03  WS-CLTSPR-SW            PICTURE X(1).
171600021001           03  WS-EOJHDG-SW            PICTURE X(1).
171700021001           03  WS-L01BYP-SW            PICTURE X(1).
171800021001           03  WS-PSRERR-SW            PICTURE X(1).
171900021001           03  WS-PSTCDEPRT-SW         PICTURE X(1).
172000021001           03  WS-SELPRT-SW            PICTURE X(1).
172100021001           03  WS-STMT-DTA-SW-01       PICTURE X(1).
172200021001           03  WS-STMT-DTA-SW-05       PICTURE X(1).
172300021002           03  WS-STMT-DTA-SW-25       PICTURE X(1).
172400021002           03  WS-STMT-DTA-SW-20FUND   PICTURE X(1).
172500021002           03  WS-STMT-DTA-SW-20GIC    PICTURE X(1).
172600021002           03  WS-STMT-DTA-SW-20DII    PICTURE X(1).
172700021002           03  WS-STMT-DTA-SW-80DII    PICTURE X(1).
172800021002           03  WS-STMT-DTA-SW-80FUND   PICTURE X(1).
172900021001           03  WS-STMT-PRT-HDR-WSW     PICTURE X(1).
173000021001      /
173100021001       01  DUMP-ARGUMENTS.
173200021001
173300021001      ******************************************************************
173400021001      *                                                                *
173500021001      *    D U M P   P A S S   P A R A M E T E R S                     *
173600021001      *                                                                *
173700021001      ******************************************************************
173800021001
173900021001           03  DA-TYPE                 PICTURE X(1)        VALUE "F".
174000021001               88  COBOL-IDENTIFIERS                       VALUE "D".
174100021001               88  FULL-DUMP                               VALUE "F".
174200021001           03  FILLER                  PICTURE X(1).
174300021001           03  DA-PGM-NAME             PICTURE X(10)       VALUE
174400021007               "STMCNFPRT ".
174500021001      /
174600021001      ******************************************************************
174700021001      *                                                                *
174800021001      *    C U R R E N T   /   P R E V I O U S   C O N T R O L S       *
174900021001      *                                                                *
175000021001      ******************************************************************
175100021001
175200021001       01  CURR-CONTROLS.
175300021001           03  CURR-LEVEL1.
175400021001             04  CURR-LEVEL2.
175500021001               05  CURR-START-DATE     PICTURE 9(8).
175600021001               05  CURR-END-DATE       PICTURE 9(8).
175700021001               05  CURR-INVESTOR-NO    PICTURE 9(9).
175800021001             04  CURR-ACCOUNT          PICTURE 9(9).
175900021001
176000021001       01  PREV-CONTROLS.
176100021001           03  PREV-LEVEL1.
176200021001             04  PREV-LEVEL2.
176300021001               05  PREV-START-DATE     PICTURE 9(8).
176400021001               05  PREV-END-DATE       PICTURE 9(8).
176500021001               05  PREV-INVESTOR-NO    PICTURE 9(9).
176600021001             04  PREV-ACCOUNT          PICTURE 9(9).
176700021001
176800021001       01  CURR-CTLS-DPR.
176900021001           03  CURR-CD-LEV1.
177000021001               05  CURR-CD-FUND-NO     PICTURE X(8).
177100021001
177200021001       01  PREV-CTLS-DPR.
177300021001           03  PREV-CD-LEV1.
177400021001               05  PREV-CD-FUND-NO     PICTURE X(8).
177500021001
177600021001      /
177700190614      *RFS183449-Starts
177800190614       01    Lc-Acct-Type-Code         PICTURE X(5).
177900190614      *RFS183449-Ends
178000190614
178100021001       PROCEDURE DIVISION.
178200021001
178300021001      ******************************************************************
178400021001      *                                                                *
178500021001      *    P R O C E D U R E   D I V I S I O N                         *
178600021001      *                                                                *
178700021001      ******************************************************************
178800021001      /
178900021001       MAINLINE.
179000021001
179100021001      ******************************************************************
179200021001      *                                                                *
179300021001      *    M A I N L I N E                                             *
179400021001      *                                                                *
179500021001      ******************************************************************
179600021001
179700021001           PERFORM INITIAL-LOGIC-RTN  THRU ILR-EXIT.
179800021001
179900021001           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
180000021001               GO TO MLR-0050
180100021001           END-IF.
180200021001
180300021001       MLR-0010.
180400021001
180500021001           PERFORM GET-CURRENT-RECORD THRU GCR-EXIT.
180600021001
180700021001           IF  PREV-LEVEL1    IS EQUAL TO  CURR-LEVEL1
180800021001               GO TO MLR-0040
180900021001           END-IF
181000021001
181100021001           IF  PREV-CONTROLS  IS EQUAL TO  LOW-VALUES
181200021001               GO TO MLR-0020
181300021001           END-IF
181400021001
181500021001           PERFORM LEVEL-SUMMARY-1    THRU LS1-EXIT.
181600021001
181700021001           IF  PREV-LEVEL2    IS EQUAL TO  CURR-LEVEL2
181800021001               GO TO MLR-0030
181900021001           END-IF
182000021001
182100021001           PERFORM LEVEL-SUMMARY-2    THRU LS2-EXIT.
182200021001
182300021001       MLR-0020.
182400021001
182500021001           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
182600021001               GO TO MLR-0050
182700021001           END-IF
182800021001
182900021001           PERFORM LEVEL-REINIT-2     THRU LR2-EXIT.
183000021001
183100021001       MLR-0030.
183200021001
183300021001           PERFORM LEVEL-REINIT-1     THRU LR1-EXIT.
183400021001
183500021001       MLR-0040.
183600021001
183700021001           PERFORM DETAIL-PROCESS-RTN THRU DPR-EXIT.
183800021001
183900021001           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
184000021001               GO TO MLR-0050
184100021001           END-IF
184200021001
184300021001           MOVE CURR-CONTROLS          TO  PREV-CONTROLS.
184400021001           GO TO MLR-0010.
184500021001
184600021001       MLR-0050.
184700021001
184800021001           PERFORM END-JOB-RTN        THRU EJR-EXIT.
184900021001           STOP RUN.
185000021001
185100021001      **********
185200021001
185300021001      /
185400021001       GET-CURRENT-RECORD.
185500021001
185600021001      ******************************************************************
185700021001      *                                                                *
185800021001      *    G E T   C U R R E N T   R E C O R D   R O U T I N E         *
185900021001      *                                                                *
186000021001      ******************************************************************
186100021001
186200021001           CONTINUE.
186300021001
186400021001      *****
186500021001      *****    Read through the Statement Data records.
186600021001      *****
186700021001
186800021001       GCR-0010.
186900021001
187000021001           READ STMT-DTA-FILE          AT  END
187100021001               MOVE HIGH-VALUES        TO  CURR-CONTROLS
187200021001               GO TO GCR-EXIT
187300021001           END-READ
187400021001
187500021001           MOVE STMT-DTA-RECD          TO  MFASTMTFP-SECTION.
187600021001           ADD 1                       TO  WS-STMT-DTA-RCNT.
187700021001
187800021001      *****
187900021001      *****    Determine which Statement Data record is being processed.
188000021001      *****    If the record cannot be identified, an error message will
188100021001      *****    be printed and the record bypassed.  If this occurs, the
188200021001      *****    program should be changed to either bypass the record or
188300021001      *****    to handle it appropriately.
188400021001      *****
188500021001
188600021001
188700021001           EVALUATE PR-SECTION-NO
188800021001             WHEN  "00"               GO TO GCR-0020
188900021001             WHEN  "01"               GO TO GCR-0030
189000021001             WHEN  "05"               GO TO GCR-0040
189100021001             WHEN  "10"               GO TO GCR-0050
189200021002             WHEN  "12"               GO TO GCR-0050-0005
189300021001             WHEN  "15"               GO TO GCR-0050-0010
189400140624132121       WHEN  "16"               GO TO GCR-0050-0016
189500021001             WHEN  "20"               GO TO GCR-0060
189600060618R35042       WHEN  "21"               GO TO GCR-0060-0002
189700130408117038       WHEN  "22"               GO TO GCR-0060-0022
189800021002             WHEN  "25"               GO TO GCR-0060-0005
189900021001             WHEN  "30"               GO TO GCR-0060-0010
190000021001             WHEN  "35"               GO TO GCR-0060-0020
190100021002             WHEN  "40"               GO TO GCR-0060-0030
190200021002             WHEN  "43"               GO TO GCR-0060-0040
190300021002             WHEN  "45"               GO TO GCR-0060-0050
190400021001             WHEN  "50"               GO TO GCR-0070
190500021001             WHEN  "60"               GO TO GCR-0070-0010
190600021001             WHEN  "62"               GO TO GCR-0070-0015
190700091125R69515       WHEN  "63"               GO TO GCR-0070-0016
190800021002             WHEN  "67"               GO TO GCR-0070-0018
190900021001             WHEN  "70"               GO TO GCR-0070-0020
191000021001             WHEN  "80"               GO TO GCR-0080
191100021001             WHEN  "82"               GO TO GCR-0080-0010
191200021001             WHEN  "84"               GO TO GCR-0080-0020
191300021002             WHEN  "90"               GO TO GCR-0080-0030
191400021001             WHEN  OTHER
191500021001               MOVE SPACES                 TO  ERROR-LINE-1
191600021001               SET MSG                     TO  1
191700021001               PERFORM PRINT-ERR-LINE      THRU PEL-EXIT
191800021001               ADD 1                       TO  WS-STMT-DTA-BCNT
191900021001               GO TO GCR-0090
192000021001           END-EVALUATE.
192100021001
192200021001       GCR-0020.
192300021001
192400021001      *****
192500021001      *****    Processing a Delivery Information record, bypass it.
192600021001      *****
192700021001
192800021001           ADD 1                       TO  WS-STMT-DTA-BCNT-00.
192900021001           GO TO GCR-0090.
193000021001
193100021001       GCR-0030.
193200021001
193300021001      *****
193400021001      *****    Processing an Investor Information record, select it.
193500021001      *****
193600021001
193700021001           MOVE MFASTMTFP-SECTION      TO  INVESTOR-INFO-SECTION.
193800021001           ADD 1                       TO  WS-STMT-DTA-SCNT-01.
193900021001           GO TO GCR-0100.
194000021001
194100021001       GCR-0040.
194200021001
194300021001      *****
194400021001      *****    Processing a Dealer record.  The record will be selected
194500021001      *****    unless it is the primary record.
194600021001      *****
194700021001
194800021001           MOVE MFASTMTFP-SECTION      TO  DEALER-SECTION.
194900021001
195000021001           ADD 1                       TO  WS-STMT-DTA-SCNT-05.
195100021001           GO TO GCR-0100.
195200021001
195300021001       GCR-0050.
195400021001
195500021001      *****
195600021001      *****    Processing an Investor Summary record.  The record will
195700021001      *****    be selected unless it is a 'TOTAL' record.
195800021001      *****
195900021001
196000021001           MOVE MFASTMTFP-SECTION      TO  INVESTOR-SUMMARY-SECTION.
196100021001           IF  IS-ACCOUNT-TYPE   EQUAL TO  WS-ACCOUNT-TYPE-TOTAL
196200021001           AND IS-ACCOUNT-TYPE-SHORT
196300021001                              IS EQUAL TO  WS-ACCOUNT-TYPE-SHORT-TOTAL
196400021001               ADD 1                   TO  WS-STMT-DTA-BCNT-10
196500021001               GO TO GCR-0090.
196600021001
196700021001           ADD 1                       TO  WS-STMT-DTA-SCNT-10.
196800021001           GO TO GCR-0100.
196900021001
197000021002       GCR-0050-0005.
197100021001
197200021001      *****
197300021001      *****    Processing an Investor Summary Section 2 record, bypass
197400021001      *****    it.
197500021001      *****
197600021001
197700021001           MOVE MFASTMTFP-SECTION      TO  INVESTOR-SUMMARY-SECTION-2.
197800021001           ADD 1                       TO  WS-STMT-DTA-BCNT-12.
197900021002           GO TO GCR-0090.
198000021001
198100021001       GCR-0050-0010.
198200021001
198300021001      *****
198400021001      *****    Processing an Account Asset Class Summary record, bypass
198500021001      *****    it.
198600021001      *****
198700021001
198800021001           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-ASSET-CLASS-SECTION.
198900021001           ADD 1                       TO  WS-STMT-DTA-BCNT-15.
199000021001           GO TO GCR-0090.
199100021001
199200140624      *RFS132121 - START
199300140624       GCR-0050-0016.
199400140624
199500140624      *****
199600140624      *****    Processing an Account Level Asset Allocation record,
199700140624      *****    bypass it.
199800140624      *****
199900140624
200000140624           MOVE MFASTMTFP-SECTION      TO ACCOUNT-LEVEL-ASSET-ALLOC-DTL.
200100140624           ADD 1                       TO WS-STMT-DTA-BCNT-16.
200200140624           GO TO GCR-0090.
200300140624
200400140624      *RFS132121 - END
200500021001       GCR-0060.
200600021001
200700021001      *****
200800021001      *****    Processing an Account Detail record.  The record will be
200900021001      *****    selected unless it is a 'TOTAL' record.
201000021001      *****
201100021001
201200021001           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-DETAILS-SECTION.
201300021002           MOVE MFASTMTFP-SECTION    TO  WS-ACCOUNT-FUND-DETAILS-TEMP.
201400021001           IF  AD-INVESTMENT-NAME
201500021001                              IS EQUAL TO  WS-INVESTMENT-NAME-TOTAL
201600021001               ADD 1                   TO  WS-STMT-DTA-BCNT-20
201700021001               GO TO GCR-0090.
201800021001
201900021001           ADD 1                       TO  WS-STMT-DTA-SCNT-20.
202000021001           GO TO GCR-0100.
202100021001
202200060618R35042 GCR-0060-0002.
202300060618  ¦
202400060618  ¦   *****
202500060618  ¦   *****    Processing a ACCOUNT-ADDITIONAL-INFO record, BYPASS IT.
202600060618  ¦   *****
202700060618  ¦
202800060618  ¦        MOVE MFASTMTFP-SECTION      TO  ACCOUNT-ADDITIONAL-INFO.
202900060618  V        ADD 1                       TO  WS-STMT-DTA-BCNT-21.
203000060618R35042     GO TO GCR-0090.
203100060618
203200021002       GCR-0060-0005.
203300021001
203400021001      *****
203500021001      *****    Processing an Account GIC Detail record, bypass it.
203600021002      *****    PROCESSING AN ACCOUNT GIC DETAIL RECORD, SELECT IT.
203700021001      *****
203800021001
203900021001           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-GIC-DETAILS-SECTION.
204000021001           ADD 1                       TO  WS-STMT-DTA-BCNT-25.
204100021002           GO TO GCR-0100.
204200021001
204300130408117038 GCR-0060-0022.
204400130408
204500130408117038     MOVE MFASTMTFP-SECTION      TO  ACCOUNT-DETAILS-SECTION-22.
204600130408117038     ADD 1                       TO  WS-STMT-DTA-BCNT-22.
204700130408117038     GO TO GCR-0100.
204800130408
204900021001       GCR-0060-0010.
205000021001
205100021001      *****
205200021001      *****    Processing a Account Performance record, bypass it.
205300021001      *****
205400021001
205500021001           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-PERFORMANCE-SECTION.
205600021001           ADD 1                       TO  WS-STMT-DTA-BCNT-30.
205700021001           GO TO GCR-0090.
205800021001
205900021001       GCR-0060-0020.
206000021001
206100021001      *****
206200021001      *****  Processing a Account Fund Performance record, bypass it.
206300021001      *****
206400021001
206500021001           MOVE MFASTMTFP-SECTION     TO ACCOUNT-FUND-PERFORM-SECTION.
206600021001           ADD 1                      TO WS-STMT-DTA-BCNT-35.
206700021001           GO TO GCR-0090.
206800021001
206900021002       GCR-0060-0030.
207000021001
207100021001      *****
207200021001      *****  Processing a Seg Fund Contract Details record, bypass it.
207300021001      *****
207400021001
207500021001           MOVE MFASTMTFP-SECTION     TO SEG-FUND-CONTRACT-DETAILS.
207600021001           ADD 1                      TO WS-STMT-DTA-BCNT-40.
207700021001           GO TO GCR-0090.
207800021001
207900021002       GCR-0060-0040.
208000021001
208100021001      *****
208200021001      *****  Processing a Seg Fund Contract Investment Details record,
208300021001      *****  bypass it.
208400021001      *****
208500021001
208600021001           MOVE MFASTMTFP-SECTION     TO SEG-FUND-CONTRACT-INVESTMENT.
208700021001           ADD 1                      TO WS-STMT-DTA-BCNT-43.
208800021001           GO TO GCR-0090.
208900021001
209000021002       GCR-0060-0050.
209100021001
209200021001      *****
209300021001      *****  Processing a ANNUITANT DETAILS record, bypass it.
209400021001      *****
209500021001
209600021001           MOVE MFASTMTFP-SECTION     TO ANNUITANT-DETAILS.
209700021001           ADD 1                      TO WS-STMT-DTA-BCNT-45.
209800021001           GO TO GCR-0090.
209900021001
210000021001       GCR-0070.
210100021001
210200021001      *****
210300021001      *****    Processing a Rollover record, bypass it.
210400021001      *****
210500021001
210600021001           MOVE MFASTMTFP-SECTION      TO  ROLLOVER-SECTION.
210700021001           ADD 1                       TO  WS-STMT-DTA-BCNT-50.
210800021001           GO TO GCR-0090.
210900021001
211000021001       GCR-0070-0010.
211100021001
211200021001      *****
211300021001      *****    Processing a RRIF Detail record, bypass it.
211400021001      *****
211500021001
211600021001           MOVE MFASTMTFP-SECTION      TO  RRIF-DETAIL-SECTION.
211700021001           ADD 1                       TO  WS-STMT-DTA-BCNT-60.
211800021001           GO TO GCR-0090.
211900021001
212000021001       GCR-0070-0015.
212100021001
212200021001      *****
212300021001      *****    Processing a RESP Detail record, bypass it.
212400021001      *****
212500021001
212600021001           MOVE MFASTMTFP-SECTION      TO  RESP-DETAIL-SECTION.
212700021001           ADD 1                       TO  WS-STMT-DTA-BCNT-62.
212800021001           GO TO GCR-0090.
212900021001
213000091125      *RFS69515 Begin
213100091125       GCR-0070-0016.
213200091125
213300091125      *****
213400091125      *****    Processing a RDSP Detail record, bypass it.
213500091125      *****
213600091125
213700091125           MOVE MFASTMTFP-SECTION      TO  RDSP-DETAIL-SECTION.
213800091125           ADD 1                       TO  WS-STMT-DTA-BCNT-63.
213900091125           GO TO GCR-0090.
214000091125
214100091125      *RFS69515 End
214200021001       GCR-0070-0018.
214300021001
214400021001      *****
214500021001      *****    Processing a BENEFICIARY INFORMATION record, bypass it.
214600021001      *****
214700021001
214800021001           MOVE MFASTMTFP-SECTION      TO  BENEFICIARY-INFORMATION.
214900021001           ADD 1                       TO  WS-STMT-DTA-BCNT-67.
215000021001           GO TO GCR-0090.
215100021001
215200021001       GCR-0070-0020.
215300021001
215400021001      *****
215500021001      *****    Processing a Systematic Plan Info record, bypass it.
215600021001      *****
215700021001
215800021001           MOVE MFASTMTFP-SECTION      TO  SYSTEMATIC-PLAN-INFO-SECTION.
215900021001           ADD 1                       TO  WS-STMT-DTA-BCNT-70.
216000021001           GO TO GCR-0090.
216100021001
216200021001       GCR-0080.
216300021001
216400021001      *****
216500021001      *****    Processing an Account Transaction record, select it.
216600021001      *****
216700021001
216800021001           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-TXN-SECTION.
216900021001           ADD 1                       TO  WS-STMT-DTA-SCNT-80.
217000021001           GO TO GCR-0100.
217100021001
217200021001       GCR-0080-0010.
217300021001
217400021001      *****
217500021001      *****    Processing an Account Transaction Institution Detail
217600021001      *****    record, bypass it.
217700021001      *****
217800021001
217900021001           MOVE MFASTMTFP-SECTION      TO  AT-INSTITUTION-DETAIL-SECTION.
218000021001           ADD 1                       TO  WS-STMT-DTA-BCNT-82.
218100021001           GO TO GCR-0090.
218200021001
218300021001       GCR-0080-0020.
218400021001
218500021001      *****
218600021001      *****    Processing an RESP Account transaction beneficiary
218700021001      *****    record. The record will be selected.
218800021001      *****
218900021001
219000021001           MOVE MFASTMTFP-SECTION      TO  AT-RESP-DETAIL-SECTION
219100021001
219200021003      *    IF WS-LDA-RESP-84 IS EQUAL TO "Y"
219300021003      *       ADD 1          TO  WS-STMT-DTA-SCNT-84
219400021003      *       GO TO GCR-0100.
219500021001
219600021001           ADD 1             TO  WS-STMT-DTA-BCNT-84.
219700021001           GO TO GCR-0090.
219800021001
219900021002       GCR-0080-0030.
220000021001
220100021001      *****
220200021001      *****    Processing an RESET CONTRACT DETAILS record, bypass it.
220300021001      *****
220400021001
220500021001           MOVE MFASTMTFP-SECTION      TO  RESET-CONTRACT-DETAILS.
220600021001           ADD 1                       TO  WS-STMT-DTA-BCNT-90.
220700021001           GO TO GCR-0090.
220800021001
220900021001       GCR-0090.
221000021001
221100021001      *****
221200021001      *****    The record is to be bypassed.  Therefore, return to read
221300021001      *****    the next record.
221400021001      *****
221500021001
221600021001           GO TO GCR-0010.
221700021001
221800021001       GCR-0100.
221900021001
222000021001      *****
222100021001      *****    The record has been selected and is to be processed.
222200021001      *****    Format the current controls.
222300021001      *****
222400021001
222500021001           IF PR-START-DATE = SPACES
222600021001              MOVE ZEROES   TO PR-START-DATE
222700021001           END-IF
222800021001
222900021001           IF PR-END-DATE   = SPACES
223000021001              MOVE ZEROES   TO PR-END-DATE
223100021001           END-IF
223200021001
223300021001           MOVE PR-START-DATE          TO  CURR-START-DATE.
223400021001           MOVE PR-END-DATE            TO  CURR-END-DATE.
223500021001           MOVE PR-INVESTOR-NO         TO  CURR-INVESTOR-NO.
223600021001           MOVE PR-ACCOUNT             TO  CURR-ACCOUNT.
223700021001
223800021001      **********
223900021001
224000021001       GCR-EXIT.
224100021001           EXIT.
224200021001
224300021001      **********
224400021001
224500021001      /
224600021001       DETAIL-PROCESS-RTN.
224700021001
224800021001      ******************************************************************
224900021001      *                                                                *
225000021001      *    D E T A I L   P R O C E S S   R O U T I N E                 *
225100021001      *                                                                *
225200021001      ******************************************************************
225300021001
225400021001      *****
225500021001      *****    If an error was detected in a re-initialization routine,
225600021001      *****    bypass processing the record.
225700021001      *****
225800021001
225900021001           IF  WS-L01BYP-SW   IS EQUAL TO  "Y"
226000021001               GO TO DPR-EXIT
226100021001           END-IF
226200021001
226300021001      *****
226400021001      *****    Process the Statement Data record depending on the
226500021001      *****    section number.  If it cannot be identified, an error
226600021001      *****    message will be printed and the record bypassed.  If
226700021001      *****    this occurs, we have a real problem since the GET CURRENT
226800021001      *****    RECORD routine should have bypassed the record.
226900021001      *****
227000021001
227100021001           EVALUATE PR-SECTION-NO
227200021001             WHEN "01"
227300021001               GO TO DPR-0010
227400021001             WHEN "05"
227500021001               GO TO DPR-0020
227600021001             WHEN "10"
227700021001               GO TO DPR-0020-0010
227800021001             WHEN "20"
227900021001               GO TO DPR-0030
228000130408117038       WHEN "22"
228100130408117038         GO TO DPR-EXIT
228200021002             WHEN "25"
228300021002               GO TO DPR-0055
228400021001             WHEN "80"
228500021001               GO TO DPR-0060
228600021001             WHEN "84"
228700021001               GO TO DPR-0065
228800021001             WHEN OTHER
228900021001                  MOVE SPACES                 TO  ERROR-LINE-1
229000021001                  SET MSG                     TO  2
229100021001                  PERFORM PRINT-ERR-LINE      THRU PEL-EXIT
229200021001                  GO TO DPR-EXIT
229300021001           END-EVALUATE.
229400021001
229500021001       DPR-0010.
229600021001
229700021001      *****
229800021001      *****    Processing an Investor Information record.  Simply
229900021001      *****    indicate that one has been found for the account, then
230000021001      *****    exit.
230100021001      *****
230200021001
230300021001           IF WS-LDA-INV-ACC-FLAG IS EQUAL TO "N"
230400021001           OR WS-STMTVRSN         IS EQUAL TO  3
230500021001              GO TO DPR-0010-0000
230600021001           END-IF
230700021001
230800021001           IF WS-II-LST NOT LESS THAN WS-II-MAX
230900021001              MOVE SPACES TO ERROR-LINE-1
231000021001              SET MSG     TO 4
231100021001              PERFORM PRINT-ERR-LINE THRU PEL-EXIT
231200021001              GO TO DPR-EXIT
231300021001           END-IF
231400021001
231500021001           ADD 1      TO WS-II-LST.
231600021001           SET II     TO WS-II-LST.
231700021001           MOVE INVESTOR-INFO-SECTION TO WS-INVESTOR-INFO (II).
231800021001           MOVE "Y"                    TO  WS-STMT-DTA-SW-01.
231900021001           GO TO DPR-EXIT.
232000021001
232100021001       DPR-0010-0000.
232200021001
232300021001           MOVE "Y"                    TO  WS-STMT-DTA-SW-01.
232400021001           GO TO DPR-EXIT.
232500021001
232600021001       DPR-0020.
232700021001
232800021001      *****
232900021001      *****    Processing a Dealer record.  Simply indicate that one has
233000021001      *****    been found for the account, then exit.
233100021001      *****
233200021001
233300021002           IF WS-DI-LST NOT LESS THAN WS-DI-MAX
233400021001              MOVE SPACES TO ERROR-LINE-1
233500021001              SET MSG     TO 4
233600021001              PERFORM PRINT-ERR-LINE THRU PEL-EXIT
233700021001              GO TO DPR-EXIT
233800021001           END-IF
233900021001
234000021001           ADD 1      TO WS-DI-LST.
234100021001           SET DI     TO WS-DI-LST.
234200021001
234300021001           MOVE DEALER-SECTION         TO  WS-DEALER-INFO (DI).
234400021001
234500021001           MOVE "Y"                    TO  WS-STMT-DTA-SW-05.
234600021001           GO TO DPR-EXIT.
234700021001
234800021001       DPR-0020-0010.
234900021001
235000021001      *****
235100021001      *****    Processing an Investor Summary record.  Store the Account
235200021001      *****    information for Nominee and Registered Contribution.  If
235300021001      *****    the table is full, an error message will be printed and
235400021001      *****    the account will not be formatted.  If this occurs, the
235500021001      *****    table occurrence should be increased.  Remember to udpate
235600021001      *****    the setting of WS-SIA-MAX in INITIAL-LOGIC.
235700021001      *****
235800021001
235900021001           IF  WS-SIA-LST   NOT LESS THAN  WS-SIA-MAX
236000021001               MOVE SPACES             TO  ERROR-LINE-1
236100021001               SET MSG                 TO  11
236200021001               PERFORM PRINT-ERR-LINE THRU PEL-EXIT
236300021001               GO TO DPR-0020-0060
236400021001           END-IF
236500021001
236600021001           IF  WS-SIA-LST     IS EQUAL TO  ZEROES
236700021001               SET SIA                 TO  1
236800021001               GO TO DPR-0020-0050
236900021001           END-IF
237000021001
237100021001           SET SIA                     TO  WS-SIA-LST.
237200021001           IF  IS-ACCOUNT2   GREATER THAN  WS-SIA-ACCT (SIA)
237300021001               SET SIA              UP BY  1
237400021001               GO TO DPR-0020-0050
237500021001           END-IF
237600021001
237700021001           SET SIA                     TO  1.
237800021001
237900021001       DPR-0020-0020.
238000021001
238100021001           IF  IS-ACCOUNT2   IS LESS THAN  WS-SIA-ACCT (SIA)
238200021001               GO TO DPR-0020-0030
238300021001           END-IF
238400021001
238500021001           SET SIA                  UP BY  1.
238600021001
238700021001           IF  SIA    IS NOT GREATER THAN  WS-SIA-LST
238800021001               GO TO DPR-0020-0020
238900021001           END-IF.
239000021001
239100021001       DPR-0020-0030.
239200021001
239300021001           SET SIA1                    TO  WS-SIA-LST.
239400021001           SET SIA2                    TO  WS-SIA-LST.
239500021001           SET SIA2                    UP BY  1.
239600021001
239700021001       DPR-0020-0040.
239800021001
239900021001           IF  SIA1      IS NOT LESS THAN  SIA
240000021001               MOVE WS-SIA-ENT (SIA1)  TO  WS-SIA-ENT (SIA2)
240100021001               SET SIA1           DOWN BY  1
240200021001               SET SIA2           DOWN BY  1
240300021001               GO TO DPR-0020-0040
240400021001           END-IF.
240500021001
240600021001       DPR-0020-0050.
240700021001
240800021001           MOVE IS-ACCOUNT2            TO  WS-SIA-ACCT (SIA).
240900021001           MOVE IS-DEALER-ACCOUNT-NO   TO  WS-SIA-DLRACCTNO (SIA).
241000021001
241100021001           IF IS-NOMINEE               IS EQUAL TO  "Y"
241200021001              MOVE IS-NOMINEE-CODE     TO  WS-SIA-NOMCDE (SIA)
241300021001              MOVE IS-NOMINEE-NAME     TO  WS-SIA-NOMNAM (SIA)
241400021001              MOVE IS-NOMINEES-ACCT-NO TO  WS-SIA-NOMACCT (SIA)
241500021001           ELSE
241600021001              MOVE SPACES              TO  WS-SIA-NOMCDE (SIA)
241700021001              MOVE SPACES              TO  WS-SIA-NOMNAM (SIA)
241800021001              MOVE SPACES              TO  WS-SIA-NOMACCT (SIA)
241900021001           END-IF
242000021001
242100021001           MOVE IS-REG-CTB-CUR         TO  WS-SIA-REGCTB (SIA).
242200021001           MOVE IS-REG-CTB-CUR-SIGN    TO  WS-SIA-REGCTBSGN (SIA).
242300021007           MOVE IS-ENTERED-BY          TO  WS-SIA-ENTEREDBY (SIA).
242400021002           MOVE IS-MAILING-ADDRESS-INDICATOR
242500021001                                       TO  WS-SIA-MAIL-FLAG (SIA).
242600021001           ADD 1                       TO  WS-SIA-LST.
242700021001
242800021001       DPR-0020-0060.
242900021001
243000021001           GO TO DPR-EXIT.
243100021001
243200021001       DPR-0030.
243300021001
243400021001      *****
243500021001      *****    Processing an Account Detail record.  These records will
243600021001      *****    be processed, after the Account Transaction records have
243700021001      *****    been processed, by the LEVEL SUMMARIZATION 1 routine.
243800021001      *****    For now, accumulate the fund market value by currency and
243900021001      *****    store the data.  If the currency cannot be identified, an
244000021001      *****    error message will be printed and the record bypassed.
244100021001      *****    If this occurs, the program should be changed to handle
244200021001      *****    the new currency.  Remember to update the setting of
244300021001      *****    the setting of WS-SC-MAX in INITIAL-LOGIC.
244400021001      *****
244500021001
244600021001           SET SC                      TO  1.
244700021001
244800021001       DPR-0040.
244900021001
245000021001           IF  AD-CURRENCY    IS EQUAL TO  WS-SC-CURRENCY (SC)
245100021001               GO TO DPR-0050
245200021001           END-IF
245300021001
245400021001           IF  SC            IS LESS THAN  WS-SC-MAX
245500021001               SET SC               UP BY  1
245600021001               GO TO DPR-0040
245700021001           END-IF
245800021001
245900021001           MOVE SPACES                 TO  ERROR-LINE-1.
246000021001           SET MSG                     TO  3.
246100021001           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
246200021001           GO TO DPR-EXIT.
246300021001
246400021001       DPR-0050.
246500021001
246600021002      *****
246700021001      *****    GIC fund will be reported separately in confirm.
246800021001      *****    But, the values will be accumulated.
246900021001      *****
247000021001
247100021001           INITIALIZE WS-AT-FUND-CODE
247200021001                      WS-PRODUCT-TYPE-RULE.
247300021001
247400021001           MOVE AD-FUND-NO             TO  WS-AT-FUND-CODE.
247500021001
247600021001      *****
247700021001      *****    Search the account type table for the correct
247800021001      *****    account type rule.
247900021001      *****
248000021001
248100021001           SET IC                      TO  1.
248200021001
248300021001       DPR-0050-0010.
248400021001
248500021001           IF  WS-AT-INDUSTRY-CODE    IS EQUAL TO  WS-IC-FUND (IC)
248600021001               GO TO DPR-0050-0020
248700021001           END-IF
248800021001
248900021001           SET IC                   UP BY  1.
249000021001
249100021001           IF  IC     IS NOT GREATER THAN  WS-IC-LST
249200021001               GO TO DPR-0050-0010
249300021001           END-IF.
249400021001
249500021001       DPR-0050-0020.
249600021001
249700021001           MOVE WS-IC-RULE (IC)       TO  WS-PRODUCT-TYPE-RULE.
249800021001
249900021001           IF  AD-MARKET-VALUE-SIGN    IS EQUAL TO  SPACES
250000021001               ADD AD-MARKET-VALUE     TO  WS-SC-MARKET-VALUE (SC)
250100021001           ELSE
250200021001               SUBTRACT AD-MARKET-VALUE  FROM  WS-SC-MARKET-VALUE (SC)
250300021001           END-IF.
250400021001
250500021002       DPR-0050-0020-0000.
250600021001
250700021001           MOVE "Y"                    TO  WS-SC-RPTIND (SC).
250800021001
250900021001      *****
251000021001      *****    Format the fund in the Statement Account Fund table.  If
251100021001      *****    the table is full, an error message will be printed and
251200021001      *****    the record bypassed.  If this occurs, the program should
251300021001      *****    be changed to handle more funds for an account.  Remember
251400021001      *****    to update the setting of WS-SAF-MAX in INITIAL-LOGIC.
251500021001      *****
251600021001
251700021001           IF  WS-SAF-LST   NOT LESS THAN  WS-SAF-MAX
251800021001               MOVE SPACES             TO  ERROR-LINE-1
251900021001               SET MSG                 TO  4
252000021001               PERFORM PRINT-ERR-LINE THRU PEL-EXIT
252100021001               GO TO DPR-EXIT
252200021001           END-IF
252300021001
252400021001           ADD 1                       TO  WS-SAF-LST.
252500021001           SET SAF                     TO  WS-SAF-LST.
252600021001           MOVE AD-ACB-UNIT-PRICE      TO  WS-SAF-ACB-UNIT-PRICE (SAF).
252700021001           MOVE AD-ACB-UNIT-PRICE-SIGN TO  WS-SAF-ACB-UNIT-PRICE-SIGN
252800021001                                             (SAF).
252900021001           MOVE AD-CURRENCY            TO  WS-SAF-CURRENCY (SAF).
253000021001           MOVE AD-FUND-NO             TO  WS-SAF-FUND-NO (SAF).
253100021001           MOVE AD-INVESTMENT-NAME     TO  WS-SAF-INVESTMENT-NAME (SAF).
253200021001           MOVE AD-LAST-UNIT-PRICE     TO  WS-SAF-LAST-UNIT-PRICE (SAF).
253300021001           MOVE AD-LAST-UNIT-PRICE-SIGN
253400021001                                       TO  WS-SAF-LAST-UNIT-PRICE-SIGN
253500021001                                             (SAF).
253600021001           MOVE AD-MARKET-VALUE        TO  WS-SAF-MARKET-VALUE (SAF).
253700021001           MOVE AD-MARKET-VALUE-SIGN   TO  WS-SAF-MARKET-VALUE-SIGN
253800021001                                             (SAF).
253900021001           MOVE AD-NO-OF-UNITS         TO  WS-SAF-NO-OF-UNITS (SAF).
254000021001           MOVE AD-NO-OF-UNITS-SIGN    TO  WS-SAF-NO-OF-UNITS-SIGN
254100021001                                             (SAF).
254200021001
254300021001       DPR-0050-0030.
254400021001
254500021001           IF  WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "2"
254600021001           AND WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "7"
254700021001
254800021001               ADD 1                 TO WS-AFD-LST
254900021001               SET AFD               TO WS-AFD-LST
255000021001
255100021001               MOVE ACCOUNT-DETAILS-SECTION
255200021001                                     TO  WS-ACCOUNT-FUND-DETAILS (AFD)
255300021001               MOVE "Y"              TO WS-STMT-DTA-SW-20FUND
255400021001           END-IF
255500021001
255600021001           IF  WS-PRODUCT-TYPE-RULE  IS EQUAL TO "2"
255700021001
255800021001               ADD 1                 TO WS-AGD-LST
255900021001               SET AGD               TO WS-AGD-LST
256000021001
256100021001               MOVE ACCOUNT-DETAILS-SECTION
256200021001                                     TO  WS-ACCOUNT-GIC-DETAILS (AGD)
256300021001               MOVE "Y"              TO WS-STMT-DTA-SW-20GIC
256400021001           END-IF
256500021001
256600021001           IF  WS-PRODUCT-TYPE-RULE  IS EQUAL TO "7"
256700021001               ADD 1                 TO WS-ADID-LST
256800021001               SET ADID              TO WS-ADID-LST
256900021001
257000021001               MOVE ACCOUNT-DETAILS-SECTION
257100021001                                     TO WS-ACCOUNT-DII-DETAILS (ADID)
257200021001               MOVE "Y"              TO WS-STMT-DTA-SW-20DII
257300021001           END-IF
257400021001
257500021001           GO TO DPR-EXIT.
257600021001
257700021001       DPR-0055.
257800021001
257900021001      *****
258000021001      *****    Processing an Account GIC Details record.  Simply
258100021001      *****    indicate that one has been found for the account,
258200021001      *****    then exit.
258300021001      *****
258400021001
258500021001           IF WS-GIC-LST NOT LESS THAN WS-GIC-MAX
258600021001              MOVE SPACES TO ERROR-LINE-1
258700021001              SET MSG     TO 4
258800021001              PERFORM PRINT-ERR-LINE THRU PEL-EXIT
258900021001              GO TO DPR-EXIT
259000021001           END-IF
259100021001
259200021001           ADD 1      TO WS-GIC-LST.
259300021001           SET GIC    TO WS-GIC-LST.
259400021001
259500021001           MOVE ACCOUNT-GIC-DETAILS-SECTION TO  WS-GIC-INFO (GIC).
259600021001           MOVE "Y"                    TO  WS-STMT-DTA-SW-25.
259700021001           GO TO DPR-EXIT.
259800021001
259900021001       DPR-0060.
260000021001
260100021001      *****
260200021001      *****    Processing an Account Transaction record.  These records
260300021001      *****    will be processed using the MLS programming techniques,
260400021001      *****    without the performs.  The current and previous controls
260500021001      *****    have been initialized in the LEVEL REINITIALIZATION 1
260600021001      *****    routine and the records have been read in the GET CURRENT
260700021001      *****    routine.  Therefore, the first step will be to format the
260800021001      *****    current statement transaction controls.
260900021001      *****
261000021001
261100021001           MOVE AT-FUND-NO             TO  CURR-CD-FUND-NO.
261200021001
261300021001      *****
261400021001      *****    GIC transactions will not be reported in confirm.
261500021001      *****
261600021001
261700021003           INITIALIZE WS-AT-FUND-CODE
261800021001                      WS-PRODUCT-TYPE-RULE.
261900021001
262000021001           MOVE AT-FUND-NO             TO  WS-AT-FUND-CODE.
262100021001
262200021001      *****
262300021001      *****    Search the account type table for the correct
262400021001      *****    account type rule.
262500021001      *****
262600021001
262700021001           SET IC                      TO  1.
262800021001           IF  WS-IC-LST        IS NOT GREATER THAN  ZEROES
262900021001               GO TO DPR-0060-0050
263000021001           END-IF.
263100021001
263200021001       DPR-0060-0010.
263300021001
263400021001           IF  WS-AT-INDUSTRY-CODE    IS EQUAL TO  WS-IC-FUND (IC)
263500021001               GO TO DPR-0060-0020
263600021001           END-IF
263700021001
263800021001           SET IC                   UP BY  1.
263900021001
264000021001           IF  IC     IS NOT GREATER THAN  WS-IC-LST
264100021001               GO TO DPR-0060-0010
264200021001           END-IF.
264300021001
264400021001       DPR-0060-0020.
264500021001
264600021010           IF  II-LANGUAGE-CODE  EQUAL TO  "F"
264700021010               SET ICL                 TO  2
264800021010           ELSE
264900021010               SET ICL                 TO  1
265000021010           END-IF.
265100021009
265200021001           MOVE WS-IC-RULE (IC)       TO  WS-PRODUCT-TYPE-RULE.
2653000210021002       MOVE WS-IC-NAME (IC, ICL)  TO  WS-INVESTMENT-NAME-SH.
265400021001
265500021001           IF WS-PRODUCT-TYPE-RULE  IS EQUAL TO "2"
265600021001              GO TO DPR-EXIT
265700021001           END-IF.
265800021001
265900021001       DPR-0060-0050.
266000021001
266100021001      *****
266200021001      *****    Determine if this is a new FUND being processed for the
266300021001      *****    account.
266400021001      *****
266500021001
266600021003           IF PREV-CD-LEV1   IS EQUAL TO  CURR-CD-LEV1
2667000210031003          MOVE SPACES                TO  WS-INVESTMENT-NAME-SH
266800021003              GO TO DPR-0120
266900021001           END-IF
267000021001
267100021001      *****
267200021001      *****    A new fund is being processed.  If this is the first fund
267300021001      *****    for the account, bypass the summary logic.
267400021001      *****
267500021001
267600021001           IF  PREV-CTLS-DPR  IS EQUAL TO  LOW-VALUES
267700021001               GO TO DPR-0070
267800021001           END-IF
267900021001
268000021001      *****
268100021001      *****    Place the fund summary logic here.  Currently, the only
268200021001      *****    processing required is to print a blank line.  Please
268300021001      *****    note that if the statement page is full, the blank line
268400021001      *****    is not formatted.  The next Account Transaction or the
268500021001      *****    Account Summary will skip to the new page, if required.
268600021001      *****
268700021001
268800021001           IF  SPL           IS LESS THAN  WS-SPL-DTLLST
268900021001               SET SPL              UP BY  1
269000021001           END-IF.
269100021001
269200021001       DPR-0070.
269300021001
269400021001      *****
269500021001      *****    Normally, MLS checks the current controls to determine if
269600021001      *****    processing is complete.  Since the Account Transactions
269700021001      *****    are read in the GET CURRENT RECORD routine, this will be
269800021001      *****    done by the normal MLS and will not be required here.
269900021001      *****    Therefore, place the fund re-initialization logic here.
270000021001      *****    Verify that an Account Detail has been read for the fund.
270100021001      *****    If one has not been, a warning message will be printed
270200021001      *****    and the record will be processed as normal.  If this
270300021001      *****    occurs, the program that creates the Statement Data file
270400021001      *****    should be reviewed.
270500021001      *****
270600021001
270700021001           SET SAF                     TO  1.
270800021001
270900021001           IF  SAF        IS GREATER THAN  WS-SAF-LST
271000021001               GO TO DPR-0090
271100021001           END-IF.
271200021001
271300021001       DPR-0080.
271400021001
271500021001           IF  CURR-CD-FUND-NO   EQUAL TO  WS-SAF-FUND-NO (SAF)
271600021001               GO TO DPR-0100
271700021001           END-IF
271800021001
271900021001           IF  SAF           IS LESS THAN  WS-SAF-LST
272000021001               SET SAF              UP BY  1
272100021001               GO TO DPR-0080
272200021001           END-IF.
272300021001
272400021001       DPR-0090.
272500021001
272600021001           MOVE SPACES                 TO  ERROR-LINE-1.
272700021001           SET MSG                     TO  5.
272800021001           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
272900021001
273000021001       DPR-0100.
273100021001
273200021001      *****
273300021001      *****    Format the Investment Name.  If this line and at least
273400021001      *****    one transaction line cannot be printed on the current
273500021001      *****    page, process this page and start a subsequent page.
273600021001      *****
273700021001
273800021001           MOVE SPACES                 TO  STMT-DTL-01.
273900021001
274000021001       DPR-0100-0010.
274100021001
274200021001           SET WS-SPL-DTLTST           TO  SPL.
274300021001
274400021001           IF  (WS-SPL-DTLTST           +  3)
274500021001                      IS NOT GREATER THAN  WS-SPL-DTLLST
274600021001               GO TO DPR-0120
274700021001           END-IF
274800021001
274900021001           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
275000021001
275100021001           IF  WS-PSRERR-SW  NOT EQUAL TO  SPACES
275200021001               GO TO DPR-EXIT
275300021001           END-IF.
275400021003
275500021001       DPR-0120.
275600021001
275700021001      *****
275800021001      *****    Place the detail processing logic here.  The Account
275900021001      *****    Transaction record is to be processed depending on the
276000021001      *****    Transaction Type Code.
276100021001      *****
276200021001
276300021002           IF WS-STMTVRSN              IS EQUAL TO  "F"
276400021002              MOVE AT-TRADE-DATE          TO  WS-TRADE-DATE
276500021002              MOVE AT-PROCESS-DATE        TO  WS-PROCESS-DATE
276600021002              MOVE  AT-TRANS-TYPE-CODE       TO WS-TRANS-TYPE
276700021002              COMPUTE WS-NO-OF-UNITS  ROUNDED  = AT-NO-OF-UNITS
276800021002              MOVE AT-NO-OF-UNITS-SIGN       TO WS-NO-OF-UNITS-SIGN
276900021002              COMPUTE WS-UNIT-BALANCE ROUNDED  = AT-UNIT-BALANCE
277000021002              MOVE AT-UNIT-BALANCE-SIGN      TO WS-UNIT-BALANCE-SIGN
277100021002
277200021002              IF WS-NO-OF-UNITS           IS EQUAL TO ZEROS
277300021002                 COMPUTE WS-NO-OF-UNITS    = 1
277400021002              END-IF
277500021002
277600021002              IF PURCHASE-TRANSACTION
277700021002                 COMPUTE WS-SETTL-AMT = AT-GROSS
277800021002                 MOVE AT-GROSS-SIGN          TO WS-SETTL-AMT-SIGN
277900021002                 MOVE AT-GROSS-SIGN          TO WS-UNIT-PRICE-SIGN
278000021002                 COMPUTE WS-UNIT-PRICE ROUNDED  = AT-GROSS
278100021002                                                / WS-NO-OF-UNITS
278200021002              END-IF
278300021002
278400021002              IF REDEMPTION-TRANSACTION
278500021002                 COMPUTE WS-SETTL-AMT = AT-NET
278600021002                 MOVE AT-NET-SIGN            TO WS-SETTL-AMT-SIGN
278700021015                 MOVE SPACES                 TO WS-UNIT-PRICE-SIGN
278800021002                 COMPUTE WS-UNIT-PRICE ROUNDED  = AT-NET
278900021002                                                / WS-NO-OF-UNITS
279000021002              END-IF
279100021002           END-IF.
279200021002
279300021001           IF  AT-TRANS-TYPE-CODE      IS EQUAL TO  "BFW"
279400021001               GO TO DPR-0130
279500021001           END-IF
279600021001
279700021001           IF  AT-TRANS-TYPE-CODE      IS EQUAL TO  "BCL"
279800021001               GO TO DPR-0130-0010
279900021001           END-IF
280000021001
280100021001           GO TO DPR-0140.
280200021001
280300021001       DPR-0130.
280400021001
280500021001      *****
280600021001      *****    Processing a BALANCE FORWARD transaction.  Format the
280700021001      *****    detail line.
280800021001      *****
280900021001
281000021001           MOVE SPACES                 TO  STMT-DTL-02.
281100021001
281200021002           IF WS-STMTVRSN              IS EQUAL TO  "F"
281300021002              MOVE WS-INVESTMENT-NAME-SH  TO  SD02V5-INVESTMENT-NAME
281400021002              MOVE AT-TRANS-TYPE          TO  SD02V5-TRANS-TYPE
281500021011      *       MOVE WS-SETTL-AMT           TO  SD02V5-GROSS
281600021011      *       MOVE WS-SETTL-AMT-SIGN      TO  SD02V5-GROSS-SIGN
281700021011      *       MOVE WS-UNIT-PRICE          TO  SD02V5-UNIT-PRICE
281800021011      *       MOVE WS-UNIT-PRICE-SIGN     TO  SD02V5-UNIT-PRICE-SIGN
281900021011      *       MOVE WS-NO-OF-UNITS         TO  SD02V5-NO-OF-UNITS
282000021011      *       MOVE WS-NO-OF-UNITS-SIGN    TO  SD02V5-NO-OF-UNITS-SIGN
282100021002              MOVE WS-UNIT-BALANCE        TO  SD02V5-UNIT-BALANCE
282200021002              MOVE WS-UNIT-BALANCE-SIGN   TO  SD02V5-UNIT-BALANCE-SIGN
282300021002              GO TO DPR-0130-0000-0010
282400021002           END-IF.
282500021002
282600021001       DPR-0130-0000-0010.
282700021001
282800021001           GO TO DPR-0150.
282900021001
283000021001       DPR-0130-0010.
283100021001
283200021001      *****
283300021001      *****    Processing a BALANCE CLOSING transaction.  Format the
283400021001      *****    detail line.
283500021001      *****
283600021001
283700021001           MOVE SPACES                 TO  STMT-DTL-02.
283800021001
283900021002           IF WS-STMTVRSN              IS EQUAL TO  "F"
284000021002              MOVE WS-INVESTMENT-NAME-SH  TO  SD02V5-INVESTMENT-NAME
284100021002              MOVE WS-TRADE-DATE-DD       TO  SD02V5-TRADE-DATE-DD
284200021002              MOVE "/"                    TO  SD02V5-LIT1
284300021002              MOVE WS-TRADE-DATE-MM       TO  SD02V5-TRADE-DATE-MM
284400021002              MOVE "/"                    TO  SD02V5-LIT2
284500021002              MOVE WS-TRADE-DATE-CCYY     TO  SD02V5-TRADE-DATE-YY
284600021002              MOVE WS-PROCESS-DATE-DD     TO  SD02V5-SETTL-DATE-DD
284700021002              MOVE "/"                    TO  SD02V5-LIT3
284800021002              MOVE WS-PROCESS-DATE-MM     TO  SD02V5-SETTL-DATE-MM
284900021002              MOVE "/"                    TO  SD02V5-LIT4
285000021002              MOVE WS-PROCESS-DATE-CCYY   TO  SD02V5-SETTL-DATE-YY
285100021002              MOVE AT-TRANS-TYPE          TO  SD02V5-TRANS-TYPE
285200021011      *       MOVE WS-SETTL-AMT           TO  SD02V5-GROSS
285300021011      *       MOVE WS-SETTL-AMT-SIGN      TO  SD02V5-GROSS-SIGN
285400021011      *       MOVE WS-UNIT-PRICE          TO  SD02V5-UNIT-PRICE
285500021011      *       MOVE WS-UNIT-PRICE-SIGN     TO  SD02V5-UNIT-PRICE-SIGN
285600021011      *       MOVE WS-NO-OF-UNITS         TO  SD02V5-NO-OF-UNITS
285700021011      *       MOVE WS-NO-OF-UNITS-SIGN    TO  SD02V5-NO-OF-UNITS-SIGN
285800021002              MOVE WS-UNIT-BALANCE        TO  SD02V5-UNIT-BALANCE
285900021002              MOVE WS-UNIT-BALANCE-SIGN   TO  SD02V5-UNIT-BALANCE-SIGN
286000021002              GO TO DPR-0130-0020
286100021002           END-IF.
286200021001
286300021001       DPR-0130-0020.
286400021001
286500021001           GO TO DPR-0150.
286600021001
286700021001       DPR-0140.
286800021001
286900021001      *****
287000021001      *****    Processing a transaction other than a BALANCE FORWARD or
287100021001      *****    BALANCE CLOSING.  Format the detail line.
287200021001      *****
287300021001
287400021001           IF WS-AT-RULE (AT1)            IS EQUAL TO "4"
287500021001           AND ( AT-TRANS-TYPE-CODE       IS EQUAL TO "BUY"
287600021001                 OR AT-TRANS-TYPE-CODE    IS EQUAL TO "SEL"
287700021001                 OR AT-TRANS-TYPE-CODE    IS EQUAL TO "TRI"
287800021001                 OR AT-TRANS-TYPE-CODE    IS EQUAL TO "TRO")
287900021001                 MOVE AT-CONTR-REDEMP-DESCRIPTION
288000021001                                          TO AT-TRANS-TYPE
288100021002           END-IF.
288200021001
288300021001       DPR-0140-0050.
288400021001
288500021001           MOVE SPACES                 TO  STMT-DTL-02.
288600021001
288700021002           IF WS-STMTVRSN              IS EQUAL TO  "F"
288800021002              MOVE WS-INVESTMENT-NAME-SH  TO  SD02V5-INVESTMENT-NAME
288900021002              MOVE WS-TRADE-DATE-DD       TO  SD02V5-TRADE-DATE-DD
289000021002              MOVE "/"                    TO  SD02V5-LIT1
289100021002              MOVE WS-TRADE-DATE-MM       TO  SD02V5-TRADE-DATE-MM
289200021002              MOVE "/"                    TO  SD02V5-LIT2
289300021002              MOVE WS-TRADE-DATE-CCYY     TO  SD02V5-TRADE-DATE-YY
289400021002              MOVE WS-PROCESS-DATE-DD     TO  SD02V5-SETTL-DATE-DD
289500021002              MOVE "/"                    TO  SD02V5-LIT3
289600021002              MOVE WS-PROCESS-DATE-MM     TO  SD02V5-SETTL-DATE-MM
289700021002              MOVE "/"                    TO  SD02V5-LIT4
289800021002              MOVE WS-PROCESS-DATE-CCYY   TO  SD02V5-SETTL-DATE-YY
289900021001              MOVE AT-TRANS-TYPE          TO  SD02V5-TRANS-TYPE
290000021001              MOVE WS-SETTL-AMT           TO  SD02V5-GROSS
290100021001              MOVE WS-SETTL-AMT-SIGN      TO  SD02V5-GROSS-SIGN
290200021001              MOVE WS-UNIT-PRICE          TO  SD02V5-UNIT-PRICE
290300021001              MOVE WS-UNIT-PRICE-SIGN     TO  SD02V5-UNIT-PRICE-SIGN
290400021001              MOVE WS-NO-OF-UNITS         TO  SD02V5-NO-OF-UNITS
290500021001              MOVE WS-NO-OF-UNITS-SIGN    TO  SD02V5-NO-OF-UNITS-SIGN
290600021001              MOVE WS-UNIT-BALANCE        TO  SD02V5-UNIT-BALANCE
290700021001              MOVE WS-UNIT-BALANCE-SIGN   TO  SD02V5-UNIT-BALANCE-SIGN
290800021001              GO TO DPR-0140-9999
290900021001           END-IF.
291000021001
291100021001       DPR-0140-9999.
291200021001
291300021001           GO TO DPR-0150.
291400021001
291500021001       DPR-0065.
291600021001
291700021001           GO TO DPR-0150.
291800021001
291900021001       DPR-0150.
292000021001
292100021001      *****
292200021001      *****    If the transaction cannot be printed on the current page,
292300021001      *****    process the current page and start a subsequent page.
292400021001      *****                                                            e
292500021001
2926000210031003       SET WS-SPL-DTLTST           TO  SPL.
292700021003
292800021003           IF (WS-SPL-DTLTST + 2)  IS LESS THAN  WS-SPL-DTLLST
292900021003              GO TO DPR-0160
293000021003           END-IF.
293100021003
2932000210031003       MOVE SPACE                   TO  STMT-DTL-03.
293300021003           MOVE WS-CONTINUE-ON-LIT1-E   TO  SD03V5-CONTINUE-ON1.
293400021003           MOVE WS-CONTINUE-ON-LIT2-E   TO  SD03V5-CONTINUE-ON2.
293500021003
293600021003           SET SPL                      UP BY  1.
293700021003           MOVE STMT-DTL-03             TO  WS-STMTPGE-LNE (SPL).
293800021001
293900021001           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
294000021001
294100021001           IF  WS-PSRERR-SW  NOT EQUAL TO  SPACES
294200021001               GO TO DPR-EXIT
294300021001           END-IF.
294400021001
2945000210031003       MOVE SPACE                     TO  STMT-DTL-04.
294600021003           MOVE WS-CONTINUE-FROM-LIT1-E   TO  SD04V5-CONTINUE-FROM1.
294700021003           MOVE WS-CONTINUE-FROM-LIT2-E   TO  SD04V5-CONTINUE-FROM2.
294800021003
294900021003           MOVE STMT-DTL-04               TO  WS-STMTPGE-LNE (SPL).
295000021003
295100021001       DPR-0160.
295200021001
295300021001           IF PR-SECTION-NO            IS EQUAL TO 80
295400021003              SET SPL                     UP BY  1
295500021001              MOVE STMT-DTL-02            TO  WS-STMTPGE-LNE (SPL)
295600021001              GO TO DPR-0170
295700021001           END-IF
295800021001
295900021001           SET SPL                     UP BY 6
296000021001           IF SPL                      IS LESS THAN WS-SPL-DTLLST
296100021001              SET SPL                  DOWN BY 6
296200021001           ELSE
296300021001              PERFORM PRINT-STMT-RTN   THRU PSR-EXIT
296400021001              IF WS-PSRERR-SW          IS NOT EQUAL TO SPACES
296500021001                 GO TO DPR-EXIT
296600021001              END-IF
296700021002           END-IF.
296800021001
296900021001
297000021001       DPR-0170.
297100021001
297200021001      *****
297300021001      *****    The Account Transaction has been completely processed.
297400021001      *****    Update the previous statement transaction controls and
297500021001      *****    exit.  The next, if any, Account Transaction will be read
297600021001      *****    by the GET CURRENT RECORD routine.
297700021001      *****
297800021001
297900021001           MOVE CURR-CTLS-DPR          TO  PREV-CTLS-DPR.
298000021001
298100021001      **********
298200021001
298300021001       DPR-EXIT.
298400021001           EXIT.
298500021001
298600021001      **********
298700021001
298800021001      /
298900021001       LEVEL-SUMMARY-1.
299000021001
299100021001      ******************************************************************
299200021001      *                                                                *
299300021001      *    L E V E L   S U M M A R I Z A T I O N   1   R O U T I N E   *
299400021001      *                                                                *
299500021001      *        ACCOUNT:                Account                         *
299600021001      *                                                                *
299700021001      ******************************************************************
299800021001
299900021001
300000021001      *****
300100021001      *****    If Account is zeroes, bypass this routine.
300200021001      *****
300300021001
300400021001           IF  PREV-ACCOUNT   IS EQUAL TO  ZEROES
300500021001              GO TO LS1-EXIT.
300600021001
300700021001      *****
300800021001      *****    If an error was detected by the LEVEL REINITIALIZATION 1
300900021001      *****    routine, bypass this routine.
301000021001      *****
301100021001
301200021001           IF  WS-L01BYP-SW   IS EQUAL TO  "Y"
301300021001               GO TO LS1-EXIT.
301400021001
301500021007           IF  WS-LDA-SUM-SUPPRESS-FLAG  IS EQUAL TO "Y"
301600021007               GO TO LS1-0160-3.
301700021001
301800021002           IF WS-STMTVRSN              IS EQUAL TO  "F"
301900021001              GO TO LS1-0160-3
302000021001           END-IF.
302100021001
302200021001       LS1-0160-3.
302300021001
302400021001      *****
302500021001      *****    Process the current page.
302600021001      *****
302700021001
302800021001           MOVE SPACES TO US-TABLE.
302900021001           PERFORM PRINT-STMT-RTN     THRU PSR-EXIT.
303000021001           IF  WS-PSRERR-SW  NOT EQUAL TO  SPACES
303100021001               GO TO LS1-EXIT.
303200021001
303300021001           CONTINUE.
303400021001
303500021001       LS1-EXIT.
303600021001           EXIT.
303700021001      /
303800021001       PRINT-STMT-RTN.
303900021001
304000021001      ******************************************************************
304100021001      *                                                                *
304200021001      *    P R I N T   S T A T E M E N T   R O U T I N E               *
304300021001      *                                                                *
304400021001      ******************************************************************
304500021001
304600021001      *****
304700021001      *****    If the Statement Print Header record has not been
304800021001      *****    created, create it.  The record was formatted in the
304900021001      *****    LEVEL REINITIALIZATION 1 routine.
305000021001      *****
305100021001
305200021001           MOVE SPACES                 TO  WS-PSRERR-SW.
305300021001
305400021001           IF WS-STMT-PRT-HDR-WSW      IS EQUAL TO  "Y"
305500021001              GO TO PSR-0010
305600021001           END-IF
305700021001
305800021001           WRITE STMT-PRT-HDR-RECD
305900021001               INVALID KEY
306000021001                   MOVE "H"            TO  WS-PSRERR-SW
306100021001                   GO TO PSR-9999.
306200021001
306300021001           ADD 1                       TO  WS-STMT-PRT-HDR-WCNT.
306400021001           MOVE "Y"                    TO  WS-STMT-PRT-HDR-WSW.
306500021001
306600021001       PSR-0010.
306700021001
306800021001      *****
306900021001      *****    Format and print the Statement Print Detail records.  One
307000021001      *****    record will be created for each statement line.  If the
307100021001      *****    statement line is spaces, no record will be created.
307200021001      *****
307300021001
307400021001           SET SPL                     TO  1.
307500021001
307600021001       PSR-0020.
307700021001
307800021001           IF WS-STMTPGE-LNE (SPL)     IS EQUAL TO  SPACES
307900021001              GO TO PSR-0030
308000021001           END-IF
308100021001
308200021001           MOVE SPACES                 TO  STMT-PRT-DTL-RECD.
308300021001           MOVE INVESTOR-NO OF STMT-PRT-HDR-RECD
308400021001                            TO  INVESTOR-NO OF STMT-PRT-DTL-RECD.
308500021001           MOVE ACCOUNT
308600021001                OF STMT-PRT-HDR-RECD   TO  ACCOUNT
308700021001                                           OF STMT-PRT-DTL-RECD.
308800021001           MOVE LANGUAGE-CODE
308900021001                OF STMT-PRT-HDR-RECD   TO  LANGUAGE-CODE
309000021001                                           OF STMT-PRT-DTL-RECD.
309100021001           MOVE DEALER
309200021001                OF STMT-PRT-HDR-RECD   TO  DEALER
309300021001                                           OF STMT-PRT-DTL-RECD.
309400021001           MOVE DEALER-REP-CODE
309500021001                OF STMT-PRT-HDR-RECD   TO  DEALER-REP-CODE
309600021001                                           OF STMT-PRT-DTL-RECD.
309700021001           MOVE WS-SH-PGENO            TO  STMPGENO
309800021001                                           OF STMT-PRT-DTL-RECD.
309900021001           SET STMLNENO
310000021001               OF STMT-PRT-DTL-RECD    TO  SPL.
310100021001           MOVE WS-STMTPGE-LNE (SPL)   TO  STMLNE
310200021001                                           OF STMT-PRT-DTL-RECD.
310300021001           MOVE START-DATE
310400021001                OF STMT-PRT-HDR-RECD   TO  START-DATE
310500021001                                           OF STMT-PRT-DTL-RECD.
310600021001           MOVE END-DATE
310700021001                OF STMT-PRT-HDR-RECD   TO  END-DATE
310800021001                                           OF STMT-PRT-DTL-RECD.
310900021001
311000021001           WRITE STMT-PRT-DTL-RECD
311100021001               INVALID KEY
311200021001                   MOVE "D"            TO  WS-PSRERR-SW
311300021001                   GO TO PSR-9999.
311400021001
311500021001           ADD 1                       TO  WS-STMT-PRT-DTL-WCNT.
311600021001
311700021001       PSR-0030.
311800021001
311900021001           IF SPL           IS LESS THAN  WS-SPL-MAX
312000021001              SET SPL              UP BY  1
312100021001              GO TO PSR-0020
312200021001           END-IF
312300021001
312400021001      *****
312500021001      *****    Format a new page for the account statement.
312600021001      *****
312700021001
312800021001           ADD 1                    TO  WS-SH-PGENO.
312900021001
313000021003           MOVE WS-SH-PGENO         TO  SH08V5-PGENO.
313100021001
313200021001       PSR-0040.
313300021001
313400021001           SET SPL                  TO  WS-SPL-SH02.
313500021003           MOVE STMT-HDG-08         TO  WS-STMTPGE-LNE (SPL).
313600021001
313700021001       PSR-0040-0010.
313800021001
313900021003      *    IF WS-STMTVRSN              IS EQUAL TO  3
314000021003      *       MOVE SPACES              TO  WS-STMTPGE-DTL-V3
314100021003      *    ELSE
314200021001              MOVE SPACES              TO  WS-STMTPGE-DTL
314300021003      *       IF WS-STMTVRSN              IS EQUAL TO  4
314400021003      *          MOVE SPACES              TO  WS-STMTPGE-DTL-V4
314500021003      *       END-IF
314600021001              IF  WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "7"
314700021001              AND WS-PRODUCT-TYPE-RULE  IS NOT EQUAL TO "2"
314800021001              AND PR-SECTION-NO            IS EQUAL TO 80
314900021007                  MOVE "N"             TO  WS-STMT-DTA-SW-80FUND
315000021001              ELSE
315100021007                  MOVE "N"             TO  WS-STMT-DTA-SW-80DII
315200021003              END-IF.
315300021003      *    END-IF.
315400021001
315500021001       PSR-0050.
315600021001
315700021001           SET SPL                     TO  WS-SPL-DTLFST.
315800021001
315900021001           GO TO PSR-EXIT.
316000021001
316100021001       PSR-9999.
316200021001
316300021001      *****
316400021001      *****    An error was detected attempting to write either a
316500021001      *****    Statement Print Header record or a Statement Print Detail
316600021001      *****    record.  An error message will be printed and the program
316700021001      *****    terminated.
316800021001      *****
316900021001
317000021001           IF  WS-PSRERR-SW   IS EQUAL TO  "H"
317100021001               SET MSG                 TO  6
317200021001             ELSE
317300021001               SET MSG                 TO  7.
317400021001
317500021001           MOVE SPACES                 TO  ERROR-LINE-1.
317600021001           MOVE INVESTOR-NO
317700021001                OF STMT-PRT-HDR-RECD   TO  EL1-INVESTOR-NO.
317800021001           MOVE ACCOUNT
317900021001                OF STMT-PRT-HDR-RECD   TO  EL1-ACCOUNT.
318000021001           MOVE LANGUAGE-CODE
318100021001                OF STMT-PRT-HDR-RECD   TO  EL1-LANGUAGE-CODE.
318200021001           MOVE DEALER
318300021001                OF STMT-PRT-HDR-RECD   TO  EL1-DEALER.
318400021001           MOVE DEALER-REP-CODE
318500021001                OF STMT-PRT-HDR-RECD   TO  EL1-DEALER-REP-CODE.
318600021001           MOVE WS-MSG (MSG)           TO  EL1-MSG.
318700021001           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
318800021001
318900021001           MOVE SPACES                 TO  ERROR-LINE-1.
319000021001           IF  WS-PSRERR-SW   IS EQUAL TO  "H"
319100021001               MOVE STMT-PRT-HDR-RECD  TO  ERROR-LINE-1
319200021001             ELSE
319300021001               MOVE STMT-PRT-DTL-RECD  TO  ERROR-LINE-1.
319400021001           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
319500021001
319600021001           MOVE SPACES                 TO  ERROR-LINE-1.
319700021001           MOVE WS-FILSTAT             TO  ERROR-LINE-1.
319800021001           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
319900021001
320000021001           PERFORM DUMP-ROUTINE       THRU DR-EXIT.
320100021001           MOVE HIGH-VALUES            TO  CURR-CONTROLS.
320200021001
320300021001       PSR-EXIT.
320400021001           EXIT.
320500021001      /
320600021001       DUMP-ROUTINE.
320700021001
320800021001      ******************************************************************
320900021001      *                                                                *
321000021001      *    D U M P   R O U T I N E                                     *
321100021001      *                                                                *
321200021001      ******************************************************************
321300021001
321400021001      *****
321500021001      *****    Produce a program dump for analysis.
321600021001      *****
321700021001
321800021001           CALL    "QLREXHAN"       USING  DUMP-ARGUMENTS.
321900021001
322000021001       DR-EXIT.
322100021001           EXIT.
322200021001      /
322300021001       LEVEL-SUMMARY-2.
322400021001
322500021001      ******************************************************************
322600021001      *                                                                *
322700021001      *    L E V E L   S U M M A R I Z A T I O N   2   R O U T I N E   *
322800021001      *                                                                *
322900021001      *        INVESTOR-NO:            Investor Number                 *
323000021001      *                                                                *
323100021001      ******************************************************************
323200021001
323300021001      *****
323400021001      *****    Null routine.
323500021001      *****
323600021001
323700021001           CONTINUE.
323800021001
323900021001       LS2-EXIT.
324000021001           EXIT.
324100021001      /
324200021001       LEVEL-REINIT-2.
324300021001
324400021001      ******************************************************************
324500021001      *                                                                *
324600021001      *    L E V E L   R E I N I T I A L I Z A T I O N   2   R T N .   *
324700021001      *                                                                *
324800021001      *        INVESTOR-NO:            Investor Number                 *
324900021001      *                                                                *
325000021001      ******************************************************************
325100021001
325200021001      *****
325300021001      *****    Indicate that the Investor Information record and the
325400021001      *****    Dealer record have not yet been read.
325500021001      *****
325600021001
325700021001           MOVE "N"                    TO  WS-STMT-DTA-SW-01.
325800021001           MOVE "N"                    TO  WS-STMT-DTA-SW-05.
325900021002           MOVE "N"                    TO  WS-STMT-DTA-SW-25.
326000021002           MOVE "N"                    TO  WS-STMT-DTA-SW-20FUND.
326100021002           MOVE "N"                    TO  WS-STMT-DTA-SW-20GIC.
326200021002           MOVE "N"                    TO  WS-STMT-DTA-SW-20DII.
326300021002           MOVE "N"                    TO  WS-STMT-DTA-SW-80DII.
326400021002           MOVE "N"                    TO  WS-STMT-DTA-SW-80FUND.
326500021001
326600021001      *****
326700021001      *****    Initialize the statement investor accounts table.
326800021001      *****
326900021001
327000021001           MOVE HIGH-VALUES            TO  WS-STMT-INVESTOR-ACCOUNT-TBL.
327100021001           MOVE ZEROES                 TO  WS-SIA-LST.
327200021001
327300021001      *****
327400021001      *****    Initialize the investor information table.
327500021001      *****
327600021001
327700021001           INITIALIZE                  WS-INVESTOR-INFO-TBL.
327800021001           MOVE ZEROES                 TO  WS-II-LST.
327900021001
328000021002      *****
328100021001      *****    Initialize the dealer information table.
328200021001      *****
328300021001
328400021001           INITIALIZE                  WS-DEALER-INFO-TBL.
328500021001           MOVE ZEROES                 TO  WS-DI-LST.
328600021001
328700021002      *****
328800021001      *****    Initialize the GIC information table.
328900021001      *****
329000021001
329100021001           INITIALIZE                  WS-GIC-INFO-TBL.
329200021001           MOVE ZEROES                 TO  WS-GIC-LST.
329300021001
329400021001      *****
329500021001      *****    Initialize the Account Detail (FUND, GIC & DII) table.
329600021001      *****
329700021001
329800021001           INITIALIZE                  WS-ACCOUNT-FUND-TABLE.
329900021001           MOVE ZEROES                 TO  WS-AFD-LST.
330000021001
330100021001           INITIALIZE                  WS-ACCOUNT-GIC-TABLE.
330200021001           MOVE ZEROES                 TO  WS-AGD-LST.
330300021001
330400021001           INITIALIZE                  WS-ACCOUNT-DII-TABLE.
330500021002           MOVE ZEROES                 TO  WS-ADID-LST.
330600021001
330700021001       LR2-EXIT.
330800021001           EXIT.
330900021001      /
331000021001       LEVEL-REINIT-1.
331100021001
331200021001      ******************************************************************
331300021001      *                                                                *
331400021001      *    L E V E L   R E I N I T I A L I Z A T I O N   1   R T N .   *
331500021001      *                                                                *
331600021001      *        ACCOUNT:                Account                         *
331700021001      *                                                                *
331800021001      ******************************************************************
331900021001
332000021001      *****
332100021001      *****    If Account is zeroes, bypass this routine.
332200021001      *****
332300021001
332400021001           IF  CURR-ACCOUNT   IS EQUAL TO  ZEROES
332500021001               GO TO LR1-EXIT
332600021001           END-IF
332700021001
332800021001      *****
332900021001      *****    If one of the following conditions is detected, an error
333000021001      *****    message will be printed and the account will be bypassed.
333100021001      *****       1. Investor Information record missing.
333200021001      *****       2. Dealer record missing.
333300021001      *****       3. Account Detail record missing.
333400021001      *****    If this occurs, the program that creates the Statement
333500021001      *****    Data file should be reviewed.
333600021001      *****
333700021001
333800021001           MOVE "N"                    TO  WS-L01BYP-SW.
333900021001
334000021001           IF  WS-STMT-DTA-SW-01 EQUAL TO  "Y"
334100021001           AND WS-STMT-DTA-SW-05 EQUAL TO  "Y"
334200021001           AND PR-SECTION-NO  IS EQUAL TO  20
334300021003               GO TO LR1-0015
334400021001           END-IF
334500021001
334600021001           MOVE SPACES                 TO  ERROR-LINE-1.
334700021001
334800021001           IF  WS-STMT-DTA-SW-01 EQUAL TO  "N"
334900021001               SET MSG                 TO  8
335000021001               GO TO LR1-0010.
335100021001
335200021001           IF  WS-STMT-DTA-SW-05 EQUAL TO  "N"
335300021001               SET MSG                 TO  9
335400021001               GO TO LR1-0010.
335500021001
335600021001           IF  PR-SECTION-NO NOT EQUAL TO  20
335700021001               SET MSG                 TO  10
335800021001               GO TO LR1-0010.
335900021001
336000021001           CONTINUE.
336100021001
336200021001       LR1-0010.
336300021001
336400021001           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
336500021001           MOVE "Y"                    TO  WS-L01BYP-SW.
336600021001           GO TO LR1-EXIT.
336700021001
336800021001
336900021001      *****************************************************
337000021001
337100021001       LR1-0015.
337200021001
337300021001      *****
337400021001      *****    Search the account type table for the correct
337500021001      *****    'rule'
337600021001      *****
337700021001
337800021001           SET AT1                     TO  1.
337900021001           IF  WS-AT-LST        IS NOT GREATER THAN  ZEROES
338000021001               GO TO LR1-0020
338100021001           END-IF.
338200021001
338300021001       LR1-0015-000.
338400021001
338500190614      *RFS183449-Starts
338600190614      *    IF  AD-ACCOUNT-TYPE-SHORT  IS EQUAL TO  WS-AT-CODE (AT1)
338700190614           INITIALIZE Lc-Acct-Type-Code
338800190619           PERFORM Get-Account-Type-Code
338900190614           IF Lc-Acct-Type-Code IS EQUAL TO  WS-AT-CODE (AT1)
339000190614      *RFS183449-Ends
339100021001               GO TO LR1-0020
339200021001           END-IF
339300021001
339400021001           SET AT1                  UP BY  1.
339500021001
339600021001           IF  AT1    IS NOT GREATER THAN  WS-AT-LST
339700021001               GO TO LR1-0015-000
339800021001           END-IF.
339900021001
340000021001      *************************************************************
340100021001
340200021001       LR1-0020.
340300021001
340400021001      *****
340500021001      *****    Find the account information in the investor account
340600021001      *****    table.  Format the nominee and registered contribution
340700021001      *****    data and print a message, if required.
340800021001      *****
340900021001
341000021001           MOVE SPACES                 TO  WS-DEALER-ACCOUNT-NO.
341100021001           MOVE SPACES                 TO  WS-NOMINEE.
341200021001           MOVE SPACES                 TO  WS-NOMINEE-CODE.
341300021001           MOVE SPACES                 TO  WS-NOMINEE-NAME.
341400021001           MOVE SPACES                 TO  WS-NOMINEES-ACCT-NO.
341500021001           MOVE ZEROES                 TO  WS-REG-CTB-CUR.
341600021001           MOVE SPACES                 TO  WS-REG-CTB-CUR-SIGN.
341700021002           MOVE SPACES                 TO  WS-INVESTMENT-NAME-SH.
341800021001
341900021001           SEARCH ALL WS-SIA-ENT
342000021001               AT END
342100021001                   GO TO LR1-0020-0020
342200021001               WHEN WS-SIA-ACCT (SIA)
342300021001                              IS EQUAL TO  AD-ACCOUNT
342400021001                   MOVE WS-SIA-DLRACCTNO (SIA)
342500021001                                       TO  WS-DEALER-ACCOUNT-NO
342600021001                   MOVE WS-SIA-NOMCDE (SIA)
342700021001                                       TO  WS-NOMINEE-CODE
342800021001                   MOVE WS-SIA-NOMNAM (SIA)
342900021001                                       TO  WS-NOMINEE-NAME
343000021001                   MOVE WS-SIA-NOMACCT (SIA)
343100021001                                       TO  WS-NOMINEES-ACCT-NO
343200021001                   MOVE WS-SIA-REGCTB (SIA)
343300021001                                       TO  WS-REG-CTB-CUR
343400021001                   MOVE WS-SIA-REGCTBSGN (SIA)
343500021001                                       TO  WS-REG-CTB-CUR-SIGN.
343600021003                   MOVE WS-SIA-ENTEREDBY (SIA)
343700021001                                       TO  WS-ENTERED-BY.
343800021002                   MOVE WS-SIA-MAIL-FLAG (SIA)
343900021001                                     TO  WS-MAILING-ADDRESS-INDICATOR.
344000021001
344100021001       LR1-0020-0020.
344200021001
344300021001      *****
344400021001      *****    If the account is flagged as NOMINEE but no nominee data
344500021001      *****    was found, an error message will be printed and the
344600021001      *****    nominee name will be defaulted to 'NOMINEE'.  If this
344700021001      *****    occurs, the program that creates the Statement Data file
344800021001      *****    should be reviewed.
344900021001      *****
345000021001
345100021001           IF  AD-NOMINEE              IS  EQUAL TO  "Y"
345200021001           AND WS-NOMINEE-CODE         IS  EQUAL TO  SPACES
345300021001           AND WS-NOMINEE-NAME         IS  EQUAL TO  SPACES
345400021001           AND WS-NOMINEES-ACCT-NO     IS  EQUAL TO  SPACES
345500021001               MOVE SPACES             TO  ERROR-LINE-1
345600021001               SET MSG                 TO  12
345700021001               PERFORM PRINT-ERR-LINE THRU PEL-EXIT
345800021001               MOVE "NOMINEE"          TO  WS-NOMINEE-NAME
345900021001           END-IF
346000021001
346100021001      *****
346200021001      *****    If the account is not flagged as NOMINEE but nominee data
346300021001      *****    is found, an error message will be printed and the
346400021001      *****    nominee data will be set to spaces.  If this occurs, the
346500021001      *****    program that creates the Statement Data file should be
346600021001      *****    reviewed.
346700021001      *****
346800021001
346900021001           IF  AD-NOMINEE     IS EQUAL TO  "Y"
347000021001               GO TO LR1-0020-0030.
347100021001
347200021001           IF  WS-NOMINEE-CODE         IS NOT EQUAL TO  SPACES
347300021001           OR  WS-NOMINEE-NAME         IS NOT EQUAL TO  SPACES
347400021001           OR  WS-NOMINEES-ACCT-NO     IS NOT EQUAL TO  SPACES
347500021001               MOVE SPACES             TO  ERROR-LINE-1
347600021001               SET MSG                 TO  13
347700021001               PERFORM PRINT-ERR-LINE THRU PEL-EXIT
347800021001               MOVE SPACES             TO  WS-NOMINEE-CODE
347900021001               MOVE SPACES             TO  WS-NOMINEE-NAME
348000021001               MOVE SPACES             TO  WS-NOMINEES-ACCT-NO
348100021001           END-IF.
348200021001
348300021001       LR1-0020-0030.
348400021001
348500021001      *****
348600021001      *****    Format the nominee data, if applicable.
348700021001      *****
348800021001
348900021001           IF  WS-NOMINEE-CODE         IS  EQUAL TO  SPACES
349000021001           AND WS-NOMINEE-NAME         IS  EQUAL TO  SPACES
349100021001           AND WS-NOMINEES-ACCT-NO     IS  EQUAL TO  SPACES
349200021001               GO TO LR1-0020-0040
349300021001           END-IF
349400021001
349500021001           IF  WS-NOMINEES-ACCT-NO     IS  EQUAL TO  SPACES
349600021001               MOVE WS-NOMINEE-NAME    TO  WS-NOMINEE
349700021001               GO TO LR1-0020-0040
349800021001           END-IF
349900021001
350000021001           STRING WS-NOMINEE-NAME
350100021001                             DELIMITED BY  "  ",
350200021001                  " ("       DELIMITED BY  SIZE,
350300021001                  WS-NOMINEES-ACCT-NO
350400021001                             DELIMITED BY  " ",
350500021001                  ")"        DELIMITED BY  SIZE
350600021001                                     INTO  WS-NOMINEE.
350700021001
350800021001       LR1-0020-0040.
350900021001
351000021001      *****
351100021001      *****    The literals will be formatted depending on the account
351200021001      *****    language code.  If the language code is not handled,
351300021001      *****    default to English.
351400021001      *****
351500021001
351600021001           IF  AD-LANGUAGE    IS EQUAL TO  "E"
351700021001               SET SCL                 TO  1
351800021001               GO TO LR1-0030.
351900021001
352000021001           IF  AD-LANGUAGE    IS EQUAL TO  "F"
352100021001               SET SCL                 TO  2
352200021001               GO TO LR1-0030.
352300021001
352400021001           SET SCL                     TO  1.
352500021001
352600021001       LR1-0030.
352700021001
352800021002           SET DI                      TO  1.
352900021001
353000021001           IF WS-LDA-INV-ACC-FLAG IS EQUAL TO "N"
353100021001           OR WS-STMTVRSN         IS EQUAL TO  3
353200021001              GO TO LR1-0030-0003
353300021001           END-IF
353400021001
353500021001           SET II                      TO  1.
353600021001
353700021001       LR1-0030-0001.
353800021001
353900021002           IF II    IS GREATER THAN   WS-II-LST
354000021007              SET II DOWN BY 1
354100021001              INITIALIZE INVESTOR-INFO-SECTION
354200021001              MOVE WS-INVESTOR-INFO (II) TO INVESTOR-INFO-SECTION
354300021001              GO TO LR1-0030-0003
354400021001           END-IF
354500021001
354600021001           INITIALIZE INVESTOR-INFO-SECTION.
354700021001           MOVE WS-INVESTOR-INFO (II) TO INVESTOR-INFO-SECTION.
354800021001
354900021001           IF II-ACCOUNT2 OF INVESTOR-INFO-SECTION IS
355000021001                                        NOT EQUAL TO CURR-ACCOUNT
355100021001              SET II UP BY 1
355200021001              GO TO LR1-0030-0001
355300021001           END-IF.
355400021001
355500021001       LR1-0030-0003.
355600021001
355700021001           IF DI    IS GREATER THAN   WS-DI-LST
355800021001              INITIALIZE DEALER-SECTION
355900021001              MOVE WS-DEALER-INFO (DI) TO DEALER-SECTION
356000021001              GO TO LR1-0030-0005
356100021001           END-IF
356200021001
356300021001           INITIALIZE DEALER-SECTION.
356400021001           MOVE WS-DEALER-INFO (DI) TO DEALER-SECTION.
356500021001
356600021001           IF DL-ACCOUNT2 OF DEALER-SECTION IS
356700021001                                        NOT EQUAL TO AD-ACCOUNT
356800021001              SET DI UP BY 1
356900021001              GO TO LR1-0030-0003
357000021001           END-IF.
357100021001
357200021001       LR1-0030-0005.
357300021001
357400021001      *****
357500021001      *****    Format the required fields.
357600021001      *****
357700021001
357800021002           MOVE II-END-DATE            TO  WS-II-END-DATE.
357900021001           MOVE "N"                    TO  WS-PSTCDEPRT-SW.
358000021002           MOVE II-START-DATE          TO  WS-II-START-DATE.
358100021001
358200021001      *****
358300021001      *****    The Statement File Generation (ANNSTMTJSI) formats and
358400021001      *****    creates the Dealer record using the Dealer & Dealer
358500021001      *****    Representative of the first account for the investor.  If
358600021001      *****    an investor has more than one account, the Dealer &
358700021001      *****    Dealer Representative of the accounts may differ.  If
358800021001      *****    this is the case, the Dealer & Dealer Representative
358900021001      *****    names and address lines will be retrieved and formatted.
359000021001      *****
359100021001
359200021001           MOVE SPACES                 TO  WS-BRANCH-ADDR1.
359300021001           MOVE SPACES                 TO  WS-BRANCH-ADDR2.
359400021001           MOVE SPACES                 TO  WS-BRANCH-ADDR3.
359500021001           MOVE SPACES                 TO  WS-BRANCH-ADDR4.
359600021001           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
359700021001           MOVE SPACES                 TO  WS-DEALER-REP-NAMES.
359800021001           MOVE ZEROES                 TO  WS-FAX.
359900021001           MOVE ZEROES                 TO  WS-PHONE.
360000021001           MOVE ZEROES                 TO  WS-PHONE-2.
360100021001           MOVE SPACES                 TO  WS-REP-NAME.
360200021001
360300021001           IF  AD-SALESREP    IS EQUAL TO  DL-SALESREP
360400021001           AND AD-DEALER      IS EQUAL TO  DL-DEALER
360500021001               MOVE DL-BRANCH-ADDR1    TO  WS-BRANCH-ADDR1
360600021001               MOVE DL-BRANCH-ADDR2    TO  WS-BRANCH-ADDR2
360700021001               MOVE DL-BRANCH-ADDR3    TO  WS-BRANCH-ADDR3
360800021001               MOVE DL-BRANCH-ADDR4    TO  WS-BRANCH-ADDR4
360900021001               MOVE DL-DEALER-NAME     TO  WS-DEALER-NAME
361000021001               MOVE DL-REP-NAME        TO  WS-REP-NAME
361100021001               MOVE DL-FAX             TO  WS-FAX
361200021001               MOVE DL-PHONE           TO  WS-PHONE
361300021001               MOVE DL-BRANCH-PHONE    TO  WS-PHONE-2
361400021001               GO TO LR1-0030-0090
361500021001           END-IF
361600021001
361700021001      *****
361800021001      *****    The account Dealer & Dealer Representative are different
361900021001      *****    than the dealer.  The following steps will be executed to
362000021001      *****    retrieve and format the Dealer & Dealer Representative
362100021001      *****    names and address lines.
362200021001      *****       1. Read the Dealer file for the name.
362300021001      *****       2. Read the Dealer Representative for the name, fax
362400021001      *****          and phone number.
362500021001      *****       3. Read the Dealer Representative Address for the
362600021001      *****          address lines.
362700021001      *****       4. If required, read the Institution Branch and
362800021001      *****          Institution Address for the address lines.
362900021001      *****       5. Format the address lines field by field, in case
363000021001      *****          one or more of the fields contain spaces.
363100021001      *****       6. Compress the address lines.
363200021001      *****
363300021001
363400021001           INITIALIZE MFADEAP.
363500021001
363600021001           MOVE AD-DEALER              TO  DEALER-CODE
363700021001                                           OF DEALER-RECD.
363800021001           READ DEALER-FILE
363900021001               INVALID KEY
364000021001                   MOVE "DEALER NAME NOT ON FILE            "
364100021001                                       TO  DEALER-NAME
364200021001                                           OF DEALER-RECD
364300021001           END-READ
364400021001
364500021001           MOVE DEALER-NAME
364600021001                OF DEALER-RECD         TO  WS-DEALER-NAME.
364700021001
364800021001           INITIALIZE MFADEAREP.
364900021001           MOVE AD-DEALER              TO  DEALER-CODE
365000021001                                           OF DEALER-REP-RECD.
365100021001           MOVE AD-SALESREP            TO  DEALER-REP-CODE
365200021001                                           OF DEALER-REP-RECD.
365300021001           READ DEALER-REP-FILE
365400021001               INVALID KEY
365500021001                   INITIALIZE MFADEAREP
365600021001           END-READ
365700021001
365800021001           MOVE SPACES                 TO  WS-ADRTMP.
365900021001           STRING SALUTATION-CODE
366000021001                  OF DEALER-REP-RECD
366100021001                             DELIMITED BY  " "
366200021001                                     INTO  WS-ADRTMP.
366300021001
366400021001           IF  WS-ADRTMP      IS EQUAL TO  SPACES
366500021001               STRING FIRST-NAME
366600021001                      OF DEALER-REP-RECD
366700021001                             DELIMITED BY  "  "
366800021001                                     INTO  WS-ADRTMP
366900021001           ELSE
367000021001               STRING WS-ADRTMP
367100021001                             DELIMITED BY  "  ",
367200021001                      " "    DELIMITED BY  SIZE,
367300021001                      FIRST-NAME
367400021001                      OF DEALER-REP-RECD
367500021001                             DELIMITED BY  "  "
367600021001                                     INTO  WS-REP-NAME
367700021001               MOVE WS-REP-NAME        TO  WS-ADRTMP
367800021001           END-IF
367900021001
368000021001           IF  WS-ADRTMP      IS EQUAL TO  SPACES
368100021001               STRING INITIALS
368200021001                      OF DEALER-REP-RECD
368300021001                             DELIMITED BY  "  "
368400021001                                     INTO  WS-ADRTMP
368500021001           ELSE
368600021001               STRING WS-ADRTMP
368700021001                             DELIMITED BY  "  ",
368800021001                      " "    DELIMITED BY  SIZE,
368900021001                      INITIALS
369000021001                      OF DEALER-REP-RECD
369100021001                             DELIMITED BY  "  "
369200021001                                     INTO  WS-REP-NAME
369300021001               MOVE WS-REP-NAME        TO  WS-ADRTMP
369400021001           END-IF
369500021001
369600021001           IF  WS-ADRTMP      IS EQUAL TO  SPACES
369700021001               STRING LAST-NAME
369800021001                      OF DEALER-REP-RECD
369900021001                             DELIMITED BY  "  "
370000021001                                     INTO  WS-ADRTMP
370100021001           ELSE
370200021001               STRING WS-ADRTMP
370300021001                             DELIMITED BY  "  ",
370400021001                      " "    DELIMITED BY  SIZE,
370500021001                      LAST-NAME
370600021001                      OF DEALER-REP-RECD
370700021001                             DELIMITED BY  "  "
370800021001                                     INTO  WS-REP-NAME
370900021001               MOVE WS-REP-NAME        TO  WS-ADRTMP
371000021001           END-IF
371100021001
371200021001           MOVE WS-ADRTMP              TO  WS-REP-NAME.
371300021001
371400021001           INITIALIZE MFAINSBRP.
371500021001           MOVE INSTITUTION-CODE
371600021001                OF DEALER-RECD         TO  INSTITUTION-CODE
371700021001                                           OF INSTITUTION-BRANCH-RECD.
371800021001           MOVE BRANCH-CODE
371900021001                OF DEALER-REP-RECD     TO  BRANCH-CODE
372000021001                                           OF INSTITUTION-BRANCH-RECD.
372100021001           READ INSTITUTION-BRANCH
372200021001               INVALID KEY
372300021001                   GO TO LR1-0030-0006
372400021001           END-READ
372500021001
372600021001           MOVE AREA-CODE OF INSTITUTION-BRANCH-RECD
372700021001                                       TO  WS-SH-PHONE2-01-03.
372800021001           MOVE PHONE-NO OF INSTITUTION-BRANCH-RECD
372900021001                                       TO  WS-SH-PHONE2-04-10.
373000021001       LR1-0030-0006.
373100021001
373200021001           IF  ADDR-NO OF DEALER-REP-RECD    IS EQUAL TO  ZEROES
373300021001               GO TO LR1-0030-0010
373400021001           END-IF
373500021001
373600021001           INITIALIZE MFADRADRP.
373700021001           MOVE ADDR-NO
373800021001                OF DEALER-REP-RECD     TO  ADDR-NO
373900021001                                           OF DEALER-REP-ADDRESS-RECD.
374000021001            READ DEALER-REP-ADDRESS
374100021001                INVALID KEY
374200021001                    GO TO LR1-0030-0010
374300021001            END-READ
374400021001
374500021001            MOVE CORR MFADRADRP        TO  MFAINADDP.
374600021001            GO TO LR1-0030-0030.
374700021001
374800021001       LR1-0030-0010.
374900021001
375000021001           INITIALIZE MFAINADDP.
375100021001           MOVE ADDR-NO OF INSTITUTION-BRANCH-RECD
375200021001                        TO  ADDR-NO OF INSTITUTION-ADDRESS-RECD.
375300021001
375400021001           READ INSTITUTION-ADDRESS
375500021001               INVALID KEY
375600021001                   GO TO LR1-0030-0020
375700021001           END-READ
375800021001
375900021001           GO TO LR1-0030-0030.
376000021001
376100021001       LR1-0030-0020.
376200021001
376300021001           INITIALIZE MFAINSBRP.
376400021001           MOVE INSTITUTION-CODE
376500021001                OF DEALER-RECD         TO  INSTITUTION-CODE
376600021001                                           OF INSTITUTION-BRANCH-RECD.
376700021001           MOVE BRANCH-CODE
376800021001                OF DEALER-RECD         TO  BRANCH-CODE
376900021001                                           OF INSTITUTION-BRANCH-RECD.
377000021001           READ INSTITUTION-BRANCH
377100021001               INVALID KEY
377200021001                   INITIALIZE MFAINADDP
377300021001                   GO TO LR1-0030-0030.
377400021001
377500021001           INITIALIZE MFAINADDP.
377600021001           MOVE ADDR-NO
377700021001                OF INSTITUTION-BRANCH-RECD
377800021001                                       TO  ADDR-NO
377900021001                                           OF INSTITUTION-ADDRESS-RECD.
378000021001           READ INSTITUTION-ADDRESS
378100021001               INVALID KEY
378200021001                   INITIALIZE MFAINADDP
378300021001                   GO TO LR1-0030-0030.
378400021001
378500021001       LR1-0030-0030.
378600021001
378700021001           MOVE SPACES                 TO  WS-ADRTMP.
378800021001           STRING STREET-NO
378900021001               OF INSTITUTION-ADDRESS
379000021001                             DELIMITED BY  "  "
379100021001                                     INTO  WS-ADRTMP.
379200021001
379300021001           IF PROVINCE-CODE OF INSTITUTION-ADDRESS
379400021001              EQUAL TO "QC"
379500021001              GO TO LR1-0030-0030-1.
379600021001
379700021001           IF  WS-ADRTMP      IS EQUAL TO  SPACES
379800021001               STRING STREET-NAME
379900021001                      OF INSTITUTION-ADDRESS
380000021001                             DELIMITED BY  "  "
380100021001                                     INTO  WS-ADRTMP
380200021001             ELSE
380300021001               STRING WS-ADRTMP
380400021001                             DELIMITED BY  "  ",
380500021001                      " "    DELIMITED BY  SIZE,
380600021001                      STREET-NAME
380700021001                      OF INSTITUTION-ADDRESS
380800021001                             DELIMITED BY  "  "
380900021001                                     INTO  WS-BRANCH-ADDR1
381000021001               MOVE WS-BRANCH-ADDR1    TO  WS-ADRTMP.
381100021001
381200021001           IF  WS-ADRTMP      IS EQUAL TO  SPACES
381300021001               STRING STREET-TYPE-CODE
381400021001                      OF INSTITUTION-ADDRESS
381500021001                             DELIMITED BY  "  "
381600021001                                     INTO  WS-ADRTMP
381700021001             ELSE
381800021001               STRING WS-ADRTMP
381900021001                             DELIMITED BY  "  ",
382000021001                      " "    DELIMITED BY  SIZE,
382100021001                      STREET-TYPE-CODE
382200021001                      OF INSTITUTION-ADDRESS
382300021001                             DELIMITED BY  "  "
382400021001                                     INTO  WS-BRANCH-ADDR1
382500021001               MOVE WS-BRANCH-ADDR1    TO  WS-ADRTMP.
382600021001
382700021001              GO TO LR1-0030-0030-2.
382800021001
382900021001       LR1-0030-0030-1.
383000021001
383100021001           IF  WS-ADRTMP     IS EQUAL TO  SPACES
383200021001               STRING STREET-TYPE-CODE OF INSTITUTION-ADDRESS
383300021001                      DELIMITED BY "  "
383400021001                            INTO WS-ADRTMP
383500021001           ELSE
383600021001               STRING WS-ADRTMP
383700021001                      DELIMITED BY "  ",
383800021001                      " "  DELIMITED BY SIZE,
383900021001                      STREET-TYPE-CODE OF INSTITUTION-ADDRESS
384000021001                           DELIMITED BY "  "
384100021001                             INTO WS-BRANCH-ADDR1
384200021001               MOVE WS-BRANCH-ADDR1    TO WS-ADRTMP.
384300021001
384400021001           IF WS-ADRTMP     IS EQUAL TO SPACES
384500021001                STRING STREET-NAME OF INSTITUTION-ADDRESS
384600021001                             DELIMITED BY "  "
384700021001                             INTO WS-ADRTMP
384800021001           ELSE
384900021001                STRING WS-ADRTMP
385000021001                            DELIMITED BY "  ",
385100021001                       " "  DELIMITED BY SIZE,
385200021001                       STREET-NAME OF INSTITUTION-ADDRESS
385300021001                            DELIMITED BY "  "
385400021001                            INTO WS-BRANCH-ADDR1
385500021001                  MOVE WS-BRANCH-ADDR1      TO  WS-ADRTMP.
385600021001
385700021001       LR1-0030-0030-2.
385800021001           IF  WS-ADRTMP      IS EQUAL TO  SPACES
385900021001               STRING STREET-DIRCT-CODE
386000021001                      OF INSTITUTION-ADDRESS
386100021001                             DELIMITED BY  "  "
386200021001                                     INTO  WS-ADRTMP
386300021001           ELSE
386400021001               STRING WS-ADRTMP
386500021001                             DELIMITED BY  "  ",
386600021001                      " "    DELIMITED BY  SIZE,
386700021001                      STREET-DIRCT-CODE
386800021001                      OF INSTITUTION-ADDRESS
386900021001                             DELIMITED BY  "  "
387000021001                                     INTO  WS-BRANCH-ADDR1
387100021001               MOVE WS-BRANCH-ADDR1    TO  WS-ADRTMP.
387200021001
387300021001           MOVE WS-ADRTMP              TO  WS-BRANCH-ADDR1.
387400021001
387500021001           MOVE MISC-FIRST-ADDR-LINE
387600021001                OF INSTITUTION-ADDRESS-RECD
387700021001                                       TO  WS-BRANCH-ADDR2.
387800021001           MOVE MISC-SECOND-ADDR-LINE
387900021001                OF INSTITUTION-ADDRESS-RECD
388000021001                                       TO  WS-BRANCH-ADDR3.
388100021001           MOVE CO-OR-ATTENTION
388200021001                OF INSTITUTION-ADDRESS-RECD
388300021001                                       TO  WS-BRANCH-ADDR4.
388400021001
388500021007           IF  WS-LDA-ATTN-LINE-PRT = "N"
388600021007               MOVE SPACES TO WS-BRANCH-ADDR4.
388700021001
388800021001           MOVE POSTAL-CODE
388900021001                OF INSTITUTION-ADDRESS TO  WS-POSTAL.
389000021001           MOVE SPACES                 TO  WS-POSTAL-OUT.
389100021001           IF  COUNTRY-CODE
389200021001               OF INSTITUTION-ADDRESS
389300021001                              IS EQUAL TO  "CAN"
389400021001               MOVE WS-POSTAL1         TO  WS-POSTAL-OUT1
389500021001               MOVE WS-POSTAL2         TO  WS-POSTAL-OUT2
389600021001             ELSE
389700021001               MOVE WS-POSTAL          TO  WS-POSTAL-OUT.
389800021001
389900021001           MOVE SPACES                 TO  WS-ADRTMP.
390000021001           STRING CITY
390100021001               OF INSTITUTION-ADDRESS
390200021001                             DELIMITED BY  "  "
390300021001                                     INTO  WS-ADRTMP.
390400021001
390500021001           IF  WS-ADRTMP      IS EQUAL TO  SPACES
390600021001               STRING PROVINCE-CODE
390700021001                      OF INSTITUTION-ADDRESS
390800021001                             DELIMITED BY  "  "
390900021001                                     INTO  WS-ADRTMP
391000021001               GO TO LR1-0030-0040.
391100021001
391200021001           IF  PROVINCE-CODE
391300021001               OF INSTITUTION-ADDRESS
391400021001                              IS EQUAL TO  SPACES
391500021001               GO TO LR1-0030-0040.
391600021001
391700021001           STRING WS-ADRTMP  DELIMITED BY  "  ",
391800021001                  ", "       DELIMITED BY  SIZE,
391900021001                  PROVINCE-CODE
392000021001                  OF INSTITUTION-ADDRESS
392100021001                             DELIMITED BY  "  "
392200021001                                     INTO  WS-BRANCH-ADDR5.
392300021001           MOVE WS-BRANCH-ADDR5        TO  WS-ADRTMP.
392400021001
392500021001       LR1-0030-0040.
392600021001           IF  WS-ADRTMP      IS EQUAL TO  SPACES
392700021001               STRING WS-POSTAL-OUT
392800021001                             DELIMITED BY  "  "
392900021001                                     INTO  WS-ADRTMP
393000021001             ELSE
393100021001               STRING WS-ADRTMP
393200021001                             DELIMITED BY  "  ",
393300021001                      "  "   DELIMITED BY  SIZE,
393400021001                      WS-POSTAL-OUT
393500021001                             DELIMITED BY  "  "
393600021001                                     INTO  WS-BRANCH-ADDR5
393700021001               MOVE WS-BRANCH-ADDR5    TO  WS-ADRTMP.
393800021001
393900021001           MOVE WS-ADRTMP              TO  WS-BRANCH-ADDR5.
394000021001
394100021001           IF  WS-BRANCH-ADDR1
394200021001                          IS NOT EQUAL TO  SPACES
394300021001               GO TO LR1-0030-0050.
394400021001
394500021001           IF  WS-BRANCH-ADDR2
394600021001                          IS NOT EQUAL TO  SPACES
394700021001               MOVE WS-BRANCH-ADDR2    TO  WS-BRANCH-ADDR1
394800021001               MOVE SPACES             TO  WS-BRANCH-ADDR2
394900021001               GO TO LR1-0030-0050.
395000021001
395100021001           IF  WS-BRANCH-ADDR3
395200021001                          IS NOT EQUAL TO  SPACES
395300021001               MOVE WS-BRANCH-ADDR3    TO  WS-BRANCH-ADDR1
395400021001               MOVE SPACES             TO  WS-BRANCH-ADDR3
395500021001               GO TO LR1-0030-0050.
395600021001
395700021001           IF  WS-BRANCH-ADDR4
395800021001                          IS NOT EQUAL TO  SPACES
395900021001               MOVE WS-BRANCH-ADDR4    TO  WS-BRANCH-ADDR1
396000021001               MOVE SPACES             TO  WS-BRANCH-ADDR4
396100021001               GO TO LR1-0030-0050.
396200021001
396300021001           MOVE WS-BRANCH-ADDR5        TO  WS-BRANCH-ADDR1.
396400021001           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
396500021001           GO TO LR1-0030-0080.
396600021001
396700021001       LR1-0030-0050.
396800021001           IF  WS-BRANCH-ADDR2
396900021001                          IS NOT EQUAL TO  SPACES
397000021001               GO TO LR1-0030-0060.
397100021001
397200021001           IF  WS-BRANCH-ADDR3
397300021001                          IS NOT EQUAL TO  SPACES
397400021001               MOVE WS-BRANCH-ADDR3    TO  WS-BRANCH-ADDR2
397500021001               MOVE SPACES             TO  WS-BRANCH-ADDR3
397600021001               GO TO LR1-0030-0060.
397700021001
397800021001           IF  WS-BRANCH-ADDR4
397900021001                          IS NOT EQUAL TO  SPACES
398000021001               MOVE WS-BRANCH-ADDR4    TO  WS-BRANCH-ADDR2
398100021001               MOVE SPACES             TO  WS-BRANCH-ADDR4
398200021001               GO TO LR1-0030-0060.
398300021001
398400021001           MOVE WS-BRANCH-ADDR5        TO  WS-BRANCH-ADDR2.
398500021001           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
398600021001           GO TO LR1-0030-0080.
398700021001
398800021001       LR1-0030-0060.
398900021001           IF  WS-BRANCH-ADDR3
399000021001                          IS NOT EQUAL TO  SPACES
399100021001               GO TO LR1-0030-0070.
399200021001
399300021001           IF  WS-BRANCH-ADDR4
399400021001                          IS NOT EQUAL TO  SPACES
399500021001               MOVE WS-BRANCH-ADDR4    TO  WS-BRANCH-ADDR3
399600021001               MOVE SPACES             TO  WS-BRANCH-ADDR4
399700021001               GO TO LR1-0030-0070.
399800021001
399900021001           MOVE WS-BRANCH-ADDR5        TO  WS-BRANCH-ADDR3.
400000021001           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
400100021001           GO TO LR1-0030-0080.
400200021001
400300021001       LR1-0030-0070.
400400021001           IF  WS-BRANCH-ADDR4
400500021001                          IS NOT EQUAL TO  SPACES
400600021001               GO TO LR1-0030-0080.
400700021001
400800021001           MOVE WS-BRANCH-ADDR5        TO  WS-BRANCH-ADDR4.
400900021001           MOVE SPACES                 TO  WS-BRANCH-ADDR5.
401000021001
401100021001       LR1-0030-0080.
401200021001
401300021001           MOVE FAX-AREA
401400021001                OF DEALER-REP-RECD     TO  WS-SH-FAX-01-03.
401500021001           MOVE FAX-PHONE
401600021001                OF DEALER-REP-RECD     TO  WS-SH-FAX-04-10.
401700021001
401800021001           MOVE AREA-CODE
401900021001                OF DEALER-REP-RECD     TO  WS-SH-PHONE-01-03.
402000021001           MOVE PHONE-NO
402100021001                OF DEALER-REP-RECD     TO  WS-SH-PHONE-04-10.
402200021001
402300021001       LR1-0030-0090.
402400021001
402500021001      *****
402600021001      *****    Format the account type description.
402700021001      *****
402800021001
402900021001           MOVE AD-GROUP               TO  WS-ACTTYPGRP.
403000021001           MOVE AD-ACCOUNT-TYPE        TO  WS-ACTTYPIN-PFX.
403100021001           MOVE AD-LOCKED-IN           TO  WS-ACTTYPLCK.
403200021001           MOVE AD-LANGUAGE            TO  WS-ACTTYPLNG.
403300021001           MOVE AD-NOMINEE             TO  WS-ACTTYPNOM.
403400190619183449*    MOVE AD-ACCOUNT-TYPE-SHORT  TO  WS-ACTTYPSHT.
403500190619183449     MOVE Lc-Acct-Type-Code      TO  WS-ACTTYPSHT.
403600021001           MOVE AD-SPOUSAL             TO  WS-ACTTYPSPS.
403700021001           PERFORM FORMAT-ACTTYP-DESC THRU FAD-EXIT.
403800021001
403900021001      *****
404000021001      *****    Initialize the statement for the new account.
404100021001      *****
404200021001
404300021001           MOVE SPACES                 TO  WS-STATEMENT-PAGE.
404400021001           MOVE 1                      TO  WS-SH-PGENO.
404500021001
404600021001      *****
404700021001      *****    Format statement heading line 1.
404800021001      *****
404900021001
405000021001           MOVE SPACES                 TO  STMT-HDG-01.
405100021001
405200021001           IF WS-STMTVRSN              IS EQUAL TO  "F"
405300021002              MOVE WS-II-START-DATE-DD   TO  SH01V5-START-DATE-DD
405400021002              MOVE "/"                   TO  SH01V5-LIT1
405500021002              MOVE WS-II-START-DATE-MM   TO  SH01V5-START-DATE-MM
405600021002              MOVE "/"                   TO  SH01V5-LIT2
405700021002              MOVE WS-II-START-DATE-CCYY TO  SH01V5-START-DATE-YY
405800021002              MOVE "-"                   TO  SH01V5-LIT3
405900021002              MOVE WS-II-END-DATE-DD     TO  SH01V5-END-DATE-DD
406000021002              MOVE "/"                   TO  SH01V5-LIT4
406100021002              MOVE WS-II-END-DATE-MM     TO  SH01V5-END-DATE-MM
406200021002              MOVE "/"                   TO  SH01V5-LIT5
406300021002              MOVE WS-II-END-DATE-CCYY   TO  SH01V5-END-DATE-YY
406400021001              GO TO LR1-0030-0100
406500021001           END-IF.
406600021001
406700021001
406800021001       LR1-0030-0100.
406900021001
407000021001           SET SPL                  TO  WS-SPL-HDGFST
407100021001           MOVE STMT-HDG-01         TO  WS-STMTPGE-LNE (SPL)
407200021001
407300021001      *****
407400021001      *****    Format statement heading Account-no line for Version 5
407500021001      *****
407600021001
407700021001           IF WS-STMTVRSN              IS EQUAL TO  "F"
407800021002              SET SPL                     UP BY  7
407900021001              MOVE SPACES                 TO  STMT-HDG-ACCNT-NO
408000021001              MOVE AD-ACCOUNT             TO  SHACCNT-ACCNO
408100021001              MOVE STMT-HDG-ACCNT-NO      TO  WS-STMTPGE-LNE (SPL)
408200021002              SET SPL                     UP BY  3
408300021001           END-IF.
408400021001
408500021001      *****
408600021001      *****    Confirmations are to be printed on a free format form,
408700021001      *****    not on a pre-printed form like the statements.
408800021001      *****    Therefore, format the heading area heading lines.
408900021001      *****
409000021001
409100021001      *****
409200021001      *****    Format statement heading line 2.
409300021001      *****
409400021001
409500021001           MOVE SPACES                 TO  STMT-HDG-02.
409600021001
409700021001           IF WS-STMTVRSN              IS EQUAL TO  "F"
409800021001              IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
409900021001                 MOVE WS-NOMINEE-NAME     TO  SH02V5-INVESTOR-NAME
410000021001              ELSE
410100021001                 MOVE II-INVESTOR-NAME    TO  SH02V5-INVESTOR-NAME
410200021001              END-IF
410300021001              SET SPL                     UP BY  1
410400021001              GO TO LR1-0030-0110
410500021002           END-IF.
410600021001
410700021001       LR1-0030-0110.
410800021001
410900021001           MOVE STMT-HDG-02            TO  WS-STMTPGE-LNE (SPL).
411000021001
411100021001      *****
411200021001      *****    FORMAT STATEMENT EXTRA HEADING LINE
411300021001      *****
411400021001
411500021001           MOVE SPACES                 TO  WS-SH04-INVESTOR-ADDRESS1.
411600021001
411700021001           IF  II-INVESTOR-ADDRESS1    IS EQUAL TO  SPACES
411800021001           AND II-INVESTOR-ADDRESS2    IS EQUAL TO  SPACES
411900021001           AND II-INVESTOR-ADDRESS3    IS EQUAL TO  SPACES
412000021001           AND II-INVESTOR-ADDRESS4    IS EQUAL TO  SPACES
412100021001           AND II-INVESTOR-ADDRESS5    IS EQUAL TO  SPACES
412200021001               MOVE II-POSTAL-CODE     TO  SH04-POSTAL-CODE
412300021001               MOVE "Y"                TO  WS-PSTCDEPRT-SW
412400021001           ELSE
412500021001               MOVE II-INVESTOR-ADDRESS1
412600021001                                       TO  WS-SH04-INVESTOR-ADDRESS1
412700021001           END-IF
412800021001
412900021001           MOVE SPACES                 TO  STMT-HDG-EXTRA.
413000021001
413100021001           IF WS-STMTVRSN              IS EQUAL TO  "F"
413200021001             MOVE WS-SH04-INVESTOR-ADDRESS1 TO SHEXV5-INVESTOR-ADDRESS1
413300021001             GO TO LR1-0030-0110-0000
413400021001           END-IF.
413500021001
413600021001           IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
413700021001              MOVE II-INVESTOR-NAME         TO SHEX-INVESTOR-ADDRESS1
413800021001           ELSE
413900021001              MOVE WS-SH04-INVESTOR-ADDRESS1 TO SHEX-INVESTOR-ADDRESS1
414000021001           END-IF.
414100021001
414200021001       LR1-0030-0110-0000.
414300021001
414400021001           SET  SPL                    UP BY 1.
414500021001           MOVE STMT-HDG-EXTRA         TO WS-STMTPGE-LNE(SPL).
414600021001
414700021001      *****
414800021001      *****    Format statement heading line 3.
414900021001      *****
415000021001
415100021001           MOVE SPACES                 TO  WS-SH05-INVESTOR-ADDRESS2.
415200021001
415300021001           IF  WS-PSTCDEPRT-SW         IS  EQUAL TO  "N"
415400021001           AND II-INVESTOR-ADDRESS2    IS  EQUAL TO  SPACES
415500021001           AND II-INVESTOR-ADDRESS3    IS  EQUAL TO  SPACES
415600021001           AND II-INVESTOR-ADDRESS4    IS  EQUAL TO  SPACES
415700021001           AND II-INVESTOR-ADDRESS5    IS  EQUAL TO  SPACES
415800021001               MOVE II-POSTAL-CODE     TO  SH05-POSTAL-CODE
415900021001               MOVE "Y"                TO  WS-PSTCDEPRT-SW
416000021001           ELSE
416100021001               MOVE II-INVESTOR-ADDRESS2 TO WS-SH05-INVESTOR-ADDRESS2
416200021001           END-IF
416300021001
416400021001           MOVE SPACES                 TO  STMT-HDG-03.
416500021001
416600021002           IF WS-STMTVRSN             IS EQUAL TO  "F"
416700021001              IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
416800021001                 MOVE DL-NOMINEE-ADDR1    TO SH03V5-INVESTOR-ADDRESS2
416900021001              ELSE
417000021001              MOVE WS-SH05-INVESTOR-ADDRESS2
417100021001                            TO  SH03V5-INVESTOR-ADDRESS2
417200021001              END-IF
417300021001              GO TO LR1-0030-0120
417400021002           END-IF.
417500021001
417600021001       LR1-0030-0120.
417700021001
417800021001           SET SPL                     UP BY  1.
417900021001           MOVE STMT-HDG-03            TO  WS-STMTPGE-LNE (SPL).
418000021001
418100021001      *****
418200021001      *****    Format statement heading line 4.
418300021001      *****
418400021001
418500021001           MOVE SPACES                 TO  WS-SH06-INVESTOR-ADDRESS3.
418600021001
418700021001           IF  WS-PSTCDEPRT-SW         IS  EQUAL TO  "N"
418800021001           AND II-INVESTOR-ADDRESS3    IS EQUAL TO  SPACES
418900021001           AND II-INVESTOR-ADDRESS4    IS EQUAL TO  SPACES
419000021001           AND II-INVESTOR-ADDRESS5    IS EQUAL TO  SPACES
419100021001               MOVE II-POSTAL-CODE     TO  SH6-POSTAL-CODE
419200021001               MOVE "Y"                TO  WS-PSTCDEPRT-SW
419300021001           ELSE
419400021001               MOVE II-INVESTOR-ADDRESS3
419500021001                                       TO  WS-SH06-INVESTOR-ADDRESS3
419600021001           END-IF
419700021001
419800021001           MOVE SPACES                 TO  STMT-HDG-04.
419900021001
420000021002           IF  WS-STMTVRSN               IS EQUAL TO  "F"
420100021001              IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
420200021001                 MOVE DL-NOMINEE-ADDR2    TO SH04V5-INVESTOR-ADDRESS3
420300021001              ELSE
420400021001               MOVE WS-SH06-INVESTOR-ADDRESS3
420500021001                                         TO  SH04V5-INVESTOR-ADDRESS3
420600021001              END-IF
420700021001               GO TO LR1-0030-0130
420800021002           END-IF.
420900021001
421000021001       LR1-0030-0130.
421100021001
421200021001           SET SPL                     UP BY  1.
421300021001           MOVE STMT-HDG-04            TO  WS-STMTPGE-LNE (SPL).
421400021001
421500021001      *****
421600021001      *****    Format statement heading line 5.
421700021001      *****
421800021001
421900021001           MOVE SPACES                 TO  WS-SH07-INVESTOR-ADDRESS4.
422000021001
422100021001           IF  WS-PSTCDEPRT-SW         IS  EQUAL TO  "N"
422200021001           AND II-INVESTOR-ADDRESS4    IS EQUAL TO  SPACES
422300021001           AND II-INVESTOR-ADDRESS5    IS EQUAL TO  SPACES
422400021001               MOVE II-POSTAL-CODE     TO  SH7-POSTAL-CODE
422500021001               MOVE "Y"                TO  WS-PSTCDEPRT-SW
422600021001           ELSE
422700021001               MOVE II-INVESTOR-ADDRESS4
422800021001                                       TO  WS-SH07-INVESTOR-ADDRESS4
422900021001           END-IF
423000021001
423100021001           IF  WS-LDA-BRANCH-ADDRESS   IS EQUAL TO  "N"
423200021001               MOVE SPACES             TO  WS-BRANCH-ADDR1
423300021001           END-IF
423400021001
423500021001           MOVE SPACES                 TO  STMT-HDG-05.
423600021001
423700021001           IF WS-STMTVRSN             IS EQUAL TO  "F"
423800021001              IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
423900021001                 MOVE DL-NOMINEE-ADDR3    TO SH05V5-INVESTOR-ADDRESS4
424000021001              ELSE
424100021001                MOVE WS-SH07-INVESTOR-ADDRESS4
424200021001                                           TO SH05V5-INVESTOR-ADDRESS4
424300021001              END-IF
424400021001                GO TO LR1-0030-0140
424500021002           END-IF.
424600021001
424700021001       LR1-0030-0140.
424800021001
424900021001           SET SPL                     UP BY  1.
425000021001           MOVE STMT-HDG-05            TO  WS-STMTPGE-LNE (SPL).
425100021001
425200021001      *****
425300021001      *****    Format statement heading line 6.
425400021001      *****
425500021001
425600021001           MOVE SPACES                 TO  WS-SH08-INVESTOR-ADDRESS5.
425700021001
425800021001           IF  WS-PSTCDEPRT-SW         IS  EQUAL TO  "N"
425900021001           AND II-INVESTOR-ADDRESS5    IS EQUAL TO  SPACES
426000021001               MOVE II-POSTAL-CODE     TO  SH08-POSTAL-CODE
426100021001               MOVE "Y"                TO  WS-PSTCDEPRT-SW
426200021001           ELSE
426300021001               MOVE II-INVESTOR-ADDRESS5
426400021001                                       TO  WS-SH08-INVESTOR-ADDRESS5
426500021001           END-IF
426600021001
426700021007           IF  WS-LDA-BRANCH-ADDRESS   IS EQUAL TO  "N"
426800021001               MOVE SPACES             TO  WS-BRANCH-ADDR2
426900021001           END-IF
427000021001
427100021001           MOVE SPACES                 TO  STMT-HDG-06.
427200021001
427300021002           IF WS-STMTVRSN            IS EQUAL TO  "F"
427400021001              IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
427500021001                 MOVE DL-NOMINEE-ADDR4    TO SH06V5-INVESTOR-ADDRESS5
427600021001              ELSE
427700021001                MOVE WS-SH08-INVESTOR-ADDRESS5
427800021001                                       TO  SH06V5-INVESTOR-ADDRESS5
427900021001              END-IF
428000021001                GO TO LR1-0030-0150
428100021003           END-IF.
428200021001
428300021001       LR1-0030-0150.
428400021001
428500021001           SET SPL                     UP BY  1.
428600021001           MOVE STMT-HDG-06            TO  WS-STMTPGE-LNE (SPL).
428700021001
428800021001      *****
428900021001      *****    Format statement heading line 7.
429000021001      *****
429100021001
429200021001           MOVE SPACES                 TO  WS-SH09-POSTAL-CODE.
429300021001
429400021001           IF  WS-PSTCDEPRT-SW         EQUAL TO  "N"
429500021001               MOVE II-POSTAL-CODE     TO  WS-SH09-POSTAL-CODE
429600021001           END-IF
429700021001
429800021001           IF  WS-LDA-BRANCH-ADDRESS   IS EQUAL TO  "N"
429900021001               MOVE SPACES             TO  WS-BRANCH-ADDR3
430000021001           END-IF
430100021001
430200021001           MOVE SPACES                    TO  STMT-HDG-07.
430300021001
430400021002           IF WS-STMTVRSN               IS  EQUAL TO  "F"
430500021001                IF WS-MAILING-ADDRESS-INDICATOR     IS EQUAL TO "N"
430600021001                   MOVE SPACES               TO  SH07V5-POSTAL-CODE
430700021001                ELSE
430800021001                   MOVE WS-SH09-POSTAL-CODE  TO  SH07V5-POSTAL-CODE
430900021001                END-IF
431000021001                GO TO LR1-0030-0160
431100021003           END-IF.
431200021001
431300021001       LR1-0030-0160.
431400021001
431500021001           SET SPL                     UP BY  1.
431600021001           MOVE STMT-HDG-07            TO  WS-STMTPGE-LNE (SPL).
431700021001
431800021001      *****
431900021003      *****    Format statement heading line 8. Line 9 to 13
432000021001      *****    will not be used.
432100021001      *****
432200021001
432300021003           MOVE SPACES                    TO  STMT-HDG-08.
432400021003
432500021003           IF WS-STMTVRSN               IS  EQUAL TO  "F"
432600021003              MOVE WS-PAGE-LIT-E             TO SH08V5-PGE-LIT
432700021003              MOVE WS-SH-PGENO               TO SH08V5-PGENO
432800021003           END-IF.
432900021001
433000021003       LR1-0030-0170.
433100021003
433200021003           SET SPL                     UP BY  6.
433300021003           MOVE STMT-HDG-08            TO  WS-STMTPGE-LNE (SPL).
433400021003           SET WS-SPL-SH02             TO  SPL.
433500021003
433600021001      *****
433700021001      *****    Format the messages.  Initially, attempt to format the
433800021001      *****    statement messages using the Account Type Code.  If none
433900021001      *****    are found, use an Account Type Code of spaces.
434000021001      *****
434100021001
434200021002       LR1-0030-0250.
434300021001
434400021001           MOVE SPACES                 TO  WS-STATEMENT-PAGE-MESSAGE.
434500021001           MOVE AD-FUND-NO             TO  WS-FUND-NO.
434600021001
434700021001       LR1-0040.
434800021001
434900021001           MOVE LOW-VALUES             TO  STMT-MSG-RECD.
435000190619183449*    MOVE AD-ACCOUNT-TYPE-SHORT  TO  ACCOUNT-TYPE-CODE
435100190619183449     MOVE Lc-Acct-Type-Code      TO  ACCOUNT-TYPE-CODE
435200190619                                           OF STMT-MSG-RECD.
435300190619           MOVE AD-LANGUAGE            TO  LANGUAGE-CODE
435400190619                                           OF STMT-MSG-RECD.
435500190619           START STMT-MSG-FILE
435600190619               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
435700190619               INVALID KEY
435800190619                   GO TO LR1-0070.
435900190619
436000190619       LR1-0050.
436100190619
436200190619           READ STMT-MSG-FILE NEXT     AT  END
436300190619               GO TO LR1-0070.
436400190619
436500021001           IF  LINE-NO    IS GREATER THAN  WS-SPML-MAX
436600021001           OR  LANGUAGE-CODE
436700021001               OF STMT-MSG-RECD
436800021001                          IS NOT EQUAL TO  AD-LANGUAGE
436900021001           OR  ACCOUNT-TYPE-CODE
437000021001               OF STMT-MSG-RECD
437100190619183449*                   IS NOT EQUAL TO  AD-ACCOUNT-TYPE-SHORT
437200190619183449                    IS NOT EQUAL TO  Lc-Acct-Type-Code
437300021001               GO TO LR1-0070.
437400021001
437500021001           IF  LINE-NO   NOT GREATER THAN  ZEROES
437600021001               GO TO LR1-0060.
437700021001
437800021001           MOVE SPACES                 TO  STMT-MSG-01.
437900021001           MOVE STATEMENT-MESSAGE      TO  SM01-STATEMENT-MESSAGE.
438000021001
438100021001           SET SPML                    TO  LINE-NO.
438200021001      *****MOVE STMT-MSG-01            TO  WS-STMTPGE-MSGLNE (SPML).
438300021001
438400021001       LR1-0060.
438500021001
438600021001           GO TO LR1-0050.
438700021001
438800021001       LR1-0070.
438900021001
439000021001      *****
439100021001      *****    If no statement messages were formatted and the Account
439200021001      *****    Type Code being used was not spaces, attempt to format
439300021001      *****    statement messages using an Account Type Code of spaces.
439400021001      *****
439500021001
439600021001           IF  WS-STATEMENT-PAGE-MESSAGE
439700021001                              IS EQUAL TO  SPACES
439800021001           AND AD-ACCOUNT-TYPE-SHORT
439900021001                          IS NOT EQUAL TO  SPACES
440000021001               MOVE SPACES             TO  AD-ACCOUNT-TYPE-SHORT
440100021001               GO TO LR1-0040.
440200021001
440300021001           GO TO LR1-0070-0000-0010.
440400021001
440500021001       LR1-0070-0000-0010.
440600021001
440700021001      *****
440800021001      *****    Position at first detail line.
440900021001      *****
441000021001
441100021001           SET SPL                     TO  WS-SPL-DTLFST.
441200021001
441300021001      *****
441400021001      *****    Determine if the client statement copy is to be
441500021001      *****    suppressed.  This is done depending on whether or not the
441600021001      *****    account being processed is a nominee account.
441700021001      *****
441800021001
441900021001           MOVE "N"                    TO  WS-CLTSPR-SW.
442000021001
442100021001           IF  WS-NOMINEE IS NOT EQUAL TO  SPACES
442200021001               GO TO LR1-0070-0030.
442300021001
442400021001      *****
442500021001      *****    Processing a non-nominee account.  Initially read through
442600021001      *****    the Dealer Mailing Instruction.  If the form CONFMSPR is
442700021001      *****    found, the client copy statement is to be suppressed.
442800021001      *****
442900021001
443000021001           MOVE SPACES                 TO  DEALER-MAILING-INSTR-RECD.
443100021001           MOVE AD-DEALER              TO  DEALER-CODE
443200021001                                           OF DEALER-MAILING-INSTR-RECD.
443300021001           MOVE "CONFMSPR  "           TO  FORM-CODE
443400021001                                           OF DEALER-MAILING-INSTR-RECD.
443500021001           START DEALER-MAILING-INSTR
443600021001               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
443700021001               INVALID KEY
443800021001                   GO TO LR1-0070-0010.
443900021001
444000021001           READ DEALER-MAILING-INSTR NEXT
444100021001                                       AT  END
444200021001               GO TO LR1-0070-0010.
444300021001
444400021001           IF  FORM-CODE
444500021001               OF DEALER-MAILING-INSTR-RECD
444600021001                          IS NOT EQUAL TO  "CONFMSPR  "
444700021001           OR  DEALER-CODE
444800021001               OF DEALER-MAILING-INSTR-RECD
444900021001                          IS NOT EQUAL TO  AD-DEALER
445000021001               GO TO LR1-0070-0010.
445100021001
445200021001           MOVE "Y"                    TO  WS-CLTSPR-SW.
445300021001           GO TO LR1-0070-0020.
445400021001
445500021001       LR1-0070-0010.
445600021001
445700021001      *****
445800021001      *****    Processing a non-nominee account.  The client statement
445900021001      *****    copy is to be printed, according to the Dealer Mailing
446000021001      *****    Instruction.  Now read through the Dealer Representative
446100021001      *****    Mailing Instruction.  If the form CONFMSPR is found, the
446200021001      *****    client statement copy is to be suppressed.
446300021001      *****
446400021001
446500021001           MOVE SPACES                 TO  DLRREP-MAILING-INSTR-RECD.
446600021001           MOVE AD-DEALER              TO  DEALER-CODE
446700021001                                           OF DLRREP-MAILING-INSTR-RECD.
446800021001           MOVE AD-SALESREP            TO  DEALER-REP-CODE
446900021001                                           OF DLRREP-MAILING-INSTR-RECD.
447000021001           MOVE "CONFMSPR  "           TO  FORM-CODE
447100021001                                           OF DLRREP-MAILING-INSTR-RECD.
447200021001           START DEALER-REP-MAILING-INSTR
447300021001               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
447400021001               INVALID KEY
447500021001                   GO TO LR1-0070-0020.
447600021001
447700021001           READ DEALER-REP-MAILING-INSTR NEXT
447800021001                                       AT  END
447900021001               GO TO LR1-0070-0020.
448000021001
448100021001           IF  FORM-CODE
448200021001               OF DLRREP-MAILING-INSTR-RECD
448300021001                          IS NOT EQUAL TO  "CONFMSPR  "
448400021001           OR  DEALER-REP-CODE
448500021001               OF DLRREP-MAILING-INSTR-RECD
448600021001                          IS NOT EQUAL TO  AD-SALESREP
448700021001           OR  DEALER-CODE
448800021001               OF DLRREP-MAILING-INSTR-RECD
448900021001                          IS NOT EQUAL TO  AD-DEALER
449000021001               GO TO LR1-0070-0020.
449100021001
449200021001           MOVE "Y"                    TO  WS-CLTSPR-SW.
449300021001
449400021001       LR1-0070-0020.
449500021001           GO TO LR1-0070-0050.
449600021001
449700021001       LR1-0070-0030.
449800021001
449900021001      *****
450000021001      *****    Processing a nominee account.  Read through the Nominee
450100021001      *****    Mailing Instruction.  If the form CONFMCLT is not found,
450200021001      *****    the client copy statement is to be suppressed.
450300021001      *****
450400021001
450500021001           IF  WS-NOMINEE-CODE   EQUAL TO  SPACES
450600021001               GO TO LR1-0070-0050.
450700021001
450800021001           MOVE SPACES                 TO  NOMINEE-MAILING-INST-RECD.
450900021001           MOVE WS-NOMINEE-CODE        TO  NOMINEE-CODE
451000021001                                           OF NOMINEE-MAILING-INST-RECD.
451100021001           MOVE "CONFMCLT  "           TO  FORM-CODE
451200021001                                           OF NOMINEE-MAILING-INST-RECD.
451300021001           START NOMINEE-MAILING-INSTRUCTIONS
451400021001               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
451500021001               INVALID KEY
451600021001                   GO TO LR1-0070-0040.
451700021001
451800021001           READ NOMINEE-MAILING-INSTRUCTIONS NEXT
451900021001                                       AT  END
452000021001               GO TO LR1-0070-0040.
452100021001
452200021001           IF  FORM-CODE
452300021001               OF NOMINEE-MAILING-INST-RECD
452400021001                          IS NOT EQUAL TO  "CONFMCLT  "
452500021001           OR  NOMINEE-CODE
452600021001               OF NOMINEE-MAILING-INST-RECD
452700021001                          IS NOT EQUAL TO  WS-NOMINEE-CODE
452800021001               GO TO LR1-0070-0040.
452900021001
453000021001           GO TO LR1-0070-0050.
453100021001
453200021001       LR1-0070-0040.
453300021001           MOVE "Y"                    TO  WS-CLTSPR-SW.
453400021001
453500021001       LR1-0070-0050.
453600021001
453700021001      *****
453800021001      *****    Read through the Dealer Mailing Instruction to determine
453900021001      *****    if the Statement Print Header is to be flagged to print
454000021001      *****    dealer copies of the statements.
454100021001      *****
454200021001
454300021001           MOVE SPACES                 TO  WS-DEAMLGINS-REC.
454400021001
454500021001           MOVE SPACES                 TO  DEALER-MAILING-INSTR-RECD.
454600021001           MOVE AD-DEALER              TO  DEALER-CODE
454700021001                                           OF DEALER-MAILING-INSTR-RECD.
454800021001           MOVE "CONFMDLR  "           TO  FORM-CODE
454900021001                                           OF DEALER-MAILING-INSTR-RECD.
455000021001           START DEALER-MAILING-INSTR
455100021001               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
455200021001               INVALID KEY
455300021001                   GO TO LR1-0080.
455400021001
455500021001           READ DEALER-MAILING-INSTR NEXT
455600021001                                       AT  END
455700021001               GO TO LR1-0080.
455800021001
455900021001           IF  FORM-CODE
456000021001               OF DEALER-MAILING-INSTR-RECD
456100021001                          IS NOT EQUAL TO  "CONFMDLR  "
456200021001           OR  DEALER-CODE
456300021001               OF DEALER-MAILING-INSTR-RECD
456400021001                          IS NOT EQUAL TO  AD-DEALER
456500021001               GO TO LR1-0080.
456600021001
456700021001           MOVE DEALER-MAILING-INSTR-RECD
456800021001                                       TO  WS-DEAMLGINS-REC.
456900021001
457000021001       LR1-0080.
457100021001
457200021001      *****
457300021001      *****    Determine if the Statement Print Header is to be flagged
457400021001      *****    to print dealer representative copies of the statements.
457500021001      *****    Initially read through the Dealer Mailing Instruction.
457600021001      *****    If a record is not found, read through the Dealer
457700021001      *****    Representative Mailing Instuction.
457800021001      *****
457900021001
458000021001           MOVE SPACES                 TO  WS-DERMLGINS-REC.
458100021001
458200021001           MOVE SPACES                 TO  DEALER-MAILING-INSTR-RECD.
458300021001           MOVE AD-DEALER              TO  DEALER-CODE
458400021001                                           OF DEALER-MAILING-INSTR-RECD.
458500021001           MOVE "CONFMREP  "           TO  FORM-CODE
458600021001                                           OF DEALER-MAILING-INSTR-RECD.
458700021001           START DEALER-MAILING-INSTR
458800021001               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
458900021001               INVALID KEY
459000021001                   GO TO LR1-0080-0010.
459100021001
459200021001           READ DEALER-MAILING-INSTR NEXT
459300021001                                       AT  END
459400021001               GO TO LR1-0080-0010.
459500021001
459600021001           IF  FORM-CODE
459700021001               OF DEALER-MAILING-INSTR-RECD
459800021001                          IS NOT EQUAL TO  "CONFMREP  "
459900021001           OR  DEALER-CODE
460000021001               OF DEALER-MAILING-INSTR-RECD
460100021001                          IS NOT EQUAL TO  AD-DEALER
460200021001               GO TO LR1-0080-0010.
460300021001
460400021001           MOVE CORR MFADEAMIP
460500021001                     OF DEALER-MAILING-INSTR-RECD
460600021001                                       TO  MFADERMIP
460700021001                                           OF WS-DERMLGINS-REC.
460800021001           MOVE AD-SALESREP            TO  DEALER-REP-CODE
460900021001                                           OF WS-DERMLGINS-REC.
461000021001           GO TO LR1-0090.
461100021001
461200021001       LR1-0080-0010.
461300021001           MOVE SPACES                 TO  DLRREP-MAILING-INSTR-RECD.
461400021001           MOVE AD-DEALER              TO  DEALER-CODE
461500021001                                           OF DLRREP-MAILING-INSTR-RECD.
461600021001           MOVE AD-SALESREP            TO  DEALER-REP-CODE
461700021001                                           OF DLRREP-MAILING-INSTR-RECD.
461800021001           MOVE "CONFMREP  "           TO  FORM-CODE
461900021001                                           OF DLRREP-MAILING-INSTR-RECD.
462000021001           START DEALER-REP-MAILING-INSTR
462100021001               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
462200021001               INVALID KEY
462300021001                   GO TO LR1-0090.
462400021001
462500021001           READ DEALER-REP-MAILING-INSTR NEXT
462600021001                                       AT  END
462700021001               GO TO LR1-0090.
462800021001
462900021001           IF  FORM-CODE
463000021001               OF DLRREP-MAILING-INSTR-RECD
463100021001                          IS NOT EQUAL TO  "CONFMREP  "
463200021001           OR  DEALER-REP-CODE
463300021001               OF DLRREP-MAILING-INSTR-RECD
463400021001                          IS NOT EQUAL TO  AD-SALESREP
463500021001           OR  DEALER-CODE
463600021001               OF DLRREP-MAILING-INSTR-RECD
463700021001                          IS NOT EQUAL TO  AD-DEALER
463800021001               GO TO LR1-0090.
463900021001
464000021001           MOVE DLRREP-MAILING-INSTR-RECD
464100021001                                       TO  WS-DERMLGINS-REC.
464200021001
464300021001       LR1-0090.
464400021001
464500021001      *****
464600021001      *****    Read through the Nominee Instruction to determine if the
464700021001      *****    Statement Print Header is to be flagged to print nominee
464800021001      *****    copies of the statements.
464900021001      *****
465000021001
465100021001           MOVE SPACES                 TO  WS-NOMMLGINS-REC.
465200021001           IF  WS-NOMINEE-CODE   EQUAL TO  SPACES
465300021001               GO TO LR1-0090-0010.
465400021001
465500021001           MOVE SPACES                 TO  NOMINEE-MAILING-INST-RECD.
465600021001           MOVE WS-NOMINEE-CODE        TO  NOMINEE-CODE
465700021001                                           OF NOMINEE-MAILING-INST-RECD.
465800021001           MOVE "CONFMNOM  "           TO  FORM-CODE
465900021001                                           OF NOMINEE-MAILING-INST-RECD.
466000021001           START NOMINEE-MAILING-INSTRUCTIONS
466100021001               KEY        IS GREATER THAN  EXTERNALLY-DESCRIBED-KEY
466200021001               INVALID KEY
466300021001                   GO TO LR1-0090-0010.
466400021001
466500021001           READ NOMINEE-MAILING-INSTRUCTIONS NEXT
466600021001                                       AT  END
466700021001               GO TO LR1-0090-0010.
466800021001
466900021001           IF  FORM-CODE
467000021001               OF NOMINEE-MAILING-INST-RECD
467100021001                          IS NOT EQUAL TO  "CONFMNOM  "
467200021001           OR  NOMINEE-CODE
467300021001               OF NOMINEE-MAILING-INST-RECD
467400021001                          IS NOT EQUAL TO  WS-NOMINEE-CODE
467500021001               GO TO LR1-0090-0010.
467600021001
467700021001           MOVE NOMINEE-MAILING-INST-RECD
467800021001                                       TO  WS-NOMMLGINS-REC.
467900021001
468000021001       LR1-0090-0010.
468100021001
468200021001      *****
468300021001      *****    Format the Statement Print Header record.
468400021001      *****
468500021001
468600021001           MOVE "N"                    TO  WS-STMT-PRT-HDR-WSW.
468700021001           INITIALIZE                      STMT-PRT-HDR-RECD.
468800021001           MOVE AD-INVESTOR-NO         TO  INVESTOR-NO
468900021001                                           OF STMT-PRT-HDR-RECD.
469000021001           MOVE AD-ACCOUNT             TO  ACCOUNT
469100021001                                           OF STMT-PRT-HDR-RECD.
469200021001           MOVE AD-LANGUAGE            TO  LANGUAGE-CODE
469300021001                                           OF STMT-PRT-HDR-RECD.
469400021001           MOVE AD-DEALER              TO  DEALER
469500021001                                           OF STMT-PRT-HDR-RECD.
469600021001           MOVE AD-SALESREP            TO  DEALER-REP-CODE
469700021001                                           OF STMT-PRT-HDR-RECD.
469800021001           IF II-SIN-NO IS NUMERIC
469900021001              MOVE II-SIN-NO           TO  SOCIAL-INSURANCE-NO
470000021001                                       OF STMT-PRT-HDR-RECD
470100021001           ELSE
470200021001              MOVE ZEROES              TO  SOCIAL-INSURANCE-NO
470300021001                                       OF STMT-PRT-HDR-RECD.
470400021001           MOVE WS-CLTSPR-SW           TO  CLIENT-COPY-SUPPRESSED
470500021001                                           OF STMT-PRT-HDR-RECD.
470600021001           MOVE II-HOLD-MAIL           TO  HOLD-MAIL
470700021001                                           OF STMT-PRT-HDR-RECD.
470800021001           MOVE BRANCH-CODE
470900021001                OF WS-DEAMLGINS-REC    TO  DEALER-BRANCH-CODE
471000021001                                           OF STMT-PRT-HDR-RECD.
471100021001           MOVE FREQUENCY-CODE
471200021001                OF WS-DEAMLGINS-REC    TO  DEALER-FREQUENCY-CODE
471300021001                                           OF STMT-PRT-HDR-RECD.
471400021001           MOVE METHOD-OF-DELIVERY
471500021001                OF WS-DEAMLGINS-REC    TO  DEALER-METHOD-OF-DELIVERY
471600021001                                           OF STMT-PRT-HDR-RECD.
471700021001           MOVE SEND-TO
471800021001                OF WS-DEAMLGINS-REC    TO  DEALER-SEND-TO
471900021001                                           OF STMT-PRT-HDR-RECD.
472000021001           MOVE BRANCH-CODE
472100021001                OF WS-DERMLGINS-REC    TO  DLR-REP-BRANCH-CODE
472200021001                                           OF STMT-PRT-HDR-RECD.
472300021001           MOVE FREQUENCY-CODE
472400021001                OF WS-DERMLGINS-REC    TO  DLR-REP-FREQUENCY-CODE
472500021001                                           OF STMT-PRT-HDR-RECD.
472600021001           MOVE METHOD-OF-DELIVERY
472700021001                OF WS-DERMLGINS-REC    TO  DLR-REP-METHOD-OF-DELIVERY
472800021001                                           OF STMT-PRT-HDR-RECD.
472900021001           MOVE SEND-TO
473000021001                OF WS-DERMLGINS-REC    TO  DLR-REP-SEND-TO
473100021001                                           OF STMT-PRT-HDR-RECD.
473200021001           MOVE WS-NOMINEE-CODE        TO  NOMINEE-CODE
473300021001                                           OF STMT-PRT-HDR-RECD.
473400021001           MOVE BRANCH-CODE
473500021001                OF WS-NOMMLGINS-REC    TO  NOMINEE-BRANCH-CODE
473600021001                                           OF STMT-PRT-HDR-RECD.
473700021001           MOVE FREQUENCY-CODE
473800021001                OF WS-NOMMLGINS-REC    TO  NOMINEE-FREQUENCY-CODE
473900021001                                           OF STMT-PRT-HDR-RECD.
474000021001           MOVE METHOD-OF-DELIVERY
474100021001                OF WS-NOMMLGINS-REC    TO  NOMINEE-METHOD-OF-DELIVERY
474200021001                                           OF STMT-PRT-HDR-RECD.
474300021001           MOVE SEND-TO
474400021001                OF WS-NOMMLGINS-REC    TO  NOMINEE-SEND-TO
474500021001                                           OF STMT-PRT-HDR-RECD.
474600021001           MOVE II-COUNTRY-CODE        TO  COUNTRY-CODE
474700021001                                           OF STMT-PRT-HDR-RECD.
474800021001           MOVE AD-START-DATE          TO  START-DATE
474900021001                                           OF STMT-PRT-HDR-RECD.
475000021001           MOVE AD-END-DATE            TO  END-DATE
475100021001                                           OF STMT-PRT-HDR-RECD.
475200021003           MOVE WS-ENTERED-BY          TO  ENTERED-BY
475300021001                                           OF STMT-PRT-HDR-RECD.
475400021001
475500021001      *****
475600021001      *****    Initialize the statement currency totals.
475700021001      *****
475800021001
475900021001           SET SC                      TO  1.
476000021001
476100021001       LR1-0100.
476200021001           MOVE ZEROES         TO  WS-SC-MARKET-VALUE (SC).
476300021002           MOVE ZEROES         TO  WS-SC-MARKET-VALUE-FUND (SC).
476400021002           MOVE ZEROES         TO  WS-SC-MARKET-VALUE-GIC-DII (SC).
476500021001           MOVE "N"                    TO  WS-SC-RPTIND (SC).
476600021001           IF  SC            IS LESS THAN  WS-SC-MAX
476700021001               SET SC               UP BY  1
476800021001               GO TO LR1-0100.
476900021001
477000021001      *****
477100021001      *****    Initialize the statement account funds table.
477200021001      *****
477300021001
477400021001           MOVE SPACES                 TO  WS-STMT-ACCOUNT-FUND-TABLE.
477500021001           MOVE ZEROES                 TO  WS-SAF-LST.
477600021001
477700021007      *****
477800021001      *****    Initialize the GIC information table.
477900021001      *****
478000021001
478100021001           INITIALIZE                  WS-GIC-INFO-TBL.
478200021001           MOVE ZEROES                 TO  WS-GIC-LST.
478300021001
478400021001      *****
478500021001      *****    Initialize the Account Detail (FUND, GIC & DII) table.
478600021001      *****
478700021001
478800021001           INITIALIZE                  WS-ACCOUNT-FUND-TABLE.
478900021001           MOVE ZEROES                 TO  WS-AFD-LST.
479000021001
479100021001           INITIALIZE                  WS-ACCOUNT-GIC-TABLE.
479200021001           MOVE ZEROES                 TO  WS-AGD-LST.
479300021001
479400021001           INITIALIZE                  WS-ACCOUNT-DII-TABLE.
479500021001           MOVE ZEROES                 TO  WS-ADID-LST.
479600021001
479700021001      *****
479800021001      ***** If multiple accounts of an investor have Confirms,
479900021001      ***** WS-STMT-DTA-SW-80DII must be reinitialized for every
480000021001      ***** account.
480100021001      *****
480200021001
480300021007           MOVE "N"                    TO  WS-STMT-DTA-SW-25.
480400021007           MOVE "N"                    TO  WS-STMT-DTA-SW-20GIC.
480500021007           MOVE "N"                    TO  WS-STMT-DTA-SW-20DII.
480600021007           MOVE "N"                    TO  WS-STMT-DTA-SW-20FUND.
480700021007           MOVE "N"                    TO  WS-STMT-DTA-SW-80DII.
480800021007           MOVE "N"                    TO  WS-STMT-DTA-SW-80FUND.
480900021001
481000021001      *****
481100021001      *****    Initialize the statement transaction controls.
481200021001      *****
481300021001
481400021001           MOVE LOW-VALUES             TO  CURR-CTLS-DPR.
481500021001           MOVE LOW-VALUES             TO  PREV-CTLS-DPR.
481600021001
481700021001       LR1-EXIT.
481800021001           EXIT.
481900021001      /
482000021001       FORMAT-ACTTYP-DESC.
482100021001
482200021001      ******************************************************************
482300021001      *                                                                *
482400021001      *    F M T .   A C C O U N T   T Y P E   D E S C R I P T I O N   *
482500021001      *                                                                *
482600021001      ******************************************************************
482700021001
482800021001      *****
482900021001      *****    Initialize the work items.
483000021001      *****
483100021001
483200021001           MOVE SPACES                 TO  WS-ACTTYPIN-SFX.
483300021001           MOVE SPACES                 TO  WS-ACTTYPLIT1.
483400021001           MOVE SPACES                 TO  WS-ACTTYPLIT2.
483500021001           MOVE SPACES                 TO  WS-ACTTYPLIT3.
483600021001           MOVE SPACES                 TO  WS-ACTTYPOUT.
483700021007           MOVE SPACES                 TO  WS-NOMACTTYPOUT.
483800021001           MOVE SPACES                 TO  WS-NOMACTTYPLIT1.
483900021001
484000021001      *****
484100021001      *****    The account type description will be formatted
484200021001      *****    If NOMINEE, format the description.
484300021001      *****
484400021001
484500021007       FAD-0001.
484600021001
484700021007           IF  WS-ACTTYPNOM   IS NOT = "Y"
484800021007               GO TO FAD-0003.
484900021001
485000021007           INITIALIZE INVESTOR-J-REC.
485100021007           MOVE PR-INVESTOR-NO TO ACIVRNO OF INVESTOR-J-REC.
485200021007           MOVE PR-ACCOUNT     TO ACACTNO OF INVESTOR-J-REC.
485300021001
485400021007           START INVESTOR-JOIN
485500021007                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
485600021007                 INVALID KEY
485700021007                 GO TO FAD-0001.
485800021001
485900021007       FAD-0002.
486000021007           READ INVESTOR-JOIN NEXT RECORD
486100021007                AT END
486200021007                GO TO FAD-0030
486300021007           END-READ.
486400021001
486500021007           IF PR-INVESTOR-NO IS NOT = ACIVRNO
486600021007                                OF INVESTOR-J-REC
486700021007              GO TO FAD-0030.
486800021001
486900021007           IF PR-ACCOUNT     IS NOT = ACACTNO
487000021007                                OF INVESTOR-J-REC
487100021007              GO TO FAD-0030.
487200021001
487300021007           INITIALIZE MFANMTPYP.
487400021001
487500021007           MOVE ANACTYP OF INVESTOR-JOIN TO NOMINEE-ACCOUNT-TYPE
487600021007                          OF NOMINEE-ACCOUNT-TYPE-DESCR.
487700021001
487800021007           MOVE WS-ACTTYPLNG             TO LANGUAGE-CODE
487900021007                             OF NOMINEE-ACCOUNT-TYPE-DESCR.
488000021001
488100021007           READ NOMINEE-ACCOUNT-TYPE-DESCR
488200021007                INVALID KEY
488300021007                MOVE SPACES TO WS-NOMACTTYPOUT
488400021007           END-READ.
488500021001
488600021007           MOVE ACCOUNT-TYPE-DESCR OF NOMINEE-ACCOUNT-TYPE-DESCR
488700021007                TO WS-NOMACTTYPOUT.
488800021001
488900021007           IF  WS-ACTTYPSPS       IS EQUAL TO  "Y"
489000021001               IF  WS-ACTTYPLNG = "E"
489100021001                   MOVE "SPOUSAL      "      TO  WS-NOMACTTYPLIT1
489200021001                   STRING WS-NOMACTTYPLIT1
489300021001                             DELIMITED BY  "  ",
489400021001                          " "        DELIMITED BY  SIZE,
489500021001                          WS-NOMACTTYPOUT
489600021001                                     DELIMITED BY  SIZE,
489700021001                                     INTO  WS-ACTTYPOUT
489800021001               ELSE
489900021001                   MOVE "DE CONJOINT  "      TO  WS-NOMACTTYPLIT1
490000021001                   STRING WS-NOMACTTYPOUT
490100021001                             DELIMITED BY  "  ",
490200021001                          " "        DELIMITED BY  SIZE,
490300021001                          WS-NOMACTTYPLIT1
490400021001                                     DELIMITED BY  SIZE,
490500021001                                     INTO  WS-ACTTYPOUT
490600021001               END-IF
490700021001           ELSE
490800021001               MOVE WS-NOMACTTYPOUT      TO  WS-ACTTYPOUT
490900021007           END-IF.
491000021001
491100021007           GO TO FAD-0030.
491200021001
491300021007       FAD-0003.
491400021001
491500021001           IF WS-ACTTYPLNG = "F"
491600021001              GO TO FAD-0040.
491700021001      *****
491800021001      *****    The English description may be formatted with a LOCKED-IN
491900021001      *****    literal, a SPOUSAL literal, a GROUP literal and the
492000021001      *****    original account type description.  If any of the
492100021001      *****    literals are not applicable, they will be suppressed.
492200021001      *****    Initially, determine which literals are applicable.
492300021001      *****
492400021001
492500021001           IF  WS-ACTTYPLCK   IS EQUAL TO  "Y"
492600021001           AND WS-ACTTYPSHT  NOT EQUAL TO  "LIRA "
492700021001               MOVE "LOCKED-IN    "    TO  WS-ACTTYPLIT1.
492800021001           IF  WS-ACTTYPGRP   IS EQUAL TO  "Y"
492900021001               MOVE "GROUP        "    TO  WS-ACTTYPLIT2.
493000021001           IF  WS-ACTTYPSPS   IS EQUAL TO  "Y"
493100021001               MOVE "SPOUSAL      "    TO  WS-ACTTYPLIT3.
493200021001
493300021001      *****
493400021001      *****    Compress the optional English literals.
493500021001      *****
493600021001
493700021001           IF  WS-ACTTYPLIT1 NOT EQUAL TO  SPACES
493800021001               GO TO FAD-0010.
493900021001
494000021001           IF  WS-ACTTYPLIT2 NOT EQUAL TO  SPACES
494100021001               MOVE WS-ACTTYPLIT2      TO  WS-ACTTYPLIT1
494200021001               MOVE SPACES             TO  WS-ACTTYPLIT2
494300021001               GO TO FAD-0010.
494400021001
494500021001           IF  WS-ACTTYPLIT3 NOT EQUAL TO  SPACES
494600021001               MOVE WS-ACTTYPLIT3      TO  WS-ACTTYPLIT1
494700021001               MOVE SPACES             TO  WS-ACTTYPLIT3
494800021001               GO TO FAD-0020.
494900021001
495000021001           GO TO FAD-0020.
495100021001
495200021001       FAD-0010.
495300021001           IF  WS-ACTTYPLIT2  IS EQUAL TO  SPACES
495400021001           AND WS-ACTTYPLIT3 NOT EQUAL TO  SPACES
495500021001               MOVE WS-ACTTYPLIT3      TO  WS-ACTTYPLIT2
495600021001               MOVE SPACES             TO  WS-ACTTYPLIT3.
495700021001
495800021001       FAD-0020.
495900021001
496000021001      *****
496100021001      *****    Format the English account type description based on the
496200021001      *****    number of optional literals applicable.
496300021001      *****
496400021001
496500021001           IF  WS-ACTTYPLIT1  IS EQUAL TO  SPACES
496600021001               MOVE WS-ACTTYPIN        TO  WS-ACTTYPOUT
496700021001               GO TO FAD-0030.
496800021001
496900021001           IF  WS-ACTTYPLIT2  IS EQUAL TO  SPACES
497000021001               STRING WS-ACTTYPLIT1
497100021001                             DELIMITED BY  "  ",
497200021001                      " "    DELIMITED BY  SIZE,
497300021001                      WS-ACTTYPIN
497400021001                             DELIMITED BY  "  ",
497500021001                                     INTO  WS-ACTTYPOUT
497600021001               GO TO FAD-0030.
497700021001
497800021001           IF  WS-ACTTYPLIT3  IS EQUAL TO  SPACES
497900021001               STRING WS-ACTTYPLIT1
498000021001                             DELIMITED BY  "  ",
498100021001                      " "    DELIMITED BY  SIZE,
498200021001                      WS-ACTTYPLIT2
498300021001                             DELIMITED BY  "  ",
498400021001                      " "    DELIMITED BY  SIZE,
498500021001                      WS-ACTTYPIN
498600021001                             DELIMITED BY  "  ",
498700021001                                     INTO  WS-ACTTYPOUT
498800021001               GO TO FAD-0030.
498900021001
499000021001           STRING WS-ACTTYPLIT1
499100021001                             DELIMITED BY  "  ",
499200021001                  " "        DELIMITED BY  SIZE,
499300021001                  WS-ACTTYPLIT2
499400021001                             DELIMITED BY  "  ",
499500021001                  " "        DELIMITED BY  SIZE,
499600021001                  WS-ACTTYPLIT3
499700021001                             DELIMITED BY  "  ",
499800021001                  " "        DELIMITED BY  SIZE,
499900021001                  WS-ACTTYPIN
500000021001                             DELIMITED BY  "  ",
500100021001                                     INTO  WS-ACTTYPOUT.
500200021001
500300021001       FAD-0030.
500400021001           GO TO FAD-EXIT.
500500021001
500600021001
500700021001       FAD-0040.
500800021001
500900021001      *****
501000021001      *****    The French description may be formatted with a GROUP
501100021001      *****    literal, a LOCKED-IN literal, a SPOUSAL literal and the
501200021001      *****    original account type description.  If any of the
501300021001      *****    literals are not applicable, they will be suppressed.
501400021001      *****    Initially, determine which literals are applicable.
501500021001      *****
501600021001
501700021001           IF  WS-ACTTYPGRP   IS EQUAL TO  "Y"
501800021001               MOVE "COLLECTIF    "    TO  WS-ACTTYPLIT1.
501900021001           IF  WS-ACTTYPLCK   IS EQUAL TO  "Y"
502000021001           AND WS-ACTTYPSHT  NOT EQUAL TO  "LIRA "
502100021001               MOVE "IMMOBILISE   "    TO  WS-ACTTYPLIT2.
502200021001           IF  WS-ACTTYPSPS   IS EQUAL TO  "Y"
502300021001               MOVE "DE CONJOINT  "    TO  WS-ACTTYPLIT3.
502400021001
502500021001      *****
502600021001      *****    Compress the optional French literals.
502700021001      *****
502800021001
502900021001           IF  WS-ACTTYPLIT1 NOT EQUAL TO  SPACES
503000021001               GO TO FAD-0050.
503100021001
503200021001           IF  WS-ACTTYPLIT2 NOT EQUAL TO  SPACES
503300021001               MOVE WS-ACTTYPLIT2      TO  WS-ACTTYPLIT1
503400021001               MOVE SPACES             TO  WS-ACTTYPLIT2
503500021001               GO TO FAD-0050.
503600021001
503700021001           IF  WS-ACTTYPLIT3 NOT EQUAL TO  SPACES
503800021001               MOVE WS-ACTTYPLIT3      TO  WS-ACTTYPLIT1
503900021001               MOVE SPACES             TO  WS-ACTTYPLIT3
504000021001               GO TO FAD-0060.
504100021001
504200021001           GO TO FAD-0060.
504300021001
504400021001       FAD-0050.
504500021001           IF  WS-ACTTYPLIT2  IS EQUAL TO  SPACES
504600021001           AND WS-ACTTYPLIT3 NOT EQUAL TO  SPACES
504700021001               MOVE WS-ACTTYPLIT3      TO  WS-ACTTYPLIT2
504800021001               MOVE SPACES             TO  WS-ACTTYPLIT3.
504900021001
505000021001       FAD-0060.
505100021001
505200021001      *****
505300021001      *****    Format the French account type description.  Since the
505400021001      *****    optional literals come after the original account
505500021001      *****    description and they have been compressed, it is not
505600021001      *****    necessary to base the formatting on which option literals
505700021001      *****    are applicable.
505800021001      *****
505900021001
506000021001           STRING WS-ACTTYPIN
506100021001                             DELIMITED BY  "  ",
506200021001                  " "        DELIMITED BY  SIZE,
506300021001                  WS-ACTTYPLIT1
506400021001                             DELIMITED BY  "  ",
506500021001                  " "        DELIMITED BY  SIZE,
506600021001                  WS-ACTTYPLIT2
506700021001                             DELIMITED BY  "  ",
506800021001                  " "        DELIMITED BY  SIZE,
506900021001                  WS-ACTTYPLIT3
507000021001                             DELIMITED BY  "  ",
507100021001                                     INTO  WS-ACTTYPOUT.
507200021001
507300021001       FAD-EXIT.
507400021001           EXIT.
507500021001      /
507600021001       PRINT-ERR-LINE.
507700021001
507800021001      ******************************************************************
507900021001      *                                                                *
508000021001      *    P R I N T   E R R O R   L I N E   R O U T I N E             *
508100021001      *                                                                *
508200021001      ******************************************************************
508300021001
508400021001      *****
508500021001      *****    If the error line has not been formatted, format it using
508600021001      *****    the Statement File - Primary record.
508700021001      *****
508800021001
508900021001           IF  ERROR-LINE-1  NOT EQUAL TO  SPACES
509000021001               GO TO PEL-0010.
509100021001
509200021001           MOVE PR-INVESTOR-NO         TO  EL1-INVESTOR-NO.
509300021001           MOVE PR-ACCOUNT             TO  EL1-ACCOUNT.
509400021001           MOVE PR-SECTION-NO          TO  EL1-SECTION-NO.
509500021001           MOVE "-"                    TO  EL1-SECTION-LITDSH.
509600021001           MOVE PR-SECTION-SEQUENCE    TO  EL1-SECTION-SEQUENCE.
509700021001           MOVE PR-LANGUAGE-CODE       TO  EL1-LANGUAGE-CODE.
509800021001           MOVE PR-DEALER              TO  EL1-DEALER.
509900021001           MOVE PR-DEALER-REP-CODE     TO  EL1-DEALER-REP-CODE.
510000021001           MOVE WS-MSG (MSG)           TO  EL1-MSG.
510100021001
510200021001       PEL-0010.
510300021001
510400021001      *****
510500021001      *****    If the page is full, start a new page and print the
510600021001      *****    Heading lines.
510700021001      *****
510800021001
510900021001           IF  WS-LNECNT  IS GREATER THAN  WS-LNEMAX
511000021001               PERFORM PRINT-HDG-LINE THRU PHL-EXIT.
511100021001
511200021001      *****
511300021001      *****    Print the error line.
511400021001      *****
511500021001
511600021001           WRITE PRINT-RECD          FROM  ERROR-LINE-1
511700021001                         AFTER  ADVANCING  1.
511800021001           ADD 1                       TO  WS-LNECNT.
511900021001
512000021001       PEL-EXIT.
512100021001           EXIT.
512200021001      /
512300021001       INITIAL-LOGIC-RTN.
512400021001
512500021001      ******************************************************************
512600021001      *                                                                *
512700021001      *    I N I T I A L   L O G I C   R O U T I N E                   *
512800021001      *                                                                *
512900021001      ******************************************************************
513000021001
513100021001      *****
513200021001      *****    Retrieve the Local Data Area.
513300021001      *****
513400021001
513500021001           ACCEPT WS-LOCAL-DATA-AREA FROM  WS-LOCAL.
513600090223      * RFS 64527 BEGIN
513700090822R72304*    MOVE 500 TO ARYSIZ-1.
513800090223      * RFS 64527 END
513900021001
514000021001      *****
514100021001      *****    Using the Management Company Code, determine which
514200021001      *****    version of the statement is to be produced.  The standard
514300021001      *****    statement is version 0, DJT use version 1. MLA use
514400021001      *****    version 2. UBS use version 3.
514500021001      *****
514600021001
514700021001           MOVE ZEROES                 TO  WS-STMTVRSN.
514800021001
514900021001           EVALUATE WS-LDA-STMT-VERSION
515000021002             WHEN "F"         MOVE  "F"   TO WS-STMTVRSN
515100021001           END-EVALUATE.
515200021001
515300021001       ILR-0010.
515400021001
515500021001      *****
515600021001      *****    Initialize the program defined work items.
515700021001      *****
515800021001
515900021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT.
516000021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-00.
516100021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-05.
516200021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-10.
516300021002           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-12.
516400021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-15.
516500141007141165     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-16.
516600021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-20.
516700060618R35042     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-21.
516800021002           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-25.
516900130408117038     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-22.
517000021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-30.
517100021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-35.
517200021002           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-40.
517300021002           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-43.
517400021002           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-45.
517500021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-50.
517600021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-60.
517700021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-62.
517800091125R69515     MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-63.
517900021002           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-67.
518000021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-70.
518100021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-82.
518200021001           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-84.
518300021002           MOVE ZEROES                 TO  WS-STMT-DTA-BCNT-90.
518400021001           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT.
518500021001           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-01.
518600021001           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-05.
518700021001           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-10.
518800021001           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-20.
518900021001           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-80.
519000021001           MOVE ZEROES                 TO  WS-STMT-DTA-SCNT-84.
519100021001           MOVE ZEROES                 TO  WS-STMT-PRT-DTL-WCNT.
519200021001           MOVE ZEROES                 TO  WS-STMT-PRT-HDR-WCNT.
519300021001           MOVE SPACES                 TO  US-TABLE.
519400021001
519500021001           MOVE 100                    TO  WS-SAF-MAX.
519600021001           MOVE 2                      TO  WS-SC-MAX.
519700021001           MOVE 1000                   TO  WS-SIA-MAX.
519800021001           MOVE 87                     TO  WS-SPL-MAX.
519900021001           MOVE 50                     TO  WS-II-MAX.
520000021002           MOVE 50                     TO  WS-DI-MAX.
520100021002           MOVE 100                    TO  WS-GIC-MAX.
520200021002           MOVE 100                    TO  WS-AFD-MAX.
520300021002           MOVE 50                     TO  WS-AGD-MAX.
520400021002           MOVE 50                     TO  WS-ADID-MAX.
520500021001
520600021001
520700021003           MOVE 41                     TO  WS-SPL-DTLFST.
520800021002           MOVE 74                     TO  WS-SPL-DTLLST.
520900021002           MOVE 8                      TO  WS-SPL-HDGFST.
521000021002           MOVE 14                     TO  WS-SPML-MAX.
521100021001
521200021001       ILR-0020.
521300021001
521400021001           MOVE 99                     TO  WS-LNECNT.
521500021001           MOVE 60                     TO  WS-LNEMAX.
521600021001           MOVE ZEROES                 TO  WS-PGECNT.
521700021001
521800021001           MOVE "N"                    TO  WS-EOJHDG-SW.
521900021001
522000021001           MOVE LOW-VALUES             TO  CURR-CONTROLS.
522100021001           MOVE LOW-VALUES             TO  PREV-CONTROLS.
522200021001
522300021001      *****
522400021001      *****    Format the heading literals.
522500021001      *****
522600021001
522700021001           ACCEPT WS-DATE            FROM  DATE.
522800021001           MOVE WS-DATE-YY             TO  HL1-YY.
522900021001           MOVE WS-DATE-MM             TO  HL1-MM.
523000021001           MOVE WS-DATE-DD             TO  HL1-DD.
523100021001
523200021001           ACCEPT HL1-TIME           FROM  TIME.
523300021001           INSPECT HL1-TIME REPLACING ALL  SPACE
523400021001                                       BY  ":".
523500021001           MOVE "."                    TO  HL1-TIME-DOT.
523600021001
523700021001
523800021001
523900021001
524000021001      *****
524100021001      *****    Open the Input files.
524200021001      *****
524300021001
524400021001           OPEN    INPUT   CURRENCY-FILE
524500021001                           DEALER-MAILING-INSTR
524600021001                           DEALER-FILE
524700021001                           DEALER-REP-FILE
524800021001                           DEALER-REP-MAILING-INSTR
524900021001                           DEALER-REP-ADDRESS
525000021001                           INSTITUTION-ADDRESS
525100021001                           INSTITUTION-BRANCH
525200021001                           INVESTMENT-FILE
525300021002                           INVESTMENT-NAME
525400021002                           PRODUCT-TYPE-CODES
525500021001                           INVESTOR-JOIN
525600021007                           ACCOUNT-TYPE-BK
525700021001                           NOMINEE-ACCOUNT-TYPE-DESCR
525800021001                           NOMINEE-MAILING-INSTRUCTIONS
525900021001                           STMT-MSG-FILE
526000190614      *RFS183449-Starts
526100190614      *                    STMT-DTA-FILE.
526200190614                           STMT-DTA-FILE
526300190614                           ACCOUNT-FILE-2.
526400190614      *RFS183449-Ends
526500021001
526600021001      *****
526700021001      *****    Open the Output files.
526800021001      *****
526900021001
527000021001           OPEN    OUTPUT  STMT-PRT-DTL-FILE
527100021001                           STMT-PRT-HDR-FILE
527200021001                           PRINT-FILE.
527300021001
527400021001       ILR-0040.
527500021001
527600021001      *****
527700021001      *****    Load the account type entries.
527800021001      *****
527900021001
528000021001           MOVE SPACES                 TO  WS-ACCTYP-TBL.
528100021001           MOVE ZEROES                 TO  WS-AT-LST.
528200021001
528300021001       ILR-0050.
528400021001
528500021001           READ ACCOUNT-TYPE-BK        AT  END
528600021001               GO TO ILR-0070
528700021001           END-READ
528800021001
528900021001           IF  WS-AT-LST IS NOT LESS THAN  WS-AT-MAX
529000021001               DISPLAY "ACCOUNT TYPES (MFAACTYP) EXCEED PROGRAM MAX"
529100021001               GO TO ILR-0080
529200021001           END-IF
529300021001
529400021001           ADD 1                       TO  WS-AT-LST.
529500021001           SET AT1                     TO  WS-AT-LST.
529600021001           MOVE ACCOUNT-TYPE-CODE
529700021001                OF ACCOUNT-TYPE-BK-REC TO  WS-AT-CODE (AT1).
529800021001           MOVE ACCOUNT-TYPE-RULE
529900021001                OF ACCOUNT-TYPE-BK-REC TO  WS-AT-RULE (AT1).
530000021001           GO TO ILR-0050.
530100021001
530200021001       ILR-0070.
530300021001
530400021001           IF  WS-AT-LST NOT GREATER THAN  ZEROES
530500021001               DISPLAY "NO ACCOUNT TYPES (MFAACTYP) FOUND"
530600021001           END-IF.
530700021001
530800021001       ILR-0080.
530900021001
531000021001           READ CURRENCY-FILE
531100021001                AT END
531200021001      *          GO TO ILR-EXIT
531300021001                 GO TO ILR-0090
531400021001           END-READ
531500021001
531600021001           IF BASE-CURRENCY OF CURRENCY-FILE = "Y"
531700021001              MOVE CURRENCY-DDS OF CURRENCY-FILE TO WS-B-CURRENCY
531800021001           END-IF
531900021001
532000021001           GO TO ILR-0080.
532100021001
532200021001
532300021001      *****
532400021001      *****    Load the Investment Code Table.
532500021001      *****
532600021001
532700021002       ILR-0090.
532800021001
532900021001           MOVE SPACES                 TO  WS-INVCDE-TBL.
533000021001           MOVE ZEROES                 TO  WS-IC-LST.
533100090822R72304     MOVE ZEROES                 TO  ARYSIZ-1.
533200021001
533300021001       ILR-0090-0010.
533400021001
533500021001           READ INVESTMENT-FILE        AT  END
533600090822R72304*Begins - Initialize one extra element, set array size
533700090822              SET IC UP BY 1
533800090824              MOVE IC TO ARYSIZ-1
533900090822              INITIALIZE WS-INVCDE-ELEM(IC)
534000090822R72304*Ends
534100021001              GO TO ILR-EXIT
534200021001           END-READ.
534300021001
534400090310R62547*    IF  WS-IC-LST IS NOT LESS THAN  WS-IC-MAX
534500090310R62547*        DISPLAY "INVESTMENTS (MFAINVP) EXCEED PROGRAM MAX"
534600090310R62547*        GO TO ILR-EXIT
534700090310R62547*    END-IF.
534800021001
534900021001           ADD 1                       TO  WS-IC-LST.
535000021001           SET IC                      TO  WS-IC-LST.
535100090310      * RFS 64527 BEGIN
535200090822R72304*    IF IC >= ARYSIZ-1
535300090822R72304*       ADD 500 TO ARYSIZ-1
535400090822R72304*    END-IF
535500090310      * RFS 64527 END
535600021002           MOVE INVESTMENT-CODE OF INVESTMENT-REC
535700021002                                       TO  WS-IC-CODE (IC).
535800021002           MOVE INDUSTRY-FUND-CODE OF INVESTMENT-REC
535900021002                                       TO  WS-IC-FUND (IC).
536000021002           MOVE PRODUCT-TYPE-CODE  OF INVESTMENT-REC
536100021002                                       TO  WS-IC-PROD (IC).
536200021002           MOVE ALL "*"                TO  WS-IC-NAME (IC, 1).
536300021002           MOVE ALL "*"                TO  WS-IC-NAME (IC, 2).
536400021002
536500021011           INITIALIZE INVESTMENT-NAME-REC.
536600021002           MOVE WS-IC-CODE (IC)        TO  INVESTMENT-CODE
536700021002                                           OF INVESTMENT-NAME-REC.
536800021011           MOVE SPACES                 TO  LANGUAGE-CODE
536900021011                                           OF INVESTMENT-NAME-REC.
537000021002           START INVESTMENT-NAME
537100021002               KEY       IS NOT LESS THAN  EXTERNALLY-DESCRIBED-KEY
537200021002               INVALID KEY
537300021002                   GO TO ILR-0090-0030
537400021002           END-START.
537500021002
537600021002       ILR-0090-0020.
537700021002
537800021002           READ INVESTMENT-NAME NEXT   AT  END
537900021002               GO TO ILR-0090-0030
538000021002           END-READ.
538100021002
538200021002           IF INVESTMENT-CODE OF INVESTMENT-NAME-REC
538300021002                               IS NOT EQUAL TO  WS-IC-CODE (IC)
5384000210111011  *       GO TO ILR-0090-0010
538500021011              GO TO ILR-0090-0030
538600021002           END-IF.
538700021002
538800021002           IF LANGUAGE-CODE OF INVESTMENT-NAME-REC  IS EQUAL TO  "E"
538900021002              SET ICL                 TO  1
539000021002              MOVE INVESTMENT-NAME-SHORT OF INVESTMENT-NAME-REC
539100021002                                      TO  WS-IC-NAME (IC, ICL)
539200021002           END-IF.
539300021002
539400021002           IF LANGUAGE-CODE OF INVESTMENT-NAME-REC  IS EQUAL TO  "F"
539500021002              SET ICL                 TO  2
539600021002              MOVE INVESTMENT-NAME-SHORT OF INVESTMENT-NAME-REC
539700021002                                      TO  WS-IC-NAME (IC, ICL)
539800021002           END-IF.
539900021002
540000021011           GO TO ILR-0090-0020.
540100021011
540200021002       ILR-0090-0030.
540300021002
540400021001      *****
540500021001      *****    Load the product type code entries.
540600021001      *****
540700021001
540800021001           INITIALIZE PRODUCT-TYPE-CODES-REC.
540900021001
541000021001           MOVE PRODUCT-TYPE-CODE OF INVESTMENT-REC
541100021001                    TO  PRODUCT-TYPE-CODE OF PRODUCT-TYPE-CODES-REC.
541200021001
541300021001           READ PRODUCT-TYPE-CODES
541400021001              INVALID KEY
541500021001                MOVE ZEROS          TO  PRODUCT-TYPE-RULE
541600021001                                OF PRODUCT-TYPE-CODES-REC
541700021001           END-READ.
541800021001
541900021001           MOVE PRODUCT-TYPE-RULE
542000021001                OF PRODUCT-TYPE-CODES-REC
542100021001                                       TO  WS-IC-RULE (IC).
542200021001           GO TO ILR-0090-0010.
542300021001
542400021001      **********
542500021001
542600021001       ILR-EXIT.
542700021001           EXIT.
542800021001
542900021001      **********
543000021001
543100021001      /
543200021001       END-JOB-RTN.
543300021001
543400021001      ******************************************************************
543500021001      *                                                                *
543600021001      *    E N D   J O B   R O U T I N E                               *
543700021001      *                                                                *
543800021001      ******************************************************************
543900021001
544000021001      *****
544100021001      *****    Print the Control Report on a separate page.
544200021001      *****
544300021001
544400021001           MOVE 99                     TO  WS-LNECNT.
544500021001           MOVE "N"                    TO  WS-BYPPRT-SW.
544600021001           MOVE "Y"                    TO  WS-EOJHDG-SW.
544700021001           MOVE "N"                    TO  WS-SELPRT-SW.
544800021001
544900021001           MOVE WS-MANAGEMENT-COMPANY-CODE
545000021001                                       TO  CL2-MANAGEMENT-COMPANY-CODE.
545100021001           MOVE CONTROL-LINE-2         TO  CONTROL-LINE-1.
545200021001           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
545300021001
545400021001           MOVE SPACES                 TO  CONTROL-LINE-1.
545500021001           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
545600021001
545700021001           MOVE SPACES                 TO  CONTROL-LINE-1.
545800021001           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
545900021001
546000021001           MOVE SPACES                 TO  CONTROL-LINE-1.
546100021001           MOVE WS-STMT-DTA-RLIT       TO  CL1-LIT.
546200021001           MOVE WS-STMT-DTA-RCNT       TO  CL1-CNT.
546300021001           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
546400021001
546500021001           MOVE SPACES                 TO  CONTROL-LINE-1.
546600021001           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
546700021001
546800021001           IF  WS-STMT-DTA-BCNT
546900021001                          IS GREATER THAN  ZEROES
547000021001               MOVE SPACES             TO  CONTROL-LINE-1
547100021001               MOVE WS-STMT-DTA-BLIT   TO  CL1-LIT
547200021001               MOVE WS-STMT-DTA-BCNT   TO  CL1-CNT
547300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
547400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
547500021001
547600021001           IF  WS-STMT-DTA-BCNT-00
547700021001                          IS GREATER THAN  ZEROES
547800021001               MOVE SPACES             TO  CONTROL-LINE-1
547900021001               MOVE WS-STMT-DTA-BLIT-00
548000021001                                       TO  CL1-LIT
548100021001               MOVE WS-STMT-DTA-BCNT-00
548200021001                                       TO  CL1-CNT
548300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
548400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
548500021001
548600021001           IF  WS-STMT-DTA-BCNT-05
548700021001                          IS GREATER THAN  ZEROES
548800021001               MOVE SPACES             TO  CONTROL-LINE-1
548900021001               MOVE WS-STMT-DTA-BLIT-05
549000021001                                       TO  CL1-LIT
549100021001               MOVE WS-STMT-DTA-BCNT-05
549200021001                                       TO  CL1-CNT
549300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
549400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
549500021001
549600021001           IF  WS-STMT-DTA-BCNT-10
549700021001                          IS GREATER THAN  ZEROES
549800021001               MOVE SPACES             TO  CONTROL-LINE-1
549900021001               MOVE WS-STMT-DTA-BLIT-10
550000021001                                       TO  CL1-LIT
550100021001               MOVE WS-STMT-DTA-BCNT-10
550200021001                                       TO  CL1-CNT
550300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
550400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
550500021001
550600021002           IF  WS-STMT-DTA-BCNT-12
550700021001                          IS GREATER THAN  ZEROES
550800021001               MOVE SPACES             TO  CONTROL-LINE-1
550900021001               MOVE WS-STMT-DTA-BLIT-12
551000021001                                       TO  CL1-LIT
551100021001               MOVE WS-STMT-DTA-BCNT-12
551200021001                                       TO  CL1-CNT
551300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
551400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
551500021001
551600021001           IF  WS-STMT-DTA-BCNT-15
551700021001                          IS GREATER THAN  ZEROES
551800021001               MOVE SPACES             TO  CONTROL-LINE-1
551900021001               MOVE WS-STMT-DTA-BLIT-15
552000021001                                       TO  CL1-LIT
552100021001               MOVE WS-STMT-DTA-BCNT-15
552200021001                                       TO  CL1-CNT
552300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
552400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
552500021001
552600021001           IF  WS-STMT-DTA-BCNT-20
552700021001                          IS GREATER THAN  ZEROES
552800021001               MOVE SPACES             TO  CONTROL-LINE-1
552900021001               MOVE WS-STMT-DTA-BLIT-20
553000021001                                       TO  CL1-LIT
553100021001               MOVE WS-STMT-DTA-BCNT-20
553200021001                                       TO  CL1-CNT
553300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
553400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
553500021001
553600060618R35042     IF  WS-STMT-DTA-BCNT-21
553700060618  ¦                       IS GREATER THAN  ZEROES
553800060618  ¦            MOVE SPACES             TO  CONTROL-LINE-1
553900060618  ¦            MOVE WS-STMT-DTA-BLIT-21
554000060618  ¦                                    TO  CL1-LIT
554100060618  ¦            MOVE WS-STMT-DTA-BCNT-21
554200060618  ¦                                    TO  CL1-CNT
554300060618  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
554400060618R35042         MOVE "Y"                TO  WS-BYPPRT-SW.
554500021001
554600021002           IF  WS-STMT-DTA-BCNT-25
554700021001                          IS GREATER THAN  ZEROES
554800021001               MOVE SPACES             TO  CONTROL-LINE-1
554900021001               MOVE WS-STMT-DTA-BLIT-25
555000021001                                       TO  CL1-LIT
555100021001               MOVE WS-STMT-DTA-BCNT-25
555200021001                                       TO  CL1-CNT
555300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
555400021002               MOVE "Y"                TO  WS-BYPPRT-SW.
555500021001
555600130408117038     IF  WS-STMT-DTA-BCNT-22
555700130408117038                    IS GREATER THAN  ZEROES
555800130408117038         MOVE SPACES             TO  CONTROL-LINE-1
555900130408117038         MOVE WS-STMT-DTA-BLIT-22
556000130408117038                                 TO  CL1-LIT
556100130408117038         MOVE WS-STMT-DTA-BCNT-22
556200130408117038                                 TO  CL1-CNT
556300130408117038         PERFORM PRINT-CTL-LINE THRU PCL-EXIT
556400130408117038         MOVE "Y"                TO  WS-BYPPRT-SW.
556500130408
556600021001           IF  WS-STMT-DTA-BCNT-30
556700021001                          IS GREATER THAN  ZEROES
556800021001               MOVE SPACES             TO  CONTROL-LINE-1
556900021001               MOVE WS-STMT-DTA-BLIT-30
557000021001                                       TO  CL1-LIT
557100021001               MOVE WS-STMT-DTA-BCNT-30
557200021001                                       TO  CL1-CNT
557300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
557400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
557500021001
557600021001           IF  WS-STMT-DTA-BCNT-35
557700021001                          IS GREATER THAN  ZEROES
557800021001               MOVE SPACES             TO  CONTROL-LINE-1
557900021001               MOVE WS-STMT-DTA-BLIT-35
558000021001                                       TO  CL1-LIT
558100021001               MOVE WS-STMT-DTA-BCNT-35
558200021001                                       TO  CL1-CNT
558300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
558400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
558500021001
558600021002           IF  WS-STMT-DTA-BCNT-40
558700021001                          IS GREATER THAN  ZEROES
558800021001               MOVE SPACES             TO  CONTROL-LINE-1
558900021001               MOVE WS-STMT-DTA-BLIT-40
559000021001                                       TO  CL1-LIT
559100021001               MOVE WS-STMT-DTA-BCNT-40
559200021001                                       TO  CL1-CNT
559300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
559400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
559500021001
559600021002           IF  WS-STMT-DTA-BCNT-43
559700021001                          IS GREATER THAN  ZEROES
559800021001               MOVE SPACES             TO  CONTROL-LINE-1
559900021001               MOVE WS-STMT-DTA-BLIT-43
560000021001                                       TO  CL1-LIT
560100021001               MOVE WS-STMT-DTA-BCNT-43
560200021001                                       TO  CL1-CNT
560300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
560400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
560500021001
560600021002           IF  WS-STMT-DTA-BCNT-45
560700021001                          IS GREATER THAN  ZEROES
560800021001               MOVE SPACES             TO  CONTROL-LINE-1
560900021001               MOVE WS-STMT-DTA-BLIT-45
561000021001                                       TO  CL1-LIT
561100021001               MOVE WS-STMT-DTA-BCNT-45
561200021001                                       TO  CL1-CNT
561300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
561400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
561500021001
561600021001           IF  WS-STMT-DTA-BCNT-50
561700021001                          IS GREATER THAN  ZEROES
561800021001               MOVE SPACES             TO  CONTROL-LINE-1
561900021001               MOVE WS-STMT-DTA-BLIT-50
562000021001                                       TO  CL1-LIT
562100021001               MOVE WS-STMT-DTA-BCNT-50
562200021001                                       TO  CL1-CNT
562300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
562400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
562500021001
562600021001           IF  WS-STMT-DTA-BCNT-60
562700021001                          IS GREATER THAN  ZEROES
562800021001               MOVE SPACES             TO  CONTROL-LINE-1
562900021001               MOVE WS-STMT-DTA-BLIT-60
563000021001                                       TO  CL1-LIT
563100021001               MOVE WS-STMT-DTA-BCNT-60
563200021001                                       TO  CL1-CNT
563300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
563400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
563500021001
563600021001           IF  WS-STMT-DTA-BCNT-62
563700021001                          IS GREATER THAN  ZEROES
563800021001               MOVE SPACES             TO  CONTROL-LINE-1
563900021001               MOVE WS-STMT-DTA-BLIT-62
564000021001                                       TO  CL1-LIT
564100021001               MOVE WS-STMT-DTA-BCNT-62
564200021001                                       TO  CL1-CNT
564300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
564400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
564500091125      *RFS69515 Begin
564600091125           IF  WS-STMT-DTA-BCNT-63
564700091125                          IS GREATER THAN  ZEROES
564800091125               MOVE SPACES             TO  CONTROL-LINE-1
564900091125               MOVE WS-STMT-DTA-BLIT-63
565000091125                                       TO  CL1-LIT
565100091125               MOVE WS-STMT-DTA-BCNT-63
565200091125                                       TO  CL1-CNT
565300091125               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
565400091125               MOVE "Y"                TO  WS-BYPPRT-SW.
565500091125      *RFS69515 End
565600091125
565700021002           IF  WS-STMT-DTA-BCNT-67
565800021001                          IS GREATER THAN  ZEROES
565900021001               MOVE SPACES             TO  CONTROL-LINE-1
566000021001               MOVE WS-STMT-DTA-BLIT-67
566100021001                                       TO  CL1-LIT
566200021001               MOVE WS-STMT-DTA-BCNT-67
566300021001                                       TO  CL1-CNT
566400021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
566500021001               MOVE "Y"                TO  WS-BYPPRT-SW.
566600021001
566700021001           IF  WS-STMT-DTA-BCNT-70
566800021001                          IS GREATER THAN  ZEROES
566900021001               MOVE SPACES             TO  CONTROL-LINE-1
567000021001               MOVE WS-STMT-DTA-BLIT-70
567100021001                                       TO  CL1-LIT
567200021001               MOVE WS-STMT-DTA-BCNT-70
567300021001                                       TO  CL1-CNT
567400021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
567500021001               MOVE "Y"                TO  WS-BYPPRT-SW.
567600021001
567700021001           IF  WS-STMT-DTA-BCNT-82       IS GREATER THAN  ZEROES
567800021001               MOVE SPACES             TO  CONTROL-LINE-1
567900021001               MOVE WS-STMT-DTA-BLIT-82
568000021001                                       TO  CL1-LIT
568100021001               MOVE WS-STMT-DTA-BCNT-82
568200021001                                       TO  CL1-CNT
568300021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
568400021001               MOVE "Y"                TO  WS-BYPPRT-SW.
568500021001
568600021001           IF  WS-STMT-DTA-BCNT-84       IS GREATER THAN  ZEROES
568700021001               MOVE SPACES             TO  CONTROL-LINE-1
568800021001               MOVE WS-STMT-DTA-BLIT-84
568900021001                                       TO  CL1-LIT
569000021001               MOVE WS-STMT-DTA-BCNT-84
569100021001                                       TO  CL1-CNT
569200021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
569300021001               MOVE "Y"                TO  WS-BYPPRT-SW.
569400021001
569500021002           IF  WS-STMT-DTA-BCNT-90       IS GREATER THAN  ZEROES
569600021001               MOVE SPACES             TO  CONTROL-LINE-1
569700021001               MOVE WS-STMT-DTA-BLIT-90
569800021001                                       TO  CL1-LIT
569900021001               MOVE WS-STMT-DTA-BCNT-90
570000021001                                       TO  CL1-CNT
570100021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
570200021001               MOVE "Y"                TO  WS-BYPPRT-SW.
570300021001
570400021001           IF  WS-BYPPRT-SW   IS EQUAL TO  "Y"
570500021001               MOVE SPACES             TO  CONTROL-LINE-1
570600021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
570700021001
570800021001           IF  WS-STMT-DTA-SCNT-01
570900021001                          IS GREATER THAN  ZEROES
571000021001               MOVE SPACES                 TO  CONTROL-LINE-1
571100021001               MOVE WS-STMT-DTA-SLIT-01
571200021001                                       TO  CL1-LIT
571300021001               MOVE WS-STMT-DTA-SCNT-01
571400021001                                       TO  CL1-CNT
571500021001               PERFORM PRINT-CTL-LINE     THRU PCL-EXIT
571600021001               MOVE "Y"                TO  WS-SELPRT-SW.
571700021001
571800021001           IF  WS-STMT-DTA-SCNT-05
571900021001                          IS GREATER THAN  ZEROES
572000021001               MOVE SPACES             TO  CONTROL-LINE-1
572100021001               MOVE WS-STMT-DTA-SLIT-05
572200021001                                       TO  CL1-LIT
572300021001               MOVE WS-STMT-DTA-SCNT-05
572400021001                                       TO  CL1-CNT
572500021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
572600021001               MOVE "Y"                TO  WS-SELPRT-SW.
572700021001
572800021001           IF  WS-STMT-DTA-SCNT-10
572900021001                          IS GREATER THAN  ZEROES
573000021001               MOVE SPACES             TO  CONTROL-LINE-1
573100021001               MOVE WS-STMT-DTA-SLIT-10
573200021001                                       TO  CL1-LIT
573300021001               MOVE WS-STMT-DTA-SCNT-10
573400021001                                       TO  CL1-CNT
573500021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
573600021001               MOVE "Y"                TO  WS-SELPRT-SW.
573700021001
573800021001           IF  WS-STMT-DTA-SCNT-20
573900021001                          IS GREATER THAN  ZEROES
574000021001               MOVE SPACES             TO  CONTROL-LINE-1
574100021001               MOVE WS-STMT-DTA-SLIT-20
574200021001                                       TO  CL1-LIT
574300021001               MOVE WS-STMT-DTA-SCNT-20
574400021001                                       TO  CL1-CNT
574500021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
574600021001               MOVE "Y"                TO  WS-SELPRT-SW.
574700021001
574800021001           IF  WS-STMT-DTA-SCNT-80
574900021001                          IS GREATER THAN  ZEROES
575000021001               MOVE SPACES             TO  CONTROL-LINE-1
575100021001               MOVE WS-STMT-DTA-SLIT-80
575200021001                                       TO  CL1-LIT
575300021001               MOVE WS-STMT-DTA-SCNT-80
575400021001                                       TO  CL1-CNT
575500021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
575600021001               MOVE "Y"                TO  WS-SELPRT-SW.
575700021001
575800021001           IF  WS-STMT-DTA-SCNT-84
575900021001                          IS GREATER THAN  ZEROES
576000021001               MOVE SPACES             TO  CONTROL-LINE-1
576100021001               MOVE WS-STMT-DTA-SLIT-84
576200021001                                       TO  CL1-LIT
576300021001               MOVE WS-STMT-DTA-SCNT-84
576400021001                                       TO  CL1-CNT
576500021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
576600021001               MOVE "Y"                TO  WS-SELPRT-SW.
576700021001
576800021001           IF  WS-SELPRT-SW   IS EQUAL TO  "Y"
576900021001               MOVE SPACES             TO  CONTROL-LINE-1
577000021001               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
577100021001
577200021001           MOVE SPACES                 TO  CONTROL-LINE-1.
577300021001           MOVE WS-STMT-PRT-HDR-WLIT   TO  CL1-LIT.
577400021001           MOVE WS-STMT-PRT-HDR-WCNT   TO  CL1-CNT.
577500021001           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
577600021001
577700021001           MOVE SPACES                 TO  CONTROL-LINE-1.
577800021001           MOVE WS-STMT-PRT-DTL-WLIT   TO  CL1-LIT.
577900021001           MOVE WS-STMT-PRT-DTL-WCNT   TO  CL1-CNT.
578000021001           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
578100021001
578200021001      *****
578300021001      *****    Close all the files.
578400021001      *****
578500021001
578600021001           CLOSE           CURRENCY-FILE
578700021001                           DEALER-MAILING-INSTR
578800021001                           DEALER-FILE
578900021001                           DEALER-REP-FILE
579000021001                           DEALER-REP-MAILING-INSTR
579100021001                           DEALER-REP-ADDRESS
579200021001                           INSTITUTION-ADDRESS
579300021001                           INSTITUTION-BRANCH
579400021001                           INVESTMENT-FILE
579500021002                           INVESTMENT-NAME
579600021002                           PRODUCT-TYPE-CODES
579700021001                           INVESTOR-JOIN
579800021001                           NOMINEE-ACCOUNT-TYPE-DESCR
579900021001                           NOMINEE-MAILING-INSTRUCTIONS
580000021001                           STMT-MSG-FILE
580100021001                           STMT-PRT-DTL-FILE
580200021001                           STMT-PRT-HDR-FILE
580300021007                           ACCOUNT-TYPE-BK
580400021001                           STMT-DTA-FILE
580500190614      *RFS183449-Starts
580600190614      *                    PRINT-FILE.
580700190614                           PRINT-FILE
580800190614                           ACCOUNT-FILE-2.
580900190614      *RFS183449-Ends
581000021001
581100021001       EJR-EXIT.
581200021001           EXIT.
581300021001      /
581400021001       PRINT-CTL-LINE.
581500021001
581600021001      ******************************************************************
581700021001      *                                                                *
581800021001      *    P R I N T   C O N T R O L   L I N E   R O U T I N E         *
581900021001      *                                                                *
582000021001      ******************************************************************
582100021001
582200021001      *****
582300021001      *****    If the page is full, start a new page and print the
582400021001      *****    Heading lines.
582500021001      *****
582600021001
582700021001           IF  WS-LNECNT  IS GREATER THAN  WS-LNEMAX
582800021001               PERFORM PRINT-HDG-LINE THRU PHL-EXIT.
582900021001
583000021001      *****
583100021001      *****    Print the Control line.
583200021001      *****
583300021001
583400021001           WRITE PRINT-RECD          FROM  CONTROL-LINE-1
583500021001                         AFTER  ADVANCING  1.
583600021001           ADD 1                       TO  WS-LNECNT.
583700021001
583800021001       PCL-EXIT.
583900021001           EXIT.
584000021001      /
584100021001       PRINT-HDG-LINE.
584200021001
584300021001      ******************************************************************
584400021001      *                                                                *
584500021001      *    P R I N T   H E A D I N G   L I N E   R O U T I N E         *
584600021001      *                                                                *
584700021001      ******************************************************************
584800021001
584900021001      *****
585000021001      *****    Print Heading line 1 on a new page.
585100021001      *****
585200021001
585300021001           WRITE PRINT-RECD          FROM  HEADING-LINE-1
585400021001                          AFTER ADVANCING  PAGE.
585500021001           ADD 1                       TO  WS-PGECNT.
585600021001           MOVE 1                      TO  WS-LNECNT.
585700021001
585800021001      *****
585900021001      *****    Format and print Heading line 2.
586000021001      *****
586100021001
586200021001           MOVE WS-PGECNT              TO  HL2-PGECNT.
586300021001
586400021001           WRITE PRINT-RECD          FROM  HEADING-LINE-2
586500021001                          AFTER ADVANCING  1.
586600021001           ADD 1                       TO  WS-LNECNT.
586700021001
586800021001      *****
586900021001      *****    Print Heading line 3, if required.
587000021001      *****
587100021001
587200021001           IF  WS-EOJHDG-SW   IS EQUAL TO  "Y"
587300021001               GO TO PHL-0010.
587400021001
587500021001           WRITE PRINT-RECD          FROM  HEADING-LINE-3
587600021001                          AFTER ADVANCING  2.
587700021001           ADD 2                       TO  WS-LNECNT.
587800021001
587900021001       PHL-0010.
588000021001
588100021001      *****
588200021001      *****    Format and print a blank line.
588300021001      *****
588400021001
588500021001           MOVE SPACES                 TO  PRINT-RECD.
588600021001           WRITE PRINT-RECD
588700021001                          AFTER ADVANCING  1.
588800021001           ADD 1                       TO  WS-LNECNT.
588900021001
589000021001       PHL-EXIT.
589100021001           EXIT.
589200190614      *RFS-183449-Starts
589300190619       Get-Account-Type-Code.
589400190614           INITIALIZE MFAACCNTP OF ACCOUNT-REC-2.
589500190614           MOVE AD-ACCOUNT
589600190614                    TO  ACCOUNT-NO OF ACCOUNT-REC-2
589700190614
589800190614           READ ACCOUNT-FILE-2
589900190619             INVALID KEY
590000190619             DISPLAY "Account File 2 not found for Account:" AD-ACCOUNT
590100190619             GO TO GAT-EXIT.
590200190614
590300190614           MOVE ACCOUNT-TYPE-CODE OF ACCOUNT-REC-2
590400190614                TO Lc-Acct-Type-Code.
590500190619       GAT-EXIT.
590600190614           EXIT.
590700190614      *RFS183449-Ends
