000001200904      * %ATTR DBGVIEW(*SOURCE) CLOSQLCSR(*ENDMOD)
000100190426       IDENTIFICATION DIVISION.
000200190222       PROGRAM-ID.     STMTROR.
000300030716       INSTALLATION.   Unisen Inc.
000400031201       AUTHOR.         ALI ALNEMER.
000500031201       DATE-WRITTEN.   NOVEMBER 28, 2003.
000600190422       DATE-COMPILED.
000700180924      ******************************************************************
000800031201      *    RFS-NUMBER : RFS-18814                                      *
000900180717      *                                                                *
001000031201      *    DESCRIPTION: This program will calculate the ROR for IPS    *
001100031201      *                 and none IPS records.                          *
001200030716      *                                                                *
001300030917      *     PARAMETERS: None.                                          *
001400030716      *                                                                *
001500030716      * LINKED MODULES: None.                                          *
001600031222      *                                                                *
001700030917      *       RE-WRITE:                                                *
001800030716      *                                                                *
001900980429      ******************************************************************
002000980429      *                                                                *
002100980429      *    C H A N G E   H I S T O R Y                                 *
002200980429      *                                                                *
002300980429      ******************************************************************
002400980429      ******************************************************************
002500980429      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
002600980429      ******************************************************************
002700040116      * Ali Alnemer* 2004/01/15   * RFS 20561                          *
002800040115      *            *              * - Increment the Section-seqence    *
002900040115      *            *              *   field in the section(9999999999) *
003000040115      *            *              *   when calculating the ROR-IPS.    *
003100030917      ******************************************************************
003200040203      * B.LU       *  2004/02/03  * RFS20688
003300040203      *            *              * -Combined to ANNSTMTJSI
003400040203      *            *              * -Using default compiling parms.
003500040210      *            *              * -At IPS leve:
003600040210      *            *              *  Account-NO decreased by 1
003700040210      *            *              *  Section-Seq = 811001 in Section30
003800040210      *            *              *  Section-Seq start with 811001 and
003900040210      *            *              *  increased by 1
004000040203      ******************************************************************
004100040406      * Ali Alnemer* 2004/04/06   * RFS 20870                          *
004200040406      *            *              * - Recompile.                       *
004300040406      ******************************************************************
004400040414      * Ali Alnemer* 2004/03/30   * RFS 20758                          *
004500040414      *            *              * - Add ROR calculation field to     *
004600040414      *            *              *   section 30.                      *
004700040414      ******************************************************************
004800040514      * Odette     *  2004/04/27  * RFS21714 - Recompile
004900040514      * Aguinaldo- *              * Add new fields to Section 10 to
005000040514      * McMillan   *              * indicate if Dealer, Rep or Nominee
005100040514      *            *              * is/isn't suppressed.
005200040528      ******************************************************************
005300040528      * Reece Tam  *  2004/05/28  * RFS20804
005400040528      *            *              * - Recompile for CPYLDASTMT.
005500040514      ******************************************************************
005600040813      * Brian Lu   * 2004/07/30   * RFS23531                           *
005700040813      *            *              * -Combined RORCALC.                 *
005800040813      ******************************************************************
005900040928      * B.LU       * 2004/09/27   * RFS18924
006000040928      *            *              * -Recompile - CPYJSISTMT.
006100040928      ******************************************************************
006200041012      * B.LU       * 2004/10/12   * RFS22856
006300041012      *            *              * -Recompile - CPYJSISTMT.
006400041012      ******************************************************************
006500041025      * ALI.A      * 2004/10/25      RFS18780
006600041025      *            *              * -Recompile - CPYJSISTMT.
006700041025      ******************************************************************
006800041028      * ALI.A      * 2004/10/28      RFS21715
006900041028      *            *              * -Recompile - CPYJSISTMT.
007000041028      ******************************************************************
007100041220      * B.LU       * 2004/12/20   * RFS24514 -RECOMPILE - CPYJSISTMT
007200041220      ******************************************************************
007300050429      * Chandana R * 2005/03/09   * RFS26213 -RECOMPILE - CPYJSISTMT
007400050429      ******************************************************************
007500051002      * Ade Adeyemi* 2005/09/08   * RFS29550 -RECOMPILE - CPYJSISTMT
007600051002      ******************************************************************
007700051002      * Ade Adeyemi* 2005/09/28   * RFS30065 -RECOMPILE - CPYJSISTMT
007800051002      ******************************************************************
007900050920      * Ali.A      * 2005/09/18   * RFS28931 -RECOMPILE - CPYJSISTMT
008000050920      ******************************************************************
008100050926      * C.LENTINI  * 2005/09/26   * RFS28692 -RECOMPILE - CPYJSISTMT
008200050926      ******************************************************************
008300050926      * Geeta S.   * 2005/09/15   * RFS 28107: Recompile for CPYJSISTMT
008400060327      ******************************************************************
008500060327      * Esin A.    * 2006/03/23   * RFS 31514: Recompile for CPYJSISTMT
008600060524      *            *
008700060524      * Lev O      * 2006/05/24   * RFS30797 - ROR redesign , call
008800060524      *            *              *   new RORCLCSAV program.
008900060629      * L. Wong    * 2006/06/29   * RFS35210 - Changed copyboook fields*
009000060629      *            *              * CPRORCLCSA to non-ILE (change _ to *
009100060629      *            *              * -).                                *
009200060821      ******************************************************************
009300060821      * Raymond Mui* 2006/08/21   * RFS 34848: Recompile for CPYJSISTMT
009400060821      *            *              *            and CPYLDASTMT.
009500050926      ******************************************************************
009600061024      * L. Wong    * 2006/10/24   * RFS36342 - Recompile - CPYJSISTMT,
009700061024      *            *              *                        CPYLDASTMT.
009800061027      *            *              * - Fix level 20 errors: remove VALUE
009900061103      *            *              *   clause in REDEFINE clause.
010000061103      *            *              *   Add missing period.
010100061027      *            *              * - Fix level 10 errors: delimiters -
010200061027      *            *              *   use quote instead of apostrophe.
010300070924      * Emman. Yala* 2007/09/24   * RFS40307 - Enhancement of GENROR
010400070924      *            *              * Recompiled after setting new param
010500070924      *            *              * of CPRORCLCSA to default values
010600080122      * ade adeyemi* 2008/01/22   * RFS 42749: Recompile for changes to
010700080211      *            *              * linked modules RORCLCSAV
010800080620      * Bathuu L   * 2008/06/20   * RFS50993 - RECOMPILE FOR CPYJSISTMT
010900090309      * Andy Chan  * 2009/03/09   * RFS50549 - RECOMPILE
011000090324      * Andy Chan  * 2009/02/10   * RFS52734 - Recompile
011100091111      * A. Lo      * 2009/11/11   * RFS69515 - Recompile - CPYJSISTMT,
011200091111      *            *              *                        CPYLDASTMT.
011300100308      * A. Lo      * 2010/03/08   * RFS78161 -Recompile - CPYJSISTMT.
011400100409      * A. Lo      * 2010/03/08   * RFS74626 -Recompile - CPYJSISTMT.
011500120127      * Rekha S    * 2012/01/27   * RFS93662 -Recompile - CPYJSISTMT.
011600120912      * A. Chan    * 2010/03/12   * RFS93662 -Recompile - CPYJSISTMT.
011700120912      *****************************************************************
011800120912      * Suresh G.  * 2012/09/12   * RFS112003-Recompile for CPYJSISTMT.
011900120912      *****************************************************************
012000130408      * Andy Chan  * 2013/04/08   * RFS117038- RECOMPILE
012100130408      *****************************************************************
012200130529      * Noble T .  * 2013/05/29   * RFS121116-Recompile for CPYLDASTMT.
012300130529      *****************************************************************
012400130905      * PRAVEEN E  * 2013/09/05   *RFS123925 RECOMPIL ONLY - CPYJSISTMT.
012500140519      * NOBLE T    * 2014/05/02   * RFS130239 - RECOMPILE - CPYJSISTMT.
012600140418      *****************************************************************
012700140418      *Sangeetha V  * 2014/03/25 * RFS129378 - Recompile for CPYJSISTMT*
012800130905      *****************************************************************
012900140706      * Suresh G.   * 2014/07/05 * RFS132121 - Recompile for CPYJSISTMT.
013000140706      *****************************************************************
013100140814      * Suresh G.   * 2014/08/14 * RFS133489 - Recompile for CPYJSISTMT.
013200150216      * POOJA K    * 2015/02/16  * RFS143392 - RECOMPILE FOR CPYJSISTMT
013300150330      * POOJA K    * 2015/03/27  * RFS144030 - RECOMPILE FOR CPYJSISTMT
013400150424      * POOJA K    * 2015/04/21  * RFS142884 - RECOMPILE FOR CPYJSISTMT
013500150511      * POOJA K    * 2015/05/08  * RFS144587 - RECOMPILE FOR CPYJSISTMT
013600150924      * TamilSelvi * 2015/09/24  * RFS146035 - RECOMPILE FOR CPRORCLCSA
013601171208      * Janapriya J* 2017/01/10  * RFS164528 -CRM2 - Cash Flows Extract*
013602200904      * Suresh P   * 2020/07/21  * RFS178492 - Recompile.
013603210410      * Gomathi S  *  2021/01/07 * RFS1101968- Recompile
013604211019      * Surendran C* 2021/10/19  * RFS186592 -RECOMPILE FOR CPYJSISTMT*
013800140814      *****************************************************************
013900000000      /
014000000000       ENVIRONMENT DIVISION.
014100000000
014200000000      ********************************************************
014300000000      *                                                      *
014400990422      *       E N V I R O N M E N T   D I V I S I O N        *
014500000000      *                                                      *
014600000000      ********************************************************
014700000000
014800000000       CONFIGURATION SECTION.
014900000000
015000000000      ********************************************************
015100000000      *    C O N F I G U R A T I O N   S E C T I O N         *
015200000000      ********************************************************
015300000000
015400000000       SOURCE-COMPUTER. IBM-AS400.
015500000000       OBJECT-COMPUTER. IBM-AS400.
015600030303
015700030303       SPECIAL-NAMES.
015800060526R23531*    LINKAGE TYPE IS PROCEDURE FOR "RORCALC"
015900060524      * RFS30797 - Begin
016000060524           LINKAGE TYPE IS PROCEDURE FOR "RORCLCSAV"
016100060524      * RFS30797 - End
016200170217      * RFS164528- Start
016300170217           LINKAGE TYPE IS PROCEDURE FOR "STMTSEC31"
016400170217      * RFS164528- End
016500030303           LOCAL-DATA IS WS-LOCAL.
016600000000      /
016700000000       INPUT-OUTPUT SECTION.
016800000000
016900000000      ********************************************************
017000990422      *        I N P U T   O U T P U T   S E C T I O N       *
017100000000      ********************************************************
017200030728       FILE-CONTROL.
017300030728
017400031202           SELECT ROR-PERIOD-CODES
017500031202               ASSIGN          TO  DATABASE-MFARORPCP
017600031202               ORGANIZATION    IS  INDEXED
017700031202               ACCESS          IS  SEQUENTIAL
017800031202               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
017900031202
018000031202           SELECT ROR-PERIOD-DESCRIPTION
018100031202               ASSIGN          TO  DATABASE-MFARORPDP
018200031202               ORGANIZATION    IS  INDEXED
018300031202               ACCESS          IS  DYNAMIC
018400031202               RECORD KEY      IS  EXTERNALLY-DESCRIBED-KEY.
018500031202
018600030728      /
018700030728       DATA DIVISION.
018800030728      *****************************************************************
018900030728      *    D A T A   D I V I S I O N                                  *
019000030728      *****************************************************************
019100030728
019200030728       FILE SECTION.
019300031202
019400031202       FD  ROR-PERIOD-CODES
019500031202           LABEL RECORDS      ARE  OMITTED.
019600031202
019700031202       01  ROR-PERIOD-CODES-REC.        COPY DD-ALL-FORMATS
019800031202                                           OF  MFARORPCP.
019900031202      /
020000031202       FD  ROR-PERIOD-DESCRIPTION
020100031202           LABEL RECORDS      ARE  OMITTED.
020200031202
020300031202       01  ROR-PERIOD-DESCRIPTION-REC.  COPY DD-ALL-FORMATS
020400031202                                           OF  MFARORPDP.
020500030728      *****************************************************************
020600030728      *    F I L E   S E C T I O N                                    *
020700030728      *****************************************************************
020800030728      /
020900030303      /
021000030227
021100000000       WORKING-STORAGE SECTION.
021200031128      *01 WORK-FIELD-Z.
021300031128      *     05 WS-TRANS-NO              PIC S9(9) COMP-3.
021400031128      *     05 WS-PLACEMENT-DATE        PIC S9(9) COMP-3.
021500031128      *     05 WS-PROCESS-AA-NUM        PIC S9(7) COMP-3.
021600031201
021700031201       01  WS-LOCAL-DATA-AREA.         COPY CPYLDASTMT.
021800031201           COPY CPYJSISTMT.
021900031201           COPY CPWRORCALC.
022000031128
022100031128RF5148     03  WS-ROR-CODE-TBL.
022200031128               04  WS-ROR-CODE-ENT      OCCURS 20   TIMES
022300031128                                        INDEXED BY  ROCT.
022400031128                  05  WS-PERIOD-CCODE   PICTURE X(5).
022500031128                  05  WS-PERIOD-CROR    PICTURE S9(8)V9(5).
022600031128                  05  WS-PERIOD-CDESC   PICTURE X(25).
022700031128                  05  WS-PERIOD-CSIGN   PICTURE X(1).
022800031128           03  WS-ROCT-LST              PICTURE S9(3)      COMP-3.
022900031128           03  WS-ROCT-MAX              PICTURE S9(3)      COMP-3
023000031128                                                           VALUE 20.
023100031126
023200031128       01  WS-PERIOD-ROR-APPL-ARRAY  PICTURE X(10).
023300031128       01  WS-PERIOD-ROR-APPL-ARRAY-R
023400031128                      REDEFINES WS-PERIOD-ROR-APPL-ARRAY.
023500031128               05  WS-PERIOD-ROR-APPLICABLE-1  PICTURE X(1).
023600031128               05  WS-PERIOD-ROR-APPLICABLE-2  PICTURE X(1).
023700031128               05  WS-PERIOD-ROR-APPLICABLE-3  PICTURE X(1).
023800031128               05  WS-PERIOD-ROR-APPLICABLE-4  PICTURE X(1).
023900031128               05  WS-PERIOD-ROR-APPLICABLE-5  PICTURE X(1).
024000031128               05  WS-PERIOD-ROR-APPLICABLE-6  PICTURE X(1).
024100031128               05  WS-PERIOD-ROR-APPLICABLE-7  PICTURE X(1).
024200031128               05  WS-PERIOD-ROR-APPLICABLE-8  PICTURE X(1).
024300031128               05  WS-PERIOD-ROR-APPLICABLE-9  PICTURE X(1).
024400031128               05  WS-PERIOD-ROR-APPLICABLE-10 PICTURE X(1).
024500031128
024600031128           03  WS-ROR-TBL.
024700031128               04  WS-ROR-ENT           OCCURS 50   TIMES
024800031128                                        INDEXED BY  ROT.
024900031128                  05  WS-PERIOD-CODE    PICTURE X(5).
025000031128                  05  WS-PERIOD-DESC    OCCURS 2    TIMES
025100031128                                        INDEXED BY ROTL
025200031128                                        PICTURE X(25).
025300061027           03  WS-ROT-LST               PICTURE S9(3)      COMP-3.
025400061027      **                                                   VALUE 0.
025500061027           03  WS-ROT-MAX               PICTURE S9(3)      COMP-3.
025600061027      **                                                   VALUE 50.
025700031128      *****
025800031128      *****    Quarter end date table to load ten records at a time
025900031128      *****
026000031128
026100031128           03  WS-QRTEND-TBL-TEN.
026200031128             04  WS-QRTEND-ENT-TEN     OCCURS 10 TIMES
026300031128                                       INDEXED BY  QRTT.
026400031128               05  WS-QRT-ENDDATE-TEN  PICTURE S9(8).
026500031128               05  WS-QRT-FREQ-TEN     PICTURE X(2).
026600031128
026700031128           03  ROR33                   PICTURE 99.
026800031128           03  ROR38                   PICTURE 99.
026900061027           03  WS-QRT-TEN              PICTURE S9(3)       COMP-3.
027000061027      **                                                   VALUE 10.
027100031128      *****
027200031128      *****    Quarter end date table.
027300031128      *****
027400031128
027500031201           03  WS-QRTEND-TBL.
027600031128             04  WS-QRTEND-ENT         OCCURS 300  TIMES
027700031128                                       INDEXED BY  QRT.
027800031128               05  WS-QRT-ENDDATE      PICTURE S9(8).
027900031128               05  WS-QRT-FREQ         PICTURE X(2).
028000031128
028100031128           03  WS-QRT-LST              PICTURE S9(3)       COMP-3.
028200061027           03  WS-QRT-MAX              PICTURE S9(3)       COMP-3.
028300061027      **                                                   VALUE 300.
028400031128           03  WS-QRT-STR-FRQ          PICTURE X(2).
028500031128           03  WS-MON-STR-FRQ          PICTURE X(2).
028600031128           03  WS-QRT-END-FRQ          PICTURE X(2).
028700031128
028800031222       01  STATEMENT-EXTRACT-ARRAY.
028900031222           02  STATEMENT-REC OCCURS 475 TIMES.
029000031202                 05 STMTX-INVESTOR-NO        PIC S9(9).
029100031202                 05 STMTX-ACCOUNT-NO         PIC S9(9).
029200031202                 05 STMTX-SECTION-NO         PIC S9(2).
029300031202                 05 STMTX-SECTION-SEQ        PIC S9(6).
029400031202                 05 STMTX-LANGUAGE-CODE      PIC X(1).
029500031202                 05 STMTX-DEALER-CODE        PIC X(4).
029600031202                 05 STMTX-DEALER-REP-CODE    PIC X(6).
029700031202                 05 STMTX-DATA               PIC X(1290).
029800031202                 05 STMTX-SECTION-SEQ-2      PIC S9(6).
029900031202                 05 STMTX-START-DATE         PIC S9(8).
030000031202                 05 STMTX-END-DATE           PIC S9(8).
030100031202                 05 STMTX-EOR-IND            PIC X(1).
030200031222       01 ISR                                PIC S9(3) VALUE 1.
030300031222       01 ISRMAX                             PIC S9(3) VALUE 475.
030400031130
030500040210R20688 01   WS-ACC-PERF-COUNT                PIC 9(6) VALUE 0.
030600040210   ¦   01   WS-FUND-PERF-COUNT               PIC 9(6) VALUE 0.
030700040210   v   01   WS-ACC-FRQ-COUNT                 PIC 9(6) VALUE 0.
030800040210R20688 01   WS-FUND-FRQ-COUNT                PIC 9(6) VALUE 0.
030900040211R20688 01   WS-PREV-ACCOUNT-NO-35            PIC 9(9) VALUE 0.
031000040211R20688 01   WS-CURR-ACCOUNT-NO-35            PIC 9(9) VALUE 0.
031100040211R20688 01   WS-PREV-ACCOUNT-NO-38            PIC 9(9) VALUE 0.
031200040211R20688 01   WS-CURR-ACCOUNT-NO-38            PIC 9(9) VALUE 0.
031300031223
031400031223       01   WS-IPS-NO-TEMP                   PIC X(20).
031500031130
031600031224       01 WS-SECTION-COUNTERS-IPS.
031700031224          05 WS-INVESTOR-NO-IPS       PIC 9(9) VALUE   999999999.
031800031224          05 WS-ACCOUNT-NO-IPS        PIC 9(9) VALUE   999999999.
031900031224
032000061027      *01 WS-SECTION-COUNTERS-IPS.
032100040210R20688    05 WS-IPS-COUNT-30   PIC 9(6) VALUE 811001.
032200040210R20688    05 WS-IPS-COUNT-33   PIC 9(6) VALUE 811000.
032300031126
032400040116      *01 CHECK-SEQ-NO         PIC X(1).
032500040115
03260007092440307  01 lncc_No              PIC X(01) VALUE "N".
032700070924
032800000000      ********************************************************
032900990422      *     W O R K I N G  S T O R A G E  S E C T I O N      *
033000000000      ********************************************************
033100990226
033200030728           EXEC SQL
033300030728             INCLUDE SQLCA
033400030728           END-EXEC.
033500030728
033600030728           EXEC SQL
033700030728             INCLUDE SQLDA
033800030728           END-EXEC.
033900030728
034000000000      /
034100060526      * RFS30797 - Begin
034200060526      * -------------------------------
034300060526      * Copybooks - Start
034400060526      * -------------------------------
034500060526       COPY Cprorclcsa.
034600060526      * -------------------------------
034700060526      * Copybooks - End
034800060526      * -------------------------------
034900060526      * RFS30797 - End
035000990224
035100990224      ********************************************************
035200990224      *         L I N K A G E    S E C T I O N               *
035300990224      ********************************************************
035400030807       LINKAGE SECTION.
035500031104      ** COMM-CORE-EXTRACT-FILE-INFORMATION.
035600031128       01 COMM-IPS-NO             PIC X(20).
035700031104       01 COMM-ACCOUNT-NO         PIC S9(9).
035800031201       01 COMM-LDA-ENDDATE        PIC S9(8).
035900031128       01 COMM-INVESTMENT-CODE    PIC X(5).
036000031128       01 COMM-AD-INVESTOR-NO     PIC S9(9).
036100031201       01 COMM-AD-SECTION-NO      PIC X(2).
036200031128       01 COMM-AD-LANGUAGE        PIC X(1).
036300031128       01 COMM-AD-DEALER          PIC X(4).
036400031128       01 COMM-AD-SALESREP        PIC X(6).
036500031128       01 COMM-AD-FUND-NO         PIC X(8).
036600031128       01 COMM-AD-INVESTMENT-NAME PIC X(35).
036700031201       01 COMM-QTR-ARRAY          PIC X(3000).
036800031130       01 COMM-AD-START-DATE      PIC 9(8).
036900031130       01 COMM-AD-END-DATE        PIC 9(8).
037000031202       01 COMM-QRT-LST            PIC S9(3) COMP-3.
037100031223       01 COMM-PROGRAM-NAME       PIC X(3).
037200170217164528 01 COMM-SECTION-NO-31-FLAG PIC X(1).
037300990211
037400030807      ********************************************************
037500030807      *        P R O C E D U R E   D I V I S I O N           *
037600030807      ********************************************************
037700031128       PROCEDURE DIVISION USING
037800031201                               COMM-IPS-NO
037900031201                               COMM-ACCOUNT-NO
038000031201                               COMM-LDA-ENDDATE
038100031201                               COMM-INVESTMENT-CODE
038200031201                               COMM-AD-INVESTOR-NO
038300031201                               COMM-AD-SECTION-NO
038400031201                               COMM-AD-LANGUAGE
038500031201                               COMM-AD-DEALER
038600031201                               COMM-AD-SALESREP
038700031201                               COMM-AD-FUND-NO
038800031201                               COMM-AD-INVESTMENT-NAME
038900031201                               COMM-QTR-ARRAY
039000031201                               COMM-AD-START-DATE
039100031202                               COMM-AD-END-DATE
039200031223                               COMM-QRT-LST
039300170217164528*                        COMM-PROGRAM-NAME.
039400170217164528                         COMM-PROGRAM-NAME
039500170217164528                         COMM-SECTION-NO-31-FLAG.
039600990217      /
039700000000
039800000000      ********************************************************
039900990224      *               M A I N L I N E                        *
040000000000      ********************************************************
040100030917       MAINLINE.
040200031201
040300031222R18814     INITIALIZE   WS-QRTEND-TBL.
040400031202           PERFORM INITIALIZATION   THRU INL-EXIT.
040500031201           ACCEPT WS-LOCAL-DATA-AREA FROM WS-LOCAL.
040600031201           MOVE   COMM-QTR-ARRAY  TO WS-QRTEND-TBL.
040700031104
040800031104           IF COMM-INVESTMENT-CODE = SPACES
040900031202             IF COMM-AD-SECTION-NO IS EQUAL TO "30"
041000040116                 PERFORM ACCOUNT-ROR-30  THRU  AROR30-EXIT
041100170217164528       IF COMM-SECTION-NO-31-FLAG = 'Y'
041200170217164528           PERFORM ACCOUNT-ROR-31 THRU AROR31-EXIT
041300170217164528       END-IF
041400031202             ELSE
041500040116                 PERFORM ACCOUNT-ROR-33  THRU  AROR33-EXIT
041600031202             END-IF
041700031202           END-IF
041800031104
041900031202           IF COMM-INVESTMENT-CODE IS NOT = SPACES
042000031202             IF COMM-AD-SECTION-NO IS EQUAL TO "35"
042100040211R20688          MOVE COMM-ACCOUNT-NO   TO WS-CURR-ACCOUNT-NO-35
042200040211                PERFORM ACCOUNT-INV-ROR-35 THRU  AIROR35-EXIT
042300040211R20688          MOVE WS-CURR-ACCOUNT-NO-35  TO WS-PREV-ACCOUNT-NO-35
042400031202             ELSE
042500040211R20688          MOVE COMM-ACCOUNT-NO     TO WS-CURR-ACCOUNT-NO-38
042600040211                PERFORM ACCOUNT-INV-ROR-38 THRU  AIROR38-EXIT
042700040211R20688          MOVE WS-CURR-ACCOUNT-NO-38 TO WS-PREV-ACCOUNT-NO-38
042800031202             END-IF
042900031202           END-IF
043000031202
043100031202           PERFORM ENDJOB THRU END-EXIT.
043200031104
043300031128      ********************************************************
043400031202       ACCOUNT-INV-ROR-35.
043500031128      ********************************************************
043600031130      *******
043700031130      ******* Generate Account-Fund-Performance records if required
043800031130      *******
043900031130
044000040211R20688     IF WS-CURR-ACCOUNT-NO-35 NOT EQUAL WS-PREV-ACCOUNT-NO-35
044100040211              MOVE ZEROS                  TO  WS-FUND-PERF-COUNT
044200040211R20688     END-IF.
044300031128
044400031128           INITIALIZE                  CPWRORCALC-LINKAGE.
044500031223      *    MOVE COMM-IPS-NO            TO  RR-CONS-ACCT-ID.
044600031223           MOVE SPACES                 TO  RR-CONS-ACCT-ID.
044700031128           MOVE COMM-ACCOUNT-NO        TO  RR-ACCOUNT-NO.
044800031202           MOVE COMM-LDA-ENDDATE       TO  RR-LAST-MONTH-END.
044900031202           MOVE COMM-INVESTMENT-CODE   TO  RR-INVESTMENT-CODE.
045000031128           MOVE ZEROS                  TO  RR-INITIAL-DATE.
045100031128           MOVE ZEROS                  TO  RR-CALCULATE-DATE.
045200031128
045300031128
045400031128           PERFORM CALL-ROR-ACCOUNT-FUND-ROUTINE   THRU CRAFR-EXIT.
045500031128           PERFORM POPULATE-ROR-CODE-TBL           THRU PRCT-EXIT.
045600031128           PERFORM GET-PERIOD-DESC-RECORDS         THRU GPDR-EXIT.
045700031128
045800031128           INITIALIZE                  ACCOUNT-FUND-PERFORM-SECTION.
045900031201           MOVE COMM-AD-INVESTOR-NO         TO AFP-INVESTOR-NO.
046000031201           MOVE COMM-ACCOUNT-NO             TO AFP-ACCOUNT.
046100031201           MOVE "35"                        TO AFP-SECTION-NO.
046200040211R20688     ADD 1                            TO WS-FUND-PERF-COUNT.
046300031201           MOVE WS-FUND-PERF-COUNT          TO AFP-SECTION-SEQUENCE.
046400031201           MOVE COMM-AD-LANGUAGE            TO AFP-LANGUAGE.
046500031201           MOVE COMM-AD-DEALER              TO AFP-DEALER.
046600031201           MOVE COMM-AD-SALESREP            TO AFP-SALESREP.
046700031201           MOVE COMM-AD-FUND-NO             TO AFP-FUND-NO.
046800031201           MOVE COMM-AD-INVESTMENT-NAME     TO AFP-INVESTMENT-NAME.
046900031128
047000031128           PERFORM POPULATE-FUND-PERF-SECTION        THRU PFPS-EXIT.
047100031128
047200031201           MOVE COMM-AD-START-DATE          TO AFP-START-DATE.
047300031201           MOVE COMM-AD-END-DATE            TO AFP-END-DATE.
047400031128
047500031202           MOVE ACCOUNT-FUND-PERFORM-SECTION TO STATEMENT-REC(ISR).
047600031202           PERFORM INSERT-STATEMENT-REC THRU ISR-EXIT.
047700031202
047800040211R20688*    PERFORM ENDJOB THRU END-EXIT.
047900031202
048000031202      **********
048100031202
048200040116       AIROR35-EXIT.
048300031202             EXIT.
048400031202
048500031202      **********
048600031202      /
048700031130
048800031202      ********************************************************
048900031202       ACCOUNT-INV-ROR-38.
049000031202      ********************************************************
049100031130      *******
049200031130      ******* Generate Account-Fund-ROR-FRQ-Section(38). if required
049300031130      *******
049400031201
049500040211R20688     IF WS-CURR-ACCOUNT-NO-38 NOT EQUAL WS-PREV-ACCOUNT-NO-38
049600040211              MOVE ZEROS                  TO  WS-FUND-FRQ-COUNT
049700040211R20688     END-IF.
049800040211
049900031130           SET  QRT TO   1.
050000031130           PERFORM   GET-NEXT-TEN-QRTEND-REC  THRU   QTEN-EXIT.
050100031130           SET  QRTT TO   1.
050200031130
050300031130       GET-FUND-ROR-QUARTERLY.
050400031130
050500031130           INITIALIZE                  ACCOUNT-FUND-ROR-FRQ-SECTION.
050600031130
050700040211R20688*    ADD 1                       TO  WS-FUND-FRQ-COUNT.
050800031130
050900031201           MOVE COMM-AD-INVESTOR-NO         TO AFPF-INVESTOR-NO.
051000031201           MOVE COMM-ACCOUNT-NO             TO AFPF-ACCOUNT.
051100031201           MOVE "38"                        TO AFPF-SECTION-NO.
051200040211R20688     ADD 1                            TO WS-FUND-FRQ-COUNT.
051300031201           MOVE WS-FUND-FRQ-COUNT           TO AFPF-SECTION-SEQUENCE.
051400031201           MOVE COMM-AD-LANGUAGE            TO AFPF-LANGUAGE.
051500031201           MOVE COMM-AD-DEALER              TO AFPF-DEALER.
051600031201           MOVE COMM-AD-SALESREP            TO AFPF-SALESREP.
051700031201           MOVE COMM-AD-FUND-NO             TO AFPF-FUND-NO.
051800031201           MOVE COMM-AD-INVESTMENT-NAME     TO AFPF-INVESTMENT-NAME.
051900031201           MOVE COMM-AD-START-DATE          TO AFPF-START-DATE.
052000031201           MOVE COMM-AD-END-DATE            TO AFPF-END-DATE.
052100031130
052200031130       GET-FUND-ROR-QTR-NEXT.
052300031130
052400031130           INITIALIZE                  CPWRORCALC-LINKAGE.
052500031201           MOVE COMM-ACCOUNT-NO          TO  RR-ACCOUNT-NO.
052600031223      *    MOVE COMM-IPS-NO              TO  RR-CONS-ACCT-ID.
052700031223           MOVE SPACES                   TO  RR-CONS-ACCT-ID.
052800031130           MOVE ZEROS                    TO  RR-INITIAL-DATE.
052900031130           MOVE ZEROS                    TO  RR-CALCULATE-DATE.
053000031130           MOVE WS-QRT-ENDDATE-TEN(QRTT) TO  RR-LAST-MONTH-END.
053100031201           MOVE COMM-INVESTMENT-CODE      TO  RR-INVESTMENT-CODE.
053200031130
053300031130           PERFORM CALL-ROR-ACCOUNT-FUND-ROUTINE   THRU CRAFR-EXIT.
053400031130           PERFORM POPULATE-ROR-CODE-TBL           THRU PRCT-EXIT.
053500031130           PERFORM GET-PERIOD-DESC-RECORDS         THRU GPDR-EXIT.
053600031130
053700031130           PERFORM POPULATE-FUND-ROR-SECTION        THRU FQRT-EXIT.
053800031130
053900031130           IF  QRTT   IS LESS THAN    WS-QRT-TEN
054000031130              SET QRTT   UP BY    1
054100031130                 IF WS-QRT-ENDDATE-TEN (QRTT) IS NOT EQUAL TO ZEROES
054200031130                   GO TO GET-FUND-ROR-QTR-NEXT
054300031130                 END-IF
054400031130           END-IF.
054500031130
054600031202           MOVE ACCOUNT-FUND-ROR-FRQ-SECTION TO STATEMENT-REC(ISR).
054700031202           PERFORM INSERT-STATEMENT-REC THRU ISR-EXIT.
054800031130
054900031130           SET  QRT   UP BY  1.
055000031130
055100031130           IF QRT   IS LESS THAN OR EQUAL TO WS-QRT-LST
055200031130              PERFORM   GET-NEXT-TEN-QRTEND-REC  THRU   QTEN-EXIT
055300031202              SET  QRTT  TO   1
055400031202              GO TO  GET-FUND-ROR-QUARTERLY
055500031202           END-IF.
055600031130
055700040211R20688*    PERFORM ENDJOB THRU END-EXIT.
055800031202
055900031202      **********
056000031202
056100040116       AIROR38-EXIT.
056200031202             EXIT.
056300031202
056400031202      **********
056500031202      /
056600031130
056700031130      ********************************************************
056800031202       ACCOUNT-ROR-30.
056900031130      ********************************************************
057000031130      ********
057100031130      ***  Generate Account-Performance records if required SEC-30
057200031130      ********
057300031223
057400031223           MOVE   COMM-IPS-NO          TO  WS-IPS-NO-TEMP.
057500061027           IF     COMM-PROGRAM-NAME  =  "ANN"
057600031223                  MOVE SPACES TO COMM-IPS-NO
057700031223           END-IF.
057800031201
057900040210R20688*    ADD 1                       TO  WS-ACC-PERF-COUNT.
058000040210   ¦       IF COMM-IPS-NO      IS EQUAL TO SPACES
058100040210   v          MOVE ZEROS               TO  WS-ACC-PERF-COUNT
058200040210R20688     END-IF.
058300040210
058400031130           INITIALIZE                  CPWRORCALC-LINKAGE.
058500031201           MOVE COMM-ACCOUNT-NO        TO  RR-ACCOUNT-NO.
058600031130           MOVE COMM-IPS-NO            TO  RR-CONS-ACCT-ID.
058700031130           MOVE ZEROS                  TO  RR-INITIAL-DATE.
058800031130           MOVE ZEROS                  TO  RR-CALCULATE-DATE.
058900031130
059000031202           MOVE COMM-LDA-ENDDATE       TO  RR-LAST-MONTH-END.
059100031201
059200031130           MOVE SPACES                 TO  RR-INVESTMENT-CODE.
059300031130
059400031130           PERFORM CALL-ROR-ACCOUNT-FUND-ROUTINE   THRU CRAFR-EXIT.
059500031130           PERFORM POPULATE-ROR-CODE-TBL           THRU PRCT-EXIT.
059600031130           PERFORM GET-PERIOD-DESC-RECORDS         THRU GPDR-EXIT.
059700031130
059800031130           INITIALIZE ACCOUNT-PERFORMANCE-SECTION.
059900031201           MOVE COMM-AD-INVESTOR-NO         TO AP-INVESTOR-NO.
060000031201           MOVE COMM-ACCOUNT-NO             TO AP-ACCOUNT.
060100031203           MOVE "30"                        TO AP-SECTION-NO.
060200040210R20688*    MOVE WS-ACC-PERF-COUNT           TO AP-SECTION-SEQUENCE.
060300031201           MOVE COMM-AD-LANGUAGE            TO AP-LANGUAGE.
060400031201           MOVE COMM-AD-DEALER              TO AP-DEALER.
060500031201           MOVE COMM-AD-SALESREP            TO AP-SALESREP.
060600031130
060700031130           PERFORM POPULATE-ACC-PERF-SECTION        THRU PAPS-EXIT.
060800031130
060900040414R20758     MOVE RR-CALCULATE-DATE           TO AP-CALC-DATE.
061000031201           MOVE COMM-AD-START-DATE          TO AP-START-DATE.
061100031201           MOVE COMM-AD-END-DATE            TO AP-END-DATE.
061200031224      *    MOVE COMM-IPS-NO                 TO AP-IPS-GROUP-ID.
061300031224           MOVE WS-IPS-NO-TEMP              TO AP-IPS-GROUP-ID.
061400031130
061500031203           IF  COMM-IPS-NO      IS EQUAL TO SPACES
061600040210R20688     ADD 1                            TO WS-ACC-PERF-COUNT
061700040210R20688     MOVE WS-ACC-PERF-COUNT           TO AP-SECTION-SEQUENCE
061800031203           MOVE ACCOUNT-PERFORMANCE-SECTION TO STATEMENT-REC(ISR)
061900031203           PERFORM INSERT-STATEMENT-REC THRU ISR-EXIT
062000031203           END-IF.
062100031203
062200031203           IF  COMM-IPS-NO      IS NOT EQUAL TO SPACES
062300031229           MOVE WS-INVESTOR-NO-IPS        TO AP-INVESTOR-NO
062400040210R20688     COMPUTE  WS-ACCOUNT-NO-IPS = WS-ACCOUNT-NO-IPS - 1
062500031229           MOVE WS-ACCOUNT-NO-IPS         TO AP-ACCOUNT
062600040210R20688*    COMPUTE WS-IPS-COUNT-CAD       = WS-IPS-COUNT-CAD + 1
062700040210R20688     MOVE WS-IPS-COUNT-30           TO AP-SECTION-SEQUENCE
062800031229
062900031203           MOVE ACCOUNT-PERFORMANCE-SECTION TO STATEMENT-REC(ISR)
063000031203           PERFORM INSERT-STATEMENT-REC-IPS THRU ISRI-EXIT
063100031203           END-IF.
063200031130
063300040211R20688*    PERFORM ENDJOB THRU END-EXIT.
063400031202
063500031202      **********
063600031202
063700040116       AROR30-EXIT.
063800031202               EXIT.
063900031202
064000031202      **********
064100031202      /
064200031202
064300031202      ********************************************************
064400031202       ACCOUNT-ROR-33.
064500031202      ********************************************************
064600031130      ********
064700031130      ***  Generate Account-ROR-FRQ-Section(33). if required
064800031130      ********
064900031224
065000031224           MOVE   COMM-IPS-NO          TO  WS-IPS-NO-TEMP.
065100061027           IF     COMM-PROGRAM-NAME  =  "ANN"
065200031224                  MOVE SPACES TO COMM-IPS-NO
065300031224           END-IF.
065400031130
065500031130           SET QRT   TO  1.
065600031130
065700031130           PERFORM  GET-NEXT-TEN-QRTEND-REC   THRU QTEN-EXIT.
065800031130
065900031130           SET QRTT  TO  1.
066000031130
066100040210R20688     IF COMM-IPS-NO       IS NOT EQUAL TO SPACES
066200040210   ¦          COMPUTE WS-ACCOUNT-NO-IPS = WS-ACCOUNT-NO-IPS - 1
066300040210   ¦          MOVE 811000             TO  WS-IPS-COUNT-33
066400040210   ¦       ELSE
066500040210   v          MOVE ZEROS        TO  WS-ACC-FRQ-COUNT
066600040210R20688     END-IF.
066700040210
066800031130       GET-ACCOUNT-ROR-QUARTERLY.
066900031130
067000031130           INITIALIZE                  ACCOUNT-ROR-FRQ-SECTION.
067100031130
067200040210R20688*    ADD 1                            TO  WS-ACC-FRQ-COUNT.
067300040210   ¦  *    IF COMM-IPS-NO             IS NOT EQUAL TO SPACES
067400040210   ¦  *        MOVE ZEROS              TO  WS-ACC-FRQ-COUNT
067500040210   ¦  *       MOVE 811000             TO  WS-IPS-COUNT-33
067600040210R20688*    END-IF.
067700031130
067800031201           MOVE COMM-AD-INVESTOR-NO         TO APF-INVESTOR-NO.
067900031201           MOVE COMM-ACCOUNT-NO             TO APF-ACCOUNT.
068000031229           MOVE "33"                        TO APF-SECTION-NO.
068100040210R20688*    MOVE WS-ACC-FRQ-COUNT            TO APF-SECTION-SEQUENCE.
068200031201           MOVE COMM-AD-LANGUAGE            TO APF-LANGUAGE.
068300031201           MOVE COMM-AD-DEALER              TO APF-DEALER.
068400031201           MOVE COMM-AD-SALESREP            TO APF-SALESREP.
068500031201           MOVE COMM-AD-START-DATE          TO APF-START-DATE.
068600031201           MOVE COMM-AD-END-DATE            TO APF-END-DATE.
068700031224      *    MOVE COMM-IPS-NO                 TO APF-IPS-GROUP-ID.
068800031224           MOVE WS-IPS-NO-TEMP              TO APF-IPS-GROUP-ID.
068900031130
069000031130       GET-ACCOUNT-ROR-QTR-NEXT.
069100031130
069200031130           INITIALIZE                  CPWRORCALC-LINKAGE.
069300031201           MOVE COMM-ACCOUNT-NO          TO  RR-ACCOUNT-NO.
069400031130           MOVE COMM-IPS-NO              TO  RR-CONS-ACCT-ID.
069500031130           MOVE ZEROS                    TO  RR-INITIAL-DATE.
069600031130           MOVE ZEROS                    TO  RR-CALCULATE-DATE.
069700031130           MOVE WS-QRT-ENDDATE-TEN(QRTT) TO  RR-LAST-MONTH-END.
069800031130           MOVE SPACES                   TO  RR-INVESTMENT-CODE.
069900031130
070000031130           PERFORM CALL-ROR-ACCOUNT-FUND-ROUTINE   THRU CRAFR-EXIT.
070100031130           PERFORM POPULATE-ROR-CODE-TBL           THRU PRCT-EXIT.
070200031130           PERFORM GET-PERIOD-DESC-RECORDS         THRU GPDR-EXIT.
070300031130
070400031130           PERFORM POPULATE-ACCOUNT-ROR-SECTION        THRU AQRT-EXIT.
070500031130
070600031130           IF  QRTT   IS LESS THAN    WS-QRT-TEN
070700031130               SET QRTT   UP BY    1
070800031130               IF WS-QRT-ENDDATE-TEN (QRTT) IS NOT EQUAL TO ZEROES
070900031130                  GO TO GET-ACCOUNT-ROR-QTR-NEXT
071000031130               END-IF
071100031130           END-IF.
071200031130
071300031203           IF  COMM-IPS-NO       IS EQUAL TO SPACES
071400040210R20688     ADD 1                          TO WS-ACC-FRQ-COUNT
071500040210R20688     MOVE WS-ACC-FRQ-COUNT          TO APF-SECTION-SEQUENCE
071600031203           MOVE ACCOUNT-ROR-FRQ-SECTION   TO STATEMENT-REC(ISR)
071700031203           PERFORM INSERT-STATEMENT-REC THRU ISR-EXIT
071800031203           END-IF.
071900031203
072000031203           IF  COMM-IPS-NO       IS NOT EQUAL TO SPACES
072100031224           MOVE WS-INVESTOR-NO-IPS        TO APF-INVESTOR-NO
072200040210R20688     COMPUTE WS-IPS-COUNT-33     = WS-IPS-COUNT-33 + 1
072300040210           MOVE WS-ACCOUNT-NO-IPS      TO APF-ACCOUNT
072400040210R20688     MOVE WS-IPS-COUNT-33        TO APF-SECTION-SEQUENCE
072500031229
072600031203           MOVE ACCOUNT-ROR-FRQ-SECTION   TO STATEMENT-REC(ISR)
072700031203           PERFORM INSERT-STATEMENT-REC-IPS THRU ISRI-EXIT
072800031203           END-IF.
072900031130
073000031130           SET  QRT   UP BY  1.
073100031130
073200031130           IF QRT    IS LESS THAN OR EQUAL TO    WS-QRT-LST
073300031130              PERFORM  GET-NEXT-TEN-QRTEND-REC   THRU QTEN-EXIT
073400031130              SET QRTT   TO   1
073500031130              GO TO  GET-ACCOUNT-ROR-QUARTERLY
073600031130           END-IF.
073700031130
073800040211R20688*    PERFORM ENDJOB THRU END-EXIT.
073900031202
074000031202      **********
074100031202
074200040116       AROR33-EXIT.
074300031202               EXIT.
074400031202
074500031202      **********
074600031202      /
074700031128
074800170217      *RFS164528 - Start
074900170217      ********************************************************
075000170217       ACCOUNT-ROR-31.
075100170217      ********************************************************
075200170217      *******
075300170217      ******* Generate Section 31
075400170217      *******
075500170217           INITIALIZE ACC-ROR-PERIOD-MKTVAL-SECTION.
075600170217
075700170217            CALL "STMTSEC31" USING ACCOUNT-PERFORMANCE-SECTION,
075800170217                                   ACC-ROR-PERIOD-MKTVAL-SECTION.
075900170217
076000170217
076100170217      *     CALL "STMTSEC31" USING AP-ACCOUNT,
076200170217      *                            AP-END-DATE,
076300170217      *                            AP-PERIOD-CODE-1,
076400170217      *                            AP-PERIOD-ROR-APPLICABLE-1
076500170217      *                            AP-PERIOD-CODE-2,
076600170217      *                            AP-PERIOD-ROR-APPLICABLE-2
076700170217      *                            AP-PERIOD-CODE-3,
076800170217      *                            AP-PERIOD-ROR-APPLICABLE-3
076900170217      *                            AP-PERIOD-CODE-4,
077000170217      *                            AP-PERIOD-ROR-APPLICABLE-4
077100170217      *                            AP-PERIOD-CODE-5,
077200170217      *                            AP-PERIOD-ROR-APPLICABLE-5
077300170217      *                            AP-PERIOD-CODE-6,
077400170217      *                            AP-PERIOD-ROR-APPLICABLE-6
077500170217      *                            AP-PERIOD-CODE-7,
077600170217      *                            AP-PERIOD-ROR-APPLICABLE-7
077700170217      *                            AP-PERIOD-CODE-8,
077800170217      *                            AP-PERIOD-ROR-APPLICABLE-8
077900170217      *                            AP-PERIOD-CODE-9,
078000170217      *                            AP-PERIOD-ROR-APPLICABLE-9
078100170217      *                            AP-PERIOD-CODE-10,
078200170217      *                            AP-PERIOD-ROR-APPLICABLE-10
078300170217      *                            ACC-ROR-PERIOD-MKTVAL-SECTION.
078400170217
078500170217           MOVE AP-INVESTOR-NO              TO A31-INVESTOR-NO.
078600170217           MOVE AP-ACCOUNT                  TO A31-ACCOUNT.
078700170217           MOVE "31"                        TO A31-SECTION-NO.
078800170217           MOVE AP-SECTION-SEQUENCE         TO A31-SECTION-SEQUENCE.
078900170217           MOVE AP-LANGUAGE                 TO A31-LANGUAGE.
079000170217           MOVE AP-DEALER                   TO A31-DEALER.
079100170217           MOVE AP-SALESREP                 TO A31-SALESREP.
079200170217           MOVE AP-PERIOD-CODE-1            TO A31-PERIOD-CODE-1.
079300170217           MOVE AP-PERIOD-DESCRIPTION-1     TO A31-PERIOD-DESCRIPTION-1.
079400170217           MOVE AP-PERIOD-CODE-2            TO A31-PERIOD-CODE-2.
079500170217           MOVE AP-PERIOD-DESCRIPTION-2     TO A31-PERIOD-DESCRIPTION-2.
079600170217           MOVE AP-PERIOD-CODE-3            TO A31-PERIOD-CODE-3.
079700170217           MOVE AP-PERIOD-DESCRIPTION-3     TO A31-PERIOD-DESCRIPTION-3.
079800170217           MOVE AP-PERIOD-CODE-4            TO A31-PERIOD-CODE-4.
079900170217           MOVE AP-PERIOD-DESCRIPTION-4     TO A31-PERIOD-DESCRIPTION-4.
080000170217           MOVE AP-PERIOD-CODE-5            TO A31-PERIOD-CODE-5.
080100170217           MOVE AP-PERIOD-DESCRIPTION-5     TO A31-PERIOD-DESCRIPTION-5.
080200170217           MOVE AP-PERIOD-CODE-6            TO A31-PERIOD-CODE-6.
080300170217           MOVE AP-PERIOD-DESCRIPTION-6     TO A31-PERIOD-DESCRIPTION-6.
080400170217           MOVE AP-PERIOD-CODE-7            TO A31-PERIOD-CODE-7.
080500170217           MOVE AP-PERIOD-DESCRIPTION-7     TO A31-PERIOD-DESCRIPTION-7.
080600170217           MOVE AP-PERIOD-CODE-8            TO A31-PERIOD-CODE-8.
080700170217           MOVE AP-PERIOD-DESCRIPTION-8     TO A31-PERIOD-DESCRIPTION-8.
080800170217           MOVE AP-PERIOD-CODE-9            TO A31-PERIOD-CODE-9.
080900170217           MOVE AP-PERIOD-DESCRIPTION-9     TO A31-PERIOD-DESCRIPTION-9.
081000170217           MOVE AP-PERIOD-CODE-10           TO A31-PERIOD-CODE-10.
081100170217           MOVE AP-PERIOD-DESCRIPTION-10    TO A31-PERIOD-DESCRIPTION-10.
081200170217           MOVE AP-START-DATE               TO A31-START-DATE.
081300170217           MOVE AP-END-DATE                 TO A31-END-DATE.
081400170217
081500170217           MOVE ACC-ROR-PERIOD-MKTVAL-SECTION TO STATEMENT-REC(ISR).
081600170217           PERFORM INSERT-STATEMENT-REC THRU ISR-EXIT.
081700170217
081800170217      **********
081900170217
082000170217       AROR31-EXIT.
082100170217              EXIT.
082200170217      **********
082300170217      /
082400170217      *RFS164528 - Ends.
082500031128      ********************************************************
082600031128       CALL-ROR-ACCOUNT-FUND-ROUTINE.
082700031128      ********************************************************
082800031128      ******************************************************************
082900031128      *    C A L L   A C C O U N T / F U N D  R O R  R O U T I N E     *
083000031128      ******************************************************************
083100031128
083200060526      * RFS30797 - Begin
083300060526      * ---------------------------------------------------
083400060526      *    CALL "RORCALC"  USING
083500060526      *                    RR-LAST-MONTH-END
083600060526      *                    RR-CALCULATE-DATE
083700060526      *                    RR-INITIAL-DATE
083800060526      *                    RR-CONS-ACCT-ID
083900060526      *                    RR-ACCOUNT-NO
084000060526      *                    RR-INVESTMENT-CODE
084100060526      *                    RR-PERIOD-CODE-1
084200060526      *                    RR-PERIOD-ROR-1
084300060526      *                    RR-PERIOD-CODE-2
084400060526      *                    RR-PERIOD-ROR-2
084500060526      *                    RR-PERIOD-CODE-3
084600060526      *                    RR-PERIOD-ROR-3
084700060526      *                    RR-PERIOD-CODE-4
084800060526      *                    RR-PERIOD-ROR-4
084900060526      *                    RR-PERIOD-CODE-5
085000060526      *                    RR-PERIOD-ROR-5
085100060526      *                    RR-PERIOD-CODE-6
085200060526      *                    RR-PERIOD-ROR-6
085300060526      *                    RR-PERIOD-CODE-7
085400060526      *                    RR-PERIOD-ROR-7
085500060526      *                    RR-PERIOD-CODE-8
085600060526      *                    RR-PERIOD-ROR-8
085700060526      *                    RR-PERIOD-CODE-9
085800060526      *                    RR-PERIOD-ROR-9
085900060526      *                    RR-PERIOD-CODE-10
086000060526      *                    RR-PERIOD-ROR-10
086100060526      *                    RR-PERIOD-ROR-APPL.
086200060526      *
086300040813R23531*    CANCEL  "RORCALC".
086400060526      * ---------------------------------------------------
086500060526      * Parameter to drive level for ROR calculation:
086600060526
086700060526           IF RR-CONS-ACCT-ID NOT = SPACES
086800060629             SET pncc-ClcIps     TO TRUE
086900060526           ELSE
087000060526             IF RR-INVESTMENT-CODE  NOT = SPACES
087100060629               SET pncc-ClcACI     TO TRUE
087200060526             ELSE
087300060629               SET pncc-ClcACC     TO TRUE.
087400060526
087500060629           SET pncc-ClcOnly      TO TRUE
087600060526
087700060629           MOVE RR-ACCOUNT-NO           TO pi-AccountNo
087800060629           MOVE RR-INVESTMENT-CODE      TO pc-InvestmentCode
087900060629           INITIALIZE pc-IpsGroupID
088000060629                      pc-InvestmentStructure
088100060629                      pn-MonthEndInitDate
088200060526
088300060629           MOVE RR-LAST-MONTH-END       TO pn-PerformanceAt
088400060526      * -------------------------------
088500060526      * Call program to calculate and save ROR data
088600060526      * -------------------------------
088700060526           CALL "RORCLCSAV"
088800060526             USING
088900060629                   pc-RorclcsaParms
089000060629                   ptb-RorArray
089100060629                   pc-RorclcsaRetnParms.
089200060526
089300060526      * -------------------------------
089400060526      * Populate returned parameters .
089500060526      * -------------------------------
089600060629           MOVE pn-PerformanceAt    TO RR-LAST-MONTH-END
089700060526                                       RR-CALCULATE-DATE
089800060629           MOVE pn-MonthEndInitDate TO RR-INITIAL-DATE
089900060526
090000060629           SET pi-IxPerRor       TO 1
090100060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-1
090200060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-1
090300060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-1
090400060526
090500060629           SET pi-IxPerRor       TO 2
090600060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-2
090700060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-2
090800060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-2
090900060526
091000060629           SET pi-IxPerRor       TO 3
091100060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-3
091200060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-3
091300060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-3
091400060526
091500060526
091600060629           SET pi-IxPerRor       TO 4
091700060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-4
091800060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-4
091900060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-4
092000060526
092100060629           SET pi-IxPerRor       TO 5
092200060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-5
092300060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-5
092400060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-5
092500060526
092600060629           SET pi-IxPerRor       TO 6
092700060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-6
092800060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-6
092900060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-6
093000060526
093100060629           SET pi-IxPerRor       TO 7
093200060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-7
093300060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-7
093400060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-7
093500060526
093600060629           SET pi-IxPerRor       TO 8
093700060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-8
093800060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-8
093900060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-8
094000060526
094100060629           SET pi-IxPerRor       TO 9
094200060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-9
094300060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-9
094400060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-9
094500060526
094600060629           SET pi-IxPerRor       TO 10
094700060629           MOVE pc-PeriodCode   (pi-IxPerRor) TO RR-PERIOD-CODE-10
094800060629           MOVE pn-PeriodRor    (pi-IxPerRor) TO RR-PERIOD-ROR-10
094900060629           MOVE pc-PeriodRorSts (pi-IxPerRor) TO RR-PERIOD-ROR-STS-10
095000061103R36342     .
095100060526      * RFS30797 - End
095200031128      **********
095300031128       CRAFR-EXIT.
095400031128             EXIT.
095500031128      **********
095600031202      /
095700031128
095800031128      ********************************************************
095900031128       POPULATE-ROR-CODE-TBL.
096000031128      ********************************************************
096100031128      *****
096200031128      *****    WS-ROR-CODE-TBL will be populated by the passed back
096300031128      *****    period-code and period-ror.
096400031128      *****
096500031128
096600031128           MOVE ZEROS                   TO  WS-ROCT-LST.
096700031202           MOVE 20                      TO  WS-ROCT-MAX.
096800031128           INITIALIZE                   WS-ROR-CODE-TBL.
096900031128RF6645     MOVE SPACES  TO   WS-PERIOD-ROR-APPL-ARRAY.
097000031128
097100031128       PRCT-0010.
097200031128
097300031128           IF WS-ROCT-LST     IS NOT LESS THAN  WS-ROCT-MAX
097400031128              GO TO PRCT-EXIT
097500031128           END-IF
097600031128
097700031128RF6645     MOVE RR-PERIOD-ROR-APPL       TO
097800031128                                       WS-PERIOD-ROR-APPL-ARRAY.
097900031128
098000031128           ADD 1                       TO  WS-ROCT-LST.
098100031128           SET ROCT                    TO  WS-ROCT-LST.
098200031128           MOVE RR-PERIOD-CODE-1       TO  WS-PERIOD-CCODE (ROCT).
098300031128           MOVE RR-PERIOD-ROR-1        TO  WS-PERIOD-CROR (ROCT).
098400031128           IF RR-PERIOD-ROR-1          IS  LESS THAN  ZEROS
098500031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
098600031128           END-IF
098700031128
098800031128           ADD 1                       TO  WS-ROCT-LST.
098900031128           SET ROCT                    TO  WS-ROCT-LST.
099000031128           MOVE RR-PERIOD-CODE-2       TO  WS-PERIOD-CCODE (ROCT).
099100031128           MOVE RR-PERIOD-ROR-2        TO  WS-PERIOD-CROR (ROCT).
099200031128           IF RR-PERIOD-ROR-2          IS  LESS THAN  ZEROS
099300031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
099400031128           END-IF
099500031128
099600031128           ADD 1                       TO  WS-ROCT-LST.
099700031128           SET ROCT                    TO  WS-ROCT-LST.
099800031128           MOVE RR-PERIOD-CODE-3       TO  WS-PERIOD-CCODE (ROCT).
099900031128           MOVE RR-PERIOD-ROR-3        TO  WS-PERIOD-CROR (ROCT).
100000031128           IF RR-PERIOD-ROR-3          IS  LESS THAN  ZEROS
100100031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
100200031128           END-IF
100300031128
100400031128           ADD 1                       TO  WS-ROCT-LST.
100500031128           SET ROCT                    TO  WS-ROCT-LST.
100600031128           MOVE RR-PERIOD-CODE-4       TO  WS-PERIOD-CCODE (ROCT).
100700031128           MOVE RR-PERIOD-ROR-4        TO  WS-PERIOD-CROR (ROCT).
100800031128           IF RR-PERIOD-ROR-4          IS  LESS THAN  ZEROS
100900031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
101000031128           END-IF
101100031128
101200031128           ADD 1                       TO  WS-ROCT-LST.
101300031128           SET ROCT                    TO  WS-ROCT-LST.
101400031128           MOVE RR-PERIOD-CODE-5       TO  WS-PERIOD-CCODE (ROCT).
101500031128           MOVE RR-PERIOD-ROR-5        TO  WS-PERIOD-CROR (ROCT).
101600031128           IF RR-PERIOD-ROR-5          IS  LESS THAN  ZEROS
101700031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
101800031128           END-IF
101900031128
102000031128           ADD 1                       TO  WS-ROCT-LST.
102100031128           SET ROCT                    TO  WS-ROCT-LST.
102200031128           MOVE RR-PERIOD-CODE-6       TO  WS-PERIOD-CCODE (ROCT).
102300031128           MOVE RR-PERIOD-ROR-6        TO  WS-PERIOD-CROR (ROCT).
102400031128           IF RR-PERIOD-ROR-6          IS  LESS THAN  ZEROS
102500031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
102600031128           END-IF
102700031128
102800031128           ADD 1                       TO  WS-ROCT-LST.
102900031128           SET ROCT                    TO  WS-ROCT-LST.
103000031128           MOVE RR-PERIOD-CODE-7       TO  WS-PERIOD-CCODE (ROCT).
103100031128           MOVE RR-PERIOD-ROR-7        TO  WS-PERIOD-CROR (ROCT).
103200031128           IF RR-PERIOD-ROR-7          IS  LESS THAN  ZEROS
103300031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
103400031128           END-IF
103500031128
103600031128           ADD 1                       TO  WS-ROCT-LST.
103700031128           SET ROCT                    TO  WS-ROCT-LST.
103800031128           MOVE RR-PERIOD-CODE-8       TO  WS-PERIOD-CCODE (ROCT).
103900031128           MOVE RR-PERIOD-ROR-8        TO  WS-PERIOD-CROR (ROCT).
104000031128           IF RR-PERIOD-ROR-8          IS  LESS THAN  ZEROS
104100031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
104200031128           END-IF
104300031128
104400031128           ADD 1                       TO  WS-ROCT-LST.
104500031128           SET ROCT                    TO  WS-ROCT-LST.
104600031128           MOVE RR-PERIOD-CODE-9       TO  WS-PERIOD-CCODE (ROCT).
104700031128           MOVE RR-PERIOD-ROR-9        TO  WS-PERIOD-CROR (ROCT).
104800031128           IF RR-PERIOD-ROR-9          IS  LESS THAN  ZEROS
104900031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
105000031128           END-IF
105100031128
105200031128           ADD 1                       TO  WS-ROCT-LST.
105300031128           SET ROCT                    TO  WS-ROCT-LST.
105400031128           MOVE RR-PERIOD-CODE-10      TO  WS-PERIOD-CCODE (ROCT).
105500031128           MOVE RR-PERIOD-ROR-10       TO  WS-PERIOD-CROR (ROCT).
105600031128           IF RR-PERIOD-ROR-10         IS  LESS THAN  ZEROS
105700031128              MOVE "-"                 TO  WS-PERIOD-CSIGN(ROCT)
105800031128           END-IF.
105900031128
106000031128      **********
106100031128
106200031128       PRCT-EXIT.
106300031128            EXIT.
106400031128
106500031128      **********
106600031202      /
106700031128
106800031128      ********************************************************
106900031128       POPULATE-FUND-PERF-SECTION.
107000031128      ********************************************************
107100031128      *****
107200031128      *****  Populate Section-35 fields with data from WS-ROR-CODE-TBL.
107300031128      *****
107400031128
107500031128           MOVE WS-PERIOD-CCODE (1)    TO  AFP-PERIOD-CODE-1.
107600031128           MOVE WS-PERIOD-CDESC (1)    TO  AFP-PERIOD-DESCRIPTION-1.
107700031128           MOVE WS-PERIOD-CROR  (1)    TO  AFP-PERIOD-ROR-1.
107800031128           MOVE WS-PERIOD-CSIGN (1)    TO  AFP-PERIOD-ROR-SIGN-1.
107900031128           IF WS-PERIOD-ROR-APPLICABLE-1   IS NOT EQUAL TO SPACES
108000031128              MOVE WS-PERIOD-ROR-APPLICABLE-1
108100031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-1
108200031128           END-IF
108300031128           MOVE WS-PERIOD-CCODE (2)    TO  AFP-PERIOD-CODE-2.
108400031128           MOVE WS-PERIOD-CDESC (2)    TO  AFP-PERIOD-DESCRIPTION-2.
108500031128           MOVE WS-PERIOD-CROR  (2)    TO  AFP-PERIOD-ROR-2.
108600031128
108700031128           MOVE WS-PERIOD-CSIGN (2)    TO  AFP-PERIOD-ROR-SIGN-2.
108800031128           IF WS-PERIOD-ROR-APPLICABLE-2   IS NOT EQUAL TO SPACES
108900031128              MOVE WS-PERIOD-ROR-APPLICABLE-2
109000031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-2
109100031128           END-IF
109200031128           MOVE WS-PERIOD-CCODE (3)    TO  AFP-PERIOD-CODE-3.
109300031128           MOVE WS-PERIOD-CDESC (3)    TO  AFP-PERIOD-DESCRIPTION-3.
109400031128           MOVE WS-PERIOD-CROR  (3)    TO  AFP-PERIOD-ROR-3.
109500031128           MOVE WS-PERIOD-CSIGN (3)    TO  AFP-PERIOD-ROR-SIGN-3.
109600031128           IF WS-PERIOD-ROR-APPLICABLE-3   IS NOT EQUAL TO SPACES
109700031128              MOVE WS-PERIOD-ROR-APPLICABLE-3
109800031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-3
109900031128           END-IF
110000031128           MOVE WS-PERIOD-CCODE (4)    TO  AFP-PERIOD-CODE-4.
110100031128           MOVE WS-PERIOD-CDESC (4)    TO  AFP-PERIOD-DESCRIPTION-4.
110200031128           MOVE WS-PERIOD-CROR  (4)    TO  AFP-PERIOD-ROR-4.
110300031128           MOVE WS-PERIOD-CSIGN (4)    TO  AFP-PERIOD-ROR-SIGN-4.
110400031128           IF WS-PERIOD-ROR-APPLICABLE-4   IS NOT EQUAL TO SPACES
110500031128              MOVE WS-PERIOD-ROR-APPLICABLE-4
110600031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-4
110700031128           END-IF
110800031128           MOVE WS-PERIOD-CCODE (5)    TO  AFP-PERIOD-CODE-5.
110900031128           MOVE WS-PERIOD-CDESC (5)    TO  AFP-PERIOD-DESCRIPTION-5.
111000031128           MOVE WS-PERIOD-CROR  (5)    TO  AFP-PERIOD-ROR-5.
111100031128           MOVE WS-PERIOD-CSIGN (5)    TO  AFP-PERIOD-ROR-SIGN-5.
111200031128           IF WS-PERIOD-ROR-APPLICABLE-5   IS NOT EQUAL TO SPACES
111300031128              MOVE WS-PERIOD-ROR-APPLICABLE-5
111400031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-5
111500031128           END-IF
111600031128           MOVE WS-PERIOD-CCODE (6)    TO  AFP-PERIOD-CODE-6.
111700031128           MOVE WS-PERIOD-CDESC (6)    TO  AFP-PERIOD-DESCRIPTION-6.
111800031128           MOVE WS-PERIOD-CROR  (6)    TO  AFP-PERIOD-ROR-6.
111900031128           MOVE WS-PERIOD-CSIGN (6)    TO  AFP-PERIOD-ROR-SIGN-6.
112000031128           IF WS-PERIOD-ROR-APPLICABLE-6   IS NOT EQUAL TO SPACES
112100031128              MOVE WS-PERIOD-ROR-APPLICABLE-6
112200031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-6
112300031128           END-IF
112400031128           MOVE WS-PERIOD-CCODE (7)    TO  AFP-PERIOD-CODE-7.
112500031128           MOVE WS-PERIOD-CDESC (7)    TO  AFP-PERIOD-DESCRIPTION-7.
112600031128           MOVE WS-PERIOD-CROR  (7)    TO  AFP-PERIOD-ROR-7.
112700031128           MOVE WS-PERIOD-CSIGN (7)    TO  AFP-PERIOD-ROR-SIGN-7.
112800031128           IF WS-PERIOD-ROR-APPLICABLE-7   IS NOT EQUAL TO SPACES
112900031128              MOVE WS-PERIOD-ROR-APPLICABLE-7
113000031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-7
113100031128           END-IF
113200031128           MOVE WS-PERIOD-CCODE (8)    TO  AFP-PERIOD-CODE-8.
113300031128           MOVE WS-PERIOD-CDESC (8)    TO  AFP-PERIOD-DESCRIPTION-8.
113400031128           MOVE WS-PERIOD-CROR  (8)    TO  AFP-PERIOD-ROR-8.
113500031128           MOVE WS-PERIOD-CSIGN (8)    TO  AFP-PERIOD-ROR-SIGN-8.
113600031128           IF WS-PERIOD-ROR-APPLICABLE-8   IS NOT EQUAL TO SPACES
113700031128              MOVE WS-PERIOD-ROR-APPLICABLE-8
113800031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-8
113900031128           END-IF
114000031128           MOVE WS-PERIOD-CCODE (9)    TO  AFP-PERIOD-CODE-9.
114100031128           MOVE WS-PERIOD-CDESC (9)    TO  AFP-PERIOD-DESCRIPTION-9.
114200031128           MOVE WS-PERIOD-CROR  (9)    TO  AFP-PERIOD-ROR-9.
114300031128           MOVE WS-PERIOD-CSIGN (9)    TO  AFP-PERIOD-ROR-SIGN-9.
114400031128           IF WS-PERIOD-ROR-APPLICABLE-9   IS NOT EQUAL TO SPACES
114500031128              MOVE WS-PERIOD-ROR-APPLICABLE-9
114600031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-9
114700031128           END-IF
114800031128           MOVE WS-PERIOD-CCODE (10)   TO  AFP-PERIOD-CODE-10.
114900031128           MOVE WS-PERIOD-CDESC (10)   TO  AFP-PERIOD-DESCRIPTION-10.
115000031128           MOVE WS-PERIOD-CROR  (10)   TO  AFP-PERIOD-ROR-10.
115100031128           MOVE WS-PERIOD-CSIGN (10)   TO  AFP-PERIOD-ROR-SIGN-10.
115200031128           IF WS-PERIOD-ROR-APPLICABLE-10  IS NOT EQUAL TO SPACES
115300031128              MOVE WS-PERIOD-ROR-APPLICABLE-10
115400031128                                       TO  AFP-PERIOD-ROR-APPLICABLE-10
115500031128           END-IF.
115600031128
115700031128      **********
115800031128
115900031128       PFPS-EXIT.
116000031128            EXIT.
116100031128
116200031128      **********
116300031202      /
116400031130
116500031130***********************************************************************
116600031130******* INSERT STATEMENT RECORDS
116700031130*******
116800031130***********************************************************************
116900031202R18147 INSERT-STATEMENT-REC.
117000031202           IF ISR < ISRMAX
117100031202              GO TO ISR-COUNTER
117200031202           END-IF.
117300031130
117400031202       ISR-INSERT.
117500031202R18814*    MOVE "INSERT INTO MFASTMEXP " TO WS-SQLERR-STATEMENT.
117600031202           EXEC SQL
117700031202           INSERT INTO MFASTMEXP
117800031202           :ISR ROWS
117900031202           VALUES
118000031202           (:STATEMENT-REC)
118100031202           END-EXEC.
118200031202
118300031202           MOVE ZEROES TO ISR.
118400031130
118500031202       ISR-COUNTER.
118600031202           ADD 1 TO ISR.
118700031130
118800031202       ISR-EXIT.
118900031202           EXIT.
119000031130
119100031202      /
119200031203      /
119300031130      ************************************************************
119400031130       GET-NEXT-TEN-QRTEND-REC.
119500031130      ************************************************************
119600031130      *****
119700031130      *****  Get the next ten records from the QRTEND table.
119800031130      *****
119900031130
120000031130             SET  QRTT  TO  1.
120100031130             INITIALIZE  WS-QRTEND-TBL-TEN.
120200031130
120300031130       LOAD-NEXT-TEN-REC.
120400031130
120500031130           MOVE  WS-QRT-ENDDATE (QRT)  TO  WS-QRT-ENDDATE-TEN (QRTT).
120600031130           MOVE  WS-QRT-FREQ    (QRT)  TO  WS-QRT-FREQ-TEN    (QRTT).
120700031130
120800031130           IF  QRTT  IS LESS THAN   WS-QRT-TEN
120900031130             SET  QRT   UP BY  1
121000031130             IF QRT <= WS-QRT-LST
121100031130                SET  QRTT  UP BY  1
121200031130                GO TO   LOAD-NEXT-TEN-REC
121300031130             END-IF
121400031130           END-IF.
121500031130
121600031130      **********
121700031130
121800031130       QTEN-EXIT.
121900031130            EXIT.
122000031130
122100031130      **********
122200031202      /
122300031130
122400031130      ************************************************************
122500031130      *****  Populate Section-38 fields with data from WS-ROR-CODE-TBL.
122600031130      ************************************************************
122700031130       POPULATE-FUND-ROR-SECTION.
122800031130           MOVE 1 TO ROR38.
122900031130
123000031130      ***** Find the Frequency from the returned ROR table that is
123100031130      ***** the same as the current quarter-end entry.
123200031130
123300031130           IF WS-PERIOD-CCODE (1) = WS-QRT-FREQ-TEN(QRTT)
123400031130              MOVE 1 TO ROR38
123500031130           END-IF.
123600031130           IF WS-PERIOD-CCODE (2) = WS-QRT-FREQ-TEN(QRTT)
123700031130              MOVE 2 TO ROR38
123800031130           END-IF.
123900031130           IF WS-PERIOD-CCODE (3) = WS-QRT-FREQ-TEN(QRTT)
124000031130              MOVE 3 TO ROR38
124100031130           END-IF.
124200031130           IF WS-PERIOD-CCODE (4) = WS-QRT-FREQ-TEN(QRTT)
124300031130              MOVE 4 TO ROR38
124400031130           END-IF.
124500031130           IF WS-PERIOD-CCODE (5) = WS-QRT-FREQ-TEN(QRTT)
124600031130              MOVE 5 TO ROR38
124700031130           END-IF.
124800031130           IF WS-PERIOD-CCODE (6) = WS-QRT-FREQ-TEN(QRTT)
124900031130              MOVE 6 TO ROR38
125000031130           END-IF.
125100031130           IF WS-PERIOD-CCODE (7) = WS-QRT-FREQ-TEN(QRTT)
125200031130              MOVE 7 TO ROR38
125300031130           END-IF.
125400031130           IF WS-PERIOD-CCODE (8) = WS-QRT-FREQ-TEN(QRTT)
125500031130              MOVE 8 TO ROR38
125600031130           END-IF.
125700031130           IF WS-PERIOD-CCODE (9) = WS-QRT-FREQ-TEN(QRTT)
125800031130              MOVE 9 TO ROR38
125900031130           END-IF.
126000031130           IF WS-PERIOD-CCODE (10) = WS-QRT-FREQ-TEN(QRTT)
126100031130              MOVE 10 TO ROR38
126200031130           END-IF.
126300031130
126400031130           IF QRTT  IS  EQUAL  TO   1
126500031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-1
126600031130              MOVE WS-PERIOD-CDESC(ROR38)  TO AFPF-PERIOD-DESCRIPTION-1
126700031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-1
126800031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-1
126900031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-1
127000031130
127100031130              IF WS-PERIOD-ROR-APPLICABLE-1   IS NOT EQUAL TO SPACES
127200031130                 MOVE WS-PERIOD-ROR-APPLICABLE-1
127300031130                   TO AFPF-PERIOD-ROR-APPLICABLE-1
127400031130              END-IF
127500031130           END-IF.
127600031130
127700031130           IF QRTT IS  EQUAL  TO   2
127800031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-2
127900031130              MOVE WS-PERIOD-CDESC(ROR38)   TO AFPF-PERIOD-DESCRIPTION-2
128000031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-2
128100031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-2
128200031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-2
128300031130
128400031130              IF WS-PERIOD-ROR-APPLICABLE-2   IS NOT EQUAL TO SPACES
128500031130                 MOVE WS-PERIOD-ROR-APPLICABLE-2
128600031130                   TO AFPF-PERIOD-ROR-APPLICABLE-2
128700031130              END-IF
128800031130           END-IF.
128900031130
129000031130           IF QRTT IS  EQUAL  TO   3
129100031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-3
129200031130              MOVE WS-PERIOD-CDESC(ROR38)   TO AFPF-PERIOD-DESCRIPTION-3
129300031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-3
129400031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-3
129500031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-3
129600031130
129700031130              IF WS-PERIOD-ROR-APPLICABLE-3   IS NOT EQUAL TO SPACES
129800031130                 MOVE WS-PERIOD-ROR-APPLICABLE-3
129900031130                   TO AFPF-PERIOD-ROR-APPLICABLE-3
130000031130              END-IF
130100031130           END-IF.
130200031130
130300031130           IF QRTT IS  EQUAL  TO   4
130400031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-4
130500031130              MOVE WS-PERIOD-CDESC(ROR38)   TO AFPF-PERIOD-DESCRIPTION-4
130600031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-4
130700031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-4
130800031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-4
130900031130
131000031130              IF WS-PERIOD-ROR-APPLICABLE-4   IS NOT EQUAL TO SPACES
131100031130                 MOVE WS-PERIOD-ROR-APPLICABLE-4
131200031130                   TO AFPF-PERIOD-ROR-APPLICABLE-4
131300031130              END-IF
131400031130           END-IF.
131500031130
131600031130           IF QRTT IS  EQUAL  TO   5
131700031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-5
131800031130              MOVE WS-PERIOD-CDESC(ROR38)   TO AFPF-PERIOD-DESCRIPTION-5
131900031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-5
132000031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-5
132100031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-5
132200031130
132300031130              IF WS-PERIOD-ROR-APPLICABLE-5   IS NOT EQUAL TO SPACES
132400031130                 MOVE WS-PERIOD-ROR-APPLICABLE-5
132500031130                   TO  AFPF-PERIOD-ROR-APPLICABLE-5
132600031130              END-IF
132700031130           END-IF.
132800031130
132900031130           IF QRTT IS  EQUAL  TO   6
133000031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-6
133100031130              MOVE WS-PERIOD-CDESC(ROR38)   TO AFPF-PERIOD-DESCRIPTION-6
133200031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-6
133300031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-6
133400031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-6
133500031130
133600031130              IF WS-PERIOD-ROR-APPLICABLE-6   IS NOT EQUAL TO SPACES
133700031130                 MOVE WS-PERIOD-ROR-APPLICABLE-6
133800031130                   TO AFPF-PERIOD-ROR-APPLICABLE-6
133900031130              END-IF
134000031130           END-IF.
134100031130
134200031130           IF QRTT  IS  EQUAL  TO   7
134300031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-7
134400031130              MOVE WS-PERIOD-CDESC(ROR38)   TO AFPF-PERIOD-DESCRIPTION-7
134500031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-7
134600031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-7
134700031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-7
134800031130
134900031130              IF WS-PERIOD-ROR-APPLICABLE-7   IS NOT EQUAL TO SPACES
135000031130                 MOVE WS-PERIOD-ROR-APPLICABLE-7
135100031130                   TO AFPF-PERIOD-ROR-APPLICABLE-7
135200031130              END-IF
135300031130           END-IF.
135400031130
135500031130           IF QRTT  IS  EQUAL  TO   8
135600031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-8
135700031130              MOVE WS-PERIOD-CDESC(ROR38)   TO AFPF-PERIOD-DESCRIPTION-8
135800031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-8
135900031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-8
136000031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-8
136100031130
136200031130              IF WS-PERIOD-ROR-APPLICABLE-8   IS NOT EQUAL TO SPACES
136300031130                 MOVE WS-PERIOD-ROR-APPLICABLE-8
136400031130                   TO AFPF-PERIOD-ROR-APPLICABLE-8
136500031130              END-IF
136600031130           END-IF.
136700031130
136800031130           IF QRTT  IS  EQUAL  TO   9
136900031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-9
137000031130              MOVE WS-PERIOD-CDESC(ROR38)   TO AFPF-PERIOD-DESCRIPTION-9
137100031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-9
137200031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-9
137300031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-9
137400031130
137500031130              IF WS-PERIOD-ROR-APPLICABLE-9   IS NOT EQUAL TO SPACES
137600031130                 MOVE WS-PERIOD-ROR-APPLICABLE-9
137700031130                   TO AFPF-PERIOD-ROR-APPLICABLE-9
137800031130              END-IF
137900031130           END-IF.
138000031130
138100031130           IF QRTT  IS  EQUAL  TO   10
138200031130              MOVE WS-PERIOD-CCODE(ROR38)   TO AFPF-PERIOD-CODE-10
138300031130              MOVE WS-PERIOD-CDESC(ROR38)
138400031130                TO AFPF-PERIOD-DESCRIPTION-10
138500031130              MOVE WS-PERIOD-CROR (ROR38)   TO AFPF-PERIOD-ROR-10
138600031130              MOVE WS-PERIOD-CSIGN(ROR38)   TO AFPF-PERIOD-ROR-SIGN-10
138700031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO AFPF-PERIOD-DATE-10
138800031130
138900031130              IF WS-PERIOD-ROR-APPLICABLE-10  IS NOT EQUAL TO SPACES
139000031130                 MOVE WS-PERIOD-ROR-APPLICABLE-10
139100031130                   TO AFPF-PERIOD-ROR-APPLICABLE-10
139200031130              END-IF
139300031130           END-IF.
139400031130
139500031130      **********
139600031130
139700031130       FQRT-EXIT.
139800031130            EXIT.
139900031130
140000031130      **********
140100031202      /
140200031130
140300031130      ************************************************************
140400031130       POPULATE-ACC-PERF-SECTION.
140500031130      ************************************************************
140600031130
140700031130      *****
140800031130      *****  Populate Section-30 fields with data from WS-ROR-CODE-TBL.
140900031130      *****
141000031130
141100031130           MOVE WS-PERIOD-CCODE (1)    TO  AP-PERIOD-CODE-1.
141200031130           MOVE WS-PERIOD-CDESC (1)    TO  AP-PERIOD-DESCRIPTION-1.
141300031130           MOVE WS-PERIOD-CROR  (1)    TO  AP-PERIOD-ROR-1.
141400031130           MOVE WS-PERIOD-CSIGN (1)    TO  AP-PERIOD-ROR-SIGN-1.
141500031130
141600031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-1   IS NOT EQUAL TO SPACES
141700031130              MOVE WS-PERIOD-ROR-APPLICABLE-1
141800031130                                       TO  AP-PERIOD-ROR-APPLICABLE-1
141900031130           END-IF
142000031130
142100031130           MOVE WS-PERIOD-CCODE (2)    TO  AP-PERIOD-CODE-2.
142200031130           MOVE WS-PERIOD-CDESC (2)    TO  AP-PERIOD-DESCRIPTION-2.
142300031130           MOVE WS-PERIOD-CROR  (2)    TO  AP-PERIOD-ROR-2.
142400031130           MOVE WS-PERIOD-CSIGN (2)    TO  AP-PERIOD-ROR-SIGN-2.
142500031130
142600031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-2   IS NOT EQUAL TO SPACES
142700031130              MOVE WS-PERIOD-ROR-APPLICABLE-2
142800031130                                       TO  AP-PERIOD-ROR-APPLICABLE-2
142900031130           END-IF
143000031130
143100031130           MOVE WS-PERIOD-CCODE (3)    TO  AP-PERIOD-CODE-3.
143200031130           MOVE WS-PERIOD-CDESC (3)    TO  AP-PERIOD-DESCRIPTION-3.
143300031130           MOVE WS-PERIOD-CROR  (3)    TO  AP-PERIOD-ROR-3.
143400031130           MOVE WS-PERIOD-CSIGN (3)    TO  AP-PERIOD-ROR-SIGN-3.
143500031130
143600031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-3   IS NOT EQUAL TO SPACES
143700031130              MOVE WS-PERIOD-ROR-APPLICABLE-3
143800031130                                       TO  AP-PERIOD-ROR-APPLICABLE-3
143900031130           END-IF
144000031130
144100031130           MOVE WS-PERIOD-CCODE (4)    TO  AP-PERIOD-CODE-4.
144200031130           MOVE WS-PERIOD-CDESC (4)    TO  AP-PERIOD-DESCRIPTION-4.
144300031130           MOVE WS-PERIOD-CROR  (4)    TO  AP-PERIOD-ROR-4.
144400031130           MOVE WS-PERIOD-CSIGN (4)    TO  AP-PERIOD-ROR-SIGN-4.
144500031130
144600031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-4   IS NOT EQUAL TO SPACES
144700031130              MOVE WS-PERIOD-ROR-APPLICABLE-4
144800031130                                       TO  AP-PERIOD-ROR-APPLICABLE-4
144900031130           END-IF
145000031130
145100031130           MOVE WS-PERIOD-CCODE (5)    TO  AP-PERIOD-CODE-5.
145200031130           MOVE WS-PERIOD-CDESC (5)    TO  AP-PERIOD-DESCRIPTION-5.
145300031130           MOVE WS-PERIOD-CROR  (5)    TO  AP-PERIOD-ROR-5.
145400031130           MOVE WS-PERIOD-CSIGN (5)    TO  AP-PERIOD-ROR-SIGN-5.
145500031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-5   IS NOT EQUAL TO SPACES
145600031130              MOVE WS-PERIOD-ROR-APPLICABLE-5
145700031130                                       TO  AP-PERIOD-ROR-APPLICABLE-5
145800031130           END-IF
145900031130           MOVE WS-PERIOD-CCODE (6)    TO  AP-PERIOD-CODE-6.
146000031130           MOVE WS-PERIOD-CDESC (6)    TO  AP-PERIOD-DESCRIPTION-6.
146100031130           MOVE WS-PERIOD-CROR  (6)    TO  AP-PERIOD-ROR-6.
146200031130           MOVE WS-PERIOD-CSIGN (6)    TO  AP-PERIOD-ROR-SIGN-6.
146300031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-6   IS NOT EQUAL TO SPACES
146400031130              MOVE WS-PERIOD-ROR-APPLICABLE-6
146500031130                                       TO  AP-PERIOD-ROR-APPLICABLE-6
146600031130           END-IF
146700031130           MOVE WS-PERIOD-CCODE (7)    TO  AP-PERIOD-CODE-7.
146800031130           MOVE WS-PERIOD-CDESC (7)    TO  AP-PERIOD-DESCRIPTION-7.
146900031130           MOVE WS-PERIOD-CROR  (7)    TO  AP-PERIOD-ROR-7.
147000031130           MOVE WS-PERIOD-CSIGN (7)    TO  AP-PERIOD-ROR-SIGN-7.
147100031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-7   IS NOT EQUAL TO SPACES
147200031130              MOVE WS-PERIOD-ROR-APPLICABLE-7
147300031130                                       TO  AP-PERIOD-ROR-APPLICABLE-7
147400031130           END-IF
147500031130           MOVE WS-PERIOD-CCODE (8)    TO  AP-PERIOD-CODE-8.
147600031130           MOVE WS-PERIOD-CDESC (8)    TO  AP-PERIOD-DESCRIPTION-8.
147700031130           MOVE WS-PERIOD-CROR  (8)    TO  AP-PERIOD-ROR-8.
147800031130           MOVE WS-PERIOD-CSIGN (8)    TO  AP-PERIOD-ROR-SIGN-8.
147900031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-8   IS NOT EQUAL TO SPACES
148000031130              MOVE WS-PERIOD-ROR-APPLICABLE-8
148100031130                                       TO  AP-PERIOD-ROR-APPLICABLE-8
148200031130           END-IF
148300031130           MOVE WS-PERIOD-CCODE (9)    TO  AP-PERIOD-CODE-9.
148400031130           MOVE WS-PERIOD-CDESC (9)    TO  AP-PERIOD-DESCRIPTION-9.
148500031130           MOVE WS-PERIOD-CROR  (9)    TO  AP-PERIOD-ROR-9.
148600031130           MOVE WS-PERIOD-CSIGN (9)    TO  AP-PERIOD-ROR-SIGN-9.
148700031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-9   IS NOT EQUAL TO SPACES
148800031130              MOVE WS-PERIOD-ROR-APPLICABLE-9
148900031130                                       TO  AP-PERIOD-ROR-APPLICABLE-9
149000031130           END-IF
149100031130           MOVE WS-PERIOD-CCODE (10)   TO  AP-PERIOD-CODE-10.
149200031130           MOVE WS-PERIOD-CDESC (10)   TO  AP-PERIOD-DESCRIPTION-10.
149300031130           MOVE WS-PERIOD-CROR  (10)   TO  AP-PERIOD-ROR-10.
149400031130           MOVE WS-PERIOD-CSIGN (10)   TO  AP-PERIOD-ROR-SIGN-10.
149500031130RF6645     IF WS-PERIOD-ROR-APPLICABLE-10  IS NOT EQUAL TO SPACES
149600031130              MOVE WS-PERIOD-ROR-APPLICABLE-10
149700031130                                       TO  AP-PERIOD-ROR-APPLICABLE-10
149800031130           END-IF.
149900031130
150000031130      **********
150100031130
150200031130       PAPS-EXIT.
150300031130            EXIT.
150400031130
150500031130      **********
150600031202      /
150700031130
150800031130      **************************************************************
150900031130       POPULATE-ACCOUNT-ROR-SECTION.
151000031130      **************************************************************
151100031130
151200031130      *****
151300031130      *****  Populate Section-33 from WS-ROR-CODE-TBL.
151400031130      *****
151500031130
151600031130           MOVE 1 TO ROR33.
151700031130
151800031130           IF WS-PERIOD-CCODE (1) = WS-QRT-FREQ-TEN(QRTT)
151900031130              MOVE 1 TO ROR33
152000031130           END-IF.
152100031130           IF WS-PERIOD-CCODE (2) = WS-QRT-FREQ-TEN(QRTT)
152200031130              MOVE 2 TO ROR33
152300031130           END-IF.
152400031130           IF WS-PERIOD-CCODE (3) = WS-QRT-FREQ-TEN(QRTT)
152500031130              MOVE 3 TO ROR33
152600031130           END-IF.
152700031130           IF WS-PERIOD-CCODE (4) = WS-QRT-FREQ-TEN(QRTT)
152800031130              MOVE 4 TO ROR33
152900031130           END-IF.
153000031130           IF WS-PERIOD-CCODE (5) = WS-QRT-FREQ-TEN(QRTT)
153100031130              MOVE 5 TO ROR33
153200031130           END-IF.
153300031130           IF WS-PERIOD-CCODE (6) = WS-QRT-FREQ-TEN(QRTT)
153400031130              MOVE 6 TO ROR33
153500031130           END-IF.
153600031130           IF WS-PERIOD-CCODE (7) = WS-QRT-FREQ-TEN(QRTT)
153700031130              MOVE 7 TO ROR33
153800031130           END-IF.
153900031130           IF WS-PERIOD-CCODE (8) = WS-QRT-FREQ-TEN(QRTT)
154000031130              MOVE 8 TO ROR33
154100031130           END-IF.
154200031130           IF WS-PERIOD-CCODE (9) = WS-QRT-FREQ-TEN(QRTT)
154300031130              MOVE 9 TO ROR33
154400031130           END-IF.
154500031130           IF WS-PERIOD-CCODE (10) = WS-QRT-FREQ-TEN(QRTT)
154600031130              MOVE 10 TO ROR33
154700031130           END-IF.
154800031130
154900031130           IF QRTT  IS  EQUAL  TO   1
155000031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-1
155100031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-1
155200031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-1
155300031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-1
155400031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-1
155500031130              IF WS-PERIOD-ROR-APPLICABLE-1   IS NOT EQUAL TO SPACES
155600031130                 MOVE WS-PERIOD-ROR-APPLICABLE-1
155700031130                   TO APF-PERIOD-ROR-APPLICABLE-1
155800031130              END-IF
155900031130           END-IF.
156000031130
156100031130           IF QRTT IS  EQUAL  TO   2
156200031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-2
156300031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-2
156400031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-2
156500031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-2
156600031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-2
156700031130
156800031130              IF WS-PERIOD-ROR-APPLICABLE-2   IS NOT EQUAL TO SPACES
156900031130                 MOVE WS-PERIOD-ROR-APPLICABLE-2
157000031130                   TO APF-PERIOD-ROR-APPLICABLE-2
157100031130              END-IF
157200031130           END-IF.
157300031130
157400031130           IF QRTT IS  EQUAL  TO   3
157500031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-3
157600031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-3
157700031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-3
157800031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-3
157900031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-3
158000031130
158100031130              IF WS-PERIOD-ROR-APPLICABLE-3   IS NOT EQUAL TO SPACES
158200031130                 MOVE WS-PERIOD-ROR-APPLICABLE-3
158300031130                   TO APF-PERIOD-ROR-APPLICABLE-3
158400031130              END-IF
158500031130           END-IF.
158600031130
158700031130           IF QRTT IS  EQUAL  TO   4
158800031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-4
158900031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-4
159000031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-4
159100031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-4
159200031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-4
159300031130
159400031130              IF WS-PERIOD-ROR-APPLICABLE-4   IS NOT EQUAL TO SPACES
159500031130                 MOVE WS-PERIOD-ROR-APPLICABLE-4
159600031130                   TO APF-PERIOD-ROR-APPLICABLE-4
159700031130              END-IF
159800031130           END-IF.
159900031130
160000031130           IF QRTT IS  EQUAL  TO   5
160100031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-5
160200031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-5
160300031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-5
160400031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-5
160500031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-5
160600031130
160700031130              IF WS-PERIOD-ROR-APPLICABLE-5   IS NOT EQUAL TO SPACES
160800031130                 MOVE WS-PERIOD-ROR-APPLICABLE-5
160900031130                   TO APF-PERIOD-ROR-APPLICABLE-5
161000031130              END-IF
161100031130           END-IF.
161200031130
161300031130           IF QRTT IS  EQUAL  TO   6
161400031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-6
161500031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-6
161600031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-6
161700031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-6
161800031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-6
161900031130
162000031130              IF WS-PERIOD-ROR-APPLICABLE-6   IS NOT EQUAL TO SPACES
162100031130                 MOVE WS-PERIOD-ROR-APPLICABLE-6
162200031130                   TO APF-PERIOD-ROR-APPLICABLE-6
162300031130              END-IF
162400031130           END-IF.
162500031130
162600031130           IF QRTT IS  EQUAL  TO   7
162700031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-7
162800031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-7
162900031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-7
163000031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-7
163100031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-7
163200031130
163300031130              IF WS-PERIOD-ROR-APPLICABLE-7   IS NOT EQUAL TO SPACES
163400031130                 MOVE WS-PERIOD-ROR-APPLICABLE-7
163500031130                   TO APF-PERIOD-ROR-APPLICABLE-7
163600031130              END-IF
163700031130           END-IF.
163800031130
163900031130           IF QRTT  IS  EQUAL  TO   8
164000031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-8
164100031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-8
164200031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-8
164300031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-8
164400031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-8
164500031130
164600031130              IF WS-PERIOD-ROR-APPLICABLE-8   IS NOT EQUAL TO SPACES
164700031130                 MOVE WS-PERIOD-ROR-APPLICABLE-8
164800031130                   TO APF-PERIOD-ROR-APPLICABLE-8
164900031130              END-IF
165000031130           END-IF.
165100031130
165200031130           IF QRTT IS  EQUAL  TO   9
165300031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-9
165400031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-9
165500031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-9
165600031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-9
165700031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-9
165800031130
165900031130              IF WS-PERIOD-ROR-APPLICABLE-9   IS NOT EQUAL TO SPACES
166000031130                 MOVE WS-PERIOD-ROR-APPLICABLE-9
166100031130                   TO APF-PERIOD-ROR-APPLICABLE-9
166200031130              END-IF
166300031130           END-IF.
166400031130
166500031130           IF QRTT IS  EQUAL  TO   10
166600031130              MOVE WS-PERIOD-CCODE(ROR33)   TO APF-PERIOD-CODE-10
166700031130              MOVE WS-PERIOD-CDESC(ROR33)   TO APF-PERIOD-DESCRIPTION-10
166800031130              MOVE WS-PERIOD-CROR (ROR33)   TO APF-PERIOD-ROR-10
166900031130              MOVE WS-PERIOD-CSIGN(ROR33)   TO APF-PERIOD-ROR-SIGN-10
167000031130              MOVE WS-QRT-ENDDATE-TEN(QRTT) TO APF-PERIOD-DATE-10
167100031130
167200031130              IF WS-PERIOD-ROR-APPLICABLE-10  IS NOT EQUAL TO SPACES
167300031130                 MOVE WS-PERIOD-ROR-APPLICABLE-10
167400031130                   TO APF-PERIOD-ROR-APPLICABLE-10
167500031130              END-IF
167600031130           END-IF.
167700031130
167800031130      **********
167900031130
168000031130       AQRT-EXIT.
168100031130            EXIT.
168200031130
168300031130      **********
168400031202      /
168500031130
168600031201      ************************************************************
168700031201       GET-PERIOD-DESC-RECORDS.
168800031201      ************************************************************
168900031201      *****
169000031201      *****    Format the period description depending on whether
169100031201      *****    English or Franch language was used.
169200031201      *****
169300031201
169400031201           MOVE 1                      TO WS-ROCT-LST.
169500031201           SET ROT                     TO  1.
169600031201           SET ROCT                    TO  1.
169700031201           IF WS-ROT-LST NOT GREATER THAN  ZEROES
169800031201               GO TO GPDR-0070
169900031201           END-IF.
170000031201
170100031201       GPDR-0010.
170200031201
170300031201           IF WS-ROCT-LST        IS NOT LESS THAN  WS-ROCT-MAX
170400031201               GO TO GPDR-EXIT
170500031201           END-IF
170600031201
170700031201           IF WS-PERIOD-CCODE(ROCT) IS EQUAL TO  WS-PERIOD-CODE (ROT)
170800031204           AND COMM-AD-LANGUAGE  EQUAL TO  "F"
170900031201               SET ROTL                 TO  2
171000031201               GO TO GPDR-0030
171100031201           END-IF
171200031201
171300031201           IF WS-PERIOD-CCODE(ROCT)  IS EQUAL TO  WS-PERIOD-CODE (ROT)
171400031201               SET ROTL                TO  1
171500031201               GO TO GPDR-0030
171600031201           END-IF
171700031201
171800031201           SET ROT                  UP BY  1.
171900031201           IF ROT    IS NOT GREATER THAN  WS-ROT-LST
172000031201               GO TO GPDR-0010
172100031201           END-IF.
172200031201
172300031201       GPDR-0030.
172400031201
172500031201           IF ROT         IS GREATER THAN  WS-ROT-LST
172600031201               GO TO GPDR-0060
172700031201           END-IF
172800031201
172900031201           MOVE WS-PERIOD-DESC (ROT, ROTL)
173000031201                                 TO  WS-PERIOD-CDESC(ROCT).
173100031201           GO TO GPDR-0070.
173200031201
173300031201       GPDR-0060.
173400031201
173500031201           MOVE ALL "*"          TO  WS-PERIOD-CDESC(ROCT).
173600031201
173700031201       GPDR-0070.
173800031201
173900031201           SET ROT                     TO  1.
174000031201           ADD 1                       TO WS-ROCT-LST.
174100031201           SET ROCT                    TO WS-ROCT-LST.
174200031201           GO TO GPDR-0010.
174300031201
174400031201      **********
174500031201
174600031201       GPDR-EXIT.
174700031201            EXIT.
174800031201
174900031201      **********
175000031202      /
175100031201
175200031202      ************************************************************
175300031202       INITIALIZATION.
175400031202      ************************************************************
175500060526      * RFS30797 - Begin
175600060526      * Initial passing array - parameters
175700060629           PERFORM VARYING pi-IxPerRor
175800060629             FROM 1 BY 1 UNTIL pi-IxPerRor > 10
175900060629               INITIALIZE pc-PeriodCode   (pi-IxPerRor)
176000060629                          pn-PeriodRor    (pi-IxPerRor)
176100060629                          pc-PeriodRorSts (pi-IxPerRor)
176200060526           END-PERFORM
176300060526      * RFS30797 - End
176400060526
17650007092440307      MOVE lncc_No TO pc-extAccRorCalYrFlag pc-extAciRorCalYrFlag
176600070924  |                        pc-extIstRorCalYrFlag pc-CalendarYearFlag
176700070924  |                        pc-AddNewAccFlag.
17680007092440307      MOVE ZEROES TO  pn-CalendarYearPeriods.
176900070924
177000031202           OPEN    INPUT   ROR-PERIOD-CODES
177100031202                           ROR-PERIOD-DESCRIPTION.
177200031222
177300031202      *****
177400031202      *****    Load the ROR Description table.
177500031202      *****
177600031202
177700031202           MOVE SPACES                 TO  WS-ROR-TBL.
177800031202           MOVE ZEROES                 TO  WS-ROT-LST.
177900031202           MOVE 50                     TO  WS-ROT-MAX.
178000031202           MOVE 10                     TO  WS-QRT-TEN.
178100031202           MOVE 300                    TO  WS-QRT-MAX.
178200031202
178300031202           MOVE COMM-QRT-LST           TO  WS-QRT-LST.
178400031202
178500031202       INL-0375.
178600031202
178700031202           READ ROR-PERIOD-CODES       AT  END
178800031202               GO TO INL-0900
178900031202           END-READ
179000031202
179100031202           IF  WS-ROT-LST IS NOT LESS THAN  WS-ROT-MAX
179200031202               DISPLAY "PERIOD CODES (MFARORPCP) EXCEED PROGRAM MAX"
179300031202               GO TO INL-EXIT
179400031202           END-IF
179500031202
179600031202           ADD 1                        TO  WS-ROT-LST.
179700031202           SET ROT                      TO  WS-ROT-LST.
179800031202           MOVE PERIOD-CODE
179900031202                OF ROR-PERIOD-CODES-REC TO  WS-PERIOD-CODE (ROT).
180000031202
180100031202           INITIALIZE MFARORPDP.
180200031202           MOVE PERIOD-CODE  OF ROR-PERIOD-CODES-REC
180300031202                     TO  PERIOD-CODE OF ROR-PERIOD-DESCRIPTION-REC.
180400031202
180500031202           START ROR-PERIOD-DESCRIPTION
180600031202               KEY       IS NOT LESS THAN  EXTERNALLY-DESCRIBED-KEY
180700031202               INVALID KEY
180800031202                   GO TO INL-0800-0020
180900031202           END-START.
181000031202
181100031202       INL-0800-0010.
181200031202
181300031202           READ ROR-PERIOD-DESCRIPTION NEXT AT  END
181400031202               GO TO INL-0800-0020
181500031202           END-READ
181600031202
181700031202           IF PERIOD-CODE
181800031202               OF ROR-PERIOD-DESCRIPTION-REC
181900031202                          IS NOT EQUAL TO  PERIOD-CODE
182000031202                                    OF ROR-PERIOD-CODES-REC
182100031202               GO TO INL-0800-0020
182200031202           END-IF
182300031202
182400031202           IF LANGUAGE-CODE OF ROR-PERIOD-DESCRIPTION-REC
182500031202                       IS EQUAL TO  "E"
182600031202              SET ROTL                TO  1
182700031202              MOVE PERIOD-DESCRIPTION OF ROR-PERIOD-DESCRIPTION-REC
182800031202                               TO  WS-PERIOD-DESC (ROT, ROTL)
182900031202           END-IF
183000031202
183100031202           IF LANGUAGE-CODE OF ROR-PERIOD-DESCRIPTION-REC
183200031202                       IS EQUAL TO  "F"
183300031202              SET ROTL                TO  2
183400031202              MOVE PERIOD-DESCRIPTION OF ROR-PERIOD-DESCRIPTION-REC
183500031202                               TO  WS-PERIOD-DESC (ROT, ROTL)
183600031202           END-IF
183700031202
183800031202           GO TO INL-0800-0010.
183900031202
184000031202       INL-0800-0020.
184100031202
184200031202           GO TO INL-0375.
184300031202
184400031202       INL-0900.
184500031202
184600031202           IF  WS-ROT-LST NOT GREATER THAN  ZEROES
184700031202               DISPLAY "ROR PERIOD CODES (MFARORPCP) FOUND"
184800031202           END-IF.
184900031202
185000031202      **********
185100031202
185200031202       INL-EXIT.
185300031202           EXIT.
185400031202
185500031202      **********
185600031202      /
185700031202
185800031202      ************************************************************
185900031202       ENDJOB.
186000031202      ************************************************************
186100031218           CLOSE           ROR-PERIOD-CODES
186200031218                           ROR-PERIOD-DESCRIPTION.
186300031218
186400031203           IF COMM-IPS-NO IS EQUAL TO SPACES
186500031202           IF ISR > 1
186600031202              COMPUTE ISR = ISR - 1
186700031202      *       COMPUTE ISRMAX = ISR
186800031202              MOVE ISR TO ISRMAX
186900031202              PERFORM INSERT-STATEMENT-REC THRU ISR-EXIT
187000031203           END-IF
187100031203           END-IF.
187200031203
187300031203           IF COMM-IPS-NO IS NOT EQUAL TO SPACES
187400031203           IF ISR > 1
187500031203              COMPUTE ISR = ISR - 1
187600031203      *       COMPUTE ISRMAX = ISR
187700031203              MOVE ISR TO ISRMAX
187800031218              PERFORM INSERT-STATEMENT-REC-IPS THRU ISRI-EXIT
187900031203           END-IF
188000031203           END-IF.
188100031202
188200031202
188300040116           GOBACK.
188400031202      **********
188500031202
188600031202       END-EXIT.
188700031202           EXIT.
188800031202
188900031202      **********
189000031202      /
189100031218***********************************************************************
189200031218******* INSERT STATEMENT IPS RECORDS
189300031218*******
189400031218***********************************************************************
189500031218R18147 INSERT-STATEMENT-REC-IPS.
189600031218           IF ISR < ISRMAX
189700031218              GO TO ISR-COUNTER-IPS
189800031218           END-IF.
189900031218
190000031218       ISR-INSERT.
190100031218R18814*    MOVE "INSERT INTO MFASTMIPS " TO WS-SQLERR-STATEMENT.
190200031218           EXEC SQL
190300031218           INSERT INTO MFASTMIPS
190400031218           :ISR ROWS
190500031218           VALUES
190600031218           (:STATEMENT-REC)
190700031218           END-EXEC.
190800031218
190900031218           MOVE ZEROES TO ISR.
191000031218
191100031218       ISR-COUNTER-IPS.
191200031218           ADD 1 TO ISR.
191300031218
191400031218       ISRI-EXIT.
191500031218           EXIT.
