000001170313      * %ATTR OPTION(*LSTDBG)
000101000000       IDENTIFICATION DIVISION.
000201000000       PROGRAM-ID.     STMTCNV.
000301000000       INSTALLATION.   Jewelstone Systems Inc.
000401000000       AUTHOR.         Jewelstone Systems Inc.
000501000000       DATE-WRITTEN.   June 25, 1997.
000601000000       DATE-COMPILED.
000701000000
000801000000      ******************************************************************
000901000000      *                                                                *
001001000000      *    STMTCNV:    Statement Conversion - Standard                 *
001101000000      *                                                                *
001201000000      *    PURPOSE:    To create multiple statement files, based on    *
001301000000      *                language and hold mail, from the original       *
001401000000      *                extract file.  Control totals will be           *
001501000000      *                accumulated and placed on the Delivery          *
001601000000      *                Information record.                             *
001701000000      *                                                                *
001801000000      *    LEVELS:      1. Investor Number                             *
001901000000      *                                                                *
002001000000      *    FILES:      (I) MFASTMEXP   Statement Data                  *
002101000000      *                (O) STMENG      Statement (CAN English)         *
002201000000      *                (O) STMENGF     Statement (FGN English)         *
002301000000      *                (O) STMENGHLD   Statement (CAN English Hold)    *
002401000000      *                (O) STMENGHLDF  Statement (FGN English Hold)    *
002501000000      *                (O) STMENGU     Statement (USA English)         *
002601000000      *                (O) STMENGHLDU  Statement (USA English Hold)    *
002701000000      *                (O) STMFRN      Statement (CAN French)          *
002801000000      *                (O) STMFRNF     Statement (FGN French)          *
002901000000      *                (O) STMFRNHLD   Statement (CAN French Hold)     *
003001000000      *                (O) STMFRNHLDF  Statement (FGN French Hold)     *
003101000000      *                (O) STMFRNU     Statement (USA French)          *
003201000000      *                (O) STMFRNHLDU  Statement (USA French Hold)     *
003301000000      *                (O) PRINTER     Control Report                  *
003401000000      *                                                                *
003501000000      *    CREATED:    16/JUL/97 (MFH)                                 *
003601990519      *    CHANGED:    16/MAY/99 (MFH)                                 *
003701000000      *                                                                *
003801000000      ******************************************************************
003901000000      /
004001000000      ******************************************************************
004101000000      *                                                                *
004201000000      *    C H A N G E   H I S T O R Y                                 *
004301000000      *                                                                *
004401000000      ******************************************************************
004501000000      ******************************************************************
004601000000      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
004701000000      ******************************************************************
004801971024      *M.Howorth   *  1997/10/24  * RFS LOG #1502, #1544, #1549        *
004901971026      *            *     thru     * - Modifications to use the new LDA *
005001971026      *            *  1997/10/26  *   copy book (CPYLDASTMT).          *
005101971026      *            *              * - Modifications to handle the new  *
005201971026      *            *              *   Systematic Plan Info record.     *
005301030508      ******************************************************************
005401971028      *M.Howorth   *  1997/10/28  * RFS LOG #1502, #1544, #1549        *
005501971028      *            *              * - Modifications to only produce an *
005601971028      *            *              *   ENGLISH and an ENGLISH HOLD MAIL *
005701971028      *            *              *   statement extract file file AIC. *
005801030508      ******************************************************************
005901980511      *H.SHENG     *  1998/05/11  * RFS LOG #2334                      *
006001980511      *            *              * - Modifications to change record   *
006101980511      *            *              *   length of MFASTMEXP from 650 to  *
006201980609      *            *              *   750                              *
006301980609      *            *              * - Modifications to add new record  *
006401980609      *            *              *   count for new "group" section.   *
006501980609      *            *              *   Modifications so when company    *
006601980609      *            *              *   is GGF program creates four files*
006701980609      *            *              *   Foreign and American is not      *
006801980609      *            *              *   created.                         *
006901030508      ******************************************************************
007001980604      *T.Hamid     *  1998/06/03  * RFS LOG #2334                      *
007101980604      *            *              * - Modifications to create English, *
007201980604      *            *              *   French file when GGF and DL-DELI *
007301980609      *            *              *   DL-DELIVERY-METHOD equal ICS.    *
007401030508      ******************************************************************
007501980609      * M.Howorth  *  1998/06/09  * RFS LOG #2334                      *
007601980609      *            *              * - Modifications to handling of the *
007701980609      *            *              *   ICS files.                       *
007801030508      ******************************************************************
007901981218      * H.SHENG    *  1998/12/18  * RFS 3527                           *
008001030508      ******************************************************************
008101990519      * H.SHENG    *  1999/05/19  * RFS 4662                           *
008201990519      *            *              * - Amalgamate the mail and ICS files*
008301030508      ******************************************************************
008401000222      * H.SHENG    *  2000/02/22  * RFS 6532 - EXPAND the length of   *
008501000222      *            *              * dealer rep from 5 to 6            *
008601030508      ******************************************************************
008701000515      * B.LU       *  2000/05/15  * RFS 7051 - Section 30, 35, 67,    *
008801000515      *            *              * AND 84 were processed.            *
008901030508      ******************************************************************
009001001011      * B.LU       *  2000/10/11  * RFS 7776 - AD-BOOK-VALUE was
009101001011      *            *              * renamed to AD-BOOK-VALUE-BASE.    *
009201030508      ******************************************************************
009301010125      * K.LIU      *  2001/01/25  * RFS 8558 - Section 40, 43, 45,
009401010125      *            *              * and 90 were processed.            *
009501030508      ******************************************************************
009601010321      * K.LIU      *  2001/03/07  * RFS 8633 - Section 12 and 25
009701010321      *            *              * was processed.
009801030508      ******************************************************************
009901010411      * Ping Fan   * 2001/04/09   * RFS 9964
010001010411      *            *              * - Amended 'AIC' specific code in
010101010411      *            *              *   UNITRAX to include 'TAI'.
010201030508      ******************************************************************
010301010525      * B.Lu       * 2001/05/25   * RFS 9523
010401010525      *            *              * If WS-LDA-HOLD-MAIL was set to "Y"
010501010525      *            *              * AIC's file system will be applied
010601010525      *            *              * for Confirm.                       *
010701030508      ******************************************************************
010801011022      * B.Lu       * 2001/10/22   * RFS10901, 11127, 10605
010901011022      *            *              * -Recompile only.
011001030508      ******************************************************************
011101011123      * A.ALNEMER  * 2001/11/23   * RFS12150
011201011123      *            *              * -Recompile only.
011301030508      ******************************************************************
011401020402      * B.Lu         2002/01/30   * RFS12102
011501020402      *            *              * -Recompile only.
011601030508      ******************************************************************
011701020326      * A.ALNEMER  * 2002/03/26   * RFS12173
011801020326      *            *              * -Recompile only.
011901030508      ******************************************************************
012001020404      * A.ALNEMER  * 2002/04/04   * RFS13184
012101020404      *            *              * -Recompile only.
012201030508      ******************************************************************
012301020416      * A.ALNEMER  * 2002/04/16   * RFS13211
012401020416      *            *              * -Recompile only.
012501030508      ******************************************************************
012601020614      * A.ALNEMER  * 2002/06/14   * RFS13756
012701020614      *            *              * -Recompile only.
012801030508      ******************************************************************
012901020821      * A.ALNEMER  * 2002/08/21   * RFS13955
013001020821      *            *              * -Recompile only.
013101030508      ******************************************************************
013201020821      * A.ALNEMER  * 2002/08/21   * RFS14136
013301020821      *            *              * -Recompile only.
013401030508      ******************************************************************
013501020925      * B.LU       * 2002/09/25   * RFS14556  Recompile.
013601030508      ******************************************************************
013701021202      * A.ALNEMER  * 2002/12/02   * RFS15022
013801021202      *            *              * -Recompile only.
013901030508      ******************************************************************
014001030327      * B.LU       * 2003/03/27   * RFS16256  Recompile.
014101030508      ******************************************************************
014201030327      * B.LU       * 2003/03/27   * RFS16633  Recompile.
014301000000      ******************************************************************
014401030623      * O.McMillan * 2003/06/17   * RFS17217  Recompile.
014501030623      ******************************************************************
014601030508      * Odette     * 2002/08/21   * RFS17165 - MFASTMEXP expanded from
014701030528      * McMillan   *              * 1100 to 1350. Change work areas as
014801030528      *            *              * well.
014901030508      ******************************************************************
015001030624      * Odette     * 2003/06/04   * RFS16881 - Recompile.
015101030624      * McMillan   *              *
015201030624      ******************************************************************
015301030821      * O.McMillan * 2003/08/21   * RFS18091  Add Section 17 (Account
015401030821      *            *              *           IPS Details).
015501030821      ******************************************************************
015601030825      * Odette     * 2003/08/25   * RFS17380  Recompile for additional
015701030825      * McMillan   *              * fields in Section 05 of CPYJSISTMT.
015801030825      ******************************************************************
015901031003      * Odette     * 2003/09/22   * RFS 18653 - Recompile.
016001031003      * McMillan   *              * Moved Section 17 rec counter field
016101031003      *            *              * in Section 99 to bottom of rec.
016201031003      ******************************************************************
016301031002      * B.LU       * 2003/10/02   * RFS17527  Recompile.
016401031002      ******************************************************************
016501031015      * ALI.A      * 2003/10/15   * RFS17626  Recompile.
016601031015      ******************************************************************
016701031020      * ALI.A      * 2003/10/20   * RFS18667  Recompile.
016801031020      ******************************************************************
016901031106      * ALI.A      * 2003/10/20   * RFS18312
017001031106      *            *              * Add two new counters for:
017101031106      *            *              * 1)Client-Held  Account.
017201031106      *            *              * 2)Nominee-Held Accounts.
017301031121      *            *              * 3)Client-English  Account.
017401031121      *            *              * 4)Client-English-Held  Account.
017501031121      *            *              * 5)Client-French Accounts.
017601031121      *            *              * 6)Client-French-Held Accounts.
017701031125      ******************************************************************
017801031125      * ALI.A      * 2003/11/21   * RFS18515  Recompile.
017901031125      ******************************************************************
018001031125      * ALI.A      * 2003/11/21   * RFS18814  Recompile.
018101031125      ******************************************************************
018201040217      * ALI.A      * 2004/02/17   * RFS19444  Recompile.
018301031119      ******************************************************************
018401040406      * ALI.A      * 2004/04/06   * RFS20870
018501040406      *            *              * Validate sections 33-38.
018601040406      ******************************************************************
018701040414      * ALI.A      * 2004/04/14   * RFS20758
018801040414      *            *              * RECOMPILE.
018901040414      ******************************************************************
019001040514      * Odette     *  2004/04/27  * RFS21714 - Recompile
019101040514      * Aguinaldo- *              * Add new fields to Section 10 to
019201040514      * McMillan   *              * indicate if Dealer, Rep or Nominee
019301040514      *            *              * is/isn't suppressed.
019401040531      ******************************************************************
019501040531      * Reece Tam  * 2004/05/31   * RFS20804  Recompile - CPYLADASTMT.
019601040514      ******************************************************************
019701040908      * B.LU       * 2004/09/08   * RFS18924 -RECOMPILE - CPYJSISTMT.
019801040908      ******************************************************************
019901041012      * B.LU       * 2004/10/12   * RFS22856 -RECOMPILE - CPYJSISTMT.
020001041012      ******************************************************************
020101041025      * ALI.A      * 2004/10/25   * RFS18780 -RECOMPILE - CPYJSISTMT.
020201041025      ******************************************************************
020301041028      * ALI.A      * 2004/10/28   * RFS21715 -RECOMPILE - CPYJSISTMT.
020401041028      ******************************************************************
020501041220      * B.LU       * 2004/12/20   * RFS24514 -RECOMPILE - CPYJSISTMT
020601041220      ******************************************************************
020701050429      * CHANDANA R * 2005/03/09   * RFS26213 -RECOMPILE - CPYJSISTMT
020801050429      ******************************************************************
020901051002      * ADE ADEYEMI* 2005/09/08   * RFS29550 -RECOMPILE - CPYJSISTMT
021001051002      ******************************************************************
021101051002      * ADE ADEYEMI* 2005/09/28   * RFS30065 -RECOMPILE - CPYJSISTMT
021201051002      ******************************************************************
021301050921      * Ali.A      * 2005/09/18   * RFS28931 -RECOMPILE - CPYJSISTMT
021401050920      ******************************************************************
021501050926      * C.LENTINI  * 2005/09/26   * RFS28692 -RECOMPILE - CPYJSISTMT
021601050926      ******************************************************************
021701050926      * GEETA S.   * 2005/09/15   * RFS 28107: RECOMPILE FOR CPYJSISTMT
021801050926      ******************************************************************
021901060628      * Esin A.    * 2006/03/23   * RFS 31514: RECOMPILE FOR CPYJSISTMT
022001060628      ******************************************************************
022101060628      * B.LU       * 2006/06/28   * RFS35042 -Process Section 21
022201060818      ******************************************************************
022301060818      * Raymond Mui* 2006/08/18   * RFS 34848: RECOMPILE FOR CPYJSISTMT
022401060821      *            *              *            and CPYLDASTMT.
022501060615      ******************************************************************
022601061026      * L. Wong    * 2006/10/24   * RFS36342 - Recompile - CPYJSISTMT,
022701061026      *            *              *                        CPYLDASTMT.
022801061026      *            *              * - Bug Fix: Do not display error for
022901061026      *            *              *   Section 99 (trailer record) since
023001061026      *            *              *   it is not an error.
023101061102      *            *              * - Bug Fix: Level 20 errors
023201061102      *            *              *   Table/array items not subscripted
023301080620      ******************************************************************
023401080620      * Bathuu L   * 2008/06/20   * RFS50993 -RECOMPILE - CPYJSISTMT
023501091111      ******************************************************************
023601091111      * Andy Lo    * 2009/11/11   * RFS69515 -RECOMPILE - CPYJSISTMT
023701091119      *            *              *           ADD SECTION 63
023801061026      ******************************************************************
023901100308      * A. Lo      * 2010/03/08   * RFS78161 -Recompile - CPYJSISTMT.
024001100308      ***************************************************************
024101100409      * A. Lo      * 2010/03/08   * RFS74626 -Recompile - CPYJSISTMT.
024201100308      ***************************************************************
024301120314      * A. CHAN    * 2012/03/14   * RFS93662 -Recompile - CPYJSISTMT.
024401120314      ***************************************************************
024501120706      * Bhanu      * 2012/07/06   * RFS103229-To Generate Dealer and
024601120706      *            *              * Rep Confirms using Investor
024701120706      *            *              * Hold mail Flags
024801121012      ***************************************************************
024901121012      * Andy Chan  * 2012/10/12   * RFS115141-Add Rep Address Check
025001121025      ******************************************************************
025101121025      * Suresh G.  * 2012/09/12   * RFS112003-Recompile for CPYJSISTMT.
025201130503      ***************************************************************
025301130408      * Andy Chan  * 2012/04/08   * RFS117038 Add Section 22
025401130503      ***************************************************************
025501130529      * NOBLE T    * 2013/05/29   * RFS121116-RECOMPILE - CPYLDASTMT.
025601130529      ***************************************************************
025701130611      * PRADEEP R  * 2013/05/13   * RFS118366-Incorrect total counts
025801130611      *            *              * are being reporting in the trailer
025901130611      *            *              * for statements
026001130611      ***************************************************************
026101130905      * PRAVEEN E  * 2013/09/05   *RFS123925 RECOMPIL ONLY - CPYJSISTMT.
026201140519      * NOBLE T    * 2014/05/02   * RFS130239 - RECOMPILE - CPYJSISTMT.
026301140418      ***************************************************************
026401140418      *SANGEETHA V  * 2014/03/25 * RFS129378 - RECOMPILE FOR CPYJSISTMT*
026501130905      ******************************************************************
026601140706      * Suresh G.   * 2014/07/05 * RFS132121 - RECOMPILE FOR CPYJSISTMT.
026701140706      ******************************************************************
026801140814      * Suresh G.   * 2014/08/14 * RFS133489 - RECOMPILE FOR CPYJSISTMT.
026901150216      * POOJA K    * 2015/02/16  * RFS 143392 - RECOMPILE FOR CPYJSISTMT
027001150330      * POOJA K    * 2015/03/27  * RFS 144030 - RECOMPILE FOR CPYJSISTMT
027101150424      * POOJA K    * 2015/04/21  * RFS 142884 - RECOMPILE FOR CPYJSISTMT
027201150511      * POOJA K    * 2015/05/08  * RFS 144587 - RECOMPILE FOR CPYJSISTMT
027202211019      * Surendran C* 2021/10/19   * RFS186592 -RECOMPILE FOR CPYJSISTMT*
027301140814      ******************************************************************
027401000000      /
027501000000       ENVIRONMENT DIVISION.
027601000000
027701000000      ******************************************************************
027801000000      *                                                                *
027901000000      *    E N V I R O N M E N T   D I V I S I O N                     *
028001000000      *                                                                *
028101000000      ******************************************************************
028201000000
028301000000       CONFIGURATION SECTION.
028401000000
028501000000      ******************************************************************
028601000000      *                                                                *
028701000000      *    C O N F I G U R A T I O N   S E C T I O N                   *
028801000000      *                                                                *
028901000000      ******************************************************************
029001000000
029101000000       SOURCE-COMPUTER.    AS-400.
029201000000       OBJECT-COMPUTER.    AS-400.
029301000000
029401000000       SPECIAL-NAMES.
029501000000
029601000000      *****
029701000000      *****    Special Names.
029801000000      *****
029901000000
030001000000           LOCAL-DATA          IS  WS-LOCAL.
030101000000      /
030201000000       INPUT-OUTPUT SECTION.
030301000000
030401000000      ******************************************************************
030501000000      *                                                                *
030601000000      *    I N P U T   /   O U T P U T   S E C T I O N                 *
030701000000      *                                                                *
030801000000      ******************************************************************
030901000000
031001000000       FILE-CONTROL.
031101000000
031201000000      *****
031301000000      *****    FILE CONTROL.
031401000000      *****
031501000000      /
031601000000      ******************************************************************
031701000000      *                                                                *
031801000000      *    MFASTMTFP:  Statement Data                                  *
031901000000      *                                                                *
032001000000      ******************************************************************
032101000000
032201000000           SELECT  STMT-DTA-FILE
032301980610                   ASSIGN          TO  DATABASE-MFASTMEXP
032401980610                   ACCESS          IS  SEQUENTIAL.
032501000000
032601000000      ******************************************************************
032701000000      *                                                                *
032801000000      *    STMENG:     Statements (Canadian English)                   *
032901000000      *                                                                *
033001000000      ******************************************************************
033101000000
033201000000           SELECT  STMT-ENG-FILE
033301000000                   ASSIGN          TO  DATABASE-STMENG.
033401000000
033501000000      ******************************************************************
033601000000      *                                                                *
033701000000      *    STMENGF:    Statements (Foreign English)                    *
033801000000      *                                                                *
033901000000      ******************************************************************
034001000000
034101000000           SELECT  STMT-ENGF-FILE
034201000000                   ASSIGN          TO  DATABASE-STMENGF.
034301000000
034401000000      ******************************************************************
034501000000      *                                                                *
034601000000      *    STMENGHLD:  Statements (Canadian English Hold Mail)         *
034701000000      *                                                                *
034801000000      ******************************************************************
034901000000
035001000000           SELECT  STMT-ENGHLD-FILE
035101000000                   ASSIGN          TO  DATABASE-STMENGHLD.
035201000000
035301000000      ******************************************************************
035401000000      *                                                                *
035501000000      *    STMENGHLDF: Statements (Foreign English Hold Mail)          *
035601000000      *                                                                *
035701000000      ******************************************************************
035801000000
035901000000           SELECT  STMT-ENGHLDF-FILE
036001000000                   ASSIGN          TO  DATABASE-STMENGHLDF.
036101000000
036201000000      ******************************************************************
036301000000      *                                                                *
036401000000      *    STMENGU:    Statements (American English)                   *
036501000000      *                                                                *
036601000000      ******************************************************************
036701000000
036801000000           SELECT  STMT-ENGU-FILE
036901000000                   ASSIGN          TO  DATABASE-STMENGU.
037001000000
037101000000      ******************************************************************
037201000000      *                                                                *
037301000000      *    STMENGHLDU: Statements (American English Hold Mail)         *
037401000000      *                                                                *
037501000000      ******************************************************************
037601000000
037701000000           SELECT  STMT-ENGHLDU-FILE
037801000000                   ASSIGN          TO  DATABASE-STMENGHLDU.
037901000000
038001000000      ******************************************************************
038101000000      *                                                                *
038201000000      *    STMFRN:     Statements (Canadian French)                    *
038301000000      *                                                                *
038401000000      ******************************************************************
038501000000
038601000000           SELECT  STMT-FRN-FILE
038701000000                   ASSIGN          TO  DATABASE-STMFRN.
038801000000
038901000000      ******************************************************************
039001000000      *                                                                *
039101000000      *    STMFRNF:    Statements (Foreign French)                     *
039201000000      *                                                                *
039301000000      ******************************************************************
039401000000
039501000000           SELECT  STMT-FRNF-FILE
039601000000                   ASSIGN          TO  DATABASE-STMFRNF.
039701000000
039801000000      ******************************************************************
039901000000      *                                                                *
040001000000      *    STMFRNHLD:  Statements (Canadian French Hold Mail)          *
040101000000      *                                                                *
040201000000      ******************************************************************
040301000000
040401000000           SELECT  STMT-FRNHLD-FILE
040501000000                   ASSIGN          TO  DATABASE-STMFRNHLD.
040601000000
040701000000      ******************************************************************
040801000000      *                                                                *
040901000000      *    STMFRNHLDF: Statements (Foreign French Hold Mail)           *
041001000000      *                                                                *
041101000000      ******************************************************************
041201000000
041301000000           SELECT  STMT-FRNHLDF-FILE
041401000000                   ASSIGN          TO  DATABASE-STMFRNHLDF.
041501000000
041601000000      ******************************************************************
041701000000      *                                                                *
041801000000      *    STMFRNU:    Statements (American French)                    *
041901000000      *                                                                *
042001000000      ******************************************************************
042101000000
042201000000           SELECT  STMT-FRNU-FILE
042301000000                   ASSIGN          TO  DATABASE-STMFRNU.
042401000000
042501000000      ******************************************************************
042601000000      *                                                                *
042701000000      *    STMFRNHLDU: Statements (American French Hold Mail)          *
042801000000      *                                                                *
042901000000      ******************************************************************
043001000000
043101000000           SELECT  STMT-FRNHLDU-FILE
043201000000                   ASSIGN          TO  DATABASE-STMFRNHLDU.
043301000000
043401000000      ******************************************************************
043501000000      *                                                                *
043601000000      *    QPRINT:     Control Report                                  *
043701000000      *                                                                *
043801000000      ******************************************************************
043901000000
044001000000           SELECT  PRINT-FILE
044101000000                   ASSIGN          TO  PRINTER-QPRINT.
044201120706
044301120706      * RFS 103229 - Start
044401120706      ***************************************************************
044501120706      *
044601120706      *   MFADEAP:  DEALER
044701120706      *
044801120706      ***************************************************************
044901120706           SELECT  DEALER
045001120706                   ASSIGN TO DATABASE-MFADEAP
045101120706                   ORGANIZATION IS INDEXED
045201120706                   ACCESS IS DYNAMIC
045301120706                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
045401120706      ***************************************************************
045501120706      *
045601120706      *   MFADEAREP:DEALER-REP
045701120706      *
045801120706      ***************************************************************
045901120706           SELECT  DEALER-REP
046001120706                   ASSIGN TO DATABASE-MFADEAREP
046101120706                   ORGANIZATION IS INDEXED
046201120706                   ACCESS IS DYNAMIC
046301120706                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
046401120706      ***************************************************************
046501120706      *
046601120706      *   MFAINSBRP:INSTITUTION-BRANCH
046701120706      *
046801120706      ***************************************************************
046901120706           SELECT  INSTITUTION-BRANCH
047001120706                   ASSIGN TO DATABASE-MFAINSBRP
047101120706                   ORGANIZATION IS INDEXED
047201120706                   ACCESS IS DYNAMIC
047301120706                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
047401120706      ***************************************************************
047501120706      *
047601120706      *   MFAINADDP:INSTITUTION-ADDRESS
047701120706      *
047801120706      ***************************************************************
047901120706           SELECT  INST-ADDRESS
048001120706                   ASSIGN TO DATABASE-MFAINADDP
048101120706                   ORGANIZATION IS INDEXED
048201120706                   ACCESS IS DYNAMIC
048301120706                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
048401120706      * RFS 103229 - End
048501121012      * RFS 115141 - Begin
048601121012      ***************************************************************
048701121012      *
048801121012      *   MFADRADRP:DEALER REP ADDRESS
048901121012      *
049001121012      ***************************************************************
049101121012           SELECT  REP-ADDRESS
049201121012                   ASSIGN TO DATABASE-MFADRADRP
049301121012                   ORGANIZATION IS INDEXED
049401121012                   ACCESS IS DYNAMIC
049501121012                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
049601121012      * RFS 115141 - End
049701000000      /
049801000000       DATA DIVISION.
049901000000
050001000000      ******************************************************************
050101000000      *                                                                *
050201000000      *    D A T A   D I V I S I O N                                   *
050301000000      *                                                                *
050401000000      ******************************************************************
050501000000
050601000000       FILE SECTION.
050701000000
050801000000      ******************************************************************
050901000000      *                                                                *
051001000000      *    F I L E   S E C T I O N                                     *
051101000000      *                                                                *
051201000000      ******************************************************************
051301000000      /
051401000000      ******************************************************************
051501000000      *                                                                *
051601000000      *    MFASTMTFP:  Statement Data                                  *
051701000000      *                                                                *
051801000000      ******************************************************************
051901000000
052001000000       FD  STMT-DTA-FILE
052101120706           LABEL RECORDS      ARE  OMITTED.
052201010307RF7503*01  STMT-DTA-REC                PICTURE X(850).
052301121004       01  STMT-DTA-REC                PICTURE X(1350).
052401120706
052501000000      /
052601000000      ******************************************************************
052701000000      *                                                                *
052801000000      *    STMENG:     Statements (Canadian English)                   *
052901000000      *                                                                *
053001000000      ******************************************************************
053101000000
053201000000       FD  STMT-ENG-FILE
053301000000           LABEL RECORDS      ARE  STANDARD
053401010307RF7503*    RECORD CONTAINS    850  CHARACTERS.
053501030528R17165     RECORD CONTAINS    1350 CHARACTERS.
053601010307RF7503*01  STMT-ENG-REC                PICTURE X(850).
053701030528R17165 01  STMT-ENG-REC                PICTURE X(1350).
053801000000      /
053901000000      ******************************************************************
054001000000      *                                                                *
054101000000      *    STMENGF:    Statements (Foreign English)                    *
054201000000      *                                                                *
054301000000      ******************************************************************
054401000000
054501000000       FD  STMT-ENGF-FILE
054601000000           LABEL RECORDS      ARE  STANDARD
054701010307RF7503*    RECORD CONTAINS    850  CHARACTERS.
054801030528R17165     RECORD CONTAINS    1350 CHARACTERS.
054901010307RF7503*01  STMT-ENGF-REC               PICTURE X(850).
055001030528R17165 01  STMT-ENGF-REC               PICTURE X(1350).
055101000000      /
055201000000      ******************************************************************
055301000000      *                                                                *
055401000000      *    STMENGHLD:  Statements (Canadian English Hold Mail)         *
055501000000      *                                                                *
055601000000      ******************************************************************
055701000000
055801000000       FD  STMT-ENGHLD-FILE
055901000000           LABEL RECORDS      ARE  STANDARD
056001010307      *    RECORD CONTAINS    850  CHARACTERS.
056101030528R17165     RECORD CONTAINS    1350 CHARACTERS.
056201000000
056301010307      *01  STMT-ENGHLD-REC            PICTURE X(850).
056401030528R17165 01  STMT-ENGHLD-REC            PICTURE X(1350).
056501000000      /
056601000000      ******************************************************************
056701000000      *                                                                *
056801000000      *    STMENGHLDF: Statements (Foreign English Hold Mail)          *
056901000000      *                                                                *
057001000000      ******************************************************************
057101000000
057201000000       FD  STMT-ENGHLDF-FILE
057301000000           LABEL RECORDS      ARE  STANDARD
057401010307      *    RECORD CONTAINS    850  CHARACTERS.
057501030528R17165     RECORD CONTAINS    1350 CHARACTERS.
057601000000
057701010307      *01  STMT-ENGHLDF-REC           PICTURE X(850).
057801030528R17165 01  STMT-ENGHLDF-REC           PICTURE X(1350).
057901000000      /
058001000000      ******************************************************************
058101000000      *                                                                *
058201000000      *    STMENGU:    Statements (American English)                   *
058301000000      *                                                                *
058401000000      ******************************************************************
058501000000
058601000000       FD  STMT-ENGU-FILE
058701000000           LABEL RECORDS      ARE  STANDARD
058801010307      *    RECORD CONTAINS    850  CHARACTERS.
058901030528R17165     RECORD CONTAINS    1350 CHARACTERS.
059001000000
059101010307      *01  STMT-ENGU-REC               PICTURE X(850).
059201030528R17165 01  STMT-ENGU-REC               PICTURE X(1350).
059301000000      /
059401000000      ******************************************************************
059501000000      *                                                                *
059601000000      *    STMENGHLDU: Statements (American English Hold Mail)         *
059701000000      *                                                                *
059801000000      ******************************************************************
059901000000
060001000000       FD  STMT-ENGHLDU-FILE
060101000000           LABEL RECORDS      ARE  STANDARD
060201010307      *    RECORD CONTAINS    850  CHARACTERS.
060301030528R17165     RECORD CONTAINS    1350 CHARACTERS.
060401000000
060501010307      *01  STMT-ENGHLDU-REC           PICTURE X(850).
060601030528R17165 01  STMT-ENGHLDU-REC           PICTURE X(1350).
060701000000      /
060801000000      ******************************************************************
060901000000      *                                                                *
061001000000      *    STMFRN:     Statements (Canadian French)                    *
061101000000      *                                                                *
061201000000      ******************************************************************
061301000000
061401000000       FD  STMT-FRN-FILE
061501000000           LABEL RECORDS      ARE  STANDARD
061601010307      *    RECORD CONTAINS    850  CHARACTERS.
061701030528R17165     RECORD CONTAINS    1350 CHARACTERS.
061801000000
061901010307      *01  STMT-FRN-REC                PICTURE X(850).
062001030528R17165 01  STMT-FRN-REC                PICTURE X(1350).
062101000000      /
062201000000      ******************************************************************
062301000000      *                                                                *
062401000000      *    STMFRNF:    Statements (Foreign French)                     *
062501000000      *                                                                *
062601000000      ******************************************************************
062701000000
062801000000       FD  STMT-FRNF-FILE
062901000000           LABEL RECORDS      ARE  STANDARD
063001010307      *    RECORD CONTAINS    850  CHARACTERS.
063101030528R17165     RECORD CONTAINS    1350 CHARACTERS.
063201000000
063301010307      *01  STMT-FRNF-REC               PICTURE X(850).
063401030528R17165 01  STMT-FRNF-REC               PICTURE X(1350).
063501000000      /
063601000000      ******************************************************************
063701000000      *                                                                *
063801000000      *    STMFRNHLD:  Statements (Canadian French Hold Mail)          *
063901000000      *                                                                *
064001000000      ******************************************************************
064101000000
064201000000       FD  STMT-FRNHLD-FILE
064301000000           LABEL RECORDS      ARE  STANDARD
064401010307      *    RECORD CONTAINS    850  CHARACTERS.
064501030528R17165     RECORD CONTAINS    1350 CHARACTERS.
064601000000
064701010307      *01  STMT-FRNHLD-REC            PICTURE X(850).
064801030528R17165 01  STMT-FRNHLD-REC            PICTURE X(1350).
064901000000      /
065001000000      ******************************************************************
065101000000      *                                                                *
065201000000      *    STMFRNHLDF: Statements (Foreign French Hold Mail)           *
065301000000      *                                                                *
065401000000      ******************************************************************
065501000000
065601000000       FD  STMT-FRNHLDF-FILE
065701000000           LABEL RECORDS      ARE  STANDARD
065801010307      *    RECORD CONTAINS    850  CHARACTERS.
065901030528R17165     RECORD CONTAINS    1350 CHARACTERS.
066001000000
066101010307      *01  STMT-FRNHLDF-REC           PICTURE X(850).
066201030528R17165 01  STMT-FRNHLDF-REC           PICTURE X(1350).
066301000000      /
066401000000      ******************************************************************
066501000000      *                                                                *
066601000000      *    STMFRNU:    Statements (American French)                    *
066701000000      *                                                                *
066801000000      ******************************************************************
066901000000
067001000000       FD  STMT-FRNU-FILE
067101000000           LABEL RECORDS      ARE  STANDARD
067201010307      *    RECORD CONTAINS    850  CHARACTERS.
067301030528R17165     RECORD CONTAINS    1350 CHARACTERS.
067401000000
067501010307      *01  STMT-FRNU-REC               PICTURE X(850).
067601030528R17165 01  STMT-FRNU-REC               PICTURE X(1350).
067701000000      /
067801000000      ******************************************************************
067901000000      *                                                                *
068001000000      *    STMFRNHLDU: Statements (American French Hold Mail)          *
068101000000      *                                                                *
068201000000      ******************************************************************
068301000000
068401000000       FD  STMT-FRNHLDU-FILE
068501000000           LABEL RECORDS      ARE  STANDARD
068601010307      *    RECORD CONTAINS    850  CHARACTERS.
068701030528R17165     RECORD CONTAINS    1350 CHARACTERS.
068801000000
068901010307      *01  STMT-FRNHLDU-REC           PICTURE X(850).
069001030528R17165 01  STMT-FRNHLDU-REC           PICTURE X(1350).
069101980602      /
069201000000      ******************************************************************
069301000000      *                                                                *
069401000000      *    QPRINT:     Control Report                                  *
069501000000      *                                                                *
069601000000      ******************************************************************
069701000000
069801000000       FD  PRINT-FILE
069901000000           LABEL RECORDS      ARE  OMITTED.
070001000000
070101000000       01  PRINT-REC                   PICTURE X(150).
070201120706      * RFS 103229 - Start
070301120706      ******************************************************************
070401120706      *     MFADEAP:    Dealer
070501120706      *****************************************************************
070601120706       FD DEALER
070701120706             LABEL RECORDS ARE STANDARD.
070801120706       01  DEALER-REC.               COPY DD-ALL-FORMATS OF MFADEAP.
070901120706      ****************************************************************
071001120706      *     MFADEAREP : Dealer-Rep
071101120706      ****************************************************************
071201120706       FD  DEALER-REP
071301120706             LABEL RECORDS ARE STANDARD.
071401120706       01  DEALER-REP-REC.      COPY DD-ALL-FORMATS OF MFADEAREP.
071501120706      ****************************************************************
071601120706      *     MFAINSBRP : Institution Branch
071701120706      ****************************************************************
071801120706       FD  INSTITUTION-BRANCH
071901120706             LABEL RECORDS ARE STANDARD.
072001120706       01  INSTITUTION-BRANCH-REC. COPY DD-ALL-FORMATS OF MFAINSBRP.
072101120706      ****************************************************************
072201120706      *     MFAINADDP : Institution Address
072301120706      ****************************************************************
072401120706       FD  INST-ADDRESS
072501120706             LABEL RECORDS ARE STANDARD.
072601120706       01  INST-ADDRESS-REC.
072701120706                                COPY DD-ALL-FORMATS OF MFAINADDP.
072801120706      * RFS 103229 - End
072901121012      * RFS 115141 - Begin
073001121012      ****************************************************************
073101121012      *     MFADRADRP : Rep Address
073201121012      ****************************************************************
073301121012       FD  REP-ADDRESS
073401121012             LABEL RECORDS ARE STANDARD.
073501121012       01  REP-ADDRESS-REC.
073601121012                                COPY DD-ALL-FORMATS OF MFADRADRP.
073701121012      * RFS 115141 - End
073801000000      /
073901000000       WORKING-STORAGE SECTION.
074001000000
074101000000      ******************************************************************
074201000000      *                                                                *
074301000000      *    W O R K I N G   S T O R A G E   S E C T I O N               *
074401000000      *                                                                *
074501000000      ******************************************************************
074601000000      /
074701971024       01  WS-LOCAL-DATA-AREA.         COPY CPYLDASTMT.
074801000000      /
074901000000                                       COPY CPYJSISTMT.
075001000000      /
075101121004114051 01  STMT-DTA-REC-X.
075201121004114051     COPY DD-ALL-FORMATS OF MFASTMEXP.
075301000000      ******************************************************************
075401000000      *                                                                *
075501000000      *    H E A D I N G   P R I N T   L I N E S                       *
075601000000      *                                                                *
075701000000      ******************************************************************
075801000000
075901000000       01  HEADING-LINE-1.
076001000000           05  FILLER                  PICTURE X(11)       VALUE
076101000000               "DATE     : ".
076201000000           03  HL1-YY                  PICTURE 9(2).
076301000000           03  FILLER                  PICTURE X(1)        VALUE "/".
076401000000           03  HL1-MM                  PICTURE 9(2).
076501000000           03  FILLER                  PICTURE X(1)        VALUE "/".
076601000000           03  HL1-DD                  PICTURE 9(2).
076701000000           03  FILLER                  PICTURE X(95)       VALUE SPACES.
076801000000           03  FILLER                  PICTURE X(6)        VALUE
076901000000               "TIME: ".
077001000000           03  HL1-TIME                PICTURE 99B99B99B99.
077101000000           03  HL1-TIME-R              REDEFINES HL1-TIME.
077201000000               05  FILLER              PICTURE X(8).
077301000000               05  HL1-TIME-DOT        PICTURE X(1).
077401000000               05  FILLER              PICTURE X(2).
077501000000           03  FILLER                  PICTURE X(19)       VALUE SPACES.
077601000000
077701000000       01  HEADING-LINE-2.
077801000000           03  FILLER                  PICTURE X(11)       VALUE
077901000000               "REPORT NO: ".
078001000000           03  FILLER                  PICTURE X(10)       VALUE
078101000000               "STMTCNV   ".
078201000000           03  FILLER                  PICTURE X(15)       VALUE SPACES.
078301000000           03  FILLER                  PICTURE X(35)       VALUE
078401000000               "STATEMENT CONVERSION CONTROL REPORT".
078501000000           03  FILLER                  PICTURE X(43)       VALUE SPACES.
078601000000           03  FILLER                  PICTURE X(5)        VALUE
078701000000               "PAGE:".
078801000000           03  FILLER                  PICTURE X(8)        VALUE SPACES.
078901000000           03  HL2-PGECNT              PICTURE ZZZZ9.
079001031120
079101031120R18312 01  HEADING-LINE-2-H.
079201031120           03  FILLER                  PICTURE X(20)       VALUE
079301031120               "Statement Type:     ".
079401031120           03  HL2H-STMT-TYPE          PICTURE X(10).
079501031120           03  FILLER                  PICTURE X(15)       VALUE SPACES.
079601031120           03  FILLER                  PICTURE X(35)       VALUE SPACES.
079701031120           03  FILLER                  PICTURE X(43)       VALUE SPACES.
079801031120           03  FILLER                  PICTURE X(5)        VALUE SPACES.
079901031120           03  FILLER                  PICTURE X(8)        VALUE SPACES.
080001000000
080101000000       01  HEADING-LINE-3.
080201000000           03  FILLER                  PICTURE X(3)        VALUE SPACES.
080301000000           03  FILLER                  PICTURE X(9)        VALUE
080401000000               "INVESTOR#".
080501000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
080601000000           03  FILLER                  PICTURE X(9)        VALUE
080701000000               "ACCOUNT  ".
080801000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
080901000000           03  FILLER                  PICTURE X(9)        VALUE
081001000000               "SECTION  ".
081101000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
081201000000           03  FILLER                  PICTURE X(3)        VALUE "LNG".
081301000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
081401000000           03  FILLER                  PICTURE X(6)        VALUE
081501000000               "DEALER".
081601000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
081701000000           03  FILLER                  PICTURE X(5)        VALUE
081801000000               "REP. ".
081901000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
082001000000           03  FILLER                  PICTURE X(50)       VALUE
082101000000               "MESSAGE                                           ".
082201000000           03  FILLER                  PICTURE X(50)       VALUE SPACES.
082301000000      /
082401000000      ******************************************************************
082501000000      *                                                                *
082601000000      *    E R R O R   P R I N T   L I N E S
082701000000      *                                                                *
082801000000      ******************************************************************
082901000000
083001000000       01  ERROR-LINE-1.
083101000000           03  FILLER                  PICTURE X(3).
083201000000           03  EL1-INVESTOR-NO         PICTURE 9(9).
083301000000           03  FILLER                  PICTURE X(1).
083401000000           03  EL1-ACCOUNT             PICTURE 9(9).
083501000000           03  FILLER                  PICTURE X(1).
083601000000           03  EL1-SECTION-NO          PICTURE 9(2).
083701000000           03  EL1-SECTION-LITDSH      PICTURE X(1).
083801000000           03  EL1-SECTION-SEQUENCE    PICTURE 9(6).
083901000000           03  FILLER                  PICTURE X(2).
084001000000           03  EL1-LANGUAGE-CODE       PICTURE X(1).
084101000000           03  FILLER                  PICTURE X(2).
084201000000           03  EL1-DEALER              PICTURE X(4).
084301000000           03  FILLER                  PICTURE X(3).
084401000222           03  EL1-DEALER-REP-CODE     PICTURE X(6).
084501000000           03  FILLER                  PICTURE X(1).
084601000000           03  EL1-MSG                 PICTURE X(50).
084701000000           03  FILLER                  PICTURE X(50).
084801000000      /
084901000000      ******************************************************************
085001000000      *                                                                *
085101000000      *    C O N T R O L   P R I N T   L I N E S                       *
085201000000      *                                                                *
085301000000      ******************************************************************
085401000000
085501000000       01  CONTROL-LINE-1.
085601000000           03  FILLER                  PICTURE X(3).
085701000000           03  CL1-LIT                 PICTURE X(50) JUST RIGHT.
085801000000           03  FILLER                  PICTURE X(1).
085901000000           03  CL1-VAL.
086001000000               05  FILLER              PICTURE X(8).
086101000000               05  CL1-CNT             PICTURE ZZZ,ZZZ,ZZ9.
086201000000               05  FILLER              PICTURE X(5).
086301000000           03  CL1-VAL-R1              REDEFINES CL1-VAL.
086401000000               05  FILLER              PICTURE X(1).
086501000000               05  CL1-CNT1            PICTURE ZZ,ZZZ,ZZZ,ZZZ,ZZ9.999.
086601000000               05  FILLER              PICTURE X(1).
086701000000           03  CL1-VAL-R2              REDEFINES CL1-VAL.
086801000000               05  FILLER              PICTURE X(8).
086901000000               05  CL1-CNT2            PICTURE ZZZ,ZZZ,ZZ9.9999.
087001000000           03  CL1-VAL-R3              REDEFINES CL1-VAL.
087101000000               05  CL1-CNT3            PICTURE ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.
087201000000               05  FILLER              PICTURE X(2).
087301000000           03  FILLER                  PICTURE X(72).
087401000000      /
087501000000       01  WS-PGM-DEFIND-WORK-ITEMS.
087601000000
087701000000      ******************************************************************
087801000000      *                                                                *
087901000000      *    P R O G R A M   D E F I N E D   W O R K   I T E M S         *
088001000000      *                                                                *
088101000000      ******************************************************************
088201000000
088301000000      *****
088401000000      *****    Control Report Counters.
088501000000      *****
088601000000
088701000000           03  WS-STMT-DTA-RCNT        PICTURE S9(9)       COMP-3.
088801000000           03  WS-STMT-DTA-RCNT-BV     PICTURE S9(15)V9(2) COMP-3.
088901000000           03  WS-STMT-DTA-RCNT-MV     PICTURE S9(15)V9(2) COMP-3.
089001000000           03  WS-STMT-DTA-RCNT-UB     PICTURE S9(14)V9(3) COMP-3.
089101000000           03  WS-STMT-DTA-RCNT-UN     PICTURE S9(14)V9(3) COMP-3.
089201000000           03  WS-STMT-DTA-RCNT-UP     PICTURE S9(9)V9(4)  COMP-3.
089301000000           03  WS-STMT-DTA-RCNT-00     PICTURE S9(9)       COMP-3.
089401000000           03  WS-STMT-DTA-RCNT-01     PICTURE S9(9)       COMP-3.
089501000000           03  WS-STMT-DTA-RCNT-05     PICTURE S9(9)       COMP-3.
089601000000           03  WS-STMT-DTA-RCNT-10     PICTURE S9(9)       COMP-3.
089701010307RF8633     03  WS-STMT-DTA-RCNT-12     PICTURE S9(9)       COMP-3.
089801000000           03  WS-STMT-DTA-RCNT-15     PICTURE S9(9)       COMP-3.
089901030821R18091     03  WS-STMT-DTA-RCNT-17     PICTURE S9(9)       COMP-3.
090001000000           03  WS-STMT-DTA-RCNT-20     PICTURE S9(9)       COMP-3.
090101060615R35042     03  WS-STMT-DTA-RCNT-21     PICTURE S9(9)       COMP-3.
090201130408117038     03  WS-STMT-DTA-RCNT-22     PICTURE S9(9)       COMP-3.
090301010321RF8633     03  WS-STMT-DTA-RCNT-25     PICTURE S9(9)       COMP-3.
090401000515RF7051     03  WS-STMT-DTA-RCNT-30     PICTURE S9(9)       COMP-3.
090501040406R20870     03  WS-STMT-DTA-RCNT-33     PICTURE S9(9)       COMP-3.
090601000515           03  WS-STMT-DTA-RCNT-35     PICTURE S9(9)       COMP-3.
090701040406R20870     03  WS-STMT-DTA-RCNT-38     PICTURE S9(9)       COMP-3.
090801010124RF8558     03  WS-STMT-DTA-RCNT-40     PICTURE S9(9)       COMP-3.
090901010307RF8558     03  WS-STMT-DTA-RCNT-43     PICTURE S9(9)       COMP-3.
091001010307RF8558     03  WS-STMT-DTA-RCNT-45     PICTURE S9(9)       COMP-3.
091101000000           03  WS-STMT-DTA-RCNT-50     PICTURE S9(9)       COMP-3.
091201000000           03  WS-STMT-DTA-RCNT-60     PICTURE S9(9)       COMP-3.
091301981218           03  WS-STMT-DTA-RCNT-62     PICTURE S9(9)       COMP-3.
091401091119R69515     03  WS-STMT-DTA-RCNT-63     PICTURE S9(9)       COMP-3.
091501980519           03  WS-STMT-DTA-RCNT-65     PICTURE S9(9)       COMP-3.
091601000515           03  WS-STMT-DTA-RCNT-67     PICTURE S9(9)       COMP-3.
091701971026           03  WS-STMT-DTA-RCNT-70     PICTURE S9(9)       COMP-3.
091801000000           03  WS-STMT-DTA-RCNT-80     PICTURE S9(9)       COMP-3.
091901000000           03  WS-STMT-DTA-RCNT-82     PICTURE S9(9)       COMP-3.
092001000515           03  WS-STMT-DTA-RCNT-84     PICTURE S9(9)       COMP-3.
092101010124RF8558     03  WS-STMT-DTA-RCNT-90     PICTURE S9(9)       COMP-3.
092201031106R18312     03  WS-STMT-DTA-RCNT-CLTHLD PICTURE S9(9)       COMP-3.
092301031106  ¦        03  WS-STMT-DTA-RCNT-NOMHLD PICTURE S9(9)       COMP-3.
092401031106  ¦        03  WS-STMT-DTA-RCNT-ENG    PICTURE S9(9)       COMP-3.
092501031106  ¦        03  WS-STMT-DTA-RCNT-ENGHLD PICTURE S9(9)       COMP-3.
092601031106  ¦        03  WS-STMT-DTA-RCNT-FRN    PICTURE S9(9)       COMP-3.
092701031124  ¦        03  WS-STMT-DTA-RCNT-FRNHLD PICTURE S9(9)       COMP-3.
092801031124R18312     03  WS-STMT-DTA-RCNT-ACCTOT PICTURE S9(9)       COMP-3.
092901000000
093001000000           03  WS-STMT-WRITE-TABLE.
093101000000             04  WS-STMT-WCNT-TYPS     OCCURS     3  TIMES
093201000000                                       INDEXED   BY  ST.
093301980609               05  WS-STMT-WCNT-ENTS   OCCURS     6  TIMES
093401000000                                       INDEXED   BY  SW.
093501000000                 06  WS-STMT-WCNT      PICTURE S9(9)       COMP-3.
093601000000                 06  WS-STMT-WCNT-BV   PICTURE S9(15)V9(2) COMP-3.
093701000000                 06  WS-STMT-WCNT-MV   PICTURE S9(15)V9(2) COMP-3.
093801000000                 06  WS-STMT-WCNT-UB   PICTURE S9(14)V9(3) COMP-3.
093901000000                 06  WS-STMT-WCNT-UN   PICTURE S9(14)V9(3) COMP-3.
094001000000                 06  WS-STMT-WCNT-UP   PICTURE S9(9)V9(4)  COMP-3.
094101000000                 06  WS-STMT-WCNT-00   PICTURE S9(9)       COMP-3.
094201000000                 06  WS-STMT-WCNT-01   PICTURE S9(9)       COMP-3.
094301000000                 06  WS-STMT-WCNT-05   PICTURE S9(9)       COMP-3.
094401000000                 06  WS-STMT-WCNT-10   PICTURE S9(9)       COMP-3.
094501010307RF8633           06  WS-STMT-WCNT-12   PICTURE S9(7)       COMP-3.
094601000000                 06  WS-STMT-WCNT-15   PICTURE S9(7)       COMP-3.
094701030821R18091           06  WS-STMT-WCNT-17   PICTURE S9(7)       COMP-3.
094801000000                 06  WS-STMT-WCNT-20   PICTURE S9(7)       COMP-3.
094901060615R35042           06  WS-STMT-WCNT-21   PICTURE S9(7)       COMP-3.
095001130408117038           06  WS-STMT-WCNT-22   PICTURE S9(7)       COMP-3.
095101010321RF8633           06  WS-STMT-WCNT-25   PICTURE S9(7)       COMP-3.
095201000515                 06  WS-STMT-WCNT-30   PICTURE S9(7)       COMP-3.
095301040406R20870           06  WS-STMT-WCNT-33   PICTURE S9(7)       COMP-3.
095401000515                 06  WS-STMT-WCNT-35   PICTURE S9(7)       COMP-3.
095501040406R20870           06  WS-STMT-WCNT-38   PICTURE S9(7)       COMP-3.
095601010125                 06  WS-STMT-WCNT-40   PICTURE S9(7)       COMP-3.
095701010125                 06  WS-STMT-WCNT-43   PICTURE S9(7)       COMP-3.
095801010125                 06  WS-STMT-WCNT-45   PICTURE S9(7)       COMP-3.
095901000000                 06  WS-STMT-WCNT-50   PICTURE S9(7)       COMP-3.
096001000000                 06  WS-STMT-WCNT-60   PICTURE S9(7)       COMP-3.
096101981218                 06  WS-STMT-WCNT-62   PICTURE S9(7)       COMP-3.
096201091119R69515           06  WS-STMT-WCNT-63   PICTURE S9(7)       COMP-3.
096301980519                 06  WS-STMT-WCNT-65   PICTURE S9(7)       COMP-3.
096401000515                 06  WS-STMT-WCNT-67   PICTURE S9(7)       COMP-3.
096501971026                 06  WS-STMT-WCNT-70   PICTURE S9(7)       COMP-3.
096601000000                 06  WS-STMT-WCNT-80   PICTURE S9(7)       COMP-3.
096701000000                 06  WS-STMT-WCNT-82   PICTURE S9(7)       COMP-3.
096801000515                 06  WS-STMT-WCNT-84   PICTURE S9(7)       COMP-3.
096901010125                 06  WS-STMT-WCNT-90   PICTURE S9(7)       COMP-3.
097001031106R18312           06  WS-STMT-WCNT-CLTHLD PICTURE S9(7)       COMP-3.
097101031106  ¦              06  WS-STMT-WCNT-NOMHLD PICTURE S9(7)       COMP-3.
097201031106  ¦              06  WS-STMT-WCNT-ENG    PICTURE S9(7)       COMP-3.
097301031106  ¦              06  WS-STMT-WCNT-ENGHLD PICTURE S9(7)       COMP-3.
097401031106  ¦              06  WS-STMT-WCNT-FRN    PICTURE S9(7)       COMP-3.
097501031124  ¦              06  WS-STMT-WCNT-FRNHLD PICTURE S9(7)       COMP-3.
097601031124R18312           06  WS-STMT-WCNT-ACCTOT PICTURE S9(7)       COMP-3.
097701000000
097801000000      *****
097901000000      *****    Control Report Literals.
098001000000      *****
098101000000
098201000000           03  WS-STMT-DTA-RLIT        PICTURE X(50)       VALUE
098301000000               "STATEMENT DATA RECS READ:                         ".
098401000000           03  WS-STMT-DTA-RLIT-BV     PICTURE X(50)       VALUE
098501000000               "STATEMENT DATA RECS BOOK VALUE:                   ".
098601000000           03  WS-STMT-DTA-RLIT-MV     PICTURE X(50)       VALUE
098701000000               "STATEMENT DATA RECS MARKET VALUE:                 ".
098801000000           03  WS-STMT-DTA-RLIT-UB     PICTURE X(50)       VALUE
098901000000               "STATEMENT DATA RECS UNIT BALANCE:                 ".
099001000000           03  WS-STMT-DTA-RLIT-UN     PICTURE X(50)       VALUE
099101000000               "STATEMENT DATA RECS NO OF UNITS:                  ".
099201000000           03  WS-STMT-DTA-RLIT-UP     PICTURE X(50)       VALUE
099301000000               "STATEMENT DATA RECS UNIT PRICE:                   ".
099401000000           03  WS-STMT-DTA-RLIT-00     PICTURE X(50)       VALUE
099501000000               "STATEMENT DATA (DELIVERY INFO) RECS:              ".
099601000000           03  WS-STMT-DTA-RLIT-01     PICTURE X(50)       VALUE
099701000000               "STATEMENT DATA (INVESTOR INFO) RECS:              ".
099801000000           03  WS-STMT-DTA-RLIT-05     PICTURE X(50)       VALUE
099901000000               "STATEMENT DATA (DEALER) RECS:                     ".
100001000000           03  WS-STMT-DTA-RLIT-10     PICTURE X(50)       VALUE
100101000000               "STATEMENT DATA (INVESTOR SUMMARY) RECS:           ".
100201010307RF8633     03  WS-STMT-DTA-RLIT-12     PICTURE X(50)       VALUE
100301010307               "STATEMENT DATA (INVESTOR SUMMARY SEC2) RECS:      ".
100401000000           03  WS-STMT-DTA-RLIT-15     PICTURE X(50)       VALUE
100501000000               "STATEMENT DATA (ASSET CLASS SUMMARY) RECS:        ".
100601030821R18091     03  WS-STMT-DTA-RLIT-17     PICTURE X(50)       VALUE
100701030821R18091         "STATEMENT DATA (ACCOUNT IPS DETAILS) RECS:        ".
100801000000           03  WS-STMT-DTA-RLIT-20     PICTURE X(50)       VALUE
100901000000               "STATEMENT DATA (ACCOUNT DETAIL) RECS:             ".
101001060615R35042     03  WS-STMT-DTA-RLIT-21     PICTURE X(50)       VALUE
101101060615R35042         "STATEMENT DATA (ACCOUNT ADDITIONAL INFO) RECS:    ".
101201130408117038     03  WS-STMT-DTA-RLIT-22     PICTURE X(50)       VALUE
101301130408117038         "STATEMENT DATA (ACCOUNT ADD DTL) RECS:            ".
101401010321RF8633     03  WS-STMT-DTA-RLIT-25     PICTURE X(50)       VALUE
101501010321               "STATEMENT DATA (ACCOUNT GIC DETAIL) RECS:         ".
101601000515RF7051     03  WS-STMT-DTA-RLIT-30     PICTURE X(50)       VALUE
101701000515               "STATEMENT DATA (ACCOUNT PERFORMANCE) RECS:        ".
101801040406R20870     03  WS-STMT-DTA-RLIT-33     PICTURE X(50)       VALUE
101901040406               "STATEMENT DATA (ACCOUNT ROR)         RECS:        ".
102001000515           03  WS-STMT-DTA-RLIT-35     PICTURE X(50)       VALUE
102101000515               "STATEMENT DATA (ACCOUNT FUND  PERFORMANCE) RECS:  ".
102201040406R20870     03  WS-STMT-DTA-RLIT-38     PICTURE X(50)       VALUE
102301040406               "STATEMENT DATA (ACCOUNT FUND  ROR)         RECS:  ".
102401010124RF8558     03  WS-STMT-DTA-RLIT-40     PICTURE X(50)       VALUE
102501010124               "STATEMENT DATA (SEG FUND CONTRACT DETAILS) RECS:  ".
102601010307RF8558     03  WS-STMT-DTA-RLIT-43     PICTURE X(50)       VALUE
102701010124               "STATEMENT DATA (SEG FUND CONTRACT INVDTL ) RECS:  ".
102801010307RF8558     03  WS-STMT-DTA-RLIT-45     PICTURE X(50)       VALUE
102901010124               "STATEMENT DATA (ANNUITANT DETAILS        ) RECS:  ".
103001000000           03  WS-STMT-DTA-RLIT-50     PICTURE X(50)       VALUE
103101000000               "STATEMENT DATA (ROLLOVER) RECS:                   ".
103201000000           03  WS-STMT-DTA-RLIT-60     PICTURE X(50)       VALUE
103301000000               "STATEMENT DATA (RRIF DETAIL) RECS:                ".
103401981218           03  WS-STMT-DTA-RLIT-62     PICTURE X(50)       VALUE
103501981218               "STATEMENT DATA (RESP DETAIL) RECS:                ".
103601091119R69515     03  WS-STMT-DTA-RLIT-63     PICTURE X(50)       VALUE
103701091119R69515         "STATEMENT DATA (RDSP ACCOUNT) RECS:               ".
103801980519           03  WS-STMT-DTA-RLIT-65     PICTURE X(50)       VALUE
103901980519               "STATEMENT DATA (GROUP      ) RECS:                ".
104001000515           03  WS-STMT-DTA-RLIT-67     PICTURE X(50)       VALUE
104101000515               "STATEMENT DATA (BENEFICIARY INFORMATION) RECS:    ".
104201971026           03  WS-STMT-DTA-RLIT-70     PICTURE X(50)       VALUE
104301971026               "STATEMENT DATA (SYSTEMATIC PLAN INFO) RECS:       ".
104401000000           03  WS-STMT-DTA-RLIT-80     PICTURE X(50)       VALUE
104501000000               "STATEMENT DATA (ACCOUNT TRANSACTION) RECS:        ".
104601000000           03  WS-STMT-DTA-RLIT-82     PICTURE X(50)       VALUE
104701000000               "STATEMENT DATA (INSTITUTION DETAIL) RECS:         ".
104801000515           03  WS-STMT-DTA-RLIT-84     PICTURE X(50)       VALUE
104901000515               "STATEMENT DATA (TRANS RESP DETAIL) RECS:          ".
105001010124RF8558     03  WS-STMT-DTA-RLIT-90     PICTURE X(50)       VALUE
105101010124               "STATEMENT DATA (RESET CONTRACT DETAILS   ) RECS:  ".
105201031106R18312     03  WS-STMT-DTA-RLIT-CLTHLD PICTURE X(50)       VALUE
105301031106  ¦            "STATEMENT DATA (CLIENT HELD) RECS:                ".
105401031106  ¦        03  WS-STMT-DTA-RLIT-NOMHLD PICTURE X(50)       VALUE
105501031106  ¦            "STATEMENT DATA (NOMINEE HELD) RECS:               ".
105601031106  ¦        03  WS-STMT-DTA-RLIT-ENG     PICTURE X(50)       VALUE
105701031106  ¦            "STATEMENT DATA (ENGLISH STMT) RECS:               ".
105801031106  ¦        03  WS-STMT-DTA-RLIT-ENGHLD PICTURE X(50)       VALUE
105901031106  ¦            "STATEMENT DATA (ENGLISH STMT HELD) RECS:          ".
106001031106  ¦        03  WS-STMT-DTA-RLIT-FRN     PICTURE X(50)       VALUE
106101031106  ¦            "STATEMENT DATA (FRENCH STMT) RECS:                ".
106201031106  ¦        03  WS-STMT-DTA-RLIT-FRNHLD PICTURE X(50)       VALUE
106301031124  ¦            "STATEMENT DATA (FRENCH STMT HELD) RECS:           ".
106401031124  ¦        03  WS-STMT-DTA-RLIT-ACCTOT PICTURE X(50)       VALUE
106501031124R18312         "STATEMENT DATA (STATEMENT TOTALS) RECS:           ".
106601000000
106701000000           03  WS-STMT-HLIT-TABLE.
106801000000               05  FILLER              PICTURE X(32)       VALUE
106901000000                   "CANADIAN ENGLISH STATEMENTS     ".
107001000000               05  FILLER              PICTURE X(32)       VALUE
107101000000                   "CANADIAN ENGLISH HOLD STATEMENTS".
107201980609               05  FILLER              PICTURE X(32)       VALUE
107301980609                   "CANADIAN ENGLISH ICS STATEMENTS ".
107401000000               05  FILLER              PICTURE X(32)       VALUE
107501000000                   "CANADIAN FRENCH STATEMENTS      ".
107601000000               05  FILLER              PICTURE X(32)       VALUE
107701000000                   "CANADIAN FRENCH HOLD STATEMENTS ".
107801000000               05  FILLER              PICTURE X(32)       VALUE
107901980609                   "CANADIAN FRENCH ICS STATEMENTS  ".
108001980609               05  FILLER              PICTURE X(32)       VALUE
108101000000                   "AMERICAN ENGLISH STATEMENTS     ".
108201000000               05  FILLER              PICTURE X(32)       VALUE
108301000000                   "AMERICAN ENGLISH HOLD STATEMENTS".
108401980609               05  FILLER              PICTURE X(32)       VALUE
108501980609                   "AMERICAN ENGLISH ICS STATEMENTS ".
108601000000               05  FILLER              PICTURE X(32)       VALUE
108701000000                   "AMERICAN FRENCH STATEMENTS      ".
108801000000               05  FILLER              PICTURE X(32)       VALUE
108901000000                   "AMERICAN FRENCH HOLD STATEMENTS ".
109001980609               05  FILLER              PICTURE X(32)       VALUE
109101980609                   "AMERICAN FRENCH ICS STATEMENTS  ".
109201000000               05  FILLER              PICTURE X(32)       VALUE
109301000000                   "FOREIGN ENGLISH STATEMENTS      ".
109401000000               05  FILLER              PICTURE X(32)       VALUE
109501000000                   "FOREIGN ENGLISH HOLD STATEMENTS ".
109601980609               05  FILLER              PICTURE X(32)       VALUE
109701980609                   "FOREIGN ENGLISH ICS STATEMENTS  ".
109801000000               05  FILLER              PICTURE X(32)       VALUE
109901000000                   "FOREIGN FRENCH STATEMENTS       ".
110001000000               05  FILLER              PICTURE X(32)       VALUE
110101000000                   "FOREIGN FRENCH HOLD STATEMENTS  ".
110201980609               05  FILLER              PICTURE X(32)       VALUE
110301980609                   "FOREIGN FRENCH ICS STATEMENTS   ".
110401000000           03  WS-STMT-HLIT-TABLE-R    REDEFINES WS-STMT-HLIT-TABLE.
110501000000             04  WS-STMT-HTYP          OCCURS     3  TIMES
110601000000                                       INDEXED   BY  SH.
110701980609               05  WS-STMT-HLIT        OCCURS     6  TIMES
110801000000                                       INDEXED   BY  SL
110901000000                                       PICTURE X(32).
111001000000
111101000000           03  WS-STMT-WLIT            PICTURE X(50)       VALUE
111201000000               "STATEMENT DATA RECS WRITTEN:                      ".
111301000000           03  WS-STMT-WLIT-BV         PICTURE X(50)       VALUE
111401000000               "STATEMENT DATA RECS BOOK VALUE:                   ".
111501000000           03  WS-STMT-WLIT-MV         PICTURE X(50)       VALUE
111601000000               "STATEMENT DATA RECS MARKET VALUE:                 ".
111701000000           03  WS-STMT-WLIT-UB         PICTURE X(50)       VALUE
111801000000               "STATEMENT DATA RECS UNIT BALANCE:                 ".
111901000000           03  WS-STMT-WLIT-UN         PICTURE X(50)       VALUE
112001000000               "STATEMENT DATA RECS NO OF UNITS:                  ".
112101000000           03  WS-STMT-WLIT-UP         PICTURE X(50)       VALUE
112201000000               "STATEMENT DATA RECS UNIT PRICE:                   ".
112301000000           03  WS-STMT-WLIT-00         PICTURE X(50)       VALUE
112401000000               "STATEMENT DATA (DELIVERY INFO) RECS:              ".
112501000000           03  WS-STMT-WLIT-01         PICTURE X(50)       VALUE
112601000000               "STATEMENT DATA (INVESTOR INFO) RECS:              ".
112701000000           03  WS-STMT-WLIT-05         PICTURE X(50)       VALUE
112801000000               "STATEMENT DATA (DEALER) RECS:                     ".
112901000000           03  WS-STMT-WLIT-10         PICTURE X(50)       VALUE
113001000000               "STATEMENT DATA (INVESTOR SUMMARY) RECS:           ".
113101010307RF8633     03  WS-STMT-WLIT-12         PICTURE X(50)       VALUE
113201010307               "STATEMENT DATA (INVESTOR SUMMARY SEC2) RECS:      ".
113301000000           03  WS-STMT-WLIT-15         PICTURE X(50)       VALUE
113401000000               "STATEMENT DATA (ASSET CLASS SUMMARY) RECS:        ".
113501030821R18091     03  WS-STMT-WLIT-17         PICTURE X(50)       VALUE
113601030821R18091         "STATEMENT DATA (ACCOUNT IPS DETAILS) RECS:        ".
113701000000           03  WS-STMT-WLIT-20         PICTURE X(50)       VALUE
113801000000               "STATEMENT DATA (ACCOUNT DETAIL) RECS:             ".
113901060615R35042     03  WS-STMT-WLIT-21         PICTURE X(50)       VALUE
114001060623R35042         "STATEMENT DATA (ACCOUNT ADDITIONAL INFO) RECS:    ".
114101130408117038     03  WS-STMT-WLIT-22         PICTURE X(50)       VALUE
114201130408117038         "STATEMENT DATA (ACCT ADD DTL) RECS:               ".
114301010321RF8633     03  WS-STMT-WLIT-25         PICTURE X(50)       VALUE
114401010321               "STATEMENT DATA (ACCOUNT GIC DETAIL) RECS:         ".
114501000515RF7051     03  WS-STMT-WLIT-30         PICTURE X(50)       VALUE
114601000515               "STATEMENT DATA (ACCOUNT PERFORMANCE) RECS:        ".
114701040406R20870     03  WS-STMT-WLIT-33         PICTURE X(50)       VALUE
114801040406               "STATEMENT DATA (ACCOUNT ROR)         RECS:        ".
114901000515           03  WS-STMT-WLIT-35         PICTURE X(50)       VALUE
115001000515               "STATEMENT DATA (ACCOUNT FUND PERFORMANCE) RECS    ".
115101040406R20870     03  WS-STMT-WLIT-38         PICTURE X(50)       VALUE
115201040406               "STATEMENT DATA (ACCOUNT FUND ROR)         RECS    ".
115301010124RF8558     03  WS-STMT-WLIT-40         PICTURE X(50)       VALUE
115401010124               "STATEMENT DATA (SEG FUND CONTRACT DETAILS) RECS:  ".
115501010307RF8558     03  WS-STMT-WLIT-43         PICTURE X(50)       VALUE
115601010124               "STATEMENT DATA (SEG FUND CONTRACT INVDTL ) RECS:  ".
115701010307RF8558     03  WS-STMT-WLIT-45         PICTURE X(50)       VALUE
115801010124               "STATEMENT DATA (ANNUITANT DETAILS        ) RECS:  ".
115901000000           03  WS-STMT-WLIT-50         PICTURE X(50)       VALUE
116001000000               "STATEMENT DATA (ROLLOVER) RECS:                   ".
116101000000           03  WS-STMT-WLIT-60         PICTURE X(50)       VALUE
116201000000               "STATEMENT DATA (RRIF DETAIL) RECS:                ".
116301981218           03  WS-STMT-WLIT-62         PICTURE X(50)       VALUE
116401981218               "STATEMENT DATA (RESP DETAIL) RECS:                ".
116501091119R69515     03  WS-STMT-WLIT-63         PICTURE X(50)       VALUE
116601091119R69515         "STATEMENT DATA (RDSP ACCOUNT) RECS:               ".
116701980519           03  WS-STMT-WLIT-65         PICTURE X(50)       VALUE
116801980519               "STATEMENT DATA (GROUP INFORMATION   ) RECS:       ".
116901000515           03  WS-STMT-WLIT-67         PICTURE X(50)       VALUE
117001000515               "STATEMENT DATA (BENEFICIARY INFORMATION ) RECS:   ".
117101971026           03  WS-STMT-WLIT-70         PICTURE X(50)       VALUE
117201971026               "STATEMENT DATA (SYSTEMATIC PLAN INFO) RECS:       ".
117301000000           03  WS-STMT-WLIT-80         PICTURE X(50)       VALUE
117401000000               "STATEMENT DATA (ACCOUNT TRANSACTION) RECS:        ".
117501000000           03  WS-STMT-WLIT-82         PICTURE X(50)       VALUE
117601000000               "STATEMENT DATA (INSTITUTION DETAIL) RECS:         ".
117701000515           03  WS-STMT-WLIT-84         PICTURE X(50)       VALUE
117801000515               "STATEMENT DATA (TRANS RESP DETAIL) RECS:          ".
117901010124RF8558     03  WS-STMT-WLIT-90         PICTURE X(50)       VALUE
118001010124               "STATEMENT DATA (RESET CONTRACT DETAILS   ) RECS:  ".
118101031106R18312     03  WS-STMT-WLIT-CLTHLD PICTURE X(50)       VALUE
118201031106  ¦            "STATEMENT DATA (CLIENT HELD) RECS:                ".
118301031106  ¦        03  WS-STMT-WLIT-NOMHLD PICTURE X(50)       VALUE
118401031106  ¦            "STATEMENT DATA (NOMINEE HELD) RECS:               ".
118501031106  ¦        03  WS-STMT-WLIT-ENG     PICTURE X(50)       VALUE
118601031106  ¦            "STATEMENT DATA (ENGLISH STMT) RECS:               ".
118701031106  ¦        03  WS-STMT-WLIT-ENGHLD PICTURE X(50)       VALUE
118801031106  ¦            "STATEMENT DATA (ENGLISH STMT HELD) RECS:          ".
118901031106  ¦        03  WS-STMT-WLIT-FRN     PICTURE X(50)       VALUE
119001031106  ¦            "STATEMENT DATA (FRENCH  STMT) RECS:               ".
119101031106  ¦        03  WS-STMT-WLIT-FRNHLD PICTURE X(50)       VALUE
119201031124  ¦            "STATEMENT DATA (FRENCH  STMT HELD) RECS:          ".
119301031124  ¦        03  WS-STMT-WLIT-ACCTOT PICTURE X(50)       VALUE
119401031124R18312         "STATEMENT DATA (ACCOUNT TOTALS) RECS:             ".
119501000000
119601000000      *****
119701000000      *****    Index/Subscript Related Items.
119801000000      *****
119901000000
120001000000           03  WS-ST-MAX               PICTURE S9(3)       COMP-3.
120101000000           03  WS-SW-MAX               PICTURE S9(3)       COMP-3.
120201000000
120301000000      *****
120401000000      *****    Non-Numeric Items.
120501000000      *****
120601000000
120701000000           03  WS-DATE.
120801000000               05  WS-DATE-YY          PICTURE 9(2).
120901000000               05  WS-DATE-MM          PICTURE 9(2).
121001000000               05  WS-DATE-DD          PICTURE 9(2).
121101000000
121201000000      *****
121301000000      *****    Numeric Items.
121401000000      *****
121501000000
121601000000           03  WS-LNECNT               PICTURE S9(3)       COMP-3.
121701000000           03  WS-LNEMAX               PICTURE S9(3)       COMP-3.
121801000000           03  WS-PGECNT               PICTURE S9(5)       COMP-3.
121901000000
122001000000      *****
122101000000      *****    Switches.
122201000000      *****
122301000000
122401000000           03  WS-EOJHDG-SW            PICTURE X(1).
122501000000      /
122601000000      ******************************************************************
122701000000      *                                                                *
122801000000      *    C U R R E N T   /   P R E V I O U S   C O N T R O L S       *
122901000000      *                                                                *
123001000000      ******************************************************************
123101000000
123201000000       01  CURR-CONTROLS.
123301000000           03  CURR-LEVEL1.
123401000000               05  CURR-INVESTOR-NO    PICTURE 9(9).
123501980128               05  CURR-START-DATE     PICTURE 9(08).
123601980128               05  CURR-END-DATE       PICTURE 9(08).
123701980128
123801000000       01  PREV-CONTROLS.
123901000000           03  PREV-LEVEL1.
124001000000               05  PREV-INVESTOR-NO    PICTURE 9(9).
124101980128               05  PREV-START-DATE     PICTURE 9(08).
124201980128               05  PREV-END-DATE       PICTURE 9(08).
124301000000      /
124401120706103229 01  lc-DealerHoldMail           PIC X(1).
124501120706103229 01  lc-RepHoldmail              PIC X(1).
124601120706
124701000000       PROCEDURE DIVISION.
124801000000
124901000000      ******************************************************************
125001000000      *                                                                *
125101000000      *    P R O C E D U R E   D I V I S I O N                         *
125201000000      *                                                                *
125301000000      ******************************************************************
125401000000      /
125501000000       MAINLINE.
125601000000
125701000000      ******************************************************************
125801000000      *                                                                *
125901000000      *    M A I N L I N E                                             *
126001000000      *                                                                *
126101000000      ******************************************************************
126201000000
126301000000           PERFORM INITIAL-LOGIC-RTN  THRU ILR-EXIT.
126401000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
126501000000               GO TO MLR-0040.
126601000000
126701000000       MLR-0010.
126801000000           PERFORM GET-CURRENT-RECORD THRU GCR-EXIT.
126901000000           IF  PREV-LEVEL1    IS EQUAL TO  CURR-LEVEL1
127001000000               GO TO MLR-0030.
127101000000
127201000000           IF  PREV-CONTROLS  IS EQUAL TO  LOW-VALUES
127301000000               GO TO MLR-0020.
127401000000
127501000000           PERFORM LEVEL-SUMMARY-1    THRU LS1-EXIT.
127601000000
127701000000       MLR-0020.
127801000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
127901000000               GO TO MLR-0040.
128001000000
128101000000           PERFORM LEVEL-REINIT-1     THRU LR1-EXIT.
128201000000
128301000000       MLR-0030.
128401000000           PERFORM DETAIL-PROCESS-RTN THRU DPR-EXIT.
128501000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
128601000000               GO TO MLR-0040.
128701000000
128801000000           MOVE CURR-CONTROLS          TO  PREV-CONTROLS.
128901000000           GO TO MLR-0010.
129001000000
129101000000       MLR-0040.
129201000000           PERFORM END-JOB-RTN        THRU EJR-EXIT.
129301000000           STOP RUN.
129401000000      /
129501000000       GET-CURRENT-RECORD.
129601000000
129701000000      ******************************************************************
129801000000      *                                                                *
129901000000      *    G E T   C U R R E N T   R E C O R D   R O U T I N E         *
130001000000      *                                                                *
130101000000      ******************************************************************
130201000000
130301000000      *****
130401000000      *****    Read through the Statement Data records.
130501000000      *****
130601000000
130701980610           READ STMT-DTA-FILE          AT  END
130801000000               MOVE HIGH-VALUES        TO  CURR-CONTROLS
130901000000               GO TO GCR-EXIT.
131001000000
131101000000           MOVE STMT-DTA-REC           TO  MFASTMTFP-SECTION.
131201121004114051     MOVE STMT-DTA-REC           TO  MFASTMEXP.
131301000000           ADD 1                       TO  WS-STMT-DTA-RCNT.
131401000000
131501000000      *****
131601000000      *****    Format the current controls.
131701000000      *****
131801980128           MOVE PR-START-DATE          TO  CURR-START-DATE.
131901980128           MOVE PR-END-DATE            TO  CURR-END-DATE.
132001000000           MOVE PR-INVESTOR-NO         TO  CURR-INVESTOR-NO.
132101120706      * RFS 103229 - Start
132201121004114051     IF  STMEX-INVESTOR-NO OF  MFASTMEXP     NOT = ZEROS
132301120824
132401120824             MOVE 'Y'    TO  lc-DealerHoldMail, lc-RepHoldMail
132501120824
132601120730             IF (WS-LDA-CPYSELECT = 'R')
132701121004114051       MOVE   STMEX-DEALER-CODE OF   MFASTMEXP     TO
132801120706                     DEALER-CODE OF  DEALER-REP
132901121004114051       MOVE   STMEX-DEALER-REP-CODE OF   MFASTMEXP     TO
133001120706                     DEALER-REP-CODE  OF  DEALER-REP
133101120718             READ  DEALER-REP
133201120718                   INVALID KEY
133301121004114051*      MOVE HIGH-VALUES TO CURR-CONTROLS
133401120718             GO TO GCR-EXIT
133501120718                   NOT INVALID KEY
133601120718             MOVE BRANCH-CODE OF DEALER-REP  TO
133701120718                   BRANCH-CODE OF INSTITUTION-BRANCH-REC
133801121012115141       IF ADDR-NO OF DEALER-REP = 0
133901121012115141          MOVE 'X' TO HOLD-MAIL OF REP-ADDRESS
134001121012115141        ELSE
134101121012115141          MOVE ADDR-NO OF DEALER-REP TO
134201121012115141               ADDR-NO OF REP-ADDRESS-REC
134301121012115141          READ  REP-ADDRESS
134401121012115141                INVALID KEY
134501121012115141                MOVE 'X' TO HOLD-MAIL OF REP-ADDRESS
134601121012115141          END-READ
134701121012115141       END-IF
134801120718             END-READ
134901120718             END-IF
135001120706
135101120730             IF (WS-LDA-CPYSELECT = 'D' OR 'R' )
135201121004114051       MOVE    STMEX-DEALER-CODE OF   MFASTMEXP     TO
135301120706                      DEALER-CODE OF  DEALER
135401120718             READ  DEALER
135501120718                   INVALID KEY
135601121004114051*      MOVE HIGH-VALUES TO CURR-CONTROLS
135701120718             GO TO GCR-EXIT
135801120718                   NOT INVALID KEY
135901120718             MOVE  INSTITUTION-CODE    OF DEALER-REC TO
136001120718             INSTITUTION-CODE  OF INSTITUTION-BRANCH-REC
136101120718             END-READ
136201120718             END-IF
136301120706
136401120730             IF (WS-LDA-CPYSELECT = 'D')
136501120718              MOVE BRANCH-CODE OF DEALER-REC TO
136601120706                  BRANCH-CODE OF INSTITUTION-BRANCH-REC
136701120718             END-IF
136801120718
136901120730             IF (WS-LDA-CPYSELECT = 'D' OR 'R' )
137001120718             READ INSTITUTION-BRANCH
137101120718                   INVALID KEY
137201121004114051*      MOVE HIGH-VALUES TO CURR-CONTROLS
137301120718             GO TO GCR-EXIT
137401120718                   NOT INVALID KEY
137501120718             MOVE ADDR-NO  OF INSTITUTION-BRANCH-REC  TO
137601120706                 ADDR-NO OF INST-ADDRESS-REC
137701120718             END-READ
137801120718             END-IF
137901120706
138001120730             IF (WS-LDA-CPYSELECT = 'D' OR 'R' )
138101120718             READ INST-ADDRESS
138201120706                    INVALID KEY
138301121004114051*      MOVE HIGH-VALUES TO CURR-CONTROLS
138401120718             GO TO GCR-EXIT
138501120718                   NOT INVALID KEY
138601120718             CONTINUE
138701120718             END-IF
138801120706
138901120730             IF (WS-LDA-CPYSELECT = 'D' )
139001120706             MOVE  HOLD-MAIL    OF INST-ADDRESS-REC TO
139101120706                   lc-DealerHoldMail
139201120718             END-IF
139301120706
139401120730             IF (WS-LDA-CPYSELECT = 'R' )
139501121012115141       IF HOLD-MAIL OF REP-ADDRESS = 'X'
139601120706             MOVE  HOLD-MAIL    OF INST-ADDRESS-REC TO
139701120706                   lc-RepHoldMail
139801121012115141       ELSE
139901121012115141       MOVE  HOLD-MAIL    OF REP-ADDRESS-REC TO
140001121012                   lc-RepHoldMail
140101121012115141       END-IF
140201120718             END-IF
140301120718           END-IF.
140401120706      * RFS 103229 - END
140501000000       GCR-EXIT.
140601000000           EXIT.
140701000000      /
140801000000       DETAIL-PROCESS-RTN.
140901000000
141001000000      ******************************************************************
141101000000      *                                                                *
141201000000      *    D E T A I L   P R O C E S S   R O U T I N E                 *
141301000000      *                                                                *
141401000000      ******************************************************************
141501000000
141601000000      *****
141701000000      *****    Process the Statement Data record depending on the
141801000000      *****    section number.  If it cannot be identified, an error
141901000000      *****    message will be printed and the record bypassed.
142001000000      *****
142101000000
142201000000           IF  PR-SECTION-NO  IS EQUAL TO  "00"
142301000000               GO TO DPR-0010.
142401000000
142501000000           IF  PR-SECTION-NO  IS EQUAL TO  "01"
142601000000               GO TO DPR-0020.
142701000000
142801000000           IF  PR-SECTION-NO  IS EQUAL TO  "05"
142901000000               GO TO DPR-0030.
143001000000
143101000000           IF  PR-SECTION-NO  IS EQUAL TO  "10"
143201000000               GO TO DPR-0040.
143301000000
143401010307RF8633     IF  PR-SECTION-NO  IS EQUAL TO  "12"
143501010307               GO TO DPR-0045.
143601010307
143701000000           IF  PR-SECTION-NO  IS EQUAL TO  "15"
143801000000               GO TO DPR-0050.
143901000000
144001030821R18091     IF  PR-SECTION-NO  IS EQUAL TO  "17"
144101030821R18091         GO TO DPR-0055.
144201030821
144301000000           IF  PR-SECTION-NO  IS EQUAL TO  "20"
144401000000               GO TO DPR-0060.
144501000000
144601060615R35042     IF  PR-SECTION-NO  IS EQUAL TO  "21"
144701060615R35042         GO TO DPR-0060-10.
144801060615
144901010321RF8633     IF  PR-SECTION-NO  IS EQUAL TO  "25"
145001010321               GO TO DPR-0060-20.
145101010321
145201130408117038     IF  PR-SECTION-NO  IS EQUAL TO  "22"
145301130408117038         GO TO DPR-0060-22.
145401130408
145501000515RF7051     IF  PR-SECTION-NO  IS EQUAL TO  "30"
145601000515               GO TO DPR-0060-30.
145701000515
145801040406R20870     IF  PR-SECTION-NO  IS EQUAL TO  "33"
145901040406               GO TO DPR-0060-33.
146001040406
146101000515           IF  PR-SECTION-NO  IS EQUAL TO  "35"
146201000515RF7051         GO TO DPR-0060-35.
146301000515
146401040406R20870     IF  PR-SECTION-NO  IS EQUAL TO  "38"
146501040406               GO TO DPR-0060-38.
146601040406
146701010124RF8558     IF  PR-SECTION-NO  IS EQUAL TO  "40"
146801010124               GO TO DPR-0060-40.
146901010124
147001010124           IF  PR-SECTION-NO  IS EQUAL TO  "43"
147101010124               GO TO DPR-0060-43.
147201010124
147301010124           IF  PR-SECTION-NO  IS EQUAL TO  "45"
147401010124RF8558         GO TO DPR-0060-45.
147501010124
147601000000           IF  PR-SECTION-NO  IS EQUAL TO  "50"
147701000000               GO TO DPR-0070.
147801000000
147901000000           IF  PR-SECTION-NO  IS EQUAL TO  "60"
148001000000               GO TO DPR-0080.
148101971026
148201981218           IF  PR-SECTION-NO  IS EQUAL TO  "62"
148301981218               GO TO DPR-0080-0000.
148401981218
148501091119R69515     IF  PR-SECTION-NO  IS EQUAL TO  "63"
148601091119R69515         GO TO DPR-0080-0005.
148701091119
148801980519           IF  PR-SECTION-NO  IS EQUAL TO  "65"
148901980519               GO TO DPR-0110.
149001980519
149101000515RF7051     IF  PR-SECTION-NO  IS EQUAL TO  "67"
149201000515               GO TO DPR-0110-67.
149301000515
149401971026           IF  PR-SECTION-NO  IS EQUAL TO  "70"
149501971026               GO TO DPR-0080-0010.
149601000000
149701000000           IF  PR-SECTION-NO  IS EQUAL TO  "80"
149801000000               GO TO DPR-0090.
149901000000
150001000000           IF  PR-SECTION-NO  IS EQUAL TO  "82"
150101000000               GO TO DPR-0100.
150201000000
150301000515RF7051     IF  PR-SECTION-NO  IS EQUAL TO  "84"
150401000515               GO TO DPR-0100-84.
150501010124
150601010124RF8558     IF  PR-SECTION-NO  IS EQUAL TO  "90"
150701010124               GO TO DPR-0100-90.
150801000515
150901061026R36342     IF  PR-SECTION-NO  IS EQUAL TO  "99"
151001061026R36342         GO TO DPR-EXIT.
151101061026
151201000000           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
151301000000           GO TO DPR-EXIT.
151401000000
151501000000       DPR-0010.
151601000000
151701000000      *****
151801000000      *****    Processing a Delivery Information record.  Increment the
151901000000      *****    record count, the record will be processed by the
152001000000      *****    End-of-job Logic Routine.
152101000000      *****
152201000000
152301000000           MOVE MFASTMTFP-SECTION      TO  DELIVERY-INFO-SECTION.
152401000000           ADD 1                       TO  WS-STMT-DTA-RCNT-00.
152501031120
152601031120R18312     IF  DI-STMT-TYPE-IND   IS EQUAL TO  "I"
152701031120  ¦            MOVE  "Investor"     TO HL2H-STMT-TYPE
152801031120  ¦        END-IF.
152901031120  ¦
153001031120  ¦        IF  DI-STMT-TYPE-IND   IS EQUAL TO  "D"
153101031120  ¦            MOVE  "Dealer"       TO HL2H-STMT-TYPE
153201031120  ¦        END-IF.
153301031120  ¦
153401031120  ¦        IF  DI-STMT-TYPE-IND   IS EQUAL TO  "R"
153501031120  ¦            MOVE  "Dealer-Rep"   TO HL2H-STMT-TYPE
153601031120R18312     END-IF.
153701031120
153801000000           GO TO DPR-EXIT.
153901000000
154001000000       DPR-0020.
154101000000
154201000000      *****
154301000000      *****    Processing an Investor Information record.  Increment the
154401000000      *****    record count, write the record to the appropriate extract
154501000000      *****    file and increment the output record count.
154601000000      *****
154701000000
154801000000           MOVE MFASTMTFP-SECTION      TO  INVESTOR-INFO-SECTION.
154901000000           ADD 1                       TO  WS-STMT-DTA-RCNT-01.
155001031106R18312         IF II-LANGUAGE-CODE = "E"
155101120706      * RFS 103229 - Start
155201120706  ¦   *          IF  II-HOLD-MAIL = "Y"
155301120730                 IF   (WS-LDA-CPYSELECT = "I"
155401120730                 AND
155501120730                      II-HOLD-MAIL = "Y")   OR
155601120718
155701120730                      (WS-LDA-CPYSELECT = "R"
155801120730                 AND
155901120730                      lc-repholdmail = "Y")  OR
156001120718
156101120730                      (WS-LDA-CPYSELECT = "D"
156201120730                 AND
156301120730                      lc-Dealerholdmail = "Y")
156401120718
156501120718
156601120706      * RFS 103229 - End
156701031106  ¦              ADD 1 TO WS-STMT-DTA-RCNT-ENGHLD
156801031106  ¦              ELSE
156901031106  ¦              ADD 1 TO WS-STMT-DTA-RCNT-ENG
157001031106  ¦              END-IF
157101031106  ¦            END-IF
157201031106  ¦
157301031106  ¦            IF II-LANGUAGE-CODE = "F"
157401120706      * RFS 103229 - Start
157501120706  ¦   *         IF  II-HOLD-MAIL = "Y"
157601120730                 IF  (WS-LDA-CPYSELECT = "I"
157701120730                 AND
157801120730                      II-HOLD-MAIL = "Y")   OR
157901120730                     (WS-LDA-CPYSELECT = "R"
158001120730                 AND
158101120730                      lc-repholdmail = "Y")  OR
158201120730                     (WS-LDA-CPYSELECT = "D"
158301120730                 AND
158401120730                      lc-Dealerholdmail = "Y")
158501120706      * RFS 103229 - End
158601031106  ¦              ADD 1 TO WS-STMT-DTA-RCNT-FRNHLD
158701031106  ¦              ELSE
158801031106  ¦              ADD 1 TO WS-STMT-DTA-RCNT-FRN
158901031106  ¦              END-IF
159001031106R18312         END-IF
159101031106
159201000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
159301031106
159401000000           ADD 1                       TO  WS-STMT-WCNT-01 (ST, SW).
159501031106R18312         IF II-LANGUAGE-CODE = "E"
159601120706      * RFS 103229 - Start
159701120706  ¦   *          IF  II-HOLD-MAIL = "Y"
159801120730                 IF  (WS-LDA-CPYSELECT = "I"
159901120730                 AND
160001120730                      II-HOLD-MAIL = "Y")   OR
160101120730                     (WS-LDA-CPYSELECT = "R"
160201120730                 AND
160301120730                      lc-repholdmail = "Y")  OR
160401120730                     (WS-LDA-CPYSELECT = "D"
160501120730                 AND
160601120730                      lc-Dealerholdmail = "Y")
160701120706      * RFS 103229 - End
160801061102R36342           ADD 1 TO WS-STMT-WCNT-ENGHLD (ST, SW)
160901031106  ¦              ELSE
161001061102R36342           ADD 1 TO WS-STMT-WCNT-ENG (ST, SW)
161101031106  ¦              END-IF
161201031106  ¦            END-IF
161301031106  ¦
161401031106  ¦            IF II-LANGUAGE-CODE = "F"
161501120706      * RFS 103229 - Start
161601120706  ¦   *          IF  II-HOLD-MAIL = "Y"
161701120730                 IF  (WS-LDA-CPYSELECT = "I"
161801120730                 AND
161901120730                      II-HOLD-MAIL = "Y")   OR
162001120730                     (WS-LDA-CPYSELECT = "R"
162101120730                 AND
162201120730                      lc-repholdmail = "Y")  OR
162301120730                     (WS-LDA-CPYSELECT = "D"
162401120730                 AND
162501120730                      lc-Dealerholdmail = "Y")
162601120706      * RFS 103229  - End
162701061102R36342           ADD 1 TO WS-STMT-WCNT-FRNHLD (ST, SW)
162801031106  ¦              ELSE
162901061102R36342           ADD 1 TO WS-STMT-WCNT-FRN (ST, SW)
163001031106  ¦              END-IF
163101031106R18312         END-IF
163201000000           GO TO DPR-EXIT.
163301000000
163401000000       DPR-0030.
163501000000
163601000000      *****
163701000000      *****    Processing a Dealer record.  Increment the record count,
163801000000      *****    write the record to the appropriate extract file and
163901000000      *****    increment the output record count.
164001000000      *****
164101000000
164201000000           ADD 1                       TO  WS-STMT-DTA-RCNT-05.
164301000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
164401000000           ADD 1                       TO  WS-STMT-WCNT-05 (ST, SW).
164501000000           GO TO DPR-EXIT.
164601000000
164701000000       DPR-0040.
164801000000
164901000000      *****
165001000000      *****    Processing an Investor Summary record.  Increment the
165101000000      *****    record count, write the record to the appropriate extract
165201000000      *****    file and increment the output record count.
165301000000      *****
165401000000
165501000000           ADD 1                       TO  WS-STMT-DTA-RCNT-10.
165601000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
165701000000           ADD 1                       TO  WS-STMT-WCNT-10 (ST, SW).
165801000000           GO TO DPR-EXIT.
165901000000
166001010307RF8633 DPR-0045.
166101010307
166201010307      *****
166301010307      *****    Processing an Investor-Summary-Section-2. Increment the
166401010307      *****    record count, write the record to the appropriate extrac
166501010307      *****    file and increment the output record count.
166601010307      *****
166701010307
166801010307           ADD 1                       TO  WS-STMT-DTA-RCNT-12.
166901010307           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
167001010307           ADD 1                       TO  WS-STMT-WCNT-12 (ST, SW).
167101010307           GO TO DPR-EXIT.
167201010307
167301000000       DPR-0050.
167401000000
167501000000      *****
167601000000      *****    Processing an Account Asset Class Summary record.
167701000000      *****    Increment the record count, write the record to the
167801000000      *****    appropriate extract file and increment the output record
167901000000      *****    count.
168001000000      *****
168101000000
168201000000           ADD 1                       TO  WS-STMT-DTA-RCNT-15.
168301000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
168401000000           ADD 1                       TO  WS-STMT-WCNT-15 (ST, SW).
168501000000           GO TO DPR-EXIT.
168601000000
168701030821       DPR-0055.
168801030821
168901030821      *****
169001030821      *****    Processing an Account IPS Details record.
169101030821      *****    Increment the record count, write the record to the
169201030821      *****    appropriate extract file and increment the output record
169301030821      *****    count.
169401030821      *****
169501030821
169601030821           ADD 1                       TO  WS-STMT-DTA-RCNT-17.
169701030821           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
169801030821           ADD 1                       TO  WS-STMT-WCNT-17 (ST, SW).
169901030821           GO TO DPR-EXIT.
170001030821
170101000000       DPR-0060.
170201000000
170301000000      *****
170401000000      *****    Processing an Account Detail record.  Update the input
170501000000      *****    counts/totals, write the record to the appropriate
170601000000      *****    extract file and update the output counts/totals.
170701000000      *****
170801000000
170901000000           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-DETAILS-SECTION.
171001000000           ADD 1                       TO  WS-STMT-DTA-RCNT-20.
171101001011      *    ADD AD-BOOK-VALUE           TO  WS-STMT-DTA-RCNT-BV.
171201001011RF7776     ADD AD-BOOK-VALUE-BASE      TO  WS-STMT-DTA-RCNT-BV.
171301000000           ADD AD-MARKET-VALUE         TO  WS-STMT-DTA-RCNT-MV.
171401000000           ADD AD-NO-OF-UNITS          TO  WS-STMT-DTA-RCNT-UN.
171501000000           ADD AD-LAST-UNIT-PRICE      TO  WS-STMT-DTA-RCNT-UP.
171601031106R18312         IF  AD-SECTION-SEQUENCE = 999999
171701031106  ¦               AND  AD-NOMINEE = "N"
171801031106  ¦                ADD 1     TO  WS-STMT-DTA-RCNT-CLTHLD
171901031124  ¦                ADD 1     TO  WS-STMT-DTA-RCNT-ACCTOT
172001031106  ¦            END-IF
172101031106  ¦
172201031106  ¦            IF  AD-SECTION-SEQUENCE = 999999
172301031106  ¦               AND  AD-NOMINEE = "Y"
172401031106  ¦                ADD 1     TO  WS-STMT-DTA-RCNT-NOMHLD
172501031124  ¦                ADD 1     TO  WS-STMT-DTA-RCNT-ACCTOT
172601031106R18312         END-IF
172701031124
172801000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
172901000000           ADD 1                       TO  WS-STMT-WCNT-20 (ST, SW).
173001001011      *    ADD AD-BOOK-VALUE           TO  WS-STMT-WCNT-BV (ST, SW).
173101001011RF7776     ADD AD-BOOK-VALUE-BASE      TO  WS-STMT-WCNT-BV (ST, SW).
173201000000           ADD AD-MARKET-VALUE         TO  WS-STMT-WCNT-MV (ST, SW).
173301000000           ADD AD-NO-OF-UNITS          TO  WS-STMT-WCNT-UN (ST, SW).
173401000000           ADD AD-LAST-UNIT-PRICE      TO  WS-STMT-WCNT-UP (ST, SW).
173501031106R18312         IF  AD-SECTION-SEQUENCE = 999999
173601031106  ¦               AND  AD-NOMINEE = "N"
173701031106  ¦                ADD 1     TO  WS-STMT-WCNT-CLTHLD (ST, SW)
173801031124  ¦                ADD 1     TO  WS-STMT-WCNT-ACCTOT (ST, SW)
173901031106  ¦            END-IF
174001031106  ¦
174101031106  ¦            IF  AD-SECTION-SEQUENCE = 999999
174201031106  ¦               AND  AD-NOMINEE = "Y"
174301031106  ¦                ADD 1     TO  WS-STMT-WCNT-NOMHLD (ST, SW)
174401031124  ¦                ADD 1     TO  WS-STMT-WCNT-ACCTOT (ST, SW)
174501031106R18312         END-IF
174601000000           GO TO DPR-EXIT.
174701010321
174801060615R35042 DPR-0060-10.
174901060615  ¦
175001060615  ¦   *****
175101060615  ¦   *****    Processing an ACCOUNT-ADDITIONAL-INFO SECTION record.
175201060615  ¦   *****    Increment the record count, write the record to the
175301060615  ¦   *****    appropriate extract file and increment the output record
175401060615  ¦   *****    count.
175501060615  ¦   *****
175601060615  ¦
175701060615  ¦        ADD 1                       TO  WS-STMT-DTA-RCNT-21.
175801060615  ¦        PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
175901060615  v        ADD 1                       TO  WS-STMT-WCNT-21 (ST, SW).
176001060615R35042     GO TO DPR-EXIT.
176101060615
176201130408117038 DPR-0060-22.
176301130408
176401130408117038     ADD 1                       TO  WS-STMT-DTA-RCNT-22.
176501130408117038     PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
176601130408117038     ADD 1                       TO  WS-STMT-WCNT-22 (ST, SW).
176701130408117038     GO TO DPR-EXIT.
176801130408
176901010321RF8633 DPR-0060-20.
177001010321
177101010321      *****
177201010321      *****    Processing an ACCOUNT-GIC-DETAILS-SECTION record.
177301010321      *****    Increment the record count, write the record to the
177401010321      *****    appropriate extract file and increment the output record
177501010321      *****    count.
177601010321      *****
177701010321
177801010321           ADD 1                       TO  WS-STMT-DTA-RCNT-25.
177901010321           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
178001010321           ADD 1                       TO  WS-STMT-WCNT-25 (ST, SW).
178101060615           GO TO DPR-EXIT.
178201010321
178301040406RF7051 DPR-0060-30.
178401000515
178501000515      *****
178601000515      *****    Processing an ACCOUNT-PERFORMANCE         record.
178701000515      *****    Increment the record count, write the record to the
178801000515      *****    appropriate extract file and increment the output record
178901000515      *****    count.
179001000515      *****
179101000515
179201000515           ADD 1                       TO  WS-STMT-DTA-RCNT-30.
179301000515           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
179401000515           ADD 1                       TO  WS-STMT-WCNT-30 (ST, SW).
179501000515           GO TO DPR-EXIT.
179601000515
179701040406R20870 DPR-0060-33.
179801040406
179901040406      *****
180001040406      *****    Processing an ACCOUNT-ROR-FRQ-SECTION     record.
180101040406      *****    Increment the record count, write the record to the
180201040406      *****    appropriate extract file and increment the output record
180301040406      *****    count.
180401040406      *****
180501040406
180601040406           ADD 1                       TO  WS-STMT-DTA-RCNT-33.
180701040406           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
180801040406           ADD 1                       TO  WS-STMT-WCNT-33 (ST, SW).
180901040406R20870     GO TO DPR-EXIT.
181001040406
181101000515       DPR-0060-35.
181201000515
181301000515      *****
181401000515      *****    Processing an ACCOUNT-FUND-PERFORMANCE    record.
181501000515      *****    Increment the record count, write the record to the
181601000515      *****    appropriate extract file and increment the output record
181701000515      *****    count.
181801000515      *****
181901000515
182001000515           ADD 1                       TO  WS-STMT-DTA-RCNT-35.
182101000515           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
182201000515           ADD 1                       TO  WS-STMT-WCNT-35 (ST, SW).
182301000515RF7051     GO TO DPR-EXIT.
182401010124
182501040406R20870 DPR-0060-38.
182601040406
182701040406      *****
182801040406      *****    Processing an ACCOUNT-FUND-ROR            record.
182901040406      *****    Increment the record count, write the record to the
183001040406      *****    appropriate extract file and increment the output record
183101040406      *****    count.
183201040406      *****
183301040406
183401040406           ADD 1                       TO  WS-STMT-DTA-RCNT-38.
183501040406           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
183601040406           ADD 1                       TO  WS-STMT-WCNT-38 (ST, SW).
183701040406RF7051     GO TO DPR-EXIT.
183801040406
183901010124RF8558 DPR-0060-40.
184001010124
184101010124      *****
184201010125      *****    Processing a SEG-FUND-CONTRACT-DETAILS record.
184301010124      *****    Increment the record count, write the record to the
184401010124      *****    appropriate extract file and increment the output record
184501010124      *****    count.
184601010125
184701010124
184801010124           ADD 1                       TO  WS-STMT-DTA-RCNT-40.
184901010124           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
185001010124           ADD 1                       TO  WS-STMT-WCNT-40 (ST, SW).
185101010124           GO TO DPR-EXIT.
185201010124
185301010124       DPR-0060-43.
185401010124
185501010124      *****
185601010125      *****    Processing a SEG-FUND-CONTRACT-INVESTMENT-DETAILS record
185701010124      *****    Increment the record count, write the record to the
185801010124      *****    appropriate extract file and increment the output record
185901010124      *****    count.
186001010124      *****
186101010124
186201010124           ADD 1                       TO  WS-STMT-DTA-RCNT-43.
186301010124           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
186401010124           ADD 1                       TO  WS-STMT-WCNT-43 (ST, SW).
186501010124           GO TO DPR-EXIT.
186601010124
186701010124       DPR-0060-45.
186801010124
186901010124      *****
187001010125      *****    Processing a ANNUITANT-DETAILS record.
187101010125      *****    Increment the record count,
187201010125      *****    write the record to the appropriate extract file
187301010124      *****    and increment the output record count.
187401010124      *****
187501010124
187601010124           ADD 1                       TO  WS-STMT-DTA-RCNT-45.
187701010124           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
187801010124           ADD 1                       TO  WS-STMT-WCNT-45 (ST, SW).
187901010124RF8558     GO TO DPR-EXIT.
188001010124
188101000000       DPR-0070.
188201000000
188301000000      *****
188401000000      *****    Processing a Rollover record.  Increment the record
188501000000      *****    count, write the record to the appropriate extract file
188601000000      *****    and increment the output record count.
188701000000      *****
188801000000
188901000000           ADD 1                       TO  WS-STMT-DTA-RCNT-50.
189001000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
189101000000           ADD 1                       TO  WS-STMT-WCNT-50 (ST, SW).
189201000000           GO TO DPR-EXIT.
189301000000
189401000000       DPR-0080.
189501000000
189601000000      *****
189701000000      *****    Processing a RRIF Detail record.  Increment the record
189801000000      *****    count, write the record to the appropriate extract file
189901000000      *****    and increment the output record count.
190001000000      *****
190101000000
190201000000           ADD 1                       TO  WS-STMT-DTA-RCNT-60.
190301000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
190401000000           ADD 1                       TO  WS-STMT-WCNT-60 (ST, SW).
190501000000           GO TO DPR-EXIT.
190601971026
190701981218       DPR-0080-0000.
190801981218
190901981218      *****
191001981218      *****    Processing a RESP Detail record.  Increment the record
191101981218      *****    count, write the record to the appropriate extract file
191201981218      *****    and increment the output record count.
191301981218      *****
191401981218
191501981218           ADD 1                       TO  WS-STMT-DTA-RCNT-62.
191601981218           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
191701981218           ADD 1                       TO  WS-STMT-WCNT-62 (ST, SW).
191801981218           GO TO DPR-EXIT.
191901981218
192001091119R69515 DPR-0080-0005.
192101091119  ¦
192201091119  ¦   *****
192301091119  ¦   *****    Processing an RDSP-ACCOUNT SECTION record.
192401091119  ¦   *****    Increment the record count, write the record to the
192501091119  ¦   *****    appropriate extract file and increment the output record
192601091119  ¦   *****    count.
192701091119  ¦   *****
192801091119  ¦
192901091119  ¦        ADD 1                       TO  WS-STMT-DTA-RCNT-63.
193001091119  ¦        PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
193101091119  v        ADD 1                       TO  WS-STMT-WCNT-63 (ST, SW).
193201091119R69515     GO TO DPR-EXIT.
193301091119
193401971026       DPR-0080-0010.
193501971026
193601971026      *****
193701971026      *****    Processing a Systematic Plan Info record.  Increment the
193801971026      *****    record count, write the record to the appropriate extract
193901971026      *****    file and increment the output record count.
194001971026      *****
194101971026
194201971026           ADD 1                       TO  WS-STMT-DTA-RCNT-70.
194301971026           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
194401971026           ADD 1                       TO  WS-STMT-WCNT-70 (ST, SW).
194501971026           GO TO DPR-EXIT.
194601000000
194701000000       DPR-0090.
194801000000
194901000000      *****
195001000000      *****    Processing an Account Transaction record.  Update the
195101000000      *****    input counts/totals, write the record to the appropriate
195201000000      *****    extract file and update the output counts/totals.
195301000000      *****
195401000000
195501000000           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-TXN-SECTION.
195601000000           ADD 1                       TO  WS-STMT-DTA-RCNT-80.
195701000000           ADD AT-UNIT-BALANCE         TO  WS-STMT-DTA-RCNT-UB.
195801000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
195901000000           ADD 1                       TO  WS-STMT-WCNT-80 (ST, SW).
196001000000           ADD AT-UNIT-BALANCE         TO  WS-STMT-WCNT-UB (ST, SW).
196101000000           GO TO DPR-EXIT.
196201000000
196301000000       DPR-0100.
196401000000
196501000000      *****
196601000000      *****    Processing an Account Transaction Institution Detail
196701000000      *****    record.  Increment the record count, write the record to
196801000000      *****    the appropriate extract file and increment the output
196901000000      *****    record count.
197001000000      *****
197101000000
197201000000           ADD 1                       TO  WS-STMT-DTA-RCNT-82.
197301000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
197401000000           ADD 1                       TO  WS-STMT-WCNT-82 (ST, SW).
197501000000           GO TO DPR-EXIT.
197601000000
197701000515       DPR-0100-84.
197801000515
197901000515      *****
198001000515      *****    Processing a Transaction RESP Detail
198101000515      *****    record.  Increment the record count, write the record to
198201000515      *****    the appropriate extract file and increment the output
198301000515      *****    record count.
198401000515      *****
198501000515
198601000515           ADD 1                       TO  WS-STMT-DTA-RCNT-84.
198701000515           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
198801000515           ADD 1                       TO  WS-STMT-WCNT-84 (ST, SW).
198901000515           GO TO DPR-EXIT.
199001000515
199101010125RF8558 DPR-0100-90.
199201010125
199301010125      *****
199401010125      *****    Processing a RESET CONTRACT DETAILS record.
199501010125      *****    Increment the record count, write the record to
199601010125      *****    the appropriate extract file and increment the output
199701010125      *****    record count.
199801010125      *****
199901010125
200001010125           ADD 1                       TO  WS-STMT-DTA-RCNT-90.
200101010125           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
200201010125           ADD 1                       TO  WS-STMT-WCNT-90 (ST, SW).
200301010125           GO TO DPR-EXIT.
200401010125
200501980519       DPR-0110.
200601980519
200701980519      *****
200801980519      *****    Processing an Group Information record.
200901980519      *****    Increment the record count, write the record to
201001980519      *****    the appropriate extract file and increment the output
201101980519      *****    record count.
201201980519      *****
201301980519
201401000515           ADD 1                       TO  WS-STMT-DTA-RCNT-65.
201501980519           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
201601000515           ADD 1                       TO  WS-STMT-WCNT-65 (ST, SW).
201701980519           GO TO DPR-EXIT.
201801000000
201901000515       DPR-0110-67.
202001000515
202101000515      *****
202201000515      *****    Processing an Beneficiary Information record.
202301000515      *****    Increment the record count, write the record to
202401000515      *****    the appropriate extract file and increment the output
202501000515      *****    record count.
202601000515      *****
202701000515
202801000515           ADD 1                       TO  WS-STMT-DTA-RCNT-67.
202901000515           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
203001000515           ADD 1                       TO  WS-STMT-WCNT-67 (ST, SW).
203101000515           GO TO DPR-EXIT.
203201000515
203301000000       DPR-EXIT.
203401000000           EXIT.
203501000000      /
203601000000       PRINT-ERR-LINE.
203701000000
203801000000      ******************************************************************
203901000000      *                                                                *
204001000000      *    P R I N T   E R R O R   L I N E   R O U T I N E             *
204101000000      *                                                                *
204201000000      ******************************************************************
204301000000
204401000000      *****
204501000000      *****    Format and print the error line.
204601000000      *****
204701000000
204801000000           MOVE SPACES                 TO  ERROR-LINE-1.
204901000000           MOVE PR-INVESTOR-NO         TO  EL1-INVESTOR-NO.
205001000000           MOVE PR-ACCOUNT             TO  EL1-ACCOUNT.
205101000000           MOVE PR-SECTION-NO          TO  EL1-SECTION-NO.
205201000000           MOVE "-"                    TO  EL1-SECTION-LITDSH.
205301000000           MOVE PR-SECTION-SEQUENCE    TO  EL1-SECTION-SEQUENCE.
205401000000           MOVE PR-LANGUAGE-CODE       TO  EL1-LANGUAGE-CODE.
205501000000           MOVE PR-DEALER              TO  EL1-DEALER.
205601000000           MOVE PR-DEALER-REP-CODE     TO  EL1-DEALER-REP-CODE.
205701000000           MOVE "INVALID SECTION"      TO  EL1-MSG.
205801000000
205901000000      *****
206001000000      *****    If the page is full, start a new page and print the
206101000000      *****    Heading lines.
206201000000      *****
206301000000
206401000000           IF  WS-LNECNT  IS GREATER THAN  WS-LNEMAX
206501000000               PERFORM PRINT-HDG-LINE THRU PHL-EXIT.
206601000000
206701000000      *****
206801000000      *****    Print the error line.
206901000000      *****
207001000000
207101000000           WRITE PRINT-REC           FROM  ERROR-LINE-1
207201000000                         AFTER  ADVANCING  1.
207301000000           ADD 1                       TO  WS-LNECNT.
207401000000
207501000000       PEL-EXIT.
207601000000           EXIT.
207701000000      /
207801000000       LEVEL-SUMMARY-1.
207901000000
208001000000      ******************************************************************
208101000000      *                                                                *
208201000000      *    L E V E L   S U M M A R I Z A T I O N   1   R O U T I N E   *
208301000000      *                                                                *
208401000000      *        INVESTOR-NO:            Investor Number                 *
208501000000      *                                                                *
208601000000      ******************************************************************
208701000000
208801000000      *****
208901000000      *****    If the Investor Number is zeroes, bypass this routine.
209001000000      *****
209101000000
209201000000           IF  PREV-INVESTOR-NO  EQUAL TO  ZEROES
209301000000               GO TO LS1-EXIT.
209401000000
209501000000      *****
209601000000      *****    Null routine.
209701000000      *****
209801000000
209901000000           CONTINUE.
210001000000
210101000000       LS1-EXIT.
210201000000           EXIT.
210301000000      /
210401000000       LEVEL-REINIT-1.
210501000000
210601000000      ******************************************************************
210701000000      *                                                                *
210801000000      *    L E V E L   R E I N I T I A L I Z A T I O N   1   R T N .   *
210901000000      *                                                                *
211001000000      *        INVESTOR-NO:            Investor Number                 *
211101000000      *                                                                *
211201000000      ******************************************************************
211301000000
211401000000      *****
211501000000      *****    If the Investor Number is zeroes, bypass this routine.
211601000000      *****
211701000000
211801980128           IF  CURR-INVESTOR-NO IS EQUAL
211901980128                                       TO  ZEROES
212001000000               GO TO LR1-EXIT.
212101000000
212201000000      *****
212301000000      *****    Determine which statement file the investor statements
212401000000      *****    records are to be written to.  It is assumed that the
212501000000      *****    first record for the Investor will be the Investor
212601000000      *****    Information.
212701971028      *****
212801971028      *****    NOTE:   AIC will only produce a Canadian English and a
212901971028      *****            Canadian English Hold Mail file.
213001000000      *****
213101000000
213201000000           MOVE MFASTMTFP-SECTION      TO  INVESTOR-INFO-SECTION.
213301971028           IF  WS-LDA-MGMT-COM-CDE
213401971028                              IS EQUAL TO  "AIC"
213501971028               SET ST                  TO  1
213601971028               GO TO LR1-0010.
213701971028
213801000000           IF  WS-LDA-ALLTYP NOT EQUAL TO  "I"
213901000000           OR  WS-LDA-MGMT-COM-CDE
214001000000                          IS NOT EQUAL TO  "AIC"
214101000000               SET ST                  TO  1
214201000000               GO TO LR1-0010.
214301000000
214401000000           IF  II-COUNTRY-CODE   EQUAL TO  "CAN"
214501000000               SET ST                  TO  1
214601000000               GO TO LR1-0010.
214701000000
214801000000           IF  II-COUNTRY-CODE   EQUAL TO  "USA"
214901000000               SET ST                  TO  2
215001000000               GO TO LR1-0010.
215101000000
215201000000           SET ST                      TO  3.
215301000000
215401000000       LR1-0010.
215501000000           IF  II-LANGUAGE-CODE  EQUAL TO  "F"
215601971028           AND WS-LDA-MGMT-COM-CDE
215701971028                          IS NOT EQUAL TO  "AIC"
215801000000               GO TO LR1-0020.
215901980609
216001980609           IF  WS-LDA-MGMT-COM-CDE
216101980609                              IS EQUAL TO  "GGF"
216201980609           AND WS-LDA-ALLTYP NOT EQUAL TO  "I"
216301980609               GO TO LR1-0010-0010.
216401000000
216501120706      * RFS 103229 - Start
216601120706
216701120706      *    IF  II-HOLD-MAIL  NOT EQUAL TO  "Y"
216801120730           IF  (WS-LDA-CPYSELECT = "I"
216901120730           AND
217001120730                 II-HOLD-MAIL  NOT EQUAL TO  "Y" )     OR
217101120730               (WS-LDA-CPYSELECT = "R"
217201120730           AND
217301120730                lc-Repholdmail  NOT EQUAL TO  "Y")   OR
217401120730               (WS-LDA-CPYSELECT = "D"
217501120730           AND
217601120730                 lc-Dealerholdmail NOT EQUAL TO  "Y")
217701120706      * RFS 103229 - End
217801980609               SET SW                  TO  1
217901000000               GO TO LR1-0030.
218001000000
218101980609           SET SW                      TO  2.
218201000000           GO TO LR1-0030.
218301980609
218401980609       LR1-0010-0010.
218501980609           SET SW                      TO  1.
218601980609           GO TO LR1-0030.
218701000000
218801000000       LR1-0020.
218901980609           IF  WS-LDA-MGMT-COM-CDE
219001980609                              IS EQUAL TO  "GGF"
219101980609           AND WS-LDA-ALLTYP NOT EQUAL TO  "I"
219201980609               GO TO LR1-0020-0010.
219301980609
219401000000           IF  II-HOLD-MAIL  NOT EQUAL TO  "Y"
219501980609               SET SW                  TO  4
219601000000               GO TO LR1-0030.
219701000000
219801980609           SET SW                      TO  5.
219901980609           GO TO LR1-0030.
220001980609
220101980609       LR1-0020-0010.
220201980609           SET SW                      TO  4.
220301980609           GO TO LR1-0030.
220401000000
220501000000       LR1-0030.
220601000000           CONTINUE.
220701000000
220801000000       LR1-EXIT.
220901000000           EXIT.
221001000000      /
221101000000       INITIAL-LOGIC-RTN.
221201000000
221301000000      ******************************************************************
221401000000      *                                                                *
221501000000      *    I N I T I A L   L O G I C   R O U T I N E                   *
221601000000      *                                                                *
221701000000      ******************************************************************
221801000000
221901000000      *****
222001000000      *****    Retrieve the local data area parameters.
222101000000      *****
222201000000
222301000000           ACCEPT WS-LOCAL-DATA-AREA FROM  WS-LOCAL.
222401000000
222501000000      *****
222601000000      *****    Initialize the program defined work items.
222701000000      *****
222801000000
222901000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT.
223001000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-BV.
223101000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-MV.
223201000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-UB.
223301010307           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-UN.
223401000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-UP.
223501000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-00.
223601000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-01.
223701000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-05.
223801000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-10.
223901010307RF8633     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-12.
224001000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-15.
224101030821R18091     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-17.
224201000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-20.
224301060615R35042     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-21.
224401130408117038     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-22.
224501010321RF8633     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-25.
224601000515RF7051     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-30.
224701040406R20870     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-33.
224801010124           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-35.
224901040406R20870     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-38.
225001010124RF8558     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-40.
225101010307RF8558     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-43.
225201010307RF8558     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-45.
225301000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-50.
225401000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-60.
225501981218           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-62.
225601091119R69515     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-63.
225701980519           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-65.
225801000515           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-67.
225901971026           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-70.
226001000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-80.
226101000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-82.
226201000515           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-84.
226301031106           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-90.
226401031106R18312     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-CLTHLD.
226501031106  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-NOMHLD.
226601031106  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-ENG.
226701031106  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-ENGHLD.
226801031106  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-FRN.
226901031124  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-FRNHLD.
227001031124R18312     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-ACCTOT.
227101000000           MOVE 3                      TO  WS-ST-MAX.
227201980609           MOVE 6                      TO  WS-SW-MAX.
227301000000
227401000000           SET ST                      TO  1.
227501000000           SET SW                      TO  1.
227601000000
227701000000       ILR-0010.
227801000000           MOVE ZEROES                 TO  WS-STMT-WCNT (ST, SW).
227901000000           MOVE ZEROES                 TO  WS-STMT-WCNT-BV (ST, SW).
228001000000           MOVE ZEROES                 TO  WS-STMT-WCNT-MV (ST, SW).
228101000000           MOVE ZEROES                 TO  WS-STMT-WCNT-UB (ST, SW).
228201000000           MOVE ZEROES                 TO  WS-STMT-WCNT-UN (ST, SW).
228301000000           MOVE ZEROES                 TO  WS-STMT-WCNT-UP (ST, SW).
228401000000           MOVE ZEROES                 TO  WS-STMT-WCNT-00 (ST, SW).
228501000000           MOVE ZEROES                 TO  WS-STMT-WCNT-01 (ST, SW).
228601000000           MOVE ZEROES                 TO  WS-STMT-WCNT-05 (ST, SW).
228701000000           MOVE ZEROES                 TO  WS-STMT-WCNT-10 (ST, SW).
228801010307RF8633     MOVE ZEROES                 TO  WS-STMT-WCNT-12 (ST, SW).
228901000000           MOVE ZEROES                 TO  WS-STMT-WCNT-15 (ST, SW).
229001030821R18091     MOVE ZEROES                 TO  WS-STMT-WCNT-17 (ST, SW).
229101000000           MOVE ZEROES                 TO  WS-STMT-WCNT-20 (ST, SW).
229201060615R35042     MOVE ZEROES                 TO  WS-STMT-WCNT-21 (ST, SW).
229301130408117038     MOVE ZEROES                 TO  WS-STMT-WCNT-22 (ST, SW).
229401010321RF8633     MOVE ZEROES                 TO  WS-STMT-WCNT-25 (ST, SW).
229501000515RF7051     MOVE ZEROES                 TO  WS-STMT-WCNT-30 (ST, SW).
229601040406R20870     MOVE ZEROES                 TO  WS-STMT-WCNT-33 (ST, SW).
229701000515           MOVE ZEROES                 TO  WS-STMT-WCNT-35 (ST, SW).
229801040406R20870     MOVE ZEROES                 TO  WS-STMT-WCNT-38 (ST, SW).
229901010124RF8558     MOVE ZEROES                 TO  WS-STMT-WCNT-40 (ST, SW).
230001010307RF8558     MOVE ZEROES                 TO  WS-STMT-WCNT-43 (ST, SW).
230101010307RF8558     MOVE ZEROES                 TO  WS-STMT-WCNT-45 (ST, SW).
230201000000           MOVE ZEROES                 TO  WS-STMT-WCNT-50 (ST, SW).
230301000000           MOVE ZEROES                 TO  WS-STMT-WCNT-60 (ST, SW).
230401981218           MOVE ZEROES                 TO  WS-STMT-WCNT-62 (ST, SW).
230501091119R69515     MOVE ZEROES                 TO  WS-STMT-WCNT-63 (ST, SW).
230601980519           MOVE ZEROES                 TO  WS-STMT-WCNT-65 (ST, SW).
230701000515           MOVE ZEROES                 TO  WS-STMT-WCNT-67 (ST, SW).
230801971026           MOVE ZEROES                 TO  WS-STMT-WCNT-70 (ST, SW).
230901000000           MOVE ZEROES                 TO  WS-STMT-WCNT-80 (ST, SW).
231001000000           MOVE ZEROES                 TO  WS-STMT-WCNT-82 (ST, SW).
231101000515           MOVE ZEROES                 TO  WS-STMT-WCNT-84 (ST, SW).
231201010124RF8558     MOVE ZEROES                 TO  WS-STMT-WCNT-90 (ST, SW).
231301031106R18312     MOVE ZEROES               TO  WS-STMT-WCNT-CLTHLD (ST, SW).
231401031106  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-NOMHLD (ST, SW).
231501031106  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-ENG    (ST, SW).
231601031106  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-ENGHLD (ST, SW).
231701031106  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-FRN    (ST, SW).
231801031124  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-FRNHLD (ST, SW).
231901031124R18312     MOVE ZEROES               TO  WS-STMT-WCNT-ACCTOT (ST, SW).
232001000000           IF  SW            IS LESS THAN  WS-SW-MAX
232101000000               SET SW               UP BY  1
232201000000               GO TO ILR-0010.
232301000000
232401000000           IF  ST            IS LESS THAN  WS-ST-MAX
232501000000               SET ST               UP BY  1
232601000000               SET SW                  TO  1
232701000000               GO TO ILR-0010.
232801000000
232901000000           MOVE 99                     TO  WS-LNECNT.
233001000000           MOVE 60                     TO  WS-LNEMAX.
233101000000           MOVE ZEROES                 TO  WS-PGECNT.
233201000000
233301000000           MOVE "N"                    TO  WS-EOJHDG-SW.
233401000000
233501000000           MOVE LOW-VALUES             TO  CURR-CONTROLS.
233601000000           MOVE LOW-VALUES             TO  PREV-CONTROLS.
233701000000
233801000000      *****
233901000000      *****    Format the heading literals.
234001000000      *****
234101000000
234201000000           ACCEPT WS-DATE            FROM  DATE.
234301000000           MOVE WS-DATE-YY             TO  HL1-YY.
234401000000           MOVE WS-DATE-MM             TO  HL1-MM.
234501000000           MOVE WS-DATE-DD             TO  HL1-DD.
234601000000
234701000000           ACCEPT HL1-TIME           FROM  TIME.
234801000000           INSPECT HL1-TIME REPLACING ALL  SPACE
234901000000                                       BY  ":".
235001000000           MOVE "."                    TO  HL1-TIME-DOT.
235101000000
235201010411RF9964     IF WS-LDA-MGMT-COM-CDE     IS EQUAL TO  "TAI"
235301010525RF9523     OR WS-LDA-HOLD-MAIL        IS EQUAL TO  "Y"
235401010411              MOVE "AIC"              TO WS-LDA-MGMT-COM-CDE
235501010411           END-IF.
235601010411
235701000000      *****
235801000000      *****    Open the Input files.
235901000000      *****
236001000000
236101120706           OPEN    INPUT   STMT-DTA-FILE.
236201120706      * RFS 103229 - Start
236301120730           IF (WS-LDA-CPYSELECT = 'D' OR 'R')
236401120706
236501120706           OPEN    INPUT   DEALER
236601120706                           INSTITUTION-BRANCH
236701120706                           INST-ADDRESS
236801120706           END-IF.
236901120730           IF (WS-LDA-CPYSELECT =  'R')
237001120706
237101120706           OPEN    INPUT   DEALER-REP
237201121012115141                     REP-ADDRESS
237301120706           END-IF.
237401120706      * RFS 103229 -  End
237501000000      *****
237601000000      *****    Open the Output files.
237701000000      *****
237801000000
237901000000           OPEN    OUTPUT  STMT-ENG-FILE
238001000000                           STMT-ENGHLD-FILE
238101000000                           STMT-FRN-FILE
238201000000                           STMT-FRNHLD-FILE
238301000000                           PRINT-FILE.
238401000000
238501971028      *****
238601971028      *****    NOTE:   The following were previously for AIC only.  For
238701971028      *****            the time being, AIC will only be producing an
238801971028      *****            English and an English Hold Mail file, therefore
238901971028      *****            the lines are being bypassed.
239001971028      *****
239101971028
239201971028           IF  WS-LDA-MGMT-COM-CDE
239301971028                              IS EQUAL TO  "AIC"
239401971028               GO TO ILR-EXIT.
239501971028
239601971028           IF  WS-LDA-ALLTYP  IS EQUAL TO  "I"
239701971028           AND WS-LDA-MGMT-COM-CDE
239801971028                              IS EQUAL TO  "AIC"
239901971028               OPEN    OUTPUT  STMT-ENGF-FILE
240001971028                               STMT-ENGHLDF-FILE
240101971028                               STMT-ENGU-FILE
240201971028                               STMT-ENGHLDU-FILE
240301971028                               STMT-FRNF-FILE
240401971028                               STMT-FRNHLDF-FILE
240501971028                               STMT-FRNU-FILE
240601971028                               STMT-FRNHLDU-FILE.
240701000000
240801000000       ILR-EXIT.
240901000000           EXIT.
241001000000      /
241101000000       END-JOB-RTN.
241201000000
241301000000      ******************************************************************
241401000000      *                                                                *
241501000000      *    E N D   J O B   R O U T I N E                               *
241601000000      *                                                                *
241701000000      ******************************************************************
241801000000
241901000000      *****
242001000000      *****    Print the Control Report read values on a separate page.
242101000000      *****
242201000000
242301000000           MOVE "Y"                    TO  WS-EOJHDG-SW.
242401000000           MOVE 99                     TO  WS-LNECNT.
242501000000
242601000000           MOVE SPACES                 TO  CONTROL-LINE-1.
242701000000           MOVE WS-STMT-DTA-RLIT       TO  CL1-LIT.
242801000000           MOVE WS-STMT-DTA-RCNT       TO  CL1-CNT.
242901000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
243001000000
243101000000           MOVE SPACES                 TO  CONTROL-LINE-1.
243201000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
243301000000
243401000000           MOVE SPACES                 TO  CONTROL-LINE-1.
243501000000           MOVE WS-STMT-DTA-RLIT-00    TO  CL1-LIT.
243601000000           MOVE WS-STMT-DTA-RCNT-00    TO  CL1-CNT.
243701000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
243801000000
243901000000           MOVE SPACES                 TO  CONTROL-LINE-1.
244001000000           MOVE WS-STMT-DTA-RLIT-01    TO  CL1-LIT.
244101000000           MOVE WS-STMT-DTA-RCNT-01    TO  CL1-CNT.
244201000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
244301000000
244401000000           MOVE SPACES                 TO  CONTROL-LINE-1.
244501000000           MOVE WS-STMT-DTA-RLIT-05    TO  CL1-LIT.
244601000000           MOVE WS-STMT-DTA-RCNT-05    TO  CL1-CNT.
244701000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
244801000000
244901000000           MOVE SPACES                 TO  CONTROL-LINE-1.
245001000000           MOVE WS-STMT-DTA-RLIT-10    TO  CL1-LIT.
245101000000           MOVE WS-STMT-DTA-RCNT-10    TO  CL1-CNT.
245201000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
245301000000
245401010307RF8633     IF  WS-STMT-DTA-RCNT-12 IS GREATER THAN  ZEROES
245501010307               MOVE SPACES TO CONTROL-LINE-1
245601010307               MOVE WS-STMT-DTA-RLIT-12 TO  CL1-LIT
245701010307               MOVE WS-STMT-DTA-RCNT-12 TO  CL1-CNT
245801010307               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
245901010307
246001000000           IF  WS-STMT-DTA-RCNT-15
246101000000                          IS GREATER THAN  ZEROES
246201000000               MOVE SPACES             TO  CONTROL-LINE-1
246301000000               MOVE WS-STMT-DTA-RLIT-15
246401000000                                       TO  CL1-LIT
246501000000               MOVE WS-STMT-DTA-RCNT-15
246601000000                                       TO  CL1-CNT
246701000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
246801000000
246901030821R10891     IF  WS-STMT-DTA-RCNT-17 > ZEROES
247001030821  |            MOVE SPACES              TO  CONTROL-LINE-1
247101030821  |            MOVE WS-STMT-DTA-RLIT-17 TO  CL1-LIT
247201030821  |            MOVE WS-STMT-DTA-RCNT-17 TO  CL1-CNT
247301030821  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
247401030821
247501000000           MOVE SPACES                 TO  CONTROL-LINE-1.
247601030821           MOVE WS-STMT-DTA-RLIT-20    TO  CL1-LIT.
247701030821           MOVE WS-STMT-DTA-RCNT-20    TO  CL1-CNT.
247801030821           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
247901030821
248001060615R35042     IF  WS-STMT-DTA-RCNT-21
248101060615  ¦                       IS GREATER THAN  ZEROES
248201060615  ¦            MOVE SPACES             TO  CONTROL-LINE-1
248301060615  ¦            MOVE WS-STMT-DTA-RLIT-21
248401060615  ¦                                    TO  CL1-LIT
248501060615  ¦            MOVE WS-STMT-DTA-RCNT-21
248601060615  ¦                                    TO  CL1-CNT
248701060615  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
248801060615R35042     END-IF
248901130408
249001130408117038     IF  WS-STMT-DTA-RCNT-22
249101130408117038                    IS GREATER THAN  ZEROES
249201130408117038         MOVE SPACES             TO  CONTROL-LINE-1
249301130408117038         MOVE WS-STMT-DTA-RLIT-22
249401130408117038                                 TO  CL1-LIT
249501130408117038         MOVE WS-STMT-DTA-RCNT-22
249601130408117038                                 TO  CL1-CNT
249701130408117038         PERFORM PRINT-CTL-LINE THRU PCL-EXIT
249801130408117038     END-IF
249901060615
250001010321RF8633     IF  WS-STMT-DTA-RCNT-25
250101010321                          IS GREATER THAN  ZEROES
250201010321               MOVE SPACES             TO  CONTROL-LINE-1
250301010321               MOVE WS-STMT-DTA-RLIT-25
250401010321                                       TO  CL1-LIT
250501010321               MOVE WS-STMT-DTA-RCNT-25
250601010321                                       TO  CL1-CNT
250701010321               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
250801010321           END-IF
250901031106
251001031106R18312     IF  WS-STMT-DTA-RCNT-CLTHLD
251101031106  ¦                       IS GREATER THAN  ZEROES
251201031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
251301031106  ¦            MOVE WS-STMT-DTA-RLIT-CLTHLD
251401031106  ¦                                    TO  CL1-LIT
251501031106  ¦            MOVE WS-STMT-DTA-RCNT-CLTHLD
251601031106  ¦                                    TO  CL1-CNT
251701031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
251801031106R18312     END-IF
251901031106
252001031106R18312     IF  WS-STMT-DTA-RCNT-NOMHLD
252101031106  ¦                       IS GREATER THAN  ZEROES
252201031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
252301031106  ¦            MOVE WS-STMT-DTA-RLIT-NOMHLD
252401031106  ¦                                    TO  CL1-LIT
252501031106  ¦            MOVE WS-STMT-DTA-RCNT-NOMHLD
252601031106  ¦                                    TO  CL1-CNT
252701031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
252801031106R18312     END-IF
252901010321
253001031106R18312     IF  WS-STMT-DTA-RCNT-ENG
253101031106  ¦                       IS GREATER THAN  ZEROES
253201031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
253301031106  ¦            MOVE WS-STMT-DTA-RLIT-ENG
253401031106  ¦                                    TO  CL1-LIT
253501031106  ¦            MOVE WS-STMT-DTA-RCNT-ENG
253601031106  ¦                                    TO  CL1-CNT
253701031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
253801031106R18312     END-IF
253901031106
254001031106R18312     IF  WS-STMT-DTA-RCNT-ENGHLD
254101031106  ¦                       IS GREATER THAN  ZEROES
254201031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
254301031106  ¦            MOVE WS-STMT-DTA-RLIT-ENGHLD
254401031106  ¦                                    TO  CL1-LIT
254501031106  ¦            MOVE WS-STMT-DTA-RCNT-ENGHLD
254601031106  ¦                                    TO  CL1-CNT
254701031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
254801031106R18312     END-IF
254901031106
255001031106R18312     IF  WS-STMT-DTA-RCNT-FRN
255101031106  ¦                       IS GREATER THAN  ZEROES
255201031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
255301031106  ¦            MOVE WS-STMT-DTA-RLIT-FRN
255401031106  ¦                                    TO  CL1-LIT
255501031106  ¦            MOVE WS-STMT-DTA-RCNT-FRN
255601031106  ¦                                    TO  CL1-CNT
255701031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
255801031106R18312     END-IF
255901031106
256001031106R18312     IF  WS-STMT-DTA-RCNT-FRNHLD
256101031106  ¦                       IS GREATER THAN  ZEROES
256201031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
256301031106  ¦            MOVE WS-STMT-DTA-RLIT-FRNHLD
256401031106  ¦                                    TO  CL1-LIT
256501031106  ¦            MOVE WS-STMT-DTA-RCNT-FRNHLD
256601031106  ¦                                    TO  CL1-CNT
256701031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
256801031106R18312     END-IF
256901031106
257001031124R18312     IF  WS-STMT-DTA-RCNT-ACCTOT
257101031124  ¦                       IS GREATER THAN  ZEROES
257201031124  ¦            MOVE SPACES             TO  CONTROL-LINE-1
257301031124  ¦            MOVE WS-STMT-DTA-RLIT-ACCTOT
257401031124  ¦                                    TO  CL1-LIT
257501031124  ¦            MOVE WS-STMT-DTA-RCNT-ACCTOT
257601031124  ¦                                    TO  CL1-CNT
257701031124  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
257801031124R18312     END-IF
257901031124
258001000515RF7051     IF  WS-STMT-DTA-RCNT-30
258101000515                          IS GREATER THAN  ZEROES
258201000515               MOVE SPACES             TO  CONTROL-LINE-1
258301000515               MOVE WS-STMT-DTA-RLIT-30
258401000515                                       TO  CL1-LIT
258501000515               MOVE WS-STMT-DTA-RCNT-30
258601000515                                       TO  CL1-CNT
258701000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
258801000515           END-IF
258901000515
259001040406R20870     IF  WS-STMT-DTA-RCNT-33
259101040406                          IS GREATER THAN  ZEROES
259201040406               MOVE SPACES             TO  CONTROL-LINE-1
259301040406               MOVE WS-STMT-DTA-RLIT-33
259401040406                                       TO  CL1-LIT
259501040406               MOVE WS-STMT-DTA-RCNT-33
259601040406                                       TO  CL1-CNT
259701040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
259801040406           END-IF
259901040406
260001000515RF7051     IF  WS-STMT-DTA-RCNT-35
260101000515                          IS GREATER THAN  ZEROES
260201000515               MOVE SPACES             TO  CONTROL-LINE-1
260301000515               MOVE WS-STMT-DTA-RLIT-35
260401000515                                       TO  CL1-LIT
260501000515               MOVE WS-STMT-DTA-RCNT-35
260601000515                                       TO  CL1-CNT
260701000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
260801000515           END-IF
260901000515
261001040406R20870     IF  WS-STMT-DTA-RCNT-38
261101040406                          IS GREATER THAN  ZEROES
261201040406               MOVE SPACES             TO  CONTROL-LINE-1
261301040406               MOVE WS-STMT-DTA-RLIT-38
261401040406                                       TO  CL1-LIT
261501040406               MOVE WS-STMT-DTA-RCNT-38
261601040406                                       TO  CL1-CNT
261701040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
261801040406           END-IF
261901040406
262001010124RF8558     IF  WS-STMT-DTA-RCNT-40
262101010124                          IS GREATER THAN  ZEROES
262201010124               MOVE SPACES             TO  CONTROL-LINE-1
262301010124               MOVE WS-STMT-DTA-RLIT-40
262401010124                                       TO  CL1-LIT
262501010124               MOVE WS-STMT-DTA-RCNT-40
262601010124                                       TO  CL1-CNT
262701010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
262801010124           END-IF
262901010124
263001010124           IF  WS-STMT-DTA-RCNT-43
263101010124                          IS GREATER THAN  ZEROES
263201010124               MOVE SPACES             TO  CONTROL-LINE-1
263301010124               MOVE WS-STMT-DTA-RLIT-43
263401010124                                       TO  CL1-LIT
263501010124               MOVE WS-STMT-DTA-RCNT-43
263601010124                                       TO  CL1-CNT
263701010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
263801010124           END-IF
263901010124
264001010124           IF  WS-STMT-DTA-RCNT-45
264101010124                          IS GREATER THAN  ZEROES
264201010124               MOVE SPACES             TO  CONTROL-LINE-1
264301010124               MOVE WS-STMT-DTA-RLIT-45
264401010124                                       TO  CL1-LIT
264501010124               MOVE WS-STMT-DTA-RCNT-45
264601010124                                       TO  CL1-CNT
264701010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
264801010124RF8558     END-IF
264901010124
265001000000           IF  WS-STMT-DTA-RCNT-50
265101000000                          IS GREATER THAN  ZEROES
265201000000               MOVE SPACES             TO  CONTROL-LINE-1
265301000000               MOVE WS-STMT-DTA-RLIT-50
265401000000                                       TO  CL1-LIT
265501000000               MOVE WS-STMT-DTA-RCNT-50
265601000000                                       TO  CL1-CNT
265701000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
265801000000
265901000000           IF  WS-STMT-DTA-RCNT-60
266001000000                          IS GREATER THAN  ZEROES
266101000000               MOVE SPACES             TO  CONTROL-LINE-1
266201000000               MOVE WS-STMT-DTA-RLIT-60
266301000000                                       TO  CL1-LIT
266401000000               MOVE WS-STMT-DTA-RCNT-60
266501000000                                       TO  CL1-CNT
266601000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
266701971026
266801981218           IF  WS-STMT-DTA-RCNT-62
266901981218                          IS GREATER THAN  ZEROES
267001981218               MOVE SPACES             TO  CONTROL-LINE-1
267101981218               MOVE WS-STMT-DTA-RLIT-62
267201981218                                       TO  CL1-LIT
267301981218               MOVE WS-STMT-DTA-RCNT-62
267401981218                                       TO  CL1-CNT
267501981218               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
267601981218
267701091119R69515     IF  WS-STMT-DTA-RCNT-63
267801091119  ¦                       IS GREATER THAN  ZEROES
267901091119  ¦            MOVE SPACES             TO  CONTROL-LINE-1
268001091119  ¦            MOVE WS-STMT-DTA-RLIT-63
268101091119  ¦                                    TO  CL1-LIT
268201091119  ¦            MOVE WS-STMT-DTA-RCNT-63
268301091119  ¦                                    TO  CL1-CNT
268401091119  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
268501091119R69515     END-IF
268601091119
268701980519           IF  WS-STMT-DTA-RCNT-65
268801980519                          IS GREATER THAN  ZEROES
268901980519               MOVE SPACES             TO  CONTROL-LINE-1
269001980519               MOVE WS-STMT-DTA-RLIT-65
269101980519                                       TO  CL1-LIT
269201980519               MOVE WS-STMT-DTA-RCNT-65
269301980519                                       TO  CL1-CNT
269401980519               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
269501980519
269601000515           IF  WS-STMT-DTA-RCNT-67
269701000515                          IS GREATER THAN  ZEROES
269801000515               MOVE SPACES             TO  CONTROL-LINE-1
269901000515               MOVE WS-STMT-DTA-RLIT-67
270001000515                                       TO  CL1-LIT
270101000515               MOVE WS-STMT-DTA-RCNT-67
270201000515                                       TO  CL1-CNT
270301000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
270401000515           END-IF
270501000515
270601971026           IF  WS-STMT-DTA-RCNT-70
270701971026                          IS GREATER THAN  ZEROES
270801971026               MOVE SPACES             TO  CONTROL-LINE-1
270901971026               MOVE WS-STMT-DTA-RLIT-70
271001971026                                       TO  CL1-LIT
271101971026               MOVE WS-STMT-DTA-RCNT-70
271201971026                                       TO  CL1-CNT
271301971026               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
271401000000
271501000000           MOVE SPACES                 TO  CONTROL-LINE-1.
271601000000           MOVE WS-STMT-DTA-RLIT-80    TO  CL1-LIT.
271701000000           MOVE WS-STMT-DTA-RCNT-80    TO  CL1-CNT.
271801000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
271901000000
272001000000           IF  WS-STMT-DTA-RCNT-82
272101000000                          IS GREATER THAN  ZEROES
272201000000               MOVE SPACES             TO  CONTROL-LINE-1
272301000000               MOVE WS-STMT-DTA-RLIT-82
272401000000                                       TO  CL1-LIT
272501000000               MOVE WS-STMT-DTA-RCNT-82
272601000000                                       TO  CL1-CNT
272701000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
272801000000
272901000515           IF  WS-STMT-DTA-RCNT-84
273001000515                          IS GREATER THAN  ZEROES
273101000515               MOVE SPACES             TO  CONTROL-LINE-1
273201000515               MOVE WS-STMT-DTA-RLIT-84
273301000515                                       TO  CL1-LIT
273401000515               MOVE WS-STMT-DTA-RCNT-84
273501000515                                       TO  CL1-CNT
273601000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
273701000515           END-IF
273801000515
273901010124RF8558     IF  WS-STMT-DTA-RCNT-90
274001010124                          IS GREATER THAN  ZEROES
274101010124               MOVE SPACES             TO  CONTROL-LINE-1
274201010124               MOVE WS-STMT-DTA-RLIT-90
274301010124                                       TO  CL1-LIT
274401010124               MOVE WS-STMT-DTA-RCNT-90
274501010124                                       TO  CL1-CNT
274601010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
274701010124           END-IF
274801010124
274901000000           MOVE SPACES                 TO  CONTROL-LINE-1.
275001000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
275101000000
275201000000           MOVE SPACES                 TO  CONTROL-LINE-1.
275301000000           MOVE WS-STMT-DTA-RLIT-UN    TO  CL1-LIT.
275401000000           MOVE WS-STMT-DTA-RCNT-UN    TO  CL1-CNT1.
275501000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
275601000000
275701000000           MOVE SPACES                 TO  CONTROL-LINE-1.
275801000000           MOVE WS-STMT-DTA-RLIT-UP    TO  CL1-LIT.
275901000000           MOVE WS-STMT-DTA-RCNT-UP    TO  CL1-CNT2.
276001000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
276101000000
276201000000           MOVE SPACES                 TO  CONTROL-LINE-1.
276301000000           MOVE WS-STMT-DTA-RLIT-MV    TO  CL1-LIT.
276401000000           MOVE WS-STMT-DTA-RCNT-MV    TO  CL1-CNT3.
276501000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
276601000000
276701000000           MOVE SPACES                 TO  CONTROL-LINE-1.
276801000000           MOVE WS-STMT-DTA-RLIT-BV    TO  CL1-LIT.
276901000000           MOVE WS-STMT-DTA-RCNT-BV    TO  CL1-CNT3.
277001000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
277101000000
277201000000           MOVE SPACES                 TO  CONTROL-LINE-1.
277301000000           MOVE WS-STMT-DTA-RLIT-UB    TO  CL1-LIT.
277401000000           MOVE WS-STMT-DTA-RCNT-UB    TO  CL1-CNT1.
277501000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
277601000000
277701000000      *****
277801000000      *****    For each statement extract file, create the Delivery
277901000000      *****    Information record and print its Control Report write
278001000000      *****    values on a separate page.
278101000000      *****
278201000000
278301000000           SET ST                      TO  1.
278401000000           SET SW                      TO  1.
278501000000
278601000000       EJR-0010.
278701000000           IF  WS-STMT-WCNT (ST, SW)
278801000000                              IS EQUAL TO  ZEROES
278901000000               GO TO EJR-0020.
279001000000
279101000000           ADD 1                       TO  WS-STMT-WCNT (ST, SW).
279201000000           ADD 1                       TO  WS-STMT-WCNT-00 (ST, SW).
279301000000
279401000000           MOVE WS-STMT-WCNT (ST, SW)  TO  DI-RECORD-COUNT-TOT.
279501030821           MOVE WS-STMT-WCNT-00 (ST, SW) TO  DI-RECORD-COUNT-00.
279601030821           MOVE WS-STMT-WCNT-01 (ST, SW) TO  DI-RECORD-COUNT-01.
279701030821           MOVE WS-STMT-WCNT-05 (ST, SW) TO  DI-RECORD-COUNT-05.
279801030821           MOVE WS-STMT-WCNT-10 (ST, SW) TO  DI-RECORD-COUNT-10.
279901030821RF8633     MOVE WS-STMT-WCNT-12 (ST, SW) TO  DI-RECORD-COUNT-12.
280001030821           MOVE WS-STMT-WCNT-15 (ST, SW) TO  DI-RECORD-COUNT-15.
280101030821R18091     MOVE WS-STMT-WCNT-17 (ST, SW) TO  DI-RECORD-COUNT-17.
280201030821           MOVE WS-STMT-WCNT-20 (ST, SW) TO  DI-RECORD-COUNT-20.
280301060615R35042     MOVE WS-STMT-WCNT-21 (ST, SW) TO  DI-RECORD-COUNT-21.
280401130409117038     MOVE WS-STMT-WCNT-22 (ST, SW) TO  DI-RECORD-COUNT-22.
280501030821RF8633     MOVE WS-STMT-WCNT-25 (ST, SW) TO  DI-RECORD-COUNT-25.
280601030821           MOVE WS-STMT-WCNT-30 (ST, SW) TO  DI-RECORD-COUNT-30.
280701040406R20870     MOVE WS-STMT-WCNT-33 (ST, SW) TO  DI-RECORD-COUNT-33.
280801030821           MOVE WS-STMT-WCNT-35 (ST, SW) TO  DI-RECORD-COUNT-35.
280901040406R20870     MOVE WS-STMT-WCNT-38 (ST, SW) TO  DI-RECORD-COUNT-38.
281001030821RF8558     MOVE WS-STMT-WCNT-40 (ST, SW) TO  DI-RECORD-COUNT-40.
281101030821           MOVE WS-STMT-WCNT-43 (ST, SW) TO  DI-RECORD-COUNT-43.
281201030821RF8558     MOVE WS-STMT-WCNT-45 (ST, SW) TO  DI-RECORD-COUNT-45.
281301030821           MOVE WS-STMT-WCNT-50 (ST, SW) TO  DI-RECORD-COUNT-50.
281401030821           MOVE WS-STMT-WCNT-60 (ST, SW) TO  DI-RECORD-COUNT-60.
281501030821           MOVE WS-STMT-WCNT-62 (ST, SW) TO  DI-RECORD-COUNT-62.
281601091123R69515     MOVE WS-STMT-WCNT-63 (ST, SW) TO  DI-RECORD-COUNT-63.
281701030821           MOVE WS-STMT-WCNT-65 (ST, SW) TO  DI-RECORD-COUNT-65.
281801030821           MOVE WS-STMT-WCNT-67 (ST, SW) TO  DI-RECORD-COUNT-67.
281901030821           MOVE WS-STMT-WCNT-70 (ST, SW) TO  DI-RECORD-COUNT-70.
282001030821           MOVE WS-STMT-WCNT-80 (ST, SW) TO  DI-RECORD-COUNT-80.
282101030821           MOVE WS-STMT-WCNT-82 (ST, SW) TO  DI-RECORD-COUNT-82.
282201030821           MOVE WS-STMT-WCNT-84 (ST, SW) TO  DI-RECORD-COUNT-84.
282301030821RF8633     MOVE WS-STMT-WCNT-90 (ST, SW) TO  DI-RECORD-COUNT-90.
282401030821           MOVE WS-STMT-WCNT-UN (ST, SW) TO  DI-NO-OF-UNITS.
282501030821           MOVE WS-STMT-WCNT-UP (ST, SW) TO  DI-UNIT-PRICE.
282601030821           MOVE WS-STMT-WCNT-MV (ST, SW) TO  DI-MARKET-VALUE.
282701030821           MOVE WS-STMT-WCNT-BV (ST, SW) TO  DI-BOOK-VALUE.
282801030821           MOVE WS-STMT-WCNT-UB (ST, SW) TO  DI-UNIT-BALANCE.
282901000000
283001000000           MOVE DELIVERY-INFO-SECTION  TO  MFASTMTFP-SECTION.
283101000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
283201000000           SUBTRACT 1                FROM  WS-STMT-WCNT (ST, SW).
283301000000
283401000000       EJR-0020.
283501980609           IF  WS-LDA-ICS-FLAG
283601980609                          IS NOT EQUAL TO  "Y"
283701980609           AND SW             IS EQUAL TO  3
283801980609           AND WS-STMT-WCNT (ST, SW)
283901980609                              IS EQUAL TO  ZEROES
284001980609               GO TO EJR-0030.
284101980609
284201980609           IF  WS-LDA-ICS-FLAG
284301980609                          IS NOT EQUAL TO  "Y"
284401980609           AND SW             IS EQUAL TO  6
284501980609           AND WS-STMT-WCNT (ST, SW)
284601980609                              IS EQUAL TO  ZEROES
284701980609               GO TO EJR-0030.
284801980609
284901000000           MOVE 99                     TO  WS-LNECNT.
285001000000
285101000000           SET SH                      TO  ST.
285201000000           SET SL                      TO  SW.
285301000000           MOVE SPACES                 TO  CONTROL-LINE-1.
285401000000           MOVE WS-STMT-HLIT (SH, SL)  TO  CONTROL-LINE-1.
285501000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
285601000000
285701000000           MOVE SPACES                 TO  CONTROL-LINE-1.
285801000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
285901000000
286001000000           MOVE SPACES                 TO  CONTROL-LINE-1.
286101000000           MOVE WS-STMT-WLIT           TO  CL1-LIT.
286201000000           MOVE WS-STMT-WCNT (ST, SW)  TO  CL1-CNT.
286301000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
286401000000
286501000000           MOVE SPACES                 TO  CONTROL-LINE-1.
286601000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
286701000000
286801000000           MOVE SPACES                 TO  CONTROL-LINE-1.
286901000000           MOVE WS-STMT-WLIT-00        TO  CL1-LIT.
287001000000           MOVE WS-STMT-WCNT-00 (ST, SW)
287101000000                                       TO  CL1-CNT.
287201000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
287301000000
287401000000           MOVE SPACES                 TO  CONTROL-LINE-1.
287501000000           MOVE WS-STMT-WLIT-01        TO  CL1-LIT.
287601000000           MOVE WS-STMT-WCNT-01 (ST, SW)
287701000000                                       TO  CL1-CNT.
287801000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
287901000000
288001000000           MOVE SPACES                 TO  CONTROL-LINE-1.
288101000000           MOVE WS-STMT-WLIT-05        TO  CL1-LIT.
288201000000           MOVE WS-STMT-WCNT-05 (ST, SW)
288301000000                                       TO  CL1-CNT.
288401000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
288501000000
288601000000           MOVE SPACES                 TO  CONTROL-LINE-1.
288701000000           MOVE WS-STMT-WLIT-10        TO  CL1-LIT.
288801000000           MOVE WS-STMT-WCNT-10 (ST, SW)
288901000000                                       TO  CL1-CNT.
289001000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
289101000000
289201010307RF8633     IF  WS-STMT-DTA-RCNT-12 IS GREATER THAN  ZEROES
289301010307               MOVE SPACES             TO  CONTROL-LINE-1
289401060615R35042*        MOVE WS-STMT-DTA-RLIT-12 TO  CL1-LIT
289501060615  ¦   *        MOVE WS-STMT-DTA-RCNT-12 TO  CL1-CNT
289601060615  V            MOVE WS-STMT-WLIT-12 TO  CL1-LIT
289701060619R35042         MOVE WS-STMT-WCNT-12 (ST, SW) TO  CL1-CNT
289801010307               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
289901010307RF8633     END-IF
290001010307
290101000000           IF  WS-STMT-DTA-RCNT-15
290201000000                          IS GREATER THAN  ZEROES
290301000000               MOVE SPACES             TO  CONTROL-LINE-1
290401000000               MOVE WS-STMT-WLIT-15    TO  CL1-LIT
290501000000               MOVE WS-STMT-WCNT-15 (ST, SW)
290601000000                                       TO  CL1-CNT
290701000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
290801000000
290901030821R18091     IF  WS-STMT-DTA-RCNT-17 > ZEROES
291001030821  |            MOVE SPACES                   TO  CONTROL-LINE-1
291101030821  |            MOVE WS-STMT-WLIT-17          TO  CL1-LIT
291201030821  |            MOVE WS-STMT-WCNT-17 (ST, SW) TO  CL1-CNT
291301030821  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
291401030821
291501000000           MOVE SPACES                 TO  CONTROL-LINE-1.
291601000000           MOVE WS-STMT-WLIT-20        TO  CL1-LIT.
291701000000           MOVE WS-STMT-WCNT-20 (ST, SW)
291801000000                                       TO  CL1-CNT.
291901000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
292001010321
292101060615R35042     IF  WS-STMT-DTA-RCNT-21
292201060615  ¦                       IS GREATER THAN  ZEROES
292301060615  ¦            MOVE SPACES             TO  CONTROL-LINE-1
292401060615  ¦            MOVE WS-STMT-WLIT-21    TO  CL1-LIT
292501060615  ¦            MOVE WS-STMT-WCNT-21 (ST, SW)
292601060615  ¦                                    TO  CL1-CNT
292701060615  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
292801060615R35042     END-IF
292901060615
293001130408117038     IF  WS-STMT-DTA-RCNT-22
293101130408117038                    IS GREATER THAN  ZEROES
293201130408117038         MOVE SPACES             TO  CONTROL-LINE-1
293301130408117038         MOVE WS-STMT-WLIT-22    TO  CL1-LIT
293401130408117038         MOVE WS-STMT-WCNT-22 (ST, SW)
293501130408117038                                 TO  CL1-CNT
293601130408117038         PERFORM PRINT-CTL-LINE THRU PCL-EXIT
293701130408117038     END-IF
293801130408
293901010321RF8633     IF  WS-STMT-DTA-RCNT-25
294001010321                          IS GREATER THAN  ZEROES
294101010321               MOVE SPACES             TO  CONTROL-LINE-1
294201010321               MOVE WS-STMT-WLIT-25    TO  CL1-LIT
294301010321               MOVE WS-STMT-WCNT-25 (ST, SW)
294401010321                                       TO  CL1-CNT
294501010321               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
294601010321           END-IF
294701010321
294801000515
294901000515RF7051     IF  WS-STMT-DTA-RCNT-30
295001000515                          IS GREATER THAN  ZEROES
295101000515               MOVE SPACES             TO  CONTROL-LINE-1
295201000515               MOVE WS-STMT-WLIT-30    TO  CL1-LIT
295301000515               MOVE WS-STMT-WCNT-30 (ST, SW)
295401000515                                       TO  CL1-CNT
295501000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
295601000515           END-IF
295701000000
295801040406R20870     IF  WS-STMT-DTA-RCNT-33
295901040406                          IS GREATER THAN  ZEROES
296001040406               MOVE SPACES             TO  CONTROL-LINE-1
296101040406               MOVE WS-STMT-WLIT-33    TO  CL1-LIT
296201040406               MOVE WS-STMT-WCNT-33 (ST, SW)
296301040406                                       TO  CL1-CNT
296401040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
296501040406           END-IF
296601040406
296701000515RF7051     IF  WS-STMT-DTA-RCNT-35
296801000515                          IS GREATER THAN  ZEROES
296901000515               MOVE SPACES             TO  CONTROL-LINE-1
297001000515               MOVE WS-STMT-WLIT-35    TO  CL1-LIT
297101000515               MOVE WS-STMT-WCNT-35 (ST, SW)
297201000515                                       TO  CL1-CNT
297301000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
297401000515           END-IF
297501000515
297601040406R20870     IF  WS-STMT-DTA-RCNT-38
297701040406                          IS GREATER THAN  ZEROES
297801040406               MOVE SPACES             TO  CONTROL-LINE-1
297901040406               MOVE WS-STMT-WLIT-38    TO  CL1-LIT
298001040406               MOVE WS-STMT-WCNT-38 (ST, SW)
298101040406                                       TO  CL1-CNT
298201040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
298301040406           END-IF
298401040406
298501010124RF8558     IF  WS-STMT-DTA-RCNT-40
298601010124                          IS GREATER THAN  ZEROES
298701010124               MOVE SPACES             TO  CONTROL-LINE-1
298801010124               MOVE WS-STMT-WLIT-40    TO  CL1-LIT
298901010124               MOVE WS-STMT-WCNT-40 (ST, SW)
299001010124                                       TO  CL1-CNT
299101010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
299201010124           END-IF
299301010124
299401010124           IF  WS-STMT-DTA-RCNT-43
299501010124                          IS GREATER THAN  ZEROES
299601010124               MOVE SPACES             TO  CONTROL-LINE-1
299701010124               MOVE WS-STMT-WLIT-43    TO  CL1-LIT
299801010124               MOVE WS-STMT-WCNT-43 (ST, SW)
299901010124                                       TO  CL1-CNT
300001010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
300101010124           END-IF
300201010124
300301010124           IF  WS-STMT-DTA-RCNT-45
300401010124                          IS GREATER THAN  ZEROES
300501010124               MOVE SPACES             TO  CONTROL-LINE-1
300601010124               MOVE WS-STMT-WLIT-45    TO  CL1-LIT
300701010124               MOVE WS-STMT-WCNT-45 (ST, SW)
300801010124                                       TO  CL1-CNT
300901010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
301001010125RF8558     END-IF
301101010124
301201000000           IF  WS-STMT-DTA-RCNT-50
301301000000                          IS GREATER THAN  ZEROES
301401000000               MOVE SPACES             TO  CONTROL-LINE-1
301501000000               MOVE WS-STMT-WLIT-50    TO  CL1-LIT
301601000000               MOVE WS-STMT-WCNT-50 (ST, SW)
301701000000                                       TO  CL1-CNT
301801000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
301901000000
302001000000           IF  WS-STMT-DTA-RCNT-60
302101000000                          IS GREATER THAN  ZEROES
302201000000               MOVE SPACES             TO  CONTROL-LINE-1
302301000000               MOVE WS-STMT-WLIT-60    TO  CL1-LIT
302401000000               MOVE WS-STMT-WCNT-60 (ST, SW)
302501000000                                       TO  CL1-CNT
302601000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
302701971026
302801981218           IF  WS-STMT-DTA-RCNT-62
302901981218                          IS GREATER THAN  ZEROES
303001981218               MOVE SPACES             TO  CONTROL-LINE-1
303101981218               MOVE WS-STMT-WLIT-62    TO  CL1-LIT
303201981218               MOVE WS-STMT-WCNT-62 (ST, SW)
303301981218                                       TO  CL1-CNT
303401981218               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
303501981218
303601091119R69515     IF  WS-STMT-DTA-RCNT-63
303701091119  ¦                       IS GREATER THAN  ZEROES
303801091119  ¦            MOVE SPACES             TO  CONTROL-LINE-1
303901091119  ¦            MOVE WS-STMT-WLIT-63    TO  CL1-LIT
304001091119  ¦            MOVE WS-STMT-WCNT-63 (ST, SW)
304101091119  ¦                                    TO  CL1-CNT
304201091119  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
304301091119R69515     END-IF
304401091119
304501980519           IF  WS-STMT-DTA-RCNT-65
304601980519                          IS GREATER THAN  ZEROES
304701980519               MOVE SPACES             TO  CONTROL-LINE-1
304801980519               MOVE WS-STMT-WLIT-65    TO  CL1-LIT
304901980519               MOVE WS-STMT-WCNT-65 (ST, SW)
305001980519                                       TO  CL1-CNT
305101980519               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
305201980519
305301000515RF7051     IF  WS-STMT-DTA-RCNT-67
305401000515                          IS GREATER THAN  ZEROES
305501000515               MOVE SPACES             TO  CONTROL-LINE-1
305601000515               MOVE WS-STMT-WLIT-67    TO  CL1-LIT
305701000515               MOVE WS-STMT-WCNT-67 (ST, SW)
305801000515                                       TO  CL1-CNT
305901000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
306001000515           END-IF
306101000515
306201971026           IF  WS-STMT-DTA-RCNT-70
306301971026                          IS GREATER THAN  ZEROES
306401971026               MOVE SPACES             TO  CONTROL-LINE-1
306501971026               MOVE WS-STMT-WLIT-70    TO  CL1-LIT
306601971026               MOVE WS-STMT-WCNT-70 (ST, SW)
306701971026                                       TO  CL1-CNT
306801971026               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
306901000000
307001000000           MOVE SPACES                 TO  CONTROL-LINE-1.
307101000000           MOVE WS-STMT-WLIT-80        TO  CL1-LIT.
307201000000           MOVE WS-STMT-WCNT-80 (ST, SW)
307301000000                                       TO  CL1-CNT.
307401000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
307501000000
307601000000           IF  WS-STMT-DTA-RCNT-82
307701000000                          IS GREATER THAN  ZEROES
307801000000               MOVE SPACES             TO  CONTROL-LINE-1
307901000000               MOVE WS-STMT-WLIT-82    TO  CL1-LIT
308001000000               MOVE WS-STMT-WCNT-82 (ST, SW)
308101000000                                       TO  CL1-CNT
308201000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
308301000000
308401000515RF7051     IF  WS-STMT-DTA-RCNT-84
308501000515                          IS GREATER THAN  ZEROES
308601000515               MOVE SPACES             TO  CONTROL-LINE-1
308701000515               MOVE WS-STMT-WLIT-84    TO  CL1-LIT
308801000515               MOVE WS-STMT-WCNT-84 (ST, SW)
308901000515                                       TO  CL1-CNT
309001000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
309101000515           END-IF
309201000515
309301010125RF8558     IF  WS-STMT-DTA-RCNT-90
309401010125                          IS GREATER THAN  ZEROES
309501010125               MOVE SPACES             TO  CONTROL-LINE-1
309601010125               MOVE WS-STMT-WLIT-90    TO  CL1-LIT
309701010125               MOVE WS-STMT-WCNT-90 (ST, SW)
309801010125                                       TO  CL1-CNT
309901010125               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
310001010125           END-IF
310101010125
310201031106R18312     IF  WS-STMT-DTA-RCNT-CLTHLD
310301031106  ¦                       IS GREATER THAN  ZEROES
310401031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
310501031106  ¦            MOVE WS-STMT-WLIT-CLTHLD TO  CL1-LIT
310601031106  ¦            MOVE WS-STMT-WCNT-CLTHLD (ST, SW)
310701031106  ¦                                    TO  CL1-CNT
310801031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
310901031106R18312     END-IF
311001031106
311101031106R18312     IF  WS-STMT-DTA-RCNT-NOMHLD
311201031106  ¦                       IS GREATER THAN  ZEROES
311301031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
311401031106  ¦            MOVE WS-STMT-WLIT-NOMHLD TO  CL1-LIT
311501031106  ¦            MOVE WS-STMT-WCNT-NOMHLD (ST, SW)
311601031106  ¦                                    TO  CL1-CNT
311701031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
311801031106R18312     END-IF
311901031106
312001031106R18312     IF  WS-STMT-DTA-RCNT-ENG
312101031106  ¦                       IS GREATER THAN  ZEROES
312201031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
312301031106  ¦            MOVE WS-STMT-WLIT-ENG    TO  CL1-LIT
312401031106  ¦            MOVE WS-STMT-WCNT-ENG    (ST, SW)
312501031106  ¦                                    TO  CL1-CNT
312601031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
312701031106R18312     END-IF
312801031106
312901031106R18312     IF  WS-STMT-DTA-RCNT-ENGHLD
313001031106  ¦                       IS GREATER THAN  ZEROES
313101031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
313201031106  ¦            MOVE WS-STMT-WLIT-ENGHLD TO  CL1-LIT
313301031106  ¦            MOVE WS-STMT-WCNT-ENGHLD (ST, SW)
313401031106  ¦                                    TO  CL1-CNT
313501031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
313601031106R18312     END-IF
313701031106
313801031106R18312     IF  WS-STMT-DTA-RCNT-FRN
313901031106  ¦                       IS GREATER THAN  ZEROES
314001031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
314101031106  ¦            MOVE WS-STMT-WLIT-FRN    TO  CL1-LIT
314201031106  ¦            MOVE WS-STMT-WCNT-FRN    (ST, SW)
314301031106  ¦                                    TO  CL1-CNT
314401031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
314501031106R18312     END-IF
314601031106
314701031106R18312     IF  WS-STMT-DTA-RCNT-FRNHLD
314801031106  ¦                       IS GREATER THAN  ZEROES
314901031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
315001031106  ¦            MOVE WS-STMT-WLIT-FRNHLD TO  CL1-LIT
315101031106  ¦            MOVE WS-STMT-WCNT-FRNHLD (ST, SW)
315201031106  ¦                                    TO  CL1-CNT
315301031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
315401031106R18312     END-IF
315501031106
315601031124R18312     IF  WS-STMT-DTA-RCNT-ACCTOT
315701031124  ¦                       IS GREATER THAN  ZEROES
315801031124  ¦            MOVE SPACES             TO  CONTROL-LINE-1
315901031124  ¦            MOVE WS-STMT-WLIT-ACCTOT TO  CL1-LIT
316001031124  ¦            MOVE WS-STMT-WCNT-ACCTOT (ST, SW)
316101031124  ¦                                    TO  CL1-CNT
316201031124  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
316301031124R18312     END-IF
316401031124
316501000000           MOVE SPACES                 TO  CONTROL-LINE-1.
316601000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
316701000000
316801000000           MOVE SPACES                 TO  CONTROL-LINE-1.
316901000000           MOVE WS-STMT-WLIT-UN        TO  CL1-LIT.
317001000000           MOVE WS-STMT-WCNT-UN (ST, SW)
317101000000                                       TO  CL1-CNT.
317201000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
317301000000
317401000000           MOVE SPACES                 TO  CONTROL-LINE-1.
317501000000           MOVE WS-STMT-WLIT-UP        TO  CL1-LIT.
317601000000           MOVE WS-STMT-WCNT-UP (ST, SW)
317701000000                                       TO  CL1-CNT.
317801000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
317901000000
318001000000           MOVE SPACES                 TO  CONTROL-LINE-1.
318101000000           MOVE WS-STMT-WLIT-MV        TO  CL1-LIT.
318201000000           MOVE WS-STMT-WCNT-MV (ST, SW)
318301000000                                       TO  CL1-CNT.
318401000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
318501000000
318601000000           MOVE SPACES                 TO  CONTROL-LINE-1.
318701000000           MOVE WS-STMT-WLIT-BV        TO  CL1-LIT.
318801000000           MOVE WS-STMT-WCNT-BV (ST, SW)
318901000000                                       TO  CL1-CNT.
319001000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
319101000000
319201000000           MOVE SPACES                 TO  CONTROL-LINE-1.
319301000000           MOVE WS-STMT-WLIT-UB        TO  CL1-LIT.
319401000000           MOVE WS-STMT-WCNT-UB (ST, SW)
319501000000                                       TO  CL1-CNT.
319601000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
319701000000
319801980609       EJR-0030.
319901000000           IF  SW            IS LESS THAN  WS-SW-MAX
320001000000               SET SW               UP BY  1
320101000000               GO TO EJR-0010.
320201000000
320301971028      *****
320401971028      *****    NOTE:   The following were previously for AIC only.  For
320501971028      *****            the time being, AIC will only be producing an
320601971028      *****            English and an English Hold Mail file, therefore
320701971028      *****            the lines been commented out.
320801971028      *****
320901971028      *****
321001971028      *****IF  WS-LDA-ALLTYP  IS EQUAL TO  "I"
321101971028      *****AND WS-LDA-MGMT-COM-CDE
321201971028      *****                   IS EQUAL TO  "AIC"
321301971028      *****AND ST            IS LESS THAN  WS-ST-MAX
321401971028      *****    SET ST               UP BY  1
321501971028      *****    SET SW                  TO  1
321601971028      *****    GO TO EJR-0010.
321701980602
321801000000      *****
321901000000      *****    Close all the files.
322001000000      *****
322101000000
322201000000           CLOSE           STMT-DTA-FILE
322301000000                           STMT-ENG-FILE
322401000000                           STMT-ENGHLD-FILE
322501000000                           STMT-FRN-FILE
322601000000                           STMT-FRNHLD-FILE
322701000000                           PRINT-FILE.
322801000000
322901971028      *****
323001971028      *****    NOTE:   The following were previously for AIC only.  For
323101971028      *****            the time being, AIC will only be producing an
323201971028      *****            English and an English Hold Mail file, therefore
323301971028      *****            the lines are being bypassed.
323401971028      *****
323501971028
323601971028           IF  WS-LDA-MGMT-COM-CDE
323701971028                              IS EQUAL TO  "AIC"
323801971028               GO TO EJR-EXIT.
323901971028
324001971028           IF  WS-LDA-ALLTYP  IS EQUAL TO  "I"
324101971028           AND WS-LDA-MGMT-COM-CDE
324201971028                              IS EQUAL TO  "AIC"
324301971028               CLOSE           STMT-ENGF-FILE
324401971028                               STMT-ENGHLDF-FILE
324501971028                               STMT-ENGU-FILE
324601971028                               STMT-ENGHLDU-FILE
324701971028                               STMT-FRNF-FILE
324801971028                               STMT-FRNHLDF-FILE
324901971028                               STMT-FRNU-FILE
325001971028                               STMT-FRNHLDU-FILE.
325101000000
325201120706      * RFS 103229 - Start
325301120730           IF (WS-LDA-CPYSELECT = "D"  OR "R")
325401120706               CLOSE     DEALER
325501120706                         INSTITUTION-BRANCH
325601120706                         INST-ADDRESS
325701120706           END-IF.
325801120706
325901120706           IF WS-LDA-CPYSELECT  = "R"
326001120706               CLOSE     DEALER-REP
326101121012115141                   REP-ADDRESS
326201120706           END-IF.
326301120706      * RFS 103229 - End
326401120706
326501000000       EJR-EXIT.
326601000000           EXIT.
326701000000      /
326801000000       WRITE-RECORD-RTN.
326901000000
327001000000      ******************************************************************
327101000000      *                                                                *
327201000000      *    W R I T E   R E C O R D   R O U T I N E                     *
327301000000      *                                                                *
327401000000      ******************************************************************
327501000000
327601000000      *****
327701000000      *****    Format and write the statement conversion record(s) based
327801000000      *****    on the passed statement record type and switch.
327901000000      *****
328001000000      *****      Type (ST)
328101000000      *****        "1":  Canadian
328201000000      *****        "2":  American
328301000000      *****        "3":  Foreign
328401000000      *****
328501000000      *****      Switch (SW)
328601990519      *****        "1":  English statement only(including ICS).
328701000000      *****        "2":  English Hold Mail statement only.
328801990519      *****        "4":  French statement only(including ICS).
328901980609      *****        "5":  French Hold Mail statement only.
329001000000      *****
329101000000
329201000000           IF  ST         IS NOT EQUAL TO  1
329301000000               GO TO WRR-0050.
329401000000
329501000000      *****
329601000000      *****    Canadian
329701000000      *****
329801000000
329901000000           IF  SW         IS NOT EQUAL TO  1
330001000000               GO TO WRR-0010.
330101000000
330201000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENG-REC.
330301000000           WRITE STMT-ENG-REC.
330401000000           GO TO WRR-0040.
330501000000
330601000000       WRR-0010.
330701000000           IF  SW         IS NOT EQUAL TO  2
330801990519               GO TO WRR-0020.
330901980603
331001000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGHLD-REC.
331101000000           WRITE STMT-ENGHLD-REC.
331201000000           GO TO WRR-0040.
331301980609
331401000000       WRR-0020.
331501980609           IF  SW         IS NOT EQUAL TO  4
331601000000               GO TO WRR-0030.
331701000000
331801000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRN-REC.
331901130611118366     MOVE "F" TO STMT-FRN-REC(27:1).
332001000000           WRITE STMT-FRN-REC.
332101000000           GO TO WRR-0040.
332201000000
332301000000       WRR-0030.
332401980609           IF  SW         IS NOT EQUAL TO  5
332501990519               GO TO WRR-0040.
332601980609
332701000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNHLD-REC.
332801130611118366     MOVE "F" TO STMT-FRNHLD-REC(27:1).
332901000000           WRITE STMT-FRNHLD-REC.
333001980602
333101000000       WRR-0040.
333201000000           GO TO WRR-0150.
333301000000
333401000000       WRR-0050.
333501000000           IF  ST         IS NOT EQUAL TO  2
333601000000               GO TO WRR-0100.
333701980520
333801000000      *****
333901000000      *****    American
334001000000      *****
334101000000
334201000000           IF  SW         IS NOT EQUAL TO  1
334301000000               GO TO WRR-0060.
334401000000
334501000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGU-REC.
334601000000           WRITE STMT-ENGU-REC.
334701000000           GO TO WRR-0090.
334801000000
334901000000       WRR-0060.
335001000000           IF  SW         IS NOT EQUAL TO  2
335101000000               GO TO WRR-0070.
335201000000
335301000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGHLDU-REC.
335401000000           WRITE STMT-ENGHLDU-REC.
335501000000           GO TO WRR-0090.
335601000000
335701000000       WRR-0070.
335801980609           IF  SW         IS NOT EQUAL TO  4
335901000000               GO TO WRR-0080.
336001000000
336101000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNU-REC.
336201000000           WRITE STMT-FRNU-REC.
336301000000           GO TO WRR-0090.
336401000000
336501000000       WRR-0080.
336601980609           IF  SW         IS NOT EQUAL TO  5
336701980609               GO TO WRR-0090.
336801980609
336901000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNHLDU-REC.
337001000000           WRITE STMT-FRNHLDU-REC.
337101000000
337201000000       WRR-0090.
337301000000           GO TO WRR-0150.
337401000000
337501000000       WRR-0100.
337601980520
337701000000      *****
337801000000      *****    Foreign
337901000000      *****
338001000000
338101000000           IF  SW         IS NOT EQUAL TO  1
338201000000               GO TO WRR-0110.
338301000000
338401000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGF-REC.
338501000000           WRITE STMT-ENGF-REC.
338601000000           GO TO WRR-0140.
338701000000
338801000000       WRR-0110.
338901000000           IF  SW         IS NOT EQUAL TO  2
339001000000               GO TO WRR-0120.
339101000000
339201000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGHLDF-REC.
339301000000           WRITE STMT-ENGHLDF-REC.
339401000000           GO TO WRR-0140.
339501000000
339601000000       WRR-0120.
339701980609           IF  SW         IS NOT EQUAL TO  4
339801000000               GO TO WRR-0130.
339901000000
340001000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNF-REC.
340101000000           WRITE STMT-FRNF-REC.
340201000000           GO TO WRR-0140.
340301000000
340401000000       WRR-0130.
340501980609           IF  SW         IS NOT EQUAL TO  5
340601980609               GO TO WRR-0140.
340701980609
340801000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNHLDF-REC.
340901000000           WRITE STMT-FRNHLDF-REC.
341001000000
341101000000       WRR-0140.
341201000000           GO TO WRR-0150.
341301000000
341401000000       WRR-0150.
341501000000
341601000000      *****
341701000000      *****    Increment the total number of records written to the
341801000000      *****    statement extract file.
341901000000      *****
342001000000
342101000000           ADD 1                       TO  WS-STMT-WCNT (ST, SW).
342201000000
342301000000       WRR-EXIT.
342401000000           EXIT.
342501000000      /
342601000000       PRINT-CTL-LINE.
342701000000
342801000000      ******************************************************************
342901000000      *                                                                *
343001000000      *    P R I N T   C O N T R O L   L I N E   R O U T I N E         *
343101000000      *                                                                *
343201000000      ******************************************************************
343301000000
343401000000      *****
343501000000      *****    If the page is full, start a new page and print the
343601000000      *****    Heading lines.
343701000000      *****
343801000000
343901000000           IF  WS-LNECNT  IS GREATER THAN  WS-LNEMAX
344001000000               PERFORM PRINT-HDG-LINE THRU PHL-EXIT.
344101000000
344201000000      *****
344301000000      *****    Print the Control line.
344401000000      *****
344501000000
344601000000           WRITE PRINT-REC           FROM  CONTROL-LINE-1
344701000000                         AFTER  ADVANCING  1.
344801000000           ADD 1                       TO  WS-LNECNT.
344901000000
345001000000       PCL-EXIT.
345101000000           EXIT.
345201000000      /
345301000000       PRINT-HDG-LINE.
345401000000
345501000000      ******************************************************************
345601000000      *                                                                *
345701000000      *    P R I N T   H E A D I N G   L I N E   R O U T I N E         *
345801000000      *                                                                *
345901000000      ******************************************************************
346001000000
346101000000      *****
346201000000      *****    Print Heading line 1 on a new page.
346301000000      *****
346401000000
346501000000           WRITE PRINT-REC           FROM  HEADING-LINE-1
346601000000                          AFTER ADVANCING  PAGE.
346701000000           ADD 1                       TO  WS-PGECNT.
346801000000           MOVE 1                      TO  WS-LNECNT.
346901000000
347001000000      *****
347101000000      *****    Format and print Heading line 2.
347201000000      *****
347301000000
347401000000           MOVE WS-PGECNT              TO  HL2-PGECNT.
347501000000
347601000000           WRITE PRINT-REC           FROM  HEADING-LINE-2
347701000000                          AFTER ADVANCING  1.
347801000000           ADD 1                       TO  WS-LNECNT.
347901000000
348001031120      *****
348101031120      *****    Format and print Heading line 2-H.
348201031120      *****
348301031120
348401031120           WRITE PRINT-REC           FROM  HEADING-LINE-2-H
348501031120                          AFTER ADVANCING  1.
348601031120           ADD 1                       TO  WS-LNECNT.
348701031120
348801000000      *****
348901000000      *****    Print Heading line 3, if required.
349001000000      *****
349101000000
349201000000           IF  WS-EOJHDG-SW   IS EQUAL TO  "Y"
349301000000               GO TO PHL-0010.
349401000000
349501000000           WRITE PRINT-REC           FROM  HEADING-LINE-3
349601000000                          AFTER ADVANCING  2.
349701000000           ADD 2                       TO  WS-LNECNT.
349801000000
349901000000       PHL-0010.
350001000000
350101000000      *****
350201000000      *****    Format and print a blank line.
350301000000      *****
350401000000
350501000000           MOVE SPACES                 TO  PRINT-REC.
350601000000           WRITE PRINT-REC
350701000000                          AFTER ADVANCING  1.
350801000000           ADD 1                       TO  WS-LNECNT.
350901000000
351001000000       PHL-EXIT.
351101000000           EXIT.
