000100000000       IDENTIFICATION DIVISION.
000200121001       PROGRAM-ID.     STMTCNV0.
000300000000       INSTALLATION.   Jewelstone Systems Inc.
000400000000       AUTHOR.         Jewelstone Systems Inc.
000500000000       DATE-WRITTEN.   June 25, 1997.
000600000000       DATE-COMPILED.
000700000000
000800000000      ******************************************************************
000900000000      *                                                                *
001000000000      *    STMTCNV:    Statement Conversion - Standard                 *
001100000000      *                                                                *
001200000000      *    PURPOSE:    To create multiple statement files, based on    *
001300000000      *                language and hold mail, from the original       *
001400000000      *                extract file.  Control totals will be           *
001500000000      *                accumulated and placed on the Delivery          *
001600000000      *                Information record.                             *
001700000000      *                                                                *
001800000000      *    LEVELS:      1. Investor Number                             *
001900000000      *                                                                *
002000000000      *    FILES:      (I) MFASTMEXP   Statement Data                  *
002100000000      *                (O) STMENG      Statement (CAN English)         *
002200000000      *                (O) STMENGF     Statement (FGN English)         *
002300000000      *                (O) STMENGHLD   Statement (CAN English Hold)    *
002400000000      *                (O) STMENGHLDF  Statement (FGN English Hold)    *
002500000000      *                (O) STMENGU     Statement (USA English)         *
002600000000      *                (O) STMENGHLDU  Statement (USA English Hold)    *
002700000000      *                (O) STMFRN      Statement (CAN French)          *
002800000000      *                (O) STMFRNF     Statement (FGN French)          *
002900000000      *                (O) STMFRNHLD   Statement (CAN French Hold)     *
003000000000      *                (O) STMFRNHLDF  Statement (FGN French Hold)     *
003100000000      *                (O) STMFRNU     Statement (USA French)          *
003200000000      *                (O) STMFRNHLDU  Statement (USA French Hold)     *
003300000000      *                (O) PRINTER     Control Report                  *
003400000000      *                                                                *
003500000000      *    CREATED:    16/JUL/97 (MFH)                                 *
003600990519      *    CHANGED:    16/MAY/99 (MFH)                                 *
003700000000      *                                                                *
003800000000      ******************************************************************
003900000000      /
004000000000      ******************************************************************
004100000000      *                                                                *
004200000000      *    C H A N G E   H I S T O R Y                                 *
004300000000      *                                                                *
004400000000      ******************************************************************
004500000000      ******************************************************************
004600000000      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
004700000000      ******************************************************************
004800971024      *M.Howorth   *  1997/10/24  * RFS LOG #1502, #1544, #1549        *
004900971026      *            *     thru     * - Modifications to use the new LDA *
005000971026      *            *  1997/10/26  *   copy book (CPYLDASTMT).          *
005100971026      *            *              * - Modifications to handle the new  *
005200971026      *            *              *   Systematic Plan Info record.     *
005300030508      ******************************************************************
005400971028      *M.Howorth   *  1997/10/28  * RFS LOG #1502, #1544, #1549        *
005500971028      *            *              * - Modifications to only produce an *
005600971028      *            *              *   ENGLISH and an ENGLISH HOLD MAIL *
005700971028      *            *              *   statement extract file file AIC. *
005800030508      ******************************************************************
005900980511      *H.SHENG     *  1998/05/11  * RFS LOG #2334                      *
006000980511      *            *              * - Modifications to change record   *
006100980511      *            *              *   length of MFASTMEXP from 650 to  *
006200980609      *            *              *   750                              *
006300980609      *            *              * - Modifications to add new record  *
006400980609      *            *              *   count for new "group" section.   *
006500980609      *            *              *   Modifications so when company    *
006600980609      *            *              *   is GGF program creates four files*
006700980609      *            *              *   Foreign and American is not      *
006800980609      *            *              *   created.                         *
006900030508      ******************************************************************
007000980604      *T.Hamid     *  1998/06/03  * RFS LOG #2334                      *
007100980604      *            *              * - Modifications to create English, *
007200980604      *            *              *   French file when GGF and DL-DELI *
007300980609      *            *              *   DL-DELIVERY-METHOD equal ICS.    *
007400030508      ******************************************************************
007500980609      * M.Howorth  *  1998/06/09  * RFS LOG #2334                      *
007600980609      *            *              * - Modifications to handling of the *
007700980609      *            *              *   ICS files.                       *
007800030508      ******************************************************************
007900981218      * H.SHENG    *  1998/12/18  * RFS 3527                           *
008000030508      ******************************************************************
008100990519      * H.SHENG    *  1999/05/19  * RFS 4662                           *
008200990519      *            *              * - Amalgamate the mail and ICS files*
008300030508      ******************************************************************
008400000222      * H.SHENG    *  2000/02/22  * RFS 6532 - EXPAND the length of   *
008500000222      *            *              * dealer rep from 5 to 6            *
008600030508      ******************************************************************
008700000515      * B.LU       *  2000/05/15  * RFS 7051 - Section 30, 35, 67,    *
008800000515      *            *              * AND 84 were processed.            *
008900030508      ******************************************************************
009000001011      * B.LU       *  2000/10/11  * RFS 7776 - AD-BOOK-VALUE was
009100001011      *            *              * renamed to AD-BOOK-VALUE-BASE.    *
009200030508      ******************************************************************
009300010125      * K.LIU      *  2001/01/25  * RFS 8558 - Section 40, 43, 45,
009400010125      *            *              * and 90 were processed.            *
009500030508      ******************************************************************
009600010321      * K.LIU      *  2001/03/07  * RFS 8633 - Section 12 and 25
009700010321      *            *              * was processed.
009800030508      ******************************************************************
009900010411      * Ping Fan   * 2001/04/09   * RFS 9964
010000010411      *            *              * - Amended 'AIC' specific code in
010100010411      *            *              *   UNITRAX to include 'TAI'.
010200030508      ******************************************************************
010300010525      * B.Lu       * 2001/05/25   * RFS 9523
010400010525      *            *              * If WS-LDA-HOLD-MAIL was set to "Y"
010500010525      *            *              * AIC's file system will be applied
010600010525      *            *              * for Confirm.                       *
010700030508      ******************************************************************
010800011022      * B.Lu       * 2001/10/22   * RFS10901, 11127, 10605
010900011022      *            *              * -Recompile only.
011000030508      ******************************************************************
011100011123      * A.ALNEMER  * 2001/11/23   * RFS12150
011200011123      *            *              * -Recompile only.
011300030508      ******************************************************************
011400020402      * B.Lu         2002/01/30   * RFS12102
011500020402      *            *              * -Recompile only.
011600030508      ******************************************************************
011700020326      * A.ALNEMER  * 2002/03/26   * RFS12173
011800020326      *            *              * -Recompile only.
011900030508      ******************************************************************
012000020404      * A.ALNEMER  * 2002/04/04   * RFS13184
012100020404      *            *              * -Recompile only.
012200030508      ******************************************************************
012300020416      * A.ALNEMER  * 2002/04/16   * RFS13211
012400020416      *            *              * -Recompile only.
012500030508      ******************************************************************
012600020614      * A.ALNEMER  * 2002/06/14   * RFS13756
012700020614      *            *              * -Recompile only.
012800030508      ******************************************************************
012900020821      * A.ALNEMER  * 2002/08/21   * RFS13955
013000020821      *            *              * -Recompile only.
013100030508      ******************************************************************
013200020821      * A.ALNEMER  * 2002/08/21   * RFS14136
013300020821      *            *              * -Recompile only.
013400030508      ******************************************************************
013500020925      * B.LU       * 2002/09/25   * RFS14556  Recompile.
013600030508      ******************************************************************
013700021202      * A.ALNEMER  * 2002/12/02   * RFS15022
013800021202      *            *              * -Recompile only.
013900030508      ******************************************************************
014000030327      * B.LU       * 2003/03/27   * RFS16256  Recompile.
014100030508      ******************************************************************
014200030327      * B.LU       * 2003/03/27   * RFS16633  Recompile.
014300000000      ******************************************************************
014400030623      * O.McMillan * 2003/06/17   * RFS17217  Recompile.
014500030623      ******************************************************************
014600030508      * Odette     * 2002/08/21   * RFS17165 - MFASTMEXP expanded from
014700030528      * McMillan   *              * 1100 to 1350. Change work areas as
014800030528      *            *              * well.
014900030508      ******************************************************************
015000030624      * Odette     * 2003/06/04   * RFS16881 - Recompile.
015100030624      * McMillan   *              *
015200030624      ******************************************************************
015300030821      * O.McMillan * 2003/08/21   * RFS18091  Add Section 17 (Account
015400030821      *            *              *           IPS Details).
015500030821      ******************************************************************
015600030825      * Odette     * 2003/08/25   * RFS17380  Recompile for additional
015700030825      * McMillan   *              * fields in Section 05 of CPYJSISTMT.
015800030825      ******************************************************************
015900031003      * Odette     * 2003/09/22   * RFS 18653 - Recompile.
016000031003      * McMillan   *              * Moved Section 17 rec counter field
016100031003      *            *              * in Section 99 to bottom of rec.
016200031003      ******************************************************************
016300031002      * B.LU       * 2003/10/02   * RFS17527  Recompile.
016400031002      ******************************************************************
016500031015      * ALI.A      * 2003/10/15   * RFS17626  Recompile.
016600031015      ******************************************************************
016700031020      * ALI.A      * 2003/10/20   * RFS18667  Recompile.
016800031020      ******************************************************************
016900031106      * ALI.A      * 2003/10/20   * RFS18312
017000031106      *            *              * Add two new counters for:
017100031106      *            *              * 1)Client-Held  Account.
017200031106      *            *              * 2)Nominee-Held Accounts.
017300031121      *            *              * 3)Client-English  Account.
017400031121      *            *              * 4)Client-English-Held  Account.
017500031121      *            *              * 5)Client-French Accounts.
017600031121      *            *              * 6)Client-French-Held Accounts.
017700031125      ******************************************************************
017800031125      * ALI.A      * 2003/11/21   * RFS18515  Recompile.
017900031125      ******************************************************************
018000031125      * ALI.A      * 2003/11/21   * RFS18814  Recompile.
018100031125      ******************************************************************
018200040217      * ALI.A      * 2004/02/17   * RFS19444  Recompile.
018300031119      ******************************************************************
018400040406      * ALI.A      * 2004/04/06   * RFS20870
018500040406      *            *              * Validate sections 33-38.
018600040406      ******************************************************************
018700040414      * ALI.A      * 2004/04/14   * RFS20758
018800040414      *            *              * RECOMPILE.
018900040414      ******************************************************************
019000040514      * Odette     *  2004/04/27  * RFS21714 - Recompile
019100040514      * Aguinaldo- *              * Add new fields to Section 10 to
019200040514      * McMillan   *              * indicate if Dealer, Rep or Nominee
019300040514      *            *              * is/isn't suppressed.
019400040531      ******************************************************************
019500040531      * Reece Tam  * 2004/05/31   * RFS20804  Recompile - CPYLADASTMT.
019600040514      ******************************************************************
019700040908      * B.LU       * 2004/09/08   * RFS18924 -RECOMPILE - CPYJSISTMT.
019800040908      ******************************************************************
019900041012      * B.LU       * 2004/10/12   * RFS22856 -RECOMPILE - CPYJSISTMT.
020000041012      ******************************************************************
020100041025      * ALI.A      * 2004/10/25   * RFS18780 -RECOMPILE - CPYJSISTMT.
020200041025      ******************************************************************
020300041028      * ALI.A      * 2004/10/28   * RFS21715 -RECOMPILE - CPYJSISTMT.
020400041028      ******************************************************************
020500041220      * B.LU       * 2004/12/20   * RFS24514 -RECOMPILE - CPYJSISTMT
020600041220      ******************************************************************
020700050429      * CHANDANA R * 2005/03/09   * RFS26213 -RECOMPILE - CPYJSISTMT
020800050429      ******************************************************************
020900051002      * ADE ADEYEMI* 2005/09/08   * RFS29550 -RECOMPILE - CPYJSISTMT
021000051002      ******************************************************************
021100051002      * ADE ADEYEMI* 2005/09/28   * RFS30065 -RECOMPILE - CPYJSISTMT
021200051002      ******************************************************************
021300050921      * Ali.A      * 2005/09/18   * RFS28931 -RECOMPILE - CPYJSISTMT
021400050920      ******************************************************************
021500050926      * C.LENTINI  * 2005/09/26   * RFS28692 -RECOMPILE - CPYJSISTMT
021600050926      ******************************************************************
021700050926      * GEETA S.   * 2005/09/15   * RFS 28107: RECOMPILE FOR CPYJSISTMT
021800050926      ******************************************************************
021900060628      * Esin A.    * 2006/03/23   * RFS 31514: RECOMPILE FOR CPYJSISTMT
022000060628      ******************************************************************
022100060628      * B.LU       * 2006/06/28   * RFS35042 -Process Section 21
022200060818      ******************************************************************
022300060818      * Raymond Mui* 2006/08/18   * RFS 34848: RECOMPILE FOR CPYJSISTMT
022400060821      *            *              *            and CPYLDASTMT.
022500060615      ******************************************************************
022600061026      * L. Wong    * 2006/10/24   * RFS36342 - Recompile - CPYJSISTMT,
022700061026      *            *              *                        CPYLDASTMT.
022800061026      *            *              * - Bug Fix: Do not display error for
022900061026      *            *              *   Section 99 (trailer record) since
023000061026      *            *              *   it is not an error.
023100061102      *            *              * - Bug Fix: Level 20 errors
023200061102      *            *              *   Table/array items not subscripted
023300080620      ******************************************************************
023400080620      * Bathuu L   * 2008/06/20   * RFS50993 -RECOMPILE - CPYJSISTMT
023500091111      ******************************************************************
023600091111      * Andy Lo    * 2009/11/11   * RFS69515 -RECOMPILE - CPYJSISTMT
023700091119      *            *              *           ADD SECTION 63
023800061026      ******************************************************************
023900100308      * A. Lo      * 2010/03/08   * RFS78161 -Recompile - CPYJSISTMT.
024000100308      ***************************************************************
024100100409      * A. Lo      * 2010/03/08   * RFS74626 -Recompile - CPYJSISTMT.
024200100308      ***************************************************************
024300120314      * A. CHAN    * 2012/03/14   * RFS93662 -Recompile - CPYJSISTMT.
024400120314      ***************************************************************
024500121001      * A. CHAN    * 2012/10/01   * RFS114051 - Save old pgm logic  .
024600121001      ***************************************************************
024700130408      * Andy Chan  * 2012/04/08   * RFS117038 Add Section 22
024800130408      ***************************************************************
024900130529      * NOBLE T    * 2013/05/29   * RFS121116-RECOMPILE - CPYLDASTMT.
025000130529      ***************************************************************
025100130905      * PRAVEEN E  * 2013/09/05   *RFS123925 RECOMPIL ONLY - CPYJSISTMT.
025200140519      * NOBLE T    * 2014/05/02   * RFS130239 - RECOMPILE - CPYJSISTMT.
025300140418      ***************************************************************
025400140418      *SANGEETHA V  * 2014/03/25 * RFS129378 - RECOMPILE FOR CPYJSISTMT*
025500150216      * POOJA K    * 2015/02/16  * RFS 143392 - RECOMPILE FOR CPYJSISTMT
025600150330      * POOJA K    * 2015/03/27  * RFS 144030 - RECOMPILE FOR CPYJSISTMT
025700150424      * POOJA K    * 2015/04/21  * RFS 142884 - RECOMPILE FOR CPYJSISTMT
025800150511      * POOJA K    * 2015/05/08  * RFS 144587 - RECOMPILE FOR CPYJSISTMT
025801211019      * Surendran C* 2021/10/19   * RFS186592 -RECOMPILE FOR CPYJSISTMT*
025900130905      ***************************************************************
026000000000      /
026100000000       ENVIRONMENT DIVISION.
026200000000
026300000000      ******************************************************************
026400000000      *                                                                *
026500000000      *    E N V I R O N M E N T   D I V I S I O N                     *
026600000000      *                                                                *
026700000000      ******************************************************************
026800000000
026900000000       CONFIGURATION SECTION.
027000000000
027100000000      ******************************************************************
027200000000      *                                                                *
027300000000      *    C O N F I G U R A T I O N   S E C T I O N                   *
027400000000      *                                                                *
027500000000      ******************************************************************
027600000000
027700000000       SOURCE-COMPUTER.    AS-400.
027800000000       OBJECT-COMPUTER.    AS-400.
027900000000
028000000000       SPECIAL-NAMES.
028100000000
028200000000      *****
028300000000      *****    Special Names.
028400000000      *****
028500000000
028600000000           LOCAL-DATA          IS  WS-LOCAL.
028700000000      /
028800000000       INPUT-OUTPUT SECTION.
028900000000
029000000000      ******************************************************************
029100000000      *                                                                *
029200000000      *    I N P U T   /   O U T P U T   S E C T I O N                 *
029300000000      *                                                                *
029400000000      ******************************************************************
029500000000
029600000000       FILE-CONTROL.
029700000000
029800000000      *****
029900000000      *****    FILE CONTROL.
030000000000      *****
030100000000      /
030200000000      ******************************************************************
030300000000      *                                                                *
030400000000      *    MFASTMTFP:  Statement Data                                  *
030500000000      *                                                                *
030600000000      ******************************************************************
030700000000
030800000000           SELECT  STMT-DTA-FILE
030900980610                   ASSIGN          TO  DATABASE-MFASTMEXP
031000980610                   ACCESS          IS  SEQUENTIAL.
031100000000
031200000000      ******************************************************************
031300000000      *                                                                *
031400000000      *    STMENG:     Statements (Canadian English)                   *
031500000000      *                                                                *
031600000000      ******************************************************************
031700000000
031800000000           SELECT  STMT-ENG-FILE
031900000000                   ASSIGN          TO  DATABASE-STMENG.
032000000000
032100000000      ******************************************************************
032200000000      *                                                                *
032300000000      *    STMENGF:    Statements (Foreign English)                    *
032400000000      *                                                                *
032500000000      ******************************************************************
032600000000
032700000000           SELECT  STMT-ENGF-FILE
032800000000                   ASSIGN          TO  DATABASE-STMENGF.
032900000000
033000000000      ******************************************************************
033100000000      *                                                                *
033200000000      *    STMENGHLD:  Statements (Canadian English Hold Mail)         *
033300000000      *                                                                *
033400000000      ******************************************************************
033500000000
033600000000           SELECT  STMT-ENGHLD-FILE
033700000000                   ASSIGN          TO  DATABASE-STMENGHLD.
033800000000
033900000000      ******************************************************************
034000000000      *                                                                *
034100000000      *    STMENGHLDF: Statements (Foreign English Hold Mail)          *
034200000000      *                                                                *
034300000000      ******************************************************************
034400000000
034500000000           SELECT  STMT-ENGHLDF-FILE
034600000000                   ASSIGN          TO  DATABASE-STMENGHLDF.
034700000000
034800000000      ******************************************************************
034900000000      *                                                                *
035000000000      *    STMENGU:    Statements (American English)                   *
035100000000      *                                                                *
035200000000      ******************************************************************
035300000000
035400000000           SELECT  STMT-ENGU-FILE
035500000000                   ASSIGN          TO  DATABASE-STMENGU.
035600000000
035700000000      ******************************************************************
035800000000      *                                                                *
035900000000      *    STMENGHLDU: Statements (American English Hold Mail)         *
036000000000      *                                                                *
036100000000      ******************************************************************
036200000000
036300000000           SELECT  STMT-ENGHLDU-FILE
036400000000                   ASSIGN          TO  DATABASE-STMENGHLDU.
036500000000
036600000000      ******************************************************************
036700000000      *                                                                *
036800000000      *    STMFRN:     Statements (Canadian French)                    *
036900000000      *                                                                *
037000000000      ******************************************************************
037100000000
037200000000           SELECT  STMT-FRN-FILE
037300000000                   ASSIGN          TO  DATABASE-STMFRN.
037400000000
037500000000      ******************************************************************
037600000000      *                                                                *
037700000000      *    STMFRNF:    Statements (Foreign French)                     *
037800000000      *                                                                *
037900000000      ******************************************************************
038000000000
038100000000           SELECT  STMT-FRNF-FILE
038200000000                   ASSIGN          TO  DATABASE-STMFRNF.
038300000000
038400000000      ******************************************************************
038500000000      *                                                                *
038600000000      *    STMFRNHLD:  Statements (Canadian French Hold Mail)          *
038700000000      *                                                                *
038800000000      ******************************************************************
038900000000
039000000000           SELECT  STMT-FRNHLD-FILE
039100000000                   ASSIGN          TO  DATABASE-STMFRNHLD.
039200000000
039300000000      ******************************************************************
039400000000      *                                                                *
039500000000      *    STMFRNHLDF: Statements (Foreign French Hold Mail)           *
039600000000      *                                                                *
039700000000      ******************************************************************
039800000000
039900000000           SELECT  STMT-FRNHLDF-FILE
040000000000                   ASSIGN          TO  DATABASE-STMFRNHLDF.
040100000000
040200000000      ******************************************************************
040300000000      *                                                                *
040400000000      *    STMFRNU:    Statements (American French)                    *
040500000000      *                                                                *
040600000000      ******************************************************************
040700000000
040800000000           SELECT  STMT-FRNU-FILE
040900000000                   ASSIGN          TO  DATABASE-STMFRNU.
041000000000
041100000000      ******************************************************************
041200000000      *                                                                *
041300000000      *    STMFRNHLDU: Statements (American French Hold Mail)          *
041400000000      *                                                                *
041500000000      ******************************************************************
041600000000
041700000000           SELECT  STMT-FRNHLDU-FILE
041800000000                   ASSIGN          TO  DATABASE-STMFRNHLDU.
041900000000
042000000000      ******************************************************************
042100000000      *                                                                *
042200000000      *    QPRINT:     Control Report                                  *
042300000000      *                                                                *
042400000000      ******************************************************************
042500000000
042600000000           SELECT  PRINT-FILE
042700000000                   ASSIGN          TO  PRINTER-QPRINT.
042800000000      /
042900000000       DATA DIVISION.
043000000000
043100000000      ******************************************************************
043200000000      *                                                                *
043300000000      *    D A T A   D I V I S I O N                                   *
043400000000      *                                                                *
043500000000      ******************************************************************
043600000000
043700000000       FILE SECTION.
043800000000
043900000000      ******************************************************************
044000000000      *                                                                *
044100000000      *    F I L E   S E C T I O N                                     *
044200000000      *                                                                *
044300000000      ******************************************************************
044400000000      /
044500000000      ******************************************************************
044600000000      *                                                                *
044700000000      *    MFASTMTFP:  Statement Data                                  *
044800000000      *                                                                *
044900000000      ******************************************************************
045000000000
045100000000       FD  STMT-DTA-FILE
045200000000           LABEL RECORDS      ARE  OMITTED.
045300000000
045400010307RF7503*01  STMT-DTA-REC                PICTURE X(850).
045500030528R17165 01  STMT-DTA-REC                PICTURE X(1350).
045600010307
045700000000      /
045800000000      ******************************************************************
045900000000      *                                                                *
046000000000      *    STMENG:     Statements (Canadian English)                   *
046100000000      *                                                                *
046200000000      ******************************************************************
046300000000
046400000000       FD  STMT-ENG-FILE
046500000000           LABEL RECORDS      ARE  STANDARD
046600010307RF7503*    RECORD CONTAINS    850  CHARACTERS.
046700030528R17165     RECORD CONTAINS    1350 CHARACTERS.
046800010307RF7503*01  STMT-ENG-REC                PICTURE X(850).
046900030528R17165 01  STMT-ENG-REC                PICTURE X(1350).
047000000000      /
047100000000      ******************************************************************
047200000000      *                                                                *
047300000000      *    STMENGF:    Statements (Foreign English)                    *
047400000000      *                                                                *
047500000000      ******************************************************************
047600000000
047700000000       FD  STMT-ENGF-FILE
047800000000           LABEL RECORDS      ARE  STANDARD
047900010307RF7503*    RECORD CONTAINS    850  CHARACTERS.
048000030528R17165     RECORD CONTAINS    1350 CHARACTERS.
048100010307RF7503*01  STMT-ENGF-REC               PICTURE X(850).
048200030528R17165 01  STMT-ENGF-REC               PICTURE X(1350).
048300000000      /
048400000000      ******************************************************************
048500000000      *                                                                *
048600000000      *    STMENGHLD:  Statements (Canadian English Hold Mail)         *
048700000000      *                                                                *
048800000000      ******************************************************************
048900000000
049000000000       FD  STMT-ENGHLD-FILE
049100000000           LABEL RECORDS      ARE  STANDARD
049200010307      *    RECORD CONTAINS    850  CHARACTERS.
049300030528R17165     RECORD CONTAINS    1350 CHARACTERS.
049400000000
049500010307      *01  STMT-ENGHLD-REC            PICTURE X(850).
049600030528R17165 01  STMT-ENGHLD-REC            PICTURE X(1350).
049700000000      /
049800000000      ******************************************************************
049900000000      *                                                                *
050000000000      *    STMENGHLDF: Statements (Foreign English Hold Mail)          *
050100000000      *                                                                *
050200000000      ******************************************************************
050300000000
050400000000       FD  STMT-ENGHLDF-FILE
050500000000           LABEL RECORDS      ARE  STANDARD
050600010307      *    RECORD CONTAINS    850  CHARACTERS.
050700030528R17165     RECORD CONTAINS    1350 CHARACTERS.
050800000000
050900010307      *01  STMT-ENGHLDF-REC           PICTURE X(850).
051000030528R17165 01  STMT-ENGHLDF-REC           PICTURE X(1350).
051100000000      /
051200000000      ******************************************************************
051300000000      *                                                                *
051400000000      *    STMENGU:    Statements (American English)                   *
051500000000      *                                                                *
051600000000      ******************************************************************
051700000000
051800000000       FD  STMT-ENGU-FILE
051900000000           LABEL RECORDS      ARE  STANDARD
052000010307      *    RECORD CONTAINS    850  CHARACTERS.
052100030528R17165     RECORD CONTAINS    1350 CHARACTERS.
052200000000
052300010307      *01  STMT-ENGU-REC               PICTURE X(850).
052400030528R17165 01  STMT-ENGU-REC               PICTURE X(1350).
052500000000      /
052600000000      ******************************************************************
052700000000      *                                                                *
052800000000      *    STMENGHLDU: Statements (American English Hold Mail)         *
052900000000      *                                                                *
053000000000      ******************************************************************
053100000000
053200000000       FD  STMT-ENGHLDU-FILE
053300000000           LABEL RECORDS      ARE  STANDARD
053400010307      *    RECORD CONTAINS    850  CHARACTERS.
053500030528R17165     RECORD CONTAINS    1350 CHARACTERS.
053600000000
053700010307      *01  STMT-ENGHLDU-REC           PICTURE X(850).
053800030528R17165 01  STMT-ENGHLDU-REC           PICTURE X(1350).
053900000000      /
054000000000      ******************************************************************
054100000000      *                                                                *
054200000000      *    STMFRN:     Statements (Canadian French)                    *
054300000000      *                                                                *
054400000000      ******************************************************************
054500000000
054600000000       FD  STMT-FRN-FILE
054700000000           LABEL RECORDS      ARE  STANDARD
054800010307      *    RECORD CONTAINS    850  CHARACTERS.
054900030528R17165     RECORD CONTAINS    1350 CHARACTERS.
055000000000
055100010307      *01  STMT-FRN-REC                PICTURE X(850).
055200030528R17165 01  STMT-FRN-REC                PICTURE X(1350).
055300000000      /
055400000000      ******************************************************************
055500000000      *                                                                *
055600000000      *    STMFRNF:    Statements (Foreign French)                     *
055700000000      *                                                                *
055800000000      ******************************************************************
055900000000
056000000000       FD  STMT-FRNF-FILE
056100000000           LABEL RECORDS      ARE  STANDARD
056200010307      *    RECORD CONTAINS    850  CHARACTERS.
056300030528R17165     RECORD CONTAINS    1350 CHARACTERS.
056400000000
056500010307      *01  STMT-FRNF-REC               PICTURE X(850).
056600030528R17165 01  STMT-FRNF-REC               PICTURE X(1350).
056700000000      /
056800000000      ******************************************************************
056900000000      *                                                                *
057000000000      *    STMFRNHLD:  Statements (Canadian French Hold Mail)          *
057100000000      *                                                                *
057200000000      ******************************************************************
057300000000
057400000000       FD  STMT-FRNHLD-FILE
057500000000           LABEL RECORDS      ARE  STANDARD
057600010307      *    RECORD CONTAINS    850  CHARACTERS.
057700030528R17165     RECORD CONTAINS    1350 CHARACTERS.
057800000000
057900010307      *01  STMT-FRNHLD-REC            PICTURE X(850).
058000030528R17165 01  STMT-FRNHLD-REC            PICTURE X(1350).
058100000000      /
058200000000      ******************************************************************
058300000000      *                                                                *
058400000000      *    STMFRNHLDF: Statements (Foreign French Hold Mail)           *
058500000000      *                                                                *
058600000000      ******************************************************************
058700000000
058800000000       FD  STMT-FRNHLDF-FILE
058900000000           LABEL RECORDS      ARE  STANDARD
059000010307      *    RECORD CONTAINS    850  CHARACTERS.
059100030528R17165     RECORD CONTAINS    1350 CHARACTERS.
059200000000
059300010307      *01  STMT-FRNHLDF-REC           PICTURE X(850).
059400030528R17165 01  STMT-FRNHLDF-REC           PICTURE X(1350).
059500000000      /
059600000000      ******************************************************************
059700000000      *                                                                *
059800000000      *    STMFRNU:    Statements (American French)                    *
059900000000      *                                                                *
060000000000      ******************************************************************
060100000000
060200000000       FD  STMT-FRNU-FILE
060300000000           LABEL RECORDS      ARE  STANDARD
060400010307      *    RECORD CONTAINS    850  CHARACTERS.
060500030528R17165     RECORD CONTAINS    1350 CHARACTERS.
060600000000
060700010307      *01  STMT-FRNU-REC               PICTURE X(850).
060800030528R17165 01  STMT-FRNU-REC               PICTURE X(1350).
060900000000      /
061000000000      ******************************************************************
061100000000      *                                                                *
061200000000      *    STMFRNHLDU: Statements (American French Hold Mail)          *
061300000000      *                                                                *
061400000000      ******************************************************************
061500000000
061600000000       FD  STMT-FRNHLDU-FILE
061700000000           LABEL RECORDS      ARE  STANDARD
061800010307      *    RECORD CONTAINS    850  CHARACTERS.
061900030528R17165     RECORD CONTAINS    1350 CHARACTERS.
062000000000
062100010307      *01  STMT-FRNHLDU-REC           PICTURE X(850).
062200030528R17165 01  STMT-FRNHLDU-REC           PICTURE X(1350).
062300980602      /
062400000000      ******************************************************************
062500000000      *                                                                *
062600000000      *    QPRINT:     Control Report                                  *
062700000000      *                                                                *
062800000000      ******************************************************************
062900000000
063000000000       FD  PRINT-FILE
063100000000           LABEL RECORDS      ARE  OMITTED.
063200000000
063300000000       01  PRINT-REC                   PICTURE X(150).
063400000000      /
063500000000       WORKING-STORAGE SECTION.
063600000000
063700000000      ******************************************************************
063800000000      *                                                                *
063900000000      *    W O R K I N G   S T O R A G E   S E C T I O N               *
064000000000      *                                                                *
064100000000      ******************************************************************
064200000000      /
064300971024       01  WS-LOCAL-DATA-AREA.         COPY CPYLDASTMT.
064400000000      /
064500000000                                       COPY CPYJSISTMT.
064600000000      /
064700000000      ******************************************************************
064800000000      *                                                                *
064900000000      *    H E A D I N G   P R I N T   L I N E S                       *
065000000000      *                                                                *
065100000000      ******************************************************************
065200000000
065300000000       01  HEADING-LINE-1.
065400000000           05  FILLER                  PICTURE X(11)       VALUE
065500000000               "DATE     : ".
065600000000           03  HL1-YY                  PICTURE 9(2).
065700000000           03  FILLER                  PICTURE X(1)        VALUE "/".
065800000000           03  HL1-MM                  PICTURE 9(2).
065900000000           03  FILLER                  PICTURE X(1)        VALUE "/".
066000000000           03  HL1-DD                  PICTURE 9(2).
066100000000           03  FILLER                  PICTURE X(95)       VALUE SPACES.
066200000000           03  FILLER                  PICTURE X(6)        VALUE
066300000000               "TIME: ".
066400000000           03  HL1-TIME                PICTURE 99B99B99B99.
066500000000           03  HL1-TIME-R              REDEFINES HL1-TIME.
066600000000               05  FILLER              PICTURE X(8).
066700000000               05  HL1-TIME-DOT        PICTURE X(1).
066800000000               05  FILLER              PICTURE X(2).
066900000000           03  FILLER                  PICTURE X(19)       VALUE SPACES.
067000000000
067100000000       01  HEADING-LINE-2.
067200000000           03  FILLER                  PICTURE X(11)       VALUE
067300000000               "REPORT NO: ".
067400000000           03  FILLER                  PICTURE X(10)       VALUE
067500000000               "STMTCNV   ".
067600000000           03  FILLER                  PICTURE X(15)       VALUE SPACES.
067700000000           03  FILLER                  PICTURE X(35)       VALUE
067800000000               "STATEMENT CONVERSION CONTROL REPORT".
067900000000           03  FILLER                  PICTURE X(43)       VALUE SPACES.
068000000000           03  FILLER                  PICTURE X(5)        VALUE
068100000000               "PAGE:".
068200000000           03  FILLER                  PICTURE X(8)        VALUE SPACES.
068300000000           03  HL2-PGECNT              PICTURE ZZZZ9.
068400031120
068500031120R18312 01  HEADING-LINE-2-H.
068600031120           03  FILLER                  PICTURE X(20)       VALUE
068700031120               "Statement Type:     ".
068800031120           03  HL2H-STMT-TYPE          PICTURE X(10).
068900031120           03  FILLER                  PICTURE X(15)       VALUE SPACES.
069000031120           03  FILLER                  PICTURE X(35)       VALUE SPACES.
069100031120           03  FILLER                  PICTURE X(43)       VALUE SPACES.
069200031120           03  FILLER                  PICTURE X(5)        VALUE SPACES.
069300031120           03  FILLER                  PICTURE X(8)        VALUE SPACES.
069400000000
069500000000       01  HEADING-LINE-3.
069600000000           03  FILLER                  PICTURE X(3)        VALUE SPACES.
069700000000           03  FILLER                  PICTURE X(9)        VALUE
069800000000               "INVESTOR#".
069900000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
070000000000           03  FILLER                  PICTURE X(9)        VALUE
070100000000               "ACCOUNT  ".
070200000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
070300000000           03  FILLER                  PICTURE X(9)        VALUE
070400000000               "SECTION  ".
070500000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
070600000000           03  FILLER                  PICTURE X(3)        VALUE "LNG".
070700000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
070800000000           03  FILLER                  PICTURE X(6)        VALUE
070900000000               "DEALER".
071000000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
071100000000           03  FILLER                  PICTURE X(5)        VALUE
071200000000               "REP. ".
071300000000           03  FILLER                  PICTURE X(1)        VALUE SPACES.
071400000000           03  FILLER                  PICTURE X(50)       VALUE
071500000000               "MESSAGE                                           ".
071600000000           03  FILLER                  PICTURE X(50)       VALUE SPACES.
071700000000      /
071800000000      ******************************************************************
071900000000      *                                                                *
072000000000      *    E R R O R   P R I N T   L I N E S
072100000000      *                                                                *
072200000000      ******************************************************************
072300000000
072400000000       01  ERROR-LINE-1.
072500000000           03  FILLER                  PICTURE X(3).
072600000000           03  EL1-INVESTOR-NO         PICTURE 9(9).
072700000000           03  FILLER                  PICTURE X(1).
072800000000           03  EL1-ACCOUNT             PICTURE 9(9).
072900000000           03  FILLER                  PICTURE X(1).
073000000000           03  EL1-SECTION-NO          PICTURE 9(2).
073100000000           03  EL1-SECTION-LITDSH      PICTURE X(1).
073200000000           03  EL1-SECTION-SEQUENCE    PICTURE 9(6).
073300000000           03  FILLER                  PICTURE X(2).
073400000000           03  EL1-LANGUAGE-CODE       PICTURE X(1).
073500000000           03  FILLER                  PICTURE X(2).
073600000000           03  EL1-DEALER              PICTURE X(4).
073700000000           03  FILLER                  PICTURE X(3).
073800000222           03  EL1-DEALER-REP-CODE     PICTURE X(6).
073900000000           03  FILLER                  PICTURE X(1).
074000000000           03  EL1-MSG                 PICTURE X(50).
074100000000           03  FILLER                  PICTURE X(50).
074200000000      /
074300000000      ******************************************************************
074400000000      *                                                                *
074500000000      *    C O N T R O L   P R I N T   L I N E S                       *
074600000000      *                                                                *
074700000000      ******************************************************************
074800000000
074900000000       01  CONTROL-LINE-1.
075000000000           03  FILLER                  PICTURE X(3).
075100000000           03  CL1-LIT                 PICTURE X(50) JUST RIGHT.
075200000000           03  FILLER                  PICTURE X(1).
075300000000           03  CL1-VAL.
075400000000               05  FILLER              PICTURE X(8).
075500000000               05  CL1-CNT             PICTURE ZZZ,ZZZ,ZZ9.
075600000000               05  FILLER              PICTURE X(5).
075700000000           03  CL1-VAL-R1              REDEFINES CL1-VAL.
075800000000               05  FILLER              PICTURE X(1).
075900000000               05  CL1-CNT1            PICTURE ZZ,ZZZ,ZZZ,ZZZ,ZZ9.999.
076000000000               05  FILLER              PICTURE X(1).
076100000000           03  CL1-VAL-R2              REDEFINES CL1-VAL.
076200000000               05  FILLER              PICTURE X(8).
076300000000               05  CL1-CNT2            PICTURE ZZZ,ZZZ,ZZ9.9999.
076400000000           03  CL1-VAL-R3              REDEFINES CL1-VAL.
076500000000               05  CL1-CNT3            PICTURE ZZZ,ZZZ,ZZZ,ZZZ,ZZ9.99.
076600000000               05  FILLER              PICTURE X(2).
076700000000           03  FILLER                  PICTURE X(72).
076800000000      /
076900000000       01  WS-PGM-DEFIND-WORK-ITEMS.
077000000000
077100000000      ******************************************************************
077200000000      *                                                                *
077300000000      *    P R O G R A M   D E F I N E D   W O R K   I T E M S         *
077400000000      *                                                                *
077500000000      ******************************************************************
077600000000
077700000000      *****
077800000000      *****    Control Report Counters.
077900000000      *****
078000000000
078100000000           03  WS-STMT-DTA-RCNT        PICTURE S9(9)       COMP-3.
078200000000           03  WS-STMT-DTA-RCNT-BV     PICTURE S9(15)V9(2) COMP-3.
078300000000           03  WS-STMT-DTA-RCNT-MV     PICTURE S9(15)V9(2) COMP-3.
078400000000           03  WS-STMT-DTA-RCNT-UB     PICTURE S9(14)V9(3) COMP-3.
078500000000           03  WS-STMT-DTA-RCNT-UN     PICTURE S9(14)V9(3) COMP-3.
078600000000           03  WS-STMT-DTA-RCNT-UP     PICTURE S9(9)V9(4)  COMP-3.
078700000000           03  WS-STMT-DTA-RCNT-00     PICTURE S9(9)       COMP-3.
078800000000           03  WS-STMT-DTA-RCNT-01     PICTURE S9(9)       COMP-3.
078900000000           03  WS-STMT-DTA-RCNT-05     PICTURE S9(9)       COMP-3.
079000000000           03  WS-STMT-DTA-RCNT-10     PICTURE S9(9)       COMP-3.
079100010307RF8633     03  WS-STMT-DTA-RCNT-12     PICTURE S9(9)       COMP-3.
079200000000           03  WS-STMT-DTA-RCNT-15     PICTURE S9(9)       COMP-3.
079300030821R18091     03  WS-STMT-DTA-RCNT-17     PICTURE S9(9)       COMP-3.
079400000000           03  WS-STMT-DTA-RCNT-20     PICTURE S9(9)       COMP-3.
079500060615R35042     03  WS-STMT-DTA-RCNT-21     PICTURE S9(9)       COMP-3.
079600130408117038     03  WS-STMT-DTA-RCNT-22     PICTURE S9(9)       COMP-3.
079700010321RF8633     03  WS-STMT-DTA-RCNT-25     PICTURE S9(9)       COMP-3.
079800000515RF7051     03  WS-STMT-DTA-RCNT-30     PICTURE S9(9)       COMP-3.
079900040406R20870     03  WS-STMT-DTA-RCNT-33     PICTURE S9(9)       COMP-3.
080000000515           03  WS-STMT-DTA-RCNT-35     PICTURE S9(9)       COMP-3.
080100040406R20870     03  WS-STMT-DTA-RCNT-38     PICTURE S9(9)       COMP-3.
080200010124RF8558     03  WS-STMT-DTA-RCNT-40     PICTURE S9(9)       COMP-3.
080300010307RF8558     03  WS-STMT-DTA-RCNT-43     PICTURE S9(9)       COMP-3.
080400010307RF8558     03  WS-STMT-DTA-RCNT-45     PICTURE S9(9)       COMP-3.
080500000000           03  WS-STMT-DTA-RCNT-50     PICTURE S9(9)       COMP-3.
080600000000           03  WS-STMT-DTA-RCNT-60     PICTURE S9(9)       COMP-3.
080700981218           03  WS-STMT-DTA-RCNT-62     PICTURE S9(9)       COMP-3.
080800091119R69515     03  WS-STMT-DTA-RCNT-63     PICTURE S9(9)       COMP-3.
080900980519           03  WS-STMT-DTA-RCNT-65     PICTURE S9(9)       COMP-3.
081000000515           03  WS-STMT-DTA-RCNT-67     PICTURE S9(9)       COMP-3.
081100971026           03  WS-STMT-DTA-RCNT-70     PICTURE S9(9)       COMP-3.
081200000000           03  WS-STMT-DTA-RCNT-80     PICTURE S9(9)       COMP-3.
081300000000           03  WS-STMT-DTA-RCNT-82     PICTURE S9(9)       COMP-3.
081400000515           03  WS-STMT-DTA-RCNT-84     PICTURE S9(9)       COMP-3.
081500010124RF8558     03  WS-STMT-DTA-RCNT-90     PICTURE S9(9)       COMP-3.
081600031106R18312     03  WS-STMT-DTA-RCNT-CLTHLD PICTURE S9(9)       COMP-3.
081700031106  ¦        03  WS-STMT-DTA-RCNT-NOMHLD PICTURE S9(9)       COMP-3.
081800031106  ¦        03  WS-STMT-DTA-RCNT-ENG    PICTURE S9(9)       COMP-3.
081900031106  ¦        03  WS-STMT-DTA-RCNT-ENGHLD PICTURE S9(9)       COMP-3.
082000031106  ¦        03  WS-STMT-DTA-RCNT-FRN    PICTURE S9(9)       COMP-3.
082100031124  ¦        03  WS-STMT-DTA-RCNT-FRNHLD PICTURE S9(9)       COMP-3.
082200031124R18312     03  WS-STMT-DTA-RCNT-ACCTOT PICTURE S9(9)       COMP-3.
082300000000
082400000000           03  WS-STMT-WRITE-TABLE.
082500000000             04  WS-STMT-WCNT-TYPS     OCCURS     3  TIMES
082600000000                                       INDEXED   BY  ST.
082700980609               05  WS-STMT-WCNT-ENTS   OCCURS     6  TIMES
082800000000                                       INDEXED   BY  SW.
082900000000                 06  WS-STMT-WCNT      PICTURE S9(9)       COMP-3.
083000000000                 06  WS-STMT-WCNT-BV   PICTURE S9(15)V9(2) COMP-3.
083100000000                 06  WS-STMT-WCNT-MV   PICTURE S9(15)V9(2) COMP-3.
083200000000                 06  WS-STMT-WCNT-UB   PICTURE S9(14)V9(3) COMP-3.
083300000000                 06  WS-STMT-WCNT-UN   PICTURE S9(14)V9(3) COMP-3.
083400000000                 06  WS-STMT-WCNT-UP   PICTURE S9(9)V9(4)  COMP-3.
083500000000                 06  WS-STMT-WCNT-00   PICTURE S9(9)       COMP-3.
083600000000                 06  WS-STMT-WCNT-01   PICTURE S9(9)       COMP-3.
083700000000                 06  WS-STMT-WCNT-05   PICTURE S9(9)       COMP-3.
083800000000                 06  WS-STMT-WCNT-10   PICTURE S9(9)       COMP-3.
083900010307RF8633           06  WS-STMT-WCNT-12   PICTURE S9(7)       COMP-3.
084000000000                 06  WS-STMT-WCNT-15   PICTURE S9(7)       COMP-3.
084100030821R18091           06  WS-STMT-WCNT-17   PICTURE S9(7)       COMP-3.
084200000000                 06  WS-STMT-WCNT-20   PICTURE S9(7)       COMP-3.
084300060615R35042           06  WS-STMT-WCNT-21   PICTURE S9(7)       COMP-3.
084400130408117038           06  WS-STMT-WCNT-22   PICTURE S9(7)       COMP-3.
084500010321RF8633           06  WS-STMT-WCNT-25   PICTURE S9(7)       COMP-3.
084600000515                 06  WS-STMT-WCNT-30   PICTURE S9(7)       COMP-3.
084700040406R20870           06  WS-STMT-WCNT-33   PICTURE S9(7)       COMP-3.
084800000515                 06  WS-STMT-WCNT-35   PICTURE S9(7)       COMP-3.
084900040406R20870           06  WS-STMT-WCNT-38   PICTURE S9(7)       COMP-3.
085000010125                 06  WS-STMT-WCNT-40   PICTURE S9(7)       COMP-3.
085100010125                 06  WS-STMT-WCNT-43   PICTURE S9(7)       COMP-3.
085200010125                 06  WS-STMT-WCNT-45   PICTURE S9(7)       COMP-3.
085300000000                 06  WS-STMT-WCNT-50   PICTURE S9(7)       COMP-3.
085400000000                 06  WS-STMT-WCNT-60   PICTURE S9(7)       COMP-3.
085500981218                 06  WS-STMT-WCNT-62   PICTURE S9(7)       COMP-3.
085600091119R69515           06  WS-STMT-WCNT-63   PICTURE S9(7)       COMP-3.
085700980519                 06  WS-STMT-WCNT-65   PICTURE S9(7)       COMP-3.
085800000515                 06  WS-STMT-WCNT-67   PICTURE S9(7)       COMP-3.
085900971026                 06  WS-STMT-WCNT-70   PICTURE S9(7)       COMP-3.
086000000000                 06  WS-STMT-WCNT-80   PICTURE S9(7)       COMP-3.
086100000000                 06  WS-STMT-WCNT-82   PICTURE S9(7)       COMP-3.
086200000515                 06  WS-STMT-WCNT-84   PICTURE S9(7)       COMP-3.
086300010125                 06  WS-STMT-WCNT-90   PICTURE S9(7)       COMP-3.
086400031106R18312           06  WS-STMT-WCNT-CLTHLD PICTURE S9(7)       COMP-3.
086500031106  ¦              06  WS-STMT-WCNT-NOMHLD PICTURE S9(7)       COMP-3.
086600031106  ¦              06  WS-STMT-WCNT-ENG    PICTURE S9(7)       COMP-3.
086700031106  ¦              06  WS-STMT-WCNT-ENGHLD PICTURE S9(7)       COMP-3.
086800031106  ¦              06  WS-STMT-WCNT-FRN    PICTURE S9(7)       COMP-3.
086900031124  ¦              06  WS-STMT-WCNT-FRNHLD PICTURE S9(7)       COMP-3.
087000031124R18312           06  WS-STMT-WCNT-ACCTOT PICTURE S9(7)       COMP-3.
087100000000
087200000000      *****
087300000000      *****    Control Report Literals.
087400000000      *****
087500000000
087600000000           03  WS-STMT-DTA-RLIT        PICTURE X(50)       VALUE
087700000000               "STATEMENT DATA RECS READ:                         ".
087800000000           03  WS-STMT-DTA-RLIT-BV     PICTURE X(50)       VALUE
087900000000               "STATEMENT DATA RECS BOOK VALUE:                   ".
088000000000           03  WS-STMT-DTA-RLIT-MV     PICTURE X(50)       VALUE
088100000000               "STATEMENT DATA RECS MARKET VALUE:                 ".
088200000000           03  WS-STMT-DTA-RLIT-UB     PICTURE X(50)       VALUE
088300000000               "STATEMENT DATA RECS UNIT BALANCE:                 ".
088400000000           03  WS-STMT-DTA-RLIT-UN     PICTURE X(50)       VALUE
088500000000               "STATEMENT DATA RECS NO OF UNITS:                  ".
088600000000           03  WS-STMT-DTA-RLIT-UP     PICTURE X(50)       VALUE
088700000000               "STATEMENT DATA RECS UNIT PRICE:                   ".
088800000000           03  WS-STMT-DTA-RLIT-00     PICTURE X(50)       VALUE
088900000000               "STATEMENT DATA (DELIVERY INFO) RECS:              ".
089000000000           03  WS-STMT-DTA-RLIT-01     PICTURE X(50)       VALUE
089100000000               "STATEMENT DATA (INVESTOR INFO) RECS:              ".
089200000000           03  WS-STMT-DTA-RLIT-05     PICTURE X(50)       VALUE
089300000000               "STATEMENT DATA (DEALER) RECS:                     ".
089400000000           03  WS-STMT-DTA-RLIT-10     PICTURE X(50)       VALUE
089500000000               "STATEMENT DATA (INVESTOR SUMMARY) RECS:           ".
089600010307RF8633     03  WS-STMT-DTA-RLIT-12     PICTURE X(50)       VALUE
089700010307               "STATEMENT DATA (INVESTOR SUMMARY SEC2) RECS:      ".
089800000000           03  WS-STMT-DTA-RLIT-15     PICTURE X(50)       VALUE
089900000000               "STATEMENT DATA (ASSET CLASS SUMMARY) RECS:        ".
090000030821R18091     03  WS-STMT-DTA-RLIT-17     PICTURE X(50)       VALUE
090100030821R18091         "STATEMENT DATA (ACCOUNT IPS DETAILS) RECS:        ".
090200000000           03  WS-STMT-DTA-RLIT-20     PICTURE X(50)       VALUE
090300000000               "STATEMENT DATA (ACCOUNT DETAIL) RECS:             ".
090400060615R35042     03  WS-STMT-DTA-RLIT-21     PICTURE X(50)       VALUE
090500060615R35042         "STATEMENT DATA (ACCOUNT ADDITIONAL INFO) RECS:    ".
090600130408117038     03  WS-STMT-DTA-RLIT-22     PICTURE X(50)       VALUE
090700130408117038         "STATEMENT DATA (ACCOUNT ADD DTL) RECS:            ".
090800010321RF8633     03  WS-STMT-DTA-RLIT-25     PICTURE X(50)       VALUE
090900010321               "STATEMENT DATA (ACCOUNT GIC DETAIL) RECS:         ".
091000000515RF7051     03  WS-STMT-DTA-RLIT-30     PICTURE X(50)       VALUE
091100000515               "STATEMENT DATA (ACCOUNT PERFORMANCE) RECS:        ".
091200040406R20870     03  WS-STMT-DTA-RLIT-33     PICTURE X(50)       VALUE
091300040406               "STATEMENT DATA (ACCOUNT ROR)         RECS:        ".
091400000515           03  WS-STMT-DTA-RLIT-35     PICTURE X(50)       VALUE
091500000515               "STATEMENT DATA (ACCOUNT FUND  PERFORMANCE) RECS:  ".
091600040406R20870     03  WS-STMT-DTA-RLIT-38     PICTURE X(50)       VALUE
091700040406               "STATEMENT DATA (ACCOUNT FUND  ROR)         RECS:  ".
091800010124RF8558     03  WS-STMT-DTA-RLIT-40     PICTURE X(50)       VALUE
091900010124               "STATEMENT DATA (SEG FUND CONTRACT DETAILS) RECS:  ".
092000010307RF8558     03  WS-STMT-DTA-RLIT-43     PICTURE X(50)       VALUE
092100010124               "STATEMENT DATA (SEG FUND CONTRACT INVDTL ) RECS:  ".
092200010307RF8558     03  WS-STMT-DTA-RLIT-45     PICTURE X(50)       VALUE
092300010124               "STATEMENT DATA (ANNUITANT DETAILS        ) RECS:  ".
092400000000           03  WS-STMT-DTA-RLIT-50     PICTURE X(50)       VALUE
092500000000               "STATEMENT DATA (ROLLOVER) RECS:                   ".
092600000000           03  WS-STMT-DTA-RLIT-60     PICTURE X(50)       VALUE
092700000000               "STATEMENT DATA (RRIF DETAIL) RECS:                ".
092800981218           03  WS-STMT-DTA-RLIT-62     PICTURE X(50)       VALUE
092900981218               "STATEMENT DATA (RESP DETAIL) RECS:                ".
093000091119R69515     03  WS-STMT-DTA-RLIT-63     PICTURE X(50)       VALUE
093100091119R69515         "STATEMENT DATA (RDSP ACCOUNT) RECS:               ".
093200980519           03  WS-STMT-DTA-RLIT-65     PICTURE X(50)       VALUE
093300980519               "STATEMENT DATA (GROUP      ) RECS:                ".
093400000515           03  WS-STMT-DTA-RLIT-67     PICTURE X(50)       VALUE
093500000515               "STATEMENT DATA (BENEFICIARY INFORMATION) RECS:    ".
093600971026           03  WS-STMT-DTA-RLIT-70     PICTURE X(50)       VALUE
093700971026               "STATEMENT DATA (SYSTEMATIC PLAN INFO) RECS:       ".
093800000000           03  WS-STMT-DTA-RLIT-80     PICTURE X(50)       VALUE
093900000000               "STATEMENT DATA (ACCOUNT TRANSACTION) RECS:        ".
094000000000           03  WS-STMT-DTA-RLIT-82     PICTURE X(50)       VALUE
094100000000               "STATEMENT DATA (INSTITUTION DETAIL) RECS:         ".
094200000515           03  WS-STMT-DTA-RLIT-84     PICTURE X(50)       VALUE
094300000515               "STATEMENT DATA (TRANS RESP DETAIL) RECS:          ".
094400010124RF8558     03  WS-STMT-DTA-RLIT-90     PICTURE X(50)       VALUE
094500010124               "STATEMENT DATA (RESET CONTRACT DETAILS   ) RECS:  ".
094600031106R18312     03  WS-STMT-DTA-RLIT-CLTHLD PICTURE X(50)       VALUE
094700031106  ¦            "STATEMENT DATA (CLIENT HELD) RECS:                ".
094800031106  ¦        03  WS-STMT-DTA-RLIT-NOMHLD PICTURE X(50)       VALUE
094900031106  ¦            "STATEMENT DATA (NOMINEE HELD) RECS:               ".
095000031106  ¦        03  WS-STMT-DTA-RLIT-ENG     PICTURE X(50)       VALUE
095100031106  ¦            "STATEMENT DATA (ENGLISH STMT) RECS:               ".
095200031106  ¦        03  WS-STMT-DTA-RLIT-ENGHLD PICTURE X(50)       VALUE
095300031106  ¦            "STATEMENT DATA (ENGLISH STMT HELD) RECS:          ".
095400031106  ¦        03  WS-STMT-DTA-RLIT-FRN     PICTURE X(50)       VALUE
095500031106  ¦            "STATEMENT DATA (FRENCH STMT) RECS:                ".
095600031106  ¦        03  WS-STMT-DTA-RLIT-FRNHLD PICTURE X(50)       VALUE
095700031124  ¦            "STATEMENT DATA (FRENCH STMT HELD) RECS:           ".
095800031124  ¦        03  WS-STMT-DTA-RLIT-ACCTOT PICTURE X(50)       VALUE
095900031124R18312         "STATEMENT DATA (STATEMENT TOTALS) RECS:           ".
096000000000
096100000000           03  WS-STMT-HLIT-TABLE.
096200000000               05  FILLER              PICTURE X(32)       VALUE
096300000000                   "CANADIAN ENGLISH STATEMENTS     ".
096400000000               05  FILLER              PICTURE X(32)       VALUE
096500000000                   "CANADIAN ENGLISH HOLD STATEMENTS".
096600980609               05  FILLER              PICTURE X(32)       VALUE
096700980609                   "CANADIAN ENGLISH ICS STATEMENTS ".
096800000000               05  FILLER              PICTURE X(32)       VALUE
096900000000                   "CANADIAN FRENCH STATEMENTS      ".
097000000000               05  FILLER              PICTURE X(32)       VALUE
097100000000                   "CANADIAN FRENCH HOLD STATEMENTS ".
097200000000               05  FILLER              PICTURE X(32)       VALUE
097300980609                   "CANADIAN FRENCH ICS STATEMENTS  ".
097400980609               05  FILLER              PICTURE X(32)       VALUE
097500000000                   "AMERICAN ENGLISH STATEMENTS     ".
097600000000               05  FILLER              PICTURE X(32)       VALUE
097700000000                   "AMERICAN ENGLISH HOLD STATEMENTS".
097800980609               05  FILLER              PICTURE X(32)       VALUE
097900980609                   "AMERICAN ENGLISH ICS STATEMENTS ".
098000000000               05  FILLER              PICTURE X(32)       VALUE
098100000000                   "AMERICAN FRENCH STATEMENTS      ".
098200000000               05  FILLER              PICTURE X(32)       VALUE
098300000000                   "AMERICAN FRENCH HOLD STATEMENTS ".
098400980609               05  FILLER              PICTURE X(32)       VALUE
098500980609                   "AMERICAN FRENCH ICS STATEMENTS  ".
098600000000               05  FILLER              PICTURE X(32)       VALUE
098700000000                   "FOREIGN ENGLISH STATEMENTS      ".
098800000000               05  FILLER              PICTURE X(32)       VALUE
098900000000                   "FOREIGN ENGLISH HOLD STATEMENTS ".
099000980609               05  FILLER              PICTURE X(32)       VALUE
099100980609                   "FOREIGN ENGLISH ICS STATEMENTS  ".
099200000000               05  FILLER              PICTURE X(32)       VALUE
099300000000                   "FOREIGN FRENCH STATEMENTS       ".
099400000000               05  FILLER              PICTURE X(32)       VALUE
099500000000                   "FOREIGN FRENCH HOLD STATEMENTS  ".
099600980609               05  FILLER              PICTURE X(32)       VALUE
099700980609                   "FOREIGN FRENCH ICS STATEMENTS   ".
099800000000           03  WS-STMT-HLIT-TABLE-R    REDEFINES WS-STMT-HLIT-TABLE.
099900000000             04  WS-STMT-HTYP          OCCURS     3  TIMES
100000000000                                       INDEXED   BY  SH.
100100980609               05  WS-STMT-HLIT        OCCURS     6  TIMES
100200000000                                       INDEXED   BY  SL
100300000000                                       PICTURE X(32).
100400000000
100500000000           03  WS-STMT-WLIT            PICTURE X(50)       VALUE
100600000000               "STATEMENT DATA RECS WRITTEN:                      ".
100700000000           03  WS-STMT-WLIT-BV         PICTURE X(50)       VALUE
100800000000               "STATEMENT DATA RECS BOOK VALUE:                   ".
100900000000           03  WS-STMT-WLIT-MV         PICTURE X(50)       VALUE
101000000000               "STATEMENT DATA RECS MARKET VALUE:                 ".
101100000000           03  WS-STMT-WLIT-UB         PICTURE X(50)       VALUE
101200000000               "STATEMENT DATA RECS UNIT BALANCE:                 ".
101300000000           03  WS-STMT-WLIT-UN         PICTURE X(50)       VALUE
101400000000               "STATEMENT DATA RECS NO OF UNITS:                  ".
101500000000           03  WS-STMT-WLIT-UP         PICTURE X(50)       VALUE
101600000000               "STATEMENT DATA RECS UNIT PRICE:                   ".
101700000000           03  WS-STMT-WLIT-00         PICTURE X(50)       VALUE
101800000000               "STATEMENT DATA (DELIVERY INFO) RECS:              ".
101900000000           03  WS-STMT-WLIT-01         PICTURE X(50)       VALUE
102000000000               "STATEMENT DATA (INVESTOR INFO) RECS:              ".
102100000000           03  WS-STMT-WLIT-05         PICTURE X(50)       VALUE
102200000000               "STATEMENT DATA (DEALER) RECS:                     ".
102300000000           03  WS-STMT-WLIT-10         PICTURE X(50)       VALUE
102400000000               "STATEMENT DATA (INVESTOR SUMMARY) RECS:           ".
102500010307RF8633     03  WS-STMT-WLIT-12         PICTURE X(50)       VALUE
102600010307               "STATEMENT DATA (INVESTOR SUMMARY SEC2) RECS:      ".
102700000000           03  WS-STMT-WLIT-15         PICTURE X(50)       VALUE
102800000000               "STATEMENT DATA (ASSET CLASS SUMMARY) RECS:        ".
102900030821R18091     03  WS-STMT-WLIT-17         PICTURE X(50)       VALUE
103000030821R18091         "STATEMENT DATA (ACCOUNT IPS DETAILS) RECS:        ".
103100000000           03  WS-STMT-WLIT-20         PICTURE X(50)       VALUE
103200000000               "STATEMENT DATA (ACCOUNT DETAIL) RECS:             ".
103300060615R35042     03  WS-STMT-WLIT-21         PICTURE X(50)       VALUE
103400060623R35042         "STATEMENT DATA (ACCOUNT ADDITIONAL INFO) RECS:    ".
103500130408117038     03  WS-STMT-WLIT-22         PICTURE X(50)       VALUE
103600130408117038         "STATEMENT DATA (ACCT ADD DTL) RECS:               ".
103700010321RF8633     03  WS-STMT-WLIT-25         PICTURE X(50)       VALUE
103800010321               "STATEMENT DATA (ACCOUNT GIC DETAIL) RECS:         ".
103900000515RF7051     03  WS-STMT-WLIT-30         PICTURE X(50)       VALUE
104000000515               "STATEMENT DATA (ACCOUNT PERFORMANCE) RECS:        ".
104100040406R20870     03  WS-STMT-WLIT-33         PICTURE X(50)       VALUE
104200040406               "STATEMENT DATA (ACCOUNT ROR)         RECS:        ".
104300000515           03  WS-STMT-WLIT-35         PICTURE X(50)       VALUE
104400000515               "STATEMENT DATA (ACCOUNT FUND PERFORMANCE) RECS    ".
104500040406R20870     03  WS-STMT-WLIT-38         PICTURE X(50)       VALUE
104600040406               "STATEMENT DATA (ACCOUNT FUND ROR)         RECS    ".
104700010124RF8558     03  WS-STMT-WLIT-40         PICTURE X(50)       VALUE
104800010124               "STATEMENT DATA (SEG FUND CONTRACT DETAILS) RECS:  ".
104900010307RF8558     03  WS-STMT-WLIT-43         PICTURE X(50)       VALUE
105000010124               "STATEMENT DATA (SEG FUND CONTRACT INVDTL ) RECS:  ".
105100010307RF8558     03  WS-STMT-WLIT-45         PICTURE X(50)       VALUE
105200010124               "STATEMENT DATA (ANNUITANT DETAILS        ) RECS:  ".
105300000000           03  WS-STMT-WLIT-50         PICTURE X(50)       VALUE
105400000000               "STATEMENT DATA (ROLLOVER) RECS:                   ".
105500000000           03  WS-STMT-WLIT-60         PICTURE X(50)       VALUE
105600000000               "STATEMENT DATA (RRIF DETAIL) RECS:                ".
105700981218           03  WS-STMT-WLIT-62         PICTURE X(50)       VALUE
105800981218               "STATEMENT DATA (RESP DETAIL) RECS:                ".
105900091119R69515     03  WS-STMT-WLIT-63         PICTURE X(50)       VALUE
106000091119R69515         "STATEMENT DATA (RDSP ACCOUNT) RECS:               ".
106100980519           03  WS-STMT-WLIT-65         PICTURE X(50)       VALUE
106200980519               "STATEMENT DATA (GROUP INFORMATION   ) RECS:       ".
106300000515           03  WS-STMT-WLIT-67         PICTURE X(50)       VALUE
106400000515               "STATEMENT DATA (BENEFICIARY INFORMATION ) RECS:   ".
106500971026           03  WS-STMT-WLIT-70         PICTURE X(50)       VALUE
106600971026               "STATEMENT DATA (SYSTEMATIC PLAN INFO) RECS:       ".
106700000000           03  WS-STMT-WLIT-80         PICTURE X(50)       VALUE
106800000000               "STATEMENT DATA (ACCOUNT TRANSACTION) RECS:        ".
106900000000           03  WS-STMT-WLIT-82         PICTURE X(50)       VALUE
107000000000               "STATEMENT DATA (INSTITUTION DETAIL) RECS:         ".
107100000515           03  WS-STMT-WLIT-84         PICTURE X(50)       VALUE
107200000515               "STATEMENT DATA (TRANS RESP DETAIL) RECS:          ".
107300010124RF8558     03  WS-STMT-WLIT-90         PICTURE X(50)       VALUE
107400010124               "STATEMENT DATA (RESET CONTRACT DETAILS   ) RECS:  ".
107500031106R18312     03  WS-STMT-WLIT-CLTHLD PICTURE X(50)       VALUE
107600031106  ¦            "STATEMENT DATA (CLIENT HELD) RECS:                ".
107700031106  ¦        03  WS-STMT-WLIT-NOMHLD PICTURE X(50)       VALUE
107800031106  ¦            "STATEMENT DATA (NOMINEE HELD) RECS:               ".
107900031106  ¦        03  WS-STMT-WLIT-ENG     PICTURE X(50)       VALUE
108000031106  ¦            "STATEMENT DATA (ENGLISH STMT) RECS:               ".
108100031106  ¦        03  WS-STMT-WLIT-ENGHLD PICTURE X(50)       VALUE
108200031106  ¦            "STATEMENT DATA (ENGLISH STMT HELD) RECS:          ".
108300031106  ¦        03  WS-STMT-WLIT-FRN     PICTURE X(50)       VALUE
108400031106  ¦            "STATEMENT DATA (FRENCH  STMT) RECS:               ".
108500031106  ¦        03  WS-STMT-WLIT-FRNHLD PICTURE X(50)       VALUE
108600031124  ¦            "STATEMENT DATA (FRENCH  STMT HELD) RECS:          ".
108700031124  ¦        03  WS-STMT-WLIT-ACCTOT PICTURE X(50)       VALUE
108800031124R18312         "STATEMENT DATA (ACCOUNT TOTALS) RECS:             ".
108900000000
109000000000      *****
109100000000      *****    Index/Subscript Related Items.
109200000000      *****
109300000000
109400000000           03  WS-ST-MAX               PICTURE S9(3)       COMP-3.
109500000000           03  WS-SW-MAX               PICTURE S9(3)       COMP-3.
109600000000
109700000000      *****
109800000000      *****    Non-Numeric Items.
109900000000      *****
110000000000
110100000000           03  WS-DATE.
110200000000               05  WS-DATE-YY          PICTURE 9(2).
110300000000               05  WS-DATE-MM          PICTURE 9(2).
110400000000               05  WS-DATE-DD          PICTURE 9(2).
110500000000
110600000000      *****
110700000000      *****    Numeric Items.
110800000000      *****
110900000000
111000000000           03  WS-LNECNT               PICTURE S9(3)       COMP-3.
111100000000           03  WS-LNEMAX               PICTURE S9(3)       COMP-3.
111200000000           03  WS-PGECNT               PICTURE S9(5)       COMP-3.
111300000000
111400000000      *****
111500000000      *****    Switches.
111600000000      *****
111700000000
111800000000           03  WS-EOJHDG-SW            PICTURE X(1).
111900000000      /
112000000000      ******************************************************************
112100000000      *                                                                *
112200000000      *    C U R R E N T   /   P R E V I O U S   C O N T R O L S       *
112300000000      *                                                                *
112400000000      ******************************************************************
112500000000
112600000000       01  CURR-CONTROLS.
112700000000           03  CURR-LEVEL1.
112800000000               05  CURR-INVESTOR-NO    PICTURE 9(9).
112900980128               05  CURR-START-DATE     PICTURE 9(08).
113000980128               05  CURR-END-DATE       PICTURE 9(08).
113100980128
113200000000       01  PREV-CONTROLS.
113300000000           03  PREV-LEVEL1.
113400000000               05  PREV-INVESTOR-NO    PICTURE 9(9).
113500980128               05  PREV-START-DATE     PICTURE 9(08).
113600980128               05  PREV-END-DATE       PICTURE 9(08).
113700000000      /
113800000000       PROCEDURE DIVISION.
113900000000
114000000000      ******************************************************************
114100000000      *                                                                *
114200000000      *    P R O C E D U R E   D I V I S I O N                         *
114300000000      *                                                                *
114400000000      ******************************************************************
114500000000      /
114600000000       MAINLINE.
114700000000
114800000000      ******************************************************************
114900000000      *                                                                *
115000000000      *    M A I N L I N E                                             *
115100000000      *                                                                *
115200000000      ******************************************************************
115300000000
115400000000           PERFORM INITIAL-LOGIC-RTN  THRU ILR-EXIT.
115500000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
115600000000               GO TO MLR-0040.
115700000000
115800000000       MLR-0010.
115900000000           PERFORM GET-CURRENT-RECORD THRU GCR-EXIT.
116000000000           IF  PREV-LEVEL1    IS EQUAL TO  CURR-LEVEL1
116100000000               GO TO MLR-0030.
116200000000
116300000000           IF  PREV-CONTROLS  IS EQUAL TO  LOW-VALUES
116400000000               GO TO MLR-0020.
116500000000
116600000000           PERFORM LEVEL-SUMMARY-1    THRU LS1-EXIT.
116700000000
116800000000       MLR-0020.
116900000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
117000000000               GO TO MLR-0040.
117100000000
117200000000           PERFORM LEVEL-REINIT-1     THRU LR1-EXIT.
117300000000
117400000000       MLR-0030.
117500000000           PERFORM DETAIL-PROCESS-RTN THRU DPR-EXIT.
117600000000           IF  CURR-CONTROLS  IS EQUAL TO  HIGH-VALUES
117700000000               GO TO MLR-0040.
117800000000
117900000000           MOVE CURR-CONTROLS          TO  PREV-CONTROLS.
118000000000           GO TO MLR-0010.
118100000000
118200000000       MLR-0040.
118300000000           PERFORM END-JOB-RTN        THRU EJR-EXIT.
118400000000           STOP RUN.
118500000000      /
118600000000       GET-CURRENT-RECORD.
118700000000
118800000000      ******************************************************************
118900000000      *                                                                *
119000000000      *    G E T   C U R R E N T   R E C O R D   R O U T I N E         *
119100000000      *                                                                *
119200000000      ******************************************************************
119300000000
119400000000      *****
119500000000      *****    Read through the Statement Data records.
119600000000      *****
119700000000
119800980610           READ STMT-DTA-FILE          AT  END
119900000000               MOVE HIGH-VALUES        TO  CURR-CONTROLS
120000000000               GO TO GCR-EXIT.
120100000000
120200000000           MOVE STMT-DTA-REC           TO  MFASTMTFP-SECTION.
120300000000           ADD 1                       TO  WS-STMT-DTA-RCNT.
120400000000
120500000000      *****
120600000000      *****    Format the current controls.
120700000000      *****
120800980128           MOVE PR-START-DATE          TO  CURR-START-DATE.
120900980128           MOVE PR-END-DATE            TO  CURR-END-DATE.
121000000000           MOVE PR-INVESTOR-NO         TO  CURR-INVESTOR-NO.
121100000000
121200000000       GCR-EXIT.
121300000000           EXIT.
121400000000      /
121500000000       DETAIL-PROCESS-RTN.
121600000000
121700000000      ******************************************************************
121800000000      *                                                                *
121900000000      *    D E T A I L   P R O C E S S   R O U T I N E                 *
122000000000      *                                                                *
122100000000      ******************************************************************
122200000000
122300000000      *****
122400000000      *****    Process the Statement Data record depending on the
122500000000      *****    section number.  If it cannot be identified, an error
122600000000      *****    message will be printed and the record bypassed.
122700000000      *****
122800000000
122900000000           IF  PR-SECTION-NO  IS EQUAL TO  "00"
123000000000               GO TO DPR-0010.
123100000000
123200000000           IF  PR-SECTION-NO  IS EQUAL TO  "01"
123300000000               GO TO DPR-0020.
123400000000
123500000000           IF  PR-SECTION-NO  IS EQUAL TO  "05"
123600000000               GO TO DPR-0030.
123700000000
123800000000           IF  PR-SECTION-NO  IS EQUAL TO  "10"
123900000000               GO TO DPR-0040.
124000000000
124100010307RF8633     IF  PR-SECTION-NO  IS EQUAL TO  "12"
124200010307               GO TO DPR-0045.
124300010307
124400000000           IF  PR-SECTION-NO  IS EQUAL TO  "15"
124500000000               GO TO DPR-0050.
124600000000
124700030821R18091     IF  PR-SECTION-NO  IS EQUAL TO  "17"
124800030821R18091         GO TO DPR-0055.
124900030821
125000000000           IF  PR-SECTION-NO  IS EQUAL TO  "20"
125100000000               GO TO DPR-0060.
125200000000
125300060615R35042     IF  PR-SECTION-NO  IS EQUAL TO  "21"
125400060615R35042         GO TO DPR-0060-10.
125500060615
125600130408117038     IF  PR-SECTION-NO  IS EQUAL TO  "22"
125700130408117038         GO TO DPR-0060-22.
125800130408
125900010321RF8633     IF  PR-SECTION-NO  IS EQUAL TO  "25"
126000010321               GO TO DPR-0060-20.
126100010321
126200000515RF7051     IF  PR-SECTION-NO  IS EQUAL TO  "30"
126300000515               GO TO DPR-0060-30.
126400000515
126500040406R20870     IF  PR-SECTION-NO  IS EQUAL TO  "33"
126600040406               GO TO DPR-0060-33.
126700040406
126800000515           IF  PR-SECTION-NO  IS EQUAL TO  "35"
126900000515RF7051         GO TO DPR-0060-35.
127000000515
127100040406R20870     IF  PR-SECTION-NO  IS EQUAL TO  "38"
127200040406               GO TO DPR-0060-38.
127300040406
127400010124RF8558     IF  PR-SECTION-NO  IS EQUAL TO  "40"
127500010124               GO TO DPR-0060-40.
127600010124
127700010124           IF  PR-SECTION-NO  IS EQUAL TO  "43"
127800010124               GO TO DPR-0060-43.
127900010124
128000010124           IF  PR-SECTION-NO  IS EQUAL TO  "45"
128100010124RF8558         GO TO DPR-0060-45.
128200010124
128300000000           IF  PR-SECTION-NO  IS EQUAL TO  "50"
128400000000               GO TO DPR-0070.
128500000000
128600000000           IF  PR-SECTION-NO  IS EQUAL TO  "60"
128700000000               GO TO DPR-0080.
128800971026
128900981218           IF  PR-SECTION-NO  IS EQUAL TO  "62"
129000981218               GO TO DPR-0080-0000.
129100981218
129200091119R69515     IF  PR-SECTION-NO  IS EQUAL TO  "63"
129300091119R69515         GO TO DPR-0080-0005.
129400091119
129500980519           IF  PR-SECTION-NO  IS EQUAL TO  "65"
129600980519               GO TO DPR-0110.
129700980519
129800000515RF7051     IF  PR-SECTION-NO  IS EQUAL TO  "67"
129900000515               GO TO DPR-0110-67.
130000000515
130100971026           IF  PR-SECTION-NO  IS EQUAL TO  "70"
130200971026               GO TO DPR-0080-0010.
130300000000
130400000000           IF  PR-SECTION-NO  IS EQUAL TO  "80"
130500000000               GO TO DPR-0090.
130600000000
130700000000           IF  PR-SECTION-NO  IS EQUAL TO  "82"
130800000000               GO TO DPR-0100.
130900000000
131000000515RF7051     IF  PR-SECTION-NO  IS EQUAL TO  "84"
131100000515               GO TO DPR-0100-84.
131200010124
131300010124RF8558     IF  PR-SECTION-NO  IS EQUAL TO  "90"
131400010124               GO TO DPR-0100-90.
131500000515
131600061026R36342     IF  PR-SECTION-NO  IS EQUAL TO  "99"
131700061026R36342         GO TO DPR-EXIT.
131800061026
131900000000           PERFORM PRINT-ERR-LINE     THRU PEL-EXIT.
132000000000           GO TO DPR-EXIT.
132100000000
132200000000       DPR-0010.
132300000000
132400000000      *****
132500000000      *****    Processing a Delivery Information record.  Increment the
132600000000      *****    record count, the record will be processed by the
132700000000      *****    End-of-job Logic Routine.
132800000000      *****
132900000000
133000000000           MOVE MFASTMTFP-SECTION      TO  DELIVERY-INFO-SECTION.
133100000000           ADD 1                       TO  WS-STMT-DTA-RCNT-00.
133200031120
133300031120R18312     IF  DI-STMT-TYPE-IND   IS EQUAL TO  "I"
133400031120  ¦            MOVE  "Investor"     TO HL2H-STMT-TYPE
133500031120  ¦        END-IF.
133600031120  ¦
133700031120  ¦        IF  DI-STMT-TYPE-IND   IS EQUAL TO  "D"
133800031120  ¦            MOVE  "Dealer"       TO HL2H-STMT-TYPE
133900031120  ¦        END-IF.
134000031120  ¦
134100031120  ¦        IF  DI-STMT-TYPE-IND   IS EQUAL TO  "R"
134200031120  ¦            MOVE  "Dealer-Rep"   TO HL2H-STMT-TYPE
134300031120R18312     END-IF.
134400031120
134500000000           GO TO DPR-EXIT.
134600000000
134700000000       DPR-0020.
134800000000
134900000000      *****
135000000000      *****    Processing an Investor Information record.  Increment the
135100000000      *****    record count, write the record to the appropriate extract
135200000000      *****    file and increment the output record count.
135300000000      *****
135400000000
135500000000           MOVE MFASTMTFP-SECTION      TO  INVESTOR-INFO-SECTION.
135600000000           ADD 1                       TO  WS-STMT-DTA-RCNT-01.
135700031106R18312         IF II-LANGUAGE-CODE = "E"
135800031106  ¦              IF  II-HOLD-MAIL = "Y"
135900031106  ¦              ADD 1 TO WS-STMT-DTA-RCNT-ENGHLD
136000031106  ¦              ELSE
136100031106  ¦              ADD 1 TO WS-STMT-DTA-RCNT-ENG
136200031106  ¦              END-IF
136300031106  ¦            END-IF
136400031106  ¦
136500031106  ¦            IF II-LANGUAGE-CODE = "F"
136600031106  ¦              IF  II-HOLD-MAIL = "Y"
136700031106  ¦              ADD 1 TO WS-STMT-DTA-RCNT-FRNHLD
136800031106  ¦              ELSE
136900031106  ¦              ADD 1 TO WS-STMT-DTA-RCNT-FRN
137000031106  ¦              END-IF
137100031106R18312         END-IF
137200031106
137300000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
137400031106
137500000000           ADD 1                       TO  WS-STMT-WCNT-01 (ST, SW).
137600031106R18312         IF II-LANGUAGE-CODE = "E"
137700031106  ¦              IF  II-HOLD-MAIL = "Y"
137800061102R36342           ADD 1 TO WS-STMT-WCNT-ENGHLD (ST, SW)
137900031106  ¦              ELSE
138000061102R36342           ADD 1 TO WS-STMT-WCNT-ENG (ST, SW)
138100031106  ¦              END-IF
138200031106  ¦            END-IF
138300031106  ¦
138400031106  ¦            IF II-LANGUAGE-CODE = "F"
138500031106  ¦              IF  II-HOLD-MAIL = "Y"
138600061102R36342           ADD 1 TO WS-STMT-WCNT-FRNHLD (ST, SW)
138700031106  ¦              ELSE
138800061102R36342           ADD 1 TO WS-STMT-WCNT-FRN (ST, SW)
138900031106  ¦              END-IF
139000031106R18312         END-IF
139100000000           GO TO DPR-EXIT.
139200000000
139300000000       DPR-0030.
139400000000
139500000000      *****
139600000000      *****    Processing a Dealer record.  Increment the record count,
139700000000      *****    write the record to the appropriate extract file and
139800000000      *****    increment the output record count.
139900000000      *****
140000000000
140100000000           ADD 1                       TO  WS-STMT-DTA-RCNT-05.
140200000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
140300000000           ADD 1                       TO  WS-STMT-WCNT-05 (ST, SW).
140400000000           GO TO DPR-EXIT.
140500000000
140600000000       DPR-0040.
140700000000
140800000000      *****
140900000000      *****    Processing an Investor Summary record.  Increment the
141000000000      *****    record count, write the record to the appropriate extract
141100000000      *****    file and increment the output record count.
141200000000      *****
141300000000
141400000000           ADD 1                       TO  WS-STMT-DTA-RCNT-10.
141500000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
141600000000           ADD 1                       TO  WS-STMT-WCNT-10 (ST, SW).
141700000000           GO TO DPR-EXIT.
141800000000
141900010307RF8633 DPR-0045.
142000010307
142100010307      *****
142200010307      *****    Processing an Investor-Summary-Section-2. Increment the
142300010307      *****    record count, write the record to the appropriate extrac
142400010307      *****    file and increment the output record count.
142500010307      *****
142600010307
142700010307           ADD 1                       TO  WS-STMT-DTA-RCNT-12.
142800010307           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
142900010307           ADD 1                       TO  WS-STMT-WCNT-12 (ST, SW).
143000010307           GO TO DPR-EXIT.
143100010307
143200000000       DPR-0050.
143300000000
143400000000      *****
143500000000      *****    Processing an Account Asset Class Summary record.
143600000000      *****    Increment the record count, write the record to the
143700000000      *****    appropriate extract file and increment the output record
143800000000      *****    count.
143900000000      *****
144000000000
144100000000           ADD 1                       TO  WS-STMT-DTA-RCNT-15.
144200000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
144300000000           ADD 1                       TO  WS-STMT-WCNT-15 (ST, SW).
144400000000           GO TO DPR-EXIT.
144500000000
144600030821       DPR-0055.
144700030821
144800030821      *****
144900030821      *****    Processing an Account IPS Details record.
145000030821      *****    Increment the record count, write the record to the
145100030821      *****    appropriate extract file and increment the output record
145200030821      *****    count.
145300030821      *****
145400030821
145500030821           ADD 1                       TO  WS-STMT-DTA-RCNT-17.
145600030821           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
145700030821           ADD 1                       TO  WS-STMT-WCNT-17 (ST, SW).
145800030821           GO TO DPR-EXIT.
145900030821
146000000000       DPR-0060.
146100000000
146200000000      *****
146300000000      *****    Processing an Account Detail record.  Update the input
146400000000      *****    counts/totals, write the record to the appropriate
146500000000      *****    extract file and update the output counts/totals.
146600000000      *****
146700000000
146800000000           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-DETAILS-SECTION.
146900000000           ADD 1                       TO  WS-STMT-DTA-RCNT-20.
147000001011      *    ADD AD-BOOK-VALUE           TO  WS-STMT-DTA-RCNT-BV.
147100001011RF7776     ADD AD-BOOK-VALUE-BASE      TO  WS-STMT-DTA-RCNT-BV.
147200000000           ADD AD-MARKET-VALUE         TO  WS-STMT-DTA-RCNT-MV.
147300000000           ADD AD-NO-OF-UNITS          TO  WS-STMT-DTA-RCNT-UN.
147400000000           ADD AD-LAST-UNIT-PRICE      TO  WS-STMT-DTA-RCNT-UP.
147500031106R18312         IF  AD-SECTION-SEQUENCE = 999999
147600031106  ¦               AND  AD-NOMINEE = "N"
147700031106  ¦                ADD 1     TO  WS-STMT-DTA-RCNT-CLTHLD
147800031124  ¦                ADD 1     TO  WS-STMT-DTA-RCNT-ACCTOT
147900031106  ¦            END-IF
148000031106  ¦
148100031106  ¦            IF  AD-SECTION-SEQUENCE = 999999
148200031106  ¦               AND  AD-NOMINEE = "Y"
148300031106  ¦                ADD 1     TO  WS-STMT-DTA-RCNT-NOMHLD
148400031124  ¦                ADD 1     TO  WS-STMT-DTA-RCNT-ACCTOT
148500031106R18312         END-IF
148600031124
148700000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
148800000000           ADD 1                       TO  WS-STMT-WCNT-20 (ST, SW).
148900001011      *    ADD AD-BOOK-VALUE           TO  WS-STMT-WCNT-BV (ST, SW).
149000001011RF7776     ADD AD-BOOK-VALUE-BASE      TO  WS-STMT-WCNT-BV (ST, SW).
149100000000           ADD AD-MARKET-VALUE         TO  WS-STMT-WCNT-MV (ST, SW).
149200000000           ADD AD-NO-OF-UNITS          TO  WS-STMT-WCNT-UN (ST, SW).
149300000000           ADD AD-LAST-UNIT-PRICE      TO  WS-STMT-WCNT-UP (ST, SW).
149400031106R18312         IF  AD-SECTION-SEQUENCE = 999999
149500031106  ¦               AND  AD-NOMINEE = "N"
149600031106  ¦                ADD 1     TO  WS-STMT-WCNT-CLTHLD (ST, SW)
149700031124  ¦                ADD 1     TO  WS-STMT-WCNT-ACCTOT (ST, SW)
149800031106  ¦            END-IF
149900031106  ¦
150000031106  ¦            IF  AD-SECTION-SEQUENCE = 999999
150100031106  ¦               AND  AD-NOMINEE = "Y"
150200031106  ¦                ADD 1     TO  WS-STMT-WCNT-NOMHLD (ST, SW)
150300031124  ¦                ADD 1     TO  WS-STMT-WCNT-ACCTOT (ST, SW)
150400031106R18312         END-IF
150500000000           GO TO DPR-EXIT.
150600010321
150700060615R35042 DPR-0060-10.
150800060615  ¦
150900060615  ¦   *****
151000060615  ¦   *****    Processing an ACCOUNT-ADDITIONAL-INFO SECTION record.
151100060615  ¦   *****    Increment the record count, write the record to the
151200060615  ¦   *****    appropriate extract file and increment the output record
151300060615  ¦   *****    count.
151400060615  ¦   *****
151500060615  ¦
151600060615  ¦        ADD 1                       TO  WS-STMT-DTA-RCNT-21.
151700060615  ¦        PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
151800060615  v        ADD 1                       TO  WS-STMT-WCNT-21 (ST, SW).
151900060615R35042     GO TO DPR-EXIT.
152000060615
152100130408117038 DPR-0060-22.
152200130408
152300130408117038     ADD 1                       TO  WS-STMT-DTA-RCNT-22.
152400130408117038     PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
152500130408117038     ADD 1                       TO  WS-STMT-WCNT-22 (ST, SW).
152600130408117038     GO TO DPR-EXIT.
152700130408
152800010321RF8633 DPR-0060-20.
152900010321
153000010321      *****
153100010321      *****    Processing an ACCOUNT-GIC-DETAILS-SECTION record.
153200010321      *****    Increment the record count, write the record to the
153300010321      *****    appropriate extract file and increment the output record
153400010321      *****    count.
153500010321      *****
153600010321
153700010321           ADD 1                       TO  WS-STMT-DTA-RCNT-25.
153800010321           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
153900010321           ADD 1                       TO  WS-STMT-WCNT-25 (ST, SW).
154000060615           GO TO DPR-EXIT.
154100010321
154200040406RF7051 DPR-0060-30.
154300000515
154400000515      *****
154500000515      *****    Processing an ACCOUNT-PERFORMANCE         record.
154600000515      *****    Increment the record count, write the record to the
154700000515      *****    appropriate extract file and increment the output record
154800000515      *****    count.
154900000515      *****
155000000515
155100000515           ADD 1                       TO  WS-STMT-DTA-RCNT-30.
155200000515           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
155300000515           ADD 1                       TO  WS-STMT-WCNT-30 (ST, SW).
155400000515           GO TO DPR-EXIT.
155500000515
155600040406R20870 DPR-0060-33.
155700040406
155800040406      *****
155900040406      *****    Processing an ACCOUNT-ROR-FRQ-SECTION     record.
156000040406      *****    Increment the record count, write the record to the
156100040406      *****    appropriate extract file and increment the output record
156200040406      *****    count.
156300040406      *****
156400040406
156500040406           ADD 1                       TO  WS-STMT-DTA-RCNT-33.
156600040406           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
156700040406           ADD 1                       TO  WS-STMT-WCNT-33 (ST, SW).
156800040406R20870     GO TO DPR-EXIT.
156900040406
157000000515       DPR-0060-35.
157100000515
157200000515      *****
157300000515      *****    Processing an ACCOUNT-FUND-PERFORMANCE    record.
157400000515      *****    Increment the record count, write the record to the
157500000515      *****    appropriate extract file and increment the output record
157600000515      *****    count.
157700000515      *****
157800000515
157900000515           ADD 1                       TO  WS-STMT-DTA-RCNT-35.
158000000515           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
158100000515           ADD 1                       TO  WS-STMT-WCNT-35 (ST, SW).
158200000515RF7051     GO TO DPR-EXIT.
158300010124
158400040406R20870 DPR-0060-38.
158500040406
158600040406      *****
158700040406      *****    Processing an ACCOUNT-FUND-ROR            record.
158800040406      *****    Increment the record count, write the record to the
158900040406      *****    appropriate extract file and increment the output record
159000040406      *****    count.
159100040406      *****
159200040406
159300040406           ADD 1                       TO  WS-STMT-DTA-RCNT-38.
159400040406           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
159500040406           ADD 1                       TO  WS-STMT-WCNT-38 (ST, SW).
159600040406RF7051     GO TO DPR-EXIT.
159700040406
159800010124RF8558 DPR-0060-40.
159900010124
160000010124      *****
160100010125      *****    Processing a SEG-FUND-CONTRACT-DETAILS record.
160200010124      *****    Increment the record count, write the record to the
160300010124      *****    appropriate extract file and increment the output record
160400010124      *****    count.
160500010125
160600010124
160700010124           ADD 1                       TO  WS-STMT-DTA-RCNT-40.
160800010124           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
160900010124           ADD 1                       TO  WS-STMT-WCNT-40 (ST, SW).
161000010124           GO TO DPR-EXIT.
161100010124
161200010124       DPR-0060-43.
161300010124
161400010124      *****
161500010125      *****    Processing a SEG-FUND-CONTRACT-INVESTMENT-DETAILS record
161600010124      *****    Increment the record count, write the record to the
161700010124      *****    appropriate extract file and increment the output record
161800010124      *****    count.
161900010124      *****
162000010124
162100010124           ADD 1                       TO  WS-STMT-DTA-RCNT-43.
162200010124           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
162300010124           ADD 1                       TO  WS-STMT-WCNT-43 (ST, SW).
162400010124           GO TO DPR-EXIT.
162500010124
162600010124       DPR-0060-45.
162700010124
162800010124      *****
162900010125      *****    Processing a ANNUITANT-DETAILS record.
163000010125      *****    Increment the record count,
163100010125      *****    write the record to the appropriate extract file
163200010124      *****    and increment the output record count.
163300010124      *****
163400010124
163500010124           ADD 1                       TO  WS-STMT-DTA-RCNT-45.
163600010124           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
163700010124           ADD 1                       TO  WS-STMT-WCNT-45 (ST, SW).
163800010124RF8558     GO TO DPR-EXIT.
163900010124
164000000000       DPR-0070.
164100000000
164200000000      *****
164300000000      *****    Processing a Rollover record.  Increment the record
164400000000      *****    count, write the record to the appropriate extract file
164500000000      *****    and increment the output record count.
164600000000      *****
164700000000
164800000000           ADD 1                       TO  WS-STMT-DTA-RCNT-50.
164900000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
165000000000           ADD 1                       TO  WS-STMT-WCNT-50 (ST, SW).
165100000000           GO TO DPR-EXIT.
165200000000
165300000000       DPR-0080.
165400000000
165500000000      *****
165600000000      *****    Processing a RRIF Detail record.  Increment the record
165700000000      *****    count, write the record to the appropriate extract file
165800000000      *****    and increment the output record count.
165900000000      *****
166000000000
166100000000           ADD 1                       TO  WS-STMT-DTA-RCNT-60.
166200000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
166300000000           ADD 1                       TO  WS-STMT-WCNT-60 (ST, SW).
166400000000           GO TO DPR-EXIT.
166500971026
166600981218       DPR-0080-0000.
166700981218
166800981218      *****
166900981218      *****    Processing a RESP Detail record.  Increment the record
167000981218      *****    count, write the record to the appropriate extract file
167100981218      *****    and increment the output record count.
167200981218      *****
167300981218
167400981218           ADD 1                       TO  WS-STMT-DTA-RCNT-62.
167500981218           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
167600981218           ADD 1                       TO  WS-STMT-WCNT-62 (ST, SW).
167700981218           GO TO DPR-EXIT.
167800981218
167900091119R69515 DPR-0080-0005.
168000091119  ¦
168100091119  ¦   *****
168200091119  ¦   *****    Processing an RDSP-ACCOUNT SECTION record.
168300091119  ¦   *****    Increment the record count, write the record to the
168400091119  ¦   *****    appropriate extract file and increment the output record
168500091119  ¦   *****    count.
168600091119  ¦   *****
168700091119  ¦
168800091119  ¦        ADD 1                       TO  WS-STMT-DTA-RCNT-63.
168900091119  ¦        PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
169000091119  v        ADD 1                       TO  WS-STMT-WCNT-63 (ST, SW).
169100091119R69515     GO TO DPR-EXIT.
169200091119
169300971026       DPR-0080-0010.
169400971026
169500971026      *****
169600971026      *****    Processing a Systematic Plan Info record.  Increment the
169700971026      *****    record count, write the record to the appropriate extract
169800971026      *****    file and increment the output record count.
169900971026      *****
170000971026
170100971026           ADD 1                       TO  WS-STMT-DTA-RCNT-70.
170200971026           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
170300971026           ADD 1                       TO  WS-STMT-WCNT-70 (ST, SW).
170400971026           GO TO DPR-EXIT.
170500000000
170600000000       DPR-0090.
170700000000
170800000000      *****
170900000000      *****    Processing an Account Transaction record.  Update the
171000000000      *****    input counts/totals, write the record to the appropriate
171100000000      *****    extract file and update the output counts/totals.
171200000000      *****
171300000000
171400000000           MOVE MFASTMTFP-SECTION      TO  ACCOUNT-TXN-SECTION.
171500000000           ADD 1                       TO  WS-STMT-DTA-RCNT-80.
171600000000           ADD AT-UNIT-BALANCE         TO  WS-STMT-DTA-RCNT-UB.
171700000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
171800000000           ADD 1                       TO  WS-STMT-WCNT-80 (ST, SW).
171900000000           ADD AT-UNIT-BALANCE         TO  WS-STMT-WCNT-UB (ST, SW).
172000000000           GO TO DPR-EXIT.
172100000000
172200000000       DPR-0100.
172300000000
172400000000      *****
172500000000      *****    Processing an Account Transaction Institution Detail
172600000000      *****    record.  Increment the record count, write the record to
172700000000      *****    the appropriate extract file and increment the output
172800000000      *****    record count.
172900000000      *****
173000000000
173100000000           ADD 1                       TO  WS-STMT-DTA-RCNT-82.
173200000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
173300000000           ADD 1                       TO  WS-STMT-WCNT-82 (ST, SW).
173400000000           GO TO DPR-EXIT.
173500000000
173600000515       DPR-0100-84.
173700000515
173800000515      *****
173900000515      *****    Processing a Transaction RESP Detail
174000000515      *****    record.  Increment the record count, write the record to
174100000515      *****    the appropriate extract file and increment the output
174200000515      *****    record count.
174300000515      *****
174400000515
174500000515           ADD 1                       TO  WS-STMT-DTA-RCNT-84.
174600000515           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
174700000515           ADD 1                       TO  WS-STMT-WCNT-84 (ST, SW).
174800000515           GO TO DPR-EXIT.
174900000515
175000010125RF8558 DPR-0100-90.
175100010125
175200010125      *****
175300010125      *****    Processing a RESET CONTRACT DETAILS record.
175400010125      *****    Increment the record count, write the record to
175500010125      *****    the appropriate extract file and increment the output
175600010125      *****    record count.
175700010125      *****
175800010125
175900010125           ADD 1                       TO  WS-STMT-DTA-RCNT-90.
176000010125           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
176100010125           ADD 1                       TO  WS-STMT-WCNT-90 (ST, SW).
176200010125           GO TO DPR-EXIT.
176300010125
176400980519       DPR-0110.
176500980519
176600980519      *****
176700980519      *****    Processing an Group Information record.
176800980519      *****    Increment the record count, write the record to
176900980519      *****    the appropriate extract file and increment the output
177000980519      *****    record count.
177100980519      *****
177200980519
177300000515           ADD 1                       TO  WS-STMT-DTA-RCNT-65.
177400980519           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
177500000515           ADD 1                       TO  WS-STMT-WCNT-65 (ST, SW).
177600980519           GO TO DPR-EXIT.
177700000000
177800000515       DPR-0110-67.
177900000515
178000000515      *****
178100000515      *****    Processing an Beneficiary Information record.
178200000515      *****    Increment the record count, write the record to
178300000515      *****    the appropriate extract file and increment the output
178400000515      *****    record count.
178500000515      *****
178600000515
178700000515           ADD 1                       TO  WS-STMT-DTA-RCNT-67.
178800000515           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
178900000515           ADD 1                       TO  WS-STMT-WCNT-67 (ST, SW).
179000000515           GO TO DPR-EXIT.
179100000515
179200000000       DPR-EXIT.
179300000000           EXIT.
179400000000      /
179500000000       PRINT-ERR-LINE.
179600000000
179700000000      ******************************************************************
179800000000      *                                                                *
179900000000      *    P R I N T   E R R O R   L I N E   R O U T I N E             *
180000000000      *                                                                *
180100000000      ******************************************************************
180200000000
180300000000      *****
180400000000      *****    Format and print the error line.
180500000000      *****
180600000000
180700000000           MOVE SPACES                 TO  ERROR-LINE-1.
180800000000           MOVE PR-INVESTOR-NO         TO  EL1-INVESTOR-NO.
180900000000           MOVE PR-ACCOUNT             TO  EL1-ACCOUNT.
181000000000           MOVE PR-SECTION-NO          TO  EL1-SECTION-NO.
181100000000           MOVE "-"                    TO  EL1-SECTION-LITDSH.
181200000000           MOVE PR-SECTION-SEQUENCE    TO  EL1-SECTION-SEQUENCE.
181300000000           MOVE PR-LANGUAGE-CODE       TO  EL1-LANGUAGE-CODE.
181400000000           MOVE PR-DEALER              TO  EL1-DEALER.
181500000000           MOVE PR-DEALER-REP-CODE     TO  EL1-DEALER-REP-CODE.
181600000000           MOVE "INVALID SECTION"      TO  EL1-MSG.
181700000000
181800000000      *****
181900000000      *****    If the page is full, start a new page and print the
182000000000      *****    Heading lines.
182100000000      *****
182200000000
182300000000           IF  WS-LNECNT  IS GREATER THAN  WS-LNEMAX
182400000000               PERFORM PRINT-HDG-LINE THRU PHL-EXIT.
182500000000
182600000000      *****
182700000000      *****    Print the error line.
182800000000      *****
182900000000
183000000000           WRITE PRINT-REC           FROM  ERROR-LINE-1
183100000000                         AFTER  ADVANCING  1.
183200000000           ADD 1                       TO  WS-LNECNT.
183300000000
183400000000       PEL-EXIT.
183500000000           EXIT.
183600000000      /
183700000000       LEVEL-SUMMARY-1.
183800000000
183900000000      ******************************************************************
184000000000      *                                                                *
184100000000      *    L E V E L   S U M M A R I Z A T I O N   1   R O U T I N E   *
184200000000      *                                                                *
184300000000      *        INVESTOR-NO:            Investor Number                 *
184400000000      *                                                                *
184500000000      ******************************************************************
184600000000
184700000000      *****
184800000000      *****    If the Investor Number is zeroes, bypass this routine.
184900000000      *****
185000000000
185100000000           IF  PREV-INVESTOR-NO  EQUAL TO  ZEROES
185200000000               GO TO LS1-EXIT.
185300000000
185400000000      *****
185500000000      *****    Null routine.
185600000000      *****
185700000000
185800000000           CONTINUE.
185900000000
186000000000       LS1-EXIT.
186100000000           EXIT.
186200000000      /
186300000000       LEVEL-REINIT-1.
186400000000
186500000000      ******************************************************************
186600000000      *                                                                *
186700000000      *    L E V E L   R E I N I T I A L I Z A T I O N   1   R T N .   *
186800000000      *                                                                *
186900000000      *        INVESTOR-NO:            Investor Number                 *
187000000000      *                                                                *
187100000000      ******************************************************************
187200000000
187300000000      *****
187400000000      *****    If the Investor Number is zeroes, bypass this routine.
187500000000      *****
187600000000
187700980128           IF  CURR-INVESTOR-NO IS EQUAL
187800980128                                       TO  ZEROES
187900000000               GO TO LR1-EXIT.
188000000000
188100000000      *****
188200000000      *****    Determine which statement file the investor statements
188300000000      *****    records are to be written to.  It is assumed that the
188400000000      *****    first record for the Investor will be the Investor
188500000000      *****    Information.
188600971028      *****
188700971028      *****    NOTE:   AIC will only produce a Canadian English and a
188800971028      *****            Canadian English Hold Mail file.
188900000000      *****
189000000000
189100000000           MOVE MFASTMTFP-SECTION      TO  INVESTOR-INFO-SECTION.
189200971028           IF  WS-LDA-MGMT-COM-CDE
189300971028                              IS EQUAL TO  "AIC"
189400971028               SET ST                  TO  1
189500971028               GO TO LR1-0010.
189600971028
189700000000           IF  WS-LDA-ALLTYP NOT EQUAL TO  "I"
189800000000           OR  WS-LDA-MGMT-COM-CDE
189900000000                          IS NOT EQUAL TO  "AIC"
190000000000               SET ST                  TO  1
190100000000               GO TO LR1-0010.
190200000000
190300000000           IF  II-COUNTRY-CODE   EQUAL TO  "CAN"
190400000000               SET ST                  TO  1
190500000000               GO TO LR1-0010.
190600000000
190700000000           IF  II-COUNTRY-CODE   EQUAL TO  "USA"
190800000000               SET ST                  TO  2
190900000000               GO TO LR1-0010.
191000000000
191100000000           SET ST                      TO  3.
191200000000
191300000000       LR1-0010.
191400000000           IF  II-LANGUAGE-CODE  EQUAL TO  "F"
191500971028           AND WS-LDA-MGMT-COM-CDE
191600971028                          IS NOT EQUAL TO  "AIC"
191700000000               GO TO LR1-0020.
191800980609
191900980609           IF  WS-LDA-MGMT-COM-CDE
192000980609                              IS EQUAL TO  "GGF"
192100980609           AND WS-LDA-ALLTYP NOT EQUAL TO  "I"
192200980609               GO TO LR1-0010-0010.
192300000000
192400980609           IF  II-HOLD-MAIL  NOT EQUAL TO  "Y"
192500980609               SET SW                  TO  1
192600000000               GO TO LR1-0030.
192700000000
192800980609           SET SW                      TO  2.
192900000000           GO TO LR1-0030.
193000980609
193100980609       LR1-0010-0010.
193200980609           SET SW                      TO  1.
193300980609           GO TO LR1-0030.
193400000000
193500000000       LR1-0020.
193600980609           IF  WS-LDA-MGMT-COM-CDE
193700980609                              IS EQUAL TO  "GGF"
193800980609           AND WS-LDA-ALLTYP NOT EQUAL TO  "I"
193900980609               GO TO LR1-0020-0010.
194000980609
194100000000           IF  II-HOLD-MAIL  NOT EQUAL TO  "Y"
194200980609               SET SW                  TO  4
194300000000               GO TO LR1-0030.
194400000000
194500980609           SET SW                      TO  5.
194600980609           GO TO LR1-0030.
194700980609
194800980609       LR1-0020-0010.
194900980609           SET SW                      TO  4.
195000980609           GO TO LR1-0030.
195100000000
195200000000       LR1-0030.
195300000000           CONTINUE.
195400000000
195500000000       LR1-EXIT.
195600000000           EXIT.
195700000000      /
195800000000       INITIAL-LOGIC-RTN.
195900000000
196000000000      ******************************************************************
196100000000      *                                                                *
196200000000      *    I N I T I A L   L O G I C   R O U T I N E                   *
196300000000      *                                                                *
196400000000      ******************************************************************
196500000000
196600000000      *****
196700000000      *****    Retrieve the local data area parameters.
196800000000      *****
196900000000
197000000000           ACCEPT WS-LOCAL-DATA-AREA FROM  WS-LOCAL.
197100000000
197200000000      *****
197300000000      *****    Initialize the program defined work items.
197400000000      *****
197500000000
197600000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT.
197700000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-BV.
197800000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-MV.
197900000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-UB.
198000010307           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-UN.
198100000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-UP.
198200000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-00.
198300000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-01.
198400000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-05.
198500000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-10.
198600010307RF8633     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-12.
198700000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-15.
198800030821R18091     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-17.
198900000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-20.
199000060615R35042     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-21.
199100130408117038     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-22.
199200010321RF8633     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-25.
199300000515RF7051     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-30.
199400040406R20870     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-33.
199500010124           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-35.
199600040406R20870     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-38.
199700010124RF8558     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-40.
199800010307RF8558     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-43.
199900010307RF8558     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-45.
200000000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-50.
200100000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-60.
200200981218           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-62.
200300091119R69515     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-63.
200400980519           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-65.
200500000515           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-67.
200600971026           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-70.
200700000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-80.
200800000000           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-82.
200900000515           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-84.
201000031106           MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-90.
201100031106R18312     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-CLTHLD.
201200031106  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-NOMHLD.
201300031106  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-ENG.
201400031106  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-ENGHLD.
201500031106  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-FRN.
201600031124  ¦        MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-FRNHLD.
201700031124R18312     MOVE ZEROES                 TO  WS-STMT-DTA-RCNT-ACCTOT.
201800000000           MOVE 3                      TO  WS-ST-MAX.
201900980609           MOVE 6                      TO  WS-SW-MAX.
202000000000
202100000000           SET ST                      TO  1.
202200000000           SET SW                      TO  1.
202300000000
202400000000       ILR-0010.
202500000000           MOVE ZEROES                 TO  WS-STMT-WCNT (ST, SW).
202600000000           MOVE ZEROES                 TO  WS-STMT-WCNT-BV (ST, SW).
202700000000           MOVE ZEROES                 TO  WS-STMT-WCNT-MV (ST, SW).
202800000000           MOVE ZEROES                 TO  WS-STMT-WCNT-UB (ST, SW).
202900000000           MOVE ZEROES                 TO  WS-STMT-WCNT-UN (ST, SW).
203000000000           MOVE ZEROES                 TO  WS-STMT-WCNT-UP (ST, SW).
203100000000           MOVE ZEROES                 TO  WS-STMT-WCNT-00 (ST, SW).
203200000000           MOVE ZEROES                 TO  WS-STMT-WCNT-01 (ST, SW).
203300000000           MOVE ZEROES                 TO  WS-STMT-WCNT-05 (ST, SW).
203400000000           MOVE ZEROES                 TO  WS-STMT-WCNT-10 (ST, SW).
203500010307RF8633     MOVE ZEROES                 TO  WS-STMT-WCNT-12 (ST, SW).
203600000000           MOVE ZEROES                 TO  WS-STMT-WCNT-15 (ST, SW).
203700030821R18091     MOVE ZEROES                 TO  WS-STMT-WCNT-17 (ST, SW).
203800000000           MOVE ZEROES                 TO  WS-STMT-WCNT-20 (ST, SW).
203900060615R35042     MOVE ZEROES                 TO  WS-STMT-WCNT-21 (ST, SW).
204000130408117038     MOVE ZEROES                 TO  WS-STMT-WCNT-22 (ST, SW).
204100010321RF8633     MOVE ZEROES                 TO  WS-STMT-WCNT-25 (ST, SW).
204200000515RF7051     MOVE ZEROES                 TO  WS-STMT-WCNT-30 (ST, SW).
204300040406R20870     MOVE ZEROES                 TO  WS-STMT-WCNT-33 (ST, SW).
204400000515           MOVE ZEROES                 TO  WS-STMT-WCNT-35 (ST, SW).
204500040406R20870     MOVE ZEROES                 TO  WS-STMT-WCNT-38 (ST, SW).
204600010124RF8558     MOVE ZEROES                 TO  WS-STMT-WCNT-40 (ST, SW).
204700010307RF8558     MOVE ZEROES                 TO  WS-STMT-WCNT-43 (ST, SW).
204800010307RF8558     MOVE ZEROES                 TO  WS-STMT-WCNT-45 (ST, SW).
204900000000           MOVE ZEROES                 TO  WS-STMT-WCNT-50 (ST, SW).
205000000000           MOVE ZEROES                 TO  WS-STMT-WCNT-60 (ST, SW).
205100981218           MOVE ZEROES                 TO  WS-STMT-WCNT-62 (ST, SW).
205200091119R69515     MOVE ZEROES                 TO  WS-STMT-WCNT-63 (ST, SW).
205300980519           MOVE ZEROES                 TO  WS-STMT-WCNT-65 (ST, SW).
205400000515           MOVE ZEROES                 TO  WS-STMT-WCNT-67 (ST, SW).
205500971026           MOVE ZEROES                 TO  WS-STMT-WCNT-70 (ST, SW).
205600000000           MOVE ZEROES                 TO  WS-STMT-WCNT-80 (ST, SW).
205700000000           MOVE ZEROES                 TO  WS-STMT-WCNT-82 (ST, SW).
205800000515           MOVE ZEROES                 TO  WS-STMT-WCNT-84 (ST, SW).
205900010124RF8558     MOVE ZEROES                 TO  WS-STMT-WCNT-90 (ST, SW).
206000031106R18312     MOVE ZEROES               TO  WS-STMT-WCNT-CLTHLD (ST, SW).
206100031106  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-NOMHLD (ST, SW).
206200031106  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-ENG    (ST, SW).
206300031106  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-ENGHLD (ST, SW).
206400031106  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-FRN    (ST, SW).
206500031124  ¦        MOVE ZEROES               TO  WS-STMT-WCNT-FRNHLD (ST, SW).
206600031124R18312     MOVE ZEROES               TO  WS-STMT-WCNT-ACCTOT (ST, SW).
206700000000           IF  SW            IS LESS THAN  WS-SW-MAX
206800000000               SET SW               UP BY  1
206900000000               GO TO ILR-0010.
207000000000
207100000000           IF  ST            IS LESS THAN  WS-ST-MAX
207200000000               SET ST               UP BY  1
207300000000               SET SW                  TO  1
207400000000               GO TO ILR-0010.
207500000000
207600000000           MOVE 99                     TO  WS-LNECNT.
207700000000           MOVE 60                     TO  WS-LNEMAX.
207800000000           MOVE ZEROES                 TO  WS-PGECNT.
207900000000
208000000000           MOVE "N"                    TO  WS-EOJHDG-SW.
208100000000
208200000000           MOVE LOW-VALUES             TO  CURR-CONTROLS.
208300000000           MOVE LOW-VALUES             TO  PREV-CONTROLS.
208400000000
208500000000      *****
208600000000      *****    Format the heading literals.
208700000000      *****
208800000000
208900000000           ACCEPT WS-DATE            FROM  DATE.
209000000000           MOVE WS-DATE-YY             TO  HL1-YY.
209100000000           MOVE WS-DATE-MM             TO  HL1-MM.
209200000000           MOVE WS-DATE-DD             TO  HL1-DD.
209300000000
209400000000           ACCEPT HL1-TIME           FROM  TIME.
209500000000           INSPECT HL1-TIME REPLACING ALL  SPACE
209600000000                                       BY  ":".
209700000000           MOVE "."                    TO  HL1-TIME-DOT.
209800000000
209900010411RF9964     IF WS-LDA-MGMT-COM-CDE     IS EQUAL TO  "TAI"
210000010525RF9523     OR WS-LDA-HOLD-MAIL        IS EQUAL TO  "Y"
210100010411              MOVE "AIC"              TO WS-LDA-MGMT-COM-CDE
210200010411           END-IF.
210300010411
210400000000      *****
210500000000      *****    Open the Input files.
210600000000      *****
210700000000
210800000000           OPEN    INPUT   STMT-DTA-FILE.
210900000000
211000000000      *****
211100000000      *****    Open the Output files.
211200000000      *****
211300000000
211400000000           OPEN    OUTPUT  STMT-ENG-FILE
211500000000                           STMT-ENGHLD-FILE
211600000000                           STMT-FRN-FILE
211700000000                           STMT-FRNHLD-FILE
211800000000                           PRINT-FILE.
211900000000
212000971028      *****
212100971028      *****    NOTE:   The following were previously for AIC only.  For
212200971028      *****            the time being, AIC will only be producing an
212300971028      *****            English and an English Hold Mail file, therefore
212400971028      *****            the lines are being bypassed.
212500971028      *****
212600971028
212700971028           IF  WS-LDA-MGMT-COM-CDE
212800971028                              IS EQUAL TO  "AIC"
212900971028               GO TO ILR-EXIT.
213000971028
213100971028           IF  WS-LDA-ALLTYP  IS EQUAL TO  "I"
213200971028           AND WS-LDA-MGMT-COM-CDE
213300971028                              IS EQUAL TO  "AIC"
213400971028               OPEN    OUTPUT  STMT-ENGF-FILE
213500971028                               STMT-ENGHLDF-FILE
213600971028                               STMT-ENGU-FILE
213700971028                               STMT-ENGHLDU-FILE
213800971028                               STMT-FRNF-FILE
213900971028                               STMT-FRNHLDF-FILE
214000971028                               STMT-FRNU-FILE
214100971028                               STMT-FRNHLDU-FILE.
214200000000
214300000000       ILR-EXIT.
214400000000           EXIT.
214500000000      /
214600000000       END-JOB-RTN.
214700000000
214800000000      ******************************************************************
214900000000      *                                                                *
215000000000      *    E N D   J O B   R O U T I N E                               *
215100000000      *                                                                *
215200000000      ******************************************************************
215300000000
215400000000      *****
215500000000      *****    Print the Control Report read values on a separate page.
215600000000      *****
215700000000
215800000000           MOVE "Y"                    TO  WS-EOJHDG-SW.
215900000000           MOVE 99                     TO  WS-LNECNT.
216000000000
216100000000           MOVE SPACES                 TO  CONTROL-LINE-1.
216200000000           MOVE WS-STMT-DTA-RLIT       TO  CL1-LIT.
216300000000           MOVE WS-STMT-DTA-RCNT       TO  CL1-CNT.
216400000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
216500000000
216600000000           MOVE SPACES                 TO  CONTROL-LINE-1.
216700000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
216800000000
216900000000           MOVE SPACES                 TO  CONTROL-LINE-1.
217000000000           MOVE WS-STMT-DTA-RLIT-00    TO  CL1-LIT.
217100000000           MOVE WS-STMT-DTA-RCNT-00    TO  CL1-CNT.
217200000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
217300000000
217400000000           MOVE SPACES                 TO  CONTROL-LINE-1.
217500000000           MOVE WS-STMT-DTA-RLIT-01    TO  CL1-LIT.
217600000000           MOVE WS-STMT-DTA-RCNT-01    TO  CL1-CNT.
217700000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
217800000000
217900000000           MOVE SPACES                 TO  CONTROL-LINE-1.
218000000000           MOVE WS-STMT-DTA-RLIT-05    TO  CL1-LIT.
218100000000           MOVE WS-STMT-DTA-RCNT-05    TO  CL1-CNT.
218200000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
218300000000
218400000000           MOVE SPACES                 TO  CONTROL-LINE-1.
218500000000           MOVE WS-STMT-DTA-RLIT-10    TO  CL1-LIT.
218600000000           MOVE WS-STMT-DTA-RCNT-10    TO  CL1-CNT.
218700000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
218800000000
218900010307RF8633     IF  WS-STMT-DTA-RCNT-12 IS GREATER THAN  ZEROES
219000010307               MOVE SPACES TO CONTROL-LINE-1
219100010307               MOVE WS-STMT-DTA-RLIT-12 TO  CL1-LIT
219200010307               MOVE WS-STMT-DTA-RCNT-12 TO  CL1-CNT
219300010307               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
219400010307
219500000000           IF  WS-STMT-DTA-RCNT-15
219600000000                          IS GREATER THAN  ZEROES
219700000000               MOVE SPACES             TO  CONTROL-LINE-1
219800000000               MOVE WS-STMT-DTA-RLIT-15
219900000000                                       TO  CL1-LIT
220000000000               MOVE WS-STMT-DTA-RCNT-15
220100000000                                       TO  CL1-CNT
220200000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
220300000000
220400030821R10891     IF  WS-STMT-DTA-RCNT-17 > ZEROES
220500030821  |            MOVE SPACES              TO  CONTROL-LINE-1
220600030821  |            MOVE WS-STMT-DTA-RLIT-17 TO  CL1-LIT
220700030821  |            MOVE WS-STMT-DTA-RCNT-17 TO  CL1-CNT
220800030821  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
220900030821
221000000000           MOVE SPACES                 TO  CONTROL-LINE-1.
221100030821           MOVE WS-STMT-DTA-RLIT-20    TO  CL1-LIT.
221200030821           MOVE WS-STMT-DTA-RCNT-20    TO  CL1-CNT.
221300030821           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
221400030821
221500060615R35042     IF  WS-STMT-DTA-RCNT-21
221600060615  ¦                       IS GREATER THAN  ZEROES
221700060615  ¦            MOVE SPACES             TO  CONTROL-LINE-1
221800060615  ¦            MOVE WS-STMT-DTA-RLIT-21
221900060615  ¦                                    TO  CL1-LIT
222000060615  ¦            MOVE WS-STMT-DTA-RCNT-21
222100060615  ¦                                    TO  CL1-CNT
222200060615  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
222300060615R35042     END-IF
222400130408
222500130408117038     IF  WS-STMT-DTA-RCNT-22
222600130408117038                    IS GREATER THAN  ZEROES
222700130408117038         MOVE SPACES             TO  CONTROL-LINE-1
222800130408117038         MOVE WS-STMT-DTA-RLIT-22
222900130408117038                                 TO  CL1-LIT
223000130408117038         MOVE WS-STMT-DTA-RCNT-22
223100130408117038                                 TO  CL1-CNT
223200130408117038         PERFORM PRINT-CTL-LINE THRU PCL-EXIT
223300130408117038     END-IF
223400060615
223500010321RF8633     IF  WS-STMT-DTA-RCNT-25
223600010321                          IS GREATER THAN  ZEROES
223700010321               MOVE SPACES             TO  CONTROL-LINE-1
223800010321               MOVE WS-STMT-DTA-RLIT-25
223900010321                                       TO  CL1-LIT
224000010321               MOVE WS-STMT-DTA-RCNT-25
224100010321                                       TO  CL1-CNT
224200010321               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
224300010321           END-IF
224400031106
224500031106R18312     IF  WS-STMT-DTA-RCNT-CLTHLD
224600031106  ¦                       IS GREATER THAN  ZEROES
224700031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
224800031106  ¦            MOVE WS-STMT-DTA-RLIT-CLTHLD
224900031106  ¦                                    TO  CL1-LIT
225000031106  ¦            MOVE WS-STMT-DTA-RCNT-CLTHLD
225100031106  ¦                                    TO  CL1-CNT
225200031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
225300031106R18312     END-IF
225400031106
225500031106R18312     IF  WS-STMT-DTA-RCNT-NOMHLD
225600031106  ¦                       IS GREATER THAN  ZEROES
225700031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
225800031106  ¦            MOVE WS-STMT-DTA-RLIT-NOMHLD
225900031106  ¦                                    TO  CL1-LIT
226000031106  ¦            MOVE WS-STMT-DTA-RCNT-NOMHLD
226100031106  ¦                                    TO  CL1-CNT
226200031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
226300031106R18312     END-IF
226400010321
226500031106R18312     IF  WS-STMT-DTA-RCNT-ENG
226600031106  ¦                       IS GREATER THAN  ZEROES
226700031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
226800031106  ¦            MOVE WS-STMT-DTA-RLIT-ENG
226900031106  ¦                                    TO  CL1-LIT
227000031106  ¦            MOVE WS-STMT-DTA-RCNT-ENG
227100031106  ¦                                    TO  CL1-CNT
227200031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
227300031106R18312     END-IF
227400031106
227500031106R18312     IF  WS-STMT-DTA-RCNT-ENGHLD
227600031106  ¦                       IS GREATER THAN  ZEROES
227700031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
227800031106  ¦            MOVE WS-STMT-DTA-RLIT-ENGHLD
227900031106  ¦                                    TO  CL1-LIT
228000031106  ¦            MOVE WS-STMT-DTA-RCNT-ENGHLD
228100031106  ¦                                    TO  CL1-CNT
228200031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
228300031106R18312     END-IF
228400031106
228500031106R18312     IF  WS-STMT-DTA-RCNT-FRN
228600031106  ¦                       IS GREATER THAN  ZEROES
228700031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
228800031106  ¦            MOVE WS-STMT-DTA-RLIT-FRN
228900031106  ¦                                    TO  CL1-LIT
229000031106  ¦            MOVE WS-STMT-DTA-RCNT-FRN
229100031106  ¦                                    TO  CL1-CNT
229200031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
229300031106R18312     END-IF
229400031106
229500031106R18312     IF  WS-STMT-DTA-RCNT-FRNHLD
229600031106  ¦                       IS GREATER THAN  ZEROES
229700031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
229800031106  ¦            MOVE WS-STMT-DTA-RLIT-FRNHLD
229900031106  ¦                                    TO  CL1-LIT
230000031106  ¦            MOVE WS-STMT-DTA-RCNT-FRNHLD
230100031106  ¦                                    TO  CL1-CNT
230200031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
230300031106R18312     END-IF
230400031106
230500031124R18312     IF  WS-STMT-DTA-RCNT-ACCTOT
230600031124  ¦                       IS GREATER THAN  ZEROES
230700031124  ¦            MOVE SPACES             TO  CONTROL-LINE-1
230800031124  ¦            MOVE WS-STMT-DTA-RLIT-ACCTOT
230900031124  ¦                                    TO  CL1-LIT
231000031124  ¦            MOVE WS-STMT-DTA-RCNT-ACCTOT
231100031124  ¦                                    TO  CL1-CNT
231200031124  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
231300031124R18312     END-IF
231400031124
231500000515RF7051     IF  WS-STMT-DTA-RCNT-30
231600000515                          IS GREATER THAN  ZEROES
231700000515               MOVE SPACES             TO  CONTROL-LINE-1
231800000515               MOVE WS-STMT-DTA-RLIT-30
231900000515                                       TO  CL1-LIT
232000000515               MOVE WS-STMT-DTA-RCNT-30
232100000515                                       TO  CL1-CNT
232200000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
232300000515           END-IF
232400000515
232500040406R20870     IF  WS-STMT-DTA-RCNT-33
232600040406                          IS GREATER THAN  ZEROES
232700040406               MOVE SPACES             TO  CONTROL-LINE-1
232800040406               MOVE WS-STMT-DTA-RLIT-33
232900040406                                       TO  CL1-LIT
233000040406               MOVE WS-STMT-DTA-RCNT-33
233100040406                                       TO  CL1-CNT
233200040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
233300040406           END-IF
233400040406
233500000515RF7051     IF  WS-STMT-DTA-RCNT-35
233600000515                          IS GREATER THAN  ZEROES
233700000515               MOVE SPACES             TO  CONTROL-LINE-1
233800000515               MOVE WS-STMT-DTA-RLIT-35
233900000515                                       TO  CL1-LIT
234000000515               MOVE WS-STMT-DTA-RCNT-35
234100000515                                       TO  CL1-CNT
234200000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
234300000515           END-IF
234400000515
234500040406R20870     IF  WS-STMT-DTA-RCNT-38
234600040406                          IS GREATER THAN  ZEROES
234700040406               MOVE SPACES             TO  CONTROL-LINE-1
234800040406               MOVE WS-STMT-DTA-RLIT-38
234900040406                                       TO  CL1-LIT
235000040406               MOVE WS-STMT-DTA-RCNT-38
235100040406                                       TO  CL1-CNT
235200040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
235300040406           END-IF
235400040406
235500010124RF8558     IF  WS-STMT-DTA-RCNT-40
235600010124                          IS GREATER THAN  ZEROES
235700010124               MOVE SPACES             TO  CONTROL-LINE-1
235800010124               MOVE WS-STMT-DTA-RLIT-40
235900010124                                       TO  CL1-LIT
236000010124               MOVE WS-STMT-DTA-RCNT-40
236100010124                                       TO  CL1-CNT
236200010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
236300010124           END-IF
236400010124
236500010124           IF  WS-STMT-DTA-RCNT-43
236600010124                          IS GREATER THAN  ZEROES
236700010124               MOVE SPACES             TO  CONTROL-LINE-1
236800010124               MOVE WS-STMT-DTA-RLIT-43
236900010124                                       TO  CL1-LIT
237000010124               MOVE WS-STMT-DTA-RCNT-43
237100010124                                       TO  CL1-CNT
237200010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
237300010124           END-IF
237400010124
237500010124           IF  WS-STMT-DTA-RCNT-45
237600010124                          IS GREATER THAN  ZEROES
237700010124               MOVE SPACES             TO  CONTROL-LINE-1
237800010124               MOVE WS-STMT-DTA-RLIT-45
237900010124                                       TO  CL1-LIT
238000010124               MOVE WS-STMT-DTA-RCNT-45
238100010124                                       TO  CL1-CNT
238200010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
238300010124RF8558     END-IF
238400010124
238500000000           IF  WS-STMT-DTA-RCNT-50
238600000000                          IS GREATER THAN  ZEROES
238700000000               MOVE SPACES             TO  CONTROL-LINE-1
238800000000               MOVE WS-STMT-DTA-RLIT-50
238900000000                                       TO  CL1-LIT
239000000000               MOVE WS-STMT-DTA-RCNT-50
239100000000                                       TO  CL1-CNT
239200000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
239300000000
239400000000           IF  WS-STMT-DTA-RCNT-60
239500000000                          IS GREATER THAN  ZEROES
239600000000               MOVE SPACES             TO  CONTROL-LINE-1
239700000000               MOVE WS-STMT-DTA-RLIT-60
239800000000                                       TO  CL1-LIT
239900000000               MOVE WS-STMT-DTA-RCNT-60
240000000000                                       TO  CL1-CNT
240100000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
240200971026
240300981218           IF  WS-STMT-DTA-RCNT-62
240400981218                          IS GREATER THAN  ZEROES
240500981218               MOVE SPACES             TO  CONTROL-LINE-1
240600981218               MOVE WS-STMT-DTA-RLIT-62
240700981218                                       TO  CL1-LIT
240800981218               MOVE WS-STMT-DTA-RCNT-62
240900981218                                       TO  CL1-CNT
241000981218               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
241100981218
241200091119R69515     IF  WS-STMT-DTA-RCNT-63
241300091119  ¦                       IS GREATER THAN  ZEROES
241400091119  ¦            MOVE SPACES             TO  CONTROL-LINE-1
241500091119  ¦            MOVE WS-STMT-DTA-RLIT-63
241600091119  ¦                                    TO  CL1-LIT
241700091119  ¦            MOVE WS-STMT-DTA-RCNT-63
241800091119  ¦                                    TO  CL1-CNT
241900091119  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
242000091119R69515     END-IF
242100091119
242200980519           IF  WS-STMT-DTA-RCNT-65
242300980519                          IS GREATER THAN  ZEROES
242400980519               MOVE SPACES             TO  CONTROL-LINE-1
242500980519               MOVE WS-STMT-DTA-RLIT-65
242600980519                                       TO  CL1-LIT
242700980519               MOVE WS-STMT-DTA-RCNT-65
242800980519                                       TO  CL1-CNT
242900980519               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
243000980519
243100000515           IF  WS-STMT-DTA-RCNT-67
243200000515                          IS GREATER THAN  ZEROES
243300000515               MOVE SPACES             TO  CONTROL-LINE-1
243400000515               MOVE WS-STMT-DTA-RLIT-67
243500000515                                       TO  CL1-LIT
243600000515               MOVE WS-STMT-DTA-RCNT-67
243700000515                                       TO  CL1-CNT
243800000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
243900000515           END-IF
244000000515
244100971026           IF  WS-STMT-DTA-RCNT-70
244200971026                          IS GREATER THAN  ZEROES
244300971026               MOVE SPACES             TO  CONTROL-LINE-1
244400971026               MOVE WS-STMT-DTA-RLIT-70
244500971026                                       TO  CL1-LIT
244600971026               MOVE WS-STMT-DTA-RCNT-70
244700971026                                       TO  CL1-CNT
244800971026               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
244900000000
245000000000           MOVE SPACES                 TO  CONTROL-LINE-1.
245100000000           MOVE WS-STMT-DTA-RLIT-80    TO  CL1-LIT.
245200000000           MOVE WS-STMT-DTA-RCNT-80    TO  CL1-CNT.
245300000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
245400000000
245500000000           IF  WS-STMT-DTA-RCNT-82
245600000000                          IS GREATER THAN  ZEROES
245700000000               MOVE SPACES             TO  CONTROL-LINE-1
245800000000               MOVE WS-STMT-DTA-RLIT-82
245900000000                                       TO  CL1-LIT
246000000000               MOVE WS-STMT-DTA-RCNT-82
246100000000                                       TO  CL1-CNT
246200000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
246300000000
246400000515           IF  WS-STMT-DTA-RCNT-84
246500000515                          IS GREATER THAN  ZEROES
246600000515               MOVE SPACES             TO  CONTROL-LINE-1
246700000515               MOVE WS-STMT-DTA-RLIT-84
246800000515                                       TO  CL1-LIT
246900000515               MOVE WS-STMT-DTA-RCNT-84
247000000515                                       TO  CL1-CNT
247100000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
247200000515           END-IF
247300000515
247400010124RF8558     IF  WS-STMT-DTA-RCNT-90
247500010124                          IS GREATER THAN  ZEROES
247600010124               MOVE SPACES             TO  CONTROL-LINE-1
247700010124               MOVE WS-STMT-DTA-RLIT-90
247800010124                                       TO  CL1-LIT
247900010124               MOVE WS-STMT-DTA-RCNT-90
248000010124                                       TO  CL1-CNT
248100010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
248200010124           END-IF
248300010124
248400000000           MOVE SPACES                 TO  CONTROL-LINE-1.
248500000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
248600000000
248700000000           MOVE SPACES                 TO  CONTROL-LINE-1.
248800000000           MOVE WS-STMT-DTA-RLIT-UN    TO  CL1-LIT.
248900000000           MOVE WS-STMT-DTA-RCNT-UN    TO  CL1-CNT1.
249000000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
249100000000
249200000000           MOVE SPACES                 TO  CONTROL-LINE-1.
249300000000           MOVE WS-STMT-DTA-RLIT-UP    TO  CL1-LIT.
249400000000           MOVE WS-STMT-DTA-RCNT-UP    TO  CL1-CNT2.
249500000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
249600000000
249700000000           MOVE SPACES                 TO  CONTROL-LINE-1.
249800000000           MOVE WS-STMT-DTA-RLIT-MV    TO  CL1-LIT.
249900000000           MOVE WS-STMT-DTA-RCNT-MV    TO  CL1-CNT3.
250000000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
250100000000
250200000000           MOVE SPACES                 TO  CONTROL-LINE-1.
250300000000           MOVE WS-STMT-DTA-RLIT-BV    TO  CL1-LIT.
250400000000           MOVE WS-STMT-DTA-RCNT-BV    TO  CL1-CNT3.
250500000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
250600000000
250700000000           MOVE SPACES                 TO  CONTROL-LINE-1.
250800000000           MOVE WS-STMT-DTA-RLIT-UB    TO  CL1-LIT.
250900000000           MOVE WS-STMT-DTA-RCNT-UB    TO  CL1-CNT1.
251000000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
251100000000
251200000000      *****
251300000000      *****    For each statement extract file, create the Delivery
251400000000      *****    Information record and print its Control Report write
251500000000      *****    values on a separate page.
251600000000      *****
251700000000
251800000000           SET ST                      TO  1.
251900000000           SET SW                      TO  1.
252000000000
252100000000       EJR-0010.
252200000000           IF  WS-STMT-WCNT (ST, SW)
252300000000                              IS EQUAL TO  ZEROES
252400000000               GO TO EJR-0020.
252500000000
252600000000           ADD 1                       TO  WS-STMT-WCNT (ST, SW).
252700000000           ADD 1                       TO  WS-STMT-WCNT-00 (ST, SW).
252800000000
252900000000           MOVE WS-STMT-WCNT (ST, SW)  TO  DI-RECORD-COUNT-TOT.
253000030821           MOVE WS-STMT-WCNT-00 (ST, SW) TO  DI-RECORD-COUNT-00.
253100030821           MOVE WS-STMT-WCNT-01 (ST, SW) TO  DI-RECORD-COUNT-01.
253200030821           MOVE WS-STMT-WCNT-05 (ST, SW) TO  DI-RECORD-COUNT-05.
253300030821           MOVE WS-STMT-WCNT-10 (ST, SW) TO  DI-RECORD-COUNT-10.
253400030821RF8633     MOVE WS-STMT-WCNT-12 (ST, SW) TO  DI-RECORD-COUNT-12.
253500030821           MOVE WS-STMT-WCNT-15 (ST, SW) TO  DI-RECORD-COUNT-15.
253600030821R18091     MOVE WS-STMT-WCNT-17 (ST, SW) TO  DI-RECORD-COUNT-17.
253700030821           MOVE WS-STMT-WCNT-20 (ST, SW) TO  DI-RECORD-COUNT-20.
253800060615R35042     MOVE WS-STMT-WCNT-21 (ST, SW) TO  DI-RECORD-COUNT-21.
253900130409117038     MOVE WS-STMT-WCNT-22 (ST, SW) TO  DI-RECORD-COUNT-22.
254000030821RF8633     MOVE WS-STMT-WCNT-25 (ST, SW) TO  DI-RECORD-COUNT-25.
254100030821           MOVE WS-STMT-WCNT-30 (ST, SW) TO  DI-RECORD-COUNT-30.
254200040406R20870     MOVE WS-STMT-WCNT-33 (ST, SW) TO  DI-RECORD-COUNT-33.
254300030821           MOVE WS-STMT-WCNT-35 (ST, SW) TO  DI-RECORD-COUNT-35.
254400040406R20870     MOVE WS-STMT-WCNT-38 (ST, SW) TO  DI-RECORD-COUNT-38.
254500030821RF8558     MOVE WS-STMT-WCNT-40 (ST, SW) TO  DI-RECORD-COUNT-40.
254600030821           MOVE WS-STMT-WCNT-43 (ST, SW) TO  DI-RECORD-COUNT-43.
254700030821RF8558     MOVE WS-STMT-WCNT-45 (ST, SW) TO  DI-RECORD-COUNT-45.
254800030821           MOVE WS-STMT-WCNT-50 (ST, SW) TO  DI-RECORD-COUNT-50.
254900030821           MOVE WS-STMT-WCNT-60 (ST, SW) TO  DI-RECORD-COUNT-60.
255000030821           MOVE WS-STMT-WCNT-62 (ST, SW) TO  DI-RECORD-COUNT-62.
255100091123R69515     MOVE WS-STMT-WCNT-63 (ST, SW) TO  DI-RECORD-COUNT-63.
255200030821           MOVE WS-STMT-WCNT-65 (ST, SW) TO  DI-RECORD-COUNT-65.
255300030821           MOVE WS-STMT-WCNT-67 (ST, SW) TO  DI-RECORD-COUNT-67.
255400030821           MOVE WS-STMT-WCNT-70 (ST, SW) TO  DI-RECORD-COUNT-70.
255500030821           MOVE WS-STMT-WCNT-80 (ST, SW) TO  DI-RECORD-COUNT-80.
255600030821           MOVE WS-STMT-WCNT-82 (ST, SW) TO  DI-RECORD-COUNT-82.
255700030821           MOVE WS-STMT-WCNT-84 (ST, SW) TO  DI-RECORD-COUNT-84.
255800030821RF8633     MOVE WS-STMT-WCNT-90 (ST, SW) TO  DI-RECORD-COUNT-90.
255900030821           MOVE WS-STMT-WCNT-UN (ST, SW) TO  DI-NO-OF-UNITS.
256000030821           MOVE WS-STMT-WCNT-UP (ST, SW) TO  DI-UNIT-PRICE.
256100030821           MOVE WS-STMT-WCNT-MV (ST, SW) TO  DI-MARKET-VALUE.
256200030821           MOVE WS-STMT-WCNT-BV (ST, SW) TO  DI-BOOK-VALUE.
256300030821           MOVE WS-STMT-WCNT-UB (ST, SW) TO  DI-UNIT-BALANCE.
256400000000
256500000000           MOVE DELIVERY-INFO-SECTION  TO  MFASTMTFP-SECTION.
256600000000           PERFORM WRITE-RECORD-RTN   THRU WRR-EXIT.
256700000000           SUBTRACT 1                FROM  WS-STMT-WCNT (ST, SW).
256800000000
256900000000       EJR-0020.
257000980609           IF  WS-LDA-ICS-FLAG
257100980609                          IS NOT EQUAL TO  "Y"
257200980609           AND SW             IS EQUAL TO  3
257300980609           AND WS-STMT-WCNT (ST, SW)
257400980609                              IS EQUAL TO  ZEROES
257500980609               GO TO EJR-0030.
257600980609
257700980609           IF  WS-LDA-ICS-FLAG
257800980609                          IS NOT EQUAL TO  "Y"
257900980609           AND SW             IS EQUAL TO  6
258000980609           AND WS-STMT-WCNT (ST, SW)
258100980609                              IS EQUAL TO  ZEROES
258200980609               GO TO EJR-0030.
258300980609
258400000000           MOVE 99                     TO  WS-LNECNT.
258500000000
258600000000           SET SH                      TO  ST.
258700000000           SET SL                      TO  SW.
258800000000           MOVE SPACES                 TO  CONTROL-LINE-1.
258900000000           MOVE WS-STMT-HLIT (SH, SL)  TO  CONTROL-LINE-1.
259000000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
259100000000
259200000000           MOVE SPACES                 TO  CONTROL-LINE-1.
259300000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
259400000000
259500000000           MOVE SPACES                 TO  CONTROL-LINE-1.
259600000000           MOVE WS-STMT-WLIT           TO  CL1-LIT.
259700000000           MOVE WS-STMT-WCNT (ST, SW)  TO  CL1-CNT.
259800000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
259900000000
260000000000           MOVE SPACES                 TO  CONTROL-LINE-1.
260100000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
260200000000
260300000000           MOVE SPACES                 TO  CONTROL-LINE-1.
260400000000           MOVE WS-STMT-WLIT-00        TO  CL1-LIT.
260500000000           MOVE WS-STMT-WCNT-00 (ST, SW)
260600000000                                       TO  CL1-CNT.
260700000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
260800000000
260900000000           MOVE SPACES                 TO  CONTROL-LINE-1.
261000000000           MOVE WS-STMT-WLIT-01        TO  CL1-LIT.
261100000000           MOVE WS-STMT-WCNT-01 (ST, SW)
261200000000                                       TO  CL1-CNT.
261300000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
261400000000
261500000000           MOVE SPACES                 TO  CONTROL-LINE-1.
261600000000           MOVE WS-STMT-WLIT-05        TO  CL1-LIT.
261700000000           MOVE WS-STMT-WCNT-05 (ST, SW)
261800000000                                       TO  CL1-CNT.
261900000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
262000000000
262100000000           MOVE SPACES                 TO  CONTROL-LINE-1.
262200000000           MOVE WS-STMT-WLIT-10        TO  CL1-LIT.
262300000000           MOVE WS-STMT-WCNT-10 (ST, SW)
262400000000                                       TO  CL1-CNT.
262500000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
262600000000
262700010307RF8633     IF  WS-STMT-DTA-RCNT-12 IS GREATER THAN  ZEROES
262800010307               MOVE SPACES             TO  CONTROL-LINE-1
262900060615R35042*        MOVE WS-STMT-DTA-RLIT-12 TO  CL1-LIT
263000060615  ¦   *        MOVE WS-STMT-DTA-RCNT-12 TO  CL1-CNT
263100060615  V            MOVE WS-STMT-WLIT-12 TO  CL1-LIT
263200060619R35042         MOVE WS-STMT-WCNT-12 (ST, SW) TO  CL1-CNT
263300010307               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
263400010307RF8633     END-IF
263500010307
263600000000           IF  WS-STMT-DTA-RCNT-15
263700000000                          IS GREATER THAN  ZEROES
263800000000               MOVE SPACES             TO  CONTROL-LINE-1
263900000000               MOVE WS-STMT-WLIT-15    TO  CL1-LIT
264000000000               MOVE WS-STMT-WCNT-15 (ST, SW)
264100000000                                       TO  CL1-CNT
264200000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
264300000000
264400030821R18091     IF  WS-STMT-DTA-RCNT-17 > ZEROES
264500030821  |            MOVE SPACES                   TO  CONTROL-LINE-1
264600030821  |            MOVE WS-STMT-WLIT-17          TO  CL1-LIT
264700030821  |            MOVE WS-STMT-WCNT-17 (ST, SW) TO  CL1-CNT
264800030821  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
264900030821
265000000000           MOVE SPACES                 TO  CONTROL-LINE-1.
265100000000           MOVE WS-STMT-WLIT-20        TO  CL1-LIT.
265200000000           MOVE WS-STMT-WCNT-20 (ST, SW)
265300000000                                       TO  CL1-CNT.
265400000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
265500010321
265600060615R35042     IF  WS-STMT-DTA-RCNT-21
265700060615  ¦                       IS GREATER THAN  ZEROES
265800060615  ¦            MOVE SPACES             TO  CONTROL-LINE-1
265900060615  ¦            MOVE WS-STMT-WLIT-21    TO  CL1-LIT
266000060615  ¦            MOVE WS-STMT-WCNT-21 (ST, SW)
266100060615  ¦                                    TO  CL1-CNT
266200060615  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
266300060615R35042     END-IF
266400060615
266500130408117038     IF  WS-STMT-DTA-RCNT-22
266600130408117038                    IS GREATER THAN  ZEROES
266700130408117038         MOVE SPACES             TO  CONTROL-LINE-1
266800130408117038         MOVE WS-STMT-WLIT-22    TO  CL1-LIT
266900130408117038         MOVE WS-STMT-WCNT-22 (ST, SW)
267000130408117038                                 TO  CL1-CNT
267100130408117038         PERFORM PRINT-CTL-LINE THRU PCL-EXIT
267200130408117038     END-IF
267300130408
267400010321RF8633     IF  WS-STMT-DTA-RCNT-25
267500010321                          IS GREATER THAN  ZEROES
267600010321               MOVE SPACES             TO  CONTROL-LINE-1
267700010321               MOVE WS-STMT-WLIT-25    TO  CL1-LIT
267800010321               MOVE WS-STMT-WCNT-25 (ST, SW)
267900010321                                       TO  CL1-CNT
268000010321               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
268100010321           END-IF
268200010321
268300000515
268400000515RF7051     IF  WS-STMT-DTA-RCNT-30
268500000515                          IS GREATER THAN  ZEROES
268600000515               MOVE SPACES             TO  CONTROL-LINE-1
268700000515               MOVE WS-STMT-WLIT-30    TO  CL1-LIT
268800000515               MOVE WS-STMT-WCNT-30 (ST, SW)
268900000515                                       TO  CL1-CNT
269000000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
269100000515           END-IF
269200000000
269300040406R20870     IF  WS-STMT-DTA-RCNT-33
269400040406                          IS GREATER THAN  ZEROES
269500040406               MOVE SPACES             TO  CONTROL-LINE-1
269600040406               MOVE WS-STMT-WLIT-33    TO  CL1-LIT
269700040406               MOVE WS-STMT-WCNT-33 (ST, SW)
269800040406                                       TO  CL1-CNT
269900040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
270000040406           END-IF
270100040406
270200000515RF7051     IF  WS-STMT-DTA-RCNT-35
270300000515                          IS GREATER THAN  ZEROES
270400000515               MOVE SPACES             TO  CONTROL-LINE-1
270500000515               MOVE WS-STMT-WLIT-35    TO  CL1-LIT
270600000515               MOVE WS-STMT-WCNT-35 (ST, SW)
270700000515                                       TO  CL1-CNT
270800000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
270900000515           END-IF
271000000515
271100040406R20870     IF  WS-STMT-DTA-RCNT-38
271200040406                          IS GREATER THAN  ZEROES
271300040406               MOVE SPACES             TO  CONTROL-LINE-1
271400040406               MOVE WS-STMT-WLIT-38    TO  CL1-LIT
271500040406               MOVE WS-STMT-WCNT-38 (ST, SW)
271600040406                                       TO  CL1-CNT
271700040406               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
271800040406           END-IF
271900040406
272000010124RF8558     IF  WS-STMT-DTA-RCNT-40
272100010124                          IS GREATER THAN  ZEROES
272200010124               MOVE SPACES             TO  CONTROL-LINE-1
272300010124               MOVE WS-STMT-WLIT-40    TO  CL1-LIT
272400010124               MOVE WS-STMT-WCNT-40 (ST, SW)
272500010124                                       TO  CL1-CNT
272600010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
272700010124           END-IF
272800010124
272900010124           IF  WS-STMT-DTA-RCNT-43
273000010124                          IS GREATER THAN  ZEROES
273100010124               MOVE SPACES             TO  CONTROL-LINE-1
273200010124               MOVE WS-STMT-WLIT-43    TO  CL1-LIT
273300010124               MOVE WS-STMT-WCNT-43 (ST, SW)
273400010124                                       TO  CL1-CNT
273500010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
273600010124           END-IF
273700010124
273800010124           IF  WS-STMT-DTA-RCNT-45
273900010124                          IS GREATER THAN  ZEROES
274000010124               MOVE SPACES             TO  CONTROL-LINE-1
274100010124               MOVE WS-STMT-WLIT-45    TO  CL1-LIT
274200010124               MOVE WS-STMT-WCNT-45 (ST, SW)
274300010124                                       TO  CL1-CNT
274400010124               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
274500010125RF8558     END-IF
274600010124
274700000000           IF  WS-STMT-DTA-RCNT-50
274800000000                          IS GREATER THAN  ZEROES
274900000000               MOVE SPACES             TO  CONTROL-LINE-1
275000000000               MOVE WS-STMT-WLIT-50    TO  CL1-LIT
275100000000               MOVE WS-STMT-WCNT-50 (ST, SW)
275200000000                                       TO  CL1-CNT
275300000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
275400000000
275500000000           IF  WS-STMT-DTA-RCNT-60
275600000000                          IS GREATER THAN  ZEROES
275700000000               MOVE SPACES             TO  CONTROL-LINE-1
275800000000               MOVE WS-STMT-WLIT-60    TO  CL1-LIT
275900000000               MOVE WS-STMT-WCNT-60 (ST, SW)
276000000000                                       TO  CL1-CNT
276100000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
276200971026
276300981218           IF  WS-STMT-DTA-RCNT-62
276400981218                          IS GREATER THAN  ZEROES
276500981218               MOVE SPACES             TO  CONTROL-LINE-1
276600981218               MOVE WS-STMT-WLIT-62    TO  CL1-LIT
276700981218               MOVE WS-STMT-WCNT-62 (ST, SW)
276800981218                                       TO  CL1-CNT
276900981218               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
277000981218
277100091119R69515     IF  WS-STMT-DTA-RCNT-63
277200091119  ¦                       IS GREATER THAN  ZEROES
277300091119  ¦            MOVE SPACES             TO  CONTROL-LINE-1
277400091119  ¦            MOVE WS-STMT-WLIT-63    TO  CL1-LIT
277500091119  ¦            MOVE WS-STMT-WCNT-63 (ST, SW)
277600091119  ¦                                    TO  CL1-CNT
277700091119  V            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
277800091119R69515     END-IF
277900091119
278000980519           IF  WS-STMT-DTA-RCNT-65
278100980519                          IS GREATER THAN  ZEROES
278200980519               MOVE SPACES             TO  CONTROL-LINE-1
278300980519               MOVE WS-STMT-WLIT-65    TO  CL1-LIT
278400980519               MOVE WS-STMT-WCNT-65 (ST, SW)
278500980519                                       TO  CL1-CNT
278600980519               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
278700980519
278800000515RF7051     IF  WS-STMT-DTA-RCNT-67
278900000515                          IS GREATER THAN  ZEROES
279000000515               MOVE SPACES             TO  CONTROL-LINE-1
279100000515               MOVE WS-STMT-WLIT-67    TO  CL1-LIT
279200000515               MOVE WS-STMT-WCNT-67 (ST, SW)
279300000515                                       TO  CL1-CNT
279400000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
279500000515           END-IF
279600000515
279700971026           IF  WS-STMT-DTA-RCNT-70
279800971026                          IS GREATER THAN  ZEROES
279900971026               MOVE SPACES             TO  CONTROL-LINE-1
280000971026               MOVE WS-STMT-WLIT-70    TO  CL1-LIT
280100971026               MOVE WS-STMT-WCNT-70 (ST, SW)
280200971026                                       TO  CL1-CNT
280300971026               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
280400000000
280500000000           MOVE SPACES                 TO  CONTROL-LINE-1.
280600000000           MOVE WS-STMT-WLIT-80        TO  CL1-LIT.
280700000000           MOVE WS-STMT-WCNT-80 (ST, SW)
280800000000                                       TO  CL1-CNT.
280900000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
281000000000
281100000000           IF  WS-STMT-DTA-RCNT-82
281200000000                          IS GREATER THAN  ZEROES
281300000000               MOVE SPACES             TO  CONTROL-LINE-1
281400000000               MOVE WS-STMT-WLIT-82    TO  CL1-LIT
281500000000               MOVE WS-STMT-WCNT-82 (ST, SW)
281600000000                                       TO  CL1-CNT
281700000000               PERFORM PRINT-CTL-LINE THRU PCL-EXIT.
281800000000
281900000515RF7051     IF  WS-STMT-DTA-RCNT-84
282000000515                          IS GREATER THAN  ZEROES
282100000515               MOVE SPACES             TO  CONTROL-LINE-1
282200000515               MOVE WS-STMT-WLIT-84    TO  CL1-LIT
282300000515               MOVE WS-STMT-WCNT-84 (ST, SW)
282400000515                                       TO  CL1-CNT
282500000515               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
282600000515           END-IF
282700000515
282800010125RF8558     IF  WS-STMT-DTA-RCNT-90
282900010125                          IS GREATER THAN  ZEROES
283000010125               MOVE SPACES             TO  CONTROL-LINE-1
283100010125               MOVE WS-STMT-WLIT-90    TO  CL1-LIT
283200010125               MOVE WS-STMT-WCNT-90 (ST, SW)
283300010125                                       TO  CL1-CNT
283400010125               PERFORM PRINT-CTL-LINE THRU PCL-EXIT
283500010125           END-IF
283600010125
283700031106R18312     IF  WS-STMT-DTA-RCNT-CLTHLD
283800031106  ¦                       IS GREATER THAN  ZEROES
283900031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
284000031106  ¦            MOVE WS-STMT-WLIT-CLTHLD TO  CL1-LIT
284100031106  ¦            MOVE WS-STMT-WCNT-CLTHLD (ST, SW)
284200031106  ¦                                    TO  CL1-CNT
284300031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
284400031106R18312     END-IF
284500031106
284600031106R18312     IF  WS-STMT-DTA-RCNT-NOMHLD
284700031106  ¦                       IS GREATER THAN  ZEROES
284800031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
284900031106  ¦            MOVE WS-STMT-WLIT-NOMHLD TO  CL1-LIT
285000031106  ¦            MOVE WS-STMT-WCNT-NOMHLD (ST, SW)
285100031106  ¦                                    TO  CL1-CNT
285200031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
285300031106R18312     END-IF
285400031106
285500031106R18312     IF  WS-STMT-DTA-RCNT-ENG
285600031106  ¦                       IS GREATER THAN  ZEROES
285700031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
285800031106  ¦            MOVE WS-STMT-WLIT-ENG    TO  CL1-LIT
285900031106  ¦            MOVE WS-STMT-WCNT-ENG    (ST, SW)
286000031106  ¦                                    TO  CL1-CNT
286100031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
286200031106R18312     END-IF
286300031106
286400031106R18312     IF  WS-STMT-DTA-RCNT-ENGHLD
286500031106  ¦                       IS GREATER THAN  ZEROES
286600031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
286700031106  ¦            MOVE WS-STMT-WLIT-ENGHLD TO  CL1-LIT
286800031106  ¦            MOVE WS-STMT-WCNT-ENGHLD (ST, SW)
286900031106  ¦                                    TO  CL1-CNT
287000031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
287100031106R18312     END-IF
287200031106
287300031106R18312     IF  WS-STMT-DTA-RCNT-FRN
287400031106  ¦                       IS GREATER THAN  ZEROES
287500031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
287600031106  ¦            MOVE WS-STMT-WLIT-FRN    TO  CL1-LIT
287700031106  ¦            MOVE WS-STMT-WCNT-FRN    (ST, SW)
287800031106  ¦                                    TO  CL1-CNT
287900031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
288000031106R18312     END-IF
288100031106
288200031106R18312     IF  WS-STMT-DTA-RCNT-FRNHLD
288300031106  ¦                       IS GREATER THAN  ZEROES
288400031106  ¦            MOVE SPACES             TO  CONTROL-LINE-1
288500031106  ¦            MOVE WS-STMT-WLIT-FRNHLD TO  CL1-LIT
288600031106  ¦            MOVE WS-STMT-WCNT-FRNHLD (ST, SW)
288700031106  ¦                                    TO  CL1-CNT
288800031106  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
288900031106R18312     END-IF
289000031106
289100031124R18312     IF  WS-STMT-DTA-RCNT-ACCTOT
289200031124  ¦                       IS GREATER THAN  ZEROES
289300031124  ¦            MOVE SPACES             TO  CONTROL-LINE-1
289400031124  ¦            MOVE WS-STMT-WLIT-ACCTOT TO  CL1-LIT
289500031124  ¦            MOVE WS-STMT-WCNT-ACCTOT (ST, SW)
289600031124  ¦                                    TO  CL1-CNT
289700031124  ¦            PERFORM PRINT-CTL-LINE THRU PCL-EXIT
289800031124R18312     END-IF
289900031124
290000000000           MOVE SPACES                 TO  CONTROL-LINE-1.
290100000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
290200000000
290300000000           MOVE SPACES                 TO  CONTROL-LINE-1.
290400000000           MOVE WS-STMT-WLIT-UN        TO  CL1-LIT.
290500000000           MOVE WS-STMT-WCNT-UN (ST, SW)
290600000000                                       TO  CL1-CNT.
290700000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
290800000000
290900000000           MOVE SPACES                 TO  CONTROL-LINE-1.
291000000000           MOVE WS-STMT-WLIT-UP        TO  CL1-LIT.
291100000000           MOVE WS-STMT-WCNT-UP (ST, SW)
291200000000                                       TO  CL1-CNT.
291300000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
291400000000
291500000000           MOVE SPACES                 TO  CONTROL-LINE-1.
291600000000           MOVE WS-STMT-WLIT-MV        TO  CL1-LIT.
291700000000           MOVE WS-STMT-WCNT-MV (ST, SW)
291800000000                                       TO  CL1-CNT.
291900000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
292000000000
292100000000           MOVE SPACES                 TO  CONTROL-LINE-1.
292200000000           MOVE WS-STMT-WLIT-BV        TO  CL1-LIT.
292300000000           MOVE WS-STMT-WCNT-BV (ST, SW)
292400000000                                       TO  CL1-CNT.
292500000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
292600000000
292700000000           MOVE SPACES                 TO  CONTROL-LINE-1.
292800000000           MOVE WS-STMT-WLIT-UB        TO  CL1-LIT.
292900000000           MOVE WS-STMT-WCNT-UB (ST, SW)
293000000000                                       TO  CL1-CNT.
293100000000           PERFORM PRINT-CTL-LINE     THRU PCL-EXIT.
293200000000
293300980609       EJR-0030.
293400000000           IF  SW            IS LESS THAN  WS-SW-MAX
293500000000               SET SW               UP BY  1
293600000000               GO TO EJR-0010.
293700000000
293800971028      *****
293900971028      *****    NOTE:   The following were previously for AIC only.  For
294000971028      *****            the time being, AIC will only be producing an
294100971028      *****            English and an English Hold Mail file, therefore
294200971028      *****            the lines been commented out.
294300971028      *****
294400971028      *****
294500971028      *****IF  WS-LDA-ALLTYP  IS EQUAL TO  "I"
294600971028      *****AND WS-LDA-MGMT-COM-CDE
294700971028      *****                   IS EQUAL TO  "AIC"
294800971028      *****AND ST            IS LESS THAN  WS-ST-MAX
294900971028      *****    SET ST               UP BY  1
295000971028      *****    SET SW                  TO  1
295100971028      *****    GO TO EJR-0010.
295200980602
295300000000      *****
295400000000      *****    Close all the files.
295500000000      *****
295600000000
295700000000           CLOSE           STMT-DTA-FILE
295800000000                           STMT-ENG-FILE
295900000000                           STMT-ENGHLD-FILE
296000000000                           STMT-FRN-FILE
296100000000                           STMT-FRNHLD-FILE
296200000000                           PRINT-FILE.
296300000000
296400971028      *****
296500971028      *****    NOTE:   The following were previously for AIC only.  For
296600971028      *****            the time being, AIC will only be producing an
296700971028      *****            English and an English Hold Mail file, therefore
296800971028      *****            the lines are being bypassed.
296900971028      *****
297000971028
297100971028           IF  WS-LDA-MGMT-COM-CDE
297200971028                              IS EQUAL TO  "AIC"
297300971028               GO TO EJR-EXIT.
297400971028
297500971028           IF  WS-LDA-ALLTYP  IS EQUAL TO  "I"
297600971028           AND WS-LDA-MGMT-COM-CDE
297700971028                              IS EQUAL TO  "AIC"
297800971028               CLOSE           STMT-ENGF-FILE
297900971028                               STMT-ENGHLDF-FILE
298000971028                               STMT-ENGU-FILE
298100971028                               STMT-ENGHLDU-FILE
298200971028                               STMT-FRNF-FILE
298300971028                               STMT-FRNHLDF-FILE
298400971028                               STMT-FRNU-FILE
298500971028                               STMT-FRNHLDU-FILE.
298600000000
298700000000       EJR-EXIT.
298800000000           EXIT.
298900000000      /
299000000000       WRITE-RECORD-RTN.
299100000000
299200000000      ******************************************************************
299300000000      *                                                                *
299400000000      *    W R I T E   R E C O R D   R O U T I N E                     *
299500000000      *                                                                *
299600000000      ******************************************************************
299700000000
299800000000      *****
299900000000      *****    Format and write the statement conversion record(s) based
300000000000      *****    on the passed statement record type and switch.
300100000000      *****
300200000000      *****      Type (ST)
300300000000      *****        "1":  Canadian
300400000000      *****        "2":  American
300500000000      *****        "3":  Foreign
300600000000      *****
300700000000      *****      Switch (SW)
300800990519      *****        "1":  English statement only(including ICS).
300900000000      *****        "2":  English Hold Mail statement only.
301000990519      *****        "4":  French statement only(including ICS).
301100980609      *****        "5":  French Hold Mail statement only.
301200000000      *****
301300000000
301400000000           IF  ST         IS NOT EQUAL TO  1
301500000000               GO TO WRR-0050.
301600000000
301700000000      *****
301800000000      *****    Canadian
301900000000      *****
302000000000
302100000000           IF  SW         IS NOT EQUAL TO  1
302200000000               GO TO WRR-0010.
302300000000
302400000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENG-REC.
302500000000           WRITE STMT-ENG-REC.
302600000000           GO TO WRR-0040.
302700000000
302800000000       WRR-0010.
302900000000           IF  SW         IS NOT EQUAL TO  2
303000990519               GO TO WRR-0020.
303100980603
303200000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGHLD-REC.
303300000000           WRITE STMT-ENGHLD-REC.
303400000000           GO TO WRR-0040.
303500980609
303600000000       WRR-0020.
303700980609           IF  SW         IS NOT EQUAL TO  4
303800000000               GO TO WRR-0030.
303900000000
304000000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRN-REC.
304100000000           WRITE STMT-FRN-REC.
304200000000           GO TO WRR-0040.
304300000000
304400000000       WRR-0030.
304500980609           IF  SW         IS NOT EQUAL TO  5
304600990519               GO TO WRR-0040.
304700980609
304800000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNHLD-REC.
304900000000           WRITE STMT-FRNHLD-REC.
305000980602
305100000000       WRR-0040.
305200000000           GO TO WRR-0150.
305300000000
305400000000       WRR-0050.
305500000000           IF  ST         IS NOT EQUAL TO  2
305600000000               GO TO WRR-0100.
305700980520
305800000000      *****
305900000000      *****    American
306000000000      *****
306100000000
306200000000           IF  SW         IS NOT EQUAL TO  1
306300000000               GO TO WRR-0060.
306400000000
306500000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGU-REC.
306600000000           WRITE STMT-ENGU-REC.
306700000000           GO TO WRR-0090.
306800000000
306900000000       WRR-0060.
307000000000           IF  SW         IS NOT EQUAL TO  2
307100000000               GO TO WRR-0070.
307200000000
307300000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGHLDU-REC.
307400000000           WRITE STMT-ENGHLDU-REC.
307500000000           GO TO WRR-0090.
307600000000
307700000000       WRR-0070.
307800980609           IF  SW         IS NOT EQUAL TO  4
307900000000               GO TO WRR-0080.
308000000000
308100000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNU-REC.
308200000000           WRITE STMT-FRNU-REC.
308300000000           GO TO WRR-0090.
308400000000
308500000000       WRR-0080.
308600980609           IF  SW         IS NOT EQUAL TO  5
308700980609               GO TO WRR-0090.
308800980609
308900000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNHLDU-REC.
309000000000           WRITE STMT-FRNHLDU-REC.
309100000000
309200000000       WRR-0090.
309300000000           GO TO WRR-0150.
309400000000
309500000000       WRR-0100.
309600980520
309700000000      *****
309800000000      *****    Foreign
309900000000      *****
310000000000
310100000000           IF  SW         IS NOT EQUAL TO  1
310200000000               GO TO WRR-0110.
310300000000
310400000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGF-REC.
310500000000           WRITE STMT-ENGF-REC.
310600000000           GO TO WRR-0140.
310700000000
310800000000       WRR-0110.
310900000000           IF  SW         IS NOT EQUAL TO  2
311000000000               GO TO WRR-0120.
311100000000
311200000000           MOVE MFASTMTFP-SECTION      TO  STMT-ENGHLDF-REC.
311300000000           WRITE STMT-ENGHLDF-REC.
311400000000           GO TO WRR-0140.
311500000000
311600000000       WRR-0120.
311700980609           IF  SW         IS NOT EQUAL TO  4
311800000000               GO TO WRR-0130.
311900000000
312000000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNF-REC.
312100000000           WRITE STMT-FRNF-REC.
312200000000           GO TO WRR-0140.
312300000000
312400000000       WRR-0130.
312500980609           IF  SW         IS NOT EQUAL TO  5
312600980609               GO TO WRR-0140.
312700980609
312800000000           MOVE MFASTMTFP-SECTION      TO  STMT-FRNHLDF-REC.
312900000000           WRITE STMT-FRNHLDF-REC.
313000000000
313100000000       WRR-0140.
313200000000           GO TO WRR-0150.
313300000000
313400000000       WRR-0150.
313500000000
313600000000      *****
313700000000      *****    Increment the total number of records written to the
313800000000      *****    statement extract file.
313900000000      *****
314000000000
314100000000           ADD 1                       TO  WS-STMT-WCNT (ST, SW).
314200000000
314300000000       WRR-EXIT.
314400000000           EXIT.
314500000000      /
314600000000       PRINT-CTL-LINE.
314700000000
314800000000      ******************************************************************
314900000000      *                                                                *
315000000000      *    P R I N T   C O N T R O L   L I N E   R O U T I N E         *
315100000000      *                                                                *
315200000000      ******************************************************************
315300000000
315400000000      *****
315500000000      *****    If the page is full, start a new page and print the
315600000000      *****    Heading lines.
315700000000      *****
315800000000
315900000000           IF  WS-LNECNT  IS GREATER THAN  WS-LNEMAX
316000000000               PERFORM PRINT-HDG-LINE THRU PHL-EXIT.
316100000000
316200000000      *****
316300000000      *****    Print the Control line.
316400000000      *****
316500000000
316600000000           WRITE PRINT-REC           FROM  CONTROL-LINE-1
316700000000                         AFTER  ADVANCING  1.
316800000000           ADD 1                       TO  WS-LNECNT.
316900000000
317000000000       PCL-EXIT.
317100000000           EXIT.
317200000000      /
317300000000       PRINT-HDG-LINE.
317400000000
317500000000      ******************************************************************
317600000000      *                                                                *
317700000000      *    P R I N T   H E A D I N G   L I N E   R O U T I N E         *
317800000000      *                                                                *
317900000000      ******************************************************************
318000000000
318100000000      *****
318200000000      *****    Print Heading line 1 on a new page.
318300000000      *****
318400000000
318500000000           WRITE PRINT-REC           FROM  HEADING-LINE-1
318600000000                          AFTER ADVANCING  PAGE.
318700000000           ADD 1                       TO  WS-PGECNT.
318800000000           MOVE 1                      TO  WS-LNECNT.
318900000000
319000000000      *****
319100000000      *****    Format and print Heading line 2.
319200000000      *****
319300000000
319400000000           MOVE WS-PGECNT              TO  HL2-PGECNT.
319500000000
319600000000           WRITE PRINT-REC           FROM  HEADING-LINE-2
319700000000                          AFTER ADVANCING  1.
319800000000           ADD 1                       TO  WS-LNECNT.
319900000000
320000031120      *****
320100031120      *****    Format and print Heading line 2-H.
320200031120      *****
320300031120
320400031120           WRITE PRINT-REC           FROM  HEADING-LINE-2-H
320500031120                          AFTER ADVANCING  1.
320600031120           ADD 1                       TO  WS-LNECNT.
320700031120
320800000000      *****
320900000000      *****    Print Heading line 3, if required.
321000000000      *****
321100000000
321200000000           IF  WS-EOJHDG-SW   IS EQUAL TO  "Y"
321300000000               GO TO PHL-0010.
321400000000
321500000000           WRITE PRINT-REC           FROM  HEADING-LINE-3
321600000000                          AFTER ADVANCING  2.
321700000000           ADD 2                       TO  WS-LNECNT.
321800000000
321900000000       PHL-0010.
322000000000
322100000000      *****
322200000000      *****    Format and print a blank line.
322300000000      *****
322400000000
322500000000           MOVE SPACES                 TO  PRINT-REC.
322600000000           WRITE PRINT-REC
322700000000                          AFTER ADVANCING  1.
322800000000           ADD 1                       TO  WS-LNECNT.
322900000000
323000000000       PHL-EXIT.
323100000000           EXIT.
