000001180927     A          R RECORD1
000002180927     A                                  1 32'System Access Menu'
000003180927     A                                  2  2'1. Work with query'
000100      
000101180927     A*%%RS+<record-sequences>
000102180927     A*%%RS+ <sequence name="SYSMNU">
000103180927     A*%%RS+  <device type="display" width="80" height="24" />
000104180927     A*%%RS+ </sequence>
000105180927     A*%%RS </record-sequences>
