000100000000       IDENTIFICATION DIVISION.
000200181018       PROGRAM-ID.    TRCODCALD.
000300181018       AUTHOR.        RICHARD SALIRE.
000400181018       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000500000000       DATE-WRITTEN.  MARCH 2002.
000600000000       DATE-COMPILED.
000700000000      ******************************************************************
000800000000      * RFS37906:  Fix defect of rfs34688                              *
000900210928      *                                                                *
001000000000      * Assumption per Richard Salire:                                 *
001100000000      *                                                                *
001200000000      * This program TRCODCALD that mimics logic TRCODCALC and change  *
001300000000      * to retrieve field GDV. Assume GBV/GDV calculation are the same.*
001400000000      *                                                                *
001500000000      *   If RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET = 'A' then       *
001600000000      *      NEW-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET and/or  *
001700000000      *      OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET is GDV  *
001800000000      *      GUAR-DEATH-VALUE.                                         *
001900210408      *                                                                *
002000000000      *   Since file TRANS-GBV-TRANSFER is not related GDV, then       *
002100000000      *   remove logic retrieve file MFATRACXP.                        *
002200000000      ******************************************************************
002300000000      * PROGRAMMER | YYYY/MM/DD   | DESCRIPTION                        *
002400000000      ******************************************************************
002500000000      * R. Wong    | 2007/06/26   | RFS37906 - Fix Seg Funds GDVs,     *
002600000000      *            |              |   defect from RFS34688             ng
002700000000      *----------------------------------------------------------------*
002800071123      * Raymond Mui| 2007/11/23   | RFS45845 - Recompile.              *
002900080110      * Emman. Yala| 2008/01/10   | RFS47227 - Recompile.              *
003000210614      * Bojana J.  | 2008/05/06   | RFS51776 - Recompile.              *
003100080514      * Bojana J.  | 2008/05/14   | RFS47405 - Include CPGLWBRULE copy *
003200080514      *            |              |          - book.                   *
003300080523      * Daniel M.  | 2008/05/23   | RFS47405 - Include CPGLWBCKTT copy *
003400080523      *            |              |          - book.                   *
003500080619      * Daniel M.  | 2008/06/12   | RFS46707 - Changes to CPGLWBRULE.  *
003600080818      * Fatema Haji| 2008/08/18   | RFS55960 - Recompile.              *
003700090602      * Gary Xia   | 2009/06/02   | RFS57388 - Select records by reset *
003800090602      *            |              | type instead of reset category.    *
003900100730      * Pawel A    | 2010/07/30   | RFS84063 - Recompile (CPEXCLTRN)   *
004000110217      * Richard Shi| 2011/02/17   | RFS84184 - ESG 21                  *
004100110217      *            |              | recompiled for MFAACCNMP.          *
004200110303      * Emman Yala | 2011/03/03   | RFS91599 - Recompile for 80605     *
004300110511      * john O'call| 2011/05/05   | RFS83478 - trans-no 9(7) to 9(9)   *
004400110817      * Emman Yala | 2011/06/22   | RFS96543 - Correcting impact on change
004500110817      *            |              | of order on primary key of MFAACCCRP
004600110817      *            |              | after its conversion to SQL source obj
004700130401      * Abhisek M. | 2013/04/01   | RFS120002 - reccompile for MFATRACXP*
004800130717      * PREMIL  K. | 2013/07/17   | RFS110904 - PREFORM GDV RESET AND  *
004900130717      *            |              | REVERSE RESET.                     *
005000130906      * Andy Chan  * 2013/08/29   * RFS127401 - due to CPYEXCLTRN
005100131212      * Sangeetha V| 2013/12/12   | RFS130148- Defect Fix.             *
005200210104      *            |              | MSGW when calling FXSETPOL as the  *
005300131212      *            |              | variables were not initialized.    *
005400140403      * Arthy K    | 2014/04/03   | RFS134936 - Recompile for MFAACCONP*
005500140618      * Manjusha V | 2014/04/01   | RFS129902 -Recompile for CPGLWBRULE*
005600140618      * Kamal T    | 2014/06/17   | RFS118472 -Recompile for CPGLWBRULE*
005700140620      * Vinsfy J   * 2014/06/18   * RFS136634 - Recompile
005800140826      * Nagamnai S * 2014/08/13   * RFS139007 - Recompile for CPGLWBRULE
005900161102      * Geethanjali* 2016/07/28   * RFS159011 - Adjust GBV, GMV and GDV
006000161102      * T G        *              * after cash distribution
006100180604      * Sethu B    * 2018/05/22   * RFS177420 - Adjust GBV, GMV and GDV
006200180604      *            *              * after cash distribution
006300181022      * Joel Dsouza* 2018/10/18   * RFS1006259- GDV issues when GDV
006400181022      *            *              * is independent of GBV
006500200207      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
006600200629      * CHAYA SP   * 2020/06/24   * RFS185172 - Recompile for MFAACCONP
006700200724      * VIGNESH    * 2020/07/15   * RFS185171 -Recompile for MFAEXTRNP
006800200717      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFATRCODP
006900200721      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
007000201222      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
007100210217      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
007200210407      * Kavin      * 2021/01/05   * RFS180708 - Added MFATRNMSCP file
007300210707      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
007301211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
007302211007      *            *              * Array from 100 to 1000
007303211007      *            *              * Tagged as 111744
007400110217      *********************** *Last* ***********************************
007500000000       ENVIRONMENT DIVISION.
007600200327       CONFIGURATION SECTION.
007700000000       SOURCE-COMPUTER. IBM-AS400.
007800000000       OBJECT-COMPUTER. IBM-AS400.
007900000000       SPECIAL-NAMES.
008000000000           LOCAL-DATA IS WS-LOCAL.
008100200327      /
008200000000       INPUT-OUTPUT SECTION.
008300000000       FILE-CONTROL.
008400000000
008500000000           SELECT  ACCOUNT-CONTRACT-INVESTMENT
008600000000                   ASSIGN TO DATABASE-MFAACCCIP
008700000000                   ORGANIZATION IS INDEXED
008800000000                   ACCESS IS DYNAMIC
008900000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009000000000
009100000000           SELECT  ACCOUNT-CONTRACT-RESET-D
009200000000                   ASSIGN TO DATABASE-MFAACCCRP
009300000000                   ORGANIZATION IS INDEXED
009400000000                   ACCESS IS DYNAMIC
009500000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
009600000000
009700000000           SELECT  ACCOUNT-CONTRACT-INV-RESET
009800000000                   ASSIGN TO DATABASE-MFAACCCIRP
009900000000                   ORGANIZATION IS INDEXED
010000000000                   ACCESS IS DYNAMIC
010100000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010200000000
010300000000           SELECT  TRANS
010400000000                   ASSIGN TO DATABASE-MFATRNP
010500000000                   ORGANIZATION IS INDEXED
010600000000                   ACCESS IS DYNAMIC
010700000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
010800000000
010900000000           SELECT  ACCOUNT
011000000000                   ASSIGN TO DATABASE-MFAACCNTP
011100000000                   ORGANIZATION IS INDEXED
011200000000                   ACCESS IS DYNAMIC
011300000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
011400000000
011500000000           SELECT  ACCOUNT-NOMINEE
011600000000                   ASSIGN TO DATABASE-MFAACCNMP
011700000000                   ORGANIZATION IS INDEXED
011800000000                   ACCESS IS DYNAMIC
011900000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012000000000
012100000000           SELECT  EXCLUDE-TRANS
012200000000                   ASSIGN TO DATABASE-MFAEXTRNP
012300000000                   ORGANIZATION IS INDEXED
012400000000                   ACCESS IS DYNAMIC
012500000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
012600000000
012700000000           SELECT  ACCOUNT-ATTRIBUTES
012800000000                   ASSIGN TO DATABASE-MFAACCATP
012900000000                   ORGANIZATION IS INDEXED
013000000000                   ACCESS IS DYNAMIC
013100000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013200000000
013300000000           SELECT  TRANS-CONTRACT-DETAILS
013400000000                   ASSIGN TO DATABASE-MFATRCODP
013500000000                   ORGANIZATION IS INDEXED
013600000000                   ACCESS IS DYNAMIC
013700000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
013800000000
013900000000           SELECT  INVESTMENT
014000000000                   ASSIGN TO DATABASE-MFAINVP
014100000000                   ORGANIZATION IS INDEXED
014200000000                   ACCESS IS DYNAMIC
014300000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
014400000000
014500000000           SELECT  INVESTMENT-UNIT-PRICE
014600000000                   ASSIGN TO DATABASE-MFAINVUPLB
014700000000                   ORGANIZATION IS INDEXED
014800000000                   ACCESS IS DYNAMIC
014900000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
015000000000                          WITH DUPLICATES.
015100000000
015200000000           SELECT  TRANS-EXCHANGE-RATE
015300000000                   ASSIGN TO DATABASE-MFATREXRP
015400000000                   ORGANIZATION IS INDEXED
015500000000                   ACCESS IS DYNAMIC
015600000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
015700000000
015800000000           SELECT  EXCHANGE-RATE-M
015900000000                   ASSIGN TO DATABASE-MFAEXRHMP
016000000000                   ORGANIZATION IS INDEXED
016100000000                   ACCESS IS DYNAMIC
016200000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016300000000
016400000000           SELECT  CURRENCY-CODE
016500000000                   ASSIGN TO DATABASE-MFACURP
016600000000                   ORGANIZATION IS INDEXED
016700000000                   ACCESS IS DYNAMIC
016800000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
016900000000
017000000000           SELECT  PROGRAM-EXCHANGE-RATE
017100000000                   ASSIGN TO DATABASE-MFAPRGERP
017200000000                   ORGANIZATION IS INDEXED
017300000000                   ACCESS IS DYNAMIC
017400000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
017500000000
017600000000           SELECT  TRANS-TARGET
017700000000                   ASSIGN TO DATABASE-MFATRNTGLA
017800000000                   ORGANIZATION IS INDEXED
017900000000                   ACCESS IS DYNAMIC
018000000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018100000000
018200000000           SELECT  TRANS-RVS
018300000000                   ASSIGN TO DATABASE-MFATRNP
018400000000                   ORGANIZATION IS INDEXED
018500000000                   ACCESS IS DYNAMIC
018600000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
018700000000
018800000000           SELECT  INVESTMENT-SEG
018900000000                   ASSIGN TO DATABASE-MFAINVSGP
019000000000                   ORGANIZATION IS INDEXED
019100000000                   ACCESS IS DYNAMIC
019200000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019300000000
019400000000           SELECT  TRANS-D
019500000000                   ASSIGN TO DATABASE-MFATRNLN
019600000000                   ORGANIZATION IS INDEXED
019700000000                   ACCESS IS DYNAMIC
019800000000                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
019900000000                          WITH DUPLICATES.
020000000000
020100000000R13394     SELECT  TRANS-GBV-TRANSFER
020200000000R13394             ASSIGN TO DATABASE-MFATRACXP
020300000000R13394             ORGANIZATION IS INDEXED
020400000000R13394             ACCESS IS DYNAMIC
020500000000R13394             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020600130717
020700130717      *RFS110904 - START
020800130717           SELECT  INVESTMENT-STRUCTURE-XREF
020900130717                   ASSIGN TO DATABASE-MFAINVSXP
021000130717                   ORGANIZATION IS INDEXED
021100130717                   ACCESS IS DYNAMIC
021200130717                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021300130717      *RFS110904 - END
021400000000      /
021500210105      *RFS180708 - Start
021600210105           SELECT  TRANS-MISC-DETAILS
021700210105                   ASSIGN TO DATABASE-MFATRNMSCP
021800210105                   ORGANIZATION IS INDEXED
021900210105                   ACCESS IS DYNAMIC
022000210105                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022100210329
022200210329           SELECT  TRANS-REDEM-DETAILS
022300210329                   ASSIGN TO DATABASE-MFATRNREP
022400210329                   ORGANIZATION IS INDEXED
022500210329                   ACCESS IS DYNAMIC
022600210329                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022700210105      *RFS180708 - End
022800210105
022900000000       DATA DIVISION.
023000000000       FILE SECTION.
023100000000       FD  ACCOUNT-CONTRACT-INVESTMENT
023200000000           LABEL RECORDS ARE STANDARD.
023300000000       01  ACC-CON-INV-REC.           COPY DD-ALL-FORMATS OF MFAACCCIP.
023400000000
023500000000       FD  ACCOUNT-CONTRACT-RESET-D
023600000000           LABEL RECORDS ARE STANDARD.
023700000000       01  ACC-CON-RES-D-REC.         COPY DD-ALL-FORMATS OF MFAACCCRP.
023800000000
023900000000       FD  ACCOUNT-CONTRACT-INV-RESET
024000000000           LABEL RECORDS ARE STANDARD.
024100000000       01  ACC-CON-INV-RES-REC.       COPY DD-ALL-FORMATS OF MFAACCCIRP.
024200000000
024300000000       FD  TRANS
024400000000           LABEL RECORDS ARE STANDARD.
024500000000       01  TRANS-REC.                 COPY DD-ALL-FORMATS OF MFATRNP.
024600000000
024700000000       FD  ACCOUNT
024800000000           LABEL RECORDS ARE STANDARD.
024900000000       01  ACCOUNT-REC.               COPY DD-ALL-FORMATS OF MFAACCNTP.
025000000000
025100000000       FD  ACCOUNT-NOMINEE
025200000000           LABEL RECORDS ARE STANDARD.
025300000000       01  ACCOUNT-NOMINEE-REC.       COPY DD-ALL-FORMATS OF MFAACCNMP.
025400000000
025500000000       FD  EXCLUDE-TRANS
025600000000           LABEL RECORDS ARE STANDARD.
025700000000       01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
025800000000
025900000000       FD  ACCOUNT-ATTRIBUTES
026000000000           LABEL RECORDS ARE STANDARD.
026100000000       01  ACCOUNT-ATT-REC.           COPY DD-ALL-FORMATS OF MFAACCATP.
026200000000
026300000000       FD  TRANS-CONTRACT-DETAILS
026400000000           LABEL RECORDS ARE STANDARD.
026500000000       01  TRANS-CONTRACT-DTLS-REC.   COPY DD-ALL-FORMATS OF MFATRCODP.
026600000000
026700000000       FD  INVESTMENT
026800000000           LABEL RECORDS ARE STANDARD.
026900000000       01  INVESTMENT-REC.            COPY DD-ALL-FORMATS OF MFAINVP.
027000000000
027100000000       FD  INVESTMENT-UNIT-PRICE
027200000000           LABEL RECORDS ARE STANDARD.
027300000000       01  INVESTMENT-UNIT-PRICE-REC. COPY DD-ALL-FORMATS OF MFAINVUPLB.
027400000000
027500000000       FD  TRANS-EXCHANGE-RATE
027600000000           LABEL RECORDS ARE STANDARD.
027700000000       01  TRANS-EXCH-RATE-REC.       COPY DD-ALL-FORMATS OF MFATREXRP.
027800000000
027900000000       FD  EXCHANGE-RATE-M
028000000000           LABEL RECORDS ARE STANDARD.
028100000000       01  EXCHANGE-RATE-M-REC.       COPY DD-ALL-FORMATS OF MFAEXRHMP.
028200000000
028300000000       FD  CURRENCY-CODE
028400000000           LABEL RECORDS ARE STANDARD.
028500000000       01  CURRENCY-CODE-REC.         COPY DD-ALL-FORMATS OF MFACURP.
028600000000
028700000000       FD  PROGRAM-EXCHANGE-RATE
028800000000           LABEL RECORDS ARE STANDARD.
028900000000       01  PROG-EXCH-RATE-REC.        COPY DD-ALL-FORMATS OF MFAPRGERP.
029000000000
029100000000       FD  TRANS-TARGET
029200000000           LABEL RECORDS ARE STANDARD.
029300000000       01  TRANS-TARGET-REC.          COPY DD-ALL-FORMATS OF MFATRNTGLA.
029400000000
029500000000       FD  TRANS-RVS
029600000000           LABEL RECORDS ARE STANDARD.
029700000000       01  TRANS-RVS-REC.             COPY DD-ALL-FORMATS OF MFATRNP.
029800000000
029900000000       FD  INVESTMENT-SEG
030000000000           LABEL RECORDS ARE STANDARD.
030100000000       01  INVESTMENT-SEG-REC.        COPY DD-ALL-FORMATS OF MFAINVSGP.
030200000000
030300000000       FD  TRANS-D
030400000000           LABEL RECORDS ARE STANDARD.
030500000000       01  TRANS-D-REC.               COPY DD-ALL-FORMATS OF MFATRNLN.
030600000000
030700000000R13394 FD  TRANS-GBV-TRANSFER
030800000000R13394     LABEL RECORDS ARE STANDARD.
030900000000R13394 01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
031000130717
031100130717      *RFS110904 - START
031200130717       FD  INVESTMENT-STRUCTURE-XREF
031300130717           LABEL RECORDS ARE STANDARD.
031400130717       01  INV-STRU-XREF-REC.         COPY DD-ALL-FORMATS OF MFAINVSXP.
031500130717      *RFS110904 - END
031600000000      /
031700210105      *RFS180708 - Start
031800210105       FD  TRANS-MISC-DETAILS
031900210105           LABEL RECORDS ARE STANDARD.
032000210105       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
032100210329
032200210329       FD  TRANS-REDEM-DETAILS
032300210329           LABEL RECORDS ARE STANDARD.
032400210329       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
032500210105      *RFS180708 - End
032600210105
032700000000       WORKING-STORAGE SECTION.
032800000000
032900000000           EXEC SQL
033000000000                INCLUDE SQLCA
033100000000           END-EXEC.
033200000000
033300130830110904*01 ACCOUNT-CONTRACT.
033400130830110904**  05 GUAR-Benefit-Eligible       PIC X(1).
033500130814
033600000000       01 WS-PROGRAM-VARIABLES.
033700000000          05 CURR-ACCOUNT-NO             PIC S9(9).
033800000000          05 CURR-CONTRACT-NO            PIC S9(9).
033900000000          05 CURR-RESET-NUMBER           PIC S9(9).
034000000000          05 CURR-INVESTMENT-CODE        PIC  X(5).
034100000000          05 CURR-PLACEMENT-DATE         PIC S9(8).
03420011051183478 *   05 CURR-TRANS-NO               PIC S9(7).
03430011051183478     05 CURR-TRANS-NO               PIC S9(9).
034400000000          05 WS-CURR-RESET-NUMBER-EQ     PIC S9(2).
034500000000          05 WS-CURR-RESET-NUMBER-MID    PIC S9(2).
034600000000          05 WS-CURR-RESET-NUMBER-GT     PIC S9(2).
034700000000          05 WS-CURR-RESET-NUMBER-LT     PIC S9(2).
034800000000          05 WS-CONTRACT-EFF-DATE-EQ     PIC S9(8).
034900000000          05 WS-CONTRACT-EFF-DATE-GT     PIC S9(8).
035000000000          05 WS-CONTRACT-EFF-DATE-LT     PIC S9(8).
035100000000          05 WS-CONTRACT-EFF-DATE-MID    PIC S9(8).
035200000000          05 WS-AS-OF-THIS-DATE          PIC S9(8).
035300000000          05 WS-ORIG-UNIT-BAL            PIC S9(11)V9(3).
035400000000          05 WS-INVEST-CODE              PIC X(5).
035500000000          05 WS-CONT-INV-ARRAY-COUNT     PIC S9(02) COMP-3.
035600000000          05 WS-CONT-INV-COUNT           PIC S9(02) COMP-3.
035700000000          05 WS-CALC-INVESTMENT-CODE     PIC X(5).
035800000000      * RFS27951 - added initial values.
035900000000       01 WS-CALCULATION-VARS.
036000000000          05 WS-NDV-CHANGE               PIC S9(11)V9(2) COMP-3
036100000000                                              VALUE 0.
036200000000          05 WS-GDV-CHANGE               PIC S9(11)V9(2) COMP-3
036300000000                                              VALUE 0.
036400000000          05 WS-TEMP-NDV                 PIC S9(11)V9(2) COMP-3
036500000000                                              VALUE 0.
036600000000          05 WS-TEMP-GDV                 PIC S9(11)V9(2) COMP-3
036700000000                                              VALUE 0.
036800000000          05 WS-NDV-REMAIN-AMT           PIC S9(11)V9(2) COMP-3
036900000000                                              VALUE 0.
037000000000          05 WS-GDV-REMAIN-AMT           PIC S9(11)V9(2) COMP-3
037100000000                                              VALUE 0.
037200000000          05 WS-TRANS-UNIT-PRICE         PIC S9(11)V9(3) COMP-3
037300000000                                              VALUE 0.
037400000000          05 WS-TRANS-TRADE-DATE         PIC 9(8).
037500000000          05 WS-CONT-INV-UNIT-PRICE      PIC S9(5)V9(4) COMP-3.
037600000000          05 WS-CONT-INV-EXCH-RATE       PIC S9(2)V9(7) COMP-3.
037700000000          05 WS-TRANS-INVESTMENT-CODE    PIC X(5).
037800000000          05 WS-CONT-INVESTMENT-CODE     PIC X(5).
037900000000          05 WS-TRANS-TRADE-AMOUNT       PIC S9(11)V9(2) COMP-3.
038000000000          05 WS-CONT-MV-BEF-TOTAL        PIC S9(12)V9(2) COMP-3.
038100000000          05 WS-CONT-MV-AFT-TOTAL        PIC S9(12)V9(2) COMP-3.
038200000000          05 WS-CONT-NDV-BEF-TOTAL       PIC S9(12)V9(2) COMP-3.
038300000000          05 WS-CONT-GDV-BEF-TOTAL       PIC S9(12)V9(2) COMP-3.
038400000000          05 WS-CONT-NDV-AFTER           PIC S9(12)V9(2) COMP-3.
038500000000          05 WS-CONT-GDV-AFTER           PIC S9(12)V9(2) COMP-3.
038600000000          05 WS-INV-NDV-AFT              PIC S9(11)V9(2) COMP-3.
038700000000          05 WS-INV-GDV-AFT              PIC S9(11)V9(2) COMP-3.
038800000000          05 WS-CONT-NDV-AFT-TOTAL       PIC S9(12)V9(2) COMP-3.
038900000000          05 WS-CONT-GDV-AFT-TOTAL       PIC S9(12)V9(2) COMP-3.
039000000000          05 WS-NDV-DIFF-AMOUNT          PIC S9(07)V9(2) COMP-3.
039100000000          05 WS-GDV-DIFF-AMOUNT          PIC S9(07)V9(2) COMP-3.
039200000000          05 WS-DUMMY-PERCENT            PIC S9(2)V9(3) COMP-3.
039300000000          05 WS-INV-NDV-PERCENT          PIC S9(2)V9(3) COMP-3.
039400000000          05 WS-INV-GDV-PERCENT          PIC S9(2)V9(3) COMP-3.
039500000000          05 WS-INV-NDV-PERCENT-TOTAL    PIC S9(2)V9(3) COMP-3.
039600000000          05 WS-INV-GDV-PERCENT-TOTAL    PIC S9(2)V9(3) COMP-3.
039700000000
039800000000       01 WS-SQL-VARIABLES.
039900000000          05 WS-SQL-PROCESS-DATE         PIC S9(8) VALUE 0.
040000000000          05 WS-SQL-PROC-SEQ-NO          PIC S9(9) VALUE 0.
040100000000          05 WS-SQL-PLACEMENT-DATE       PIC S9(8) VALUE 0.
04020011051183478 *   05 WS-SQL-TRANS-NO             PIC S9(7) VALUE 0.
04030011051183478     05 WS-SQL-TRANS-NO             PIC S9(9) VALUE 0.
040400000000          05 WS-SQL-CONTRACT-NO          PIC S9(9) VALUE 0.
040500000000      * RFS27951 - ADDED init vcalue
040600000000       01 EXCLUDE-TRANS-FLAG             PIC X VALUE SPACES.
040700000000       01 CURR-CONTROLS                  PIC X(1).
040800000000       01 UNITRAX-BASE-CURRENCY          PIC X(3) VALUE " ".
040900000000       01 PROG-EXCHANGE-RATE-TYPE        PIC X(1) VALUE " ".
041000000000
041100000000       01 WS-PROCESS-DATE.
041200000000          05 WS-AS-AT-DATE-CHAR          PIC X(8).
041300000000          05 WS-AS-AT-DATE REDEFINES WS-AS-AT-DATE-CHAR
041400000000                                         PIC S9(8).
041500000000          05 FILLER                      PIC X(161).
041600000000
041700130717      * RFS 110904 - START
041800130717       01 LC-INVSTRUCTURECODE           PIC X(5).
041900130830127401 01 lc-GuarBenefitEligible        PIC X(5).
042000130717      * RFS 110904 - END
042100130717
042200000000       01 WS-ACC-CON-INV-ARRAY-DEF.
042201211007111744*   05 WS-ACC-CON-INV-ARRAY OCCURS 100 TIMES INDEXED BY ACIIDX,
042202211007111744*                                                        ACIIDX2.
042203211007111744    05 WS-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES DEPENDING ON
042204211007111744    ln_InvArraySize INDEXED BY ACIIDX, ACIIDX2.
042500000000             10 WS-ARRAY-ACCOUNT-NO        PIC S9(09).
042600000000             10 WS-ARRAY-CONTRACT-NO       PIC S9(09).
042700000000             10 WS-ARRAY-INVESTMENT-CODE   PIC  X(05).
042800000000             10 WS-ARRAY-CURR-UNIT-BAL     PIC S9(10)V9(3) COMP-3.
042900000000             10 WS-ARRAY-NET-DEP-VALUE     PIC S9(11)V9(2) COMP-3.
043000000000             10 WS-ARRAY-GUAR-DEATH-VALUE  PIC S9(11)V9(2) COMP-3.
043100000000             10 WS-ARRAY-INV-MV-BEF        PIC S9(11)V9(2) COMP-3.
043200000000             10 WS-ARRAY-INV-MV-AFT        PIC S9(11)V9(2) COMP-3.
043300000000             10 WS-ARRAY-INV-CURR-CODE     PIC X(03).
043400000000             10 WS-ARRAY-INV-EXCH-RATE     PIC S9(02)V9(7) COMP-3.
043500000000      * RFS24943 - Begin: Need to keep Curren GDV,NDV
043600000000             10 WS-ARRAY-CURR-NET-DEP-VALUE     PIC S9(11)V9(2) COMP-3.
043700000000             10 WS-ARRAY-CURR-GUAR-DEATH-VALUE  PIC S9(11)V9(2) COMP-3.
043800000000      * RFS24943 - End
043900000000
044000000000       01 WS-COPYBOOK-VARS.
044100000000          05 WS-EX-ACCOUNT-TYPE          PIC X(05).
044200000000          05 WS-EX-NOM-ACCOUNT-TYPE      PIC X(05).
044300000000          05 WS-EX-TRANS-TYPE-CODE       PIC X(03).
044400000000          05 WS-EX-TRANS-ORIGIN-CODE     PIC X(03).
044500000000          05 WS-EX-REVERSAL-CODE         PIC X(04).
044600000000          05 WS-EX-ACCOUNT-ATT-CODE      PIC X(05).
044700000000
044800000000       01 WS-LEVEL-88-VARS.
044900000000          05 WS-RESET-EQ-END-DATE        PIC X(1).
045000000000             88 RESET-EQ-END-DATE        VALUE "Y".
045100000000             88 NO-RESET-EQ-END-DATE     VALUE "N".
045200000000          05 WS-RESET-GT-END-DATE        PIC X(1).
045300000000             88 RESET-GT-END-DATE        VALUE "Y".
045400000000             88 NO-RESET-GT-END-DATE     VALUE "N".
045500180604177420    05 WS-RESET-LT-END-DATE        PIC X(1).
045600180604177420       88 RESET-LT-END-DATE        VALUE "Y".
045700180604177420       88 NO-RESET-LT-END-DATE     VALUE "N".
045800000000          05 WS-RESET-MID-DATE-RANGE     PIC X(1).
045900000000             88 RESET-MID-DATE-RANGE     VALUE "Y".
046000000000             88 NO-RESET-MID-DATE-RANGE  VALUE "N".
046100000000          05 WS-RESET-LT-BEGIN-DATE      PIC X(1).
046200000000             88 RESET-LT-BEGIN-DATE      VALUE "Y".
046300000000             88 NO-RESET-LT-BEGIN-DATE   VALUE "N".
046400000000          05 WS-RESET-FOUND              PIC X(1).
046500000000             88 RESET-FOUND              VALUE "Y".
046600000000             88 NO-RESET-FOUND           VALUE "N".
046700000000          05 WS-SQL-FILE-OPEN-BCK        PIC X(1).
046800000000             88 SQL-FILE-OPEN-BCK        VALUE "Y".
046900000000          05 WS-READ-NEXT-TRANS          PIC X(1).
047000000000             88 READ-NEXT-TRANS          VALUE "Y".
047100000000          05 WS-LOAD-STRUCTURE           PIC X(1).
047200000000             88 FRONT-END                VALUE "F".
047300000000          05 WS-GET-LOAD-STRUCTURE       PIC X(1).
047400000000             88 GET-LOAD-STRUCTURE       VALUE "Y".
047500000000          05 WS-PRICE-FOUND              PIC X(1).
047600000000             88 PRICE-FOUND              VALUE "Y".
047700000000          05 WS-NDV-DIFF-FLAG            PIC X(1).
047800000000             88 NDV-DIFFERENCE-FOUND     VALUE "Y".
047900000000          05 WS-GDV-DIFF-FLAG            PIC X(1).
048000000000             88 GDV-DIFFERENCE-FOUND     VALUE "Y".
048100000000          05 WS-CALC-METHOD              PIC X(1).
048200000000             88 STANDARD-CALC-METHOD     VALUE "S".
048300000000             88 PROPORTIONAL-CALC-METHOD VALUE "P".
048400000000          05 WS-FIRST-CONTRACT-INV-FLAG  PIC X(1).
048500000000             88 FIRST-CONTRACT-INV       VALUE "Y".
048600000000R13394    05 WS-XFER-AMT-EXISTS-FLAG     PIC X(1).
048700000000R13394       88 TRANSFER-AMT-EXISTS      VALUE "Y".
048800000000R14315    05 WS-END-OF-PROCESS           PIC X(1).
048900000000R14315       88 END-OF-PROCESS           VALUE "Y".
049000000000R17274    05 WS-UNITS-ZERO-BALANCE       PIC X(1).
049100000000R17274       88 UNITS-ZERO-BALANCE       VALUE "Y".
049200000000R17274    05 WS-PRFRM-NDV-BALANCE        PIC X(1).
049300000000R17274       88 PRFRM-NDV-BALANCE        VALUE "Y".
049400000000R17274    05 WS-PRFRM-GDV-BALANCE        PIC X(1).
049500000000R17274       88 PRFRM-GDV-BALANCE        VALUE "Y".
049600000000
049700000000       01 TRANSACTION-CATEGORIES.
049800000000          05 TRANS-TYPE-CATEGORY         PIC X(3).
049900000000             88 VALID-TRANSACTION        VALUES "BUY" "SWI" "TRI"
05000000000026151                                           "MFR"
050100000000                                                "SEL" "SWO" "TRO".
050200000000             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI".
050300000000             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO".
050400000000             88 SWITCH-OUT-TRANSACTION   VALUES "SWO" "TRO".
050500000000             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
050600000000             88 BUY-TRANSACTION          VALUE "BUY".
050700000000             88 TRANSFER-IN              VALUE "TRI".
050800000000             88 SELL-TRANSACTION         VALUE "SEL".
05090000000026151        88 MAN-FEE-REB-TRANSACTION  VALUES "MFR".
051000161102159011       88 DISTRIBUTION-TRANSACTION VALUES "INC" "INT" "CPG".
051100000000          05 TRANS-STATUS-CATEGORY       PIC X(3).
051200000000             88 HISTORY-REVERSE          VALUES "HSC" "HST" "RVS".
051300000000             88 STATUS-RVS               VALUE  "RVS".
051400000000          05 TRANS-REVERSE-CATEGORY      PIC X(1).
051500000000             88 TRANS-REVERSED           VALUE "Y".
051600000000
051700161102      * RFS 159011 - Starts
051800161102       01 lc_DistribCategories.
051900161102          05 lc_DistrOptionCode     PIC X(1)        VALUE SPACES.
052000161102          05 ln_PlacementDate       PIC S9(8).
052100161102          05 ln_TransNo             PIC S9(9).
052200161125       01 lc_C                      PIC X(1)        VALUE "C".
052300161102      * RFS 159011 - Ends
052400161102
052500000000      * RFS24943 - Begin
052600000000       01 WS-CURR-VARS.
052700000000         03 WS-CURR-UNIT-BAL   PIC S9(10)V9(3) COMP-3 VALUE 0.
052800000000
052900000000       01 WS-TOT-GDV-NDV-CHANGE.
053000000000         03 WS-CALC-TOT-GDV    PIC S9(11)V9(2) COMP-3 VALUE 0.
053100000000         03 WS-CALC-TOT-NDV    PIC S9(11)V9(2) COMP-3 VALUE 0.
053200000000      * To keep reconciliation amount
053300000000         03 WS-DELTA-TOT-GDV   PIC S9(11)V9(2) COMP-3 VALUE 0.
053400000000         03 WS-DELTA-TOT-NDV   PIC S9(11)V9(2) COMP-3 VALUE 0.
053500000000
053600000000         03 WS-TOT-GDV-CHANGE  PIC S9(11)V9(2) COMP-3 VALUE 0.
053700000000         03 WS-TOT-NDV-CHANGE  PIC S9(11)V9(2) COMP-3 VALUE 0.
053800000000
053900000000       01 WS-ARRAY-ELEMENTS            PIC S9(05) COMP-3 VALUE 0.
054000000000
054100000000       01 SW-ARRAY-FLAG                PIC 1 VALUE B'0'.
054200000000         88 SW-ARRAY-START             VALUE B"0".
054300000000         88 SW-ARRAY-END               VALUE B"1".
054400000000
054500000000       01 SW-REVISED-METHOD-FLAG       PIC 1 VALUE B"0".
054600000000         88 SW-REVISED-METHOD-NOT-USED VALUE B"0".
054700000000         88 SW-REVISED-METHOD-USED     VALUE B"1".
054800000000
054900000000       01  WS-MISC-FIELDS.
055000000000      * Check screen edit code of DMCCON
055100000000           05 WS-DMCCON-EDIT           PIC X(1) VALUE "N".
055200000000             88 WS-DMCCON-EDIT-NO      VALUE "N".
055300000000             88 WS-DMCCON-EDIT-YES     VALUE "Y".
055400000000      * Check account attribute code of PRE99
055500000000           05 WS-PRE-1999              PIC X(1) VALUE "N".
055600000000      * Total Units in the contract
055700000000           05 WS-TOT-UNIT              PIC S9(10)V9(3) COMP-3.
055800000000           05 WS-TOT-UNIT-FLAG         PIC X(1) VALUE "N".
055900000000             88 WS-TOT-UNIT-NO         VALUE "N".
056000000000             88 WS-TOT-UNIT-YES        VALUE "Y".
056100000000      * Total GDV of the contract
056200000000           05 WS-TOT-GDV               PIC S9(11)V9(2) COMP-3 VALUE 0.
056300000000           05 WS-TOT-NDV               PIC S9(11)V9(2) COMP-3 VALUE 0.
056400000000           05 WS-TOT-GDV-FLAG          PIC X(1) VALUE "N".
056500000000             88 WS-TOT-GDV-NO          VALUE "N".
056600000000             88 WS-TOT-GDV-YES         VALUE "Y".
056700000000
056800000000       01 LT-LITERALS.
056900000000         03 LT-Y                       PIC X(01)    VALUE "Y".
057000000000      * RFS24943 - End
057100000000
057200000000      * RFS24943 - Begin
057300000000      * Screen Edits Allowed Declaration
057400000000       01  SCREEN-EDITS-ALLOWED-REC.
057500000000                             COPY DD-ALL-FORMATS OF MFAEDTSCP.
057600000000
057700000000      * Use the function FXSCEDTALW
057800000000       01  WS-SCREEN-EDITS-ALLOWED.
057900000000           05 WS-SEA-EDIT-SQLLOG           PIC X(1) VALUE "N".
058000000000           05 WS-SEA-RETURN-CODE           PIC X(2) VALUE "00".
058100000000
058200000000           05 WS-ACCCDTL-SCREEN-CODE   PIC X(8)     VALUE "ACCCDTL".
058300000000           05 WS-DMCCON-EDIT-CODE      PIC X(8)     VALUE "DMCCON" .
058400000000           05 WS-DMCCON-LEVEL-CODE     PIC X(1)     VALUE "A".
058500000000      * RFS24943 - End
058600000000
058700000000      * RFS27951 - Begin
058800000000       01 WS-TEMP-VARS.
058900000000         05 WS-TEMP-END-DATE             PIC S9(09) COMP-3 VALUE 0.
059000000000         05 WS-TEMP-AS-OF-THIS-DATE      PIC S9(09) COMP-3 VALUE 0.
059100000000
059200000000       01 SW-INDEX-CREATED-FLAG          PIC X(01).
059300000000         88 SW-INDEX-NOT-CREATED         VALUE SPACES.
059400000000         88 SW-INDEX-CREATED             VALUE "Y".
059500000000      * RFS27951 - End
059600000000
059700210111180708 01 WS-PLACEMENTDATE           PIC S9(09) VALUE 0.
059800210111180708 01 WS-TRANSNO                 PIC S9(09) VALUE 0.
059801211007      *RFS1117445 START
059802211007        01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
059803211007        01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
059804211007        01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
059805211007      *RFS1117445 END
059900210111
060000080514R47405 COPY CPGLWBRULE.
06010010073084063 *COPY CPGLWBCKTT.
06020010073084063  COPY CPCKFEETRN.
060300080514
060400000000       LINKAGE SECTION.
060500000000       01 PARM-ACCOUNT-NO                PIC S9(9).
060600000000       01 PARM-CONTRACT-NO               PIC S9(9).
060700000000       01 PARM-END-DATE                  PIC S9(8).
060800000000       01 PARM-ACC-CON-INV-ARRAY-DEF.
060801211007R13901*   05 PARM-ACC-CON-INV-ARRAY OCCURS 100 TIMES INDEXED BY PACIIDX.
060802211007111744    05 PARM-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES
060803211007111744            DEPENDING ON ln_InvArraySize INDEXED BY PACIIDX.
061000000000             10 PARM-ACCOUNT-NUMBER       PIC 9(09).
061100000000             10 PARM-CONTRACT-NUMBER      PIC 9(09).
061200000000             10 PARM-INVESTMENT-CODE       PIC X(05).
061300000000             10 PARM-NET-DEP-VALUE        PIC S9(11)V9(2) COMP-3.
061400000000             10 PARM-GUAR-DEATH-VALUE     PIC S9(11)V9(2) COMP-3.
061500000000             10 PARM-CURR-UNIT-BAL        PIC S9(10)V9(3) COMP-3.
061600000000
061700000000       PROCEDURE DIVISION USING PARM-ACCOUNT-NO
061800000000                                PARM-CONTRACT-NO
061900000000                                PARM-END-DATE
062000000000                                PARM-ACC-CON-INV-ARRAY-DEF.
062100000000
062200000000       MAINLINE.
062300000000           PERFORM INITIAL-LOGIC       THRU INL-EXIT.
062400000000           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
062500000000              GO TO ML-0030.
062600000000       ML-0010.
062700000000           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
062800000000       ML-0020.
062900000000           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
063000000000       ML-0030.
063100000000           PERFORM END-JOB             THRU EOJ-EXIT.
063200000000           GOBACK.
063300000000      /
063400000000       INITIAL-LOGIC.
063500130830127401*    EXEC SQL
063600130830110904*      SELECT GUAR_BENEFIT_ELIGIBLE              127401
063700130830110904*        INTO :GUAR-BENEFIT-ELIGIBLE             127401
063800130830110904*        FROM MFAACCONP                          127401
063900130830110904*       WHERE ACCOUNT_NO  = :PARM-ACCOUNT-NO     127401
064000130830110904*         AND CONTRACT_NO = :PARM-CONTRACT-NO    127401
064100130830110904*    END-EXEC.                                   127401
064200130814
064300000000      * RFS27951 - Begin
064400000000           INITIALIZE WS-LEVEL-88-VARS
064500000000                      TRANSACTION-CATEGORIES
064600000000                      WS-CALCULATION-VARS
064700000000      * RFS27951 - End
064800000000
064900000000           MOVE LOW-VALUES TO CURR-CONTROLS.
064901211007111744        INITIALIZE ln_InvArraySize
064902211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
065000000000           INITIALIZE WS-PROGRAM-VARIABLES
065100000000                      WS-ACC-CON-INV-ARRAY-DEF.
065101211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
065102211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
065103211007111744     INITIALIZE WS-ARRAY-ACCOUNT-NO(IVS-CNT1)
065104211007111744                WS-ARRAY-CONTRACT-NO(IVS-CNT1)
065105211007111744                WS-ARRAY-INVESTMENT-CODE(IVS-CNT1)
065106211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
065107211007111744                WS-ARRAY-NET-DEP-VALUE(IVS-CNT1)
065108211007111744                WS-ARRAY-GUAR-DEATH-VALUE(IVS-CNT1)
065109211007111744                WS-ARRAY-INV-MV-BEF(IVS-CNT1)
065110211007111744                WS-ARRAY-INV-MV-AFT(IVS-CNT1)
065111211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
065112211007111744                WS-ARRAY-INV-EXCH-RATE(IVS-CNT1)
065113211007111744                WS-ARRAY-CURR-NET-DEP-VALUE(IVS-CNT1)
065114211007111744     END-PERFORM
065200000000           MOVE "N" TO WS-RESET-FOUND.
065300000000
065400000000      * RFS24943 - Begin
065500000000      * Get screen edit code DMCCON
065600000000
065700000000           INITIALIZE MFAEDTSCP OF SCREEN-EDITS-ALLOWED-REC
065800000000           MOVE WS-ACCCDTL-SCREEN-CODE TO
065900000000                        SCREEN-CODE OF SCREEN-EDITS-ALLOWED-REC
066000000000           MOVE WS-DMCCON-EDIT-CODE    TO
066100000000                        EDIT-CODE OF SCREEN-EDITS-ALLOWED-REC
066200000000           MOVE WS-DMCCON-LEVEL-CODE   TO
066300000000                        LEVEL-CODE OF SCREEN-EDITS-ALLOWED-REC
066400000000           PERFORM GET-SCREEN-EDITS-ALLOWED THRU GSEA-EXIT
066500000000
066600000000           IF WS-SEA-RETURN-CODE = "00"
066700000000             SET WS-DMCCON-EDIT-YES    TO TRUE
066800000000           END-IF
066900000000      * RFS24943 - End
067000000000
067100000000           OPEN INPUT ACCOUNT-CONTRACT-INVESTMENT
067200000000                      ACCOUNT-CONTRACT-RESET-D
067300000000                      ACCOUNT-CONTRACT-INV-RESET
067400000000                      ACCOUNT
067500000000                      ACCOUNT-NOMINEE
067600000000                      EXCLUDE-TRANS
067700000000                      ACCOUNT-ATTRIBUTES
067800000000                      TRANS-CONTRACT-DETAILS
067900000000                      INVESTMENT
068000000000                      INVESTMENT-UNIT-PRICE
068100000000                      TRANS-EXCHANGE-RATE
068200000000                      EXCHANGE-RATE-M
068300000000                      CURRENCY-CODE
068400000000                      PROGRAM-EXCHANGE-RATE
068500000000                      TRANS-TARGET
068600000000                      TRANS-RVS
068700000000                      INVESTMENT-SEG
068800000000                      TRANS-D
06890000000037906 **   R13394                TRANS-GDV-TRANSFER
069000130802110904                INVESTMENT-STRUCTURE-XREF
069100210108180708                TRANS-MISC-DETAILS
069200210329180708                TRANS-REDEM-DETAILS
069300000000                      TRANS.
069400000000
069500000000           IF PARM-ACCOUNT-NO = 0 OR PARM-CONTRACT-NO = 0
069600000000              MOVE HIGH-VALUES TO CURR-CONTROLS
069700000000              GO TO INL-EXIT
069800000000           END-IF.
069900000000
070000000000      * RFS27951 - Begin: replace the logic to only one call
070100000000      *    INITIALIZE WS-PROCESS-DATE.
070200000000      *    CALL "RTVPRCDTP" USING WS-PROCESS-DATE.
070300000000      *    CANCEL "RTVPRCDTP".
070400000000
070500000000           IF WS-AS-AT-DATE-CHAR = SPACES
070600000000             CALL "RTVPRCDTP" USING WS-PROCESS-DATE
070700000000           END-IF.
070800000000
070900000000           IF SW-INDEX-NOT-CREATED
071000000000             SET SW-INDEX-CREATED     TO TRUE
071100000000             PERFORM CREATE-INDEXES
071200000000           END-IF
071300000000      * RFS27951 - End
071400000000
071500000000           MOVE WS-AS-AT-DATE TO WS-AS-OF-THIS-DATE.
071600000000           PERFORM GET-BASE-CURRENCY THRU GBC-EXIT.
071700000000           PERFORM GET-EXCHANGE-RATE-TYPE THRU GERT-EXIT.
071800000000
071900000000           MOVE PARM-ACCOUNT-NO TO CURR-ACCOUNT-NO.
072000000000           MOVE PARM-CONTRACT-NO TO CURR-CONTRACT-NO.
072100000000
072200000000       INL-EXIT.
072300000000           EXIT.
072400000000      /
072500000000       GET-BASE-CURRENCY.
072600000000           MOVE LOW-VALUES   TO CURRENCY-DDS OF CURRENCY-CODE.
072700000000
072800000000           START CURRENCY-CODE
072900000000                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
073000000000                 INVALID KEY
073100000000                 MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
073200000000                 GO TO GBC-EXIT.
073300000000
073400000000       GBC-0010.
073500000000           READ CURRENCY-CODE NEXT RECORD
073600000000                AT END
073700000000                MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
073800000000                GO TO GBC-EXIT.
073900000000
074000000000           IF BASE-CURRENCY  OF CURRENCY-CODE NOT = "Y"
074100000000              GO TO GBC-0010
074200000000           END-IF.
074300000000
074400000000           MOVE CURRENCY-DDS OF CURRENCY-CODE TO UNITRAX-BASE-CURRENCY.
074500000000
074600000000       GBC-EXIT.
074700000000           EXIT.
074800000000      /
074900000000       GET-EXCHANGE-RATE-TYPE.
075000000000
075100000000           MOVE "SEGCALCV" TO PROGRAM-CODE OF PROGRAM-EXCHANGE-RATE.
075200000000           MOVE "DEFAULT"  TO PROGRAM-ACTION OF PROGRAM-EXCHANGE-RATE.
075300000000
075400000000           READ PROGRAM-EXCHANGE-RATE
075500000000                INVALID KEY
075600000000                MOVE "N" TO PROG-EXCHANGE-RATE-TYPE
075700000000                GO TO GERT-EXIT.
075800000000
075900000000           MOVE EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
076000000000             TO PROG-EXCHANGE-RATE-TYPE.
076100000000
076200000000       GERT-EXIT.
076300000000           EXIT.
076400000000      /
076500000000      * RFS24943 - Begin
076600000000       GET-SCREEN-EDITS-ALLOWED.
076700000000            CALL "FXSCEDTALW" USING SCREEN-EDITS-ALLOWED-REC,
076800000000                                    WS-SEA-EDIT-SQLLOG,
076900000000                                    WS-SEA-RETURN-CODE.
077000000000       GSEA-EXIT.
077100000000            EXIT.
077200000000      * RFS24943 - End
077300000000      /
077400000000       GET-CURRENT-RECORD.
077500000000
077600000000           IF PARM-END-DATE >= WS-AS-AT-DATE
077700000000              GO TO GCR-0010
077800000000           END-IF.
077900000000
078000000000R14616     MOVE "N" TO WS-RESET-FOUND.
078100000000           PERFORM CHECK-ANY-CONTRACT-RESETS THRU CACR-EXIT.
078200000000
078300000000       GCR-0010.
078400000000           PERFORM ESTABLISH-GUAR-DEATH-VALUE THRU EGDV-EXIT.
078500000000
078600000000       GCR-EXIT.
078700000000           EXIT.
078800000000      /
078900000000       CHECK-ANY-CONTRACT-RESETS.
079000000000
079100000000           MOVE CURR-ACCOUNT-NO
079200000000             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-RESET-D.
079300000000           MOVE CURR-CONTRACT-NO
079400000000             TO CONTRACT-NO OF ACCOUNT-CONTRACT-RESET-D.
079500000000           MOVE 99
079600000000             TO RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D.
079700000000
079800000000           START ACCOUNT-CONTRACT-RESET-D
079900000000                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
080000000000                 INVALID KEY
080100000000                 GO TO CACR-EXIT.
080200000000
080300000000       CACR-0010.
08040011081796543 *** Changed NEXT TO PRIOR since oder in Primary key is now Asc
080500110817  |   *    READ ACCOUNT-CONTRACT-RESET-D NEXT RECORD
08060011081796543      READ ACCOUNT-CONTRACT-RESET-D PRIOR RECORD
080700000000                AT END
080800000000                GO TO CACR-EXIT.
080900000000
081000000000           IF CURR-ACCOUNT-NO NOT =
081100000000              ACCOUNT-NO OF ACCOUNT-CONTRACT-RESET-D OR
081200000000              CURR-CONTRACT-NO NOT =
081300000000              CONTRACT-NO OF ACCOUNT-CONTRACT-RESET-D
081400000000              GO TO CACR-EXIT
081500000000           END-IF.
081600000000
08170009060257388      IF RESET-TYPE     OF ACCOUNT-CONTRACT-RESET-D NOT = "GDV"
08180009060257388 *    IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET-D NOT = "A"
081900000000R25686*    IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET-D = "A"
082000000000R25686        GO TO CACR-0010
082100000000R25686     END-IF.
082200000000
082300000000           IF REVERSED-DDS OF ACCOUNT-CONTRACT-RESET-D = "Y" AND
082400000000              REVERSE-PROCESSED-DATE OF ACCOUNT-CONTRACT-RESET-D <=
082500000000              PARM-END-DATE
082600000000              GO TO CACR-0010
082700000000           END-IF.
082800000000
082900000000R14616*    MOVE "Y" TO WS-RESET-FOUND.
083000000000
083100000000           IF EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D =
083200000000              PARM-END-DATE
083300000000              MOVE "Y" TO WS-RESET-EQ-END-DATE
083400000000              MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D
083500000000                TO WS-CONTRACT-EFF-DATE-EQ
083600000000              MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
083700000000                TO WS-CURR-RESET-NUMBER-EQ
083800000000R14616        MOVE "Y" TO WS-RESET-FOUND
083900000000              GO TO CACR-EXIT
084000000000           END-IF.
084100000000
084200000000           IF EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D >
084300000000              PARM-END-DATE
084400000000              MOVE "Y" TO WS-RESET-GT-END-DATE
084500000000              MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D
084600000000                TO WS-AS-OF-THIS-DATE
084700000000              MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
084800000000                TO WS-CURR-RESET-NUMBER-GT
084900000000R14616        MOVE "Y" TO WS-RESET-FOUND
085000000000              GO TO CACR-0010
085100000000           END-IF.
085200000000
085300180604177420     IF EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D <
085400180604177420        PARM-END-DATE         AND
085500180611177420        RESET-PROCESSED-DATE OF ACCOUNT-CONTRACT-RESET-D >=
085600180604177420        PARM-END-DATE
085700180604177420        MOVE "Y" TO WS-RESET-LT-END-DATE
085800180611177420        MOVE RESET-PROCESSED-DATE OF ACCOUNT-CONTRACT-RESET-D
085900180604177420          TO WS-AS-OF-THIS-DATE
086000180604177420        MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
086100180604177420          TO WS-CURR-RESET-NUMBER-GT
086200180604177420        MOVE "Y" TO WS-RESET-FOUND
086300180604177420        GO TO CACR-0010
086400180604177420     END-IF.
086500180604
086600000000       CACR-EXIT.
086700000000           EXIT.
086800000000      /
086900000000       ESTABLISH-GUAR-DEATH-VALUE.
087000000000
087100000000           IF NO-RESET-FOUND
087200000000              GO TO EGDV-0010
087300000000           END-IF.
087400000000
087500000000           IF RESET-EQ-END-DATE
087600000000              MOVE WS-CURR-RESET-NUMBER-EQ TO CURR-RESET-NUMBER
087700000000           ELSE
087800180604177420*       IF RESET-GT-END-DATE
087900180604177420        IF RESET-GT-END-DATE OR RESET-LT-END-DATE
088000000000                 MOVE WS-CURR-RESET-NUMBER-GT TO CURR-RESET-NUMBER
088100000000              END-IF
088200000000           END-IF.
088300000000
088400000000           PERFORM GET-CONTRACT-RESET-GDV THRU GCRG-EXIT.
088500000000
088600000000           GO TO EGDV-EXIT.
088700000000
088800000000       EGDV-0010.
088900000000      * RFS24943 - Begin
089000000000           MOVE 0       TO WS-ARRAY-ELEMENTS
089100000000      * RFS24943 - End
089200000000           MOVE "Y" TO WS-FIRST-CONTRACT-INV-FLAG.
089300000000           SET ACIIDX TO 1.
089400000000
089500000000           MOVE PARM-ACCOUNT-NO
089600000000             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
089700000000           MOVE PARM-CONTRACT-NO
089800000000             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
089900000000           MOVE SPACES
090000000000             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
090100000000
090200000000           START ACCOUNT-CONTRACT-INVESTMENT
090300000000                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
090400000000                 INVALID KEY
090500000000                 MOVE HIGH-VALUES TO CURR-CONTROLS
090600000000                 GO TO EGDV-EXIT.
090700000000
090800000000       EGDV-0020.
090900000000           READ ACCOUNT-CONTRACT-INVESTMENT NEXT RECORD
091000000000                AT END
091100000000                GO TO EGDV-EXIT.
091200000000
091300000000           IF PARM-ACCOUNT-NO NOT =
091400000000              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT OR
091500000000              PARM-CONTRACT-NO NOT =
091600000000              CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
091700000000              GO TO EGDV-EXIT
091800000000           END-IF.
091900000000
092000000000      * RFS24943 - Begin
092001211007      *    RFS1117445 START
092002211007           IF ACIIDX >  ln_InvArraySize
092003211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
092004211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(ACIIDX)
092005211007                      WS-ARRAY-CONTRACT-NO(ACIIDX)
092006211007                      WS-ARRAY-INVESTMENT-CODE(ACIIDX)
092007211007                      WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
092008211007                      WS-ARRAY-NET-DEP-VALUE(ACIIDX)
092009211007                      WS-ARRAY-CURR-NET-DEP-VALUE(ACIIDX)
092010211007                      WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
092011211007                      WS-ARRAY-CURR-GUAR-DEATH-VALUE(ACIIDX)
092012211007           END-IF
092013211007      *    RFS1117445 End
092100000000           ADD 1        TO WS-ARRAY-ELEMENTS
092200000000      * RFS24943 - End
092300000000           MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
092400000000             TO WS-ARRAY-ACCOUNT-NO OF WS-ACC-CON-INV-ARRAY(ACIIDX).
092500000000           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
092600000000             TO WS-ARRAY-CONTRACT-NO OF WS-ACC-CON-INV-ARRAY(ACIIDX).
092700000000           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
092800000000             TO WS-ARRAY-INVESTMENT-CODE
092900000000                OF WS-ACC-CON-INV-ARRAY(ACIIDX).
093000000000           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
093100000000             TO WS-ARRAY-CURR-UNIT-BAL OF WS-ACC-CON-INV-ARRAY(ACIIDX).
093200000000           MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
093300000000             TO WS-ARRAY-NET-DEP-VALUE OF WS-ACC-CON-INV-ARRAY(ACIIDX)
093400000000      * RFS24943 - Begin
093500000000                WS-ARRAY-CURR-NET-DEP-VALUE   (ACIIDX)
093600000000      * RFS24943 - End
093700000000           MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
093800000000             TO WS-ARRAY-GUAR-DEATH-VALUE
093900000000                OF WS-ACC-CON-INV-ARRAY(ACIIDX)
094000000000      * RFS24943 - Begin
094100000000                WS-ARRAY-CURR-GUAR-DEATH-VALUE (ACIIDX)
094200000000      * RFS24943 - End
094300000000
094400000000           IF FIRST-CONTRACT-INV
094500000000              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
094600000000                TO WS-CALC-INVESTMENT-CODE
094700000000              PERFORM GET-INVESTMENT-CALC-METHOD THRU GICM-EXIT
094800000000              MOVE "N" TO WS-FIRST-CONTRACT-INV-FLAG
094900000000           END-IF.
095000000000
095100000000           SET ACIIDX UP BY 1.
095200000000
095300000000           GO TO EGDV-0020.
095400000000
095500000000       EGDV-EXIT.
095600000000           EXIT.
095700000000      /
095800000000       GET-CONTRACT-RESET-GDV.
095900000000           MOVE "Y" TO WS-FIRST-CONTRACT-INV-FLAG.
096000000000
096100000000           SET ACIIDX TO 1.
096200000000           MOVE CURR-ACCOUNT-NO
096300000000             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET.
096400000000           MOVE CURR-CONTRACT-NO
096500000000             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET.
096600000000           MOVE CURR-RESET-NUMBER
096700000000             TO RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET.
096800000000           MOVE SPACES
096900000000             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET.
097000000000
097100000000           START ACCOUNT-CONTRACT-INV-RESET
097200000000                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
097300000000                 INVALID KEY
097400000000                 MOVE HIGH-VALUES TO CURR-CONTROLS
097500000000                 GO TO GCRG-EXIT.
097600000000
097700000000       GCRG-0010.
097800000000
097900000000           READ ACCOUNT-CONTRACT-INV-RESET NEXT RECORD
098000000000                AT END
098100000000                GO TO GCRG-EXIT.
098200000000
098300000000           IF CURR-ACCOUNT-NO NOT =
098400000000              ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET OR
098500000000              CURR-CONTRACT-NO NOT =
098600000000              CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET OR
098700000000              CURR-RESET-NUMBER NOT =
098800000000              RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
098900000000              GO TO GCRG-EXIT
099000000000           END-IF.
099100000000
099200000000      *    IF REVERSED-DDS OF ACCOUNT-CONTRACT-INV-RESET = "Y"
099300000000      *       GO TO GCRG-0010
099400000000      *    END-IF.
099500000000
099600000000           IF FIRST-CONTRACT-INV
099700000000              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
099800000000                TO WS-CALC-INVESTMENT-CODE
099900000000              PERFORM GET-INVESTMENT-CALC-METHOD THRU GICM-EXIT
100000000000              MOVE "N" TO WS-FIRST-CONTRACT-INV-FLAG
100100000000           END-IF.
100200000000
100201211007      *    RFS1117445 End
100202211007           IF ACIIDX >  ln_InvArraySize
100203211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
100204211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(ACIIDX)
100205211007                      WS-ARRAY-CONTRACT-NO(ACIIDX)
100206211007                      WS-ARRAY-INVESTMENT-CODE(ACIIDX)
100207211007                      WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
100208211007                      WS-ARRAY-NET-DEP-VALUE(ACIIDX)
100209211007                      WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
100210211007           END-IF
100211211007      *    RFS1117445 End
100300000000           MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET
100400000000             TO WS-ARRAY-ACCOUNT-NO OF WS-ACC-CON-INV-ARRAY(ACIIDX).
100500000000           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET
100600000000             TO WS-ARRAY-CONTRACT-NO OF WS-ACC-CON-INV-ARRAY(ACIIDX).
100700000000           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
100800000000             TO WS-ARRAY-INVESTMENT-CODE
100900000000                OF WS-ACC-CON-INV-ARRAY(ACIIDX).
101000000000
101100000000           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INV-RESET
101200000000             TO WS-ARRAY-CURR-UNIT-BAL OF WS-ACC-CON-INV-ARRAY(ACIIDX).
101300000000
101400000000           IF RESET-EQ-END-DATE
101500000000              MOVE NEW-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
101600000000                TO WS-ARRAY-NET-DEP-VALUE
101700000000                   OF WS-ACC-CON-INV-ARRAY(ACIIDX)
10180000000037906              WS-ARRAY-GUAR-DEATH-VALUE
10190000000037906              OF WS-ACC-CON-INV-ARRAY(ACIIDX)
102000000000              GO TO GCRG-0020
102100000000           ELSE
102200180604177420*       IF RESET-GT-END-DATE
102300180604177420        IF RESET-GT-END-DATE OR RESET-LT-END-DATE
102400000000                 MOVE OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
102500000000                   TO WS-ARRAY-NET-DEP-VALUE
102600000000                      OF WS-ACC-CON-INV-ARRAY(ACIIDX)
10270000000037906                 WS-ARRAY-GUAR-DEATH-VALUE
10280000000037906                 OF WS-ACC-CON-INV-ARRAY(ACIIDX)
102900000000              END-IF
103000000000           END-IF.
103100000000
103200000000       GCRG-0020.
103300000000           SET ACIIDX UP BY 1.
103400000000
103500000000           GO TO GCRG-0010.
103600000000
103700000000       GCRG-EXIT.
103800000000           EXIT.
103900000000      /
104000000000       DETAIL-PROCESSING.
104100000000
104200000000           IF PARM-END-DATE >= WS-AS-AT-DATE
104300000000              GO TO DPR-0010
104400000000           END-IF.
104500000000
104600000000           MOVE "N" TO WS-SQL-FILE-OPEN-BCK.
104700000000
104800000000           IF RESET-EQ-END-DATE
104900000000              GO TO DPR-0010
105000000000           END-IF.
105100000000
105200000000           IF PROPORTIONAL-CALC-METHOD
105300000000              PERFORM RECALC-TRADES-BACKWARDS THRU RTB-EXIT
105400000000           ELSE
105500000000              PERFORM RECALC-TRADES-BACKWARDS-STD THRU RTBS-EXIT
105600000000           END-IF.
105700000000
105800000000       DPR-0010.
105900000000
106000000000      * RFS24943 - Begin
106100000000                SET WS-TOT-UNIT-NO  TO TRUE
106200000000                SET WS-TOT-GDV-NO   TO TRUE
106300000000      * Calculate the total units and total GDV to update the Guar Base
106400000000      * Value of the array if the screen edit code DMCCON and attribute
106500000000      * code PRE99 do exist.
106600000000      * The revised direct method only applies to transactions which
106700000000      * are not defined in the exclude transaction table.
106800000000
106900000000           SET SW-REVISED-METHOD-NOT-USED    TO TRUE
107000000000           IF WS-DMCCON-EDIT-YES    AND
107100000000              WS-PRE-1999  = LT-Y
107200000000                SET SW-REVISED-METHOD-USED   TO TRUE
107300000000                SET WS-TOT-UNIT-YES          TO TRUE
107400000000                SET WS-TOT-GDV-YES           TO TRUE
107500000000      * Calculate total units and total GDV.
107600000000                MOVE 0                       TO WS-TOT-UNIT
107700000000                                                WS-TOT-GDV
107800000000                                                WS-TOT-NDV
107900000000                PERFORM CALC-TOTAL-UNIT-TOTAL-GDV THRU CTUTG-EXIT
108000000000      * Calculate GDV, NDV as per new Revised Direct Method
108100000000                PERFORM CALC-GDV-NDV-REVISED-METHOD
108200000000           END-IF.
108300000000      * RFS24943 - End
108400000000
108500000000           PERFORM LOAD-FINAL-PARMS-ARRAY THRU LFPA-EXIT.
108600000000
108700000000       DPR-EXIT.
108800000000           EXIT.
108900000000
109000000000      * RFS24943 - Begin
109100000000      * This routine will read through the array to calculate the
109200000000      * total units and total GDV.
109300000000       CALC-TOTAL-UNIT-TOTAL-GDV.
109400000000
109500000000             SET ACIIDX2 TO 1.
109600000000             SET ACIIDX2 DOWN BY 1.
109700000000
109800000000       CTUTG-NEXT.
109900000000
110000210928           SET ACIIDX2 UP BY 1.
110001211007111744     IF ACIIDX2 > WS-ARRAY-ELEMENTS
110002211007111744        GO TO CTUTG-EXIT
110003211007111744     END-IF
110004211007
110100000000           IF WS-ARRAY-ACCOUNT-NO(ACIIDX2) = 0 OR
110200000000              WS-ARRAY-CONTRACT-NO(ACIIDX2) = 0 OR
110201211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX2) = " " OR
110202211007111744        ACIIDX2 > WS-ARRAY-ELEMENTS
110400000000              GO TO CTUTG-EXIT
110500210819           END-IF.
110600000000
110700000000           IF WS-ARRAY-CURR-UNIT-BAL(ACIIDX2) = 0 AND
110800000000              WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX2) = 0
110900000000              GO TO CTUTG-NEXT
111000000000           END-IF.
111100000000
111200000000           IF WS-TOT-UNIT-YES
111300000000              ADD WS-ARRAY-CURR-UNIT-BAL(ACIIDX2) TO WS-TOT-UNIT
111400000000           END-IF.
111500000000
111600000000           IF WS-TOT-GDV-YES
111700000000              ADD WS-ARRAY-CURR-GUAR-DEATH-VALUE(ACIIDX2) TO WS-TOT-GDV
111800000000              ADD WS-ARRAY-CURR-NET-DEP-VALUE  (ACIIDX2) TO WS-TOT-NDV
111900000000           END-IF.
112000000000
112100000000           GO TO CTUTG-NEXT.
112200000000
112300000000       CTUTG-EXIT.
112400000000           EXIT.
112500000000      * ---------------------------------
112600000000       CALC-GDV-NDV-REVISED-METHOD.
112700000000      * ---------------------------------
112800000000      * Calculate GDV, NDV using revised method calculation
112900000000           INITIALIZE WS-CALC-TOT-GDV
113000000000                      WS-CALC-TOT-NDV
113100000000
113200000000      * Apply GDV, NDV change to totals GDV, NDV
113300000000           COMPUTE WS-TOT-GDV = WS-TOT-GDV  + WS-TOT-GDV-CHANGE
113400000000           COMPUTE WS-TOT-NDV = WS-TOT-NDV  + WS-TOT-NDV-CHANGE
113500000000
113600000000           PERFORM VARYING ACIIDX FROM 1 BY 1 UNTIL
113700000000                           ACIIDX > WS-ARRAY-ELEMENTS
113800000000             MOVE WS-ARRAY-CURR-UNIT-BAL (ACIIDX) TO WS-CURR-UNIT-BAL
113900000000
114000000000      * GDV calculation
114100000000             IF WS-TOT-GDV <= 0
114200000000               MOVE 0      TO WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
114300000000             ELSE
114400000000               COMPUTE WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX) ROUNDED =
114500000000                 WS-CURR-UNIT-BAL * WS-TOT-GDV / WS-TOT-UNIT
114600000000             END-IF
114700000000             COMPUTE WS-CALC-TOT-GDV =
114800000000               WS-CALC-TOT-GDV + WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
114900000000
115000000000      * NDV calculation
115100000000             IF WS-TOT-NDV <= 0
115200000000               MOVE 0      TO WS-ARRAY-NET-DEP-VALUE  (ACIIDX)
115300000000             ELSE
115400000000               COMPUTE WS-ARRAY-NET-DEP-VALUE  (ACIIDX) ROUNDED =
115500000000                 WS-CURR-UNIT-BAL * WS-TOT-NDV / WS-TOT-UNIT
115600000000             END-IF
115700000000             COMPUTE WS-CALC-TOT-NDV =
115800000000               WS-CALC-TOT-NDV + WS-ARRAY-NET-DEP-VALUE  (ACIIDX)
115900000000           END-PERFORM.
116000000000
116100000000      * Compute reconciliation amount and apply to the first
116200000000      * element with units.
116300000000           IF WS-ARRAY-ELEMENTS > 0
116400000000             PERFORM RECONCILE-TOT-GDV-NDV
116500000000           END-IF.
116600000000      * ---------------------------------
116700000000       RECONCILE-TOT-GDV-NDV.
116800000000      * ---------------------------------
116900000000           COMPUTE WS-DELTA-TOT-GDV = WS-TOT-GDV - WS-CALC-TOT-GDV
117000000000           COMPUTE WS-DELTA-TOT-NDV = WS-TOT-NDV - WS-CALC-TOT-NDV
117100000000
117200000000           IF WS-DELTA-TOT-GDV NOT = 0.0    OR
117300000000              WS-DELTA-TOT-NDV NOT = 0.0
117400000000             SET SW-ARRAY-START             TO TRUE
117500000000             PERFORM VARYING ACIIDX FROM 1 BY 1 UNTIL
117600000000                             ACIIDX > WS-ARRAY-ELEMENTS  OR
117700000000                             SW-ARRAY-END
117800000000               IF WS-ARRAY-CURR-UNIT-BAL   (ACIIDX) > 0.0
117900000000                 ADD WS-DELTA-TOT-GDV TO
118000000000                              WS-ARRAY-GUAR-DEATH-VALUE (ACIIDX)
118100000000                 ADD WS-DELTA-TOT-NDV TO
118200000000                              WS-ARRAY-NET-DEP-VALUE   (ACIIDX)
118300000000                 MOVE 0               TO WS-DELTA-TOT-GDV
118400000000                                         WS-DELTA-TOT-NDV
118500000000                 SET SW-ARRAY-END     TO TRUE
118600000000               END-IF
118700000000             END-PERFORM
118800000000      * If something left then reconcile the First Element
118900000000             IF WS-DELTA-TOT-GDV NOT = 0.0    OR
119000000000                WS-DELTA-TOT-NDV NOT = 0.0
119100000000               ADD WS-DELTA-TOT-GDV TO WS-ARRAY-GUAR-DEATH-VALUE (1)
119200000000               ADD WS-DELTA-TOT-NDV TO WS-ARRAY-NET-DEP-VALUE   (1)
119300000000             END-IF
119400000000           END-IF.
119500000000      * RFS24943 - End
119600000000      /
119700000000       RECALC-TRADES-BACKWARDS.
119800000000
119900000000      * RFS27951 - Begin
120000000000           MOVE PARM-END-DATE        TO WS-TEMP-END-DATE
120100000000           MOVE WS-AS-OF-THIS-DATE   TO WS-TEMP-AS-OF-THIS-DATE
120200000000      * RFS27951 - End
120300000000
120400000000           EXEC SQL
120500000000                WHENEVER SQLERROR GOTO SQLERRDISPLAY
120600000000           END-EXEC.
120700000000
120800000000           EXEC SQL
120900000000           DECLARE SEGSQLBCK CURSOR FOR SELECT
121000000000           A.PROCESS_DATE, A.PROC_SEQ_NO,
121100000000           A.PLACEMENT_DATE, A.TRANS_NO,
121200000000           B.CONTRACT_NO
121300000000           FROM MFATRDPSP A
121400000000                INNER JOIN MFATRCODP B ON
121500000000                   A.PLACEMENT_DATE = B.PLACEMENT_DATE AND
121600000000                   A.TRANS_NO = B.TRANS_NO
121700000000           WHERE
121800000000           B.CONTRACT_NO = :PARM-CONTRACT-NO AND
121900000000      * RFS27951 - Begin: Replace with temp vars with appropriate
122000000000      * definitioons.
122100000000      *    A.PROCESS_DATE > :PARM-END-DATE AND
122200000000      *    A.PROCESS_DATE <= :WS-AS-OF-THIS-DATE
122300000000
122400000000           A.PROCESS_DATE >  :WS-TEMP-END-DATE      AND
122500000000           A.PROCESS_DATE <= :WS-TEMP-AS-OF-THIS-DATE
122600000000      * RFS27951 - End
122700000000           ORDER BY A.PROCESS_DATE DESC, A.PROC_SEQ_NO DESC
122800000000           FOR READ ONLY
122900000000           END-EXEC.
123000000000
123100000000           EXEC SQL
123200000000                OPEN SEGSQLBCK
123300000000           END-EXEC.
123400000000
123500000000           MOVE "Y" TO WS-SQL-FILE-OPEN-BCK.
123600000000
123700000000       RTB-0010.
123800000000
123900000000           EXEC SQL
124000000000                WHENEVER NOT FOUND GOTO RTB-EXIT
124100000000           END-EXEC.
124200000000
124300000000           EXEC SQL
124400000000                FETCH NEXT FROM SEGSQLBCK
124500000000                INTO :WS-SQL-PROCESS-DATE, :WS-SQL-PROC-SEQ-NO,
124600000000                     :WS-SQL-PLACEMENT-DATE, :WS-SQL-TRANS-NO,
124700000000                     :WS-SQL-CONTRACT-NO
124800000000           END-EXEC.
124900000000
125000000000           EXEC SQL
125100000000                WHENEVER SQLERROR GOTO SQLERRDISPLAY
125200000000           END-EXEC.
125300000000
125400000000           MOVE "N" TO WS-READ-NEXT-TRANS.
125500000000           PERFORM RECALC-GDV-4ALL-TRADES THRU RG4T-EXIT.
125600000000           IF READ-NEXT-TRANS
125700000000              GO TO RTB-0010
125800000000           END-IF.
125900000000
126000000000           GO TO RTB-0010.
126100000000
126200000000       RTB-EXIT.
126300000000           EXIT.
126400000000      /
126500000000       RECALC-GDV-4ALL-TRADES.
126600000000
126700000000           MOVE WS-SQL-PLACEMENT-DATE TO PLACEMENT-DATE OF TRANS.
126800000000           MOVE WS-SQL-TRANS-NO TO TRANS-NO OF TRANS.
126900000000
127000000000           READ TRANS
127100000000                INVALID KEY
127200000000                MOVE "Y" TO WS-READ-NEXT-TRANS
127300000000                GO TO RG4T-EXIT
127400000000           END-READ.
127500000000
127600000000      * RFS19566 Start
127700000000           IF TRANS-TYPE-CODE OF TRANS   = "TRO" AND
127800000000              TRANS-ORIGIN-CODE OF TRANS = "RST"
127900000000                MOVE "Y" TO WS-READ-NEXT-TRANS
128000000000                GO TO RG4T-EXIT
128100000000           END-IF.
128200000000      * RFS19566 End
128300000000
128400000000           MOVE TRANS-TYPE-CODE OF TRANS TO TRANS-TYPE-CATEGORY.
128500000000           MOVE TRANS-STATUS-CODE OF TRANS TO TRANS-STATUS-CATEGORY.
128600000000           MOVE REVERSE OF TRANS TO TRANS-REVERSE-CATEGORY.
128700000000
128800000000           IF PROCESS-DATE OF TRANS > WS-AS-AT-DATE OR
128900000000              PROCESS-DATE OF TRANS < PARM-END-DATE
129000000000              MOVE "Y" TO WS-READ-NEXT-TRANS
129100000000              GO TO RG4T-EXIT
129200000000           END-IF.
129300000000
129400161102      * RFS 159011 - Starts
129500161102           INITIALIZE lc_DistribCategories
129600161102           IF DISTRIBUTION-TRANSACTION
129700161102              MOVE PLACEMENT-DATE  OF TRANS
129800161102                              TO ln_PlacementDate
129900161102
130000161102              MOVE TRANS-NO        OF TRANS
130100161102                              TO ln_TransNo
130200161102
130300161102              PERFORM FETCH-DISTRIBUTION-TYPE
130400161102           END-IF
130500161102      * RFS 159011 - Ends
130600161102
130700000000           IF (TRANS-REVERSED AND NOT STATUS-RVS) OR
130800000000              NOT HISTORY-REVERSE OR
130900161102      * RFS 159011 - Starts
131000161102      *       NOT VALID-TRANSACTION
131100161102             (NOT VALID-TRANSACTION
131200161102              AND NOT DISTRIBUTION-TRANSACTION)
131300161102              OR  (DISTRIBUTION-TRANSACTION
131400161102              AND lc_DistrOptionCode NOT EQUAL TO 'C')
131500161102      * RFS 159011 - Ends
131600000000              MOVE "Y" TO WS-READ-NEXT-TRANS
131700000000              GO TO RG4T-EXIT
131800000000           END-IF.
131900000000
132000000000           IF TRANS-REVERSED AND STATUS-RVS
132100000000              MOVE PLACEMENT-DATE OF TRANS TO CURR-PLACEMENT-DATE
132200000000              MOVE TRANS-NO OF TRANS TO CURR-TRANS-NO
132300000000              PERFORM GET-TRANS-RVS-OFFSET THRU GTRO-EXIT
132400000000              IF READ-NEXT-TRANS
132500000000                 GO TO RG4T-EXIT
132600000000              END-IF
132700000000           END-IF.
132800000000
132900000000           MOVE "N" TO EXCLUDE-TRANS-FLAG.
133000131212
133100131212
133200131212
133300210111180708     INITIALIZE WS-PLACEMENTDATE WS-TRANSNO.
133400210111180708     MOVE PLACEMENT-DATE OF TRANS  TO WS-PLACEMENTDATE.
133500210111180708     MOVE TRANS-NO OF TRANS        TO WS-TRANSNO.
133600000000           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
13370000000026151**    IF EXCLUDE-TRANS-FLAG = "Y"
13380000000026151**       MOVE "Y" TO WS-READ-NEXT-TRANS
13390000000026151**       GO TO RG4T-EXIT
13400000000026151**    END-IF.
134100000000
134200161102      * RFS 159011 - Starts
134300161103           IF lc_DistrOptionCode = lc_C
134400161102           AND EXCLUDE-TRANS-FLAG = "Y"
134500161102              MOVE "Y" TO WS-READ-NEXT-TRANS
134600161102              GO TO RG4T-EXIT
134700161102           END-IF.
134800161102      * RFS 159011 - Ends
134900161102
135000000000           MOVE PLACEMENT-DATE OF TRANS
135100000000             TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS.
135200000000           MOVE TRANS-NO OF TRANS
135300000000             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
135400000000           MOVE WS-SQL-CONTRACT-NO
135500000000             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
135600000000
135700000000           READ TRANS-CONTRACT-DETAILS
135800000000                INVALID KEY
135900000000                MOVE "Y" TO WS-READ-NEXT-TRANS
136000000000                GO TO RG4T-EXIT
136100000000           END-READ.
136200000000
136300000000           IF REVERSED-DDS OF TRANS-CONTRACT-DETAILS = "Y" AND
136400000000              NOT STATUS-RVS
136500000000              MOVE "Y" TO WS-READ-NEXT-TRANS
136600000000              GO TO RG4T-EXIT
136700000000           END-IF.
136800000000
136900000000           MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
137000000000             TO WS-ORIG-UNIT-BAL.
137100000000           MOVE INVESTMENT-CODE OF TRANS TO WS-INVEST-CODE
137200000000                                            CURR-INVESTMENT-CODE.
137300000000           MOVE "Y" TO WS-GET-LOAD-STRUCTURE.
137400000000           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
137500000000           INITIALIZE WS-CALCULATION-VARS.
13760000000037906 **
13770000000037906 **  R13394* Get the NDV/GDV from Trans-GDV-Transfer if it exists
13780000000037906 **   MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
13790000000037906 **   INITIALIZE MFATRACXP OF TRANS-GDV-TRANSFER-REC.
13800000000037906 **   IF BUY-TRANSACTION
13810000000037906 **      MOVE PLACEMENT-DATE OF TRANS
13820000000037906 **        TO PLACEMENT-DATE OF TRANS-GDV-TRANSFER
13830000000037906 **      MOVE TRANS-NO OF TRANS
13840000000037906 **        TO TRANS-NO OF TRANS-GDV-TRANSFER
13850000000037906 **
13860000000037906 **      READ TRANS-GDV-TRANSFER
13870000000037906 **           INVALID KEY
13880000000037906 **           GO TO RG4T-0003
13890000000037906 **      END-READ
13900000000037906 **
13910000000037906 **      MOVE NET-DEPOSIT-VALUE OF TRANS-GDV-TRANSFER
13920000000037906 **        TO WS-NDV-CHANGE
13930000000037906 **      MOVE GUAR-BASE-VALUE OF TRANS-GDV-TRANSFER
13940000000037906 **        TO WS-GDV-CHANGE
13950000000037906 **
13960000000037906 **      GO TO RG4T-0005
13970000000037906 **R13394     END-IF.
139800000000
139900000000       RG4T-0003.
140000000000           IF BUY-TRANSACTION
140100000000              IF FRONT-END AND BUY-TRANSACTION
140200000000                 MOVE NET-AMT OF TRANS TO WS-GDV-CHANGE
140300000000                                          WS-NDV-CHANGE
140400000000              ELSE
140500000000                 MOVE GROSS-AMT OF TRANS TO WS-GDV-CHANGE
140600000000                                            WS-NDV-CHANGE
140700000000              END-IF
140800181024      *RFS1006259 START
140900181024              IF GDV-CHANGE of TRANS-CONTRACT-DETAILS > 0
141000181024                Move GDV-CHANGE of TRANS-CONTRACT-DETAILS to
141100181024                      WS-GDV-CHANGE
141200181024              ELSE IF GBV-CHANGE of TRANS-CONTRACT-DETAILS > 0
141300181024                Move GBV-CHANGE of TRANS-CONTRACT-DETAILS to
141400181024                      WS-GDV-CHANGE
141500181024              END-IF
141600181024      *RFS1006259 END
141700000000           END-IF.
141800000000
141900000000           IF SWITCH-IN-TRANSACTION OR SWITCH-OUT-TRANSACTION
14200000000013306         OR SELL-TRANSACTION
142100161103159011        OR lc_DistrOptionCode = lc_C
14220000000013306 *       MOVE NET-DEPOSIT-VALUE-CUR OF TRANS-CONTRACT-DETAILS
14230000000013306         MOVE NDV-CHANGE            OF TRANS-CONTRACT-DETAILS
142400000000                TO WS-NDV-CHANGE
14250000000013306 *       MOVE GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DETAILS
14260000000013306         MOVE GDV-CHANGE          OF TRANS-CONTRACT-DETAILS
142700000000                TO WS-GDV-CHANGE
142800000000           END-IF.
142900000000
143000000000       RG4T-0005.
14310000000026151      IF MAN-FEE-REB-TRANSACTION AND
14320000000026151         EXCLUDE-TRANS-FLAG NOT = "Y"
14330000000026151         MOVE ZEROS TO WS-NDV-CHANGE
14340000000026151                       WS-GDV-CHANGE
14350000000026151         GO TO RG4T-EXIT
14360000000026151      END-IF.
143700000000
14380000000026151      IF EXCLUDE-TRANS-FLAG = "Y"
14390000000026151         MOVE ZEROS TO WS-NDV-CHANGE
14400000000026151                       WS-GDV-CHANGE
14410000000026151      END-IF.
144200000000
144300000000           IF PURCHASE-TRANSACTION
144400161103159011     OR lc_DistrOptionCode = lc_C
14450000000026151         OR EXCLUDE-TRANS-FLAG = "Y"
144600000000              PERFORM UPDATE-ACC-CON-INV-ARRAY THRU UACIA-EXIT
144700000000              MOVE "Y" TO WS-READ-NEXT-TRANS
144800000000              GO TO RG4T-EXIT
144900000000           END-IF.
145000000000
145100000000           COMPUTE WS-TRANS-TRADE-AMOUNT ROUNDED =
145200000000                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
145300000000                   UNIT-PRICE OF TRANS.
145400000000           MOVE TRADE-DATE OF TRANS TO WS-TRANS-TRADE-DATE.
145500000000           MOVE UNIT-PRICE OF TRANS TO WS-TRANS-UNIT-PRICE.
145600000000           MOVE INVESTMENT-CODE OF TRANS TO WS-TRANS-INVESTMENT-CODE.
145700000000           PERFORM GET-CONTRACT-INV-MARKET-VALUE THRU GCIMV-EXIT.
145800000000
14590000000013306 *    IF SELL-TRANSACTION
14600000000013306 *       IF WS-CONT-MV-BEF-TOTAL NOT = 0
14610000000013306 *          COMPUTE WS-NDV-CHANGE ROUNDED = WS-CONT-NDV-BEF-TOTAL *
14620000000013306 *                  WS-TRANS-TRADE-AMOUNT / WS-CONT-MV-BEF-TOTAL
14630000000013306 *
14640000000013306 *          COMPUTE WS-GDV-CHANGE ROUNDED = WS-CONT-GDV-BEF-TOTAL *
14650000000013306 *                  WS-TRANS-TRADE-AMOUNT / WS-CONT-MV-BEF-TOTAL
14660000000013306 *       ELSE
14670000000013306 *          MOVE WS-TRANS-TRADE-AMOUNT TO WS-NDV-CHANGE
14680000000013306 *                                        WS-GDV-CHANGE
14690000000013306 *       END-IF
14700000000013306 *    END-IF.
147100000000
147200000000           IF STATUS-RVS
147300000000              SUBTRACT WS-NDV-CHANGE FROM WS-CONT-NDV-BEF-TOTAL
147400000000                GIVING WS-CONT-NDV-AFTER
147500000000              SUBTRACT WS-GDV-CHANGE FROM WS-CONT-GDV-BEF-TOTAL
147600000000                GIVING WS-CONT-GDV-AFTER
147700000000           ELSE
147800000000              ADD WS-NDV-CHANGE TO WS-CONT-NDV-BEF-TOTAL
147900000000                  GIVING WS-CONT-NDV-AFTER
148000000000              ADD WS-GDV-CHANGE TO WS-CONT-GDV-BEF-TOTAL
148100000000                  GIVING WS-CONT-GDV-AFTER
148200000000           END-IF.
148300000000
148400000000           PERFORM RECALC-FINAL-CONTRACT-GDV THRU RFCG-EXIT.
148500000000
148600000000           MOVE "N" TO WS-NDV-DIFF-FLAG WS-GDV-DIFF-FLAG.
148700000000           MOVE 0 TO WS-NDV-DIFF-AMOUNT WS-GDV-DIFF-AMOUNT.
148800000000
148900000000           IF SELL-TRANSACTION
149000000000              GO TO RG4T-EXIT
149100000000           END-IF.
149200000000
149300000000           IF WS-CONT-NDV-AFTER NOT = WS-CONT-NDV-AFT-TOTAL
149400000000              MOVE "Y" TO WS-NDV-DIFF-FLAG
149500000000              SUBTRACT WS-CONT-NDV-AFT-TOTAL FROM WS-CONT-NDV-AFTER
149600000000                GIVING WS-NDV-DIFF-AMOUNT
149700000000           END-IF.
149800000000
149900000000           IF WS-CONT-GDV-AFTER NOT = WS-CONT-GDV-AFT-TOTAL
150000000000              MOVE "Y" TO WS-GDV-DIFF-FLAG
150100000000              SUBTRACT WS-CONT-GDV-AFT-TOTAL FROM WS-CONT-GDV-AFTER
150200000000                GIVING WS-GDV-DIFF-AMOUNT
150300000000           END-IF.
150400000000
150500000000           IF NDV-DIFFERENCE-FOUND OR GDV-DIFFERENCE-FOUND
150600000000              GO TO RG4T-0010
150700000000           END-IF.
150800000000
150900000000           GO TO RG4T-EXIT.
151000000000
151100000000       RG4T-0010.
151200000000           SET ACIIDX TO 1.
151300000000           SET ACIIDX DOWN BY 1.
151400000000
151500000000       RG4T-NEXT.
151600210928           SET ACIIDX UP BY 1.
151601211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
151602211007111744        GO TO RG4T-EXIT
151603211007111744     END-IF
151604211007
151700000000           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
151800000000              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
151801211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "  OR
151802211007111744        ACIIDX2 > WS-ARRAY-ELEMENTS
152000000000              GO TO RG4T-EXIT
152100210819           END-IF.
152200000000
152300000000           IF WS-ARRAY-NET-DEP-VALUE(ACIIDX) = 0 OR
152400000000              WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX) = 0
152500000000              GO TO RG4T-NEXT
152600000000           END-IF.
152700000000
152800000000           IF NDV-DIFFERENCE-FOUND
152900000000              ADD WS-NDV-DIFF-AMOUNT TO WS-ARRAY-NET-DEP-VALUE(ACIIDX)
153000000000           END-IF.
153100000000
153200000000           IF GDV-DIFFERENCE-FOUND
153300000000              ADD WS-GDV-DIFF-AMOUNT
153400000000               TO WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
153500000000           END-IF.
153600000000
153700000000       RG4T-EXIT.
153800000000           EXIT.
153900000000      /
154000000000       GET-TRANS-RVS-OFFSET.
154100000000
154200000000           INITIALIZE MFATRNTGP OF TRANS-TARGET-REC.
154300000000           MOVE CURR-PLACEMENT-DATE
154400000000             TO PLACEMENT-DATE-2 OF TRANS-TARGET.
154500000000           MOVE CURR-TRANS-NO
154600000000             TO TRANS-NO-2 OF TRANS-TARGET.
154700000000           MOVE ZEROES
154800000000             TO PLACEMENT-DATE OF TRANS-TARGET
154900000000                TRANS-NO OF TRANS-TARGET.
155000000000
155100000000           START TRANS-TARGET
155200000000                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
155300000000                 INVALID KEY
155400000000                 MOVE "Y" TO WS-READ-NEXT-TRANS
155500000000                 GO TO GTRO-EXIT.
155600000000
155700000000       GTRO-0010.
155800000000           READ TRANS-TARGET NEXT RECORD
155900000000                AT END
156000000000                MOVE "Y" TO WS-READ-NEXT-TRANS
156100000000                GO TO GTRO-EXIT.
156200000000
156300000000           IF CURR-PLACEMENT-DATE NOT =
156400000000              PLACEMENT-DATE-2 OF TRANS-TARGET OR
156500000000              CURR-TRANS-NO NOT =
156600000000              TRANS-NO-2 OF TRANS-TARGET
156700000000              MOVE "Y" TO WS-READ-NEXT-TRANS
156800000000              GO TO GTRO-EXIT
156900000000           END-IF.
157000000000
157100000000           IF RELATIONSHIP-TYPE OF TRANS-TARGET NOT = "RVS"
157200000000              GO TO GTRO-0010
157300000000           END-IF.
157400000000
157500000000           INITIALIZE MFATRNP OF TRANS-RVS.
157600000000           MOVE PLACEMENT-DATE OF TRANS-TARGET
157700000000             TO PLACEMENT-DATE OF TRANS-RVS.
157800000000           MOVE TRANS-NO OF TRANS-TARGET
157900000000             TO TRANS-NO OF TRANS-RVS.
158000000000
158100000000           READ TRANS-RVS
158200000000                INVALID KEY
158300000000                MOVE "Y" TO WS-READ-NEXT-TRANS
158400000000                GO TO GTRO-EXIT
158500000000           END-READ.
158600000000
158700000000           IF PROCESS-DATE OF TRANS-RVS > PARM-END-DATE
158800000000              MOVE "Y" TO WS-READ-NEXT-TRANS
158900000000              GO TO GTRO-EXIT
159000000000           END-IF.
159100000000
159200000000           MOVE "N" TO WS-READ-NEXT-TRANS.
159300000000
159400000000       GTRO-EXIT.
159500000000           EXIT.
159600000000      /
159700000000       UPDATE-ACC-CON-INV-ARRAY.
159800000000
159900000000           SET ACIIDX TO 1.
160000000000
160100000000           SEARCH WS-ACC-CON-INV-ARRAY VARYING ACIIDX
160200000000             WHEN WS-ARRAY-ACCOUNT-NO(ACIIDX) = CURR-ACCOUNT-NO AND
160300000000                  WS-ARRAY-CONTRACT-NO(ACIIDX) = CURR-CONTRACT-NO AND
160400000000                  WS-ARRAY-INVESTMENT-CODE(ACIIDX)=CURR-INVESTMENT-CODE
160500000000                  GO TO UACIA-0010
160600000000             WHEN WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
160700000000                  WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
160800000000                  WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "
160900000000                  GO TO UACIA-EXIT
161000000000           END-SEARCH.
161100000000
161200000000       UACIA-0010.
161300000000
161400000000           IF STATUS-RVS
161500161103159011     OR lc_DistrOptionCode = lc_C
161600000000              GO TO UACIA-0020
161700000000           END-IF.
161800000000
161900000000           MOVE "N" TO WS-UNITS-ZERO-BALANCE
162000000000                       WS-PRFRM-NDV-BALANCE  WS-PRFRM-GDV-BALANCE.
162100000000
16220000000026151      IF EXCLUDE-TRANS-FLAG = "Y"
16230000000026151         AND REDEMPTION-TRANSACTION
16240000000026151         ADD WS-ORIG-UNIT-BAL
16250000000026151          TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
16260000000026151      ELSE
162700000000           SUBTRACT WS-ORIG-UNIT-BAL
162800000000               FROM WS-ARRAY-CURR-UNIT-BAL(ACIIDX).
162900000000           IF WS-ARRAY-CURR-UNIT-BAL(ACIIDX) IS NEGATIVE OR
163000000000              WS-ARRAY-CURR-UNIT-BAL(ACIIDX) = 0
163100000000              MOVE ZEROES TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
163200000000R17274        MOVE "Y" TO WS-UNITS-ZERO-BALANCE
163300000000           END-IF.
163400000000
163500000000           SUBTRACT WS-NDV-CHANGE FROM WS-ARRAY-NET-DEP-VALUE(ACIIDX).
163600000000           MOVE WS-ARRAY-NET-DEP-VALUE(ACIIDX) TO WS-NDV-REMAIN-AMT.
163700000000           IF WS-ARRAY-NET-DEP-VALUE(ACIIDX) IS NEGATIVE
163800000000R17274*       MOVE ZEROES TO WS-ARRAY-NET-DEP-VALUE(ACIIDX)
163900000000R17274        MOVE "Y" TO WS-PRFRM-NDV-BALANCE
164000000000           END-IF.
164100000000
164200000000           SUBTRACT WS-GDV-CHANGE
164300000000               FROM WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)                   .
164400000000           MOVE WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
164500000000             TO WS-GDV-REMAIN-AMT.
164600000000           IF WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX) IS NEGATIVE
164700000000R17274*       MOVE ZEROES TO WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
164800000000R17274        MOVE "Y" TO WS-PRFRM-GDV-BALANCE
164900000000           END-IF.
165000000000
165100000000R17274     IF PRFRM-NDV-BALANCE OR PRFRM-GDV-BALANCE OR
165200000000R17274       (UNITS-ZERO-BALANCE AND
165300000000R17639       (WS-NDV-REMAIN-AMT NOT = 0 OR WS-GDV-REMAIN-AMT NOT = 0))
165400000000R17274        PERFORM BALANCE-NDV-GDV-ARRAY THRU BNGA-EXIT
165500000000R17274     END-IF.
165600000000
165700000000           GO TO UACIA-EXIT.
165800000000
165900000000       UACIA-0020.
166000000000           ADD WS-NDV-CHANGE TO WS-ARRAY-NET-DEP-VALUE(ACIIDX).
166100000000           ADD WS-GDV-CHANGE TO WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX).
166200000000           ADD WS-ORIG-UNIT-BAL TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX).
166300000000
166400000000       UACIA-EXIT.
166500000000           EXIT.
166600000000      /
166700000000*******RFS 17274 - BEGIN
166800000000******* This routine will perform the balancing of NDV and GDV in the
166900000000******* array in case zero units were calculated and there is still
167000000000******* an amount left in the NDV/GDV bucket AND a negative amount
167100000000******* was calculated in the NDV/GDV bucket in the above routine.
167200000000       BALANCE-NDV-GDV-ARRAY.
167300000000
167400000000           SET ACIIDX2 TO 1.
167500000000           SET ACIIDX2 DOWN BY 1.
167600000000
167700000000       BNGA-NEXT.
167800000000
167900000000           SET ACIIDX2 UP BY 1.
167901211007111744     IF ACIIDX2 > WS-ARRAY-ELEMENTS
167902211007111744        GO TO BNGA-EXIT
167903211007111744     END-IF
168000210819
168001211007111744     IF ACIIDX2 > WS-ARRAY-ELEMENTS
168100000000           IF WS-ARRAY-ACCOUNT-NO(ACIIDX2) = 0 OR
168200000000              WS-ARRAY-CONTRACT-NO(ACIIDX2) = 0 OR
168201211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX2) = " " OR
168202211007111744        ACIIDX2 > WS-ARRAY-ELEMENTS
168400000000              GO TO BNGA-EXIT
168500210819           END-IF.
168600000000
168700000000           IF WS-ARRAY-CURR-UNIT-BAL(ACIIDX2) = 0
168800000000              GO TO BNGA-NEXT
168900000000           END-IF.
169000000000
169100000000           MOVE WS-ARRAY-NET-DEP-VALUE(ACIIDX2) TO WS-TEMP-NDV.
169200000000           ADD WS-NDV-REMAIN-AMT TO WS-TEMP-NDV.
169300000000           IF WS-TEMP-NDV IS NEGATIVE
169400000000              GO TO BNGA-NEXT
169500000000           END-IF.
169600000000
169700000000           MOVE WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX2) TO WS-TEMP-GDV.
169800000000           ADD WS-GDV-REMAIN-AMT TO WS-TEMP-GDV.
169900000000           IF WS-TEMP-GDV IS NEGATIVE
170000000000              GO TO BNGA-NEXT
170100000000           END-IF.
170200000000
170300000000           ADD WS-NDV-REMAIN-AMT TO WS-ARRAY-NET-DEP-VALUE(ACIIDX2).
170400000000           ADD WS-GDV-REMAIN-AMT TO WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX2).
170500000000
170600000000           MOVE ZEROES TO WS-ARRAY-NET-DEP-VALUE(ACIIDX)
170700000000                          WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX).
170800000000
170900000000       BNGA-EXIT.
171000000000           EXIT.
171100000000      /
171200000000       GET-CONTRACT-INV-MARKET-VALUE.
171300000000
171400000000           SET ACIIDX TO 1.
171500000000           SET ACIIDX DOWN BY 1.
171600000000
171700000000       GCIMV-NEXT.
171800210928           SET ACIIDX UP BY 1.
171801211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
171802211007111744        GO TO GCIMV-EXIT
171803211007111744     END-IF
171804211007
171900000000           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
172000000000              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
172001211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "  OR
172002211007111744        ACIIDX2 > WS-ARRAY-ELEMENTS
172200000000              GO TO GCIMV-EXIT
172300210819           END-IF.
172400000000
172500000000           MOVE WS-ARRAY-INVESTMENT-CODE(ACIIDX) TO WS-INVEST-CODE.
172600000000           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
172700000000
172800000000           IF WS-ARRAY-INVESTMENT-CODE(ACIIDX) =
172900000000              WS-TRANS-INVESTMENT-CODE
173000000000              MOVE WS-TRANS-UNIT-PRICE TO WS-CONT-INV-UNIT-PRICE
173100000000              GO TO GCIMV-0010
173200000000           ELSE
173300000000              IF WS-ARRAY-CURR-UNIT-BAL(ACIIDX) = 0
173400000000                 MOVE 0 TO WS-CONT-INV-UNIT-PRICE
173500000000                 MOVE 1.0 TO WS-CONT-INV-EXCH-RATE
173600000000                 GO TO GCIMV-0020
173700000000              END-IF
173800000000           END-IF.
173900000000
174000000000           MOVE WS-ARRAY-INVESTMENT-CODE(ACIIDX)
174100000000             TO WS-CONT-INVESTMENT-CODE.
174200000000           PERFORM GET-CONTRACT-INV-UNIT-PRICE THRU GCIUP-EXIT.
174300000000
174400000000       GCIMV-0010.
174500000000
174600000000           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
174700000000              PERFORM GET-CONT-INV-EXCH-RATE THRU GCIER-EXIT
174800000000           ELSE
174900000000              MOVE 1.0 TO WS-CONT-INV-EXCH-RATE
175000000000           END-IF.
175100000000
175200000000       GCIMV-0020.
175300000000           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
175400000000              COMPUTE WS-ARRAY-INV-MV-BEF(ACIIDX) ROUNDED =
175500000000                 WS-ARRAY-CURR-UNIT-BAL(ACIIDX) * WS-CONT-INV-UNIT-PRICE
175600000000           ELSE
175700000000              COMPUTE WS-ARRAY-INV-MV-BEF(ACIIDX) ROUNDED =
175800000000                 WS-ARRAY-CURR-UNIT-BAL(ACIIDX) *
175900000000                 WS-CONT-INV-UNIT-PRICE / WS-CONT-INV-EXCH-RATE
176000000000           END-IF.
176100000000
176200000000           IF WS-ARRAY-INVESTMENT-CODE(ACIIDX) =
176300000000              WS-TRANS-INVESTMENT-CODE
176400000000              IF STATUS-RVS
176500000000                 SUBTRACT ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
176600000000                     FROM WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
176700000000              ELSE
176800000000                 ADD ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
176900000000                     TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
177000000000              END-IF
177100000000
177200000000              IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
177300000000                 COMPUTE WS-TRANS-TRADE-AMOUNT ROUNDED =
177400000000                         WS-TRANS-TRADE-AMOUNT / WS-CONT-INV-EXCH-RATE
177500000000              END-IF
177600000000           END-IF.
177700000000
177800000000           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
177900000000              COMPUTE WS-ARRAY-INV-MV-AFT(ACIIDX) ROUNDED =
178000000000                 WS-ARRAY-CURR-UNIT-BAL(ACIIDX) * WS-CONT-INV-UNIT-PRICE
178100000000           ELSE
178200000000              COMPUTE WS-ARRAY-INV-MV-AFT(ACIIDX) ROUNDED =
178300000000                 WS-ARRAY-CURR-UNIT-BAL(ACIIDX) *
178400000000                 WS-CONT-INV-UNIT-PRICE / WS-CONT-INV-EXCH-RATE
178500000000           END-IF.
178600000000
178700000000           ADD WS-ARRAY-INV-MV-BEF(ACIIDX) TO WS-CONT-MV-BEF-TOTAL.
178800000000           ADD WS-ARRAY-INV-MV-AFT(ACIIDX) TO WS-CONT-MV-AFT-TOTAL.
178900000000           ADD WS-ARRAY-NET-DEP-VALUE(ACIIDX)
179000000000               TO WS-CONT-NDV-BEF-TOTAL.
179100000000           ADD WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
179200000000               TO WS-CONT-GDV-BEF-TOTAL.
179300000000
179400000000           MOVE CURRENCY-DDS OF INVESTMENT
179500000000             TO WS-ARRAY-INV-CURR-CODE(ACIIDX).
179600000000           MOVE WS-CONT-INV-EXCH-RATE
179700000000             TO WS-ARRAY-INV-EXCH-RATE(ACIIDX).
179800000000
179900000000           ADD 1 TO WS-CONT-INV-ARRAY-COUNT.
180000000000
180100000000           GO TO GCIMV-NEXT.
180200000000
180300000000       GCIMV-EXIT.
180400000000           EXIT.
180500000000      /
180600000000       RECALC-FINAL-CONTRACT-GDV.
180700000000
180800000000           INITIALIZE WS-CONT-INV-COUNT
180900000000                      WS-INV-NDV-PERCENT-TOTAL
181000000000                      WS-INV-GDV-PERCENT-TOTAL
181100000000                      WS-CONT-NDV-AFT-TOTAL
181200000000                      WS-CONT-GDV-AFT-TOTAL.
181300000000
181400000000           SET ACIIDX TO 1.
181500000000           SET ACIIDX DOWN BY 1.
181600000000
181700000000       RFCG-NEXT.
181800000000           SET ACIIDX UP BY 1.
181801211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
181802211007111744        GO TO RFCG-EXIT
181803211007111744     END-IF
181900000000
181901211007
182000000000           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
182100000000              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
182101211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "  OR
182102211007111744        ACIIDX > WS-ARRAY-ELEMENTS
182300000000              GO TO RFCG-EXIT
182400210819           END-IF.
182500000000
182600000000           ADD 1 TO WS-CONT-INV-COUNT.
182700000000
182800000000           IF WS-CONT-MV-AFT-TOTAL NOT = 0
182900000000              COMPUTE WS-INV-NDV-PERCENT ROUNDED =
183000000000                      WS-ARRAY-INV-MV-AFT(ACIIDX) / WS-CONT-MV-AFT-TOTAL
183100000000              COMPUTE WS-INV-GDV-PERCENT ROUNDED =
183200000000                      WS-ARRAY-INV-MV-AFT(ACIIDX) / WS-CONT-MV-AFT-TOTAL
183300000000           ELSE
183400000000              MOVE 0 TO WS-INV-NDV-PERCENT
183500000000                        WS-INV-GDV-PERCENT
183600000000           END-IF.
183700000000           ADD WS-INV-NDV-PERCENT TO WS-INV-NDV-PERCENT-TOTAL.
183800000000           ADD WS-INV-GDV-PERCENT TO WS-INV-GDV-PERCENT-TOTAL.
183900000000
184000000000           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
184100000000              WS-INV-GDV-PERCENT-TOTAL NOT = 1.000 AND
184200000000              WS-INV-GDV-PERCENT-TOTAL NOT = 0
184300000000              SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
184400000000                       GIVING WS-DUMMY-PERCENT
184500000000              ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
184600000000                                      WS-INV-GDV-PERCENT-TOTAL
184700000000           ELSE
184800000000              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
184900000000                (WS-INV-GDV-PERCENT-TOTAL = 0.999 OR
185000000000                 WS-INV-GDV-PERCENT-TOTAL > 1.000)
185100000000                 SUBTRACT WS-INV-GDV-PERCENT-TOTAL FROM 1.000
185200000000                          GIVING WS-DUMMY-PERCENT
185300000000                 ADD WS-DUMMY-PERCENT TO WS-INV-GDV-PERCENT
185400000000                                         WS-INV-GDV-PERCENT-TOTAL
185500000000              END-IF
185600000000           END-IF.
185700000000
185800000000           COMPUTE WS-INV-GDV-AFT ROUNDED =
185900000000                   WS-CONT-GDV-AFTER * WS-INV-GDV-PERCENT.
186000000000
186100000000           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
186200000000              WS-INV-NDV-PERCENT-TOTAL NOT = 1.000 AND
186300000000              WS-INV-NDV-PERCENT-TOTAL NOT = 0
186400000000              SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
186500000000                       GIVING WS-DUMMY-PERCENT
186600000000              ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
186700000000                                      WS-INV-NDV-PERCENT-TOTAL
186800000000           ELSE
186900000000              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
187000000000                (WS-INV-NDV-PERCENT-TOTAL = 0.999 OR
187100000000                 WS-INV-NDV-PERCENT-TOTAL > 1.000)
187200000000                 SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
187300000000                          GIVING WS-DUMMY-PERCENT
187400000000                 ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
187500000000                                         WS-INV-NDV-PERCENT-TOTAL
187600000000              END-IF
187700000000           END-IF.
187800000000
187900000000           COMPUTE WS-INV-NDV-AFT ROUNDED =
188000000000                   WS-CONT-NDV-AFTER * WS-INV-NDV-PERCENT.
188100000000
188200000000           MOVE WS-INV-NDV-AFT TO WS-ARRAY-NET-DEP-VALUE(ACIIDX).
188300000000           MOVE WS-INV-GDV-AFT TO WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX).
188400000000
188500000000           ADD WS-INV-NDV-AFT TO WS-CONT-NDV-AFT-TOTAL.
188600000000           ADD WS-INV-GDV-AFT TO WS-CONT-GDV-AFT-TOTAL.
188700000000
188800000000           GO TO RFCG-NEXT.
188900000000
189000000000       RFCG-EXIT.
189100000000           EXIT.
189200000000      /
189300000000       LOAD-FINAL-PARMS-ARRAY.
189400000000
189401211007111744        INITIALIZE ln_InvArraySize
189402211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
189500000000           INITIALIZE PARM-ACC-CON-INV-ARRAY-DEF.
189501211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
189502211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
189503211007111744     INITIALIZE PARM-ACCOUNT-NUMBER (IVS-CNT1)
189504211007111744                PARM-CONTRACT-NUMBER(IVS-CNT1)
189505211007111744                PARM-INVESTMENT-CODE(IVS-CNT1)
189506211007111744                PARM-NET-DEP-VALUE (IVS-CNT1)
189507211007111744                PARM-GUAR-DEATH-VALUE(IVS-CNT1)
189508211007111744                PARM-CURR-UNIT-BAL (IVS-CNT1)
189509211007111744     END-PERFORM
189600000000
189700000000           SET ACIIDX TO 1.
189800000000           SET ACIIDX DOWN BY 1.
189900000000
190000000000           SET PACIIDX TO 1.
190100000000           SET PACIIDX DOWN BY 1.
190200000000
190300000000       LOAD-NEXT.
190400000000           SET ACIIDX UP BY 1.
190500000000           SET PACIIDX UP BY 1.
190501211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
190502211007111744        GO TO LFPA-EXIT
190503211007111744     END-IF
190600000000
190601211007
190700000000           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
190800000000              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
190801211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "  OR
190802211007111744        ACIIDX > WS-ARRAY-ELEMENTS
191000000000              GO TO LFPA-EXIT
191100210819           END-IF.
191200000000
191300000000           MOVE WS-ARRAY-ACCOUNT-NO(ACIIDX)
191400000000             TO PARM-ACCOUNT-NUMBER(PACIIDX).
191500000000           MOVE WS-ARRAY-CONTRACT-NO(ACIIDX)
191600000000             TO PARM-CONTRACT-NUMBER(PACIIDX).
191700000000           MOVE WS-ARRAY-INVESTMENT-CODE(ACIIDX)
191800000000             TO PARM-INVESTMENT-CODE(PACIIDX).
191900000000           MOVE WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
192000000000             TO PARM-CURR-UNIT-BAL(PACIIDX).
192100000000           MOVE WS-ARRAY-NET-DEP-VALUE(ACIIDX)
192200000000             TO PARM-NET-DEP-VALUE(PACIIDX).
192300000000           MOVE WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX)
192400000000             TO PARM-GUAR-DEATH-VALUE(PACIIDX).
192500000000
192600000000           GO TO LOAD-NEXT.
192700000000
192800000000       LFPA-EXIT.
192900000000           EXIT.
193000000000      /
193100000000       GET-CONTRACT-INV-UNIT-PRICE.
193200000000           MOVE "N" TO WS-PRICE-FOUND.
193300000000
193400000000           MOVE WS-CONT-INVESTMENT-CODE
193500000000             TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE.
193600000000           MOVE WS-TRANS-TRADE-DATE
193700000000             TO TRADE-DATE OF INVESTMENT-UNIT-PRICE.
193800000000
193900000000           START INVESTMENT-UNIT-PRICE
194000000000                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
194100000000                 INVALID KEY
194200000000                 GO TO GCIUP-EXIT.
194300000000
194400000000       GCIUP-0010.
194500000000           READ INVESTMENT-UNIT-PRICE NEXT RECORD
194600000000                AT END
194700000000                GO TO GCIUP-EXIT.
194800000000
194900000000           IF WS-CONT-INVESTMENT-CODE NOT =
195000000000              INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE OR
195100000000              WS-TRANS-TRADE-DATE NOT =
195200000000              TRADE-DATE OF INVESTMENT-UNIT-PRICE
195300000000              GO TO GCIUP-0020
195400000000           END-IF.
195500000000
195600000000           IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE NOT = " "
195700000000              GO TO GCIUP-0010
195800000000           END-IF.
195900000000
196000000000           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
196100000000             TO WS-CONT-INV-UNIT-PRICE.
196200000000
196300000000           MOVE "Y" TO WS-PRICE-FOUND.
196400000000
196500000000       GCIUP-0020.
196600000000
196700000000           IF PRICE-FOUND
196800000000              GO TO GCIUP-EXIT
196900000000           END-IF.
197000000000
197100000000           READ INVESTMENT-UNIT-PRICE PRIOR RECORD
197200000000                AT END
197300000000                GO TO GCIUP-EXIT.
197400000000
197500000000           IF WS-CONT-INVESTMENT-CODE NOT =
197600000000              INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE
197700000000              GO TO GCIUP-EXIT
197800000000           END-IF.
197900000000
198000000000           IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE NOT = " "
198100000000              GO TO GCIUP-0020
198200000000           END-IF.
198300000000
198400000000           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
198500000000             TO WS-CONT-INV-UNIT-PRICE.
198600000000
198700000000           MOVE "Y" TO WS-PRICE-FOUND.
198800000000
198900000000       GCIUP-EXIT.
199000000000           EXIT.
199100000000      /
199200000000       GET-CONT-INV-EXCH-RATE.
199300000000           MOVE PLACEMENT-DATE OF TRANS
199400000000             TO PLACEMENT-DATE OF TRANS-EXCHANGE-RATE.
199500000000           MOVE TRANS-NO OF TRANS
199600000000             TO TRANS-NO OF TRANS-EXCHANGE-RATE.
199700000000
199800000000           READ TRANS-EXCHANGE-RATE
199900000000                INVALID KEY
200000000000                GO TO GCIER-0010.
200100000000
200200000000           IF CURRENCY-DDS OF INVESTMENT NOT =
200300000000              CURRENCY-DDS OF TRANS-EXCHANGE-RATE
200400000000              GO TO GCIER-0010
200500000000           END-IF.
200600000000
200700000000           IF EXCHANGE-RATE OF TRANS-EXCHANGE-RATE = 0
200800000000              GO TO GCIER-0010
200900000000           END-IF.
201000000000
201100000000           MOVE EXCHANGE-RATE OF TRANS-EXCHANGE-RATE
201200000000             TO WS-CONT-INV-EXCH-RATE.
201300000000
201400000000           GO TO GCIER-EXIT.
201500000000
201600000000       GCIER-0010.
201700000000
201800000000           MOVE WS-TRANS-TRADE-DATE
201900000000             TO TRADE-DATE OF EXCHANGE-RATE-M.
202000000000           MOVE CURRENCY-DDS OF INVESTMENT
202100000000             TO CURRENCY-DDS OF EXCHANGE-RATE-M.
202200000000           MOVE PROG-EXCHANGE-RATE-TYPE
202300000000             TO EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M.
202400000000
202500000000           READ EXCHANGE-RATE-M
202600000000                INVALID KEY
202700000000                GO TO GCIER-EXIT.
202800000000
202900000000           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M
203000000000             TO WS-CONT-INV-EXCH-RATE.
203100000000
203200000000       GCIER-EXIT.
203300000000           EXIT.
203400000000      /
203500000000       GET-INVESTMENT-CURRENCY.
203600000000
203700000000           MOVE WS-INVEST-CODE TO INVESTMENT-CODE OF INVESTMENT.
203800000000
203900000000           READ INVESTMENT
204000000000                INVALID KEY
204100000000                GO TO GIC-EXIT
204200000000           END-READ.
204300000000
204400000000           IF GET-LOAD-STRUCTURE
204500000000              MOVE LOAD-STRUCTURE OF INVESTMENT TO WS-LOAD-STRUCTURE
204600000000              MOVE "N" TO WS-GET-LOAD-STRUCTURE
204700000000           END-IF.
204800000000
204900000000       GIC-EXIT.
205000000000           EXIT.
205100000000      /
205200000000       GET-INVESTMENT-CALC-METHOD.
205300000000
205400000000      * RFS24943 - Begin
205500000000           MOVE "N" TO WS-PRE-1999.
205600000000      * RFS24943 - End
205700000000           INITIALIZE MFAINVSGP OF INVESTMENT-SEG-REC.
205800000000           MOVE WS-CALC-INVESTMENT-CODE
205900000000             TO INVESTMENT-CODE OF INVESTMENT-SEG.
206000000000
206100000000           READ INVESTMENT-SEG
206200000000                INVALID KEY
206300000000                MOVE "P" TO WS-CALC-METHOD
206400000000      * RFS 20516 - Start
206500000000      *         GO TO GICM-EXIT.
206600000000                GO TO GICM-SKIP.
206700000000      * RFS 20516 - End
206800000000
206900000000           MOVE CALC-METHOD OF INVESTMENT-SEG TO WS-CALC-METHOD.
207000000000
207100000000      * RFS 20516 - Start
207200000000       GICM-SKIP.
207300000000           INITIALIZE MFAACCATP OF ACCOUNT-ATT-REC.
207400000000           MOVE CURR-ACCOUNT-NO
207500000000             TO ACCOUNT-NO OF ACCOUNT-ATTRIBUTES.
207600000000           MOVE "PRE99"    TO ACCOUNT-ATTRIBUTE-CODE
207700000000                              OF ACCOUNT-ATTRIBUTES.
207800000000           READ ACCOUNT-ATTRIBUTES
207900000000           NOT INVALID KEY
208000000000               MOVE "S" TO WS-CALC-METHOD
208100000000      * RFS24943 - Begin
208200000000               MOVE "Y" TO WS-PRE-1999
208300000000      * RFS24943 - End
208400000000           INVALID KEY
208500000000               GO TO GICM-EXIT
208600000000           END-READ.
208700000000      * RFS 20516 - End
208800000000
208900000000       GICM-EXIT.
209000000000           EXIT.
209100000000      /
209200000000       RECALC-TRADES-BACKWARDS-STD.
209300000000
209400000000      * RFS24943 - Begin
209500000000      * Initialize Totals  to be calculated int the following pargaphs
209600000000           MOVE 0             TO WS-TOT-GDV-CHANGE
209700000000                                 WS-TOT-NDV-CHANGE
209800000000      * RFS24943 - End
209900000000
210000000000R15872*    DISPLAY "RECALC-TRADES-BACKWARDS-STD.............".
210100000000           SET ACIIDX TO 1.
210200000000           SET ACIIDX DOWN BY 1.
210300000000
210400000000       RTBS-NEXT-CONT-INV.
210500000000R15872*    DISPLAY "RTBS-NEXT-CONT-INV.................".
210600000000           MOVE "N" TO WS-END-OF-PROCESS.
210700210928           SET ACIIDX UP BY 1.
210701211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
210702211007111744        GO TO RTBS-EXIT
210703211007111744     END-IF
210704211007
210800000000           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
210900000000              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
210901211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "  OR
210902211007111744        ACIIDX > WS-ARRAY-ELEMENTS
211100210928              GO TO RTBS-EXIT
211200210819           END-IF.
211300000000
211400000000      *** RFS 15872  starts
211500000000      *    DISPLAY "WS-ARRAY-ACCOUNT-NO......."
211600000000      *             WS-ARRAY-ACCOUNT-NO(ACIIDX).
211700000000      *    DISPLAY "WS-ARRAY-INVESTMENT-CODE...."
211800000000      *             WS-ARRAY-INVESTMENT-CODE(ACIIDX).
211900000000      *    DISPLAY "WS-AS-AT-DATE...." WS-AS-AT-DATE.
212000000000      *** RFS 15872  ends
212100000000           MOVE WS-ARRAY-ACCOUNT-NO(ACIIDX)
212200000000             TO ACCOUNT-NO OF TRANS-D.
212300000000           MOVE WS-ARRAY-INVESTMENT-CODE(ACIIDX)
212400000000             TO INVESTMENT-CODE OF TRANS-D CURR-INVESTMENT-CODE.
212500000000           MOVE WS-AS-AT-DATE
212600000000             TO PROCESS-DATE OF TRANS-D.
212700000000           MOVE 99
212800000000             TO TRANS-PROC-SEQ-NO OF TRANS-D.
212900000000
213000000000           START TRANS-D
213100000000                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
213200000000                 INVALID KEY
213300000000                 GO TO RTBS-NEXT-CONT-INV.
213400000000
213500000000       RTBS-NEXT-TRANS.
213600000000           READ TRANS-D NEXT RECORD
213700000000                AT END
213800000000                GO TO RTBS-NEXT-CONT-INV.
213900000000
214000000000           IF CURR-ACCOUNT-NO NOT =
214100000000              ACCOUNT-NO OF TRANS-D OR
214200000000              CURR-INVESTMENT-CODE NOT =
214300000000              INVESTMENT-CODE OF TRANS-D
214400000000              GO TO RTBS-NEXT-CONT-INV
214500000000           END-IF.
214600000000
214700000000           IF END-OF-PROCESS
214800000000R15872*       DISPLAY "IT WENT HERRREEEEEE!!!"
214900000000              GO TO RTBS-NEXT-CONT-INV
215000000000           END-IF.
215100000000
215200000000           MOVE TRANS-TYPE-CODE OF TRANS-D
215300000000             TO TRANS-TYPE-CATEGORY.
215400000000           MOVE TRANS-STATUS-CODE OF TRANS-D
215500000000             TO TRANS-STATUS-CATEGORY.
215600000000           MOVE REVERSE OF TRANS-D
215700000000             TO TRANS-REVERSE-CATEGORY.
215800000000
215900000000           IF TRANS-REVERSED OR
216000000000              NOT HISTORY-REVERSE OR
216100161102      * RFS 159011 - Starts
216200161102      *       NOT VALID-TRANSACTION
216300161102             (NOT VALID-TRANSACTION
216400161102              AND NOT DISTRIBUTION-TRANSACTION)
216500161102              OR  (DISTRIBUTION-TRANSACTION
216600161102              AND lc_DistrOptionCode NOT EQUAL TO 'C')
216700161102      * RFS 159011 - Ends
216800000000R15872*       DISPLAY "IT WENT HERRREEEEEE...2"
216900000000              GO TO RTBS-NEXT-TRANS
217000000000           END-IF.
217100000000
217200000000      * RFS 20516 - Start
217300000000           MOVE ACCOUNT-NO OF TRANS-D
217400000000             TO ACCOUNT-NO OF TRANS.
217500000000           MOVE TRANS-TYPE-CODE OF TRANS-D
217600000000             TO TRANS-TYPE-CODE OF TRANS.
217700000000           MOVE TRANS-ORIGIN-CODE OF TRANS-D
217800000000             TO TRANS-ORIGIN-CODE OF TRANS.
217900000000           MOVE REVERSAL-CODE OF TRANS-D
218000000000             TO REVERSAL-CODE OF TRANS.
218100000000           MOVE "N" TO EXCLUDE-TRANS-FLAG.
218200131212
218300131212      *RFS130148 - Starts.
218400131212           INITIALIZE PLACEMENT-DATE OF TRANS,
218500131212                      TRANS-NO OF TRANS,
218600131212                      INVESTMENT-CODE OF TRANS-D,
218700131212                      CONTR-REDEM-CODE OF TRANS-D.
218800131212      *RFS130148 - Ends.
218900210111180708     INITIALIZE WS-PLACEMENTDATE WS-TRANSNO.
219000210111180708     MOVE PLACEMENT-DATE OF TRANS-D TO WS-PLACEMENTDATE.
219100210111180708     MOVE TRANS-NO OF TRANS-D       TO WS-TRANSNO.
219200000000           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
219300000000           IF EXCLUDE-TRANS-FLAG = "Y"
219400000000              GO TO RTBS-NEXT-TRANS
219500000000           END-IF.
219600000000      * RFS 20516 - End
219700000000
219800000000           MOVE PLACEMENT-DATE OF TRANS-D TO CURR-PLACEMENT-DATE.
219900000000           MOVE TRANS-NO OF TRANS-D TO CURR-TRANS-NO.
220000000000
220100000000           MOVE CURR-PLACEMENT-DATE
220200000000             TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS.
220300000000           MOVE CURR-TRANS-NO
220400000000             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
220500000000           MOVE CURR-CONTRACT-NO
220600000000             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
220700000000
220800000000           READ TRANS-CONTRACT-DETAILS
220900000000                INVALID KEY
221000000000                GO TO RTBS-NEXT-TRANS
221100000000           END-READ.
221200000000
221300000000           IF REVERSED-DDS OF TRANS-CONTRACT-DETAILS = "Y"
221400000000              GO TO RTBS-NEXT-TRANS
221500000000           END-IF.
221600000000
221700000000           MOVE NET-DEPOSIT-VALUE OF TRANS-CONTRACT-DETAILS
221800000000             TO WS-ARRAY-NET-DEP-VALUE(ACIIDX).
221900000000           MOVE GUAR-DEATH-VALUE OF TRANS-CONTRACT-DETAILS
222000000000             TO WS-ARRAY-GUAR-DEATH-VALUE(ACIIDX).
222100000000
222200000000      *** RFS 15872  starts
222300000000      *    DISPLAY "PROCESS-DATE OF TRANS-D......"
222400000000      *             PROCESS-DATE OF TRANS-D.
222500000000      *    DISPLAY "PARM-END-DATE...." PARM-END-DATE.
222600000000      *** RFS 15872  ends
222700000000
222800000000           IF PROCESS-DATE OF TRANS-D <= PARM-END-DATE
222900000000              MOVE "Y" TO WS-END-OF-PROCESS
223000000000           END-IF.
223100000000
223200000000           IF NOT END-OF-PROCESS
223300000000              IF PURCHASE-TRANSACTION
223400000000                 SUBTRACT ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
223500000000                     FROM WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
223600000000      * RFS24943 - Begin
223700000000                 COMPUTE WS-TOT-NDV-CHANGE = WS-TOT-NDV-CHANGE -
223800000000                                NDV-CHANGE OF TRANS-CONTRACT-DETAILS
223900000000                 COMPUTE WS-TOT-GDV-CHANGE = WS-TOT-GDV-CHANGE -
224000000000                                GDV-CHANGE OF TRANS-CONTRACT-DETAILS
224100000000      * RFS24943 - End
224200000000              ELSE
224300000000                 ADD ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
224400000000                  TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
224500000000      * RFS24943 - Begin
224600000000                 COMPUTE WS-TOT-NDV-CHANGE = WS-TOT-NDV-CHANGE +
224700000000                                NDV-CHANGE OF TRANS-CONTRACT-DETAILS
224800000000                 COMPUTE WS-TOT-GDV-CHANGE = WS-TOT-GDV-CHANGE +
224900000000                                GDV-CHANGE OF TRANS-CONTRACT-DETAILS
225000000000      * RFS24943 - End
225100000000              END-IF
225200000000           END-IF.
225300000000
225400000000           GO TO RTBS-NEXT-TRANS.
225500000000
225600000000       RTBS-EXIT.
225700000000           EXIT.
225800000000      /
225900000000       COPY CPYEXCLTRN.
226000000000      /
226100000000      * RFS27951 - Begin
226200000000      * ---------------------------------
226300000000        CREATE-INDEXES.
226400000000      * ---------------------------------
226500000000
226600000000      * RFS29392 - Begin
226700000000      * If error happened then just to continue to avoid looping of the
226800000000      *  program.
226900000000           EXEC SQL
227000000000             WHENEVER SQLERROR CONTINUE
227100000000           END-EXEC
227200000000      * RFS29392 - End
227300000000      * Create indexes
227400000000
227500000000           EXEC SQL
227600000000             CREATE UNIQUE INDEX mfatrcodi1
227700000000                              ON mfatrcodp
227800000000                 (Placement_Date,
227900000000                  Trans_No,
228000000000                  Contract_No)
228100000000            END-EXEC
228200000000
228300000000            EXEC SQL
228400000000              CREATE UNIQUE INDEX mfatrcodi2
228500000000                               ON mfatrcodp
228600000000                 (Contract_No,
228700000000                  Placement_Date,
228800000000                  Trans_No)
228900000000            END-EXEC
229000000000
229100000000            EXEC SQL
229200000000              CREATE UNIQUE INDEX mfatrdpsi1
229300000000                               ON mfatrdpsp
229400000000                 (Process_Date DESC,
229500000000                  Proc_Seq_No  DESC)
229600000000            END-EXEC.
229700000000      * RFS27951 - End
229800000000
229900000000      * RFS27951 - Begin
230000000000      * Just move END-JOB paragraph to the end of the program
230100000000      * to be able to continue processing if SQL error happend.
230200000000      * RFS27951 - End
230300000000
230400000000       END-JOB.
230500000000
230600000000           CLOSE ACCOUNT-CONTRACT-INVESTMENT
230700000000                 ACCOUNT-CONTRACT-RESET-D
230800000000                 ACCOUNT-CONTRACT-INV-RESET
230900000000                 ACCOUNT
231000000000                 ACCOUNT-NOMINEE
231100000000                 EXCLUDE-TRANS
231200000000                 ACCOUNT-ATTRIBUTES
231300000000                 TRANS-CONTRACT-DETAILS
231400000000                 INVESTMENT
231500000000                 INVESTMENT-UNIT-PRICE
231600000000                 TRANS-EXCHANGE-RATE
231700000000                 EXCHANGE-RATE-M
231800000000                 CURRENCY-CODE
231900000000                 PROGRAM-EXCHANGE-RATE
232000000000                 TRANS-TARGET
232100000000                 TRANS-RVS
232200000000                 INVESTMENT-SEG
232300000000                 TRANS-D
23240000000037906 **R13394           TRANS-GDV-TRANSFER
232500130802110904           INVESTMENT-STRUCTURE-XREF
232600210108180708           TRANS-MISC-DETAILS
232700210329180708           TRANS-REDEM-DETAILS
232800000000                 TRANS.
232900000000
233000000000           IF SQL-FILE-OPEN-BCK
233100000000              EXEC SQL
233200000000              CLOSE SEGSQLBCK
233300000000              END-EXEC
233400000000           END-IF.
233500000000
233600000000       EOJ-EXIT.
233700000000           EXIT.
233800000000      /
233900000000       SQLERRDISPLAY.
234000000000           DISPLAY "PGM: TRCODCALD "
234100000000                   "ERROR: SQLSTATE= " SQLSTATE
234200000000                   " SQLCODE=" SQLCODE
234300000000           IF SQL-FILE-OPEN-BCK
234400000000              EXEC SQL
234500000000              CLOSE SEGSQLBCK
234600000000              END-EXEC
234700000000              MOVE "N" TO WS-SQL-FILE-OPEN-BCK
234800000000           END-IF.
234900000000           PERFORM END-JOB THRU EOJ-EXIT
235000000000           GOBACK.
235100161102
235200161102      * RFS 159011 - Starts
235300161102       FETCH-DISTRIBUTION-TYPE.
235400161102            INITIALIZE  lc_DistrOptionCode.
235500161102
235600161102           EXEC SQL
235700161102                WHENEVER SQLERROR GOTO SQLERRDISPLAY
235800161102           END-EXEC.
235900161102
236000161102           EXEC SQL
236100161102                SELECT COALESCE(DISTR_OPTION_CODE," ")
236200161102                 INTO :lc_DistrOptionCode
236300161102                  FROM MFATRNDDP TRNDDP
236400161102                 WHERE TRNDDP.Placement_date = :ln_PlacementDate
236500161102                  AND  TRNDDP.Trans_NO       = :ln_TransNo
236600161102           END-EXEC
236700161102
236800161102      * RFS 159011 - Ends
