000100050602       IDENTIFICATION DIVISION.
000200050602       PROGRAM-ID.    TRCODCALC.
000300190328       AUTHOR.        RICHARD SALIRE.
000400190213       INSTALLATION.  JEWELSTONE SYSTEMS INC.
000500050602       DATE-WRITTEN.  MARCH 2002.
000600050602       DATE-COMPILED.
000700181206      ******************************************************************
000800050602      * * * * * * * * * * * *  D E T A I L S * * * * * * * * * * * * * *
000900050602      * This program will store either the current NDV/GBV in the      *
001000050602      * Account-Contract-Investment file or the NDV/GBV of the reset   *
001100050602      * information in the Account-Contract-Inv-Reset if there is      *
001200050602      * a reset that happened after the statement end date.  Once the  *
001300050602      * starting NDV/GBV is established, it will then look for txns    *
001400050602      * placed between the statement end date and reset effective      *
001500050602      * date or the As-At-Date of the Process-Date file, and will      *
001600210623      * process them in descending order.                              *
001700050602      ******************************************************************
001800050602      *****************************************************************
001900050602      ****
002000050602      **** NOTES:      A Module must be created while create a PGM.   *
002100210615      ****                                                            *
002200050602      **** COMPILE PGM: 1) Use option 15 to create module.            *
002300050602      ****              2) CRTPGM prompt F4                           *
002400050602      ****                 program: TRCODCALC                         *
002500050602      ****                 library: ie. MFADEVPKOJ                    *
002600210329      ****                 Module : TRCODCALC                         *
002700050602      ****                 library: ie. MFADEVPKOJ                    *
002800050602      ****                 Prompt F10 (additional parameters)         *
002900050602      ****                 program entry...:TRCODCALC                 *
003000050602      ****                 library: ie. MFADEVPKOJ                    *
003100050602      ****                                                            *
003200050602      ****       THE COMMENTS MUST BE REMOVED FROM YOUR PACKAGE       *
003300050602      ****       FRAME TO EXECUTE THE CRTSTMTSRV, CRTSTMTPGM          *
003400050602      ****       PROGRAMS FOR THE CREATION OF STATEMENT/CONFIRM       *
003500050602      ****       PROGRAMS.                                            *
003600050602      ****
003700050602      ******************************************************************
003800050602      * PROGRAMMER *DATE OF CHANGE* DESCRIPTION OF CHANGE              *
003900050602      ******************************************************************
004000050602      * R Salire   * 2002/03/19   * RFS 12734 - GBV Calculation
004100050602      *            *              * for statements.
004200050602      *            *              *                                    for
004300050602      * B. Lu      * 2002/04/18   * RFS12715
004400050602      *            *              * -Create Module for Statement
004500050602      *            *              *  performance improvement.
004600050602      * R SALIRE   * 2002/05/13   * RFS 13394 - New functionality to carry
004700050602      *            *              * over contract NDV/GBV onto Unitrax.
004800050602      * R Salire   * 2002/06/12   * RFS 13901
004900050602      *            *              * - Increased the array size of
005000050602      *            *              * WS-ACC-CON-INV-ARRAY and
005100210408      *            *              * PARM-ACC-CON-INV-ARRAY from
005200050602      *            *              * 40 to 200.
005300050602      * B. Lu      * 2002/06/26   * RFS14196
005400050602      *            *              * -Create PGM Statement.
005500050602      * R Salire   * 2002/07/19   * RFS14315
005600050602      *            *              * -Units for 'Standard' funds are
005700050602      *            *              *  not being calculated properly.
005800050602      * R Salire   * 2002/08/07   * RFS14315 - Recompile
005900050602      * Daisy Ly   * 2002/08/21   * RFS13306 - use the GBV-CHANGE
006000050602      *            *              *  of trans-contract-detail to
006100050602      *            *              *  calcuate the GBV for sell,
006200050602      *            *              *  switches and tranfers
006300050602      * R Salire   * 2002/09/02   * RFS14616
006400050602      *            *              * -Resets are not being properly calc'd
006500050602      * C. Carino  * 2002/10/03   * RFS 14407 - recompile for          *
006600050602      *                           *  ACCOUNT-ATTRIBUTE (MFAACCATP)     *
006700050602      * R Salire   * 2002/10/11   * RFS15225
006800050602      *            *              * -Opening GBV is not being calculated
006900050602      *            *              * correctly when there is all units
007000050602      *            *              * redemption in the contract
007100050602      * Ewa        * 2002/12/30   * RFS 15872 - commented out the
007200050602      * Kolasinska *              * DISPLAY stat. used for debugging.
007300050602      * R Salire   * 2003/05/01   * RFS17274
007400050602      *            *              * -Opening GBV is not being accurately
007500050602      *            *              * calculated
007600050602      * Daisy Ly   * 2003/05/30   * RFS17639 - add the bracket
007700050602      * Bud Kovacs * 2003/11/24   * RFS 19446                          *
007800050602      *            *              * -Recompile only because of file    *
007900050602      *            *              *  investment-seg (changed).         *
008000050602      * Chandana R * 2003/12/12   * RFS19566 - Exclude the TRO RST
008100050602      *            *              * transactions from opening balance
008200050602      *            *              * calculation.
008300050602      * Fatema Haji*  2004/01/07  * RFS 19318 - recompile
008400050602      * Pubudu Jay *  2004/05/07  * RFS 20516 - Use the DIRECT method
008500050602      *            *              * calculation for the accounts opened
008600050602      *            *              * after 1998 when the PRE99 attribute
008700050602      *            *              * code is set up the account.
008800050602      * R Salire   *  2004/12/14  * RFS 25686 - Bypass any automatic
008900050602      *            *              * GDV resets.  This was causing an
009000050602      *            *              * incorrect NDV and GBV being passed
009100050602      *            *              * back to the statement program.
009200050602      * Angela N.  *  2005/04/27  * RFS 24943 - Added new edit code
009300050602      *            *              * DMCCON to determine Gross value
009400050602      *            *              * reduction of the NDV and/or GBV
009500050602      *            *              * values at the contract level Direct
009600050602      *            *              * Method calculation.
009700050719      * Lev O      * 2005/07/19   * RFS24943 - Change logic as per
009800050719      *            *              * new design.
009900050721      * Lev O      * 2005/07/19   * RFS24943 - Continuing ...
010000050805      * Lev O      * 2005/08/05   * RFS29028 - Checked out to keep
010100050816      *            *              * source with RFS29028 (no changes)
010200050721      *            *              *
010300050719      * Frank Hong *  2005/06/02  * RFS 26151.
010400050602      *            *              * Modify the program to take into
010500050602      *            *              * account the number of units of transactions
010600050602      *            *              * that are in Exclude Transactions table
010700210104      *            *              * (RFEXCTRN) without affecting the Guaranteed
010800050602      *            *              * Base Value (GBV), Net Deposit Value (NDV),
010900050602      *            *              * Guaranteed Death Value (GDV) of the contract
011000050816      * Lev O      *  2005/06/19  * RFS27951 - change the program to
011100050816      *            *              * better response time. Add the
011200050816      *            *              * program to service program for
011300050816      *            *              * Annstmtjsi.
011400070309      * Esin A.    *  2007/03/09  * RFS 40576 - Recompile only.
011500071123      * Raymond Mui*  2007/11/23  * RFS 45845 - Recompile only.
011600080110      * Emman. Yala*  2008/01/10  * RFS47227 - Recompile.
011700080506      * Bojana J.  *  2008/05/06  * RFS 51776 - Recompile.
011800080514      * Bojana J.  *  2008/05/14  * RFS 47405 - Include CPGLWBRULE copy book.
011900080523      * Daniel M.  *  2008/05/23  * RFS 47405 - Include CPGLWBCKTT copy book.
012000080619      * Daniel M.  *  2008/06/12  * RFS46707 - Changes to CPGLWBRULE.
012100080801      * Richard S  *  2008/08/01  * RFS50474 - retrofit
012200080818      * Fatema Haji*  2008/08/18  * RFS 55960 - Recompile (MFAACCONP).
012300081229      * Sanjeev P  *  2008/12/29  * RFS49898 - New DMD Maturity Option.
012400090602      * Gary Xia   *  2009/06/02  * RFS57388 - Select records by reset
012500090602      *            *              * type instead of reset category.
012600100730      * Pawel A    *  2010/07/30  * RFS84063 - Recompile (CPEXCLTRN)
012700110217      * Richard Shi*  2011/02/17  * RFS84184 - ESG 21
012800110217      *            *              * recompiled for MFAACCNMP.
012900110303      * Emman Yala * 2011/03/03   * RFS91599 - Recompile for 80605
013000110511      * John O'Call* 2011/05/05   * RFS83478 - Trans-no change 9(7) to 9(9)
013100110817      * Emman Yala * 2011/06/22   * RFS96543 - Correcting impact on change
013200110817      *            *              * of order on primary key of MFAACCCRP
013300110817      *            *              * after its conversion to SQL source obj
013400111124      * Brad Doyle * 2011/11/22   * RFS99981 - Correct GBV recalculatio
013500111124      *            *              *          doubling values
013600121206      * Venkatesh C* 2012/10/19   * RFS117298 - Recompile for MFAACCONP
013700130401      * Abhisek M  * 2013/04/01   * RFS120002 - Recompile for MFATRACXP
013800130717      * PREMIL K   * 2013/07/17   * RFS110904 - PREFORM GDV RESET AND
013900130717      *                           * REVERSE RESET.
014000130830      * Andy Chan  * 2013/08/29   * RFS127401 - CPYEXCLTRN
014100131204      * Sangeetha V* 2013/12/04   * RFS130148 - Defect Fix.
014200131204      *                             MSGW when calling FXSETPOL as the
014300131204      *                             variables were not initialized.
014400140212      * Thilaga K   * 2014/01/21 * RFS133150 - Recompile for MFATRCODP
014500140403      * Arthy K    * 2014/04/03   * RFS134936 - Recompile for MFAACCONP
014600140618      * Manjusha V * 2014/04/01   * RFS129902 - Recompile for CPGLWBRULE
014700140618      * Kamal T    * 2014/06/18   * RFS118472 - Recompile
014800140620      * Vinsfy J   * 2014/06/18   * RFS136634 - Recompile
014900140826      * Nagamnai S * 2014/08/13   * RFS139007 - Recompile for CPGLWBRULE
015000160728      * Geethanjali* 2016/07/28   * RFS159011 - Adjust GBV, GMV and GDV
015100160728      * T G        *              * after cash distribution
015200180706      * Sethu B    * 2018/05/22   * RFS177420 - Adjust GBV, GMV and GDV
015300180706      *            *              * after cash distribution
015400180618      * Joel Dsouza* 2018/06/18   * RFS177152 - Guarantee death value
015500180618      *            *              * calculation
015600181022      * Joel Dsouza* 2018/10/18   * RFS1006259- GDV issues when GDV
015700181022      *            *              * is independent of GBV
015800200207      * Joel Dsouza* 2018/10/18   * RFS1007332- GBV reset on statement
015900181211      *            *              * end date.
016000200207      * Ashwini B  * 2020/02/05   * RFS185365 - Recompile for MFATRCODP*
016100200330      * Chaya SP   * 2020/03/25   * RFS185170 - Recompile for MFAGDTHCSP *
016200200629      * CHAYA SP   * 2020/06/24   * RFS185172 - Recompile for MFAACCONP
016300200724      * VIGNESH    * 2020/07/15   * RFS185171 -Recompile for MFAEXTRNP
016400200717      * M K SINDHU * 2020/07/08   * RFS185172 - Recompile for MFAGDTHCSP
016500200717      *            *              * and MFATRCODP
016600200721      * Ashwini B  * 2020/07/21   * RFS185176 - Recompile for MFAACCCRP
016700200721      *            *              * and MFAALWRSTP
016800201222      * Chaya SP   * 2020/10/19   * RFS180721 - Recompile for MFATRCODP
016900201224      * VIGNESH    * 2020/11/12   * RFS185455 -Recompile for MFAALWRSTP*
017000210217      * Ashwini B  * 2021/02/09   * RFS187046 - Recompile for MFAEXTRNP
017100210407      * Kavin      * 2021/01/05   * RFS180708 -Added MFATRNMSCP file
017200210323      * Kavin      * 2021/02/17   * RFS186290 - Recompile only
017300210607      * Raja N     * 2020/03/20   * RFS186918 - Account Maturity
017400210607      *            *              * Percentage change & Manual Resets
017500210707      * Vignesh    * 2021/07/07   * RFS187254 - Recompile for MFATRCODP
017600210813      * Kavin      * 2021/08/13   * RFS186199 - Recompile for MFAACCCERP
017601211007      * Vignesh    * 2021/08/18   * RFS1117445 - Changed Acc-Con-Inv
017602211007      *            *              * Array from 100 to 1000
017603211007      *            *              * Tagged as 111744
017700110217      *************************** *Last* *******************************
017800210928       ENVIRONMENT DIVISION.
017900050602       CONFIGURATION SECTION.
018000050602       SOURCE-COMPUTER. IBM-AS400.
018100190329       OBJECT-COMPUTER. IBM-AS400.
018200050602       SPECIAL-NAMES.
018300210607186918     DATA-AREA IS WS-DTAARA-MFASEGPARM
018400050602           LOCAL-DATA IS WS-LOCAL.
018500050602      /
018600050602       INPUT-OUTPUT SECTION.
018700200327       FILE-CONTROL.
018800190205
018900190205
019000050602           SELECT  ACCOUNT-CONTRACT-INVESTMENT
019100050602                   ASSIGN TO DATABASE-MFAACCCIP
019200050602                   ORGANIZATION IS INDEXED
019300050602                   ACCESS IS DYNAMIC
019400050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
019500050602
019600050602           SELECT  ACCOUNT-CONTRACT-RESET-D
019700050602                   ASSIGN TO DATABASE-MFAACCCRP
019800050602                   ORGANIZATION IS INDEXED
019900050602                   ACCESS IS DYNAMIC
020000050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020100050602
020200050602           SELECT  ACCOUNT-CONTRACT-INV-RESET
020300050602                   ASSIGN TO DATABASE-MFAACCCIRP
020400050602                   ORGANIZATION IS INDEXED
020500050602                   ACCESS IS DYNAMIC
020600050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
020700050602
020800050602           SELECT  TRANS
020900050602                   ASSIGN TO DATABASE-MFATRNP
021000050602                   ORGANIZATION IS INDEXED
021100050602                   ACCESS IS DYNAMIC
021200050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021300050602
021400050602           SELECT  ACCOUNT
021500050602                   ASSIGN TO DATABASE-MFAACCNTP
021600050602                   ORGANIZATION IS INDEXED
021700050602                   ACCESS IS DYNAMIC
021800050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
021900050602
022000050602           SELECT  ACCOUNT-NOMINEE
022100050602                   ASSIGN TO DATABASE-MFAACCNMP
022200050602                   ORGANIZATION IS INDEXED
022300050602                   ACCESS IS DYNAMIC
022400050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
022500050602
022600050602           SELECT  EXCLUDE-TRANS
022700050602                   ASSIGN TO DATABASE-MFAEXTRNP
022800050602                   ORGANIZATION IS INDEXED
022900050602                   ACCESS IS DYNAMIC
023000050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023100050602
023200050602           SELECT  ACCOUNT-ATTRIBUTES
023300050602                   ASSIGN TO DATABASE-MFAACCATP
023400050602                   ORGANIZATION IS INDEXED
023500050602                   ACCESS IS DYNAMIC
023600050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
023700050602
023800050602           SELECT  TRANS-CONTRACT-DETAILS
023900050602                   ASSIGN TO DATABASE-MFATRCODP
024000050602                   ORGANIZATION IS INDEXED
024100050602                   ACCESS IS DYNAMIC
024200050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024300050602
024400050602           SELECT  INVESTMENT
024500050602                   ASSIGN TO DATABASE-MFAINVP
024600050602                   ORGANIZATION IS INDEXED
024700050602                   ACCESS IS DYNAMIC
024800050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
024900050602
025000050602           SELECT  INVESTMENT-UNIT-PRICE
025100050602                   ASSIGN TO DATABASE-MFAINVUPLB
025200050602                   ORGANIZATION IS INDEXED
025300050602                   ACCESS IS DYNAMIC
025400050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
025500050602                          WITH DUPLICATES.
025600050602
025700050602           SELECT  TRANS-EXCHANGE-RATE
025800050602                   ASSIGN TO DATABASE-MFATREXRP
025900050602                   ORGANIZATION IS INDEXED
026000050602                   ACCESS IS DYNAMIC
026100050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
026200050602
026300050602           SELECT  EXCHANGE-RATE-M
026400050602                   ASSIGN TO DATABASE-MFAEXRHMP
026500050602                   ORGANIZATION IS INDEXED
026600050602                   ACCESS IS DYNAMIC
026700050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
026800050602
026900050602           SELECT  CURRENCY-CODE
027000050602                   ASSIGN TO DATABASE-MFACURP
027100050602                   ORGANIZATION IS INDEXED
027200050602                   ACCESS IS DYNAMIC
027300050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
027400050602
027500050602           SELECT  PROGRAM-EXCHANGE-RATE
027600050602                   ASSIGN TO DATABASE-MFAPRGERP
027700050602                   ORGANIZATION IS INDEXED
027800050602                   ACCESS IS DYNAMIC
027900050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028000050602
028100050602           SELECT  TRANS-TARGET
028200050602                   ASSIGN TO DATABASE-MFATRNTGLA
028300050602                   ORGANIZATION IS INDEXED
028400050602                   ACCESS IS DYNAMIC
028500050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
028600050602
028700050602           SELECT  TRANS-RVS
028800050602                   ASSIGN TO DATABASE-MFATRNP
028900050602                   ORGANIZATION IS INDEXED
029000050602                   ACCESS IS DYNAMIC
029100050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029200050602
029300050602           SELECT  INVESTMENT-SEG
029400050602                   ASSIGN TO DATABASE-MFAINVSGP
029500050602                   ORGANIZATION IS INDEXED
029600050602                   ACCESS IS DYNAMIC
029700050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
029800050602
029900050602           SELECT  TRANS-D
030000050602                   ASSIGN TO DATABASE-MFATRNLN
030100050602                   ORGANIZATION IS INDEXED
030200050602                   ACCESS IS DYNAMIC
030300050602                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY
030400050602                          WITH DUPLICATES.
030500050602
030600050602R13394     SELECT  TRANS-GBV-TRANSFER
030700050602R13394             ASSIGN TO DATABASE-MFATRACXP
030800050602R13394             ORGANIZATION IS INDEXED
030900050602R13394             ACCESS IS DYNAMIC
031000050602R13394             RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031100130717
031200130717      *RFS110904 - START
031300130717           SELECT  INVESTMENT-STRUCTURE-XREF
031400130717                   ASSIGN TO DATABASE-MFAINVSXP
031500130717                   ORGANIZATION IS INDEXED
031600130717                   ACCESS IS DYNAMIC
031700130717                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
031800130717      *RFS110904 - END
031900050602      /
032000210105      *RFS180708 - Start
032100210329           SELECT  TRANS-MISC-DETAILS
032200210105                   ASSIGN TO DATABASE-MFATRNMSCP
032300210105                   ORGANIZATION IS INDEXED
032400210105                   ACCESS IS DYNAMIC
032500210105                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
032600210329
032700210329           SELECT  TRANS-REDEM-DETAILS
032800210329                   ASSIGN TO DATABASE-MFATRNREP
032900210329                   ORGANIZATION IS INDEXED
033000210329                   ACCESS IS DYNAMIC
033100210329                   RECORD KEY IS EXTERNALLY-DESCRIBED-KEY.
033200210105      *RFS180708 - End
033300210105
033400210329       DATA DIVISION.
033500050602       FILE SECTION.
033600050602       FD  ACCOUNT-CONTRACT-INVESTMENT
033700050602           LABEL RECORDS ARE STANDARD.
033800050602       01  ACC-CON-INV-REC.           COPY DD-ALL-FORMATS OF MFAACCCIP.
033900050602
034000050602       FD  ACCOUNT-CONTRACT-RESET-D
034100050602           LABEL RECORDS ARE STANDARD.
034200050602       01  ACC-CON-RES-D-REC.         COPY DD-ALL-FORMATS OF MFAACCCRP.
034300050602
034400050602       FD  ACCOUNT-CONTRACT-INV-RESET
034500050602           LABEL RECORDS ARE STANDARD.
034600050602       01  ACC-CON-INV-RES-REC.       COPY DD-ALL-FORMATS OF MFAACCCIRP.
034700050602
034800050602       FD  TRANS
034900050602           LABEL RECORDS ARE STANDARD.
035000050602       01  TRANS-REC.                 COPY DD-ALL-FORMATS OF MFATRNP.
035100050602
035200050602       FD  ACCOUNT
035300050602           LABEL RECORDS ARE STANDARD.
035400050602       01  ACCOUNT-REC.               COPY DD-ALL-FORMATS OF MFAACCNTP.
035500050602
035600050602       FD  ACCOUNT-NOMINEE
035700050602           LABEL RECORDS ARE STANDARD.
035800050602       01  ACCOUNT-NOMINEE-REC.       COPY DD-ALL-FORMATS OF MFAACCNMP.
035900050602
036000050602       FD  EXCLUDE-TRANS
036100050602           LABEL RECORDS ARE STANDARD.
036200050602       01  EXCLUDE-TRANS-REC.         COPY DD-ALL-FORMATS OF MFAEXTRNP.
036300050602
036400050602       FD  ACCOUNT-ATTRIBUTES
036500050602           LABEL RECORDS ARE STANDARD.
036600050602       01  ACCOUNT-ATT-REC.           COPY DD-ALL-FORMATS OF MFAACCATP.
036700050602
036800050602       FD  TRANS-CONTRACT-DETAILS
036900050602           LABEL RECORDS ARE STANDARD.
037000050602       01  TRANS-CONTRACT-DTLS-REC.   COPY DD-ALL-FORMATS OF MFATRCODP.
037100050602
037200050602       FD  INVESTMENT
037300050602           LABEL RECORDS ARE STANDARD.
037400050602       01  INVESTMENT-REC.            COPY DD-ALL-FORMATS OF MFAINVP.
037500050602
037600050602       FD  INVESTMENT-UNIT-PRICE
037700050602           LABEL RECORDS ARE STANDARD.
037800050602       01  INVESTMENT-UNIT-PRICE-REC. COPY DD-ALL-FORMATS OF MFAINVUPLB.
037900050602
038000050602       FD  TRANS-EXCHANGE-RATE
038100050602           LABEL RECORDS ARE STANDARD.
038200050602       01  TRANS-EXCH-RATE-REC.       COPY DD-ALL-FORMATS OF MFATREXRP.
038300050602
038400050602       FD  EXCHANGE-RATE-M
038500050602           LABEL RECORDS ARE STANDARD.
038600050602       01  EXCHANGE-RATE-M-REC.       COPY DD-ALL-FORMATS OF MFAEXRHMP.
038700050602
038800050602       FD  CURRENCY-CODE
038900050602           LABEL RECORDS ARE STANDARD.
039000050602       01  CURRENCY-CODE-REC.         COPY DD-ALL-FORMATS OF MFACURP.
039100050602
039200050602       FD  PROGRAM-EXCHANGE-RATE
039300050602           LABEL RECORDS ARE STANDARD.
039400050602       01  PROG-EXCH-RATE-REC.        COPY DD-ALL-FORMATS OF MFAPRGERP.
039500050602
039600050602       FD  TRANS-TARGET
039700050602           LABEL RECORDS ARE STANDARD.
039800050602       01  TRANS-TARGET-REC.          COPY DD-ALL-FORMATS OF MFATRNTGLA.
039900050602
040000050602       FD  TRANS-RVS
040100050602           LABEL RECORDS ARE STANDARD.
040200050602       01  TRANS-RVS-REC.             COPY DD-ALL-FORMATS OF MFATRNP.
040300050602
040400050602       FD  INVESTMENT-SEG
040500050602           LABEL RECORDS ARE STANDARD.
040600050602       01  INVESTMENT-SEG-REC.        COPY DD-ALL-FORMATS OF MFAINVSGP.
040700050602
040800050602       FD  TRANS-D
040900050602           LABEL RECORDS ARE STANDARD.
041000050602       01  TRANS-D-REC.               COPY DD-ALL-FORMATS OF MFATRNLN.
041100050602
041200050602R13394 FD  TRANS-GBV-TRANSFER
041300050602R13394     LABEL RECORDS ARE STANDARD.
041400050602R13394 01  TRANS-GBV-TRANSFER-REC.    COPY DD-ALL-FORMATS OF MFATRACXP.
041500130717
041600130717      *RFS110904 - START
041700130717       FD  INVESTMENT-STRUCTURE-XREF
041800130717           LABEL RECORDS ARE STANDARD.
041900130717       01  INV-STRU-XREF-REC. COPY DD-ALL-FORMATS OF MFAINVSXP.
042000130717      *RFS110904 - END
042100050602      /
042200210105      *RFS180708 - Start
042300210105       FD  TRANS-MISC-DETAILS
042400210105           LABEL RECORDS ARE STANDARD.
042500210105       01  TRANS-MISC-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNMSCP.
042600210329
042700210329       FD  TRANS-REDEM-DETAILS
042800210329           LABEL RECORDS ARE STANDARD.
042900210329       01  TRANS-REDEM-DETAILS-REC. COPY DD-ALL-FORMATS OF MFATRNREP.
043000210105      *RFS180708 - End
043100210105
043200050602       WORKING-STORAGE SECTION.
043300050602
043400050602           EXEC SQL
043500050602                INCLUDE SQLCA
043600050602           END-EXEC.
043700050602
043800130830127401*01 ACCOUNT-CONTRACT.
043900130830127401**  05 GUAR-Benefit-Eligible       PIC X(1).
044000130814
044100050602       01 WS-PROGRAM-VARIABLES.
044200050602          05 CURR-ACCOUNT-NO             PIC S9(9).
044300050602          05 CURR-CONTRACT-NO            PIC S9(9).
044400050602          05 CURR-RESET-NUMBER           PIC S9(9).
044500050602          05 CURR-INVESTMENT-CODE        PIC  X(5).
044600050602          05 CURR-PLACEMENT-DATE         PIC S9(8).
04470011051183478 *   05 CURR-TRANS-NO               PIC S9(7).
04480011051183478     05 CURR-TRANS-NO               PIC S9(9).
044900050602          05 WS-CURR-RESET-NUMBER-EQ     PIC S9(2).
045000050602          05 WS-CURR-RESET-NUMBER-MID    PIC S9(2).
045100050602          05 WS-CURR-RESET-NUMBER-GT     PIC S9(2).
045200050602          05 WS-CURR-RESET-NUMBER-LT     PIC S9(2).
045300050602          05 WS-CONTRACT-EFF-DATE-EQ     PIC S9(8).
045400050602          05 WS-CONTRACT-EFF-DATE-GT     PIC S9(8).
045500050602          05 WS-CONTRACT-EFF-DATE-LT     PIC S9(8).
045600050602          05 WS-CONTRACT-EFF-DATE-MID    PIC S9(8).
045700050602          05 WS-AS-OF-THIS-DATE          PIC S9(8).
045800050602          05 WS-ORIG-UNIT-BAL            PIC S9(11)V9(3).
045900050602          05 WS-INVEST-CODE              PIC X(5).
046000050602          05 WS-CONT-INV-ARRAY-COUNT     PIC S9(02) COMP-3.
046100050602          05 WS-CONT-INV-COUNT           PIC S9(02) COMP-3.
046200050602          05 WS-CALC-INVESTMENT-CODE     PIC X(5).
046300180706      *177152 START
046400180706          05 WS-CURR-RESET-NUMBER-EQ-GDV PIC S9(2).
046500180706          05 WS-CURR-RESET-NUMBER-GT-GDV PIC S9(2).
046600180706          05 WS-CONTRACT-EFF-DATE-EQ-GDV PIC S9(8).
046700180706          05 WS-AS-OF-THIS-DATE-GDV      PIC S9(8).
046800180706          05 WS-AS-OF-THIS-DATE-GBV      PIC S9(8).
046900180706      *177152 END
047000050816      * RFS27951 - added initial values.
047100050816       01 WS-CALCULATION-VARS.
047200050816          05 WS-NDV-CHANGE               PIC S9(11)V9(2) COMP-3
047300050816                                              VALUE 0.
047400050816          05 WS-GBV-CHANGE               PIC S9(11)V9(2) COMP-3
047500050816                                              VALUE 0.
047600050816          05 WS-TEMP-NDV                 PIC S9(11)V9(2) COMP-3
047700050816                                              VALUE 0.
047800050816          05 WS-TEMP-GBV                 PIC S9(11)V9(2) COMP-3
047900050816                                              VALUE 0.
048000180706      *177152 START
048100180706          05 WS-GDV-CHANGE               PIC S9(11)V9(2) COMP-3
048200180706                                              VALUE 0.
048300180704          05 WS-TEMP-GDV                 PIC S9(11)V9(2) COMP-3
048400180704                                              VALUE 0.
048500180704          05 WS-GDV-REMAIN-AMT           PIC S9(11)V9(2) COMP-3
048600180704                                              VALUE 0.
048700180706      *177152 END
048800050816          05 WS-NDV-REMAIN-AMT           PIC S9(11)V9(2) COMP-3
048900050816                                              VALUE 0.
049000050816          05 WS-GBV-REMAIN-AMT           PIC S9(11)V9(2) COMP-3
049100050816                                              VALUE 0.
049200050816          05 WS-TRANS-UNIT-PRICE         PIC S9(11)V9(3) COMP-3
049300050816                                              VALUE 0.
049400050602          05 WS-TRANS-TRADE-DATE         PIC 9(8).
049500050602          05 WS-CONT-INV-UNIT-PRICE      PIC S9(5)V9(4) COMP-3.
049600050602          05 WS-CONT-INV-EXCH-RATE       PIC S9(2)V9(7) COMP-3.
049700050602          05 WS-TRANS-INVESTMENT-CODE    PIC X(5).
049800050602          05 WS-CONT-INVESTMENT-CODE     PIC X(5).
049900050602          05 WS-TRANS-TRADE-AMOUNT       PIC S9(11)V9(2) COMP-3.
050000050602          05 WS-CONT-MV-BEF-TOTAL        PIC S9(12)V9(2) COMP-3.
050100050602          05 WS-CONT-MV-AFT-TOTAL        PIC S9(12)V9(2) COMP-3.
050200050602          05 WS-CONT-NDV-BEF-TOTAL       PIC S9(12)V9(2) COMP-3.
050300050602          05 WS-CONT-GBV-BEF-TOTAL       PIC S9(12)V9(2) COMP-3.
050400050602          05 WS-CONT-NDV-AFTER           PIC S9(12)V9(2) COMP-3.
050500050602          05 WS-CONT-GBV-AFTER           PIC S9(12)V9(2) COMP-3.
050600050602          05 WS-INV-NDV-AFT              PIC S9(11)V9(2) COMP-3.
050700050602          05 WS-INV-GBV-AFT              PIC S9(11)V9(2) COMP-3.
050800050602          05 WS-CONT-NDV-AFT-TOTAL       PIC S9(12)V9(2) COMP-3.
050900050602          05 WS-CONT-GBV-AFT-TOTAL       PIC S9(12)V9(2) COMP-3.
051000050602          05 WS-NDV-DIFF-AMOUNT          PIC S9(07)V9(2) COMP-3.
051100050602          05 WS-GBV-DIFF-AMOUNT          PIC S9(07)V9(2) COMP-3.
051200050602          05 WS-DUMMY-PERCENT            PIC S9(2)V9(3) COMP-3.
051300050602          05 WS-INV-NDV-PERCENT          PIC S9(2)V9(3) COMP-3.
051400050602          05 WS-INV-GBV-PERCENT          PIC S9(2)V9(3) COMP-3.
051500050602          05 WS-INV-NDV-PERCENT-TOTAL    PIC S9(2)V9(3) COMP-3.
051600050602          05 WS-INV-GBV-PERCENT-TOTAL    PIC S9(2)V9(3) COMP-3.
051700180706      *177152 START
051800180706          05 WS-CONT-GDV-BEF-TOTAL       PIC S9(12)V9(2) COMP-3.
051900180706          05 WS-CONT-GDV-AFTER           PIC S9(12)V9(2) COMP-3.
052000180706          05 WS-INV-GDV-AFT              PIC S9(11)V9(2) COMP-3.
052100180706          05 WS-CONT-GDV-AFT-TOTAL       PIC S9(12)V9(2) COMP-3.
052200180706          05 WS-GDV-DIFF-AMOUNT          PIC S9(07)V9(2) COMP-3.
052300180706      *177152 END
052400050602
052500050602       01 WS-SQL-VARIABLES.
052600050602          05 WS-SQL-PROCESS-DATE         PIC S9(8) VALUE 0.
052700050602          05 WS-SQL-PROC-SEQ-NO          PIC S9(9) VALUE 0.
052800050602          05 WS-SQL-PLACEMENT-DATE       PIC S9(8) VALUE 0.
05290011051183478 *   05 WS-SQL-TRANS-NO             PIC S9(7) VALUE 0.
05300011051183478     05 WS-SQL-TRANS-NO             PIC S9(9) VALUE 0.
053100050602          05 WS-SQL-CONTRACT-NO          PIC S9(9) VALUE 0.
053200050816      * RFS27951 - ADDED init vcalue
053300050816       01 EXCLUDE-TRANS-FLAG             PIC X VALUE SPACES.
053400050602       01 CURR-CONTROLS                  PIC X(1).
053500050602       01 UNITRAX-BASE-CURRENCY          PIC X(3) VALUE " ".
053600050602       01 PROG-EXCHANGE-RATE-TYPE        PIC X(1) VALUE " ".
053700050602
053800050602       01 WS-PROCESS-DATE.
053900050602          05 WS-AS-AT-DATE-CHAR          PIC X(8).
054000050602          05 WS-AS-AT-DATE REDEFINES WS-AS-AT-DATE-CHAR
054100050602                                         PIC S9(8).
054200050602          05 FILLER                      PIC X(161).
054300050602
054400050602       01 WS-ACC-CON-INV-ARRAY-DEF.
054401211007111744*   05 WS-ACC-CON-INV-ARRAY OCCURS 100 TIMES INDEXED BY ACIIDX,
054402211007111744*                                                        ACIIDX2.
054403211007111744    05 WS-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES DEPENDING ON
054404211007111744    ln_InvArraySize INDEXED BY ACIIDX, ACIIDX2.
054700050602             10 WS-ARRAY-ACCOUNT-NO      PIC S9(09).
054800050602             10 WS-ARRAY-CONTRACT-NO     PIC S9(09).
054900050602             10 WS-ARRAY-INVESTMENT-CODE PIC  X(05).
055000050602             10 WS-ARRAY-CURR-UNIT-BAL   PIC S9(10)V9(3) COMP-3.
055100050602             10 WS-ARRAY-NET-DEP-VALUE   PIC S9(11)V9(2) COMP-3.
055200050602             10 WS-ARRAY-GUAR-BASE-VALUE PIC S9(11)V9(2) COMP-3.
055300180619177152       10 WS-ARRAY-GUAR-DTH-VALUE  PIC S9(11)V9(2) COMP-3.
055400050602             10 WS-ARRAY-INV-MV-BEF      PIC S9(11)V9(2) COMP-3.
055500050602             10 WS-ARRAY-INV-MV-AFT      PIC S9(11)V9(2) COMP-3.
055600050602             10 WS-ARRAY-INV-CURR-CODE   PIC X(03).
055700050602             10 WS-ARRAY-INV-EXCH-RATE   PIC S9(02)V9(7) COMP-3.
055800050722      * RFS24943 - Begin: Need to keep Curren GBV,NDV
055900050722             10 WS-ARRAY-CURR-NET-DEP-VALUE    PIC S9(11)V9(2) COMP-3.
056000050722             10 WS-ARRAY-CURR-GUAR-BASE-VALUE  PIC S9(11)V9(2) COMP-3.
056100050722      * RFS24943 - End
056200180702177152       10 WS-ARRAY-CURR-GUAR-DTH-VALUE PIC S9(11)V9(2) COMP-3.
056300050602
056400050602       01 WS-COPYBOOK-VARS.
056500050602          05 WS-EX-ACCOUNT-TYPE          PIC X(05).
056600050602          05 WS-EX-NOM-ACCOUNT-TYPE      PIC X(05).
056700050602          05 WS-EX-TRANS-TYPE-CODE       PIC X(03).
056800050602          05 WS-EX-TRANS-ORIGIN-CODE     PIC X(03).
056900050602          05 WS-EX-REVERSAL-CODE         PIC X(04).
057000050602          05 WS-EX-ACCOUNT-ATT-CODE      PIC X(05).
057100050602
057200050602       01 WS-LEVEL-88-VARS.
057300050602          05 WS-RESET-EQ-END-DATE        PIC X(1).
057400050602             88 RESET-EQ-END-DATE        VALUE "Y".
057500050602             88 NO-RESET-EQ-END-DATE     VALUE "N".
057600050602          05 WS-RESET-GT-END-DATE        PIC X(1).
057700050602             88 RESET-GT-END-DATE        VALUE "Y".
057800050602             88 NO-RESET-GT-END-DATE     VALUE "N".
057900180712177152    05 WS-RESET-LT-END-DATE-GDV    PIC X(1).
058000180712177152       88 RESET-LT-END-DATE-GDV    VALUE "Y".
058100180712177152       88 NO-RESET-LT-END-DATE-GDV VALUE "N".
058200180706177420    05 WS-RESET-LT-END-DATE        PIC X(1).
058300180706177420       88 RESET-LT-END-DATE        VALUE "Y".
058400180706177420       88 NO-RESET-LT-END-DATE     VALUE "N".
058500050602          05 WS-RESET-MID-DATE-RANGE     PIC X(1).
058600050602             88 RESET-MID-DATE-RANGE     VALUE "Y".
058700050602             88 NO-RESET-MID-DATE-RANGE  VALUE "N".
058800050602          05 WS-RESET-LT-BEGIN-DATE      PIC X(1).
058900050602             88 RESET-LT-BEGIN-DATE      VALUE "Y".
059000050602             88 NO-RESET-LT-BEGIN-DATE   VALUE "N".
059100050602          05 WS-RESET-FOUND              PIC X(1).
059200050602             88 RESET-FOUND              VALUE "Y".
059300050602             88 NO-RESET-FOUND           VALUE "N".
059400050602          05 WS-SQL-FILE-OPEN-BCK        PIC X(1).
059500050602             88 SQL-FILE-OPEN-BCK        VALUE "Y".
059600050602          05 WS-READ-NEXT-TRANS          PIC X(1).
059700050602             88 READ-NEXT-TRANS          VALUE "Y".
059800050602          05 WS-LOAD-STRUCTURE           PIC X(1).
059900050602             88 FRONT-END                VALUE "F".
060000050602          05 WS-GET-LOAD-STRUCTURE       PIC X(1).
060100050602             88 GET-LOAD-STRUCTURE       VALUE "Y".
060200050602          05 WS-PRICE-FOUND              PIC X(1).
060300050602             88 PRICE-FOUND              VALUE "Y".
060400050602          05 WS-NDV-DIFF-FLAG            PIC X(1).
060500050602             88 NDV-DIFFERENCE-FOUND     VALUE "Y".
060600050602          05 WS-GBV-DIFF-FLAG            PIC X(1).
060700050602             88 GBV-DIFFERENCE-FOUND     VALUE "Y".
060800050602          05 WS-CALC-METHOD              PIC X(1).
060900050602             88 STANDARD-CALC-METHOD     VALUE "S".
061000050602             88 PROPORTIONAL-CALC-METHOD VALUE "P".
061100050602          05 WS-FIRST-CONTRACT-INV-FLAG  PIC X(1).
061200050602             88 FIRST-CONTRACT-INV       VALUE "Y".
061300050602R13394    05 WS-XFER-AMT-EXISTS-FLAG     PIC X(1).
061400050602R13394       88 TRANSFER-AMT-EXISTS      VALUE "Y".
061500050602R14315    05 WS-END-OF-PROCESS           PIC X(1).
061600050602R14315       88 END-OF-PROCESS           VALUE "Y".
061700050602R17274    05 WS-UNITS-ZERO-BALANCE       PIC X(1).
061800050602R17274       88 UNITS-ZERO-BALANCE       VALUE "Y".
061900050602R17274    05 WS-PRFRM-NDV-BALANCE        PIC X(1).
062000050602R17274       88 PRFRM-NDV-BALANCE        VALUE "Y".
062100050602R17274    05 WS-PRFRM-GBV-BALANCE        PIC X(1).
062200050602R17274       88 PRFRM-GBV-BALANCE        VALUE "Y".
062300180618      *RFS177152 START
062400180706          05 WS-PRFRM-GDV-BALANCE        PIC X(1).
062500180706             88 PRFRM-GDV-BALANCE        VALUE "Y".
062600180618          05 WS-RESET-EQ-END-DATE-GDV    PIC X(1).
062700180618             88 RESET-EQ-END-DATE-GDV    VALUE "Y".
062800180618          05 WS-GDV-RST-FOUND            PIC X(1).
062900180618             88 GDV-RST-FOUND            VALUE "Y".
063000180618          05 WS-GBV-RST-FOUND            PIC X(1).
063100180618             88 GBV-RST-FOUND            VALUE "Y".
063200180618          05 WS-RESET-GT-END-DATE-GDV    PIC X(1).
063300180618             88 RESET-GT-END-DATE-GDV    VALUE "Y".
063400180618          05 WS-GDV-DIFF-FLAG            PIC X(1).
063500180618             88 GDV-DIFFERENCE-FOUND     VALUE "Y".
063600180618      *RFS177152 END
063700050602
063800050602       01 TRANSACTION-CATEGORIES.
063900050602          05 TRANS-TYPE-CATEGORY         PIC X(3).
064000050602             88 VALID-TRANSACTION        VALUES "BUY" "SWI" "TRI"
06410005061726151                                           "MFR"
064200050602                                                "SEL" "SWO" "TRO".
064300050602             88 PURCHASE-TRANSACTION     VALUES "BUY" "SWI" "TRI".
064400050602             88 REDEMPTION-TRANSACTION   VALUES "SEL" "SWO" "TRO".
064500050602             88 SWITCH-OUT-TRANSACTION   VALUES "SWO" "TRO".
064600050602             88 SWITCH-IN-TRANSACTION    VALUES "SWI" "TRI".
064700050602             88 BUY-TRANSACTION          VALUE "BUY".
064800050602             88 TRANSFER-IN              VALUE "TRI".
064900050602             88 SELL-TRANSACTION         VALUE "SEL".
06500005060226151        88 MAN-FEE-REB-TRANSACTION  VALUES "MFR".
065100160728159011       88 DISTRIBUTION-TRANSACTION VALUES "INC" "INT" "CPG".
065200050602          05 TRANS-STATUS-CATEGORY       PIC X(3).
065300050602             88 HISTORY-REVERSE          VALUES "HSC" "HST" "RVS".
065400050602             88 STATUS-RVS               VALUE  "RVS".
065500050602          05 TRANS-REVERSE-CATEGORY      PIC X(1).
065600050602             88 TRANS-REVERSED           VALUE "Y".
065700050602
065800160819      * RFS 159011 - Starts
065900160819       01 lc_DistribCategories.
066000160819          05 lc_DistrOptionCode     PIC X(1)        VALUE SPACES.
066100160819          05 ln_PlacementDate       PIC S9(8).
066200160819          05 ln_TransNo             PIC S9(9).
066300161125       01 lc_C                      PIC X(1) VALUE "C".
066400160819      * RFS 159011 - Ends
066500160819
066600050602      * RFS24943 - Begin
066700050722       01 WS-CURR-VARS.
066800050722         03 WS-CURR-UNIT-BAL   PIC S9(10)V9(3) COMP-3 VALUE 0.
066900050722
067000050722       01 WS-TOT-GBV-NDV-CHANGE.
067100050722         03 WS-CALC-TOT-GBV    PIC S9(11)V9(2) COMP-3 VALUE 0.
067200180706177152   03 WS-CALC-TOT-GDV    PIC S9(11)V9(2) COMP-3 VALUE 0.
067300050722         03 WS-CALC-TOT-NDV    PIC S9(11)V9(2) COMP-3 VALUE 0.
067400050722      * To keep reconciliation amount
067500050722         03 WS-DELTA-TOT-GBV   PIC S9(11)V9(2) COMP-3 VALUE 0.
067600180706177152   03 WS-DELTA-TOT-GDV   PIC S9(11)V9(2) COMP-3 VALUE 0.
067700050722         03 WS-DELTA-TOT-NDV   PIC S9(11)V9(2) COMP-3 VALUE 0.
067800050722
067900050722         03 WS-TOT-GBV-CHANGE  PIC S9(11)V9(2) COMP-3 VALUE 0.
068000180706177152   03 WS-TOT-GDV-CHANGE  PIC S9(11)V9(2) COMP-3 VALUE 0.
068100050722         03 WS-TOT-NDV-CHANGE  PIC S9(11)V9(2) COMP-3 VALUE 0.
068200050722
068300050721       01 WS-ARRAY-ELEMENTS            PIC S9(05) COMP-3 VALUE 0.
068400050722
068500050722       01 SW-ARRAY-FLAG                PIC 1 VALUE B'0'.
068600050722         88 SW-ARRAY-START             VALUE B'0'.
068700050722         88 SW-ARRAY-END               VALUE B'1'.
068800050722
068900050721       01 SW-REVISED-METHOD-FLAG       PIC 1 VALUE B'0'.
069000050719         88 SW-REVISED-METHOD-NOT-USED VALUE B'0'.
069100050719         88 SW-REVISED-METHOD-USED     VALUE B'1'.
069200050719
069300050602       01  WS-MISC-FIELDS.
069400050602      * Check screen edit code of DMCCON
069500050602           05 WS-DMCCON-EDIT           PIC X(1) VALUE "N".
069600050602             88 WS-DMCCON-EDIT-NO      VALUE "N".
069700050602             88 WS-DMCCON-EDIT-YES     VALUE "Y".
069800050602      * Check account attribute code of PRE99
069900050602           05 WS-PRE-1999              PIC X(1) VALUE "N".
070000050602      * Total Units in the contract
070100050602           05 WS-TOT-UNIT              PIC S9(10)V9(3) COMP-3.
070200050602           05 WS-TOT-UNIT-FLAG         PIC X(1) VALUE "N".
070300050602             88 WS-TOT-UNIT-NO         VALUE "N".
070400050602             88 WS-TOT-UNIT-YES        VALUE "Y".
070500050602      * Total GBV of the contract
070600050721           05 WS-TOT-GBV               PIC S9(11)V9(2) COMP-3 VALUE 0.
070700180706177152     05 WS-TOT-GDV               PIC S9(11)V9(2) COMP-3 VALUE 0.
070800050721           05 WS-TOT-NDV               PIC S9(11)V9(2) COMP-3 VALUE 0.
070900050602           05 WS-TOT-GBV-FLAG          PIC X(1) VALUE "N".
071000050602             88 WS-TOT-GBV-NO          VALUE "N".
071100050602             88 WS-TOT-GBV-YES         VALUE "Y".
071200050602
071300050602       01 LT-LITERALS.
071400050602         03 LT-Y                       PIC X(01)    VALUE "Y".
071500210607186918   03 lncc_R                     PIC X(01)    VALUE "R".
071600210607186918   03 lncc_018                   PIC X(03)    VALUE "018".
071700050602      * RFS24943 - End
071800050602
071900130717      * RFS 110904 - START
072000130717       01 LC-INVSTRUCTURECODE          PIC X(5).
072100130830127401 01 lc-GuarBenefitEligible       PIC X(5).
072200130717      * RFS 110904 - END
072300130717
072400050602      * RFS24943 - Begin
072500050602      * Screen Edits Allowed Declaration
072600050602       01  SCREEN-EDITS-ALLOWED-REC.
072700050602                             COPY DD-ALL-FORMATS OF MFAEDTSCP.
072800050602
072900050602      * Use the function FXSCEDTALW
073000050602       01  WS-SCREEN-EDITS-ALLOWED.
073100050602           05 WS-SEA-EDIT-SQLLOG           PIC X(1) VALUE "N".
073200050602           05 WS-SEA-RETURN-CODE           PIC X(2) VALUE "00".
073300050602
073400050602       01  WS-SCREEN-EDITS-ALLOWED.
073500050602           05 WS-ACCCDTL-SCREEN-CODE   PIC X(8)     VALUE "ACCCDTL".
073600050602           05 WS-DMCCON-EDIT-CODE      PIC X(8)     VALUE "DMCCON" .
073700050602           05 WS-DMCCON-LEVEL-CODE     PIC X(1)     VALUE "A".
073800050602      * RFS24943 - End
073900050602
074000050816      * RFS27951 - Begin
074100050816       01 WS-TEMP-VARS.
074200050816         05 WS-TEMP-END-DATE             PIC S9(09) COMP-3 VALUE 0.
074300050816         05 WS-TEMP-AS-OF-THIS-DATE      PIC S9(09) COMP-3 VALUE 0.
074400050816
074500050816       01 SW-INDEX-CREATED-FLAG          PIC X(01).
074600050816         88 SW-INDEX-NOT-CREATED         VALUE SPACES.
074700050816         88 SW-INDEX-CREATED             VALUE "Y".
074800050816      * RFS27951 - End
074900181015      *RFS1006259 Start
075000181015       01 lc_GDVSchedCode                PIC X(05) VALUE SPACES.
075100181023       01 lc_ResetSchedCode              PIC X(05) VALUE SPACES.
075200181015       01 lb_GDVDepOnGBV                 PIC X(1).
075300181015          88 lb_GDVDepOnGBV_Yes          VALUE "Y".
075400181015          88 lb_GDVDepOnGBV_No           VALUE "N".
075500181015      *RFS1006259 End
075600080514
075700210111180708 01 WS-PLACEMENTDATE           PIC S9(09) VALUE 0.
075800210111180708 01 WS-TRANSNO                 PIC S9(09) VALUE 0.
075900210607186918 01 li_GMVPercent              PIC S9(13)V9(2) VALUE 0.
076000210607
076100210607      *RFS186918 STARTS
076200210607       01 lc_Mfasegparm.
076300210607          05 FILLER                         PIC X(50).
076400210607          05 lc_AccountGuarantees           PIC X(01).
076500210607             88 lb_AccountGuaranteesYes     VALUE "Y".
076600210607             88 lb_AccountGuaranteesNo      VALUE "N".
076700210607          05 FILLER                         PIC X(05).
076800210607          05 lc_ManualResetCompareGMV       PIC X(01).
076900210607             88 lb_ManualResetCompareGMVYes VALUE "Y".
077000210607             88 lb_ManualResetCompareGMVNo  VALUE "N".
077100210607      *RFS186918 ENDS
077200210817
077201211007      *RFS1117445 START
077202211007        01 ln_InvArraySize            PIC S9(9) VALUE ZEROES.
077203211007        01 ln_InvArrayInitialSize     PIC S9(9) VALUE 100.
077204211007        01 IVS-CNT1                   PIC S9(5) COMP-3 Value 0.
077205211007      *RFS1117445 END
077300210817
077301211007
077400080514R47405 COPY CPGLWBRULE.
07750010073084063 *COPY CPGLWBCKTT.
07760010073084063  COPY CPCKFEETRN.
077700050816
077800050602       LINKAGE SECTION.
077900050602       01 PARM-ACCOUNT-NO                PIC S9(9).
078000050602       01 PARM-CONTRACT-NO               PIC S9(9).
078100050602       01 PARM-END-DATE                  PIC S9(8).
078200180627177152 01 PARM-GUAR-DTH-RULE             PIC  X(1).
078300050602       01 PARM-ACC-CON-INV-ARRAY-DEF.
078301211007R13901*   05 PARM-ACC-CON-INV-ARRAY OCCURS 100 TIMES INDEXED BY PACIIDX.
078302211007111744    05 PARM-ACC-CON-INV-ARRAY OCCURS 1 TO 1000 TIMES
078303211007111744            DEPENDING ON ln_InvArraySize INDEXED BY PACIIDX.
078500050602             10 PARM-ACCOUNT-NUMBER      PIC 9(09).
078600050602             10 PARM-CONTRACT-NUMBER     PIC 9(09).
078700050602             10 PARM-INVESTMENT-CODE     PIC X(05).
078800050602             10 PARM-NET-DEP-VALUE       PIC S9(11)V9(2) COMP-3.
078900050602             10 PARM-GUAR-BASE-VALUE     PIC S9(11)V9(2) COMP-3.
079000050602             10 PARM-CURR-UNIT-BAL       PIC S9(10)V9(3) COMP-3.
079100180626177152       10 PARM-GUAR-DTH-VALUE      PIC S9(11)V9(2) COMP-3.
079200050602
079300050602       PROCEDURE DIVISION USING PARM-ACCOUNT-NO
079400050602                                PARM-CONTRACT-NO
079500050602                                PARM-END-DATE
079600180627177152                          PARM-GUAR-DTH-RULE
079700050602                                PARM-ACC-CON-INV-ARRAY-DEF.
079800050602
079900050602       MAINLINE.
080000050602           PERFORM INITIAL-LOGIC       THRU INL-EXIT.
080100050602           IF CURR-CONTROLS IS EQUAL TO HIGH-VALUES
080200050602              GO TO ML-0030.
080300050602       ML-0010.
080400050602           PERFORM GET-CURRENT-RECORD  THRU GCR-EXIT.
080500050602       ML-0020.
080600050602           PERFORM DETAIL-PROCESSING   THRU DPR-EXIT.
080700050602       ML-0030.
080800050602           PERFORM END-JOB             THRU EOJ-EXIT.
080900050602           GOBACK.
081000050602      /
081100050602       INITIAL-LOGIC.
081200130814
081300130830127401**   EXEC SQL
081400130830127401**     SELECT GUAR_BENEFIT_ELIGIBLE
081500130830127401**       INTO :GUAR-BENEFIT-ELIGIBLE
081600130830127401**       FROM MFAACCONP
081700130830127401**      WHERE ACCOUNT_NO  = :PARM-ACCOUNT-NO
081800130830127401**        AND CONTRACT_NO = :PARM-CONTRACT-NO
081900130830127401**   END-EXEC.
082000130814
082100210607      *RFS186918 STARTS
082200210607           ACCEPT lc_Mfasegparm FROM WS-DTAARA-MFASEGPARM
082300210607                                FOR  "MFASEGPARM".
082400210607      *RFS186918 ENDS
082500210607
082600050816      * RFS27951 - Begin
082700050816           INITIALIZE WS-LEVEL-88-VARS
082800050816                      TRANSACTION-CATEGORIES
082900050816                      WS-CALCULATION-VARS
083000050816      * RFS27951 - End
083100050816
083200050602           MOVE LOW-VALUES TO CURR-CONTROLS.
083201211007111744        INITIALIZE ln_InvArraySize
083202211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
083300050602           INITIALIZE WS-PROGRAM-VARIABLES
083400210928                      WS-ACC-CON-INV-ARRAY-DEF.
083401211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
083402211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
083403211007111744     INITIALIZE WS-ARRAY-ACCOUNT-NO(IVS-CNT1)
083404211007111744                WS-ARRAY-CONTRACT-NO(IVS-CNT1)
083405211007111744                WS-ARRAY-INVESTMENT-CODE(IVS-CNT1)
083406211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
083407211007111744                WS-ARRAY-NET-DEP-VALUE(IVS-CNT1)
083408211007111744                WS-ARRAY-GUAR-BASE-VALUE(IVS-CNT1)
083409211007111744                WS-ARRAY-GUAR-DTH-VALUE(IVS-CNT1)
083410211007111744                WS-ARRAY-INV-MV-BEF(IVS-CNT1)
083411211007111744                WS-ARRAY-INV-MV-AFT(IVS-CNT1)
083412211007111744                WS-ARRAY-INV-CURR-CODE(IVS-CNT1)
083413211007111744                WS-ARRAY-INV-EXCH-RATE(IVS-CNT1)
083414211007111744                WS-ARRAY-CURR-NET-DEP-VALUE(IVS-CNT1)
083415211007111744                WS-ARRAY-CURR-GUAR-BASE-VALUE(IVS-CNT1)
083416211007111744                WS-ARRAY-CURR-GUAR-DTH-VALUE(IVS-CNT1)
083417211007111744     END-PERFORM
083418211007
083500050602           MOVE "N" TO WS-RESET-FOUND.
083600050602
083700210607
083800050602      * RFS24943 - Begin
083900050602      * Get screen edit code DMCCON
084000050602
084100050602           INITIALIZE MFAEDTSCP OF SCREEN-EDITS-ALLOWED-REC
084200050602           MOVE WS-ACCCDTL-SCREEN-CODE TO
084300050602                        SCREEN-CODE OF SCREEN-EDITS-ALLOWED-REC
084400050602           MOVE WS-DMCCON-EDIT-CODE    TO
084500050602                        EDIT-CODE OF SCREEN-EDITS-ALLOWED-REC
084600050602           MOVE WS-DMCCON-LEVEL-CODE   TO
084700050602                        LEVEL-CODE OF SCREEN-EDITS-ALLOWED-REC
084800050602           PERFORM GET-SCREEN-EDITS-ALLOWED THRU GSEA-EXIT
084900050602
085000050602           IF WS-SEA-RETURN-CODE = "00"
085100050602             SET WS-DMCCON-EDIT-YES    TO TRUE
085200050602           END-IF
085300050602      * RFS24943 - End
085400050602
085500050602           OPEN INPUT ACCOUNT-CONTRACT-INVESTMENT
085600050602                      ACCOUNT-CONTRACT-RESET-D
085700050602                      ACCOUNT-CONTRACT-INV-RESET
085800050602                      ACCOUNT
085900050602                      ACCOUNT-NOMINEE
086000050602                      EXCLUDE-TRANS
086100050602                      ACCOUNT-ATTRIBUTES
086200050602                      TRANS-CONTRACT-DETAILS
086300050602                      INVESTMENT
086400050602                      INVESTMENT-UNIT-PRICE
086500050602                      TRANS-EXCHANGE-RATE
086600050602                      EXCHANGE-RATE-M
086700050602                      CURRENCY-CODE
086800050602                      PROGRAM-EXCHANGE-RATE
086900050602                      TRANS-TARGET
087000050602                      TRANS-RVS
087100050602                      INVESTMENT-SEG
087200050602                      TRANS-D
087300050602R13394                TRANS-GBV-TRANSFER
087400130717110904                INVESTMENT-STRUCTURE-XREF
087500210108180708                TRANS-MISC-DETAILS
087600210329180708                TRANS-REDEM-DETAILS
087700050602                      TRANS.
087800050602
087900050602           IF PARM-ACCOUNT-NO = 0 OR PARM-CONTRACT-NO = 0
088000050602              MOVE HIGH-VALUES TO CURR-CONTROLS
088100050602              GO TO INL-EXIT
088200050602           END-IF.
088300050602
088400050816      * RFS27951 - Begin: replace the logic to only one call
088500050816      *    INITIALIZE WS-PROCESS-DATE.
088600050816      *    CALL "RTVPRCDTP" USING WS-PROCESS-DATE.
088700050816      *    CANCEL "RTVPRCDTP".
088800050816
088900050816           IF WS-AS-AT-DATE-CHAR = SPACES
089000050816             CALL "RTVPRCDTP" USING WS-PROCESS-DATE
089100050816           END-IF.
089200050816
089300050816           IF SW-INDEX-NOT-CREATED
089400050816             SET SW-INDEX-CREATED     TO TRUE
089500050816             PERFORM CREATE-INDEXES
089600050816           END-IF
089700050816      * RFS27951 - End
089800050602
089900050602           MOVE WS-AS-AT-DATE TO WS-AS-OF-THIS-DATE.
090000050602           PERFORM GET-BASE-CURRENCY THRU GBC-EXIT.
090100050602           PERFORM GET-EXCHANGE-RATE-TYPE THRU GERT-EXIT.
090200050602
090300050602           MOVE PARM-ACCOUNT-NO TO CURR-ACCOUNT-NO.
090400050602           MOVE PARM-CONTRACT-NO TO CURR-CONTRACT-NO.
090500050602
090600050602       INL-EXIT.
090700050602           EXIT.
090800050602      /
090900050602       GET-BASE-CURRENCY.
091000050602           MOVE LOW-VALUES   TO CURRENCY-DDS OF CURRENCY-CODE.
091100050602
091200050602           START CURRENCY-CODE
091300050602                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
091400050602                 INVALID KEY
091500050602                 MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
091600050602                 GO TO GBC-EXIT.
091700050602
091800050602       GBC-0010.
091900050602           READ CURRENCY-CODE NEXT RECORD
092000050602                AT END
092100050602                MOVE "CAD"      TO UNITRAX-BASE-CURRENCY
092200050602                GO TO GBC-EXIT.
092300050602
092400050602           IF BASE-CURRENCY  OF CURRENCY-CODE NOT = "Y"
092500050602              GO TO GBC-0010
092600050602           END-IF.
092700050602
092800050602           MOVE CURRENCY-DDS OF CURRENCY-CODE TO UNITRAX-BASE-CURRENCY.
092900050602
093000050602       GBC-EXIT.
093100050602           EXIT.
093200050602      /
093300050602       GET-EXCHANGE-RATE-TYPE.
093400050602
093500050602           MOVE "SEGCALCV" TO PROGRAM-CODE OF PROGRAM-EXCHANGE-RATE.
093600050602           MOVE "DEFAULT"  TO PROGRAM-ACTION OF PROGRAM-EXCHANGE-RATE.
093700050602
093800050602           READ PROGRAM-EXCHANGE-RATE
093900050602                INVALID KEY
094000050602                MOVE "N" TO PROG-EXCHANGE-RATE-TYPE
094100050602                GO TO GERT-EXIT.
094200050602
094300050602           MOVE EXCHANGE-RATE-TYPE OF PROGRAM-EXCHANGE-RATE
094400050602             TO PROG-EXCHANGE-RATE-TYPE.
094500050602
094600050602       GERT-EXIT.
094700050602           EXIT.
094800050602      /
094900050602      * RFS24943 - Begin
095000050602       GET-SCREEN-EDITS-ALLOWED.
095100050602            CALL "FXSCEDTALW" USING SCREEN-EDITS-ALLOWED-REC,
095200050602                                    WS-SEA-EDIT-SQLLOG,
095300050602                                    WS-SEA-RETURN-CODE.
095400050602       GSEA-EXIT.
095500050602            EXIT.
095600050602      * RFS24943 - End
095700050602      /
095800050602       GET-CURRENT-RECORD.
095900050602
096000050602           IF PARM-END-DATE >= WS-AS-AT-DATE
096100050602              GO TO GCR-0010
096200050602           END-IF.
096300050602
096400050602R14616     MOVE "N" TO WS-RESET-FOUND.
096500050602           PERFORM CHECK-ANY-CONTRACT-RESETS THRU CACR-EXIT.
096600050602
096700050602       GCR-0010.
096800050602           PERFORM ESTABLISH-GUAR-BASE-VALUE THRU EGBV-EXIT.
096900050602
097000050602       GCR-EXIT.
097100050602           EXIT.
097200050602      /
097300050602       CHECK-ANY-CONTRACT-RESETS.
097400050602
097500050602           MOVE CURR-ACCOUNT-NO
097600050602             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-RESET-D.
097700050602           MOVE CURR-CONTRACT-NO
097800050602             TO CONTRACT-NO OF ACCOUNT-CONTRACT-RESET-D.
097900050602           MOVE 99
098000050602             TO RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D.
098100050602
098200050602           START ACCOUNT-CONTRACT-RESET-D
098300050602                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
098400050602                 INVALID KEY
098500050602                 GO TO CACR-EXIT.
098600050602
098700050602       CACR-0010.
09880011081796543 *** Changed NEXT TO PRIOR since oder in Primary key is now Asc
098900110817  |   *    READ ACCOUNT-CONTRACT-RESET-D NEXT RECORD
09900011081796543      READ ACCOUNT-CONTRACT-RESET-D PRIOR RECORD
099100050602                AT END
099200050602                GO TO CACR-EXIT.
099300050602
099400050602           IF CURR-ACCOUNT-NO NOT =
099500050602              ACCOUNT-NO OF ACCOUNT-CONTRACT-RESET-D OR
099600050602              CURR-CONTRACT-NO NOT =
099700050602              CONTRACT-NO OF ACCOUNT-CONTRACT-RESET-D
099800050602              GO TO CACR-EXIT
099900050602           END-IF.
100000050602
10010009060257388 *    IF RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET-D = "A"
10020009060257388      IF RESET-TYPE     OF ACCOUNT-CONTRACT-RESET-D = "GDV"
100300180627177152        AND PARM-GUAR-DTH-RULE = "N"
100400050602R25686        GO TO CACR-0010
100500050602R25686     END-IF.
100600050602
100700050602           IF REVERSED-DDS OF ACCOUNT-CONTRACT-RESET-D = "Y" AND
100800050602              REVERSE-PROCESSED-DATE OF ACCOUNT-CONTRACT-RESET-D <=
100900050602              PARM-END-DATE
101000050602              GO TO CACR-0010
101100050602           END-IF.
101200050602
101300050602R14616*    MOVE "Y" TO WS-RESET-FOUND.
101400050602
101500050602           IF EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D =
101600050602              PARM-END-DATE
101700180618      *RFS177152 START
101800180618      *       MOVE "Y" TO WS-RESET-EQ-END-DATE
101900180618      *       MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D
102000180618      *         TO WS-CONTRACT-EFF-DATE-EQ
102100180618      *       MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
102200180618      *         TO WS-CURR-RESET-NUMBER-EQ
102300180618              IF RESET-TYPE OF ACCOUNT-CONTRACT-RESET-D = "GDV"
102400180627                 AND PARM-GUAR-DTH-RULE  = "Y"
102500180618                 MOVE "Y" TO WS-RESET-EQ-END-DATE-GDV
102600180618                 MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D
102700181206      *RFS1007332 START
102800181206      *            TO WS-CONTRACT-EFF-DATE-EQ-GDV
102900181206                   TO WS-AS-OF-THIS-DATE-GDV
103000181206      *RFS1007332 END
103100180618                 MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
103200180618                   TO WS-CURR-RESET-NUMBER-EQ-GDV
103300180618                 MOVE "Y" TO WS-GDV-RST-FOUND
103400180618              ELSE
103500180618                 MOVE "Y" TO WS-RESET-EQ-END-DATE
103600180618                 MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D
103700181206      *RFS1007332 START
103800181206      *            TO WS-CONTRACT-EFF-DATE-EQ
103900181206                   TO WS-AS-OF-THIS-DATE-GBV
104000181206      *RFS1007332 END
104100180618                 MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
104200180618                   TO WS-CURR-RESET-NUMBER-EQ
104300180618                 MOVE "Y" TO WS-GBV-RST-FOUND
104400180618              END-IF
104500050602R14616        MOVE "Y" TO WS-RESET-FOUND
104600180618      *       GO TO CACR-EXIT
104700180618              GO TO CACR-0010
104800180618      *RFS177152 END
104900050602           END-IF.
105000050602
105100050602           IF EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D >
105200050602              PARM-END-DATE
105300180618      *RFS177152 START
105400180618      *       MOVE "Y" TO WS-RESET-GT-END-DATE
105500180618      *       MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D
105600180618      *         TO WS-AS-OF-THIS-DATE
105700180618      *       MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
105800180618      *         TO WS-CURR-RESET-NUMBER-GT
105900180618              IF RESET-TYPE OF ACCOUNT-CONTRACT-RESET-D = "GDV"
106000180618                 MOVE "Y" TO WS-RESET-GT-END-DATE-GDV
106100180618                 MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D
106200180618                   TO WS-AS-OF-THIS-DATE-GDV
106300180618                 MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
106400180618                   TO WS-CURR-RESET-NUMBER-GT-GDV
106500180618                 MOVE "Y" TO WS-GDV-RST-FOUND
106600180618              ELSE
106700180618                 MOVE "Y" TO WS-RESET-GT-END-DATE
106800180618                 MOVE EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D
106900180618                   TO WS-AS-OF-THIS-DATE-GBV
107000180618                 MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
107100180618                   TO WS-CURR-RESET-NUMBER-GT
107200180618                 MOVE "Y" TO WS-GBV-RST-FOUND
107300180618               END-IF
107400180618      *RFS177152 END
107500050602R14616        MOVE "Y" TO WS-RESET-FOUND
107600050602              GO TO CACR-0010
107700050602           END-IF.
107800050602
107900180706177420     IF EFFECT-DATE OF ACCOUNT-CONTRACT-RESET-D <
108000180706177420        PARM-END-DATE         AND
108100180706177420        RESET-PROCESSED-DATE OF ACCOUNT-CONTRACT-RESET-D >=
108200180706177420        PARM-END-DATE
108300180712      *RFS177152 START
108400180712              IF RESET-TYPE OF ACCOUNT-CONTRACT-RESET-D = "GDV"
108500180712177420           MOVE "Y" TO WS-RESET-LT-END-DATE-GDV
108600180712177420           MOVE RESET-PROCESSED-DATE OF ACCOUNT-CONTRACT-RESET-D
108700180712177420             TO WS-AS-OF-THIS-DATE-GDV
108800180712177420           MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
108900180712177420             TO WS-CURR-RESET-NUMBER-GT-GDV
109000180712                 MOVE "Y" TO WS-GDV-RST-FOUND
109100180712              ELSE
109200180712                 MOVE "Y" TO WS-RESET-LT-END-DATE
109300180712                 MOVE RESET-PROCESSED-DATE OF ACCOUNT-CONTRACT-RESET-D
109400180712                   TO WS-AS-OF-THIS-DATE-GBV
109500180712                 MOVE RESET-NUMBER OF ACCOUNT-CONTRACT-RESET-D
109600180712                   TO WS-CURR-RESET-NUMBER-GT
109700180712                 MOVE "Y" TO WS-GBV-RST-FOUND
109800180712              END-IF
109900180712      *RFS177152 END
110000180706177420        MOVE "Y" TO WS-RESET-FOUND
110100180706177420        GO TO CACR-0010
110200180706177420     END-IF.
110300180706
110400050602       CACR-EXIT.
110500050602           EXIT.
110600050602      /
110700050602       ESTABLISH-GUAR-BASE-VALUE.
110800050602
110900180705      *RFS177152 START
111000180705      *    IF NO-RESET-FOUND
111100180705      *       GO TO EGBV-0010
111200180705      *    END-IF.
111300050602
111400180618           IF GBV-RST-FOUND
111500050602           IF RESET-EQ-END-DATE
111600050602              MOVE WS-CURR-RESET-NUMBER-EQ TO CURR-RESET-NUMBER
111700050602           ELSE
111800180706177420*       IF RESET-GT-END-DATE
111900180706177420        IF RESET-GT-END-DATE OR RESET-LT-END-DATE
112000050602                 MOVE WS-CURR-RESET-NUMBER-GT TO CURR-RESET-NUMBER
112100050602              END-IF
112200180618           END-IF
112300050602
112400180618           PERFORM GET-CONTRACT-RESET-GBV THRU GCRG-EXIT
112500180618           END-IF
112600050602
112700180618           IF GDV-RST-FOUND
112800180618              IF RESET-EQ-END-DATE-GDV
112900180618                 MOVE WS-CURR-RESET-NUMBER-EQ-GDV TO
113000180618                      CURR-RESET-NUMBER
113100180618              ELSE
113200180712                 IF RESET-GT-END-DATE-GDV OR RESET-LT-END-DATE-GDV
113300180618                    MOVE WS-CURR-RESET-NUMBER-GT-GDV TO
113400180618                         CURR-RESET-NUMBER
113500180618                 END-IF
113600180618              END-IF
113700180706              PERFORM GET-CONTRACT-RESET-GDV THRU GCRD-EXIT
113800180705           END-IF.
113900180618
114000180705           IF NOT GBV-RST-FOUND OR NOT GDV-RST-FOUND
114100180705              GO TO EGBV-0010
114200180705           ELSE
114300180705              GO TO EGBV-EXIT
114400180705           END-IF.
114500180705      *RFS177152 END
114600050602
114700050602       EGBV-0010.
114800050721      * RFS24943 - Begin
114900050721           MOVE 0       TO WS-ARRAY-ELEMENTS
115000050721      * RFS24943 - End
115100050602           MOVE "Y" TO WS-FIRST-CONTRACT-INV-FLAG.
115200050602           SET ACIIDX TO 1.
115300050602
115400050602           MOVE PARM-ACCOUNT-NO
115500050602             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
115600050602           MOVE PARM-CONTRACT-NO
115700050602             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT.
115800050602           MOVE SPACES
115900050602             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT.
116000050602
116100050602           START ACCOUNT-CONTRACT-INVESTMENT
116200050602                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
116300050602                 INVALID KEY
116400050602                 MOVE HIGH-VALUES TO CURR-CONTROLS
116500050602                 GO TO EGBV-EXIT.
116600050602
116700050602       EGBV-0020.
116800050602           READ ACCOUNT-CONTRACT-INVESTMENT NEXT RECORD
116900050602                AT END
117000050602                GO TO EGBV-EXIT.
117100050602
117200050602           IF PARM-ACCOUNT-NO NOT =
117300050602              ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT OR
117400050602              PARM-CONTRACT-NO NOT =
117500050602              CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
117600050602              GO TO EGBV-EXIT
117700050602           END-IF.
117800210817
117801211007      *    RFS1117445 START
117802211007           IF ACIIDX >  ln_InvArraySize
117803211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
117804211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(ACIIDX)
117805211007                      WS-ARRAY-CONTRACT-NO(ACIIDX)
117806211007                      WS-ARRAY-INVESTMENT-CODE(ACIIDX)
117807211007                      WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
117808211007                      WS-ARRAY-NET-DEP-VALUE(ACIIDX)
117809211007                      WS-ARRAY-CURR-NET-DEP-VALUE(ACIIDX)
117810211007                      WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
117811211007                      WS-ARRAY-CURR-GUAR-DTH-VALUE(ACIIDX)
117812211007                      WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
117813211007                      WS-ARRAY-CURR-GUAR-BASE-VALUE(ACIIDX)
117814211007           END-IF
117815211007      *    RFS1117445 End
117816211007
117900050721      * RFS24943 - Begin
118000050721           ADD 1        TO WS-ARRAY-ELEMENTS
118100050721      * RFS24943 - End
118200180706177152     IF NOT GBV-RST-FOUND
118300050602           MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INVESTMENT
118301211007111744       TO WS-ARRAY-ACCOUNT-NO OF WS-ACC-CON-INV-ARRAY(ACIIDX)
118500050602           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INVESTMENT
118600180705             TO WS-ARRAY-CONTRACT-NO OF WS-ACC-CON-INV-ARRAY(ACIIDX)
118700050602           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
118800050602             TO WS-ARRAY-INVESTMENT-CODE
118900180705                OF WS-ACC-CON-INV-ARRAY(ACIIDX)
119000050602           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INVESTMENT
119100180705             TO WS-ARRAY-CURR-UNIT-BAL OF WS-ACC-CON-INV-ARRAY(ACIIDX)
119200050602           MOVE NET-DEPOSIT-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
119300050722             TO WS-ARRAY-NET-DEP-VALUE OF WS-ACC-CON-INV-ARRAY(ACIIDX)
119400050722      * RFS24943 - Begin
119500050722                WS-ARRAY-CURR-NET-DEP-VALUE   (ACIIDX)
119600050722      * RFS24943 - End
119700180618      * RFS177152 START
119800180705           END-IF.
119900180618      *    MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
120000180618      *      TO WS-ARRAY-GUAR-BASE-VALUE
120100180618      *         OF WS-ACC-CON-INV-ARRAY(ACIIDX)
120200180618      * RFS24943 - Begin
120300180618      *         WS-ARRAY-CURR-GUAR-BASE-VALUE (ACIIDX)
120400050722      * RFS24943 - End
120500050602
120600180618           IF Not GDV-RST-FOUND
120700180627              AND PARM-GUAR-DTH-RULE = "Y"
120800180618              MOVE GUAR-DEATH-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
120900180619                TO WS-ARRAY-GUAR-DTH-VALUE
121000180618                   OF WS-ACC-CON-INV-ARRAY(ACIIDX)
121100180702                WS-ARRAY-CURR-GUAR-DTH-VALUE(ACIIDX)
121200180626              MOVE WS-AS-AT-DATE to WS-AS-OF-THIS-DATE-GDV
121300180618           END-IF
121400180618           IF Not GBV-RST-FOUND
121500180618              MOVE GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INVESTMENT
121600180618                TO WS-ARRAY-GUAR-BASE-VALUE
121700180618                   OF WS-ACC-CON-INV-ARRAY(ACIIDX)
121800180618                   WS-ARRAY-CURR-GUAR-BASE-VALUE(ACIIDX)
121900180626              MOVE WS-AS-AT-DATE to WS-AS-OF-THIS-DATE-GBV
122000180618           END-IF
122100180618
122200180706      * RFS177152 END
122300050602           IF FIRST-CONTRACT-INV
122400050602              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INVESTMENT
122500050602                TO WS-CALC-INVESTMENT-CODE
122600050602              PERFORM GET-INVESTMENT-CALC-METHOD THRU GICM-EXIT
122700050602              MOVE "N" TO WS-FIRST-CONTRACT-INV-FLAG
122800050602           END-IF.
122900050602
123000050602           SET ACIIDX UP BY 1.
123100050602
123200050602           GO TO EGBV-0020.
123300050602
123400050602       EGBV-EXIT.
123500050602           EXIT.
123600050602      /
123700050602       GET-CONTRACT-RESET-GBV.
123800050602           MOVE "Y" TO WS-FIRST-CONTRACT-INV-FLAG.
123900050602
124000050602           SET ACIIDX TO 1.
124100050602           MOVE CURR-ACCOUNT-NO
124200050602             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET.
124300050602           MOVE CURR-CONTRACT-NO
124400050602             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET.
124500050602           MOVE CURR-RESET-NUMBER
124600050602             TO RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET.
124700050602           MOVE SPACES
124800050602             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET.
124900050602
125000050602           START ACCOUNT-CONTRACT-INV-RESET
125100050602                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
125200050602                 INVALID KEY
125300050602                 MOVE HIGH-VALUES TO CURR-CONTROLS
125400050602                 GO TO GCRG-EXIT.
125500050602
125600050602       GCRG-0010.
125700050602
125800050602           READ ACCOUNT-CONTRACT-INV-RESET NEXT RECORD
125900050602                AT END
126000050602                GO TO GCRG-EXIT.
126100050602
126200050602           IF CURR-ACCOUNT-NO NOT =
126300050602              ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET OR
126400050602              CURR-CONTRACT-NO NOT =
126500050602              CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET OR
126600050602              CURR-RESET-NUMBER NOT =
126700050602              RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
126800050602              GO TO GCRG-EXIT
126900050602           END-IF.
127000050602
127100050602      *    IF REVERSED-DDS OF ACCOUNT-CONTRACT-INV-RESET = "Y"
127200050602      *       GO TO GCRG-0010
127300050602      *    END-IF.
127400050602
127500050602           IF FIRST-CONTRACT-INV
127600050602              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
127700050602                TO WS-CALC-INVESTMENT-CODE
127800050602              PERFORM GET-INVESTMENT-CALC-METHOD THRU GICM-EXIT
127900050602              MOVE "N" TO WS-FIRST-CONTRACT-INV-FLAG
128000050602           END-IF.
128100210817
128101211007      *    RFS1117445 End
128102211007           IF ACIIDX >  ln_InvArraySize
128103211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
128104211007           INITIALIZE WS-ARRAY-ACCOUNT-NO(ACIIDX)
128105211007                      WS-ARRAY-CONTRACT-NO(ACIIDX)
128106211007                      WS-ARRAY-INVESTMENT-CODE(ACIIDX)
128107211007                      WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
128108211007                      WS-ARRAY-NET-DEP-VALUE(ACIIDX)
128109211007                      WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
128110211007           END-IF
128111211007      *    RFS1117445 End
128112211007
128200050602           MOVE ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET
128300050602             TO WS-ARRAY-ACCOUNT-NO OF WS-ACC-CON-INV-ARRAY(ACIIDX).
128400050602           MOVE CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET
128500050602             TO WS-ARRAY-CONTRACT-NO OF WS-ACC-CON-INV-ARRAY(ACIIDX).
128600050602           MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
128700050602             TO WS-ARRAY-INVESTMENT-CODE
128800050602                OF WS-ACC-CON-INV-ARRAY(ACIIDX).
128900050602
129000050602           MOVE CURR-UNIT-BAL OF ACCOUNT-CONTRACT-INV-RESET
129100050602             TO WS-ARRAY-CURR-UNIT-BAL OF WS-ACC-CON-INV-ARRAY(ACIIDX).
129200050602
129300210607      *RFS186918 STARTS
129400210607           IF lb_ManualResetCompareGMVYes AND
129500210607              RESET-CATEGORY OF ACCOUNT-CONTRACT-RESET-D = lncc_R
129600210607              PERFORM GMVResetProcess
129700210607                 THRU GMVResetProcessExit
129800210607           END-IF.
129900210607      *RFS186918 ENDS
130000210607
130100050602           IF RESET-EQ-END-DATE
130200050602              MOVE NEW-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
130300050602                TO WS-ARRAY-NET-DEP-VALUE
130400050602                   OF WS-ACC-CON-INV-ARRAY(ACIIDX)
130500050602                   WS-ARRAY-GUAR-BASE-VALUE
130600050602                   OF WS-ACC-CON-INV-ARRAY(ACIIDX)
130700050602              GO TO GCRG-0020
130800050602           ELSE
130900180706177420*       IF RESET-GT-END-DATE
131000180706177420        IF RESET-GT-END-DATE OR RESET-LT-END-DATE
131100050602                 MOVE OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
131200050602                   TO WS-ARRAY-NET-DEP-VALUE
131300050602                      OF WS-ACC-CON-INV-ARRAY(ACIIDX)
131400050602                      WS-ARRAY-GUAR-BASE-VALUE
131500050602                      OF WS-ACC-CON-INV-ARRAY(ACIIDX)
131600050602              END-IF
131700050602           END-IF.
131800050602
131900050602       GCRG-0020.
132000050602           SET ACIIDX UP BY 1.
132100050602
132200050602           GO TO GCRG-0010.
132300050602
132400050602       GCRG-EXIT.
132500050602           EXIT.
132600050602      /
132700180706      *177152 START
132800180706       GET-CONTRACT-RESET-GDV.
132900180706           MOVE "Y" TO WS-FIRST-CONTRACT-INV-FLAG.
133000180706
133100180706           SET ACIIDX TO 1.
133200180706           MOVE CURR-ACCOUNT-NO
133300180706             TO ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET.
133400180706           MOVE CURR-CONTRACT-NO
133500180706             TO CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET.
133600180706           MOVE CURR-RESET-NUMBER
133700180706             TO RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET.
133800180706           MOVE SPACES
133900180706             TO INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET.
134000180706
134100180706           START ACCOUNT-CONTRACT-INV-RESET
134200180706                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
134300180706                 INVALID KEY
134400180706                 MOVE HIGH-VALUES TO CURR-CONTROLS
134500180706                 GO TO GCRD-EXIT.
134600180706
134700180706       GCRD-0010.
134800180706
134900180706           READ ACCOUNT-CONTRACT-INV-RESET NEXT RECORD
135000180706                AT END
135100180706                GO TO GCRD-EXIT.
135200180706
135300180706           IF CURR-ACCOUNT-NO NOT =
135400180706              ACCOUNT-NO OF ACCOUNT-CONTRACT-INV-RESET OR
135500180706              CURR-CONTRACT-NO NOT =
135600180706              CONTRACT-NO OF ACCOUNT-CONTRACT-INV-RESET OR
135700180706              CURR-RESET-NUMBER NOT =
135800180706              RESET-NUMBER OF ACCOUNT-CONTRACT-INV-RESET
135900180706              GO TO GCRD-EXIT
136000180706           END-IF.
136100180706
136200180706           IF FIRST-CONTRACT-INV
136300180706              MOVE INVESTMENT-CODE OF ACCOUNT-CONTRACT-INV-RESET
136400180706                TO WS-CALC-INVESTMENT-CODE
136500180706              PERFORM GET-INVESTMENT-CALC-METHOD THRU GICM-EXIT
136600180706              MOVE "N" TO WS-FIRST-CONTRACT-INV-FLAG
136700180706           END-IF.
136800210817
136801211007      *    RFS1117445 START
136802211007           IF ACIIDX >  ln_InvArraySize
136803211007           COMPUTE ln_InvArraySize  =  ln_InvArraySize + 1
136804211007           INITIALIZE WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
136805211007           END-IF
136806211007      *    RFS1117445 End
136807211007
136900180706           IF RESET-EQ-END-DATE-GDV
137000180706                 MOVE NEW-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
137100180706                   TO WS-ARRAY-GUAR-DTH-VALUE
137200180706                        OF WS-ACC-CON-INV-ARRAY(ACIIDX)
137300180706                 GO TO GCRD-0020
137400180706           ELSE
137500180706                 IF RESET-GT-END-DATE-GDV
137600180706                    MOVE OLD-GUAR-BASE-VALUE OF
137700180706                         ACCOUNT-CONTRACT-INV-RESET
137800180706                      TO WS-ARRAY-GUAR-DTH-VALUE
137900180706                           OF WS-ACC-CON-INV-ARRAY(ACIIDX)
138000180706                 END-IF
138100180706           END-IF.
138200180706
138300180706       GCRD-0020.
138400180706           SET ACIIDX UP BY 1.
138500180706
138600180706           GO TO GCRD-0010.
138700180706
138800180706       GCRD-EXIT.
138900180706           EXIT.
139000180706      *177152 END
139100210607
139200210607      *RFS186918 STARTS
139300210607       GMVResetProcess.
139400210607           MOVE ZEROES TO li_GMVPercent
139500210607
139600210607           EXEC SQL
139700210607             SELECT  ORIGINAL_VALUE
139800210607               INTO :li_GMVPercent
139900210607               FROM  MFAACCCERP
140000210607              WHERE  ACCOUNT_NO   = :CURR-ACCOUNT-NO
140100210607                AND  CONTRACT_NO  = :CURR-CONTRACT-NO
140200210607                AND  RESET_NUMBER = :CURR-RESET-NUMBER
140300210607                AND  ELEMENT_CODE = :lncc_018
140400210607           END-EXEC
140500210607
140600210607           IF SQLCODE = 0
140700210607              IF OLD-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET =
140800210607                 NEW-GUAR-BASE-VALUE OF ACCOUNT-CONTRACT-INV-RESET
140900210607                 COMPUTE
141000210607                  NEW-GUAR-BASE-VALUE OF
141100210607                    ACCOUNT-CONTRACT-INV-RESET ROUNDED =
141200210607                  NEW-GUAR-BASE-VALUE OF
141300210607                    ACCOUNT-CONTRACT-INV-RESET * 100 / li_GMVPercent
141400210607                 END-COMPUTE
141500210607              END-IF
141600210607
141700210607              COMPUTE
141800210607                OLD-GUAR-BASE-VALUE OF
141900210607                    ACCOUNT-CONTRACT-INV-RESET ROUNDED =
142000210607                OLD-GUAR-BASE-VALUE OF
142100210607                    ACCOUNT-CONTRACT-INV-RESET * 100 / li_GMVPercent
142200210607              END-COMPUTE
142300210607
142400210607           ELSE
142500210607              MOVE ZEROES TO li_GMVPercent
142600210607              DISPLAY "ERROR in GMVResetProcess: " SQLCODE
142700210607           END-IF
142800210607           .
142900210607
143000210607       GMVResetProcessExit. EXIT.
143100210607      *RFS186918 ENDS
143200210607
143300180706      /
143400180706
143500050602       DETAIL-PROCESSING.
143600050602
143700050602           IF PARM-END-DATE >= WS-AS-AT-DATE
143800050602              GO TO DPR-0010
143900050602           END-IF.
144000050602
144100050602           MOVE "N" TO WS-SQL-FILE-OPEN-BCK.
144200050602
144300180618      *RFS177152 START
144400180618      *    IF RESET-EQ-END-DATE
144500180618      *       GO TO DPR-0010
144600180618      *    END-IF.
144700180618      *RFS177152 END
144800050602
144900181206      *RFS1007332 START
145000181206100625*    PERFORM GDV-DEPENDENCE-ON-GBV.
145100181206           IF PARM-GUAR-DTH-RULE = "N" AND RESET-EQ-END-DATE
145200181206              GO TO DPR-0010
145300181206           END-IF.
145400181206      *RFS1007332 END
145500050602           IF PROPORTIONAL-CALC-METHOD
145600050602              PERFORM RECALC-TRADES-BACKWARDS THRU RTB-EXIT
145700050602           ELSE
145800050602              PERFORM RECALC-TRADES-BACKWARDS-STD THRU RTBS-EXIT
145900050602           END-IF.
146000050602
146100050602       DPR-0010.
146200050602
146300050602      * RFS24943 - Begin
146400050602                SET WS-TOT-UNIT-NO  TO TRUE
146500050602                SET WS-TOT-GBV-NO   TO TRUE
146600050602      * Calculate the total units and total GBV to update the Guar Base
146700050602      * Value of the array if the screen edit code DMCCON and attribute
146800050602      * code PRE99 do exist.
146900050613      * The revised direct method only applies to transactions which
147000050613      * are not defined in the exclude transaction table.
147100050602
147200050719           SET SW-REVISED-METHOD-NOT-USED    TO TRUE
147300050602           IF WS-DMCCON-EDIT-YES    AND
147400050721              WS-PRE-1999  = LT-Y
147500050719                SET SW-REVISED-METHOD-USED   TO TRUE
147600050721                SET WS-TOT-UNIT-YES          TO TRUE
147700050721                SET WS-TOT-GBV-YES           TO TRUE
147800050602      * Calculate total units and total GBV.
147900050721                MOVE 0                       TO WS-TOT-UNIT
148000050721                                                WS-TOT-GBV
148100180706177152                                          WS-TOT-GDV
148200050721                                                WS-TOT-NDV
148300050602                PERFORM CALC-TOTAL-UNIT-TOTAL-GBV THRU CTUTG-EXIT
148400050721      * Calculate GBV, NDV as per new Revised Direct Method
148500050721                PERFORM CALC-GBV-NDV-REVISED-METHOD
148600050602           END-IF.
148700050602      * RFS24943 - End
148800050602
148900050602           PERFORM LOAD-FINAL-PARMS-ARRAY THRU LFPA-EXIT.
149000050602
149100050602       DPR-EXIT.
149200050602           EXIT.
149300050602
149400050602      * RFS24943 - Begin
149500050602      * This routine will read through the array to calculate the
149600050602      * total units and total GBV.
149700050602       CALC-TOTAL-UNIT-TOTAL-GBV.
149800050602
149900050602             SET ACIIDX2 TO 1.
150000050602             SET ACIIDX2 DOWN BY 1.
150100050602
150200050602       CTUTG-NEXT.
150300050602
150400210928           SET ACIIDX2 UP BY 1.
150401211007111744     IF ACIIDX2 > WS-ARRAY-ELEMENTS
150402211007111744        GO TO CTUTG-EXIT
150403211007111744     END-IF
150404211007
150500210817           IF WS-ARRAY-ACCOUNT-NO(ACIIDX2) = 0 OR
150600050602              WS-ARRAY-CONTRACT-NO(ACIIDX2) = 0 OR
150601211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX2) = " " OR
150602211007111744        ACIIDX2 > WS-ARRAY-ELEMENTS
150800050602              GO TO CTUTG-EXIT
150900210817           END-IF.
151000050602
151100050602           IF WS-ARRAY-CURR-UNIT-BAL(ACIIDX2) = 0 AND
151200050602              WS-ARRAY-GUAR-BASE-VALUE(ACIIDX2) = 0
151300050602              GO TO CTUTG-NEXT
151400050602           END-IF.
151500050602
151600050602           IF WS-TOT-UNIT-YES
151700050602              ADD WS-ARRAY-CURR-UNIT-BAL(ACIIDX2) TO WS-TOT-UNIT
151800050602           END-IF.
151900050602
152000050602           IF WS-TOT-GBV-YES
152100050722              ADD WS-ARRAY-CURR-GUAR-BASE-VALUE(ACIIDX2) TO WS-TOT-GBV
152200180706177152        ADD WS-ARRAY-CURR-GUAR-DTH-VALUE(ACIIDX2)  TO WS-TOT-GDV
152300050722              ADD WS-ARRAY-CURR-NET-DEP-VALUE  (ACIIDX2) TO WS-TOT-NDV
152400050602           END-IF.
152500050602
152600050602           GO TO CTUTG-NEXT.
152700050602
152800050602       CTUTG-EXIT.
152900050602           EXIT.
153000050721      * ---------------------------------
153100050721       CALC-GBV-NDV-REVISED-METHOD.
153200050721      * ---------------------------------
153300050721      * Calculate GBV, NDV using revised method calculation
153400050722           INITIALIZE WS-CALC-TOT-GBV
153500050722                      WS-CALC-TOT-NDV
153600180706177152                WS-CALC-TOT-GDV
153700050722
153800050722      * Apply GBV, NDV change to totals GBV, NDV
153900050722           COMPUTE WS-TOT-GBV = WS-TOT-GBV  + WS-TOT-GBV-CHANGE
154000180706177152     COMPUTE WS-TOT-GDV = WS-TOT-GDV  + WS-TOT-GDV-CHANGE
154100050722           COMPUTE WS-TOT-NDV = WS-TOT-NDV  + WS-TOT-NDV-CHANGE
154200050722
154300050721           PERFORM VARYING ACIIDX FROM 1 BY 1 UNTIL
154400050721                           ACIIDX > WS-ARRAY-ELEMENTS
154500050722             MOVE WS-ARRAY-CURR-UNIT-BAL (ACIIDX) TO WS-CURR-UNIT-BAL
154600050722
154700050722      * GBV calculation
154800050721             IF WS-TOT-GBV <= 0
154900050721               MOVE 0      TO WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
155000050721             ELSE
155100050721               COMPUTE WS-ARRAY-GUAR-BASE-VALUE(ACIIDX) ROUNDED =
155200050722                 WS-CURR-UNIT-BAL * WS-TOT-GBV / WS-TOT-UNIT
155300050721             END-IF
155400050722             COMPUTE WS-CALC-TOT-GBV =
155500050722               WS-CALC-TOT-GBV + WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
155600050722
155700180706      *177152 START
155800180702      * GDV calculation
155900180702             IF WS-TOT-GDV <= 0
156000180702               MOVE 0      TO WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
156100180702             ELSE
156200180702               COMPUTE WS-ARRAY-GUAR-DTH-VALUE(ACIIDX) ROUNDED =
156300180702                 WS-CURR-UNIT-BAL * WS-TOT-GDV / WS-TOT-UNIT
156400180702             END-IF
156500180702             COMPUTE WS-CALC-TOT-GDV =
156600180702               WS-CALC-TOT-GDV + WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
156700180706      *177152 END
156800180702
156900050722      * NDV calculation
157000050721             IF WS-TOT-NDV <= 0
157100050721               MOVE 0      TO WS-ARRAY-NET-DEP-VALUE  (ACIIDX)
157200050721             ELSE
157300050721               COMPUTE WS-ARRAY-NET-DEP-VALUE  (ACIIDX) ROUNDED =
157400050722                 WS-CURR-UNIT-BAL * WS-TOT-NDV / WS-TOT-UNIT
157500050721             END-IF
157600050722             COMPUTE WS-CALC-TOT-NDV =
157700050722               WS-CALC-TOT-NDV + WS-ARRAY-NET-DEP-VALUE  (ACIIDX)
157800050721           END-PERFORM.
157900050722
158000050722      * Compute reconciliation amount and apply to the first
158100050722      * element with units.
158200050722           IF WS-ARRAY-ELEMENTS > 0
158300050722             PERFORM RECONCILE-TOT-GBV-NDV
158400050722           END-IF.
158500050722      * ---------------------------------
158600050722       RECONCILE-TOT-GBV-NDV.
158700050722      * ---------------------------------
158800050722           COMPUTE WS-DELTA-TOT-GBV = WS-TOT-GBV - WS-CALC-TOT-GBV
158900180706177152     COMPUTE WS-DELTA-TOT-GDV = WS-TOT-GDV - WS-CALC-TOT-GDV
159000050722           COMPUTE WS-DELTA-TOT-NDV = WS-TOT-NDV - WS-CALC-TOT-NDV
159100050722
159200050722           IF WS-DELTA-TOT-GBV NOT = 0.0    OR
159300050722              WS-DELTA-TOT-NDV NOT = 0.0
159400180706177152        OR WS-DELTA-TOT-GDV NOT = 0.0
159500050722             SET SW-ARRAY-START             TO TRUE
159600050722             PERFORM VARYING ACIIDX FROM 1 BY 1 UNTIL
159700050722                             ACIIDX > WS-ARRAY-ELEMENTS  OR
159800050722                             SW-ARRAY-END
159900050722               IF WS-ARRAY-CURR-UNIT-BAL   (ACIIDX) > 0.0
160000050722                 ADD WS-DELTA-TOT-GBV TO
160100050722                              WS-ARRAY-GUAR-BASE-VALUE (ACIIDX)
160200180706177152           ADD WS-DELTA-TOT-GDV TO
160300180706177152                        WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
160400050722                 ADD WS-DELTA-TOT-NDV TO
160500050722                              WS-ARRAY-NET-DEP-VALUE   (ACIIDX)
160600050722                 MOVE 0               TO WS-DELTA-TOT-GBV
160700050722                                         WS-DELTA-TOT-NDV
160800180706177152                                   WS-DELTA-TOT-GDV
160900050722                 SET SW-ARRAY-END     TO TRUE
161000050722               END-IF
161100050722             END-PERFORM
161200050722      * If something left then reconcile the First Element
161300050722             IF WS-DELTA-TOT-GBV NOT = 0.0    OR
161400050722                WS-DELTA-TOT-NDV NOT = 0.0
161500180706177152          OR WS-DELTA-TOT-GDV NOT = 0.0
161600050722               ADD WS-DELTA-TOT-GBV TO WS-ARRAY-GUAR-BASE-VALUE (1)
161700180706177152         ADD WS-DELTA-TOT-GDV TO WS-ARRAY-GUAR-DTH-VALUE(1)
161800050722               ADD WS-DELTA-TOT-NDV TO WS-ARRAY-NET-DEP-VALUE   (1)
161900050722             END-IF
162000050722           END-IF.
162100050602      * RFS24943 - End
162200050602      /
162300050602       RECALC-TRADES-BACKWARDS.
162400050602
162500180618      * RFS177152 START
162600180618           IF (RESET-GT-END-DATE-GDV or RESET-GT-END-DATE)
162700180618              IF WS-AS-OF-THIS-DATE-GBV < WS-AS-OF-THIS-DATE-GDV
162800180618                 MOVE WS-AS-OF-THIS-DATE-GDV to WS-AS-OF-THIS-DATE
162900180618              ELSE
163000180618                 MOVE WS-AS-OF-THIS-DATE-GBV to WS-AS-OF-THIS-DATE
163100180618              END-IF
163200180618           END-IF
163300180618      * RFS177152 END
163400180618
163500180618      * RFS27951 - Begin
163600050816           MOVE PARM-END-DATE        TO WS-TEMP-END-DATE
163700050816           MOVE WS-AS-OF-THIS-DATE   TO WS-TEMP-AS-OF-THIS-DATE
163800050816      * RFS27951 - End
163900050816
164000050602           EXEC SQL
164100050602                WHENEVER SQLERROR GOTO SQLERRDISPLAY
164200050602           END-EXEC.
164300050602
164400050602           EXEC SQL
164500050602           DECLARE SEGSQLBCK CURSOR FOR SELECT
164600050602           A.PROCESS_DATE, A.PROC_SEQ_NO,
164700050602           A.PLACEMENT_DATE, A.TRANS_NO,
164800050602           B.CONTRACT_NO
164900050602           FROM MFATRDPSP A
165000050602                INNER JOIN MFATRCODP B ON
165100050602                   A.PLACEMENT_DATE = B.PLACEMENT_DATE AND
165200050602                   A.TRANS_NO = B.TRANS_NO
165300050602           WHERE
165400050602           B.CONTRACT_NO = :PARM-CONTRACT-NO AND
165500050816      * RFS27951 - Begin: Replace with temp vars with appropriate
165600050816      * definitioons.
165700050816      *    A.PROCESS_DATE > :PARM-END-DATE AND
165800050816      *    A.PROCESS_DATE <= :WS-AS-OF-THIS-DATE
165900050816
166000050816           A.PROCESS_DATE >  :WS-TEMP-END-DATE      AND
166100050816           A.PROCESS_DATE <= :WS-TEMP-AS-OF-THIS-DATE
166200050816      * RFS27951 - End
166300050602           ORDER BY A.PROCESS_DATE DESC, A.PROC_SEQ_NO DESC
166400050602           FOR READ ONLY
166500050602           END-EXEC.
166600050602
166700050602           EXEC SQL
166800050602                OPEN SEGSQLBCK
166900050602           END-EXEC.
167000050602
167100050602           MOVE "Y" TO WS-SQL-FILE-OPEN-BCK.
167200050602
167300050602       RTB-0010.
167400050602
167500050602           EXEC SQL
167600050602                WHENEVER NOT FOUND GOTO RTB-EXIT
167700050602           END-EXEC.
167800050602
167900050602           EXEC SQL
168000050602                FETCH NEXT FROM SEGSQLBCK
168100050602                INTO :WS-SQL-PROCESS-DATE, :WS-SQL-PROC-SEQ-NO,
168200050602                     :WS-SQL-PLACEMENT-DATE, :WS-SQL-TRANS-NO,
168300050602                     :WS-SQL-CONTRACT-NO
168400050602           END-EXEC.
168500050602
168600050602           EXEC SQL
168700050602                WHENEVER SQLERROR GOTO SQLERRDISPLAY
168800050602           END-EXEC.
168900050602
169000050602           MOVE "N" TO WS-READ-NEXT-TRANS.
169100050602           PERFORM RECALC-GBV-4ALL-TRADES THRU RG4T-EXIT.
169200050602           IF READ-NEXT-TRANS
169300050602              GO TO RTB-0010
169400050602           END-IF.
169500050602
169600050602           GO TO RTB-0010.
169700050602
169800050602       RTB-EXIT.
169900050602           EXIT.
170000050602      /
170100050602       RECALC-GBV-4ALL-TRADES.
170200050602
170300050602           MOVE WS-SQL-PLACEMENT-DATE TO PLACEMENT-DATE OF TRANS.
170400050602           MOVE WS-SQL-TRANS-NO TO TRANS-NO OF TRANS.
170500050602
170600050602           READ TRANS
170700050602                INVALID KEY
170800050602                MOVE "Y" TO WS-READ-NEXT-TRANS
170900050602                GO TO RG4T-EXIT
171000050602           END-READ.
171100050602
171200050602      * RFS19566 Start
171300050602           IF TRANS-TYPE-CODE OF TRANS   = "TRO" AND
171400050602              TRANS-ORIGIN-CODE OF TRANS = "RST"
171500050602                MOVE "Y" TO WS-READ-NEXT-TRANS
171600050602                GO TO RG4T-EXIT
171700050602           END-IF.
171800050602      * RFS19566 End
171900111124
172000111124      * RFS99981 Start
172100111124           IF TRANS-ORIGIN-CODE OF TRANS = "MAT" AND
172200111124              WS-RESET-GT-END-DATE = "Y"
172300111124                MOVE "Y" TO WS-READ-NEXT-TRANS
172400111124                GO TO RG4T-EXIT
172500111124           END-IF.
172600111124      * RFS99981 End
172700050602
172800050602           MOVE TRANS-TYPE-CODE OF TRANS TO TRANS-TYPE-CATEGORY.
172900050602           MOVE TRANS-STATUS-CODE OF TRANS TO TRANS-STATUS-CATEGORY.
173000050602           MOVE REVERSE OF TRANS TO TRANS-REVERSE-CATEGORY.
173100050602
173200050602           IF PROCESS-DATE OF TRANS > WS-AS-AT-DATE OR
173300050602              PROCESS-DATE OF TRANS < PARM-END-DATE
173400050602              MOVE "Y" TO WS-READ-NEXT-TRANS
173500050602              GO TO RG4T-EXIT
173600050602           END-IF.
173700160819
173800160819      * RFS 159011 - Starts
173900160819           INITIALIZE lc_DistribCategories
174000160819           IF DISTRIBUTION-TRANSACTION
174100160819              MOVE PLACEMENT-DATE  OF TRANS
174200160819                              TO ln_PlacementDate
174300160819
174400160819              MOVE TRANS-NO        OF TRANS
174500160819                              TO ln_TransNo
174600160819
174700160819              PERFORM FETCH-DISTRIBUTION-TYPE
174800160819           END-IF
174900160819      * RFS 159011 - Ends
175000050602
175100050602           IF (TRANS-REVERSED AND NOT STATUS-RVS) OR
175200050602              NOT HISTORY-REVERSE OR
175300160819      * RFS 159011 - Starts
175400160819      *       NOT VALID-TRANSACTION
175500160819             (NOT VALID-TRANSACTION
175600160819              AND NOT DISTRIBUTION-TRANSACTION)
175700160819              OR  (DISTRIBUTION-TRANSACTION
175800160819              AND lc_DistrOptionCode NOT EQUAL TO 'C')
175900160819      * RFS 159011 - Ends
176000050602              MOVE "Y" TO WS-READ-NEXT-TRANS
176100050602              GO TO RG4T-EXIT
176200050602           END-IF.
176300050602
176400050602           IF TRANS-REVERSED AND STATUS-RVS
176500050602              MOVE PLACEMENT-DATE OF TRANS TO CURR-PLACEMENT-DATE
176600050602              MOVE TRANS-NO OF TRANS TO CURR-TRANS-NO
176700050602              PERFORM GET-TRANS-RVS-OFFSET THRU GTRO-EXIT
176800050602              IF READ-NEXT-TRANS
176900050602                 GO TO RG4T-EXIT
177000050602              END-IF
177100050602           END-IF.
177200050602
177300050602           MOVE "N" TO EXCLUDE-TRANS-FLAG.
177400210111180708     INITIALIZE WS-PLACEMENTDATE WS-TRANSNO.
177500210111180708     MOVE PLACEMENT-DATE OF TRANS  TO WS-PLACEMENTDATE.
177600210111180708     MOVE TRANS-NO OF TRANS        TO WS-TRANSNO.
177700050602           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
17780005060226151**    IF EXCLUDE-TRANS-FLAG = "Y"
17790005060226151**       MOVE "Y" TO WS-READ-NEXT-TRANS
17800005060226151**       GO TO RG4T-EXIT
17810005060226151**    END-IF.
178200050602
178300160819      * RFS 159011 - Starts
178400161103           IF lc_DistrOptionCode = lc_C
178500160819           AND EXCLUDE-TRANS-FLAG = "Y"
178600160819              MOVE "Y" TO WS-READ-NEXT-TRANS
178700160819              GO TO RG4T-EXIT
178800160819           END-IF.
178900160819      * RFS 159011 - Ends
179000160819
179100050602           MOVE PLACEMENT-DATE OF TRANS
179200050602             TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS.
179300050602           MOVE TRANS-NO OF TRANS
179400050602             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
179500050602           MOVE WS-SQL-CONTRACT-NO
179600050602             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
179700050602
179800050602           READ TRANS-CONTRACT-DETAILS
179900050602                INVALID KEY
180000050602                MOVE "Y" TO WS-READ-NEXT-TRANS
180100050602                GO TO RG4T-EXIT
180200050602           END-READ.
180300050602
180400050602           IF REVERSED-DDS OF TRANS-CONTRACT-DETAILS = "Y" AND
180500050602              NOT STATUS-RVS
180600050602              MOVE "Y" TO WS-READ-NEXT-TRANS
180700050602              GO TO RG4T-EXIT
180800050602           END-IF.
180900050602
181000050602           MOVE ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
181100050602             TO WS-ORIG-UNIT-BAL.
181200050602           MOVE INVESTMENT-CODE OF TRANS TO WS-INVEST-CODE
181300050602                                            CURR-INVESTMENT-CODE.
181400050602           MOVE "Y" TO WS-GET-LOAD-STRUCTURE.
181500050602           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
181600050602           INITIALIZE WS-CALCULATION-VARS.
181700050602
181800050602R13394* Get the NDV/GBV from Trans-GBV-Transfer if it exists
181900050602           MOVE "N" TO WS-XFER-AMT-EXISTS-FLAG.
182000050602           INITIALIZE MFATRACXP OF TRANS-GBV-TRANSFER-REC.
182100050602           IF BUY-TRANSACTION
182200081229R49898        OR SWITCH-IN-TRANSACTION
182300050602              MOVE PLACEMENT-DATE OF TRANS
182400050602                TO PLACEMENT-DATE OF TRANS-GBV-TRANSFER
182500050602              MOVE TRANS-NO OF TRANS
182600050602                TO TRANS-NO OF TRANS-GBV-TRANSFER
182700050602
182800050602              READ TRANS-GBV-TRANSFER
182900050602                   INVALID KEY
183000050602                   GO TO RG4T-0003
183100050602              END-READ
183200050602
183300050602              MOVE NET-DEPOSIT-VALUE OF TRANS-GBV-TRANSFER
183400050602                TO WS-NDV-CHANGE
183500050602              MOVE GUAR-BASE-VALUE OF TRANS-GBV-TRANSFER
183600050602                TO WS-GBV-CHANGE
183700050602
183800050602              GO TO RG4T-0005
183900050602R13394     END-IF.
184000050602
184100050602       RG4T-0003.
184200050602           IF BUY-TRANSACTION
184300050602              IF FRONT-END AND BUY-TRANSACTION
184400050602                 MOVE NET-AMT OF TRANS TO WS-GBV-CHANGE
184500050602                                          WS-NDV-CHANGE
184600180618177152                                    WS-GDV-CHANGE
184700050602              ELSE
184800050602                 MOVE GROSS-AMT OF TRANS TO WS-GBV-CHANGE
184900050602                                            WS-NDV-CHANGE
185000180618177152                                      WS-GDV-CHANGE
185100050602              END-IF
185200181206      *RFS1006259 START
185300181206      *RFS1007332 START
185400181206      *       IF lb_GDVDepOnGBV_No
185500181206              IF PARM-GUAR-DTH-RULE = "Y"
185600181206      *RFS1007332 END
185700181024                IF GDV-CHANGE of TRANS-CONTRACT-DETAILS > 0
185800181024                 Move GDV-CHANGE of TRANS-CONTRACT-DETAILS to
185900181024                      WS-GDV-CHANGE
186000181024                ELSE IF GBV-CHANGE of TRANS-CONTRACT-DETAILS > 0
186100181024                 Move GBV-CHANGE of TRANS-CONTRACT-DETAILS to
186200181024                      WS-GDV-CHANGE
186300181024                END-IF
186400181024              END-IF
186500181024      *RFS1006259 END
186600050602           END-IF.
186700050602
186800050602           IF SWITCH-IN-TRANSACTION OR SWITCH-OUT-TRANSACTION
18690005060213306         OR SELL-TRANSACTION
187000161103159011        OR lc_DistrOptionCode = lc_C
18710018101113306 *       MOVE NET-DEPOSIT-VALUE-CUR OF TRANS-CONTRACT-DETAILS
18720005060213306         MOVE NDV-CHANGE            OF TRANS-CONTRACT-DETAILS
187300050602                TO WS-NDV-CHANGE
18740005060213306 *       MOVE GUAR-BASE-VALUE-CUR OF TRANS-CONTRACT-DETAILS
18750005060213306         MOVE GBV-CHANGE          OF TRANS-CONTRACT-DETAILS
187600050602                TO WS-GBV-CHANGE
187700180618      *RFS177152 START
187800180618              IF GDV-CHANGE of TRANS-CONTRACT-DETAILS > 0
187900180618                 Move GDV-CHANGE of TRANS-CONTRACT-DETAILS to
188000180618                      WS-GDV-CHANGE
188100180618              ELSE
188200180618                 Move GBV-CHANGE of TRANS-CONTRACT-DETAILS to
188300180618                      WS-GDV-CHANGE
188400180618              END-IF
188500180618      *RFS177152 END
188600050602           END-IF.
188700050602
188800050602       RG4T-0005.
18890005061726151      IF MAN-FEE-REB-TRANSACTION AND
18900005061726151         EXCLUDE-TRANS-FLAG NOT = "Y"
18910005061726151         MOVE ZEROS TO WS-NDV-CHANGE
18920005061726151                       WS-GBV-CHANGE
189300180618177152                      WS-GDV-CHANGE
189400190329
18950005061726151         GO TO RG4T-EXIT
18960005061726151      END-IF.
189700050617
18980005061726151      IF EXCLUDE-TRANS-FLAG = "Y"
18990005060226151         MOVE ZEROS TO WS-NDV-CHANGE
19000005060226151                       WS-GBV-CHANGE
190100180618177152                      WS-GDV-CHANGE
19020005060226151      END-IF.
190300050602
190400180618      *RFS177152 START
190500180706           IF WS-AS-OF-THIS-DATE-GDV < TRADE-DATE OF TRANS AND
190600181206      *RFS1007332 START
190700181206      *       RESET-GT-END-DATE-GDV
190800181206              (RESET-GT-END-DATE-GDV OR RESET-EQ-END-DATE-GDV)
190900181206      *RFS1007332 END
191000180618                MOVE ZEROS TO WS-GDV-CHANGE
191100180618           END-IF
191200180706           IF WS-AS-OF-THIS-DATE-GBV < TRADE-DATE OF TRANS AND
191300181206      *RFS1007332 START
191400181206      *       RESET-GT-END-DATE
191500181206              (RESET-GT-END-DATE OR RESET-EQ-END-DATE)
191600181206      *RFS1007332 END
191700180618                MOVE ZEROS TO WS-GBV-CHANGE
191800180706                MOVE ZEROS TO WS-NDV-CHANGE
191900180706                MOVE ZEROS TO WS-ORIG-UNIT-BAL
192000180618           END-IF
192100180618      *RFS177152 END
192200180618
192300050602           IF PURCHASE-TRANSACTION
192400161103159011     OR lc_DistrOptionCode = lc_C
19250005060226151         OR EXCLUDE-TRANS-FLAG = "Y"
192600050602              PERFORM UPDATE-ACC-CON-INV-ARRAY THRU UACIA-EXIT
192700160819              MOVE "Y" TO WS-READ-NEXT-TRANS
192800050602              GO TO RG4T-EXIT
192900050602           END-IF.
193000050602
193100050602           COMPUTE WS-TRANS-TRADE-AMOUNT ROUNDED =
193200050602                   ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS *
193300050602                   UNIT-PRICE OF TRANS.
193400050602           MOVE TRADE-DATE OF TRANS TO WS-TRANS-TRADE-DATE.
193500050602           MOVE UNIT-PRICE OF TRANS TO WS-TRANS-UNIT-PRICE.
193600050602           MOVE INVESTMENT-CODE OF TRANS TO WS-TRANS-INVESTMENT-CODE.
193700160819
193800050602           PERFORM GET-CONTRACT-INV-MARKET-VALUE THRU GCIMV-EXIT.
193900050602
19400005060213306 *    IF SELL-TRANSACTION
19410005060213306 *       IF WS-CONT-MV-BEF-TOTAL NOT = 0
19420005060213306 *          COMPUTE WS-NDV-CHANGE ROUNDED = WS-CONT-NDV-BEF-TOTAL *
19430005060213306 *                  WS-TRANS-TRADE-AMOUNT / WS-CONT-MV-BEF-TOTAL
19440005060213306 *
19450005060213306 *          COMPUTE WS-GBV-CHANGE ROUNDED = WS-CONT-GBV-BEF-TOTAL *
19460005060213306 *                  WS-TRANS-TRADE-AMOUNT / WS-CONT-MV-BEF-TOTAL
19470005060213306 *       ELSE
19480005060213306 *          MOVE WS-TRANS-TRADE-AMOUNT TO WS-NDV-CHANGE
19490005060213306 *                                        WS-GBV-CHANGE
19500005060213306 *       END-IF
19510005060213306 *    END-IF.
195200160819
195300050602           IF STATUS-RVS
195400050602              SUBTRACT WS-NDV-CHANGE FROM WS-CONT-NDV-BEF-TOTAL
195500050602                GIVING WS-CONT-NDV-AFTER
195600050602              SUBTRACT WS-GBV-CHANGE FROM WS-CONT-GBV-BEF-TOTAL
195700050602                GIVING WS-CONT-GBV-AFTER
195800180702177152        SUBTRACT WS-GDV-CHANGE FROM WS-CONT-GDV-BEF-TOTAL
195900180702177152          GIVING WS-CONT-GDV-AFTER
196000050602           ELSE
196100050602              ADD WS-NDV-CHANGE TO WS-CONT-NDV-BEF-TOTAL
196200050602                  GIVING WS-CONT-NDV-AFTER
196300050602              ADD WS-GBV-CHANGE TO WS-CONT-GBV-BEF-TOTAL
196400050602                  GIVING WS-CONT-GBV-AFTER
196500180702177152        ADD WS-GDV-CHANGE TO WS-CONT-GDV-BEF-TOTAL
196600180702177152            GIVING WS-CONT-GDV-AFTER
196700050602           END-IF.
196800050602
196900050602           PERFORM RECALC-FINAL-CONTRACT-GBV THRU RFCG-EXIT.
197000050602
197100050602           MOVE "N" TO WS-NDV-DIFF-FLAG WS-GBV-DIFF-FLAG.
197200180702177152     MOVE "N" TO WS-GDV-DIFF-FLAG.
197300050602           MOVE 0 TO WS-NDV-DIFF-AMOUNT WS-GBV-DIFF-AMOUNT.
197400180702177152     MOVE 0 TO WS-GDV-DIFF-AMOUNT.
197500050602
197600050602           IF SELL-TRANSACTION
197700050602              GO TO RG4T-EXIT
197800050602           END-IF.
197900050602
198000050602           IF WS-CONT-NDV-AFTER NOT = WS-CONT-NDV-AFT-TOTAL
198100050602              MOVE "Y" TO WS-NDV-DIFF-FLAG
198200050602              SUBTRACT WS-CONT-NDV-AFT-TOTAL FROM WS-CONT-NDV-AFTER
198300050602                GIVING WS-NDV-DIFF-AMOUNT
198400050602           END-IF.
198500050602
198600050602           IF WS-CONT-GBV-AFTER NOT = WS-CONT-GBV-AFT-TOTAL
198700050602              MOVE "Y" TO WS-GBV-DIFF-FLAG
198800050602              SUBTRACT WS-CONT-GBV-AFT-TOTAL FROM WS-CONT-GBV-AFTER
198900050602                GIVING WS-GBV-DIFF-AMOUNT
199000050602           END-IF.
199100050602
199200180618      *RFS177152 START
199300180618           IF WS-CONT-GDV-AFTER NOT = WS-CONT-GDV-AFT-TOTAL
199400180618              MOVE "Y" TO WS-GDV-DIFF-FLAG
199500180618              SUBTRACT WS-CONT-GDV-AFT-TOTAL FROM WS-CONT-GDV-AFTER
199600180618                GIVING WS-GDV-DIFF-AMOUNT
199700180618           END-IF.
199800180618      *RFS177152 END
199900180618
200000050602           IF NDV-DIFFERENCE-FOUND OR GBV-DIFFERENCE-FOUND
200100180618177152        OR GDV-DIFFERENCE-FOUND
200200050602              GO TO RG4T-0010
200300050602           END-IF.
200400050602
200500050602           GO TO RG4T-EXIT.
200600050602
200700050602       RG4T-0010.
200800050602           SET ACIIDX TO 1.
200900050602           SET ACIIDX DOWN BY 1.
201000050602
201100050602       RG4T-NEXT.
201200210928           SET ACIIDX UP BY 1.
201201211007
201202211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
201203211007111744        GO TO RG4T-EXIT
201204211007111744     END-IF
201205211007
201300050602           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
201400050602              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
201401211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " " OR
201402211007111744        ACIIDX > WS-ARRAY-ELEMENTS
201600050602              GO TO RG4T-EXIT
201700210817           END-IF.
201800050602
201900050602           IF WS-ARRAY-NET-DEP-VALUE(ACIIDX) = 0 OR
202000050602              WS-ARRAY-GUAR-BASE-VALUE(ACIIDX) = 0
202100050602              GO TO RG4T-NEXT
202200050602           END-IF.
202300050602
202400050602           IF NDV-DIFFERENCE-FOUND
202500050602              ADD WS-NDV-DIFF-AMOUNT TO WS-ARRAY-NET-DEP-VALUE(ACIIDX)
202600050602           END-IF.
202700050602
202800050602           IF GBV-DIFFERENCE-FOUND
202900050602              ADD WS-GBV-DIFF-AMOUNT TO WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
203000050602           END-IF.
203100050602
203200180618      *RFS177152 START
203300180618           IF GDV-DIFFERENCE-FOUND
203400180618              ADD WS-GDV-DIFF-AMOUNT TO
203500180618                  WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
203600180618           END-IF.
203700180618      *RFS177152 END
203800180618
203900050602       RG4T-EXIT.
204000050602           EXIT.
204100050602      /
204200050602       GET-TRANS-RVS-OFFSET.
204300050602
204400050602           INITIALIZE MFATRNTGP OF TRANS-TARGET-REC.
204500050602           MOVE CURR-PLACEMENT-DATE
204600050602             TO PLACEMENT-DATE-2 OF TRANS-TARGET.
204700050602           MOVE CURR-TRANS-NO
204800050602             TO TRANS-NO-2 OF TRANS-TARGET.
204900050602           MOVE ZEROES
205000050602             TO PLACEMENT-DATE OF TRANS-TARGET
205100050602                TRANS-NO OF TRANS-TARGET.
205200050602
205300050602           START TRANS-TARGET
205400050602                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
205500050602                 INVALID KEY
205600050602                 MOVE "Y" TO WS-READ-NEXT-TRANS
205700050602                 GO TO GTRO-EXIT.
205800050602
205900050602       GTRO-0010.
206000050602           READ TRANS-TARGET NEXT RECORD
206100050602                AT END
206200050602                MOVE "Y" TO WS-READ-NEXT-TRANS
206300050602                GO TO GTRO-EXIT.
206400050602
206500050602           IF CURR-PLACEMENT-DATE NOT =
206600050602              PLACEMENT-DATE-2 OF TRANS-TARGET OR
206700050602              CURR-TRANS-NO NOT =
206800050602              TRANS-NO-2 OF TRANS-TARGET
206900050602              MOVE "Y" TO WS-READ-NEXT-TRANS
207000050602              GO TO GTRO-EXIT
207100050602           END-IF.
207200050602
207300050602           IF RELATIONSHIP-TYPE OF TRANS-TARGET NOT = "RVS"
207400050602              GO TO GTRO-0010
207500050602           END-IF.
207600050602
207700050602           INITIALIZE MFATRNP OF TRANS-RVS.
207800050602           MOVE PLACEMENT-DATE OF TRANS-TARGET
207900050602             TO PLACEMENT-DATE OF TRANS-RVS.
208000050602           MOVE TRANS-NO OF TRANS-TARGET
208100050602             TO TRANS-NO OF TRANS-RVS.
208200050602
208300050602           READ TRANS-RVS
208400050602                INVALID KEY
208500050602                MOVE "Y" TO WS-READ-NEXT-TRANS
208600050602                GO TO GTRO-EXIT
208700050602           END-READ.
208800050602
208900050602           IF PROCESS-DATE OF TRANS-RVS > PARM-END-DATE
209000050602              MOVE "Y" TO WS-READ-NEXT-TRANS
209100050602              GO TO GTRO-EXIT
209200050602           END-IF.
209300050602
209400050602           MOVE "N" TO WS-READ-NEXT-TRANS.
209500050602
209600050602       GTRO-EXIT.
209700050602           EXIT.
209800050602      /
209900050602       UPDATE-ACC-CON-INV-ARRAY.
210000050602
210100050602           SET ACIIDX TO 1.
210200050602
210300050602           SEARCH WS-ACC-CON-INV-ARRAY VARYING ACIIDX
210400050602             WHEN WS-ARRAY-ACCOUNT-NO(ACIIDX) = CURR-ACCOUNT-NO AND
210500050602                  WS-ARRAY-CONTRACT-NO(ACIIDX) = CURR-CONTRACT-NO AND
210600050602                  WS-ARRAY-INVESTMENT-CODE(ACIIDX)=CURR-INVESTMENT-CODE
210700050602                  GO TO UACIA-0010
210800160822             WHEN WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
210900050602                  WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
211000050602                  WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "
211100050602                  GO TO UACIA-EXIT
211200050602           END-SEARCH.
211300050602
211400050602       UACIA-0010.
211500050602
211600050602           IF STATUS-RVS
211700161103159011     OR lc_DistrOptionCode = lc_C
211800050602              GO TO UACIA-0020
211900050602           END-IF.
212000050602
212100050602           MOVE "N" TO WS-UNITS-ZERO-BALANCE
212200180706177152                 WS-PRFRM-GDV-BALANCE
212300050602                       WS-PRFRM-NDV-BALANCE  WS-PRFRM-GBV-BALANCE.
212400050602
21250005060226151      IF EXCLUDE-TRANS-FLAG = "Y"
21260005060226151         AND REDEMPTION-TRANSACTION
21270005060226151         ADD WS-ORIG-UNIT-BAL
21280005060226151          TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
21290005060226151      ELSE
213000050602           SUBTRACT WS-ORIG-UNIT-BAL
213100050602               FROM WS-ARRAY-CURR-UNIT-BAL(ACIIDX).
213200050602           IF WS-ARRAY-CURR-UNIT-BAL(ACIIDX) IS NEGATIVE OR
213300050602              WS-ARRAY-CURR-UNIT-BAL(ACIIDX) = 0
213400050602              MOVE ZEROES TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
213500050602R17274        MOVE "Y" TO WS-UNITS-ZERO-BALANCE
213600050602           END-IF.
213700050602
213800050602           SUBTRACT WS-NDV-CHANGE FROM WS-ARRAY-NET-DEP-VALUE(ACIIDX).
213900050602           MOVE WS-ARRAY-NET-DEP-VALUE(ACIIDX) TO WS-NDV-REMAIN-AMT.
214000050602           IF WS-ARRAY-NET-DEP-VALUE(ACIIDX) IS NEGATIVE
214100050602R17274*       MOVE ZEROES TO WS-ARRAY-NET-DEP-VALUE(ACIIDX)
214200050602R17274        MOVE "Y" TO WS-PRFRM-NDV-BALANCE
214300050602           END-IF.
214400050602
214500050602           SUBTRACT WS-GBV-CHANGE FROM WS-ARRAY-GUAR-BASE-VALUE(ACIIDX).
214600050602           MOVE WS-ARRAY-GUAR-BASE-VALUE(ACIIDX) TO WS-GBV-REMAIN-AMT.
214700050602           IF WS-ARRAY-GUAR-BASE-VALUE(ACIIDX) IS NEGATIVE
214800050602R17274*       MOVE ZEROES TO WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
214900050602R17274        MOVE "Y" TO WS-PRFRM-GBV-BALANCE
215000050602           END-IF.
215100050602
215200180706      *177152 START
215300180704           SUBTRACT WS-GDV-CHANGE FROM WS-ARRAY-GUAR-DTH-VALUE(ACIIDX) .
215400180704           MOVE WS-ARRAY-GUAR-DTH-VALUE(ACIIDX) TO WS-GDV-REMAIN-AMT.
215500180704           IF WS-ARRAY-GUAR-DTH-VALUE(ACIIDX) IS NEGATIVE
215600180704              MOVE "Y" TO WS-PRFRM-GDV-BALANCE
215700180704           END-IF.
215800180706      *177152 END
215900180704
216000050602R17274     IF PRFRM-NDV-BALANCE OR PRFRM-GBV-BALANCE OR
216100180706177152        PRFRM-GDV-BALANCE OR
216200050602R17274       (UNITS-ZERO-BALANCE AND
216300180704R17639       (WS-NDV-REMAIN-AMT NOT = 0 OR WS-GBV-REMAIN-AMT NOT = 0
216400180706177152        OR WS-GDV-REMAIN-AMT NOT = 0))
216500050602R17274        PERFORM BALANCE-NDV-GBV-ARRAY THRU BNGA-EXIT
216600050602R17274     END-IF.
216700050602
216800050602           GO TO UACIA-EXIT.
216900050602
217000050602       UACIA-0020.
217100050602           ADD WS-NDV-CHANGE TO WS-ARRAY-NET-DEP-VALUE(ACIIDX).
217200050602           ADD WS-GBV-CHANGE TO WS-ARRAY-GUAR-BASE-VALUE(ACIIDX).
217300050602           ADD WS-ORIG-UNIT-BAL TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX).
217400180618177152     ADD WS-GDV-CHANGE TO WS-ARRAY-GUAR-DTH-VALUE(ACIIDX).
217500050602
217600050602       UACIA-EXIT.
217700050602           EXIT.
217800050602      /
217900050602*******RFS 17274 - BEGIN
218000050602******* This routine will perform the balancing of NDV and GBV in the
218100050602******* array in case zero units were calculated and there is still
218200050602******* an amount left in the NDV/GBV bucket AND a negative amount
218300050602******* was calculated in the NDV/GBV bucket in the above routine.
218400050602       BALANCE-NDV-GBV-ARRAY.
218500050602
218600050602           SET ACIIDX2 TO 1.
218700050602           SET ACIIDX2 DOWN BY 1.
218800050602
218900050602       BNGA-NEXT.
219000050602
219100050602           SET ACIIDX2 UP BY 1.
219200210817
219201211007111744     IF ACIIDX2 > WS-ARRAY-ELEMENTS
219202211007111744        GO TO BNGA-EXIT
219203211007111744     END-IF
219204211007
219300050602           IF WS-ARRAY-ACCOUNT-NO(ACIIDX2) = 0 OR
219400050602              WS-ARRAY-CONTRACT-NO(ACIIDX2) = 0 OR
219401211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX2) = " "  OR
219402211007111744        ACIIDX2 > WS-ARRAY-ELEMENTS
219600050602              GO TO BNGA-EXIT
219700210817           END-IF.
219800050602
219900050602           IF WS-ARRAY-CURR-UNIT-BAL(ACIIDX2) = 0
220000050602              GO TO BNGA-NEXT
220100050602           END-IF.
220200050602
220300050602           MOVE WS-ARRAY-NET-DEP-VALUE(ACIIDX2) TO WS-TEMP-NDV.
220400050602           ADD WS-NDV-REMAIN-AMT TO WS-TEMP-NDV.
220500050602           IF WS-TEMP-NDV IS NEGATIVE
220600050602              GO TO BNGA-NEXT
220700050602           END-IF.
220800050602
220900050602           MOVE WS-ARRAY-GUAR-BASE-VALUE(ACIIDX2) TO WS-TEMP-GBV.
221000050602           ADD WS-GBV-REMAIN-AMT TO WS-TEMP-GBV.
221100050602           IF WS-TEMP-GBV IS NEGATIVE
221200050602              GO TO BNGA-NEXT
221300050602           END-IF.
221400050602
221500180706      *177152 START
221600180704           MOVE WS-ARRAY-GUAR-DTH-VALUE(ACIIDX2) TO WS-TEMP-GDV.
221700180704           ADD WS-GDV-REMAIN-AMT TO WS-TEMP-GDV.
221800180704           IF WS-TEMP-GDV IS NEGATIVE
221900180704              GO TO BNGA-NEXT
222000180704           END-IF.
222100180704           ADD WS-GDV-REMAIN-AMT TO WS-ARRAY-GUAR-DTH-VALUE(ACIIDX2).
222200180706      *177152 END
222300180704
222400050602           ADD WS-NDV-REMAIN-AMT TO WS-ARRAY-NET-DEP-VALUE(ACIIDX2).
222500050602           ADD WS-GBV-REMAIN-AMT TO WS-ARRAY-GUAR-BASE-VALUE(ACIIDX2).
222600050602
222700050602           MOVE ZEROES TO WS-ARRAY-NET-DEP-VALUE(ACIIDX)
222800180706177152                    WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
222900180704                          WS-ARRAY-GUAR-BASE-VALUE(ACIIDX).
223000050602
223100050602       BNGA-EXIT.
223200050602           EXIT.
223300050602      /
223400050602       GET-CONTRACT-INV-MARKET-VALUE.
223500050602
223600050602           SET ACIIDX TO 1.
223700050602           SET ACIIDX DOWN BY 1.
223800050602
223900050602       GCIMV-NEXT.
224000210928           SET ACIIDX UP BY 1.
224001211007
224002211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
224003211007111744        GO TO GCIMV-EXIT
224004211007111744     END-IF
224005211007
224100050602           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
224200050602              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
224201211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "  OR
224202211007111744        ACIIDX2 > WS-ARRAY-ELEMENTS
224400050602              GO TO GCIMV-EXIT
224500210817           END-IF.
224600050602
224700050602           MOVE WS-ARRAY-INVESTMENT-CODE(ACIIDX) TO WS-INVEST-CODE.
224800050602           PERFORM GET-INVESTMENT-CURRENCY THRU GIC-EXIT.
224900050602
225000050602           IF WS-ARRAY-INVESTMENT-CODE(ACIIDX) =
225100050602              WS-TRANS-INVESTMENT-CODE
225200050602              MOVE WS-TRANS-UNIT-PRICE TO WS-CONT-INV-UNIT-PRICE
225300050602              GO TO GCIMV-0010
225400050602           ELSE
225500050602              IF WS-ARRAY-CURR-UNIT-BAL(ACIIDX) = 0
225600050602                 MOVE 0 TO WS-CONT-INV-UNIT-PRICE
225700050602                 MOVE 1.0 TO WS-CONT-INV-EXCH-RATE
225800050602                 GO TO GCIMV-0020
225900050602              END-IF
226000050602           END-IF.
226100050602
226200050602           MOVE WS-ARRAY-INVESTMENT-CODE(ACIIDX)
226300050602             TO WS-CONT-INVESTMENT-CODE.
226400050602           PERFORM GET-CONTRACT-INV-UNIT-PRICE THRU GCIUP-EXIT.
226500050602
226600050602       GCIMV-0010.
226700050602
226800050602           IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
226900050602              PERFORM GET-CONT-INV-EXCH-RATE THRU GCIER-EXIT
227000050602           ELSE
227100050602              MOVE 1.0 TO WS-CONT-INV-EXCH-RATE
227200050602           END-IF.
227300050602
227400050602       GCIMV-0020.
227500050602           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
227600050602              COMPUTE WS-ARRAY-INV-MV-BEF(ACIIDX) ROUNDED =
227700050602                 WS-ARRAY-CURR-UNIT-BAL(ACIIDX) * WS-CONT-INV-UNIT-PRICE
227800050602           ELSE
227900050602              COMPUTE WS-ARRAY-INV-MV-BEF(ACIIDX) ROUNDED =
228000050602                 WS-ARRAY-CURR-UNIT-BAL(ACIIDX) *
228100050602                 WS-CONT-INV-UNIT-PRICE / WS-CONT-INV-EXCH-RATE
228200050602           END-IF.
228300050602
228400050602           IF WS-ARRAY-INVESTMENT-CODE(ACIIDX) =
228500050602              WS-TRANS-INVESTMENT-CODE
228600050602              IF STATUS-RVS
228700050602                 SUBTRACT ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
228800050602                     FROM WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
228900050602              ELSE
229000050602                 ADD ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
229100050602                     TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
229200050602              END-IF
229300050602
229400050602              IF CURRENCY-DDS OF INVESTMENT NOT = UNITRAX-BASE-CURRENCY
229500050602                 COMPUTE WS-TRANS-TRADE-AMOUNT ROUNDED =
229600050602                         WS-TRANS-TRADE-AMOUNT / WS-CONT-INV-EXCH-RATE
229700050602              END-IF
229800050602           END-IF.
229900050602
230000050602           IF CURRENCY-DDS OF INVESTMENT = UNITRAX-BASE-CURRENCY
230100050602              COMPUTE WS-ARRAY-INV-MV-AFT(ACIIDX) ROUNDED =
230200050602                 WS-ARRAY-CURR-UNIT-BAL(ACIIDX) * WS-CONT-INV-UNIT-PRICE
230300050602           ELSE
230400050602              COMPUTE WS-ARRAY-INV-MV-AFT(ACIIDX) ROUNDED =
230500050602                 WS-ARRAY-CURR-UNIT-BAL(ACIIDX) *
230600050602                 WS-CONT-INV-UNIT-PRICE / WS-CONT-INV-EXCH-RATE
230700050602           END-IF.
230800050602
230900050602           ADD WS-ARRAY-INV-MV-BEF(ACIIDX) TO WS-CONT-MV-BEF-TOTAL.
231000050602           ADD WS-ARRAY-INV-MV-AFT(ACIIDX) TO WS-CONT-MV-AFT-TOTAL.
231100050602           ADD WS-ARRAY-NET-DEP-VALUE(ACIIDX)
231200050602               TO WS-CONT-NDV-BEF-TOTAL.
231300050602           ADD WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
231400050602               TO WS-CONT-GBV-BEF-TOTAL.
231500180702177152     ADD WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
231600180702177152         TO WS-CONT-GDV-BEF-TOTAL.
231700050602
231800050602           MOVE CURRENCY-DDS OF INVESTMENT
231900050602             TO WS-ARRAY-INV-CURR-CODE(ACIIDX).
232000050602           MOVE WS-CONT-INV-EXCH-RATE
232100050602             TO WS-ARRAY-INV-EXCH-RATE(ACIIDX).
232200050602
232300050602           ADD 1 TO WS-CONT-INV-ARRAY-COUNT.
232400050602
232500050602           GO TO GCIMV-NEXT.
232600050602
232700050602       GCIMV-EXIT.
232800050602           EXIT.
232900050602      /
233000050602       RECALC-FINAL-CONTRACT-GBV.
233100050602
233200050602           INITIALIZE WS-CONT-INV-COUNT
233300050602                      WS-INV-NDV-PERCENT-TOTAL
233400050602                      WS-INV-GBV-PERCENT-TOTAL
233500050602                      WS-CONT-NDV-AFT-TOTAL
233600180702177152                WS-CONT-GDV-AFT-TOTAL
233700180627                      WS-CONT-GBV-AFT-TOTAL.
233800050602
233900050602           SET ACIIDX TO 1.
234000050602           SET ACIIDX DOWN BY 1.
234100050602
234200050602       RFCG-NEXT.
234300050602           SET ACIIDX UP BY 1.
234400050602
234401211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
234402211007111744        GO TO RFCG-EXIT
234403211007111744     END-IF
234404211007
234500050602           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
234600050602              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
234601211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "  OR
234602211007111744        ACIIDX > WS-ARRAY-ELEMENTS
234800050602              GO TO RFCG-EXIT
234900210817           END-IF.
235000050602
235100050602           ADD 1 TO WS-CONT-INV-COUNT.
235200050602
235300050602           IF WS-CONT-MV-AFT-TOTAL NOT = 0
235400050602              COMPUTE WS-INV-NDV-PERCENT ROUNDED =
235500050602                      WS-ARRAY-INV-MV-AFT(ACIIDX) / WS-CONT-MV-AFT-TOTAL
235600050602              COMPUTE WS-INV-GBV-PERCENT ROUNDED =
235700050602                      WS-ARRAY-INV-MV-AFT(ACIIDX) / WS-CONT-MV-AFT-TOTAL
235800050602           ELSE
235900050602              MOVE 0 TO WS-INV-NDV-PERCENT
236000050602                        WS-INV-GBV-PERCENT
236100050602           END-IF.
236200050602           ADD WS-INV-NDV-PERCENT TO WS-INV-NDV-PERCENT-TOTAL.
236300050602           ADD WS-INV-GBV-PERCENT TO WS-INV-GBV-PERCENT-TOTAL.
236400050602
236500050602           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
236600050602              WS-INV-GBV-PERCENT-TOTAL NOT = 1.000 AND
236700050602              WS-INV-GBV-PERCENT-TOTAL NOT = 0
236800050602              SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
236900050602                       GIVING WS-DUMMY-PERCENT
237000050602              ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
237100050602                                      WS-INV-GBV-PERCENT-TOTAL
237200050602           ELSE
237300050602              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
237400050602                (WS-INV-GBV-PERCENT-TOTAL = 0.999 OR
237500050602                 WS-INV-GBV-PERCENT-TOTAL > 1.000)
237600050602                 SUBTRACT WS-INV-GBV-PERCENT-TOTAL FROM 1.000
237700050602                          GIVING WS-DUMMY-PERCENT
237800050602                 ADD WS-DUMMY-PERCENT TO WS-INV-GBV-PERCENT
237900050602                                         WS-INV-GBV-PERCENT-TOTAL
238000050602              END-IF
238100050602           END-IF.
238200050602
238300050602           COMPUTE WS-INV-GBV-AFT ROUNDED =
238400050602                   WS-CONT-GBV-AFTER * WS-INV-GBV-PERCENT.
238500180702177152     COMPUTE WS-INV-GDV-AFT ROUNDED =
238600180702177152             WS-CONT-GDV-AFTER * WS-INV-GBV-PERCENT.
238700050602
238800050602           IF WS-CONT-INV-COUNT = WS-CONT-INV-ARRAY-COUNT AND
238900050602              WS-INV-NDV-PERCENT-TOTAL NOT = 1.000 AND
239000050602              WS-INV-NDV-PERCENT-TOTAL NOT = 0
239100050602              SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
239200050602                       GIVING WS-DUMMY-PERCENT
239300050602              ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
239400050602                                      WS-INV-NDV-PERCENT-TOTAL
239500050602           ELSE
239600050602              IF WS-CONT-INV-COUNT NOT = WS-CONT-INV-ARRAY-COUNT AND
239700050602                (WS-INV-NDV-PERCENT-TOTAL = 0.999 OR
239800050602                 WS-INV-NDV-PERCENT-TOTAL > 1.000)
239900050602                 SUBTRACT WS-INV-NDV-PERCENT-TOTAL FROM 1.000
240000050602                          GIVING WS-DUMMY-PERCENT
240100050602                 ADD WS-DUMMY-PERCENT TO WS-INV-NDV-PERCENT
240200050602                                         WS-INV-NDV-PERCENT-TOTAL
240300050602              END-IF
240400050602           END-IF.
240500050602
240600050602           COMPUTE WS-INV-NDV-AFT ROUNDED =
240700050602                   WS-CONT-NDV-AFTER * WS-INV-NDV-PERCENT.
240800050602
240900050602           MOVE WS-INV-NDV-AFT TO WS-ARRAY-NET-DEP-VALUE(ACIIDX).
241000050602           MOVE WS-INV-GBV-AFT TO WS-ARRAY-GUAR-BASE-VALUE(ACIIDX).
241100180702177152     MOVE WS-INV-GDV-AFT TO WS-ARRAY-GUAR-DTH-VALUE(ACIIDX).
241200050602
241300050602           ADD WS-INV-NDV-AFT TO WS-CONT-NDV-AFT-TOTAL.
241400050602           ADD WS-INV-GBV-AFT TO WS-CONT-GBV-AFT-TOTAL.
241500180702177152     ADD WS-INV-GDV-AFT TO WS-CONT-GDV-AFT-TOTAL.
241600050602
241700050602           GO TO RFCG-NEXT.
241800050602
241900050602       RFCG-EXIT.
242000050602           EXIT.
242100050602      /
242200050602       LOAD-FINAL-PARMS-ARRAY.
242300050602
242301211007111744        INITIALIZE ln_InvArraySize
242302211007111744        MOVE ln_InvArrayInitialSize TO ln_InvArraySize
242400050602           INITIALIZE PARM-ACC-CON-INV-ARRAY-DEF.
242401211007111744     PERFORM VARYING IVS-CNT1 FROM 1 BY 1
242402211007111744             UNTIL IVS-CNT1 > ln_InvArraySize
242403211007111744     INITIALIZE PARM-ACCOUNT-NUMBER (IVS-CNT1)
242404211007111744                PARM-CONTRACT-NUMBER(IVS-CNT1)
242405211007111744                PARM-INVESTMENT-CODE(IVS-CNT1)
242406211007111744                PARM-NET-DEP-VALUE (IVS-CNT1)
242407211007111744                PARM-GUAR-BASE-VALUE(IVS-CNT1)
242408211007111744                PARM-CURR-UNIT-BAL (IVS-CNT1)
242409211007111744                PARM-GUAR-DTH-VALUE(IVS-CNT1)
242410211007111744     END-PERFORM
242500050602
242600050602           SET ACIIDX TO 1.
242700050602           SET ACIIDX DOWN BY 1.
242800050602
242900050602           SET PACIIDX TO 1.
243000050602           SET PACIIDX DOWN BY 1.
243100050602
243200050602       LOAD-NEXT.
243300050602           SET ACIIDX UP BY 1.
243400050602           SET PACIIDX UP BY 1.
243500050602
243501211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
243502211007111744        GO TO LFPA-EXIT
243503211007111744     END-IF
243504211007
243600050602           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
243700050602              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
243701211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " "  OR
243702211007111744        ACIIDX > WS-ARRAY-ELEMENTS
243900050602              GO TO LFPA-EXIT
244000210817           END-IF.
244100050602
244200050602           MOVE WS-ARRAY-ACCOUNT-NO(ACIIDX)
244300050602             TO PARM-ACCOUNT-NUMBER(PACIIDX).
244400050602           MOVE WS-ARRAY-CONTRACT-NO(ACIIDX)
244500050602             TO PARM-CONTRACT-NUMBER(PACIIDX).
244600050602           MOVE WS-ARRAY-INVESTMENT-CODE(ACIIDX)
244700050602             TO PARM-INVESTMENT-CODE(PACIIDX).
244800050602           MOVE WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
244900050602             TO PARM-CURR-UNIT-BAL(PACIIDX).
245000050602           MOVE WS-ARRAY-NET-DEP-VALUE(ACIIDX)
245100050602             TO PARM-NET-DEP-VALUE(PACIIDX).
245200050602           MOVE WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
245300050602             TO PARM-GUAR-BASE-VALUE(PACIIDX).
245400180627      *RFS177152 START
245500180627           IF PARM-GUAR-DTH-RULE = "N"
245600180627              MOVE WS-ARRAY-GUAR-BASE-VALUE(ACIIDX)
245700180627                   TO PARM-GUAR-DTH-VALUE(PACIIDX)
245800180627           ELSE
245900180627              MOVE WS-ARRAY-GUAR-DTH-VALUE(ACIIDX)
246000180627                   TO PARM-GUAR-DTH-VALUE(PACIIDX)
246100180627           END-IF.
246200180627      *RFS177152 END
246300050602
246400050602           GO TO LOAD-NEXT.
246500050602
246600050602       LFPA-EXIT.
246700050602           EXIT.
246800050602      /
246900050602       GET-CONTRACT-INV-UNIT-PRICE.
247000050602           MOVE "N" TO WS-PRICE-FOUND.
247100050602
247200050602           MOVE WS-CONT-INVESTMENT-CODE
247300050602             TO INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE.
247400050602           MOVE WS-TRANS-TRADE-DATE
247500050602             TO TRADE-DATE OF INVESTMENT-UNIT-PRICE.
247600050602
247700050602           START INVESTMENT-UNIT-PRICE
247800050602                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
247900050602                 INVALID KEY
248000050602                 GO TO GCIUP-EXIT.
248100050602
248200050602       GCIUP-0010.
248300050602           READ INVESTMENT-UNIT-PRICE NEXT RECORD
248400050602                AT END
248500050602                GO TO GCIUP-EXIT.
248600050602
248700050602           IF WS-CONT-INVESTMENT-CODE NOT =
248800050602              INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE OR
248900050602              WS-TRANS-TRADE-DATE NOT =
249000050602              TRADE-DATE OF INVESTMENT-UNIT-PRICE
249100050602              GO TO GCIUP-0020
249200050602           END-IF.
249300050602
249400050602           IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE NOT = " "
249500050602              GO TO GCIUP-0010
249600050602           END-IF.
249700050602
249800050602           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
249900050602             TO WS-CONT-INV-UNIT-PRICE.
250000050602
250100050602           MOVE "Y" TO WS-PRICE-FOUND.
250200050602
250300050602       GCIUP-0020.
250400050602
250500050602           IF PRICE-FOUND
250600050602              GO TO GCIUP-EXIT
250700050602           END-IF.
250800050602
250900050602           READ INVESTMENT-UNIT-PRICE PRIOR RECORD
251000050602                AT END
251100050602                GO TO GCIUP-EXIT.
251200050602
251300050602           IF WS-CONT-INVESTMENT-CODE NOT =
251400050602              INVESTMENT-CODE OF INVESTMENT-UNIT-PRICE
251500050602              GO TO GCIUP-EXIT
251600050602           END-IF.
251700050602
251800050602           IF DISTRIBUTION-FLAG OF INVESTMENT-UNIT-PRICE NOT = " "
251900050602              GO TO GCIUP-0020
252000050602           END-IF.
252100050602
252200050602           MOVE UNIT-PRICE OF INVESTMENT-UNIT-PRICE
252300050602             TO WS-CONT-INV-UNIT-PRICE.
252400050602
252500050602           MOVE "Y" TO WS-PRICE-FOUND.
252600050602
252700050602       GCIUP-EXIT.
252800050602           EXIT.
252900050602      /
253000050602       GET-CONT-INV-EXCH-RATE.
253100050602           MOVE PLACEMENT-DATE OF TRANS
253200050602             TO PLACEMENT-DATE OF TRANS-EXCHANGE-RATE.
253300050602           MOVE TRANS-NO OF TRANS
253400050602             TO TRANS-NO OF TRANS-EXCHANGE-RATE.
253500050602
253600050602           READ TRANS-EXCHANGE-RATE
253700050602                INVALID KEY
253800050602                GO TO GCIER-0010.
253900050602
254000050602           IF CURRENCY-DDS OF INVESTMENT NOT =
254100050602              CURRENCY-DDS OF TRANS-EXCHANGE-RATE
254200050602              GO TO GCIER-0010
254300050602           END-IF.
254400050602
254500050602           IF EXCHANGE-RATE OF TRANS-EXCHANGE-RATE = 0
254600050602              GO TO GCIER-0010
254700050602           END-IF.
254800050602
254900050602           MOVE EXCHANGE-RATE OF TRANS-EXCHANGE-RATE
255000050602             TO WS-CONT-INV-EXCH-RATE.
255100050602
255200050602           GO TO GCIER-EXIT.
255300050602
255400050602       GCIER-0010.
255500050602
255600050602           MOVE WS-TRANS-TRADE-DATE
255700050602             TO TRADE-DATE OF EXCHANGE-RATE-M.
255800050602           MOVE CURRENCY-DDS OF INVESTMENT
255900050602             TO CURRENCY-DDS OF EXCHANGE-RATE-M.
256000050602           MOVE PROG-EXCHANGE-RATE-TYPE
256100050602             TO EXCHANGE-RATE-TYPE OF EXCHANGE-RATE-M.
256200050602
256300050602           READ EXCHANGE-RATE-M
256400050602                INVALID KEY
256500050602                GO TO GCIER-EXIT.
256600050602
256700050602           MOVE EXCHANGE-RATE OF EXCHANGE-RATE-M
256800050602             TO WS-CONT-INV-EXCH-RATE.
256900050602
257000050602       GCIER-EXIT.
257100050602           EXIT.
257200050602      /
257300050602       GET-INVESTMENT-CURRENCY.
257400050602
257500050602           MOVE WS-INVEST-CODE TO INVESTMENT-CODE OF INVESTMENT.
257600050602
257700050602           READ INVESTMENT
257800050602                INVALID KEY
257900050602                GO TO GIC-EXIT
258000050602           END-READ.
258100050602
258200050602           IF GET-LOAD-STRUCTURE
258300050602              MOVE LOAD-STRUCTURE OF INVESTMENT TO WS-LOAD-STRUCTURE
258400050602              MOVE "N" TO WS-GET-LOAD-STRUCTURE
258500050602           END-IF.
258600050602
258700050602       GIC-EXIT.
258800050602           EXIT.
258900050602      /
259000050602       GET-INVESTMENT-CALC-METHOD.
259100050602
259200050602      * RFS24943 - Begin
259300050602           MOVE "N" TO WS-PRE-1999.
259400050602      * RFS24943 - End
259500050602           INITIALIZE MFAINVSGP OF INVESTMENT-SEG-REC.
259600050602           MOVE WS-CALC-INVESTMENT-CODE
259700050602             TO INVESTMENT-CODE OF INVESTMENT-SEG.
259800050602
259900050602           READ INVESTMENT-SEG
260000050602                INVALID KEY
260100050602                MOVE "P" TO WS-CALC-METHOD
260200050602      * RFS 20516 - Start
260300050602      *         GO TO GICM-EXIT.
260400050602                GO TO GICM-SKIP.
260500050602      * RFS 20516 - End
260600050602
260700050602           MOVE CALC-METHOD OF INVESTMENT-SEG TO WS-CALC-METHOD.
260800181015      *RFS1006259 Start
260900181023           INITIALIZE lc_GDVSchedCode, lc_ResetSchedCode.
261000181015           MOVE GDV-SCHED-CODE OF INVESTMENT-SEG
261100181015                TO lc_GDVSchedCode.
261200181023           MOVE RESET-SCHEDULE-CODE OF INVESTMENT-SEG
261300181023                TO lc_ResetSchedCode.
261400181015      *RFS1006259 End
261500050602
261600050602      * RFS 20516 - Start
261700050602       GICM-SKIP.
261800050602           INITIALIZE MFAACCATP OF ACCOUNT-ATT-REC.
261900050602           MOVE CURR-ACCOUNT-NO
262000050602             TO ACCOUNT-NO OF ACCOUNT-ATTRIBUTES.
262100050602           MOVE "PRE99"    TO ACCOUNT-ATTRIBUTE-CODE
262200050602                              OF ACCOUNT-ATTRIBUTES.
262300050602           READ ACCOUNT-ATTRIBUTES
262400050602           NOT INVALID KEY
262500050602               MOVE "S" TO WS-CALC-METHOD
262600050602      * RFS24943 - Begin
262700050602               MOVE "Y" TO WS-PRE-1999
262800050602      * RFS24943 - End
262900050602           INVALID KEY
263000050602               GO TO GICM-EXIT
263100050602           END-READ.
263200050602      * RFS 20516 - End
263300050602
263400050602       GICM-EXIT.
263500050602           EXIT.
263600050602      /
263700050602       RECALC-TRADES-BACKWARDS-STD.
263800050722
263900050722      * RFS24943 - Begin
264000050722      * Initialize Totals  to be calculated int the following pargaphs
264100050722           MOVE 0             TO WS-TOT-GBV-CHANGE
264200050722                                 WS-TOT-NDV-CHANGE
264300180706177152                           WS-TOT-GDV-CHANGE
264400050722      * RFS24943 - End
264500050722
264600050602R15872*    DISPLAY "RECALC-TRADES-BACKWARDS-STD.............".
264700050602           SET ACIIDX TO 1.
264800050602           SET ACIIDX DOWN BY 1.
264900050602
265000050602       RTBS-NEXT-CONT-INV.
265100050602R15872*    DISPLAY "RTBS-NEXT-CONT-INV.................".
265200050602           MOVE "N" TO WS-END-OF-PROCESS.
265300050602           SET ACIIDX UP BY 1.
265301211007111744     IF ACIIDX > WS-ARRAY-ELEMENTS
265302211007111744        GO TO RTBS-EXIT
265303211007111744     END-IF
265304211007
265400050602           IF WS-ARRAY-ACCOUNT-NO(ACIIDX) = 0 OR
265500050602              WS-ARRAY-CONTRACT-NO(ACIIDX) = 0 OR
265501211007              WS-ARRAY-INVESTMENT-CODE(ACIIDX) = " " OR
265502211007111744        ACIIDX > WS-ARRAY-ELEMENTS
265700050602              GO TO RTBS-EXIT
265800210817           END-IF.
265900050602
266000050602      *** RFS 15872  starts
266100050602      *    DISPLAY "WS-ARRAY-ACCOUNT-NO......."
266200050602      *             WS-ARRAY-ACCOUNT-NO(ACIIDX).
266300050602      *    DISPLAY "WS-ARRAY-INVESTMENT-CODE...."
266400050602      *             WS-ARRAY-INVESTMENT-CODE(ACIIDX).
266500050602      *    DISPLAY "WS-AS-AT-DATE...." WS-AS-AT-DATE.
266600050602      *** RFS 15872  ends
266700050602           MOVE WS-ARRAY-ACCOUNT-NO(ACIIDX)
266800050602             TO ACCOUNT-NO OF TRANS-D.
266900050602           MOVE WS-ARRAY-INVESTMENT-CODE(ACIIDX)
267000050602             TO INVESTMENT-CODE OF TRANS-D CURR-INVESTMENT-CODE.
267100050602           MOVE WS-AS-AT-DATE
267200050602             TO PROCESS-DATE OF TRANS-D.
267300050602           MOVE 99
267400050602             TO TRANS-PROC-SEQ-NO OF TRANS-D.
267500131204
267600050602           START TRANS-D
267700050602                 KEY IS NOT LESS THAN EXTERNALLY-DESCRIBED-KEY
267800050602                 INVALID KEY
267900050602                 GO TO RTBS-NEXT-CONT-INV.
268000050602
268100050602       RTBS-NEXT-TRANS.
268200050602           READ TRANS-D NEXT RECORD
268300050602                AT END
268400050602                GO TO RTBS-NEXT-CONT-INV.
268500050602
268600050602           IF CURR-ACCOUNT-NO NOT =
268700050602              ACCOUNT-NO OF TRANS-D OR
268800050602              CURR-INVESTMENT-CODE NOT =
268900050602              INVESTMENT-CODE OF TRANS-D
269000050602              GO TO RTBS-NEXT-CONT-INV
269100050602           END-IF.
269200050602
269300050602           IF END-OF-PROCESS
269400050602R15872*       DISPLAY "IT WENT HERRREEEEEE!!!"
269500050602              GO TO RTBS-NEXT-CONT-INV
269600050602           END-IF.
269700050602
269800050602           MOVE TRANS-TYPE-CODE OF TRANS-D
269900050602             TO TRANS-TYPE-CATEGORY.
270000050602           MOVE TRANS-STATUS-CODE OF TRANS-D
270100050602             TO TRANS-STATUS-CATEGORY.
270200050602           MOVE REVERSE OF TRANS-D
270300050602             TO TRANS-REVERSE-CATEGORY.
270400050602
270500050602           IF TRANS-REVERSED OR
270600050602              NOT HISTORY-REVERSE OR
270700160819      * RFS 159011 - Starts
270800160819      *       NOT VALID-TRANSACTION
270900160819             (NOT VALID-TRANSACTION
271000160819              AND NOT DISTRIBUTION-TRANSACTION)
271100160819              OR  (DISTRIBUTION-TRANSACTION
271200160819              AND lc_DistrOptionCode NOT EQUAL TO 'C')
271300160819      * RFS 159011 - Ends
271400050602R15872*       DISPLAY "IT WENT HERRREEEEEE...2"
271500050602              GO TO RTBS-NEXT-TRANS
271600050602           END-IF.
271700050602
271800050602      * RFS 20516 - Start
271900050602           MOVE ACCOUNT-NO OF TRANS-D
272000050602             TO ACCOUNT-NO OF TRANS.
272100050602           MOVE TRANS-TYPE-CODE OF TRANS-D
272200050602             TO TRANS-TYPE-CODE OF TRANS.
272300050602           MOVE TRANS-ORIGIN-CODE OF TRANS-D
272400050602             TO TRANS-ORIGIN-CODE OF TRANS.
272500050602           MOVE REVERSAL-CODE OF TRANS-D
272600050602             TO REVERSAL-CODE OF TRANS.
272700050602           MOVE "N" TO EXCLUDE-TRANS-FLAG.
272800131204
272900131204      *RFS130148 - Starts.
273000131204           INITIALIZE PLACEMENT-DATE OF TRANS,
273100131204                      TRANS-NO OF TRANS,
273200131212                      INVESTMENT-CODE OF TRANS-D,
273300131212                      CONTR-REDEM-CODE OF TRANS-D.
273400131204      *RFS130148 - Ends.
273500131204
273600210111180708     INITIALIZE WS-PLACEMENTDATE WS-TRANSNO.
273700210111180708     MOVE PLACEMENT-DATE OF TRANS-D  TO WS-PLACEMENTDATE.
273800210111180708     MOVE TRANS-NO OF TRANS-D        TO WS-TRANSNO.
273900050602           PERFORM CHECK-IF-EXCLUDE-TRANSACTION THRU CIET-EXIT.
274000050602           IF EXCLUDE-TRANS-FLAG = "Y"
274100050602              GO TO RTBS-NEXT-TRANS
274200050602           END-IF.
274300050602      * RFS 20516 - End
274400050602
274500050602           MOVE PLACEMENT-DATE OF TRANS-D TO CURR-PLACEMENT-DATE.
274600050602           MOVE TRANS-NO OF TRANS-D TO CURR-TRANS-NO.
274700050602
274800050602           MOVE CURR-PLACEMENT-DATE
274900050602             TO PLACEMENT-DATE OF TRANS-CONTRACT-DETAILS.
275000050602           MOVE CURR-TRANS-NO
275100050602             TO TRANS-NO OF TRANS-CONTRACT-DETAILS.
275200050602           MOVE CURR-CONTRACT-NO
275300050602             TO CONTRACT-NO OF TRANS-CONTRACT-DETAILS.
275400050602
275500050602           READ TRANS-CONTRACT-DETAILS
275600050602                INVALID KEY
275700050602                GO TO RTBS-NEXT-TRANS
275800050602           END-READ.
275900050602
276000050602           IF REVERSED-DDS OF TRANS-CONTRACT-DETAILS = "Y"
276100050602              GO TO RTBS-NEXT-TRANS
276200050602           END-IF.
276300050602
276400050602           MOVE NET-DEPOSIT-VALUE OF TRANS-CONTRACT-DETAILS
276500050602             TO WS-ARRAY-NET-DEP-VALUE(ACIIDX).
276600050602           MOVE GUAR-BASE-VALUE OF TRANS-CONTRACT-DETAILS
276700050602             TO WS-ARRAY-GUAR-BASE-VALUE(ACIIDX).
276800180706177152     MOVE GUAR-DEATH-VALUE OF TRANS-CONTRACT-DETAILS
276900180706177152       TO WS-ARRAY-GUAR-DTH-VALUE(ACIIDX).
277000050602
277100050602      *** RFS 15872  starts
277200050602      *    DISPLAY "PROCESS-DATE OF TRANS-D......"
277300050602      *             PROCESS-DATE OF TRANS-D.
277400050602      *    DISPLAY "PARM-END-DATE...." PARM-END-DATE.
277500050602      *** RFS 15872  ends
277600050602
277700050602           IF PROCESS-DATE OF TRANS-D <= PARM-END-DATE
277800050602              MOVE "Y" TO WS-END-OF-PROCESS
277900050602           END-IF.
278000050602
278100050602           IF NOT END-OF-PROCESS
278200050602              IF PURCHASE-TRANSACTION
278300050602                 SUBTRACT ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
278400050602                     FROM WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
278500050721      * RFS24943 - Begin
278600050722                 COMPUTE WS-TOT-NDV-CHANGE = WS-TOT-NDV-CHANGE -
278700050722                                NDV-CHANGE OF TRANS-CONTRACT-DETAILS
278800050722                 COMPUTE WS-TOT-GBV-CHANGE = WS-TOT-GBV-CHANGE -
278900050722                                GBV-CHANGE OF TRANS-CONTRACT-DETAILS
279000180706177152           COMPUTE WS-TOT-GDV-CHANGE = WS-TOT-GDV-CHANGE -
279100180706177152                          GDV-CHANGE OF TRANS-CONTRACT-DETAILS
279200050721      * RFS24943 - End
279300050602              ELSE
279400050602                 ADD ORIG-UNIT-BAL OF TRANS-CONTRACT-DETAILS
279500050602                  TO WS-ARRAY-CURR-UNIT-BAL(ACIIDX)
279600050721      * RFS24943 - Begin
279700050722                 COMPUTE WS-TOT-NDV-CHANGE = WS-TOT-NDV-CHANGE +
279800050722                                NDV-CHANGE OF TRANS-CONTRACT-DETAILS
279900050722                 COMPUTE WS-TOT-GBV-CHANGE = WS-TOT-GBV-CHANGE +
280000050722                                GBV-CHANGE OF TRANS-CONTRACT-DETAILS
280100180706177152           COMPUTE WS-TOT-GDV-CHANGE = WS-TOT-GDV-CHANGE +
280200180706177152                          GDV-CHANGE OF TRANS-CONTRACT-DETAILS
280300050721      * RFS24943 - End
280400050602              END-IF
280500050602           END-IF.
280600050602
280700050602           GO TO RTBS-NEXT-TRANS.
280800050602
280900050602       RTBS-EXIT.
281000050602           EXIT.
281100181015
281200181015      *RFS1006259 Start
281300181018       GDV-DEPENDENCE-ON-GBV.
281400181024           SET lb_GDVDepOnGBV_Yes TO TRUE.
281500181024           EXEC SQL
281600181023                    SELECT COALESCE(
281700181023                      CASE WHEN d1.status is null
281800181023                            AND d2.status is null
281900181023                            AND d3.reset_type is null
282000181023                           THEN "B"
282100181023                      END, " ")
282200181023                    INTO :lc_GDVSchedCode
282300181023                    FROM mfaaccntp acc
282400181023                    JOIN mfaacconp con
282500181015                      on con.account_no = :PARM-ACCOUNT-NO
282600181015                      and con.contract_no = :PARM-CONTRACT-NO
282700181015                    left outer join mfagdthcsp d1
282800181015                      on d1.gdv_sched_code =
282900181015                          :lc_GDVSchedCode
283000181015                      and d1.start_date <= con.start_date
283100181015                      and d1.end_date >= con.start_date
283200181023                      and (D1.reset_type = "GDV"
283300181023                      or  (D1.reset_type = "GWB"
283400181023                           and D1.multi_type_rule = "2"))
283500181015                      and d1.account_type_code =
283600181015                      acc.account_type_code
283700181023                    LEFT OUTER JOIN mfagdthcsp d2
283800181015                      on d2.gdv_sched_code =
283900181015                          :lc_GDVSchedCode
284000181015                      and d2.start_date <= con.start_date
284100181015                      and d2.end_date >= con.start_date
284200181023                      and (D2.reset_type = "GDV"
284300181023                      or  (D2.reset_type = "GWB"
284400181023                           and D2.multi_type_rule = "2"))
284500181015                      and d2.account_type_code = ""
284600181023                    LEFT OUTER JOIN MFAALWRSTP d3 ON
284700181023                      d3.reset_schedule_code = :lc_ResetSchedCode
284800181023                      AND d3.account_type_code =
284900181023                           acc.account_type_code
285000181023                      AND d3.start_date <= con.start_date
285100181023                      AND d3.end_date   >= con.start_date
285200181023                      AND d3.reset_type = "GBV"
285300181023                      AND d3.multi_type_rule = "1"
285400181023                    Where acc.account_no = :PARM-ACCOUNT-NO
285500181024           END-EXEC.
285600181024           IF lc_GDVSchedCode NOT = "B"
285700181024              SET lb_GDVDepOnGBV_No TO TRUE
285800181024           ELSE
285900181024              SET lb_GDVDepOnGBV_Yes TO TRUE
286000181024           END-IF.
286100181015      *RFS1006259 End
286200181015
286300050602      /
286400050602       COPY CPYEXCLTRN.
286500050602      /
286600050816      * RFS27951 - Begin
286700050816      * ---------------------------------
286800050816        CREATE-INDEXES.
286900050816      * ---------------------------------
287000050816
287100050816      * RFS29392 - Begin
287200050816      * If error happened then just to continue to avoid looping of the
287300050816      *  program.
287400050816           EXEC SQL
287500050816             WHENEVER SQLERROR CONTINUE
287600050816           END-EXEC
287700050816      * RFS29392 - End
287800050816      * Create indexes
287900050816
288000050816           EXEC SQL
288100050816             CREATE UNIQUE INDEX mfatrcodi1
288200050816                              ON mfatrcodp
288300050816                 (Placement_Date,
288400050816                  Trans_No,
288500050816                  Contract_No)
288600050816            END-EXEC
288700050816
288800050816            EXEC SQL
288900050816              CREATE UNIQUE INDEX mfatrcodi2
289000050816                               ON mfatrcodp
289100050816                 (Contract_No,
289200050816                  Placement_Date,
289300050816                  Trans_No)
289400050816            END-EXEC
289500050816
289600050816            EXEC SQL
289700050816              CREATE UNIQUE INDEX mfatrdpsi1
289800050816                               ON mfatrdpsp
289900050816                 (Process_Date DESC,
290000050816                  Proc_Seq_No  DESC)
290100050816            END-EXEC.
290200050816      * RFS27951 - End
290300050816
290400050816      * RFS27951 - Begin
290500050816      * Just move END-JOB paragraph to the end of the program
290600050816      * to be able to continue processing if SQL error happend.
290700050816      * RFS27951 - End
290800050816
290900050816       END-JOB.
291000050816
291100050816           CLOSE ACCOUNT-CONTRACT-INVESTMENT
291200050816                 ACCOUNT-CONTRACT-RESET-D
291300050816                 ACCOUNT-CONTRACT-INV-RESET
291400050816                 ACCOUNT
291500050816                 ACCOUNT-NOMINEE
291600050816                 EXCLUDE-TRANS
291700050816                 ACCOUNT-ATTRIBUTES
291800050816                 TRANS-CONTRACT-DETAILS
291900050816                 INVESTMENT
292000050816                 INVESTMENT-UNIT-PRICE
292100050816                 TRANS-EXCHANGE-RATE
292200050816                 EXCHANGE-RATE-M
292300050816                 CURRENCY-CODE
292400050816                 PROGRAM-EXCHANGE-RATE
292500050816                 TRANS-TARGET
292600050816                 TRANS-RVS
292700050816                 INVESTMENT-SEG
292800050816                 TRANS-D
292900050816R13394           TRANS-GBV-TRANSFER
293000130801110904           INVESTMENT-STRUCTURE-XREF
293100210108180708           TRANS-MISC-DETAILS
293200210329180708           TRANS-REDEM-DETAILS
293300050816                 TRANS.
293400050816
293500050816           IF SQL-FILE-OPEN-BCK
293600050816              EXEC SQL
293700050816              CLOSE SEGSQLBCK
293800050816              END-EXEC
293900050816           END-IF.
294000050816
294100050816       EOJ-EXIT.
294200050816           EXIT.
294300050816      /
294400050602       SQLERRDISPLAY.
294500050602           DISPLAY "PGM: TRCODCALC "
294600050602                   "ERROR: SQLSTATE= " SQLSTATE
294700050602                   " SQLCODE=" SQLCODE
294800050602           IF SQL-FILE-OPEN-BCK
294900050602              EXEC SQL
295000050602              CLOSE SEGSQLBCK
295100050602              END-EXEC
295200050602              MOVE "N" TO WS-SQL-FILE-OPEN-BCK
295300050602           END-IF.
295400050602           PERFORM END-JOB THRU EOJ-EXIT
295500050602           GOBACK.
295600160819
295700160819      * RFS 159011 - Starts
295800160819       FETCH-DISTRIBUTION-TYPE.
295900160819            INITIALIZE  lc_DistrOptionCode.
296000160819
296100160819           EXEC SQL
296200160819                WHENEVER SQLERROR GOTO SQLERRDISPLAY
296300160819           END-EXEC.
296400160819
296500160819           EXEC SQL
296600160819                SELECT COALESCE(DISTR_OPTION_CODE," ")
296700160819                 INTO :lc_DistrOptionCode
296800160819                  FROM MFATRNDDP TRNDDP
296900160819                 WHERE TRNDDP.Placement_date = :ln_PlacementDate
297000160819                  AND  TRNDDP.Trans_NO       = :ln_TransNo
297100160819           END-EXEC
297200160819
297300160819      * RFS 159011 - Ends
